{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparks online speculation and prompts an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-axis-bank-results-weak-banking-shares-falls-2757662-2025-07-18",
      "headline": "Sensex tumbles over 600 points: Why is stock market falling today?The 30-share BSE Sensex tumbled 644.99 points to 81,614.25 around 12:19 pm, while the NSE Nifty 50 fell 191.30 points to 24,920.15. Losses were broad-based, with most of the major sectoral indices in the red. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-fans-turn-theatres-into-concert-watch-viral-video-2758336-2025-07-19",
      "headline": "Saiyaara fans turn theatres into concert halls. Videos go viralPlanning to watch Mohit Suri's 'Saiyaara' this weekend? Here's how audiences are reacting to Ahaan Panday and Aneet Padda's big-screen debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-teaser-mohanlal-sathyan-anthikad-reunite-feel-good-film-2758324-2025-07-19",
      "headline": "Hridayapoorvam teaser: Mohanlal, Sathyan Anthikad reunite for feel-good filmMohanlal and Sathyan Anthikad reunite to deliver what looks like a heartwarming slice-of-life drama. Take a look at the 'Hridayapoorvam' teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-television-academy-marks-25-years-launch-ita-anthem-2758316-2025-07-19",
      "headline": "Indian Television Academy Awards celebrates 25 years with launch of ITA anthemThe Indian Television Academy completed 25 years in 2025. The academy released an ITA anthem that captures the evolution of Indian television.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-mimics-coldplay-cheating-couple-goes-viral-watch-2758285-2025-07-19",
      "headline": "BTS Jin's funny mimic of Coldplay's cheating couple goes viral. WatchAstronomer CEO Andy Byron and Chief Public Officer Kristin Cabot got caught cheating during a Coldplay concert. BTS member Jin recreated the viral moment on his tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-son-of-sardaar-2-release-postponed-makes-announce-new-date-2758273-2025-07-19",
      "headline": "Son of Sardaar 2 release postponed, makes announce new dateAjay Devn's 'Son of Sardaar 2' has been postponed. The film was set for a July 25 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-experiences-mid-air-scare-as-stage-prop-fails-during-show-2758256-2025-07-19",
      "headline": "Katy Perry experiences mid-air scare as stage prop fails during showPop star Katy Perry faced an unexpected glitch during her Lifetimes Tour stop in San Francisco. While performing her hit track 'Roar', the singer was perched on a giant butterfly prop that appeared to malfunction mid-act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-hindi-version-titled-saamrajya-to-release-on-july-31-2758251-2025-07-19",
      "headline": "Vijay Deverakonda's Kingdom Hindi version titled Saamrajya, to release on July 31Vijay Deverakonda is all set to make a powerful comeback with 'Kingdom', an action drama releasing on July 31. The film has now been titled 'Saamrajya' in Hindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-not-calm-daughter-shiloh-moves-in-with-partner-reports-2758240-2025-07-19",
      "headline": "Angelina Jolie not calm as daughter Shiloh moves in with rumoured partner: ReportsAccording to a recent report, Angelina Jolie's daughter Shiloh has \"temporarily moved in\" with her alleged girlfriend, and it seems the Hollywood star isn't entirely on board with the development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akon-offers-wild-theories-on-coldplay-astronomer-ceo-andy-byron-kristin-cabot-row-internet-bursts-out-laughing-2758217-2025-07-19",
      "headline": "Singer Akon offers wild theories on Coldplay row, internet bursts out laughingSinger Akon has joined the viral Coldplay concert craze by sharing a hilarious AI-generated video imagining how an embarrassed couple caught on the jumbotron could have avoided their awkward moment. His creative parody has sparked laughter and lively discussions across social media, adding to the ongoing buzz around the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-teasing-new-solo-music-instagram-comeback-fans-think-so-2758172-2025-07-19",
      "headline": "Is BTS' Jungkook teasing new solo music in cryptic Instagram post? Fans think soBTS member Jungkook made a surprising return to Instagram, unveiling his new handle during a live session with fellow bandmates RM and V. The singer shared his first post under the new username, leaving fans buzzing with speculation about a possible music comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-injured-during-shoot-of-next-release-king-while-attempting-action-sequence-sources-2758171-2025-07-19",
      "headline": "Shah Rukh Khan sustains injury on King sets while filming action sequence: SourcesShah Rukh Khan recently sustained a minor back injury during the shoot of his upcoming film 'King', causing a delay in the production schedule with filming now set to resume in September. Despite the setback, SRK is recuperating well in the UK with his family, and fans remain eager for the film's release featuring a star-studded cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/junior-review-kireeti-reddy-sreeleela-film-is-a-jack-of-all-but-king-of-none-2758167-2025-07-19",
      "headline": "Junior review: Kireeti Reddy's film is a jack of all but king of noneRelease Date:Sat Jul 19, 2025'Junior' film review: This bilingual family drama stars debutant Kireeti Reddy in the lead alongside Genelia Deshmukh and V Ravichandran. While the film showcases all aspects required in a commercial film, there is a sense of half-baked-ness in the final product."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-elli-avram-spark-love-in-dreamy-new-track-chandaniyan-2758159-2025-07-19",
      "headline": "Ashish Chanchlani, Elli AvRam spark love in dreamy new track Chandaniyan. WatchAshish Chanchlani and Elli AvRam charm audiences with 'Chandaniyan', a romantic track that beautifully portrays the joy and pain of loving from afar. Their undeniable chemistry in the music video has sparked fan rumours of a real-life romance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/blue-dragon-series-awards-winners-full-list-iu-ju-ji-hoon-when-life-give-you-tangerines-2758155-2025-07-19",
      "headline": "Blue Dragon Series Awards: IU, Ju Ji Hoon, When Life Gives You... win top prizesKorean stars IU, Park Bo Gum, Hyeri, and Choo Young Woo were among the biggest winners at the 2025 Blue Dragon Series Awards. Check the full list of winners here."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sangeeta-bijlani-pune-farmhouse-vandalised-police-launch-probe-after-complaint-2758138-2025-07-19",
      "headline": "Sangeeta Bijlani's Pune farmhouse vandalised, police launch probe after complaintBollywood actor Sangeeta Bijlani's farmhouse on the outskirts of Pune was recently broken into and vandalised. The intruders caused extensive damage, leaving the upper floor of the property completely ransacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-actor-fish-venkat-dies-of-kidney-failure-at-53-2758143-2025-07-19",
      "headline": "Telugu actor Fish Venkat dies of kidney failure at 53Telugu actor Fish Venkat died at 53 after battling severe kidney failure. Known for his unique Telangana accent and memorable roles, his loss has been deeply felt by fans and colleagues alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-gupta-praises-saiyaara-ahaan-panday-aneet-padda-yrf-no-promo-strategy-can-we-learn-our-lesson-2758132-2025-07-19",
      "headline": "Sanjay Gupta praises YRF's no-promo strategy for Saiyaara: Can we learn our lessonSaiyaara's unconventional promotional strategy, avoiding typical media appearances, has sparked praise and discussion in Bollywood, especially from filmmaker Sanjay Gupta. The film's impressive Rs 20 crore Day 1 collection highlighted a successful shift towards content-focused marketing in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-undergoes-neck-angioplasty-daughter-sunaina-shares-update-2758121-2025-07-19",
      "headline": "Rakesh Roshan undergoes neck angioplasty, daughter Sunaina confirms recoveryVeteran filmmaker Rakesh Roshan, father of actor Hrithik Roshan, is on the road to recovery after undergoing a neck angioplasty. His daughter, Sunaina Roshan, has assured well-wishers that there is no cause for concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-2-promo-smriti-iranis-tulsi-virani-returns-to-shanti-niketan-2758104-2025-07-19",
      "headline": "Kyunki Saas Bhi Kabhi… 2 promo: Smriti Irani's Tulsi Virani returns to Shanti NiketanStar Plus is all set to bring back the beloved 'Kyunki Saas Bhi Kabhi Bahu Thi' with Smriti Irani reprising her iconic role as Tulsi Virani. The show will premiere on July 29 at 10:30 pm."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-pm-modi-donald-trump-india-pak-conflict-ceasefire-claim-op-sindoor-2758313-2025-07-19",
      "headline": "What's the truth Modi ji? Rahul Gandhi after Trump claims 5 jets shot downA day after US President Donald Trump claimed that \"five jets were shot down\" during India's Operation Sindoor, Congress MP Rahul Gandhi slammed PM Narendra Modi, saying the country had a right to know the truth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladeshi-man-posed-as-transgender-woman-neha-in-india-for-8-years-now-caught-in-bhopal-2758348-2025-07-19",
      "headline": "'Neha' was Abdul all along: Bangladeshi arrested after 28 years in IndiaWidely known as 'Neha Kinnar' in the locality where he was staying, Abdul Kalam entered India at the age of 10 and went on to spend nearly 20 years in Mumbai before moving to Bhopal. He maintained the identity of a transgender woman for at least eight years in Bhopal to avoid detection by local authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kanwariyas-assault-crpf-jawan-up-railway-station-mirzapur-arrested-cctv-footage-2758284-2025-07-19",
      "headline": "Video: Kanwariyas punch, kick CRPF jawan at UP station after spat over ticketsA CCTV footage has surfaced showing a group of Kanwariyas thrashing, kicking and punching a CRPF jawan following an argument over the purchase of train tickets at UP's Mirzapur railway station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-marries-brothers-men-polyandry-himachal-sirmaur-village-about-age-old-practice-2758343-2025-07-19",
      "headline": "Two brothers, one bride: Himachal village keeps alive age-old polyandryA woman in Himachal Pradesh's Sirmaur district married two men - who are brothers from the Hatti tribe - in a ceremony that lasted three days and drawn widespread attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/donald-trump-jeffrey-epstein-ties-allegations-lawsuits-unfulfilled-promises-2758189-2025-07-19",
      "headline": "Trump-Epstein ties: Allegations, lawsuits, and unfulfilled promisesThe Wall Street Journal's July 17, 2025, report alleging Trump's suggestive letter in Jeffrey Epstein's 2003 birthday album ignited a $10 billion libel lawsuit and intensified calls for Epstein file disclosures, deepening political divides. Is Trump in trouble?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparks online speculation and prompts an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/at-key-opposition-india-bloc-huddle-abhishek-banerjee-denounces-bjps-e-square-formula-2758363-2025-07-19",
      "headline": "At key Opposition huddle, Abhishek Banerjee denounces BJP's 'E-square' formulaDuring the virtual meeting, Trinamool Congress MP Abhishek Banerjee emphasised that the INDIA bloc should corner the Centre over the Pahalgam terror attack, the outcome of Operation Sindoor, and the Election Commission's revision of Bihar's electoral list ahead of the Assembly Elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-us-branding-pahalgam-perpetrator-trf-a-global-terror-outfit-is-a-message-to-pakistan-2757806-2025-07-18",
      "headline": "By naming TRF global terror outfit, US is sending a message to PakistanThe Resistance Front (TRF), responsible for numerous terror strikes in Kashmir, is directed by the Pakistani military and intelligence, with its leadership and training pads based in Pakistan\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-dharmasthala-case-whistleblower-temple-murders-missing-women-mass-graves-sowjanya-rape-investigation-2757900-2025-07-19",
      "headline": "Who's the mystery Dharmasthala whistleblower seeking justice for the deadThreatened he would be killed, he silently burned and buried the bodies of hundreds of women that he says had marks pointing to sexual assault and murder. He fled, but guilt didn't let him rest in peace. He returned to dig up evidence at Dharmasthala, a popular pilgrimage place in Karnataka, and shock the world. Who's the mystery whistleblower in the Dharmasthala mass-graves case?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/noida-university-student-jyoti-sharma-who-died-by-suicide-faced-targeted-verbal-abuse-say-batchmates-2758386-2025-07-20",
      "headline": "Noida student who died by suicide faced targeted verbal abuse, say batchmatesIn her suicide note, Jyoti Sharma wrote that she had been mentally harassed and humiliated for a long time on the university campus, which caused her distress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lakshadweep-plans-to-acquire-bitra-island-for-defence-use-mp-protests-move-2758360-2025-07-19",
      "headline": "Lakshadweep's smallest island planned for defence use, MP protests moveThe Lakshadweep administration is planning to acquire Bitra, the smallest island on the archipelago, for defence purposes, a move which drew a strong protest from MP Hamdullah Sayeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-shubhanshu-shukla-astronaut-floating-space-station-2758358-2025-07-19",
      "headline": "Watch: India's Shubhanshu Shukla floating in Space Station is all things coolIndia's first ISS astronaut, Group Captain Shubhanshu Shukla, captivated audiences with a video of him calmly floating in zero gravity, highlighting the challenges of microgravity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/dwarka-murder-sushmita-dev-rahul-dev-arrested-conspiracy-property-motive-2758208-2025-07-19",
      "headline": "Woman has affair with brother-in-law, both kill her husband. Chats reveal plotA 35-year-old man in Delhi was murdered allegedly by his wife and her lover, who is also her brother-in-law, with police uncovering the plot through incriminating chats found by the victim's brother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/ktr-phone-tapping-kavitha-allegation-congress-kiran-kumar-reddy-brs-2758349-2025-07-19",
      "headline": "KTR got his sister Kavitha's phone tapped: Congress MP's bombshell claimCongress MP Kiran Kumar Reddy accused BRS leader KTR of tapping his sister Kavitha's phone, escalating the ongoing political feud in Telangana. The BRS now faces fresh controversy amid an SIT probe into alleged surveillance under its rule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-woman-complains-stomach-ache-doctors-remove-hairball-from-belly-pica-trichophagia-2758376-2025-07-19",
      "headline": "UP woman complains of stomach ache; doctors remove 500-gm hairball from bellyDoctors in Kaushambi removed a 1.5-foot-long, 500-gram hairball from a 21-year-old woman's stomach caused by a rare psychological disorder, saving her life through a two-hour surgery. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-man-swept-away-in-floodwater-outside-ajmer-dargah-rescued-by-shopkeepers-2758254-2025-07-19",
      "headline": "Video: Man swept away in floodwater outside Ajmer Dargah, rescued by shopkeepersContinuous heavy rainfall over the past 48 hours has disrupted life in Rajasthan's Ajmer, creating flood-like conditions across the city. In a shocking incident from the Dargah Bazar area, a man was swept away by the strong water current. Fortunately, alert shopkeepers nearby acted swiftly and rescued him safely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-506-18-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gangotri-bound-chopper-uttarakhand-hit-cable-during-emergency-landing-finds-aaib-preliminary-probe-2758326-2025-07-19",
      "headline": "Uttarkashi chopper hit cable during emergency landing, crashed: Preliminary probeDuring its attempted landing on NH 34 near Gangnani in Uttarakhand's Uttarkashi on May 8, the chopper struck an overhead cable, resulting in a crash that killed the pilot and five passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raj-thackeray-nishikant-dubey-language-row-hindi-marathi-remark-mumbai-rally-2758257-2025-07-19",
      "headline": "Raj Thackeray's 'dubo dubo ke maarenge' jab gets BJP MP's 'he learnt Hindi' tauntA war of words broke out between Raj Thackeray and Nishikant Dubey with the MNS chief saying he would get the BJP leader to drown him many times in Mumbai. In response, Dubey took a dig, saying he taught Hindi to Thackeray."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-cinema-mid-year-box-office-report-tamil-telugu-malayalam-kannada-hits-misses-cinematic-saturday-2757249-2025-07-19",
      "headline": "South mid-year box office 2025: Malayalam-Tamil hold fort, Telugu-Kannada in crisisThe first half of 2025 brought contrasting fortunes for South Indian cinema with Malayalam and Tamil films performing well despite setbacks. Telugu and Kannada industries faced difficulties, but a strong lineup of big releases in the second half offers hope for recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-killed-abducted-gunmen-niger-southwest-dosso-region-militant-insurgency-2758308-2025-07-19",
      "headline": "2 Indians shot dead, another kidnapped in Niger; government seeks safe releaseTwo Indian nationals were killed and one abducted by gunmen in Niger's Dosso region, as attacks on foreigners continue to rise. The victims were working at a construction site, according to local media.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/more-than-20-injured-after-vehicle-ploughs-into-crowd-in-los-angeles-several-critical-cops-2758250-2025-07-19",
      "headline": "30 injured as vehicle rams crowd waiting outside Los Angeles nightclubA vehicle rammed into a crowd on Santa Monica Boulevard in East Hollywood, injuring over 20 people. Five are in critical condition, with others seriously or moderately hurt, officials said.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kfc-uttar-pradesh-vasundhara-vegetarian-menu-sawan-protests-kanwar-yatra-2758281-2025-07-19",
      "headline": "Chicken off menu at Ghaziabad KFC outlet during Sawan after Hindu outfit protestsHindu Raksha Dal's protest against KFC's non-veg menu during Sawan has led to a temporary vegetarian-only policy at the outlet. An FIR has been registered against at least eight protesters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-fans-turn-theatres-into-concert-watch-viral-video-2758336-2025-07-19",
      "headline": "Saiyaara fans turn theatres into concert halls. Videos go viralPlanning to watch Mohit Suri's 'Saiyaara' this weekend? Here's how audiences are reacting to Ahaan Panday and Aneet Padda's big-screen debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-teaser-mohanlal-sathyan-anthikad-reunite-feel-good-film-2758324-2025-07-19",
      "headline": "Hridayapoorvam teaser: Mohanlal, Sathyan Anthikad reunite for feel-good filmMohanlal and Sathyan Anthikad reunite to deliver what looks like a heartwarming slice-of-life drama. Take a look at the 'Hridayapoorvam' teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-son-of-sardaar-2-release-postponed-makes-announce-new-date-2758273-2025-07-19",
      "headline": "Son of Sardaar 2 release postponed, makes announce new dateAjay Devn's 'Son of Sardaar 2' has been postponed. The film was set for a July 25 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-hindi-version-titled-saamrajya-to-release-on-july-31-2758251-2025-07-19",
      "headline": "Vijay Deverakonda's Kingdom Hindi version titled Saamrajya, to release on July 31Vijay Deverakonda is all set to make a powerful comeback with 'Kingdom', an action drama releasing on July 31. The film has now been titled 'Saamrajya' in Hindi. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-legends-match-wcl-2025-harbhajan-yusuf-sikhar-dhawan-2758388-2025-07-20",
      "headline": "IND vs PAK: Harbhajan Singh, Shikhar Dhawan among stars who pull out of WCL tieHarbhajan Singh, Shikhar Dhawan, Suresh Raina and Yusuf Pathan have withdrawn from the India-Pakistan WCL 2025 match. Their decision comes amid controversy linked to recent geopolitical tensions between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-womens-2nd-odi-report-sophie-ecclestone-amy-jones-lords-2758381-2025-07-19",
      "headline": "Jones, Ecclestone help England draw level series in rain-affected gameSophie Ecclestone and Amy Jones were the stars of the show as England levelled the series against India with a thumping win in a rain-affected second ODI at Lord's on Saturday, July 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-mohammed-siraj-jasprit-bumrah-aakash-chopra-2758362-2025-07-19",
      "headline": "Siraj goes unnoticed while bowling alongside Bumrah: Aakash ChopraAakash Chopra has highlighted how Mohammed Siraj's significant bowling contributions often go unnoticed due to Jasprit Bumrah's star status. Siraj's impressive workload and wicket tally show his position in the team and his importance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-marcus-rashford-loan-barcelona-hansi-flick-2758344-2025-07-19",
      "headline": "Out-of-favour Manchester United star Marcus Rashford close to Barcelona loan: ReportMarcus Rashford is edging closer to a move away from Manchester United as loan deal with Barcelona is at the final stages. Rashford had fallen out of favour last season with manager Ruben Amorim. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tour-de-france-cyclist-julian-alaphilippe-snatch-placard-woman-2758342-2025-07-19",
      "headline": "Tour de France: Cyclist snatches placard from woman spectatorAstonishing scenes followed when cyclist Julian Alaphilippe grabbed a spectator's cardboard placard to protect himself from cold during the Tour de France."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shubman-gill-harbhajan-singh-interview-2758328-2025-07-19",
      "headline": "Shubman Gill's India will be a world beater, don't judge them too earlyThe young Indian cricket team under the leadership of Shubman Gill should not be judged too often, feels former cricketer Harbhajan Singh. Under Shubman, India have lost 2 of the first 3 Test matches in England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-manchester-test-team-changes-kuldeep-yadav-nitish-kumar-reddy-harbhajan-singh-2758329-2025-07-19",
      "headline": "Kuldeep Yadav in for Nitish Reddy: Harbhajan Singh on Manchester Test changesHarbhajan Singh suggested the changes India should make for the Manchester Test and feels that Kuldeep Yadav should come in for Nitish Kumar Reddy. Kuldeep is yet to make an appearance during the ongoing series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-split-coaching-harbhajan-singh-2758325-2025-07-19",
      "headline": "India should consider the option of split coaching: Harbhajan SinghSpeaking exclusively to India Today, Harbhajan Singh said that India should consider the option of split coaching and explained the reason why he feels it is a good option. Gautam Gambhir hasn't had the best of times as the red-ball coach of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmod-pcb-coach-2758296-2025-07-19",
      "headline": "Pakistan Cricket Board keen to release coach Azhar MahmoodThe Pakistan Cricket Board (PCB) wants to release Azhar Mahmood from the coaching staff, but a contract from the previous management is blocking the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-bengal-probables-list-domestic-season-2758290-2025-07-19",
      "headline": "Mohammed Shami named in Bengal's probables list for upcoming domestic seasonMohammed Shami has been named in Bengal's 50-member list of probables for the upcoming domestic season. His inclusion signals a potential comeback after a disappointing IPL season and absence from the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-change-in-technique-ravi-shastri-2758277-2025-07-19",
      "headline": "The best of KL Rahul: Tweaks that led to batter's Test career revivalIndia vs England: KL Rahul has made a stunning return to the top order of the Indian Test team with impressive outings in Australia and England. Ravi Shastri breaks down the little tweaks that KL Rahul has made in his batting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-manchester-test-team-changes-kuldeep-yadav-nitish-kumar-reddy-harbhajan-singh-2758329-2025-07-19",
      "headline": "Kuldeep Yadav in for Nitish Reddy: Harbhajan Singh on Manchester Test changesHarbhajan Singh suggested the changes India should make for the Manchester Test and feels that Kuldeep Yadav should come in for Nitish Kumar Reddy. Kuldeep is yet to make an appearance during the ongoing series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-split-coaching-harbhajan-singh-2758325-2025-07-19",
      "headline": "India should consider the option of split coaching: Harbhajan SinghSpeaking exclusively to India Today, Harbhajan Singh said that India should consider the option of split coaching and explained the reason why he feels it is a good option. Gautam Gambhir hasn't had the best of times as the red-ball coach of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmod-pcb-coach-2758296-2025-07-19",
      "headline": "Pakistan Cricket Board keen to release coach Azhar MahmoodThe Pakistan Cricket Board (PCB) wants to release Azhar Mahmood from the coaching staff, but a contract from the previous management is blocking the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-bengal-probables-list-domestic-season-2758290-2025-07-19",
      "headline": "Mohammed Shami named in Bengal's probables list for upcoming domestic seasonMohammed Shami has been named in Bengal's 50-member list of probables for the upcoming domestic season. His inclusion signals a potential comeback after a disappointing IPL season and absence from the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-change-in-technique-ravi-shastri-2758277-2025-07-19",
      "headline": "The best of KL Rahul: Tweaks that led to batter's Test career revivalIndia vs England: KL Rahul has made a stunning return to the top order of the Indian Test team with impressive outings in Australia and England. Ravi Shastri breaks down the little tweaks that KL Rahul has made in his batting."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}