{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-gas-cylinder-price-delhi-mumbai-chennai-increase-new-rate-2591614-2024-09-01",
      "headline": "Commercial LPG cylinders to get costlier from today, price hiked by Rs 39The price of commercial LPG cylinders has been increased nationwide, with a Rs 39 hike in Delhi for a 19 kg cylinder, now priced at Rs 1,691.50 as of September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-fall-shaktikanta-das-rbi-government-spending-lok-sabha-elections-2591540-2024-08-31",
      "headline": "Lok Sabha polls, reduced spending: RBI Governor's reasons for Q1 GDP fallIndia's GDP growth slowed to 6.7 per cent in the April-June quarter, down from 8.2 per cent a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-and-isg-partner-to-bring-ondc-seller-app-at-global-fintech-fest-2024-2591461-2024-08-31",
      "headline": "JP Morgan and ISG partner to bring ONDC seller app at Global Fintech Fest 2024The partnership creates a 'one stop shop' solution for digital commerce by leveraging ISG's ONDC tech stack, powered by its ecosystem partner Protean, and the banking capabilities of JP Morgan in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-over-12-percent-today-what-should-investors-do-2590857-2024-08-30",
      "headline": " Paytm shares rise over 12% today: What should investors do?This rise in shares comes amid important developments within the company, including the recent sale of its entertainment ticketing business to online food aggregator Zomato for Rs 2,048 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simplified-pension-application-form-launched-for-retiring-government-employees-2590843-2024-08-30",
      "headline": "Simplified pension form launched for retiring government staff. Check detailsThe new form consolidates nine separate forms into a single, unified Form 6A. It also offers the option to download the ePPO, ensuring a seamless transition from employment to retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-investors-q1-gdp-data-rvnl-share-price-2590815-2024-08-30",
      "headline": "Sensex, Nifty end higher as investors await Q1 GDP data; RVNL up 4%The S&P BSE Sensex rose 231.16 points to 82,365.77, while the NSE NIfty50 settled 83.95 higher at 25,235.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-growth-preview-data-what-to-watch-out-for-outlook-expectations-2590803-2024-08-30",
      "headline": "India Q1 GDP growth preview: What to watch out for Analysts predict growth in the range of 6%-7.1% for Q1 FY25, compared with 7.8% in the previous quarter (Q4 FY24). Rating agencies and financial institutions have varying expectations for Q1 GDP growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-shares-surge-5-cross-rs-600-whats-behind-the-rally-2590746-2024-08-30",
      "headline": "RVNL shares cross Rs 600 mark after jumping 5%. What's behind the rally?Shares of this multibagger railway PSU have sharply corrected over the past month but are still up over 230% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-shares-issue-what-is-it-and-how-does-it-benefit-investors-2590685-2024-08-30",
      "headline": "Reliance bonus issue: What is it and how will it benefit shareholders?A bonus issue, also known as a bonus share issue, occurs when a company distributes additional shares to its existing shareholders at no cost to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-global-fintech-fest-jan-dhan-yojana-pivotal-in-boosting-financial-inclusion-women-empowerment-2590680-2024-08-30",
      "headline": "'Jan Dhan Yojana pivotal in boosting financial inclusion': PM ModiSpeaking at the Global Fintech Fest (GFF), he mentioned how the scheme has been a game-changer in ensuring that banking services reach every corner of the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/uk-insurer-aviva-found-guilty-in-ud-26-million-fake-invoice-scandal-in-india-report-2590627-2024-08-30",
      "headline": "UK's Aviva found guilty in $26 million fake invoice scandal in India: ReportBritish insurer Aviva has been accused of violating regulations in India by using fake invoices and secret cash payments to bypass commission limits for sales agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-air-india-merger-check-impact-on-ticket-bookings-flight-operations-and-more-2590615-2024-08-30",
      "headline": "Vistara-Air India merger: Check impact on ticket bookings, flight operations and moreVistara-Air India merger: Travelers can expect expanded services and improved connectivity. Read on to see how this change will impact your bookings, flight operations, and travel experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-vistara-merger-likely-to-be-finalised-on-november-12-2590580-2024-08-30",
      "headline": "No Vistara flight bookings from September 3 ahead of merger with Air IndiaVistara-Air India merger: Starting from September 3, 2024, customers will no longer be able to book Vistara flights for travel on or after November 12, 2024. Bookings for these routes will be redirected to Air India's website."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-ipo-allotment-status-step-by-step-guide-gmp-today-2590555-2024-08-30",
      "headline": "Premier Energies IPO allotment: Step-by-step guide to check status Premier Energies IPO allotment: Investors can check their Premier Energies IPO allotment status online via the BSE website or Kfin Technologies Limited, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-at-record-highs-as-moodys-lifts-indias-gdp-forecast-to-72-percent-2590522-2024-08-30",
      "headline": "Sensex, Nifty open at record highs as Moody's lifts India's GDP forecast to 7.2%The S&P BSE Sensex added 502.42 points to 82,637.03, while the NSE Nifty50 gained 87.45 points to 25,239.40. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhatrapati-shivaji-maharaj-statue-collapse-fir-blame-game-navy-pwd-fir-maharashtra-elections-2591580-2024-09-01",
      "headline": "Shivaji statue collapse: Who's the culprit? Blame game continuesIndia Today TV investigates the incident in-depth and the blame game between those responsible for the statue's maintenance. A panel is investigating the incident, with the Indian Navy and the Public Works Department (PWD) already blaming each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayasurya-breaks-silence-on-sexual-harassment-allegations-it-shattered-me-2591641-2024-09-01",
      "headline": "Actor Jayasurya breaks silence on sexual harassment allegations: It shattered meMalayalam actor Jayasurya issued a statement reacting to allegations of sexual harassment levelled against him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-forces-find-bodies-in-gaza-suspected-hostages-joe-biden-ceasefire-hamas-2591629-2024-09-01",
      "headline": "Israeli forces find bodies in Gaza, suspected to be hostages: ReportThe Israel Defense Forces said it discovered bodies in Gaza during combat, believed to be kidnapped hostages. Efforts are ongoing to extract the bodies and identify them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-gas-cylinder-price-delhi-mumbai-chennai-increase-new-rate-2591614-2024-09-01",
      "headline": "Commercial LPG cylinders to get costlier from today, price hiked by Rs 39The price of commercial LPG cylinders has been increased nationwide, with a Rs 39 hike in Delhi for a 19 kg cylinder, now priced at Rs 1,691.50 as of September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-elections-vinesh-phogat-congress-join-speculations-power-dynamics-bjp-2591577-2024-09-01",
      "headline": "How Vinesh Phogat's political foray could be a game-changer in Haryana pollsIf wrestler Vinesh Phogat decides to join politics and contest the Haryana Assembly polls on a Congress ticket, it could fuel the controversy around former WFI chief Brij Bhushan Sharan Singh, accused of sexually harassing several women wrestlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-donald-trump-arlington-criticism-campaign-video-disrespectful-political-stunt-2591622-2024-09-01",
      "headline": "'Political stunt': Kamala Harris jabs Trump over cemetery row, he firefightsUS election: Kamala Harris condemned Republican rival Donald Trump for using footage from a visit to Arlington National Cemetery in a campaign video, calling it a \"disrespectful\" political stunt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-rain-flood-weather-forecast-telangana-odisha-imd-forecast-alert-2591640-2024-09-01",
      "headline": "Heavy rain, floods, landslides batter Andhra, Telangana on alertHeavy rain has caused severe flooding and landslides in Andhra Pradesh, resulting in deaths, damages and significant disruptions to normal life. Telangana is also on alert for more heavy rain in the coming days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/andhra-pradesh-woman-woman-fell-sinkhole-malaysia-kuala-lumpur-search-stopped-2591615-2024-09-01",
      "headline": "Malaysia ends search ops to find Indian tourist who fell into sinkholeThe search operation, which was in its ninth day, was cancelled based on an evaluation of the site and technical advice given by experts, said Malaysian Minister Zaliha Mustafa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-is-a-huge-competitor-janik-sinner-after-round-3-win-at-us-open-2591646-2024-09-01",
      "headline": "Carlos Alcaraz is a huge competitor: Janik Sinner after Round 3 win at US OpenJannik Sinner called Carlos Alcaraz a huge competitor and said that he could be tough to beat. Sinner cruised to the 4th round of the US Open and Alcaraz suffered a shock exit in round 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/haryana-election-date-changed-vote-counting-october-8-poll-panel-2591456-2024-08-31",
      "headline": "Haryana election postponed to October 5, counting of votes on October 8The Election Commission has also revised the counting day for both Haryana and Jammu and Kashmir Assembly elections from October 4 to October 8. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-elderly-muslim-man-assaulted-nashik-train-carrying-beef-suspicion-2591419-2024-08-31",
      "headline": "Elderly man assaulted on Nashik train over suspicion of carrying beefA video of the incident was shared by AIMIM MP Imtiaz Jaleel, who called out the government and police for turning a bling eye against 'these forces'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rohan-bopanna-aldila-sutjiadi-us-open-mixed-doubles-matthew-ebden-barbora-krejcikova-2591617-2024-09-01",
      "headline": "US Open: Bopanna, Sutjiadi progress to quarterfinals, set to face Ebden-KrejcikovaIndia's Rohan Bopanna qualified to the quarterfinals of the Mixed doubles event at the US Open alongside Indonesian partner Aldila Sutjiadi. The duo will face the pair of Matthew Ebden and Barbora Krejcikova."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-nationals-trapped-in-lao-cyber-scam-centres-rescue-indian-embassy-vientiane-2591473-2024-08-31",
      "headline": "47 Indian nationals trapped in cyber scam centres in Laos rescuedAn embassy release, posted on X, said that the rescued Indian nationals were trapped in cyber scam centres at the Golden Triangle Special Economic Zone (SEZ) in Bokeo province."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-campaigning-congress-jammu-and-kashmir-assembly-polls-union-territory-2591598-2024-09-01",
      "headline": "Rahul Gandhi to lead Congress's campaign with mega rallies in J&K on September 4Congress MP Rahul Gandhi will lead his party's campaign in poll-bound Jammu and Kashmir by addressing mega rallies on September 4. Other prominent party leaders, including Priyanka Gandhi Vadra, will also be a part of the party's campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-lsg-captaincy-future-rumours-excellent-jonty-rhodes-exit-rumours-2591575-2024-09-01",
      "headline": "'KL Rahul's LSG captaincy has been excellent': Rhodes amidst future talksIn an exclusive interaction with India Today, LSG fielding coach Jonty Rhodes praised KL Rahul's leadership in the franchise, highlighting his success in guiding the side to two playoffs since their introduction to IPL in 2022. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jharkhand-aspirants-die-government-recruitment-drive-physical-test-bjp-judicial-probe-demand-2591574-2024-09-01",
      "headline": "Several aspirants die during physical test in Jharkhand excise constable driveSeveral aspirants died in Jharkhand during physical tests for a government drive to recruit excise constables. The BJP alleged \"mismanagement\" during the drive and demanded a judicial probe into the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/how-jahangir-fell-for-british-charm-and-paved-the-way-for-indias-colonisation-2591329-2024-08-31",
      "headline": "How Jahangir fell for British charm and paved the way for India's colonisationJahangir's reign, a tapestry of indulgence and leisure, allowed the British East India Company to weave its threads into India's fabric. Enchanted by England's curiosities and distracted by his own pleasures, the emperor's gaze faltered, paving the way for 200 years of British dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-sports-politics-419-30-08-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-day-4-full-schedule-medal-events-avani-lekhara-preethi-pal-2591578-2024-09-01",
      "headline": "India at Paralympics 2024, Day 4 schedule: Avani, Preethi return to actionAvani Lekhara and Preethi Pal will be aiming to add to their medal collection on Day 4 of the Paris Paralympics 2024 on September 1, Sunday. Lekhara will partner with Sidharth Banu in the mixed 10m air rifle Prone SH1 event. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ashok-choudhary-bihar-minister-jdu-bhumihar-caste-remarks-nitish-kumar-bjp-rjd-controversy-2591581-2024-09-01",
      "headline": "Nitish Kumar's party leader faces flak over remarks on Bhumihar casteJD(U) leader Ashok Choudhary sparked a row over his remarks on Bhumihar, an upper caste, and blamed the community for the loss of his party's candidate in Jehanabad Lok Sabha seat. He later clarified his remarks after the row escalated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-fall-shaktikanta-das-rbi-government-spending-lok-sabha-elections-2591540-2024-08-31",
      "headline": "Lok Sabha polls, reduced spending: RBI Governor's reasons for Q1 GDP fallIndia's GDP growth slowed to 6.7 per cent in the April-June quarter, down from 8.2 per cent a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-strikes-killed-gaza-who-polio-vaccination-campaign-children-ceasefire-pause-2591612-2024-09-01",
      "headline": "48 killed in Israeli strikes in Gaza ahead of polio vaccination campaignAt least 48 people were killed in fresh Israeli strikes in Gaza ahead of the WHO's polio vaccination campaign where around 640,000 children will be inoculated against polio, relying on daily eight-hour pauses in the fight between Israeli forces and Hamas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-rubina-francis-bronze-medal-sheetal-devi-sarita-archery-parveen-kumar-2591579-2024-09-01",
      "headline": "Rubina's bronze, Sheetal bows out in dull Paralympics Day 3 for IndiaRubina Francis secured a bronze in the women's 10m air pistol SH1, offering a rare bright spot for India on Day 3 of the Paris Paralympics after a quieter performance following a strong Day 2. Para-archery star Sheetal Devi crashed out after pre-quarters loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-vs-rjd-assam-assembly-jumma-namaz-himanta-biswa-sarma-tejashwi-yadav-sam-pitroda-racist-2591517-2024-08-31",
      "headline": "BJP hits back at Tejashwi Yadav over 'Chinese version' jibe at Himanta SarmaBJP blamed the opposition's INDIA bloc for fostering a racist mentality, indicating that Pitoda's influence has imbued Yadav's mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayasurya-breaks-silence-on-sexual-harassment-allegations-it-shattered-me-2591641-2024-09-01",
      "headline": "Actor Jayasurya breaks silence on sexual harassment allegations: It shattered meMalayalam actor Jayasurya issued a statement reacting to allegations of sexual harassment levelled against him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-greatest-of-all-time-goat-matta-song-2591498-2024-08-31",
      "headline": "'Matta' song: Fourth track from Vijay Thalapathy's 'GOAT' outThalapathy Vijay's new song 'Matta' from 'The Greatest of All Time' is out, featuring contributions from Yuvan Shankar Raja and others, promising to captivate audiences with vibrant vocals and dance moves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanam-teri-kasam-2-harshvardhan-rane-mawra-hocane-not-returning-2591490-2024-08-31",
      "headline": "'Sanam Teri Kasam' 2 in works, but without Harshvardhan Rane, Mawra Hocane?The romantic drama 'Sanam Teri Kasam' is getting a sequel titled 'Jaanam Teri Kasam', but without the original lead actors Harshvardhan Rane and Mawra Hocane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dia-mirza-r-madhavan-rehnaa-hai-terre-dil-mein-re-release-theatres-2591476-2024-08-31",
      "headline": "Dia Mirza recalls heartbreak after 'Rehnaa Hai Terre Dil Mein' failureThe Bollywood film 'Rehnaa Hai Terre Dil Mein' has been re-released in theatres after 23 years. To commemorate it, lead actors Dia Mirza and R Madhavan went down the memory lane and revealed their reaction after the film's initial failure."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-is-a-huge-competitor-janik-sinner-after-round-3-win-at-us-open-2591646-2024-09-01",
      "headline": "Carlos Alcaraz is a huge competitor: Janik Sinner after Round 3 win at US OpenJannik Sinner called Carlos Alcaraz a huge competitor and said that he could be tough to beat. Sinner cruised to the 4th round of the US Open and Alcaraz suffered a shock exit in round 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-us-open-2024-anastasia-pavlyuchenkova-liudmila-samsonova-2591634-2024-09-01",
      "headline": "US Open: Iga Swiatek breezes past Pavlyuchenkova to advance to pre-quartersIga Swiatek progressed to round of 16 in the US Open men's singles as she beat Anastasia Pavlyuchenkova in straight sets by 6-4, 6-2. She will next face No. 16 seed Liudmila Samsonova."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rohan-bopanna-aldila-sutjiadi-us-open-mixed-doubles-matthew-ebden-barbora-krejcikova-2591617-2024-09-01",
      "headline": "US Open: Bopanna, Sutjiadi progress to quarterfinals, set to face Ebden-KrejcikovaIndia's Rohan Bopanna qualified to the quarterfinals of the Mixed doubles event at the US Open alongside Indonesian partner Aldila Sutjiadi. The duo will face the pair of Matthew Ebden and Barbora Krejcikova."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-lsg-captaincy-future-rumours-excellent-jonty-rhodes-exit-rumours-2591575-2024-09-01",
      "headline": "'KL Rahul's LSG captaincy has been excellent': Rhodes amidst future talksIn an exclusive interaction with India Today, LSG fielding coach Jonty Rhodes praised KL Rahul's leadership in the franchise, highlighting his success in guiding the side to two playoffs since their introduction to IPL in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-rubina-francis-bronze-medal-sheetal-devi-sarita-archery-parveen-kumar-2591579-2024-09-01",
      "headline": "Rubina's bronze, Sheetal bows out in dull Paralympics Day 3 for IndiaRubina Francis secured a bronze in the women's 10m air pistol SH1, offering a rare bright spot for India on Day 3 of the Paris Paralympics after a quieter performance following a strong Day 2. Para-archery star Sheetal Devi crashed out after pre-quarters loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-day-4-full-schedule-medal-events-avani-lekhara-preethi-pal-2591578-2024-09-01",
      "headline": "India at Paralympics 2024, Day 4 schedule: Avani, Preethi return to actionAvani Lekhara and Preethi Pal will be aiming to add to their medal collection on Day 4 of the Paris Paralympics 2024 on September 1, Sunday. Lekhara will partner with Sidharth Banu in the mixed 10m air rifle Prone SH1 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-jannik-sinner-progresses-4th-round-jack-draper-2591576-2024-09-01",
      "headline": "US Open 2024: Jannik Sinner cruises in to round 4, Jack Draper downs BoticJannik Sinner produced a dominant performance on Saturday, August 21 as he steamrolled past Christopher O'Connell to make it to the 4th round of the US Open. Jack Draper also made it to the next round as he defeated Botic van de Zandschulp. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-west-ham-erling-haaland-hat-trick-2591570-2024-09-01",
      "headline": "Premier League: Erling Haaland hat-trick sees Manchester City make it 3 out of 3Erling Haaland scored his 2nd hat-trick of the season as Manchester City made it 3 out of 3 with a 3-1 win over West Ham United. Arsenal and Brighton played out a 1-1 draw as Declan Rice saw red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jessica-pegula-jasmine-paolini-jessica-bouzas-maneiroround-of-sixteen-new-york-2591567-2024-09-01",
      "headline": "Jessica Pegula, Jasmine Paolini ease into into US Open Round of 16Jessica Pegula and Jasmine Paolini powered into the US Open Round of 16, displaying dominant performances with Pegula's precision and Paolini's smart play and court movement, easily overpowering their respective opponents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-t20-ayush-badoni-priyansh-arya-blitz-puts-south-delhi-superstarz-into-semis-2591564-2024-09-01",
      "headline": "Delhi Premier League: Badoni-Priyansh blitz puts South Delhi Superstarz into semisAyush Badoni and Priyansh Arya's record-breaking partnership powered South Delhi Superstarz into the semis of the Delhi Premier League T20 with a 112-run win over North Delhi Strikers on August 31, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sarita-kumari-archery-quarter-finals-oznur-cure-girdi-world-champion-2591545-2024-08-31",
      "headline": "Sarita crashes out of Paralympics archery after loss to world number 1Sarita Kumari's Paris Paralympics journey ended in heartbreak as she lost her Women's individual quarterfinal to Turkey's world champion Oznur Cure Girdi, struggling to find her rhythm in a challenging match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-jannik-sinner-progresses-4th-round-jack-draper-2591576-2024-09-01",
      "headline": "US Open 2024: Jannik Sinner cruises in to round 4, Jack Draper downs BoticJannik Sinner produced a dominant performance on Saturday, August 21 as he steamrolled past Christopher O'Connell to make it to the 4th round of the US Open. Jack Draper also made it to the next round as he defeated Botic van de Zandschulp. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-west-ham-erling-haaland-hat-trick-2591570-2024-09-01",
      "headline": "Premier League: Erling Haaland hat-trick sees Manchester City make it 3 out of 3Erling Haaland scored his 2nd hat-trick of the season as Manchester City made it 3 out of 3 with a 3-1 win over West Ham United. Arsenal and Brighton played out a 1-1 draw as Declan Rice saw red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jessica-pegula-jasmine-paolini-jessica-bouzas-maneiroround-of-sixteen-new-york-2591567-2024-09-01",
      "headline": "Jessica Pegula, Jasmine Paolini ease into into US Open Round of 16Jessica Pegula and Jasmine Paolini powered into the US Open Round of 16, displaying dominant performances with Pegula's precision and Paolini's smart play and court movement, easily overpowering their respective opponents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-t20-ayush-badoni-priyansh-arya-blitz-puts-south-delhi-superstarz-into-semis-2591564-2024-09-01",
      "headline": "Delhi Premier League: Badoni-Priyansh blitz puts South Delhi Superstarz into semisAyush Badoni and Priyansh Arya's record-breaking partnership powered South Delhi Superstarz into the semis of the Delhi Premier League T20 with a 112-run win over North Delhi Strikers on August 31, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sarita-kumari-archery-quarter-finals-oznur-cure-girdi-world-champion-2591545-2024-08-31",
      "headline": "Sarita crashes out of Paralympics archery after loss to world number 1Sarita Kumari's Paris Paralympics journey ended in heartbreak as she lost her Women's individual quarterfinal to Turkey's world champion Oznur Cure Girdi, struggling to find her rhythm in a challenging match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-2nd-test-day-3-report-joe-root-hundred-lords-2591541-2024-08-31",
      "headline": "ENG vs SL 2nd Test: Record-breaker Joe Root stars as England close in on winJoe Root was the star of the show yet again as the star batter's 34th Test hundred put England on course for the win at Lord's on Day 3 of the second match on August 31, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-sheetal-devi-misses-out-quarterfinals-mariana-zuniga-2591527-2024-08-31",
      "headline": "Paralympics: Archer Sheetal loses pre-quarters, out of individual medal contentionIndian archer Sheetal Devi agonisingly missed out making it to the final 8 round of the Women's Individual Compound Open event as she lost the pre-quarters to Chile's Mariana Zuniga on August 31, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-vs-sri-lanka-test-hug-father-watch-record-century-2591521-2024-08-31",
      "headline": "Watch: Joe Root shares hug with father after record century vs Sri LankaJoe Root's heartfelt embrace with his father at Lord's after his record-breaking century captured the emotional depth of his achievement, as he surpassed Alastair Cook to become England's all-time leading Test century-maker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-indian-team-coach-mixed-start-jonty-rhodes-exclusive-2591510-2024-08-31",
      "headline": "Gautam Gambhir as India coach: Jonty Rhodes unfazed by mixed startJonty Rhodes has said he is unfazed by the mixed start Gautam Gambhir has made as the coach of the Indian cricket team. Gambhir had lost the ODI series after winning 3 T20Is against Sri Lanka in his first assignment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-2nd-test-babar-azam-batting-form-2591509-2024-08-31",
      "headline": "World-class Babar Azam will score big runs again, says Salman AghaPAK vs BAN, 2nd Test: Pakistan batting all-rounder Salman Agha has backed Babar Azam to score runs again. In the first innings, Babar got out for 31 runs, his 15th innings without a fifty in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-second-test-day-three-joe-root-alastair-cook-lords-2591491-2024-08-31",
      "headline": "ENG vs SL: Joe Root breaks Alastair Cook's record with 34th Test hundredJoe Root scored his 34th Test century to go to the top of the all-time list for England batters to score hundreds in the format. Root went past Alastair Cook to go to the top of the list on Day 3 of the second Test against Sri Lanka.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/who-is-kimi-antonelli-lewis-hamilton-2591486-2024-08-31",
      "headline": "Who is Kimi Antonelli? Driver that replaces Lewis Hamilton in MercedesMercedes have announced the Italian Kimi Antonelli will replace the outgoing Lewis Hamilton next season. Here's everything you need to know about the youngster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-northeast-united-fc-first-ever-title-mohunbagan-super-giants-penalties-guillermo-2591483-2024-08-31",
      "headline": "NorthEast win first title after beating Mohun Bagan in Durand Cup finalNorthEast United FC won their first-ever major title after clinching their well-deserved Durand Cup 2024 with a comeback win against defending champions Mohun Bagan Super Giants in the high-value final on August 29 via penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-2nd-test-babar-azam-batting-form-2591509-2024-08-31",
      "headline": "World-class Babar Azam will score big runs again, says Salman AghaPAK vs BAN, 2nd Test: Pakistan batting all-rounder Salman Agha has backed Babar Azam to score runs again. In the first innings, Babar got out for 31 runs, his 15th innings without a fifty in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-second-test-day-three-joe-root-alastair-cook-lords-2591491-2024-08-31",
      "headline": "ENG vs SL: Joe Root breaks Alastair Cook's record with 34th Test hundredJoe Root scored his 34th Test century to go to the top of the all-time list for England batters to score hundreds in the format. Root went past Alastair Cook to go to the top of the list on Day 3 of the second Test against Sri Lanka.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/who-is-kimi-antonelli-lewis-hamilton-2591486-2024-08-31",
      "headline": "Who is Kimi Antonelli? Driver that replaces Lewis Hamilton in MercedesMercedes have announced the Italian Kimi Antonelli will replace the outgoing Lewis Hamilton next season. Here's everything you need to know about the youngster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-northeast-united-fc-first-ever-title-mohunbagan-super-giants-penalties-guillermo-2591483-2024-08-31",
      "headline": "NorthEast win first title after beating Mohun Bagan in Durand Cup finalNorthEast United FC won their first-ever major title after clinching their well-deserved Durand Cup 2024 with a comeback win against defending champions Mohun Bagan Super Giants in the high-value final on August 29 via penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-rubina-francis-bronze-medal-10-m-air-pistol-manu-bhaker-connection-2591477-2024-08-31",
      "headline": "Who is Rubina Francis? And what is her connection with Manu BhakerRubina Francis claimed bronze in the women's 10m air pistol SH1 event to get India's 4th medal from shooting at the Paris Paralympics 2024. Rubina shares a big connection with Manu Bhaker, when it comes to their mentor and redemption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-rubina-francis-bronze-medal-indian-shooters-2591466-2024-08-31",
      "headline": "Paralympics: Rubina wins bronze as Indian shooters continue to shine in ParisIndia's Rubina Francis won bronze to bring home the 5th medal for India in the Paris Paralympics on Saturday, 31 August. Rubina put in an incredible effort to win a medal in the women's 10m air pistol SH1 event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-second-test-day-two-report-mehidy-hasan-miraz-rawalpindi-2591463-2024-08-31",
      "headline": "PAK vs BAN 2nd Test: Mehidy picks 5 as spin haunts Pakistan again on Day 2Pakistan once again failed the trial by spin in Rawalpindi as Mehidy Hasan Miraz picked up 5 wickets to bundle out the hosts for 274 runs on Day 2 of the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-final-mohun-bagan-northeast-united-fc-final-kolkata-salt-lake-stadium-2591429-2024-08-31",
      "headline": "Durand Cup 2024 Final Highlights: NorthEast beat Mohun Bagan in penaltiesDurand Cup 2024 Final Highlights, Mohun Bagan vs NorthEast United FC: The highlanders - NorthEast United have defeated Mohun Bagan in penalties. NorthEast beat Mohun Bagan 4-3 on penalties after drawing 2-2 in full time."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}