{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-conflict-sensex-nifty-stock-market-investors-worried-key-concerns-2610403-2024-10-03",
      "headline": "Iran-Israel conflict: Should stock market investors be worried?With rising tensions in the Middle East, should stock market investors brace for impact? Read on to know what it means for Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bse-shares-gain-8-percent-after-sebi-new-rules-fo-curbs-here-is-why-2610397-2024-10-03",
      "headline": "Explained: BSE shares gain 8% after Sebi's F&O curbs. Here's whyBSE shares surged, while brokerage firms had mixed results, with Angel One gaining 7%, while others declined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-october-3-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2610386-2024-10-03",
      "headline": "Gold, silver price today, October 3, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 3 October 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-dalal-street-bloodbath-sensex-nifty-crash-iran-israel-conflict-crude-oil-price-china-fiis-2610387-2024-10-03",
      "headline": "Iran-Israel clash, oil price rise: Key factors behind Dalal Street bloodbathA combination of geopolitical tensions in the Middle East, a rise in oil prices, and regulatory changes contributed to the significant downturn in the Indian stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-brokerage-firm-angel-one-ltd-shares-jumped-7-percent-today-sebi-new-rules-brokerage-charges-2610385-2024-10-03",
      "headline": "Explained: Why brokerage firm Angel One's shares jumped 7% todayWhile the shares of Angel One Ltd jumped 7% in early trade, it is still far from its 52-week high of Rs 3,900.35 recorded in January this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-multibagger-listing-hold-for-long-term-or-book-profit-now-2610373-2024-10-03",
      "headline": "Multibagger listing for KRN Heat Exchanger: Should you hold or book profit?KRN Heat Exchanger made an extraordinary debut on the stock exchanges, delivering 118% premium over it IPO price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-stock-market-listing-multibagger-returns-118-percent-premium-ipo-price-2610362-2024-10-03",
      "headline": "KRN Heat Exchanger turns multibagger on listing with 118% premium over IPO priceKRN Heat Exchanger listing: While analysts had expected strong listing gains for the company, this has exceeded market expectations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bank-of-america-says-outage-nearly-fixed-after-customers-see-0-account-balance-2610319-2024-10-03",
      "headline": "Bank of America says outage nearly fixed after customers see $0 account balanceIn a statement, the Bank of America said that services were restored after fixing the apparent glitch that showed customers a $0 balance in their bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-conflict-markets-tumble-sensex-nifty-2610344-2024-10-03",
      "headline": "Israel-Iran clash hits Dalal Street, Sensex nosedives over 900 pointsThe Sensex nosedived by over 900 points by 10:20 am, and the Nifty50 saw a sharp fall, dropping nearly 280 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-bollywood-cricket-celebrities-amitabh-bachchan-madhuri-dixit-rahul-dravid-zaheer-khan-rohan-bopanna-2610067-2024-10-02",
      "headline": "Bollywood to cricket: Which celebs have lined up for Swiggy's blockbuster IPOThe final size of the IPO could increase by Rs 1,250 crore, bringing the total to Rs 11,664 crore or $1.4 billion, depending on the decisions made at the company's EGM scheduled for October 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/isha-ambani-young-visionary-behind-reliance-retail-rapid-expansion-hurun-under-35-list-enterpreneur-2609986-2024-10-02",
      "headline": "Isha Ambani: Young visionary behind Reliance Retail's rapid expansionIsha Ambani's work has been key in driving the rapid growth of Reliance Retail, which is now India's largest retailer by revenue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/tata-apple-plant-fire-iphone-production-india-festive-season-sales-surge-suppliers-may-shift-china-2609909-2024-10-02",
      "headline": "Apple may turn to China as fire halts ops at Tamil Nadu iPhone plant: ReportApart from local sales, Tata also exported iPhones to the Netherlands and the United States, as well as some parts to China, with a total value exceeding USD 250 million in the year up to August 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-valuation-raised-usd-133-billion-invesco-ahead-of-ipo-value-increase-2609905-2024-10-02",
      "headline": "Swiggy's valuation raised to $13.3 billion ahead of mega IPOThe increase in valuation for Swiggy comes ahead of its much anticipated Rs 10,000 crore IPO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-6-new-rules-for-fo-trading-impact-effect-what-it-means-for-retail-investors-2609883-2024-10-02",
      "headline": "Sebi's 6 new rules for F&O trading: What it means for retail investorsWith the introduction of these rules, the landscape of equity derivatives trading in India is set to undergo notable changes, particularly for retail participants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-expected-listing-gain-gmp-dips-post-allotment-can-it-be-multibagger-2609879-2024-10-02",
      "headline": "KRN Heat Exchanger IPO: GMP falls post allotment, can it still be multibagger?The IPO of KRN Heat Exchanger and Refrigeration Limited managed to attract huge interest from investors during the bidding process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-pmi-sluggish-demand-festive-season-consumer-spending-gdp-growth-2609859-2024-10-02",
      "headline": "Can festive spending jumpstart India's slowing economy?As the festive season gets underway, will consumer spending reignite India's economic momentum? Find out what experts are predicting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahatma-gandhi-was-not-first-choice-for-indias-currency-notes-october-2-2609853-2024-10-02",
      "headline": "Mahatma Gandhi wasn't 1st choice for India's currency. Here's what happenedThe currency notes from the 1950s and 60s featured images of animals like tigers and deer, along with symbols of India's development, such as the Hirakud Dam, the Aryabhatta satellite, and the Brihadeeswara Temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-mutual-fund-lite-all-you-need-to-know-details-sebi-approval-2609473-2024-10-01",
      "headline": "What is Mutual Fund Lite? All you need to knowThe aim of the Mutual Fund Lite framework is to simplify the rules for managing passively managed mutual funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-flat-as-banking-sector-downturn-offsets-it-surge-2609389-2024-10-01",
      "headline": "Sensex, Nifty end flat as banking sector downturn offsets IT surgeThe S&P BSE Sensex lost 33.49 points to end at 84,266.29, while the NSE Nifty50 was down by 13.95 points to close at 25,796.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-share-price-19-percent-correction-record-high-good-time-to-buy-trade-strategy-experts-2609359-2024-10-01",
      "headline": "RVNL shares down 19% from record high. Good time to buy? RVNL shares have corrected nearly 19% from its record high of Rs 647. Is now a good time to invest in RVNL stock, or should investors wait for clearer signals? Read on to know more. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-minister-konda-surekha-linking-ktr-to-samantha-prabhu-naga-chaitanya-divorce-retract-my-comments-2610327-2024-10-03",
      "headline": "Telangana minister apologises for Samantha-Naga Chaitanya divorce link-up to KTRTelangana minister Konda Surekha apologised for remarks on linking BRS leader KT Rama Rao with the divorce of actors Naga Chaitanya and Samantha Prabhu and said she expressed regret for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hassan-nasrallah-hezbollah-benjamin-netanyahu-israel-ceasefire-airstrike-beirut-lebanon-foreign-minister-2610365-2024-10-03",
      "headline": "Nasrallah agreed to ceasefire before he was killed by Israel: Lebanon ministerHassan Nasrallah, the Hezbollah chief who died in an Israeli airstrike last month, had agreed to a 21-day ceasefire with Israeli Prime Minister Benjamin Netanyahu shortly before his death, according to Lebanon Foreign Minister Abdallah Bou Habib."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-recalls-indian-envoy-mustafizur-rahman-in-diplomatic-reshuffle-2610361-2024-10-03",
      "headline": "Bangladesh recalls India envoy Mustafizur Rahman in diplomatic reshuffleThe foreign ministry ordered envoys in Brussels, Canberra, Lisbon, New Delhi and the permanent mission to the United Nations in New York to immediately return to Dhaka. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-issues-warning-after-cancer-causing-agents-found-in-12-bakery-cakes-2610377-2024-10-03",
      "headline": "Karnataka issues warning after cancer-causing agents found in 12 bakery cakesSeveral carcinogenic substances were found in 12 cake samples collected from several Bengaluru bakeries, the Karnataka Food Safety and Quality Department said while cautioning people about the popular dessert. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-dalal-street-bloodbath-sensex-nifty-crash-iran-israel-conflict-crude-oil-price-china-fiis-2610387-2024-10-03",
      "headline": "Iran-Israel clash, oil price rise: Key factors behind Dalal Street bloodbathA combination of geopolitical tensions in the Middle East, a rise in oil prices, and regulatory changes contributed to the significant downturn in the Indian stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-middle-east-lebanon-hezbollah-offensive-joe-biden-g7-leaders-missile-attacks-2610323-2024-10-03",
      "headline": "Israel 'plans' to hit Iran's nukes, Biden says response should be proportionateUS President Joe Biden was opposed to the idea of Israel striking Iran's nuclear and oil facilities amid Middle East tensions and urged the Jewish nation to act \"proportionately\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-hospital-doctor-shot-dead-men-pretext-injury-dressing-cctv-police-2610339-2024-10-03",
      "headline": "Two teens enter Delhi hospital under pretext of injury, shoot doctorA doctor was killed by two unknown teenagers inside a hospital in Delhi's Jaitpur area. After the incident, the police launched a probe into the incident to arrest the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/who-recommends-vaccine-shots-for-pregnant-women-and-infants-against-rsv-2610395-2024-10-03",
      "headline": "WHO recommends vaccine shots for pregnant women and infants against RSVThe WHO has recommended a single shot of RSV vaccine for pregnant women, in the third trimester that typically starts at 28 weeks, to protect their babies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-samantha-divorce-konda-surekha-apology-kt-rama-rao-2610358-2024-10-03",
      "headline": "Explained: Telangana minister's apology, why Akkineni family, Samantha slammed herCongress minister Konda Surekha leveled allegations against BRS leader KT Rama Rao, claiming he was responsible for the divorce of Naga Chaitanya and Samantha. She faced significant backlash for her unsubstantiated claims."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hezbollah-leader-killed-israeli-airstrike-hassan-nasrallah-friday-2610329-2024-10-03",
      "headline": "Funeral of Hezbollah leader Hassan Nasrallah to be held on Friday: ReportHassan Nasrallah was killed after Israel launched an airstrike on Hezbollah's headquarters in Beirut. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-nani-khushbu-konda-surekha-comments-kt-rama-rao-samantha-naga-chaitanya-2610334-2024-10-03",
      "headline": "Jr NTR, Nani and celebs call out Telangana minister's remarks on Telugu industryTelugu actors Jr NTR, Allu Arjun, Megastar Chiranjeevi, Nani and several others lashed out at Telangana minister Konda Surekha for passing controversial remarks regarding actors in the Telugu film industry. She linked BRS president KT Rama Rao to Naga Chaitanya and Samantha's divorce."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mohammad-azharuddin-summoned-by-ed-in-money-laundering-case-linked-to-hyderabad-cricket-association-2610372-2024-10-03",
      "headline": "Mohammad Azharuddin gets ED summons in Hyderabad cricket body corruption caseFormer cricketer and Congress leader Mohammed Azharuddin is accused of misappropriating funds during his tenure as the president of the Hyderabad Cricket Association."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-aamir-khan-should-not-have-done-laal-singh-chaddha-explains-why-he-declined-pushpa-2610363-2024-10-03",
      "headline": "SRK says Aamir Khan shouldn't have done Laal Singh ChaddhaShah Rukh Khan and Vicky Kaushal entertained the audience at IIFA 2024 by poking fun at each other and their contemporaries. At the event, SRK joked that Aamir shouldn't have done Laal Singh Chaddha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/100-newborns-iraq-named-after-hassan-nasrallah-shia-muslims-hezbollah-lebanon-israel-resistance-2610335-2024-10-03",
      "headline": "100 newborns named Nasrallah in Iraq after Hezbollah chief's killingHassan Nasrallah's death has sparked widespread anger and mourning in Iraq, particularly among the country's majority Shia population. Around 100 newborns in the country have been named \"Nasrallah\" as a tribute to the slain Hezbollah leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-couple-uber-crash-unable-sue-uber-eats-order-2610320-2024-10-03",
      "headline": "US couple couldn't sue Uber after life-altering crash due to Uber Eats orderAn appellate court said that the couple involved in the crash can't sue Uber as they agreed to arbitration when they accepted the terms of service while placing an Uber Eats order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/newlywed-first-dance-jerusalem-bomb-shelter-iran-missiles-attack-israel-2610239-2024-10-02",
      "headline": "Watch: Newlyweds' first dance in Jerusalem bomb shelter as Iran rained missilesA newlywed couple in Jerusalem shared their first dance in an underground bunker, just as Iran launched nearly 200 ballistic missiles toward Israel on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-carnival-luxury-mpv-ev9-suv-launch-today-expected-price-features-other-details-2610308-2024-10-03",
      "headline": "Kia Carnival luxury MPV, EV9 SUV launch todayKia is looking to make a mark in the premium space with the Carnival and the EV9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/japan-miyazaki-airport-us-world-war-2-era-bomb-exploded-flight-cancellation-2610353-2024-10-03",
      "headline": "Japan airport closed down after World War 2-era bomb explodes near runwayThe runway shutdown has led to the grounding of 87 flights but there is no danger of any further explosions and repair works to fill the hole should be completed by Thursday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-captaincy-2610328-2024-10-03",
      "headline": "'Aggresive' Rohit Sharma's captaincy mantra: Be calm, think wiselyIndia captain Rohit Sharma explained his captaincy mantra after India's riveting win against Bangladesh in Kanpur. India hammered Bangladesh by 7 wickets despite rain washing away nearly two and a half days of the game.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bank-of-america-says-outage-nearly-fixed-after-customers-see-0-account-balance-2610319-2024-10-03",
      "headline": "Bank of America says outage nearly fixed after customers see $0 account balanceIn a statement, the Bank of America said that services were restored after fixing the apparent glitch that showed customers a $0 balance in their bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-bengali-watch-mehidy-hasan-miraz-bat-india-vs-bangladesh-2610357-2024-10-03",
      "headline": "Watch: Virat Kohli flaunts fluent Bengali while endorsing Mehidy Hasan's batVeteran batter Virat Kohli spoke fluent Bengali while endorsing Mehidy Hasan Miraz's bat. The Bangladesh all-rounder was pleasantly surprised by Kohli's quip in Bengali. Mehidy also gifted a bat to India captain Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-in-lebanon-us-citizen-killed-white-house-us-congresswoman-rashida-tlaib-condemn-2610330-2024-10-03",
      "headline": "US citizen killed in Israeli strike in Lebanon while helping elderly: ReportA US citizen, Kamel Ahmad Jawad, who was in Lebanon to help the elderly and disabled, was killed in an Israeli strike in Beirut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-businessman-arrested-gunshots-celebratory-shot-birthday-party-bannerghatta-road-2610350-2024-10-03",
      "headline": "Bengaluru businessman arrested for firing gunshots in air at birthday partyA video of the incident went viral on social media, where the businessman, Syed Altaf Ahmad, can be seen firing six rounds of bullets in the air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/joker-joaquin-phoenix-rooney-mara-wife-marriage-rumours-2610343-2024-10-03",
      "headline": "Joaquin Phoenix addresses Rooney Mara as 'wife', sparks marriage rumoursHollywood icon Joaquin Phoenix sparked marriage speculations after he publicly referred to actor Rooney Mara as his 'wife' for the first time. The couple got engaged in 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-telangana-minister-konda-surekha-remarks-samantha-naga-chaitanya-2610399-2024-10-03",
      "headline": "Actor Vishnu Manchu on Telangana minister's remarks: Such actions create divisionActor and President of the Movie Artists Association (MAA), Vishnu Manchu reacted to the latest controversy after Congress minister Konda Surekha, leveled allegations against BRS leader KT Rama Rao, claiming he was responsible for the divorce of Naga Chaitanya and Samantha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-health-latest-update-superstar-to-now-be-discharged-from-hospital-on-friday-after-heart-issue-2610402-2024-10-03",
      "headline": "Rajinikanth to now be discharged from hospital on Friday after heart issue: ReportSuperstar Rajinikanth was admitted to a hospital in Chennai on Monday and, as per the medical bulletin, he was expected to return home today. However, the doctors have decided to keep him under observation for one more day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-minister-konda-surekha-linking-ktr-to-samantha-prabhu-naga-chaitanya-divorce-retract-my-comments-2610327-2024-10-03",
      "headline": "Telangana minister apologises for Samantha-Naga Chaitanya divorce link-up to KTRTelangana minister Konda Surekha apologised for remarks on linking BRS leader KT Rama Rao with the divorce of actors Naga Chaitanya and Samantha Prabhu and said she expressed regret for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/payal-kapadia-all-we-imagine-as-light-director-time100-next-2024-list-ayushmann-khurrana-note-2610400-2024-10-03",
      "headline": "Payal Kapadia, 'All We Imagine…' director, on Time100 NEXT 2024 list of emerging leadersDirector Payal Kapadia, who won the Grand Prix at Cannes for All We Imagine As Light, was featured on the Time100 Next 2024 list. Ayushmann Khurrana wrote a note for her, praising her for her universal storytelling.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-ai-tool-social-media-protect-toxic-content-2610404-2024-10-03",
      "headline": "AI tool launched to protect players from toxic social media contentAt the Women's T20 World Cup, the International Cricket Council has come up with a first-of-its-kind initiative to protect players from toxic online content. As many as 60 players have already signed up for the tool, which will monitor and moderate comments on social media platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-atletico-madrid-vs-benfica-2610392-2024-10-03",
      "headline": "Champions League: Atletico coach Simione humbled after 0-4 loss vs BenficaAtletico Madrid manager Diego Simeone tried to look for the positives despite his team's heavy 4-0 defeat against Benfica in the Champions League on Wednesday. Simeone said that Atletico were outplayed but did not lack desire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/praveen-jayawickrama-sri-lanka-banned-icc-anti-corruption-lanka-premier-league-2610382-2024-10-03",
      "headline": "Sri Lanka spinner Jayawickrama banned for breaching ICC anti-corruption codeLeft-arm spinner Praveen Jayawickrama, 26, has been handed a one-year ban by the International Cricket Council for failing to report a corrupt approach during Lanka Premier League in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-retention-rules-explained-sledging-room-podcast-s02-ep-55-2610388-2024-10-03",
      "headline": "New IPL Rules - Yay or Nay? | Sledging Room S02, Ep 55The Indian Premier League announced its most detailed mega-auction rules for the 2025 season. In the latest episode of the Sledging Room Podcast, Akshay Ramesh, Saurabh Kumar and Kingshuk Kusari discuss the good, the bad and the ugly of the new retention and auction rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-rishabh-pant-ipl-retention-rules-auction-2610370-2024-10-03",
      "headline": "Delhi Capitals will 'definitely' retain Rishabh Pant: Co-owner spills the beansDC co-owner Parth Jindal said that they were definitely retaining Rishabh Pant ahead of the Indian Premier League auction. Teams have been allowed a total of 6 retentions this season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-bengali-watch-mehidy-hasan-miraz-bat-india-vs-bangladesh-2610357-2024-10-03",
      "headline": "Watch: Virat Kohli flaunts fluent Bengali while endorsing Mehidy Hasan's batVeteran batter Virat Kohli spoke fluent Bengali while endorsing Mehidy Hasan Miraz's bat. The Bangladesh all-rounder was pleasantly surprised by Kohli's quip in Bengali. Mehidy also gifted a bat to India captain Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-lille-shock-real-madrid-end-teams-36-match-unbeaten-run-2610342-2024-10-03",
      "headline": "Champions League: Lille shock Real Madrid, end team's 36-match unbeaten runFrench side Lille stunned defending champions Real Madrid with a 1-0 home victory in the Champions League group phase. This brought an end to Madrid's 36-match unbeaten streak in all competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-indias-complete-schedule-squad-where-to-watch-2610337-2024-10-03",
      "headline": "Women's T20 World Cup: India's complete schedule, squad, where to watchThe Women's T20 World Cup is set to begin on October 3, Thursday. India under the leadership of Harmanpreet Kaur, India are hunting their maiden title. Here's everything you need to know about the Indian team's fixtures in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-captaincy-2610328-2024-10-03",
      "headline": "'Aggresive' Rohit Sharma's captaincy mantra: Be calm, think wiselyIndia captain Rohit Sharma explained his captaincy mantra after India's riveting win against Bangladesh in Kanpur. India hammered Bangladesh by 7 wickets despite rain washing away nearly two and a half days of the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-babar-azam-mohammad-rizwan-2610322-2024-10-03",
      "headline": "Pakistan expected to name 3 separate captains after Babar's resignation: ReportsPakistan might appoint three separate captains in three formats after the resignation of Babar Azam from the position of white-ball captain. PTI reported that the choice might not be straightforward due to workload issues.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-vs-ravindra-jadeja-border-gavaskar-trophy-2024-25-2610305-2024-10-03",
      "headline": "Ashwin vs Jadeja battle portends positive signs for India ahead of Australia tourThe Indian cricket team will once again have to scratch their heads in deciding between Ravindra Jadeja and Ravichandran Ashwin while picking their playing XI on the tour of Australia later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-lille-shock-real-madrid-end-teams-36-match-unbeaten-run-2610342-2024-10-03",
      "headline": "Champions League: Lille shock Real Madrid, end team's 36-match unbeaten runFrench side Lille stunned defending champions Real Madrid with a 1-0 home victory in the Champions League group phase. This brought an end to Madrid's 36-match unbeaten streak in all competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-indias-complete-schedule-squad-where-to-watch-2610337-2024-10-03",
      "headline": "Women's T20 World Cup: India's complete schedule, squad, where to watchThe Women's T20 World Cup is set to begin on October 3, Thursday. India under the leadership of Harmanpreet Kaur, India are hunting their maiden title. Here's everything you need to know about the Indian team's fixtures in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-captaincy-2610328-2024-10-03",
      "headline": "'Aggresive' Rohit Sharma's captaincy mantra: Be calm, think wiselyIndia captain Rohit Sharma explained his captaincy mantra after India's riveting win against Bangladesh in Kanpur. India hammered Bangladesh by 7 wickets despite rain washing away nearly two and a half days of the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-babar-azam-mohammad-rizwan-2610322-2024-10-03",
      "headline": "Pakistan expected to name 3 separate captains after Babar's resignation: ReportsPakistan might appoint three separate captains in three formats after the resignation of Babar Azam from the position of white-ball captain. PTI reported that the choice might not be straightforward due to workload issues.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-vs-ravindra-jadeja-border-gavaskar-trophy-2024-25-2610305-2024-10-03",
      "headline": "Ashwin vs Jadeja battle portends positive signs for India ahead of Australia tourThe Indian cricket team will once again have to scratch their heads in deciding between Ravindra Jadeja and Ravichandran Ashwin while picking their playing XI on the tour of Australia later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/after-t20i-upset-south-africa-thump-ireland-by-139-runs-to-take-1-0-lead-in-odis-2610306-2024-10-03",
      "headline": "After T20I upset, South Africa thump Ireland by 139 runs to take 1-0 lead in ODIsSouth Africa registered a thumping win against Ireland by 139 runs to take a 1-0 lead in the ODI series. Ryaan Rickelton was named as the Player of the Match for his 91-run knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-live-streaming-squads-schedule-and-all-you-need-to-know-2610302-2024-10-02",
      "headline": "Women's T20 World Cup Live Streaming: Squads, schedule and all you need to know The Women's T20 World Cup 2024 is set to kick off from October 3 in the UAE. Find out all the details about the marquee tournament here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-eng-jos-buttler-jafer-chohan-john-turner-dan-mousley-2610282-2024-10-02",
      "headline": "Jos Buttler returns to England squad for white-ball tour of West IndiesEngland white-ball captain Jos Buttler has made his return to the team for the upcoming white-ball tour to the West Indies. Buttler missed the last series against Australia due to calf injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-reunites-with-daughter-takes-her-to-mall-for-shopping-day-out-2610259-2024-10-02",
      "headline": "Mohammed Shami reunites with daughter, takes her to mall for shopping day outMohammed Shami shared an emotional video on Instagram as he reunited with his daughter after a long time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-injury-border-gavaskar-trophy-2024-25-fake-news-2610253-2024-10-02",
      "headline": "Mohammed Shami calls out 'fake news' over his availability for Australia tourStar India fast bowler Mohammed Shami called out false reports questioning his participation in the upcoming Border Gavaskar Trophy 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-shreyas-iyer-gives-cold-drinks-to-kids-at-ekana-amid-sweltering-heat-2610237-2024-10-02",
      "headline": "Irani Cup: Shreyas Iyer gives cold drinks to kids at Ekana amid sweltering heatIn a heart-warming gesture, Shreyas Iyer distributed cold drinks to kids who came to watch the players at Ekana Stadium in Lucknow amid sweltering heat. He is part of Mumbai's Ranji Trophy-winning squad who are playing Rest of India in Irani Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-ram-temple-ayodhya-ind-vs-ban-kanpur-test-2610233-2024-10-02",
      "headline": "Akash Deep visits Ayodhya Ram Temple, prays for Team India's future successStar India fast bowler Akash Deep visited the holy shrine of Lord Ram in Ayodhya to seek blessings for the team's future success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/point-of-the-year-alcaraz-and-sinner-play-out-incredible-rally-in-china-open-2610221-2024-10-02",
      "headline": "Point of the year? Alcaraz and Sinner play out incredible rally in China OpenCarlos Alcaraz edged past defending champion Jannik Sinner in a thrilling China Open final, overcoming a set deficit and winning 6-7(6), 6-4, 7-6(3) after three hours and 21 minutes. This victory marks Alcaraz's fourth title of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-injury-border-gavaskar-trophy-2024-25-fake-news-2610253-2024-10-02",
      "headline": "Mohammed Shami calls out 'fake news' over his availability for Australia tourStar India fast bowler Mohammed Shami called out false reports questioning his participation in the upcoming Border Gavaskar Trophy 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-shreyas-iyer-gives-cold-drinks-to-kids-at-ekana-amid-sweltering-heat-2610237-2024-10-02",
      "headline": "Irani Cup: Shreyas Iyer gives cold drinks to kids at Ekana amid sweltering heatIn a heart-warming gesture, Shreyas Iyer distributed cold drinks to kids who came to watch the players at Ekana Stadium in Lucknow amid sweltering heat. He is part of Mumbai's Ranji Trophy-winning squad who are playing Rest of India in Irani Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-ram-temple-ayodhya-ind-vs-ban-kanpur-test-2610233-2024-10-02",
      "headline": "Akash Deep visits Ayodhya Ram Temple, prays for Team India's future successStar India fast bowler Akash Deep visited the holy shrine of Lord Ram in Ayodhya to seek blessings for the team's future success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/point-of-the-year-alcaraz-and-sinner-play-out-incredible-rally-in-china-open-2610221-2024-10-02",
      "headline": "Point of the year? Alcaraz and Sinner play out incredible rally in China OpenCarlos Alcaraz edged past defending champion Jannik Sinner in a thrilling China Open final, overcoming a set deficit and winning 6-7(6), 6-4, 7-6(3) after three hours and 21 minutes. This victory marks Alcaraz's fourth title of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rohit-sharma-green-park-kanpur-2610218-2024-10-02",
      "headline": "Rohit Sharma credits his perfect jump for completing one-handed stunner in KanpurIndia captain Rohit Sharma credited his perfect jump after completing stunning one-handed catch during the second Test against Bangladesh at Green Park in Kanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinesh-phogat-claims-she-refused-to-speak-to-pm-modi-after-olympics-reveals-reason-2610199-2024-10-02",
      "headline": "Vinesh Phogat claims she refused to speak to PM Modi after Olympics, reveals reasonVinesh Phogat claimed that she refused to speak to PM Modi after the Paris Olympics fiasco. She said she would have appreciated a genuine conversation with the Prime Minister without any conditions to publicise it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rohit-sharma-mehidy-hasan-miraz-bat-gift-kanpur-2610188-2024-10-02",
      "headline": "Watch: Mehidy Hasan gifts Rohit Sharma special bat after Bangladesh Test seriesBangladesh all-rounder Mehidy Hasan Miraz gifted Rohit Sharma a bat made by his own company after the conclusion of the Kanpur Test. Mehidy started his own bat company 'MKS Sports' last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-ind-vs-ban-bazball-rohit-sharma-ben-stokes-2610183-2024-10-02",
      "headline": "Michael Vaughan claims India copied England in Kanpur Test win over BangladeshFormer England captain Michael Vaughan stated that India copied England's Bazball style of play during their victory over Bangladesh in the second Test in Kanpur. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}