{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-energy-solutions-downplays-kenya-scrapping-736-million-power-deal-no-material-impact-2639242-2024-11-24",
      "headline": "Adani firm downplays Kenya scrapping $736 million power deal: No material impactAdani Energy Solutions said there was \"no material impact\" on the company's operations after Kenya cancelled a $736 million transmission line project over Gautam Adani's indictment in a bribery case in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-reaction-bjp-led-mahayuti-win-maharashtra-will-it-lead-to-maha-rally-on-dalal-street-expert-view-2639133-2024-11-24",
      "headline": "BJP-led Mahayuti win Maharashtra: Will it lead to 'maha' rally on Dalal Street?The results of the Maharashtra assembly election, announced on Saturday, are expected to have a notable impact on the stock markets when trading resumes on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-gets-richer-wealth-hits-all-time-high-tesla-shares-surge-spacex-xai-usd-70-billion-addition-2638737-2024-11-23",
      "headline": "Elon Musk gets even richer after wealth hits all-time high post Trump winThe jump in Elon Musk's fortune came after Tesla shares rose 3.8% on Friday, reaching a 3.5-year closing high of $352.56 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-jeff-bezos-tesla-stock-space-x-us-electiosn-donald-trump-2638708-2024-11-23",
      "headline": "Jeff Bezos denies Musk's claim on Tesla stock advice: '100% not true'Elon Musk said on social media platform X that Bezos had advised people to sell their Tesla and SpaceX shares, predicting Donald Trump's electoral defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-founder-told-us-ally-to-flee-the-us-to-avoid-testifying-report-2637906-2024-11-22",
      "headline": "Byju's founder told US ally to flee the US to avoid testifying: ReportThe businessman, William R. Hailer, testified before US Bankruptcy Judge John T. Dorsey, alleging that Byju Raveendran offered him a lucrative job and sent him a $10,700 plane ticket to Dubai just two days before he was scheduled to testify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-today-sensex-2000-points-nifty-above-23900-2637809-2024-11-22",
      "headline": "Sensex ends nearly 2,000 points higher, Nifty above 23,900A broad-based recovery in information technology (IT), financial, banking and energy stocks spearheaded the recovery. A sharp rebound in Adani Group stocks also added to the positive momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-2000-points-key-factors-adani-shares-2637775-2024-11-22",
      "headline": "Sensex surges 2,000 points, Rs 7 lakh crore added: 4 key factors behind rallyThe Sensex was up 2039.44 points to 79,195.23 at 2:57 pm, while the NSE Nifty50 gained 587.90  to 23,938.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-high-within-touching-distance-of-100000-dollar-milestone-2637714-2024-11-22",
      "headline": "Bitcoin hits record high, within touching distance of $100,000 milestoneThe world's leading cryptocurrency topped $99,300, coming within striking distance of the psychological milestone that many experts had anticipated after the US election results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-1200-points-nifty-3-things-to-know-stock-market-bull-run-2637706-2024-11-22",
      "headline": "Sensex jumps 1,200 points: 3 things to know about today's stock market bull runThe BSE Sensex climbed 1,193.90 points to cross 78,340.07, while the NSE Nifty advanced 371.50 points to reach 23,721.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-rises-1000-points-nifty-rebounds-adani-stocks-in-green-2637683-2024-11-22",
      "headline": "Sensex jumps over 1,000 points as most Adani Group stocks rebound sharplyStock market today: The S&P BSE Sensex climbed 1,034.76 points to 78,190.55 by 12:42 pm, while the NSE Nifty50 gained 329.15 points to reach 23,679.05. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-accused-of-racial-discrimination-at-australian-coal-mining-unit-2637668-2024-11-22",
      "headline": "Adani Group accused of racial discrimination at Australian coal mining unitAdani Bribery Case: The Nagana Yarrbayn Wangan & Jagalingou Cultural Custodians in Queensland state filed a complaint alleging serious racial discrimination by Bravus Mining and Resources, an Adani Group unit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-bribery-case-sp-lowers-outlook-on-3-adani-units-raises-funding-concerns-2637623-2024-11-22",
      "headline": "Adani bribery case: S&P lowers outlook on 3 Adani units, raises funding concernsGautam Adani Case: S&P expressed concerns that the accusations could erode investor confidence, impair funding access, and escalate borrowing costs for the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-listing-stock-market-debut-investors-hold-or-exit-2637602-2024-11-22",
      "headline": "Zinka Logistics makes tepid market debut: Should investors hold or exit?Zinka Logistics listing: Shares listed at Rs 280.90 on the National Stock Exchange (NSE), a 2.89% premium to the issue price of Rs 273. On the Bombay Stock Exchange (BSE), the stock opened at Rs 279.05, reflecting a 2.22% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-layoffs-500-employees-restructuring-drive-sales-profitability-2637591-2024-11-22",
      "headline": "Ola Electric layoffs: 500 employees likely to lose jobs amid restructuringOla Electric Layoffs News: The move aims to streamline operations, eliminate redundant roles, and enhance profitability. The restructuring process, which began months ago, is expected to conclude by December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-22-2024-precious-metals-record-hike-on-mcx-2637583-2024-11-22",
      "headline": "Gold, silver price today, November 22, 2024: Precious metals record hike on MCXGold Price Today: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-fall-second-straight-day-bribery-charges-check-top-losers-2637582-2024-11-22",
      "headline": "Adani Group stocks extend slide amid bribery charges. Details hereAdani Group stocks: This marks the second consecutive session of heavy losses for the conglomerate, with Thursday's rout wiping out Rs 2.25 lakh crore from the group's market capitalisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sagar-adani-gautam-adani-group-bribery-case-bribe-notes-indictment-solar-energy-corruption-2637574-2024-11-22",
      "headline": "How Sagar Adani's 'bribe notes' unravelled $250 million schemeAdani Bribery Case: At the heart of the complex bribery scheme for which Gautam Adani and his associates have been indicted are the industrialist's nephew Sagar Adani and the detailed \"bribe notes\" he kept on his mobile phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-jump-3-percent-today-after-brokerage-bernsteins-update-should-you-buy-2637570-2024-11-22",
      "headline": "Paytm shares jump 3% today after brokerage Bernstein's update. Should you buy?Paytm share price: With shares up 34% this year and 136% in six months, Paytm's growth potential continues to attract investor interest, although challenges remain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-bounce-back-despite-adani-stocks-enterprises-green-ports-triggering-sell-off-2637558-2024-11-22",
      "headline": "Sensex, Nifty bounce back; Adani Energy shares down 5%Stock Market Today: The S&P BSE Sensex was up 496.10 points to 77,651.89, while the NSE Nifty50 gained 72.25 points to 23,422.15 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-adani-green-airtel-lti-jsw-zinka-stocks-to-watch-today-2637523-2024-11-22",
      "headline": "Adani Enterprises, Adani Green, Airtel, LTI, JSW, Zinka: Stocks to watch todayBroader market indices also faced selling pressure, with volatility surging across sectors. As trading opens today, several stocks are expected to remain in focus due to recent developments."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-election-result-piyush-goyal-bjp-mahayuti-uddhav-thackeray-shiv-sena-eknath-shinde-mva-congress-ncp-2639415-2024-11-24",
      "headline": "Uddhav Thackeray joining hands with MVA was treachery at its worst: Piyush GoyalUnion Minister Piyush Goyal accused Shiv Sena (UBT) chief Uddhav Thackeray of having a \"lust for power\" after he broke off ties with the BJP in 2019 and his Shiv Sena joined the Opposition Maha Vikas Aghadi (MVA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-aucion-day-1-top-talking-points-rishabh-pant-costliest-steal-buys-biggest-gainers-2639431-2024-11-25",
      "headline": "Day 1 talking points: Rishabh Pant shatters record, Iyer tax and craze for pace  Highlights IPL mega auction: Rishabh Pant became the most expensive buy in the history of auction when he was sold to Lucknow for Rs 27 crore. Jitesh Sharma, who went to RCB at Rs 11 crore, was the biggest gainer. Here are the top talking points from Jeddah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/clashes-in-ups-sambhal-over-mosque-survey-cops-fire-tear-gas-shells-2639107-2024-11-24",
      "headline": "4 killed, 20 cops injured in protest against mosque survey in UP's SambhalA complaint, filed by Supreme Court lawyer Vishnu Shankar Jain, claimed that Mughal emperor Babar demolished a temple, Hari Har Mandir, which once stood at the site of the Shahi Masjid in UP's Sambhal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/uddhav-thackeray-kangana-ranaut-daitya-mahayuti-mva-shiv-sena-bjp-2639380-2024-11-24",
      "headline": "Monster who disrespects women: Kangana Ranaut attacks Uddhav ThackerayKangana Ranaut pointed to her past clashes with the Maha Vikas Aghadi (MVA) government when the Brihanmumbai Municipal Corporation demolished alleged illegal alterations at her Bandra bungalow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/rent-crisis-grips-india-landlords-bend-rules-employ-tricks-threats-delhi-noida-bengaluru-flats-broker-2637989-2024-11-24",
      "headline": "Rent crisis grips India as landlords bend rules, employ tricks and threatsHouse rents, stagnant since the pandemic, started zooming from mid-2023 by up to 50%, and are still surging. Even after a year, house rents haven't stabilised, and landlords are shortening agreement duration and issuing eviction threats for further unusual rent hikes. This has added to anxiety and agony among tenants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-hezbollah-fires-over-200-rockets-as-israel-launches-big-strike-on-beirut-2639445-2024-11-25",
      "headline": "Hezbollah fires over 200 rockets after Israel launches big strike on BeirutHezbollah, which has previously vowed to respond to attacks on Beirut by targeting Tel Aviv, said it had launched precision missiles at two military sites in Tel Aviv and nearby."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/diljit-dosanjh-dil-luminati-concert-pune-bjp-mla-chandrakant-patil-alcohol-permit-2639396-2024-11-24",
      "headline": "Excise department cancels alcohol permit for Diljit Dosanjh's Pune concertNewly-elected BJP MLA Chandrakant Patil was among the leaders who opposed Diljit Dosanjh's concert in Pune and said that such events were \"against the culture\" of the city and shouldn't be allowed to take place."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-viral-video-cops-save-passenger-after-she-falls-from-moving-train-at-kanpur-station-2639444-2024-11-25",
      "headline": "Video: Woman jumps off moving train in UP, rescued by quick-thinking copTwo Railway police officials saved a woman passenger's life after she jumped off a moving train's coach, stuck into the gap between the train and the platform and got dragged by the train at Kanpur Central Station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/singer-shreya-ghoshal-sahitya-aajtak-2024-pihu-bole-unreleased-version-2639404-2024-11-24",
      "headline": "Shreya Ghoshal enthralls audience at Sahitya AajTak 2024Shreya Ghoshal mesmerised the audience at Sahitya AajTak 2024 with a captivating performance, featuring both her popular hits and an exclusive unreleased track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/behind-bjps-jharkhand-loss-tribal-trust-that-divisive-tactics-couldnt-regain-2024-jharkhand-assembly-election-results-2639344-2024-11-24",
      "headline": "Behind BJP's Jharkhand loss, tribal trust that divisive tactics couldn't regainThe party, which prided itself as the creator of Jharkhand, now lies estranged from the very tribal community it had set out to champion"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/jaipur/story/jaipur-man-attempting-suicide-saved-after-friend-sees-his-facebook-livestream-2639449-2024-11-25",
      "headline": "Jaipur man's suicide bid foiled after friend sees his Facebook livestreamA man in Jaipur was prevented from dying by hanging himself, an act he livestreamed on Facebook, after his friend alerted police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-didnt-know-who-kishore-kumar-was-ranbir-kapoor-on-understanding-ones-roots-2639297-2024-11-24",
      "headline": "Alia didn't know who Kishore Kumar was: Ranbir Kapoor on understanding one's rootsActor Ranbir Kapoor, during a session at IFFI Goa, talked about being aware of iconic movie personalities. He also underscored the importance of knowing 'one's roots' in life. The actor took an example of his wife and actor Alia Bhatt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/cop29-baku-unfcc-climate-conference-climate-finance-to-300-billion-per-year-india-says-rejects-deal-2639442-2024-11-25",
      "headline": "COP29 raises climate finance to $300 billion a year, India says 'optical illusion'Calling the proposed amount of $300 billion a year an \"optical illusion\", an Indian representative at COP 29 said that it wouldn't address the real climate challenges and added that it reflects the unwillingness of the developed country parties to fulfil their responsibilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/ajit-pawar-maharashtra-polls-result-sharad-pawar-first-reaction-ncp-mahavikas-aghadi-2639322-2024-11-24",
      "headline": "Ajit Pawar got more seats but Maharashtra knows who founded NCP: Sharad PawarFollowing MVA's rout in Maharashtra, Sharad Pawar acknowledged that his nephew Ajit Pawar won 41 of 288 Assembly seats and said everyone knew who founded the NCP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-rcb-snub-rtm-for-glenn-maxwell-australia-star-returns-to-pbks-2639366-2024-11-24",
      "headline": "IPL auction: RCB snub RTM for Glenn Maxwell, Australia star returns to PBKSThe Royal Challengers Bengaluru did not use their RTM for Glenn Maxwell as the Australian star returned to PBKS for Rs 4.20 crore. England's wicketkeeper-batter Phil Salt was sold for Rs 11.50 crore to RCB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-frankfurt-techie-now-begging-in-jayanagar-sarath-yuvaraja-viral-videos-2639270-2024-11-24",
      "headline": "Once a techie in Frankfurt, now begging in Bengaluru: Man shares story in viral videosSeveral videos of a Bengaluru man who claimed to be an engineer and had worked in Frankfurt, now begging on the streets of the city, went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-perth-test-day-3-report-virat-jaiswal-hundred-australia-target-india-top-2639247-2024-11-24",
      "headline": "Virat Kohli 100, Yashasvi Jaiswal 161 deflate Australia as India smell victoryBorder-Gavaskar Trophy: India ended Day 3 of the opening Test against Australia firmly in control, with Virat Kohli's stylish century and Yashasvi Jaiswal's career-best 161 powering them to a commanding position. India set an imposing victory target of 534 and removed three Australian wickets in the final session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-chief-concludes-visit-to-nepal-strengthening-bilateral-ties-2639310-2024-11-24",
      "headline": "Indian Army Chief concludes 5-day visit to Nepal, strengthening bilateral tiesGeneral Upendra Dwivedi, Chief of Army Staff, concluded a five-day visit to Nepal, strengthening India-Nepal defence ties through strategic discussions and cultural exchanges. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-in-priyanka-gandhi-vadras-wayanad-win-cpim-sees-no-setback-for-pinarayi-2024-wayanad-bye-election-results-2639332-2024-11-24",
      "headline": "Why in Priyanka's Wayanad win, CPI(M) sees no setback for PinarayiThe CPI(M)'s continuing dominance in Chelakkara and the BJP's failure to beat the Congress in Palakkad mean the Kerala CM can pitch the bypoll verdict as overall positive"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/i-trust-ar-rahman-with-my-life-love-him-saira-in-new-statement-after-separation-2639227-2024-11-24",
      "headline": "I trust AR Rahman with my life, love him: Saira in new statement after separationAR Rahman's estranged wife Saira addressed the speculations and defamatory posts about the reason behind their separation in a new statement on Sunday. She expressed her love for Rahman, and requested everyone to provide privacy for the family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-review-energy-deal-adani-group-sheikh-hasina-regime-2639308-2024-11-24",
      "headline": "Bangladesh seeks to review energy deal with Adani Group signed during Hasina reignBangladesh Chief Adviser Muhammad Yunus's office said the committee was currently reviewing seven major energy and power projects, including Adani's coal-fired plant, a wholly-owned subsidiary of Adani Power Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-chennai-event-live-stage-allu-arjun-rashmika-mandanna-sreeleela-kissik-sukumar-2639244-2024-11-24",
      "headline": "Allu Arjun, Rashmika Mandanna, Sreeleela receive thunderous welcome in ChennaiPushpa 2: The Rule Chennai Event Live Update: Allu Arjun and his team have arrived in Chennai to promote their upcoming film. At the event titled 'Pushpa Wildfire Event,' the stars will talk about the film and release a special song titled Kissik featuring Sreeleela."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-mahayuti-next-cm-race-maratha-eknath-shinde-or-brahmin-devendra-fadnavis-2638994-2024-11-24",
      "headline": "Will Brahmin Fadnavis lose CM race to himself, and not Shinde?Devendra Fadnavis, a former Maharashtra Chief Minister, had to play the role of a deputy to Eknath Shinde for over two years. Fadnavis, a Brahmin, has emerged as the brightest star in BJP's stellar victory in the Assembly election. Will Fadnavis get the CM's chair, or will he lose the race to himself, and not Shinde?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/photo/shreya-ghoshal-captivates-audience-performance-at-sahitya-aajtak-2639412-2024-11-24",
      "headline": "Pics: Shreya Ghoshal captivates audience with her performance at Sahitya AajTakSinger Shreya Ghoshal concluded the three-day Sahitya AajTak 2024 in New Delhi on a musical note with her magical performance. The singer sang some of her popular chartbusters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/singer-shreya-ghoshal-sahitya-aajtak-2024-pihu-bole-unreleased-version-2639404-2024-11-24",
      "headline": "Shreya Ghoshal enthralls audience at Sahitya AajTak 2024Shreya Ghoshal mesmerised the audience at Sahitya AajTak 2024 with a captivating performance, featuring both her popular hits and an exclusive unreleased track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kissik-pushpa-2-song-sreeleela-allu-arjun-2639399-2024-11-24",
      "headline": "Kissik from Pushpa 2 out: Sreeleela and Allu Arjun deliver new dance anthemKissik, the new dance anthem from Pushpa 2: The Rule, was launched on November 24 in Chennai. The pre-release event of Pushpa 2 took place at Leo Muthu Indoor Stadium today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-accepts-animal-criticism-mentions-creativity-and-responsible-cinema-2639379-2024-11-24",
      "headline": "Ranbir Kapoor accepts Animal criticism, mentions creativity and responsible cinemaActor Ranbir Kapoor answered a question about starring in a violent film like Animal, and if actors should make responsible choices in cinema. He was speaking during a special session at IFFI Goa. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-perth-test-jasprit-bumrah-bowling-average-sydney-barnes-2639453-2024-11-25",
      "headline": "Peerless in modern-era, Jasprit Bumrah set for major landmark in Perth TestAustralia vs India, Perth Test: Jasprit Bumrah became only the second bowler after Sydney Barnes in 1914 to have more than 150 wickets in Tests at an average of less than 20. Bumrah achieved the feat during a deadly spell on Day 3 of the series opener in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/austria-vs-india-live-score-perth-test-day-4-reactions-border-gavaskar-trophy-2639438-2024-11-25",
      "headline": "1st Test, Day 4 Live: India eye historic win in PerthAUS vs IND, 1st Test Day 4 Live: India are on the verge of registering a historic win in Perth as they left Australia reeling at 12/3 at stumps on Day 3. Jasprit Bumrah and his men will be aiming to hammer the final nail in the coffin by picking the remaining seven wickets on the last day and go 1-0 up in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ms-dhoni-dwayne-bravo-chennai-super-kings-csk-ipl-2025-mega-auction-2639435-2024-11-25",
      "headline": "Watch: MS Dhoni surprises Dwayne Bravo via video call during IPL 2025 auctionLegendary Chennai Super Kings (CSK) captain MS Dhoni suprised his former teammate Dwayne Bravo on a video call during the IPL 2025 mega auctio in Jeddah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-squads-of-all-ten-teams-after-day-1-2639434-2024-11-25",
      "headline": "IPL 2025 auction: Here's how ten teams look after Day 1After several players were sold for huge amount on Day 1 of the IPL 2025 mega auction, here's what the ten teams look like."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-costliest-players-steal-deals-rishabh-pant-shreyas-iyer-2639433-2024-11-25",
      "headline": "IPL 2025 auction: Costliest players and steal deals after thrilling Day 1The IPL 2025 mega auction delivered historic buys and surprising bargains. Rishabh Pant shattered records, while franchises snagged some marquee names for unexpected prices. Day 1 set the stage for a thrilling IPL season, brimming with anticipation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-aucion-day-1-top-talking-points-rishabh-pant-costliest-steal-buys-biggest-gainers-2639431-2024-11-25",
      "headline": "Day 1 talking points: Rishabh Pant shatters record, Iyer tax and craze for pace Highlights IPL mega auction: Rishabh Pant became the most expensive buy in the history of auction when he was sold to Lucknow for Rs 27 crore. Jitesh Sharma, who went to RCB at Rs 11 crore, was the biggest gainer. Here are the top talking points from Jeddah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-day-1-full-sold-players-unsold-purse-remaining-spots-left-2639432-2024-11-25",
      "headline": "IPL 2025 Auction, Day 1: Full list of sold and unsold playersThe IPL 2025 Auction day 1 saw all 10 teams splash the cash for some top players in Jeddah, Saudi Arabia on November 24, Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-nehal-wadhera-naman-dhir-ashutosh-sharma-2639414-2024-11-24",
      "headline": "IPL auction: Rasikh Salam, Nehal Wadhera emerge as top buys in uncapped playersThe IPL 2025 mega auction saw several uncapped players being sold for big prices as Nehal Wadhera, Abdul Samad, Naman Dhir, Ashutosh Sharma took home big money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-naman-dhir-robin-minz-mumbai-indians-mi-2639425-2024-11-24",
      "headline": "Who are Naman Dhir and Robin Minz? Mumbai Indians' latest uncapped buysMumbai Indians bought three uncapped players on Day 1 of the IPL 2025 mega auction. Here are complete details of two big names Naman Dhir and Robin Minz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-venkatesh-iyer-kkr-captain-reaction-mega-23-crore-payday-2639422-2024-11-24",
      "headline": "Venkatesh Iyer 'more than happy' to captaining KKR after Rs 23.75 crore saleIPL mega auction: All-rounder Venkatesh Iyer was bought for a whopping Rs 23.75 crore on Sunday in Jeddah. The Madhya Pradesh batter said he is ready to captain Kolkata Knight Riders, if given an opportunity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-hundred-perth-test-2639411-2024-11-24",
      "headline": "Virat Kohli will have a tear in his eye: Ravi Shastri on emotional Perth hundredRavi Shastri heaped praise on Virat Kohli after he scored his 30th hundred during Day 3 of the Perth Test. Kohli's hundred helped India set a big total of 534 runs.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-day-1-full-sold-players-unsold-purse-remaining-spots-left-2639432-2024-11-25",
      "headline": "IPL 2025 Auction, Day 1: Full list of sold and unsold playersThe IPL 2025 Auction day 1 saw all 10 teams splash the cash for some top players in Jeddah, Saudi Arabia on November 24, Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-nehal-wadhera-naman-dhir-ashutosh-sharma-2639414-2024-11-24",
      "headline": "IPL auction: Rasikh Salam, Nehal Wadhera emerge as top buys in uncapped playersThe IPL 2025 mega auction saw several uncapped players being sold for big prices as Nehal Wadhera, Abdul Samad, Naman Dhir, Ashutosh Sharma took home big money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-naman-dhir-robin-minz-mumbai-indians-mi-2639425-2024-11-24",
      "headline": "Who are Naman Dhir and Robin Minz? Mumbai Indians' latest uncapped buysMumbai Indians bought three uncapped players on Day 1 of the IPL 2025 mega auction. Here are complete details of two big names Naman Dhir and Robin Minz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-venkatesh-iyer-kkr-captain-reaction-mega-23-crore-payday-2639422-2024-11-24",
      "headline": "Venkatesh Iyer 'more than happy' to captaining KKR after Rs 23.75 crore saleIPL mega auction: All-rounder Venkatesh Iyer was bought for a whopping Rs 23.75 crore on Sunday in Jeddah. The Madhya Pradesh batter said he is ready to captain Kolkata Knight Riders, if given an opportunity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-hundred-perth-test-2639411-2024-11-24",
      "headline": "Virat Kohli will have a tear in his eye: Ravi Shastri on emotional Perth hundredRavi Shastri heaped praise on Virat Kohli after he scored his 30th hundred during Day 3 of the Perth Test. Kohli's hundred helped India set a big total of 534 runs.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-mega-auction-yuzvendra-chahal-reaction-punjab-kings-18-crore-2639410-2024-11-24",
      "headline": "I deserve Rs 18 crore: Yuzvendra Chahal thrilled after mega bid from PunjabIPL mega auction: Yuzvendra Chahal said he is looking forward to working with Ricky Ponting at Punjab Kings. The leg-spinner said he deserved the price tag of Rs 18 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jofra-archer-rajasthan-royals-mumbai-indians-2639398-2024-11-24",
      "headline": "Added late to IPL auction, Jofra Archer gets massive paycheque from Rajasthan RoyalsFast bowler Jofra Archer was sold to Rajasthan Royals (RR) for INR 12.50 crore during the IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zimbabwe-vs-pakistan-odi-score-scock-defeat-mohammad-rizwan-2639397-2024-11-24",
      "headline": "1st ODI: After Australia high, Pakistan slump to shocking loss in ZimbabweZimbabwe (ZIM) vs Pakistan (PAK), 1st ODI: Pakistan slumped to a shock loss in a rain-affected match in Bulawayo on Sunday. It has come after their historic series win in Australia earlier in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-josh-hazlewood-press-conference-perth-2639394-2024-11-24",
      "headline": "Nothing worked against Virat Kohli on Day 3: Josh Hazlewood on Indian starAustralia pacer Josh Hazlewood praised Virat Kohli and claimed that none of the hosts' plan worked against him. Kohli scored his 30th hundred at Perth as India took control of things. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-rcb-splash-cash-for-phil-salt-and-jitesh-sharma-and-hazlewood-2639390-2024-11-24",
      "headline": "IPL 2025 mega auction: RCB splash cash for Phil Salt and Jitesh Sharma and Hazlewood IPL 2025 mega auction: The Royal Challengers woke up from their slumber to splash the cash on two wicketkeepers, Phil Salt, Jitesh Sharma and Australian pacer Josh Hazlewood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ishan-kishan-1125-crore-ipl-2025-auction-surnrisers-hyderabad-mumbai-indians-2639384-2024-11-24",
      "headline": "IPL auction: Mumbai snub Ishan Kishan, SRH buy wicketkeeper for Rs 11.25 croreIndia wicketkeeper batter Ishan Kishan was sold for INR 11.25 Crore to Sunrisers Hyderabad (SRH) after Mumbai Indians (MI) didn't exercise their Right to Match (RTM) card."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-rcb-snub-rtm-for-glenn-maxwell-australia-star-returns-to-pbks-2639366-2024-11-24",
      "headline": "IPL auction: RCB snub RTM for Glenn Maxwell, Australia star returns to PBKSThe Royal Challengers Bengaluru did not use their RTM for Glenn Maxwell as the Australian star returned to PBKS for Rs 4.20 crore. England's wicketkeeper-batter Phil Salt was sold for Rs 11.50 crore to RCB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-rcb-splash-cash-for-phil-salt-and-jitesh-sharma-and-hazlewood-2639390-2024-11-24",
      "headline": "IPL 2025 mega auction: RCB splash cash for Phil Salt and Jitesh Sharma and Hazlewood IPL 2025 mega auction: The Royal Challengers woke up from their slumber to splash the cash on two wicketkeepers, Phil Salt, Jitesh Sharma and Australian pacer Josh Hazlewood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ishan-kishan-1125-crore-ipl-2025-auction-surnrisers-hyderabad-mumbai-indians-2639384-2024-11-24",
      "headline": "IPL auction: Mumbai snub Ishan Kishan, SRH buy wicketkeeper for Rs 11.25 croreIndia wicketkeeper batter Ishan Kishan was sold for INR 11.25 Crore to Sunrisers Hyderabad (SRH) after Mumbai Indians (MI) didn't exercise their Right to Match (RTM) card."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-rcb-snub-rtm-for-glenn-maxwell-australia-star-returns-to-pbks-2639366-2024-11-24",
      "headline": "IPL auction: RCB snub RTM for Glenn Maxwell, Australia star returns to PBKSThe Royal Challengers Bengaluru did not use their RTM for Glenn Maxwell as the Australian star returned to PBKS for Rs 4.20 crore. England's wicketkeeper-batter Phil Salt was sold for Rs 11.50 crore to RCB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-venkatesh-iyer-kolkata-knightriders-third-costliest-buy-jeddah-2639356-2024-11-24",
      "headline": "IPL 2025 Auction: Venkatesh Iyer hits jackpot! KKR buy him for 23.75 croreVenkatesh Iyer has hit the jackpot as Kolkata Knightriders decided to buy the all-rounder for 23.75 crore. KKR got the services of Venkatesh after a bidding war with Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-auction-kl-rahul-eoin-morgan-delhi-capitals-2639355-2024-11-24",
      "headline": "Rahul worth more than 14 crore, DC should make him captain: Morgan IPL 2025 Auction: Delhi Capitals did not use the RTM card for Rishabh Pant and rather bought KL Rahul for INR 14 crore. Pant became the most expensive player in IPL history with a price of INR 27 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-r-ashwin-chennai-super-kings-csk-ipl-2025-mega-auction-2639346-2024-11-24",
      "headline": "IPL Auction: CSK buy R Ashwin for 9.75 crore, spinner re-unites with MS DhoniStar India off spinner Ravichandran Ashwin was bought by five-time champions Chennai Super Kings for INR 9.75 Crore at the IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-rcb-hit-back-at-critics-wants-fans-to-trust-the-process-2639343-2024-11-24",
      "headline": "IPL 2025 mega auction: RCB hit back at critics, want fans to 'trust the process'RCB has hit back at the critics for questioning their tactics in the ongoing IPL 2025 mega auction. Despite having a substantial purse of Rs 83 crore, the franchise managed to get the services of only Liam Livingstone in the first two rounds. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}