{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-progress-energy-shift-crude-oil-russia-lpg-progress-2825457-2025-11-25",
      "headline": "India–US trade deal looks quiet. The 'energy' shift tells another storyIndia and the US may look stalled on a formal trade deal, but shifting oil flows, a major LPG pact and calibrated tariff moves show the real progress is happening quietly behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-down-100-points-nifty-below-26000-infosys-down-1-percent-2825434-2025-11-25",
      "headline": "Sensex opens 100 points lower, Nifty below 26,000; Infosys down 1%The S&P BSE Sensex was down by 16.48 points to 84,884.23, while the NSE Nifty50 lost 4.55 points to 25,954.95 as of 9:28 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-review-should-you-bid-day-3-subscription-2825433-2025-11-25",
      "headline": "Sudeep Pharma IPO closes today: Is it worth a bid? Check the GMPThe Rs 895-crore IPO includes a fresh issue of Rs 95 crore and an offer for sale worth Rs 800 crore. The price band is set at Rs 563 to Rs 593 per share, and the minimum investment for retail buyers is Rs 14,825."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-layoff-job-cut-sales-team-tech-hiring-trend-amazon-google-cost-cutting-labour-market-us-2825404-2025-11-25",
      "headline": "Apple layoff: Tech giant cuts jobs across sales team, says reportApple said it is reducing roles across its sales teams as part of a plan to improve how it engages with customers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-331-points-lower-nifty-below-26000-bel-down-3-percent-2825127-2025-11-24",
      "headline": "Sensex closes 331 points lower, Nifty below 26,000; BEL down 3%The S&P BSE Sensex was down 331.21 points to close at 84,900.71, while the NSE Nifty50 lost 108.65 points to end at 25,959.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gst-20-rising-consumption-economic-boost-impact-on-dalal-street-sensex-and-nifty-explained-2825085-2025-11-24",
      "headline": "GST 2.0 is lifting consumption. Can it lift Sensex and Nifty too?GST 2.0 has pushed prices down and demand up, but whether that momentum can lift Sensex and Nifty will depend on earnings, capex and global stability in the months ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hal-statement-tejas-fighter-jet-crash-dubai-show-isolated-incident-share-price-down-2825083-2025-11-24",
      "headline": "Tejas crash at Dubai Airshow isolated occurrence: Read HAL's full statementAn Indian Air Force Tejas fighter jet crashed in the United Arab Emirates on Friday while taking part in the Dubai Airshow 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-rama-raju-mantena-udaipur-wedding-star-studded-jennifer-lopez-trump-ranveer-singh-2825072-2025-11-24",
      "headline": "Who is Rama Raju Mantena, pharma king behind Udaipur's star-studded wedding?Rama Raju Mantena is a well-known name in the US pharmaceutical industry. Originally from Vijayawada in Andhra Pradesh, Mantena moved to the United States in the 1980s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-share-price-falls-4-percent-after-tejas-fighter-jet-crash-at-dubai-airshow-2824967-2025-11-24",
      "headline": "HAL share price falls 4% after Tejas fighter jet crash at Dubai AirshowThe HAL stock slipped to around Rs 4,430, down roughly 3.6% at 10:44 am. Earlier in the day, the stock had tumbled over 8%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-allotment-out-check-your-status-expected-share-price-listing-details-gmp-2824935-2025-11-24",
      "headline": "Excelsoft Technologies IPO allotment out: Did you get shares? Check listing detailsExcelsoft Technologies IPO allotment: Applicants who subscribed to the IPO can check their status through the BSE website or the registrar, MUFG Intime India Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-start-week-on-a-positive-note-as-it-stocks-lead-the-charge-2824920-2025-11-24",
      "headline": "Sensex, Nifty start week on a positive note as IT stocks lead the chargeBroader market indices were also in the green, mirroring the positive start. The tone was set by IT heavyweights: Tech Mahindra and Infosys jumped over 2% each, followed closely by gains in HCLTech and Wipro. Eicher Motors also featured among the early winners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-legal-setback-us-court-fine-penalty-usd-194-million-vs-csc-dxc-technology-2824905-2025-11-24",
      "headline": "TCS suffers legal setback in US with $194 million penalty upheldThe matter has now been sent back to the Northern District of Texas, Dallas Division, which has been asked to review the injunction as per the directions of the Appeals Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lakshmi-mittal-leaving-uk-why-tax-changes-net-worth-moving-to-dubai-inheritance-capital-gains-arcelormittal-2824891-2025-11-24",
      "headline": "Why billionaire Lakshmi Mittal is saying goodbye to the UKAs per the Forbes rich list, Mittal has a net worth of $21.4 billion. He is the 12th richest Indian and the 104th richest person in the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-10-key-changes-every-employee-should-know-2824640-2025-11-23",
      "headline": "New labour codes: 10 key changes every employee should knowWhether someone works full-time, on a contract, or in sector-specific roles like media, plantations or factories, the new framework affects nearly everyone. Here are the key updates workers should be aware of, along with several other important changes that haven't received enough attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-challenge-unfair-will-cheating-inheritance-property-transfer-mental-state-doubt-witness-testimony-2824524-2025-11-23",
      "headline": "Feel cheated by your family will? Know your legal rightsWhether it is a sudden change in beneficiaries, unequal division of property, or doubts about the person's mental state when the will was written, such situations often create confusion, anger, and emotional stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/clear-home-loan-early-simple-steps-to-pay-it-quickly-emis-high-interest-refinancing-higher-down-payment-2824523-2025-11-23",
      "headline": "Want to clear your home loan early? Simple ways to pay it off quicklyPay low EMIs and your tenure stretches, increasing your interest costs. Pay higher EMIs, and you could save years and lakhs on the total interest you pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-code-explained-pay-structure-in-hand-salary-rise-fall-impact-basic-pf-deduction-2824336-2025-11-22",
      "headline": "New labour codes are here: Will your in-hand salary rise or fall?With the new labour codes now implemented, many employees are trying to understand what it means for their salary structure, especially basic salary, PF deductions and take-home pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-changes-paid-leaves-working-hours-health-coverage-old-vs-new-laws-2824290-2025-11-22",
      "headline": "New labour codes: What changes for paid leave, work hours and health benefitsThe new labour codes apply across sectors and are designed to improve safety, reduce fatigue and make workplaces more predictable for millions of workers in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gratuity-new-labour-codes-law-fixed-term-employees-explained-2824241-2025-11-22",
      "headline": "Gratuity in a year? Only if you're a fixed-term employee. Here's what it meansOnly employees hired on fixed-term contracts qualify for the new one-year gratuity rule. Permanent staff remain under the five-year norm, making this benefit exclusive to India's expanding fixed-term workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-codes-laws-explained-from-gratuity-to-gig-worker-insurance-2824221-2025-11-22",
      "headline": "From gratuity to gig worker insurance: What new labour laws mean for employeesFrom gratuity to insurance and safer workplaces, the new rules expand what employees can expect from their jobs. Staying informed will help workers make the most of these changes."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mass-jathara-on-ott-when-and-where-to-watch-ravi-tejas-mass-entertainer-2825527-2025-11-25",
      "headline": "Mass Jathara on OTT: When and where to watch Ravi Teja's mass entertainer Mass Jathara starring Ravi Teja is set for its OTT debut on Netflix in November 2025, following its theatrical release in October. The Telugu film also stars Sreeleela. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billie-eilish-3d-concert-documentary-james-cameron-march-2026-2825508-2025-11-25",
      "headline": "Billie Eilish and James Cameron's 3D concert film arrives in theaters March 2026 Paramount Pictures has announced the release of Billie Eilish's 3D concert documentary, co-directed with James Cameron, set to premiere in cinemas in March 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rupert-grint-writes-to-new-ron-weasley-alastair-stout-on-passing-the-baton-2825495-2025-11-25",
      "headline": "Rupert Grint writes to new Ron Weasley, Alastair Stout, on passing the baton Actor Rupert Grint has sent a supportive letter to Alastair Stout, the new Ron Weasley in HBO's 'Harry Potter' reboot. The series is set to debut on HBO and HBO Max in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-surprises-anil-ravipudi-with-a-stylish-watch-on-his-birthday-2825478-2025-11-25",
      "headline": "Chiranjeevi surprises Anil Ravipudi with a stylish watch on his birthday Chiranjeevi marked director Anil Ravipudi's birthday with a thoughtful present while they continued work on their upcoming film, which is scheduled for release during the Sankranthi festival. The film sees Nayanthara and Venkatesh in pivotal roles, adding to the anticipation among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ranbir-kapoor-cameo-prabhas-spirit-sandeep-reddy-vanga-2825462-2025-11-25",
      "headline": "Ranbir Kapoor to cameo in Prabhas, Sandeep Reddy Vanga's Spirit: Report Sandeep Reddy Vanga's 'Spirit' has started filming featuring Prabhas as the lead. Ranbir Kapoor will reportedly make a cameo appearance in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jo-bo-ah-pregnancy-announcement-actor-expecting-child-agency-confirms-news-2825461-2025-11-25",
      "headline": "Destined With You actor Jo Bo-ah pregnant with first child Actor Jo Bo-ah is expecting her first child, according to an announcement made by her agency, XYZ Studio, on November 25. The news follows media reports about her pregnancy, with the agency thanking fans for their ongoing support and requesting privacy regarding further details."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-mourns-dharmendra-calls-him-a-legend-who-lit-up-every-frame-2825444-2025-11-25",
      "headline": "Alia Bhatt mourns Dharmendra, calls him a legend who lit up every frame Alia Bhatt mourned the death of Bollywood actor Dharmendra, underlining his impact on Indian cinema. She shared screen space with the actor in the 2023 film 'Rocky Aur Rani Kii Prem Kahaani'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohan-babu-rajini-kanth-hyderabad-home-tour-50-years-friendship-2825449-2025-11-25",
      "headline": "Watch: Mohan Babu gives Rajinikanth a tour of his house and charitable trust Rajinikanth visited Hyderabad to celebrate Mohan Babu's 50 years in cinema. The two have been best friends for five decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-soon-jae-dies-aged-91-veteran-south-korean-actor-legacy-tv-theatre-2825439-2025-11-25",
      "headline": "South Korean actor Lee Soon-jae dies at 91 Veteran South Korean actor Lee Soon-jae has died aged 91. His passing marks the end of a monumental career that shaped Korean television and theatre culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-kardashian-all-fair-renewed-for-season-2-hulu-2825374-2025-11-25",
      "headline": "Kim Kardashian's All's Fair renewed for season 2 at Hulu The first season of Ryan Murphy's 'All's Fair' has attracted widespread notice for its ensemble cast, provocative script, and depiction of female attorneys challenging traditional power dynamics in the legal world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-books-nursing-home-for-hema-malini-pregnancy-privacy-2825239-2025-11-25",
      "headline": "When Dharmendra booked 100 rooms for Hema Malini ahead of Esha Deol's birth Dharmendra made a grand but thoughtful gesture to protect Hema Malini's privacy during her pregnancy. This act highlights the depth of their enduring love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-joins-vetri-maaran-arasan-vada-chennai-universe-2825411-2025-11-25",
      "headline": "Vijay Sethupathi joins Silambarasan-Vetri Maaran's Arasan. Official announcement out Actor Vijay Sethupathi has joined director Vetri Maaran's upcoming film 'Arasan'. The film, starring Silambarasan in the lead, is part of the 'Vada Chennai' universe, sparking high fan expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-dies-bollywood-mourns-legendary-actor-amitabh-bachchan-tribute-2825405-2025-11-25",
      "headline": "Amitabh Bachchan mourns Dharmendra, calls him a valiant giant in emotional tribute Legendary actor Dharmendra died on Monday, leaving Bollywood in mourning. Amitabh Bachchan paid an emotional tribute to the late actor, calling him a valiant giant whose absence leaves an irreplaceable void in the Hindi film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-kampany-aaro-short-film-manju-warrier-malayalam-cinema-experiment-2825145-2025-11-25",
      "headline": "Mammootty Kampany's bold experiment: How 'Aaro' signals new era for filmmakers Mammootty Kampany launches 'Aaro', a bold short film exploring loneliness and addiction. This move signals a new era of creative risk-taking and support for abstract storytelling in Malayalam cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-maruthi-the-raja-saab-song-launch-hyderabad-jr-ntr-fan-debate-2825398-2025-11-25",
      "headline": "Director Maruthi apologises to Jr NTR fans for unintended dig at Raja Saab event Director Maruthi apologised after comments at 'The Raja Saab' song launch event were perceived as a dig at Jr NTR. He addressed the concerns of Jr NTR's fans and clarified his intentions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amar-singh-chamkila-diljit-dosanjh-gets-snubbed-international-emmy-awards-2025-2825401-2025-11-25",
      "headline": "Amar Singh Chamkila gets snubbed at International Emmy Awards 2025 Diljit Dosanjh's 'Amar Singh Chamkila' lost at the International Emmy Awards 2025. Dosanjh lost the Best Performance by an Actor category to Oriol Pla for 'I Addict'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/eko-thriller-kerala-animal-trilogy-dog-mystery-kuriachan-2825328-2025-11-25",
      "headline": "Eko review: A slow-paced thriller that lands a strong final twistRelease Date:Fri Nov 21, 2025 Eko film review: Dinjith Ayyathan's Malayalam thriller film 'Eko' is a technically sound film that takes its time to build, loses its way in the middle, but gets back on track and finishes strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-meets-donald-trump-jr-at-high-profile-mantena-gadiraju-wedding-in-udaipur-2825382-2025-11-25",
      "headline": "Ram Charan, Trump Jr. share special moments at star-studded Udaipur wedding. Pics The wedding of Netra Mantena and Vamsi Gadiraju in Udaipur drew significant attention for its distinguished guest list, featuring Indian and international figures including actor Ram Charan and Donald Trump Jr."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/garam-dharam-dharmendra-machismo-2816938-2025-11-25",
      "headline": "Garam Dharam: How Dharmendra turned machismo into a pop art Think Dharmendra and you think machismo. But the genesis of the action superstar happened in his early phase as an alpha loverboy who also scored in the drama genre."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-ayodhya-ram-temple-flag-hoisting-ceremony-live-updates-mandir-dhwajarohan-2825379-2025-11-25",
      "headline": "Live: PM hoists sacred saffron flag at Ram Mandir, marking completion of templePM Modi Ayodhya Ram Temple Live Updates: Prime Minister Narendra Modi will hoist a saffron flag atop the Ayodhya Ram Temple on Tuesday, marking the completion of its construction. The right-angled triangular flag features a radiant Sun symbolising Lord Rama's brilliance and valour, an 'Om', and the Kovidara tree. This sacred flag represents dignity, unity, and cultural continuity, reflecting the ideals of Ram Rajya. PM Modi took part in special prayers as he arrived at the Ram Mandir, alongside other dignitaries. Stay tuned to IndiaToday.in for live updates from Ayodhya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/army-is-secular-supreme-court-upholds-christian-officers-dismissal-over-refusal-to-enter-temple-sanctum-2825546-2025-11-25",
      "headline": "Supreme Court blasts Christian officer over refusal to enter temple sanctumThe officer had challenged the disciplinary action, arguing that being compelled to enter the temple violated his religious freedom, but the Supreme Court ruled that his conduct amounted to disobedience of a lawful command."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-x-feature-shows-foreign-footprints-in-indian-political-conversations-2825306-2025-11-24",
      "headline": "New X feature shows foreign footprints in Indian political conversationsAn analysis by India Today showed that multiple X accounts that often pushed political narratives, propaganda, and disinformation were operating from foreign locations, often Pakistan or West Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-live-score-day-4-guwahati-updates-2825383-2025-11-25",
      "headline": "2nd Test Day 4 Live: De Zorzi, Stubbs keep frustrating IndiaIndia vs South Africa live score 2nd Test Day 4 Updates: India are desperately looking for wickets as the lead has gone past the 400-run mark. De Zorzi and Stubbs have stabilised the ship after Bavuma's wicket and will be looking to accelerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/ethiopias-hayli-gubbi-volcano-satellite-captures-once-in-10000-year-eruption-2825476-2025-11-25",
      "headline": "Satellite captures Ethiopia's Hayli Gubbi volcano's mega eruptionThe India Meteorological Department (IMD) reported that ash clouds from this eruption are now moving eastward towards China and will clear Indian skies by 7:30 pm on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/why-rotational-chief-ministerial-formula-is-breaking-down-in-karnataka-congress-2825355-2025-11-24",
      "headline": "Why rotational chief ministerial formula is breaking down in Karnataka CongressKarnataka Congress is witnessing internal turmoil as questions arise over Siddaramaiah's commitment to a power-sharing deal with DK Shivakumar. The party faces mounting pressure to manage a smooth leadership transition amid rising tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-progress-energy-shift-crude-oil-russia-lpg-progress-2825457-2025-11-25",
      "headline": "India–US trade deal looks quiet. The 'energy' shift tells another storyIndia and the US may look stalled on a formal trade deal, but shifting oil flows, a major LPG pact and calibrated tariff moves show the real progress is happening quietly behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-hoists-sacred-11-kg-saffron-flag-at-ram-mandir-during-dhwajarohan-ceremony-2825539-2025-11-25",
      "headline": "PM Modi hoists sacred flag at Ayodhya Ram Mandir, marks temple's completionPM Modi hoists sacred 11-kg saffron flag at Ram Mandir during Dhwajarohan ceremony"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bride-father-nails-slow-mo-steps-glass-slide-move-at-sangeet-in-viral-dance-video-bezubaan-phir-se-2825464-2025-11-25",
      "headline": "Bride's father nails slow-mo steps, glass slide move at sangeet in viral dance videoThe video, shared with the text overlay \"POV: When the bride's father dances like that, toh sangeet toh hit hona hi thaa\" shows him dancing to Bezubaan Phir Se on the stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ethiopia-volcano-eruption-live-updates-ash-cloud-impact-delhi-ncr-flights-2825359-2025-11-25",
      "headline": "Live: Ash cloud to clear India by 7.30 pm, says weather bodyEthiopia Volcano Eruption Live Updates: Ethiopia's Hayli Gubbi volcano, long believed to be dormant, erupted for the first time in nearly 10,000 years, sending a massive ash and sulphur-dioxide plume nearly 15 km high. The eruption triggered aviation warnings as the ash cloud drifted across the Red Sea toward Yemen and Oman. The disruption forced Akasa Air, IndiGo and KLM to cancel several flights on Monday. India's DGCA issued an advisory directing airlines to avoid all ash-affected areas and adjust routes, flight levels and fuel planning based on updated alerts. A plume from the eruption reached Delhi around 11 pm on Monday. Follow inidatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ethiopian-volcano-ash-reaches-delhi-aviation-regulators-safety-alert-airlines-glbs-2825360-2025-11-25",
      "headline": "Ethiopian volcano ash reaches Delhi, safety alert for airlines as flights hitEthiopia's Hayli Gubbi volcano erupted after nearly 10,000 years, sending ash clouds towards India. The ash reaching Delhi may affect air quality and weather conditions in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/he-thought-it-was-lung-cancer-coughing-doctors-diagnosis-2825125-2025-11-24",
      "headline": "He thought it was lung cancer. Doctors found something far more unexpectedExcessive coughing led a 70-year-old man to suspect he had lung cancer. However, upon examination, doctors revealed something very unexpected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-books-nursing-home-for-hema-malini-pregnancy-privacy-2825239-2025-11-25",
      "headline": "When Dharmendra booked 100 rooms for Hema Malini ahead of Esha Deol's birthDharmendra made a grand but thoughtful gesture to protect Hema Malini's privacy during her pregnancy. This act highlights the depth of their enduring love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/inhuman-punishment-kg2-child-tied-tree-chhattisgarh-school-outrage-2825477-2025-11-25",
      "headline": "Boy, 5, hung from tree for not completing homework in Chhattisgarh schoolA KG-2 child in Surajpur district, Chhattisgarh, was allegedly tied and hung from a tree by teachers for not completing homework. The incident at Hanswani Vidya Mandir in Narayanpur led to widespread anger, a viral video, and an official probe by education authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-layoff-job-cut-sales-team-tech-hiring-trend-amazon-google-cost-cutting-labour-market-us-2825404-2025-11-25",
      "headline": "Apple layoff: Tech giant cuts jobs across sales team, says reportApple said it is reducing roles across its sales teams as part of a plan to improve how it engages with customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/why-indias-homegrown-cloud-kitchens-are-booming-without-delivery-apps-2823742-2025-11-25",
      "headline": "Why India's homegrown cloud kitchens are booming without delivery appsInstead of automated chatbots, doesn't the food ordering experience feel better when you're talking to a real person, customising your order as per your preferences, and getting that personal touch? This human connection is one of the key reasons why cloud kitchens are becoming so popular."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/volcanic-eruption-ethiopia-india-delhi-air-quality-pollution-plume-imd-forecasts-china-affects-health-impacts-2825503-2025-11-25",
      "headline": "Will ash from Ethiopia's volcanic eruption worsen Delhi's air?According to India Meteorological Department (IMD) forecasts, the ash influence over Delhi is likely to be short-lived. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-kali-temple-idol-altered-mother-mary-priest-arrested-2825490-2025-11-25",
      "headline": "From Kali to Mother Mary: Mumbai temple priest arrested over vandalised idolA Kali temple idol in Mumbai's Chembur was altered to resemble Mother Mary. The priest has been arrested, raising tensions among religious groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/surekha-yadav-first-female-locomotive-pilot-asia-women-in-railways-2825177-2025-11-25",
      "headline": "The story of Surekha Yadav, India's first woman loco pilotSurekha Yadav became Asia's first female locomotive pilot in 1988, breaking barriers in a male-dominated field. Her journey continues to inspire women across India to pursue careers in STEM and technical roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/diljit-dosanjhs-iemmy-look-proves-that-menswear-bling-can-be-subtle-and-stunning-amar-singh-chamkila-2825376-2025-11-25",
      "headline": "Diljit Dosanjh's iEmmy look proves that menswear bling can be subtle, and stunningAnd while the International Emmy Awards nomination is historic, Diljit Dosanjh's appearance on the red carpet sparked just as much interest. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-senyar-imd-forecast-heavy-rain-southern-states-tamil-nadu-kerala-andaman-2825448-2025-11-25",
      "headline": "Cyclone Senyar may form in 48 hours, southern states brace for heavy rainIMD says a well-marked low over the Bay of Bengal may intensify into a cyclonic storm within 48 hours. Heavy rain is forecast across Tamil Nadu, Kerala, Lakshadweep, Andaman & Nicobar, and Andhra Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ram-mandir-dhwajarohan-ayodhya-temple-dharam-dhwaja-ceremony-flag-significance-in-five-points-pran-pratishtha-2825331-2025-11-25",
      "headline": "Dhwajarohan today marks completion of Ayodhya Ram Mandir | Explained in 5 pointsPM Modi is set to hoist an 11-kg saffron flag at the Ram Mandir in Ayodhya on Tuesday. The Dhwajarohan ceremony on November 25 marks the completion of the Shri Ram Janmabhoomi Temple's main spire and outer wall. The significance of the event and everything you need to know are explained here in five points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/acid-poisoning-ratneshwarbati-village-hospitalizes-six-family-members-children-2825451-2025-11-25",
      "headline": "Bengal woman mistakes acid for water while cooking, 6 hospitalisedThe acid, normally kept for silver work, was mistaken for water during cooking, resulting in all family members falling ill and requiring transfer to Kolkata for treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-spirit-film-production-begins-muhurat-puja-second-generation-directors-2825521-2025-11-25",
      "headline": "Prabhas' Spirit: Ravi Teja's son Mahadhan, Trivikram's son Rishi to assist VangaDirector Sandeep Reddy Vanga's new project 'Spirit', starring Prabhas, brings together the next generation of Telugu film talent as Trivikram Srinivas's son Manoj Rishie and Ravi Teja's son Mahadhan join the direction team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendras-love-story-with-ageless-romance-life-in-a-metro-to-rocky-aur-rani-2825518-2025-11-25",
      "headline": "Dharmendra's love story with ageless romance: Life in a Metro to Rocky Aur RaniDharmendra's final screen years reiterated a different side of Bollywood's He-Man. In Life in a… Metro and Rocky Aur Rani Kii Prem Kahaani, he explored romance untouched by age or judgment. A new generation discovered love through his roles."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kris-srikkanth-slams-gautam-gambhir-inconsistent-india-test-selection-2825522-2025-11-25",
      "headline": "Gambhir can say whatever he wants, I don't care: Srikkanth slams Test selection Former India captain Kris Srikkanth criticised Gautam Gambhir for inconsistent Test team selections. His comments come after Indian batters failed in the first innings of the Guwahati Test after South Africa posted 489. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-pat-cummins-fitness-ashes-second-test-gabba-2825487-2025-11-25",
      "headline": "Hazlewood back in training, Cummins trains with pink ball before 2nd Test Josh Hazlewood and Pat Cummins took part in a crucial training session in Sydney on Tuesday as Australia stepped up their preparations for the second Ashes Test at the Gabba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/commonwealth-games-2030-india-hosting-rights-formal-announcement-2825481-2025-11-25",
      "headline": "India set to formally get hosting rights of Commonwealth Games on November 26 India is set to be formally approved as host of the 2030 Commonwealth Games on Wednesday. Ahmedabad will stage the centenary edition, strengthening India's bid to host the 2036 Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-ashes-preparation-golf-perth-test-injury-instagram-post-2825459-2025-11-25",
      "headline": "Ashes: Usman Khawaja's golf post sparks fresh debate amid injury row Veteran Australian opener Usman Khawaja has reignited debate over his Ashes preparations after sharing a photo from a golf course on Instagram, just days after enduring a challenging first Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-selectors-recall-ruturaj-gaikwad-yashasvi-jaiswal-odi-series-south-africa-2825407-2025-11-25",
      "headline": "No place for Ruturaj: Ex-India cricketer tips Jaiswal to open with Rohit in SA ODIs Former India batter Aakash Chopra welcomed Ruturaj Gaikwad's recall to India's ODI squad for the upcoming South Africa series, but predicted Yashasvi Jaiswal will be Rohit Sharma's opening partner. Chopra also raised concerns about Nitish Kumar Reddy's role and utilisation in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-lose-everton-ruben-amorim-reaction-premier-league-2825413-2025-11-25",
      "headline": "Man United deserved to lose: Amorim wishes his side had shown Everton's fight Ruben Amorim conceded that Manchester United are still some distance from competing with the Premier League's leading sides after their 1-0 defeat to 10-man Everton on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-changing-batting-role-india-vs-south-africa-test-cricket-2825400-2025-11-25",
      "headline": "Washington Sundar breaks silence on flexible batting position in India's Test side India all-rounder Washington Sundar said he is happy to bat wherever the team needs him, adding that he enjoys taking on different roles whenever required."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-t20-world-cup-2026-group-stage-match-schedule-venue-details-2825394-2025-11-25",
      "headline": "India vs Pakistan set for February 15 in T20 World Cup 2026: Report India and Pakistan will face each other on February 15, 2026, at the R Premadasa Stadium in Colombo during the Men's T20 World Cup. India and Pakistan are expected to be grouped with the USA, Netherlands and Namibia during the tournament as the full schedule will be revealed on Tuesday, November 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-marco-jansen-fiery-spell-dismantles-indian-batting-guwahati-test-2825354-2025-11-25",
      "headline": "Pace, bounce and chaos: Jansen's hostile spell wrecks India in Guwahati Test Marco Jansen was at his devastating best on Day 3 of the second Test in Guwahati, delivering a menacing spell of 6 for 48. The left-arm quick rolled back the years as he peppered India with a relentless barrage of bouncers, forcing the batters into submission and dragging the hosts to their knees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-live-score-day-4-guwahati-updates-2825383-2025-11-25",
      "headline": "2nd Test Day 4 Live: De Zorzi, Stubbs keep frustrating India India vs South Africa live score 2nd Test Day 4 Updates: India are desperately looking for wickets as the lead has gone past the 400-run mark. De Zorzi and Stubbs have stabilised the ship after Bavuma's wicket and will be looking to accelerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-changing-batting-role-india-vs-south-africa-test-cricket-2825400-2025-11-25",
      "headline": "Washington Sundar breaks silence on flexible batting position in India's Test side India all-rounder Washington Sundar said he is happy to bat wherever the team needs him, adding that he enjoys taking on different roles whenever required."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-t20-world-cup-2026-group-stage-match-schedule-venue-details-2825394-2025-11-25",
      "headline": "India vs Pakistan set for February 15 in T20 World Cup 2026: Report India and Pakistan will face each other on February 15, 2026, at the R Premadasa Stadium in Colombo during the Men's T20 World Cup. India and Pakistan are expected to be grouped with the USA, Netherlands and Namibia during the tournament as the full schedule will be revealed on Tuesday, November 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-marco-jansen-fiery-spell-dismantles-indian-batting-guwahati-test-2825354-2025-11-25",
      "headline": "Pace, bounce and chaos: Jansen's hostile spell wrecks India in Guwahati Test Marco Jansen was at his devastating best on Day 3 of the second Test in Guwahati, delivering a menacing spell of 6 for 48. The left-arm quick rolled back the years as he peppered India with a relentless barrage of bouncers, forcing the batters into submission and dragging the hosts to their knees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-live-score-day-4-guwahati-updates-2825383-2025-11-25",
      "headline": "2nd Test Day 4 Live: De Zorzi, Stubbs keep frustrating India India vs South Africa live score 2nd Test Day 4 Updates: India are desperately looking for wickets as the lead has gone past the 400-run mark. De Zorzi and Stubbs have stabilised the ship after Bavuma's wicket and will be looking to accelerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-bcci-domestic-promise-all-talk-india-batting-collapse-2825237-2025-11-25",
      "headline": "BCCI's domestic promise seems all talk: India's batting letdown in Guwahati proves itIndia's collapse in Guwahati has reignited questions about the BCCI's commitment to domestic cricket. Despite strong Ranji performers waiting in the wings, India's selection strategy leans heavily on youth, leaving the team exposed to another home Test whitewash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-virat-kohli-winning-mentality-missing-sreevats-goswami-guwahati-test-2825347-2025-11-24",
      "headline": "Virat Kohli's winning mentality lacking in this India Test side: Former wicketkeeperIND vs SA: Sreevats Goswami believes India are missing the winning edge Virat Kohli once brought to Test cricket. As results dip at home, the absence of that mindset is becoming harder to ignore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-wedding-social-media-posts-removed-father-health-scare-2825318-2025-11-24",
      "headline": "Smriti Mandhana removes wedding posts as plans put on hold after father's health scareSmriti Mandhana's wedding celebrations were halted after a sudden health scare involving her father. As the family focuses on recovery, the Indian star has removed all related posts from her social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-kabaddi-team-wins-second-consecutive-world-cup-dhaka-pm-modi-2825299-2025-11-24",
      "headline": "India women win 2nd successive Kabaddi World Cup title, PM Modi sends wishesIndian women's kabaddi team won their second successive World Cup title in Dhaka. PM Modi said the victory will inspire future generations to take up the sport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-kamasutra-of-chaos-guwahati-test-position-lost-2825298-2025-11-24",
      "headline": "Gautam Gambhir and the Kamasutra of chaos: When Indian team lost its positionIND vs SA: Gautam Gambhir's obsession with constant change has turned Indian cricket into his personal Kamasutra of experimental positions, endless adjustments, and zero satisfaction. The result? Confusion disguised as innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohan-bopanna-danill-medvedev-sumit-nagal-gael-monfils-team-world-tennis-league-2825291-2025-11-24",
      "headline": "Medvedev-Bopanna and Nagal-Monfils team up for World Tennis League in DecemberThe World Tennis League returns in December with a fresh venue and a star-studded line-up. With Medvedev, Bopanna, Kyrgios, Monfils and Nagal in action, four days of high-quality tennis await."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-reaction-joe-root-dismissal-ashes-2025-australia-england-test-2825270-2025-11-24",
      "headline": "Broad on viral reaction after Root's dismissal: Every England fan felt like thatFormer England bowler Stuart Broad opened up on his viral reaction to Joe Root's dismissal in the Ashes Test. Broad's reaction went viral on social media as he was in utter disbelief watching England collapse on Day 2 in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-criticism-reckless-shot-india-struggle-south-africa-guwahati-test-2825215-2025-11-24",
      "headline": "IND vs SA: Dale Steyn tears into Rishabh Pant for 'brainfade' shot in GuwahatiRishabh Pant faced heavy criticism for his reckless shot during Day 3 of the second Test against South Africa. Dale Steyn and Anil Kumble said that Pant needs to show more responsibility to help India recover in the series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-kamasutra-of-chaos-guwahati-test-position-lost-2825298-2025-11-24",
      "headline": "Gautam Gambhir and the Kamasutra of chaos: When Indian team lost its positionIND vs SA: Gautam Gambhir's obsession with constant change has turned Indian cricket into his personal Kamasutra of experimental positions, endless adjustments, and zero satisfaction. The result? Confusion disguised as innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohan-bopanna-danill-medvedev-sumit-nagal-gael-monfils-team-world-tennis-league-2825291-2025-11-24",
      "headline": "Medvedev-Bopanna and Nagal-Monfils team up for World Tennis League in DecemberThe World Tennis League returns in December with a fresh venue and a star-studded line-up. With Medvedev, Bopanna, Kyrgios, Monfils and Nagal in action, four days of high-quality tennis await."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-reaction-joe-root-dismissal-ashes-2025-australia-england-test-2825270-2025-11-24",
      "headline": "Broad on viral reaction after Root's dismissal: Every England fan felt like thatFormer England bowler Stuart Broad opened up on his viral reaction to Joe Root's dismissal in the Ashes Test. Broad's reaction went viral on social media as he was in utter disbelief watching England collapse on Day 2 in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-criticism-reckless-shot-india-struggle-south-africa-guwahati-test-2825215-2025-11-24",
      "headline": "IND vs SA: Dale Steyn tears into Rishabh Pant for 'brainfade' shot in GuwahatiRishabh Pant faced heavy criticism for his reckless shot during Day 3 of the second Test against South Africa. Dale Steyn and Anil Kumble said that Pant needs to show more responsibility to help India recover in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-washington-sundar-stay-positive-guwahati-test-struggle-press-conference-2825227-2025-11-24",
      "headline": "Washington Sundar urges faith as India struggle in Guwahati Test: Gotta stay positiveIND vs SA: Washington Sundar asked the team and fans to stay positive despite India's struggles in Guwahati. Backing intent over outcomes, he stressed that belief in plans and players remains crucial in difficult moments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-washington-sundar-defends-rishabh-pant-dhruv-jurel-dismissal-guwahati-test-presser-2825223-2025-11-24",
      "headline": "Washington Sundar defends Pant, Jurel after India's batting implosion in GuwahatiIND vs SA: Washington Sundar defended Rishabh Pant and Dhruv Jurel after India's collapse in Guwahati. While execution failed, he insisted the intent was right as South Africa tightened their grip on the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-pickleball-league-draft-quang-duong-aditya-ruhela-mumbai-lucknow-2825207-2025-11-24",
      "headline": "Mumbai Smashers land Quang Duong; Lucknow Leopards take India's Aditya RuhelaWorld No. 3 Quang Duong and India No.1 Aditya Ruhela headlined the inaugural Indian Pickleball League Draft, as all six teams assembled squads for the country's first MYAS-recognised professional pickleball league."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/psb-overturns-life-ban-salman-butt-arshad-nadeem-coach-2825198-2025-11-24",
      "headline": "Pakistan overturns life ban on Arshad Nadeem's coach after due-process violationsPakistan Sports Board adjudicator Pervez Rashid has overturned the life ban on Arshad Nadeem's coach Salman Butt, calling the PAAF's action unconstitutional and lacking due process, clearing him to continue guiding the Olympic champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-marco-jansen-shaun-pollock-inspiration-all-rounder-guwahati-test-2825194-2025-11-24",
      "headline": "Marco Jansen does a Shaun Pollock in Guwahati Test: All-rounder reveals inspirationIND vs SA: Marco Jansen produced a match-defining all-round performance in Guwahati and revealed that Shaun Pollock is his biggest inspiration. The young South African is steadily carving a path to become a complete all-rounder for his country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nikhil-chaudhary-first-indian-this-century-australia-domestic-ton-tasmania-2825193-2025-11-24",
      "headline": "Delhi-born Chaudhary becomes first Indian in 21st century to domestic ton Down UnderDelhi-born Nikhil Chaudhary smashed a maiden first-class ton for Tasmania, becoming the first Indian this century to hit a Sheffield Shield hundred as his 163 powered the Tigers to a commanding position against NSW."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-greg-chapppell-gautam-gambhir-faces-fans-wrath-ind-vs-sa-2825179-2025-11-24",
      "headline": "Indian Greg Chapppell: Gambhir faces fans' wrath as India crumble in GuwahatiIndia suffered a heavy batting collapse on Day 3 against South Africa in Guwahati. Fans have sharply criticised head coach Gautam Gambhir's team selection and strategy amid growing concerns for India's Test future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-day-3-report-jansen-yashasvi-2825149-2025-11-24",
      "headline": "India on brink of another home whitewash after batting implodesIndia found themselves sinking deeper into crisis on Day 3 in Guwahati, staring at the grim possibility of another home series sweep after a fresh batting collapse handed South Africa full control of the second Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}