{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-online-pf-transfers-form-13-job-change-uan-2715484-2025-04-26",
      "headline": "Changing jobs? Check this EPFO update on PF transfersEffective January 2025, the requirement for employer approval in most transfer cases has been eliminated. Previously, PF balance transfers required coordination between source and destination EPFO offices, often causing delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/e-commerce-crops-data-storage-top-india-us-trade-deal-negotiations-report-2715475-2025-04-26",
      "headline": "E-commerce, crops, data storage top India-US trade deal negotiations: ReportDiscussions will now begin on issues such as market access for US farm goods, India's data localisation rules, and the role of big tech in e-commerce—areas that have previously proved politically sensitive in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-airlines-may-face-turbulence-as-pakistan-closes-its-skies-pahalgam-terror-attack-2715193-2025-04-25",
      "headline": "Indian airlines may face turbulence as Pakistan closes its skiesPakistan has announced shutting its airspace to Indian carriers as tensions rise between the two neighbours following a deadly militant attack in Indian Kashmir earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-to-invest-rs-1000-crore-in-tamil-nadu-plant-report-2715130-2025-04-25",
      "headline": "Samsung to invest Rs 1,000 crore in Tamil Nadu plant: ReportSamsung's Tamil Nadu factory currently employs over 2,000 people. In 2022–23, the plant contributed one-fifth of Samsung's Rs 1 lakh crore sales in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-589-points-lower-nifty-sustains-24000-level-adani-ports-ends-4-percent-lower-2715111-2025-04-25",
      "headline": "Sensex, Nifty close lower as rising India-Pakistan tension spooks investorsThe S&P BSE Sensex lost 588.80 points to end at 79,212.53, while the NSE Nifty50 was down 207.35 points to end at 24,039.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kashmir-economy-impact-tourism-sector-slowdown-pahalgam-terror-attack-india-pakistan-tension-2715110-2025-04-25",
      "headline": "Pahalgam terror attack casts big shadow on Kashmir's booming tourism economyKashmir was slowly rebuilding its image as a peaceful tourist destination after years of conflict, especially after the abrogation of Article 370 in August 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-revises-cut-off-timings-for-overnight-mutual-fund-redemptions-details-here-2715063-2025-04-25",
      "headline": "Sebi revises cut-off timings for overnight mutual fund redemptions. Details hereSebi aims to make sure stock brokers and clearing members use client funds wisely by investing in secure overnight mutual fund schemes (MFOS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-may-buy-10-boeing-planes-turned-down-by-china-report-trump-tariff-announcement-us-china-trade-war-2715010-2025-04-25",
      "headline": "Air India may buy 10 Boeing planes turned down by China: ReportThe ongoing trade tensions between the US and China, marked by steep duties above 100%, have impacted various sectors, even the aviation industry has taken a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-website-portal-crash-psx-down-india-tension-kashmir-attack-2714960-2025-04-25",
      "headline": "Pakistan Stock Exchange portal crashes amid rising geopolitical heatThe online portal of PSX showed a message saying \"We'll be back soon,\" indicating that the website was temporarily unavailable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-resident-shares-costly-homebuying-mistake-dont-fall-for-fomo-reddit-post-high-property-prices-2714958-2025-04-25",
      "headline": "Bengaluru resident shares costly homebuying mistake: 'Don't fall for FOMO'A social media user from Bengaluru shared that he has been living in Bengaluru for the past six years. Like many others, he moved to the city for better career opportunities. Despite being financially stable, he chose to rent rather than buy a flat. But the trouble started soon after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-crash-top-losers-sensex-nifty-india-pakistan-tension-kashmir-terror-attack-nse-bse-2714926-2025-04-25",
      "headline": "Sensex, Nifty tank: Indo-Pak tensions trigger market crash. Check top losersSensex plunged over 1,000 points, while Nifty tanked over 300 points, falling below 24,000 as uncertainty prevailed over geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-plans-to-make-all-us-iphones-in-india-by-2026-report-trump-tariff-announcement-reduce-china-dependency-2714911-2025-04-25",
      "headline": "Apple plans to make all US iPhones in India by 2026: ReportThe said move is part of Apple's long-term plan to reduce its dependence on China, especially after the recent tariff rules announced by US President Donald Trump."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/martin-scorsese-glad-to-join-neeraj-ghaywans-homebound-as-executive-producer-2715571-2025-04-26",
      "headline": "Martin Scorsese 'glad' to join Neeraj Ghaywan's Homebound as executive producerFilmmaker Martin Scorsese has joined Neeraj Ghaywan's 'Homebound' as an executive producer. The film will premiere at the 2025 Cannes Film Festival in the Un Certain Regard section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-members-jin-namjoon-enjoy-coldplay-concert-in-seoul-hint-at-bts-reunion-2715547-2025-04-26",
      "headline": "BTS members Jin, Namjoon enjoy Coldplay concert in Seoul, hint at BTS reunionBTS members Jin and Namjoon attended Coldplay's concert in Seoul on April 25, creating a buzz on social media. The duo hinted at a BTS reunion, delighting fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-flies-economy-class-fans-call-him-ever-humble-superstar-2715539-2025-04-26",
      "headline": "Rajinikanth flies economy class, fans call him 'ever-humble superstar'Actor Rajinikanth took fans by surprise when he boarded an IndiGo flight in economy class, sparking excitement among passengers. The superstar greeted fans warmly, leading to a viral moment captured on video."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/adnan-sami-former-pakistan-minister-exchange-indian-citizenship-pahalgam-attack-2715529-2025-04-26",
      "headline": "Illiterate idiot: Adnan Sami blasts ex-Pak minister for questioning citizenshipThe exchange between Adnan Sami and Fawad Hussian started after the Pakistani leader referred to a direction by Home Minister Amit Shah asking states to ensure the prompt return of Pakistani citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shubhangi-atre-ex-husband-piyush-poorey-death-divorce-reason-2715528-2025-04-26",
      "headline": "Shubhangi Atre on ex-husband Piyush Poorey: Alcohol addiction destroyed himActor Shubhangi Atre opens up about her divorce from her late ex-husband, Piyush Poorey, who passed away due to liver cirrhosis, emphasising the impact of his alcohol addiction on their family and her decision to prioritise their daughter's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-cancels-surat-concert-after-pahalgam-attack-2715518-2025-04-26",
      "headline": "Shreya Ghoshal cancels Surat concert after Pahalgam attackSinger Shreya Ghoshal and organisers cancel Surat concert after Pahalgam attack. Full refunds have been assured to ticket holders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emraan-hashmi-calls-adolescence-style-show-in-india-a-logistical-nightmare-2715489-2025-04-26",
      "headline": "Emraan Hashmi calls Adolescence-style show in India a 'logistical nightmare'Emraan Hashmi recently revealed the challenges of producing a show like 'Adolescence' in India, citing its unique format and logistical hurdles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bullet-train-explosion-review-shinji-higuchi-bullet-train-spiritual-sequel-tsuyoshi-kusanagi-2715283-2025-04-26",
      "headline": "Bullet Train Explosion review: Spiritual sequel that combines heart and heatReleased-Wed Apr 23, 2025Bullet Train Explosion: The Netflix film is a gripping thriller that focuses on the everyday heroes aboard a rigged Shinkansen and outside of it, rather than the perpetrator's motive. Directed by Shinji Higuchi, the film pays tribute to Japan's railway staff, blending tension with humanity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/poet-yahya-bootwala-accuses-kesari-2-writer-sumit-saxena-plagiarism-lifted-lines-without-permission-2715483-2025-04-26",
      "headline": "Kesari 2 dialogue plagiarised from a poem? Poet shares proofKesari Chapter 2 faces allegations of plagiarism as YouTuber and poet Yahya Bootwala accused the film's writer of copying lines from his poem on 'Jallianwala Bagh' without permission. He shared the proof on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-netflix-prime-video-redefining-stardom-with-crazy-casting-jaideep-ahlawat-cinematic-saturday-2715458-2025-04-26",
      "headline": "Crazy casting, crazier pairing: How OTT is heralding a bold new chapterOTT platforms are breaking casting norms wide open—bringing underrated actors and wild on-screen pairings to centre stage. On Cinematic Saturday, we are diving deep into the casting revolution you didn't see coming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-message-vacation-in-kashmir-amid-pahalgam-attack-2715429-2025-04-26",
      "headline": "Next vacation will be in Kashmir: Suniel Shetty's fearless stance amid attackActor Suniel Shetty encourages citizens to visit Kashmir for their next vacation to boost tourism and counterterrorism, following a deadly attack in Pahalgam.  He emphasises unity and resilience as key responses to fear and hatred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/david-muir-honoured-at-time100-gala-recalls-moment-with-late-pope-francis-glbs-2715389-2025-04-26",
      "headline": "David Muir honoured at TIME100 Gala, recalls moment with late Pope FrancisDavid Muir was honored at the 2025 TIME100 Gala for his impactful journalism. He reflected on his early career, praised mentors like Diane Sawyer, and will lead ABC's Vatican coverage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/whats-coming-and-going-on-cbs-2025-26-renewals-cancellations-and-new-shows-glbs-2715382-2025-04-26",
      "headline": "What's coming and going on CBS: 2025–26 renewals, cancellations, and new showsCBS's 2025–26 schedule features renewed hits like NCIS and Ghosts, the end of Blue Bloods and FBI spin-offs, and exciting new entries like Boston Blue and CIA.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sirens-trailer-new-thriller-explores-power-and-sisterhood-glbs-2715355-2025-04-26",
      "headline": "Sirens' trailer: New thriller explores power and sisterhoodNetflix's Sirens, starring Julianne Moore, Milly Alcock, and Meghann Fahy, explores power, class, and sisterhood in a gripping thriller set at a beach estate. It premieres May 22.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-with-family-at-chepauk-stadium-watch-csk-vs-srh-match-live-2715276-2025-04-25",
      "headline": "Ajith Kumar, with son on lap, watches CSK vs SRH match in Chepauk stadiumActor Ajith Kumar attended a cricket match at Chennai's Chepauk Stadium to watch MS Dhoni in action as CSK clashes with SRH. He was present with his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kull-trailer-out-nimrat-kaur-amol-parashar-riddhi-dogra-ekta-kapoors-upcoming-show-jiohotstar-2715272-2025-04-25",
      "headline": "Kull trailer: Raisingh siblings at war in Ekta Kapoor's upcoming showJioHotstar has released the trailer for 'Kull - The Legacy Of The Raisingghs'. The series, produced by Balaji Digital, will stream exclusively on the platform from May 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exploring-park-bo-gums-versatility-a-star-who-shines-across-time-and-genre-2715232-2025-04-25",
      "headline": "Exploring Park Bo-gum's versatility: A star who shines across time and genreSouth Korean actor Park Bo-gum captivated audiences once more with his latest K-drama 'When Life Gives You Tangerines'. His journey from 'Reply 1988' to this latest role showcased his immense talent and versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-shares-pics-from-hospital-reveals-reason-behind-social-media-absence-2715262-2025-04-25",
      "headline": "Zeenat Aman shares pics from hospital, reveals reason behind social media absenceVeteran actor Zeenat Aman has shared a heartfelt update post-hospitalisation, revealing her thoughts on life and social media. She reflects on her journey and the lessons learned during her recovery."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-solidarity-towards-pahalgam-attack-bohot-gussa-hai-exclusive-2715253-2025-04-25",
      "headline": "Nawazuddin Siddiqui reacts to Pahalgam attack: There's a lot of anger in usNawazuddin Siddiqui, during a film promotion event, expressed his solidarity with the victims of the Pahalgam attack by wearing a black band, highlighting his deep sense of anger and pain over the incident."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/fully-prepared-misadventure-shehbaz-sharif-backs-pakistan-army-pahalgam-terror-attack-indus-water-treaty-full-force-2715477-2025-04-26",
      "headline": "Pak's Shehbaz Sharif breaks silence amid tensions: Prepared for any misadventurePakistani Prime Minister Shehbaz Sharif said he was ready for a 'neutral and transparent investigation' into the Pahalgam terror attack that left 26 civilians dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pope-francis-funeral-today-live-updates-world-leaders-trump-murmu-macron-thousands-pay-last-respects-2715404-2025-04-26",
      "headline": "Farewell, Pope Francis: Humble funeral draws world leaders, massive crowds  Live UpdatesDeparting from centuries-old tradition, the Pontiff will be buried in the Basilica di Santa Maria Maggiore unlike his predecessors who were buried beneath St Peter's Basilica within the confines of the Vatican."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-official-throat-slitting-gesture-at-indian-protesters-pahalgam-terror-incident-london-2715493-2025-04-26",
      "headline": "Video: Pak official makes throat-slitting gesture at Indian protesters in LondonA senior Pakistani Army official mocked Indians protesting against Pahalgam terror attacks - drawing ire from netizens, with many calling the act 'sick,' 'disgusting' and a 'stark reminder of the lack of civility among Pakistan's military and diplomatic figures.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-india-vs-pakistan-pahalgam-terror-attack-2715514-2025-04-26",
      "headline": "India should break all cricketing ties with Pakistan: Sourav GangulyFormer India captain Sourav Ganguly has said that India will be well within their rights to break cricketing ties with Pakistan. Ganguly has said that terrorism cannot and should not be tolerated.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-stop-indus-waters-treaty-on-hold-when-can-india-turn-off-pakistan-tap-completely-2715324-2025-04-26",
      "headline": "When can India turn off Pakistan's tap completely?India put on hold the Indus Waters Treaty after the Pahalgam massacre. Eighty percent of Pakistan's farm fields depend on water from the Indus system. With the current infrastructure, India can at best store a portion of the water from flowing into Pakistan. Several projects have been planned to harness the Indus system. How long will it take for India to turn Pakistan's taps off completely if it wanted to?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/adnan-sami-former-pakistan-minister-exchange-indian-citizenship-pahalgam-attack-2715529-2025-04-26",
      "headline": "Illiterate idiot: Adnan Sami blasts ex-Pak minister for questioning citizenshipThe exchange between Adnan Sami and Fawad Hussian started after the Pakistani leader referred to a direction by Home Minister Amit Shah asking states to ensure the prompt return of Pakistani citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-unsafe-for-women-foreign-student-rape-threat-viral-instagram-post-after-auto-ride-horror-2715543-2025-04-26",
      "headline": "Chennai unsafe for women: Foreign student's viral post after auto ride horrorIn an Instagram post, tagging Chennai police, the woman claimed that an auto driver attempted to rape her in broad daylight at a prominent location in the city and even threatened to throw her out of the vehicle following the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/volodymyr-zelenskyy-meet-donald-trump-pope-francis-funeral-ukraine-rome-russia-united-states-of-america-2715542-2025-04-26",
      "headline": "Zelenskyy meets Trump at Pope Francis's funeral, weeks after Oval Office clashUkrainian President Zelenskyy met US President Trump in Rome amid crucial Ukraine-Russia ceasefire negotiations. Their meeting comes after previous tensions and renewed US-Ukraine intelligence cooperation.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-netflix-prime-video-redefining-stardom-with-crazy-casting-jaideep-ahlawat-cinematic-saturday-2715458-2025-04-26",
      "headline": "Crazy casting, crazier pairing: How OTT is heralding a bold new chapterOTT platforms are breaking casting norms wide open—bringing underrated actors and wild on-screen pairings to centre stage. On Cinematic Saturday, we are diving deep into the casting revolution you didn't see coming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bilawal-bhutto-indus-treaty-water-will-flow-or-blood-pakistan-pahalgam-terror-attack-2715430-2025-04-26",
      "headline": "Either our water will flow or their blood: Bilawal Bhutto on Indus treaty freezeThe remarks by Bilawal Bhutto-Zardari signals that India's punitive actions, including the suspension of the Indus Waters Treaty, after the Pahalgam attack have infuriated Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-nationals-leave-india-attari-border-pahalgam-attack-jammu-kashmir-2715443-2025-04-26",
      "headline": "Came for niece's wedding, leaving with heavy heart: Pak family at Attari borderSeveral Pakistanis lined up at the Wagah-Attari border after India issued a directive asking all Pakistani nationals to leave the country immediately in the aftermath of the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ceasefire-violation-pakistan-loc-kashmir-india-retaliates-pahalgam-attack-tensions-terror-2715396-2025-04-26",
      "headline": "'Unprovoked firing' by Pakistan along LoC in Kashmir, Army retaliates Live UpdatesPakistani troops initiated unprovoked small arms firing along the LoC, prompting a proportionate response from Indian forces. No casualties were reported, and border security remains intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/pet-obesity-is-on-the-rise-where-are-hoomans-going-wrong-2715492-2025-04-26",
      "headline": "Pet obesity is on the rise. Where are hoomans going wrong?For true pet parents, life revolves around keeping their furry friends happy and healthy. But if meals aren't portioned to match their needs, you might unknowingly be putting them at risk of obesity.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-flies-economy-class-fans-call-him-ever-humble-superstar-2715539-2025-04-26",
      "headline": "Rajinikanth flies economy class, fans call him 'ever-humble superstar'Actor Rajinikanth took fans by surprise when he boarded an IndiGo flight in economy class, sparking excitement among passengers. The superstar greeted fans warmly, leading to a viral moment captured on video."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sharad-pawar-cautions-india-retaliation-pakistan-pahalgam-terror-attack-2715460-2025-04-26",
      "headline": "Pak won't remain silent: Sharad Pawar urges caution on Pahalgam retaliationNationalist Congress Party-SP chief Sharad Pawar said any decision by the Centre should be carefully considered as Pakistan won't remain silent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-houses-of-lashkar-terrorists-blown-up-2715431-2025-04-26",
      "headline": "Houses of 3 more Lashkar terrorists linked to Pahalgam attack blown upOn Tuesday afternoon, five to six terrorists opened fire on a group of tourists in the Baisaran meadow, which is around 5 kms from Pahalgam. The meadow - also known as 'mini Switzerland' - is accessible only by foot or by horseback. The Pahalgam carnage was one of the deadliest civilian attacks in the Kashmir Valley in recent years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/blood-on-grass-echoes-of-massacre-india-today-at-pahalgam-attack-ground-zero-2715462-2025-04-26",
      "headline": "Blood on grass, echoes of massacre: India Today at Pahalgam attack Ground ZeroOn April 22, terrorists infiltrated Baisaran Valley through a specific entry point inside the park, which killed 26 people, most of them tourists. After firing indiscriminately at unarmed tourists, the terrorists escaped through a planned route. In a chilling video, terrorists were seen forcing tourists to kneel before shooting them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/is-shifting-from-a-hatchback-to-a-subcompact-suv-a-worthy-upgrade-2715467-2025-04-26",
      "headline": "Is shifting from a hatchback to a compact SUV a worthy upgrade?With compact SUVs gaining popularity, many hatchback owners are now considering an upgrade. But does moving to a compact SUV truly offer better value, comfort, and practicality? Let's find out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-congress-mla-lakshnam-singh-claim-omar-abdullah-cahoots-rahul-gandhi-robert-vadra-2715437-2025-04-26",
      "headline": "Omar Abdullah 'may be in cahoots' with terrorists: Ex-Congress MLA's big chargeSenior Congress leader Digvijay Singh's brother and former Congress MLA Lakshman Singh, who has also had a stint with the BJP, in the wake of the Pahalgam terror attack, claimed that Jammu and Kashmir Chief Minister Omar Abdullah \"may be in cahoots\" with terrorists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sukant-singh-suki-toughest-man-in-india-david-goggins-ultramarathon-2715417-2025-04-26",
      "headline": "Toughest man in India? Sukant Singh Suki runs 350 km race in 4 daysMumbai's Sukant Singh Suki became the first Indian to complete three 200-mile ultramarathon races in the world. After his latest run at the Delirious West race in Australia, Suki spoke to IndiaToday.in, narrating his journey, the inspiration and the future of endurance running in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-daughter-killed-as-speeding-car-runs-over-seven-outside-home-in-ups-gorakhpur-2715428-2025-04-26",
      "headline": "Woman, daughter killed as speeding car crushes 7 outside UP home; 1 detainedA high-speed car ran over seven people sitting outside their house in Uttar Pradesh's Gorakhpur around 11:30 pm on Friday. A mother-daughter duo was killed in the accident, while five others were seriously injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/interval-walking-boosts-heart-health-and-helps-you-reduce-weight-what-is-it-2715251-2025-04-26",
      "headline": "Interval walking boosts heart health and helps you reduce weight: What is itInterval walking supports weight loss by boosting metabolism and helping burn more calories compared to steady, slow walking. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/virginia-giuffre-jeffrey-epsteins-prominent-abuse-survivor-dies-by-suicide-glbs-2715394-2025-04-26",
      "headline": "Jeffrey Epstein accuser dies by suicide weeks after saying she 'had days to live'Virginia Giuffre, a key survivor who spoke out against Jeffrey Epstein's abuse, has died by suicide at 41 in Australia. Known for her courage, she helped bring Epstein's enablers to justice and inspired many others to share their stories."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-virat-kohli-virender-sehwag-rajasthan-royals-2715570-2025-04-26",
      "headline": "Vaibhav Suryavanshi should try to emulate Virat Kohli in IPL: Virender SehwagVaibhav Suryvanshi has been told to emulate Virat Kohli and play at least 20 seasons in the IPL by Virender Sehwag. The legendary opener also told Suryavanshi to stay grounded and not let fame get to his head. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-sri-lanka-vs-south-africa-women-tri-series-squads-schedule-all-you-need-to-know-2715173-2025-04-26",
      "headline": "India in Sri Lanka Women's Tri-series Live Streaming: All you need to knowSri Lanka hosts Women's tri-nation series: India, Sri Lanka and South Africa are all set to take part in a tri-nation series, starting May 11 at the R Premadasa Stadium in Colombo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-copa-del-rey-final-controversy-2715557-2025-04-26",
      "headline": "Barcelona vs Real Madrid: Copa del Rey referee controversy explainedControversy struck ahead of FC Barcelona's Copa del Rey final against Real Madrid, set to be held on Saturday, April 26. Madrid alleged animmosity and hostility from the referees towards the club and urged the federation to take action against them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-rinku-singh-300-total-in-indian-premier-league-2715546-2025-04-26",
      "headline": "IPL has reached a stage where even 300 is possible: KKR batter Rinku SinghKolkata Knight Riders star Rinku Singh feels the Indian Premier League has progressed to the point where a side breaking the magical 300-run mark in an innings is no longer surprising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/long-jumper-shaili-singh-breaks-anju-bobby-george-federation-cup-record-reaction-2715538-2025-04-26",
      "headline": "Breaking Anju maam's Federation Cup record is moment of pride for me: ShailiIndia's 21-year-old long jumper Shaili Singh broke the 23-year-old Federation Cup record previously held by her mentor and India's long jump icon Anju Bobby George."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-pbks-ipl-2025-preview-predicted-11s-team-news-pitch-and-weather-conditions-2715527-2025-04-26",
      "headline": "Iyers out to prove a point as playoffs battle heats up in KolkataKKR vs PBKS Preview: Shreyas Iyer and Venkatesh Iyer will be in focus when KKR take on PBKS in their second leg. KKR are in the 7th position in the league table and have to win 5 out of 6 games to reach the  playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indycar-racer-yuven-sundaramoorthy-exclusive-journey-2715522-2025-04-26",
      "headline": "Tesla engineer-turned racing driver: Yuven chasing dreams in Indy NXTYuven Sundaramoorthy made history by becoming the first Indian-American driver to win an IndyCar-sanctioned race. In an exclusive conversation with IndiaToday.in, Sundaramoorthy recently opened up about his journey in motorsports, his historic Indy NXT podium finish, and his F1 aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-copa-del-rey-final-live-streaming-venue-2715515-2025-04-26",
      "headline": "Barcelona vs Real Madrid, Copa del Rey final: All you need to know about El ClasicoBarcelona vs Real Madrid, Copa del Rey final: Barcelona will look to continue their strong form under Hansi Flick, while Carlo Ancelotti's Real Madrid aim to win silverware and end the season on a high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-india-vs-pakistan-pahalgam-terror-attack-2715514-2025-04-26",
      "headline": "India should break all cricketing ties with Pakistan: Sourav GangulyFormer India captain Sourav Ganguly has said that India will be well within their rights to break cricketing ties with Pakistan. Ganguly has said that terrorism cannot and should not be tolerated.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-ipl-2025-campaign-anil-kumble-ms-dhoni-2715480-2025-04-26",
      "headline": "CSK need to build for future, with only 5 games left in IPL 2025: KumbleChennai Super Kings need to figure out their stars for the next season of the IPL, said former cricketer Anil Kumble. Kumble's comments came after the Chennai team failed to defend 155 runs vs SRH at home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suresh-raina-ms-dhoni-csk-auction-strategy-2715465-2025-04-26",
      "headline": "Dhoni was not involved in auction: Raina blames CSK management for IPL 2025 woesFormer India batter Suresh Raina clarified that MS Dhoni has limited involvement in CSK's auction decision and that the core management group handles most of the planning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indycar-racer-yuven-sundaramoorthy-exclusive-journey-2715522-2025-04-26",
      "headline": "Tesla engineer-turned racing driver: Yuven chasing dreams in Indy NXTYuven Sundaramoorthy made history by becoming the first Indian-American driver to win an IndyCar-sanctioned race. In an exclusive conversation with IndiaToday.in, Sundaramoorthy recently opened up about his journey in motorsports, his historic Indy NXT podium finish, and his F1 aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-copa-del-rey-final-live-streaming-venue-2715515-2025-04-26",
      "headline": "Barcelona vs Real Madrid, Copa del Rey final: All you need to know about El ClasicoBarcelona vs Real Madrid, Copa del Rey final: Barcelona will look to continue their strong form under Hansi Flick, while Carlo Ancelotti's Real Madrid aim to win silverware and end the season on a high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-india-vs-pakistan-pahalgam-terror-attack-2715514-2025-04-26",
      "headline": "India should break all cricketing ties with Pakistan: Sourav GangulyFormer India captain Sourav Ganguly has said that India will be well within their rights to break cricketing ties with Pakistan. Ganguly has said that terrorism cannot and should not be tolerated.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-ipl-2025-campaign-anil-kumble-ms-dhoni-2715480-2025-04-26",
      "headline": "CSK need to build for future, with only 5 games left in IPL 2025: KumbleChennai Super Kings need to figure out their stars for the next season of the IPL, said former cricketer Anil Kumble. Kumble's comments came after the Chennai team failed to defend 155 runs vs SRH at home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suresh-raina-ms-dhoni-csk-auction-strategy-2715465-2025-04-26",
      "headline": "Dhoni was not involved in auction: Raina blames CSK management for IPL 2025 woesFormer India batter Suresh Raina clarified that MS Dhoni has limited involvement in CSK's auction decision and that the core management group handles most of the planning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-ipl-playoffs-moeen-ali-press-conference-2715449-2025-04-26",
      "headline": "KKR can still qualify for playoffs: Moeen wants team to take MI mindsetMoeen Ali said that KKR can still make it to the playoffs of the IPL 2025 season. The all-rounder feels that the defending champions need to adopt the mindset that MI are using in their current winning run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-auction-stphen-fleming-comments-2715442-2025-04-26",
      "headline": "CSK did not get the IPL auction right, admits Stephen FlemingChennai Super Kings head coach Stephen Fleming admitted that CSK failed at the IPL mega auction ahead of the season. CSK have been in woeful form in this IPL, losing 7 out of their first 9 matches.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-ravi-shastri-josh-hazlewood-mcgrath-australia-vs-south-africa-2715436-2025-04-26",
      "headline": "Josh Hazlewood should start in WTC final: Shastri likens Australia pacer to McGrathFormer Indian coach Ravi Shastri said veteran Australia pacer Josh Hazlewood would fare better than Scott Boland against Australia in the World Test Championship (WTC) final at Lords."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sukant-singh-suki-toughest-man-in-india-david-goggins-ultramarathon-2715417-2025-04-26",
      "headline": "Toughest man in India? Sukant Singh Suki runs 350 km race in 4 daysMumbai's Sukant Singh Suki became the first Indian to complete three 200-mile ultramarathon races in the world. After his latest run at the Delirious West race in Australia, Suki spoke to IndiaToday.in, narrating his journey, the inspiration and the future of endurance running in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tanush-kotian-joins-punjab-kings-as-net-bowler-ahead-of-kkr-clash-2715414-2025-04-26",
      "headline": "Tanush Kotian joins Punjab Kings as net bowler ahead of KKR clashTanush Kotian, who was part of Rajasthan Royals last year, joined the Punjab Kings as a net bowler on Friday, midway through the current season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-pbks-venkatesh-iyer-price-tag-2715413-2025-04-26",
      "headline": "Venkatesh Iyer underperforming due to price tag pressure: RP SinghRP Singh feels that Venkatesh Iyer is underperforming because he is trying too hard to justify his hefty price tag. Venkatesh has struggled for form during the IPL 2025 season and has not been able to perform with either bat or ball. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-pbks-shreyas-iyer-captain-ipl-2025-eden-gardens-pitch-2715405-2025-04-26",
      "headline": "Hurt by snub, Shreyas Iyer will be fired up for Kolkata return: Sunil GavaskarSunil Gavaskar feels that Shreyas Iyer will be out to prove half a dozen points against his former side KKR when they take on PBKS on Saturday, April 26. Shreyas guided KKR to the title last season. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kamindu-mendis-catch-to-dismiss-dewald-brevis-was-gamechanger-daniel-vettori-2715401-2025-04-26",
      "headline": "Kamindu Mendis' catch to dismiss Dewald Brevis was the gamechanger: Daniel VettoriIPL 2025, CSK vs SRH: Sunrisers Hyderabad head coach Daniel Vettori praised Kamindu Mendis for taking the brilliant catch at long-off to dismiss Dewald Brevis in the clash on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tanush-kotian-joins-punjab-kings-as-net-bowler-ahead-of-kkr-clash-2715414-2025-04-26",
      "headline": "Tanush Kotian joins Punjab Kings as net bowler ahead of KKR clashTanush Kotian, who was part of Rajasthan Royals last year, joined the Punjab Kings as a net bowler on Friday, midway through the current season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-pbks-venkatesh-iyer-price-tag-2715413-2025-04-26",
      "headline": "Venkatesh Iyer underperforming due to price tag pressure: RP SinghRP Singh feels that Venkatesh Iyer is underperforming because he is trying too hard to justify his hefty price tag. Venkatesh has struggled for form during the IPL 2025 season and has not been able to perform with either bat or ball. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-pbks-shreyas-iyer-captain-ipl-2025-eden-gardens-pitch-2715405-2025-04-26",
      "headline": "Hurt by snub, Shreyas Iyer will be fired up for Kolkata return: Sunil GavaskarSunil Gavaskar feels that Shreyas Iyer will be out to prove half a dozen points against his former side KKR when they take on PBKS on Saturday, April 26. Shreyas guided KKR to the title last season. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kamindu-mendis-catch-to-dismiss-dewald-brevis-was-gamechanger-daniel-vettori-2715401-2025-04-26",
      "headline": "Kamindu Mendis' catch to dismiss Dewald Brevis was the gamechanger: Daniel VettoriIPL 2025, CSK vs SRH: Sunrisers Hyderabad head coach Daniel Vettori praised Kamindu Mendis for taking the brilliant catch at long-off to dismiss Dewald Brevis in the clash on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-ipl-points-table-2715397-2025-04-26",
      "headline": "Shock to the system: Why CSK should finish 10th in IPL 2025 to bring in changesCSK have got a shock to their system this season in the IPL as their performances haven't been up to the mark. The 5-time champions need a hard reset and a last place finish could start that chamber reaction. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shreyas-iyer-ipl-2025-kkr-vs-pbks-sunil-joshi-2715359-2025-04-26",
      "headline": "Shreyas has shown hunger, ready to accept every challenge: Sunil JoshiIPL 2025, KKR vs PBKS: In the pre-match press conference, Punjab Kings' bowling coach Sunil Joshi was impressed with how Shreyas Iyer has upped his game over the last 8-10 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-harshal-patel-csk-vs-srh-chennai-2715357-2025-04-26",
      "headline": "How Harshal Patel plotted MS Dhoni's downfall in CSK vs SRH clashIPL 2025, CSK vs SRH: Harshal Patel said how he managed to dismiss MS Dhoni in the match on Friday, April 25, at the MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-ms-dhoni-reaction-defeat-playoffs-chances-2715353-2025-04-26",
      "headline": "Too many holes to plug: MS Dhoni reacts to CSK's torrid IPL 2025 campaignIPL 2025, CSK vs SRH: Captain MS Dhoni conceded that CSK have not been able to find answers to their problems despite giving opportunities to as many as 21 players in nine matches. CSK were outclassed by the SunRisers in Chennai on Friday, April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-pat-cummins-playoffs-chennai-chepauk-2715351-2025-04-26",
      "headline": "SRH to give a crack at making it to IPL 2025 playoffs: Pat Cummins after CSK winPat Cummins said that SRH will give a good crack at trying to reach the playoffs of the IPL 2025 season. SRH ended their jinx at the Chepauk and beat CSK on Friday, April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-csk-vs-srh-ipl-2025-playoffs-qualification-2715337-2025-04-25",
      "headline": "Chennai Super Kings can still qualify for playoffs. Here's howIPL 2025, CSK vs SRH: Chennai Super Kings can still enter the playoffs through the backdoor despite their five-wicket loss to the Sunrisers Hyderabad on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-chennai-out-playoffs-race-sunrisers-ms-dhoni-2715330-2025-04-25",
      "headline": "IPL 2025: Insipid CSK all but out of playoff race as SRH notch first away winIPL 2025, CSK vs SRH: Chennai Super Kings were comfortably outclassed by SunRisers Hyderabad, who collected two crucial points despite not being at their best. MS Dhoni's men are unlikely to make the playoffs after losing seven out of their first nine games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-gujarat-titans-steffan-jones-2715328-2025-04-25",
      "headline": "How Ishant Sharma found his mojo under coach and ally Steffan JonesIPL 2025: After losing his place in the Indian Test team in 2022, Ishant Sharma worked with Steffan Jones to get his rhythm back and make a strong comeback in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-sunil-narine-ipl-2025-kkr-vs-pbks-2715323-2025-04-25",
      "headline": "Chahal doesn't need to be reminded of his capabilities: Sunil JoshiIPL 2025: PBKS spin bowling coach Sunil Joshi heaped praise on Yuzvendra Chahal before the clash against the Kolkata Knight Riders on April 25 at the Eden Gardens in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-2025-korea-india-squad-no-neeraj-chopra-2715321-2025-04-25",
      "headline": "Neeraj Chopra to skip Asian Athletics Championships as India name 59-member squadIndia has revealed its squad for the Asian Athletics Championship, scheduled to be held from May 27 to 31 in South Korea. Neeraj Chopra will skip the event to focus on other major competitions, including the NC Classic in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-kavya-maran-celebrates-ms-dhoni-wicket-video-2715298-2025-04-25",
      "headline": "Watch: MS Dhoni wicket sparks contrasting emotions as Kavya Maran celebrates in ChepaukIPL 2025: While the rest of the Chennai crowd was silenced, SunRisers Hyderabad owner Kavya Maran celebrated MS Dhoni's wicket from the stands. CSK were bowled out for 154 in 19.5 overs on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-kkr-vs-pbks-moeen-ali-press-conference-kolkata-2715297-2025-04-25",
      "headline": "KKR still affected by record PBKS loss in Mullanpur? Moeen Ali reactsKKR all-rounder Moeen Ali has admitted that their record loss to PBKS in Mullanpur still lingers in their mind, but the defending champions will be looking to bounce back in the reverse fixture on April 26. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}