{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-13-nse-bse-trading-tata-group-ril-hcl-asian-paints-icra-icici-bank-2740062-2025-06-13",
      "headline": "Stocks to watch on June 13: Tata Group, RIL, HCL, Asian Paints, ICRA, ICICI BankShares of several Tata Group companies, such as Tata Motors, Tata Steel and Tata Chemicals, are expected to remain in the spotlight after the crash of Air India flight AI171 in Ahmedabad shortly after takeoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/boeing-shares-nosedive-5-percent-after-air-india-dreamliner-crash-kills-over-200-2739941-2025-06-12",
      "headline": "Boeing shares slide 5% after Air India Dreamliner crash kills over 200Flight AI171, bound for London, went down minutes after departure, killing more than 200 people in what is now the world's deadliest aviation disaster in a decade. The cause of the crash remains unclear. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-to-give-rs-1-crore-to-families-of-ahmedabad-air-india-787-dreamliner-plane-crash-victims-2739919-2025-06-12",
      "headline": "Tata Group to give Rs 1 crore to families of Ahmedabad Air India crash victimsTata Group will offer Rs 1 crore to family members of people who lost their lives in the Ahmedabad crash of Air India Flight 171, which killed over 200 people on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-ceo-campbell-wilson-reaction-to-ahmedabad-london-787-dreamliner-plane-crash-2739907-2025-06-12",
      "headline": "This is a difficult day for us: Air India CEO reacts to Ahmedabad plane crashAt least 204 people were killed and 41 injured after the London-bound Air India flight crashed just minutes after taking off from Ahmedabad's Sardar Vallabhbhai Patel International Airport on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-six-year-low-falls-to-282-percent-in-may-2025-2739809-2025-06-12",
      "headline": "Retail inflation hits six-year low, falls to 2.82% in May 2025The decline in retail inflation is mainly because food prices rose at a much slower pace than before. Cheaper vegetables, fruits, cereals, and pulses helped bring food inflation down sharply. In May, food inflation fell to 0.99% from 1.78% in April."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-tata-shares-fall-air-india-crash-2739766-2025-06-12",
      "headline": "Sensex tanks 823 points, Nifty falls below 25,000; Tata Motors falls 3%The S&P BSE Sensex was down by 823.16 points to close at 81,691.98, while the NSE Nifty50 fell by 253.20 points to settle at 24,888.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-reacts-after-air-india-plane-crashes-in-ahmedabad-with-242-onboard-2739764-2025-06-12",
      "headline": "Boeing reacts to Air India plane crash in Ahmedabad, says aware of initial reportsThe London-bound flight AI-171, carrying 242 people including 230 passengers and 12 crew members, crashed in the Meghaninagar area near the Sardar Vallabhbhai Patel International Airport minutes after takeoff. The plane had issued a mayday call before losing contact with air traffic control."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shocked-and-deeply-saddened-gautam-adani-after-air-india-plane-crash-in-ahmedabad-2739761-2025-06-12",
      "headline": "Shocked and deeply saddened: Gautam Adani after Air India plane crash in AhmedabadOn Thursday afternoon, an Air India flight heading to London crashed just minutes after take-off, with 242 people on board. The flight, AI-171, was being operated by a Boeing 787 Dreamliner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-flight-171-crash-ahmedabad-airport-operations-suspended-2739753-2025-06-12",
      "headline": "Focus on supporting affected people: Tata Group chief on Ahmedabad plane crashThe airplane crash has led to a temporary suspension of flight operations at Sardar Vallabhbhai Patel International Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-share-price-down-7-percent-in-pre-market-trading-after-air-india-plane-crash-ahmedabad-2739751-2025-06-12",
      "headline": "Boeing shares tumble 8% after Air India flight crashes in AhmedabadBoeing shares nosedived over 8% in pre-market trade after the Air India Dreamliner crash in Ahmedabad, deepening investor concerns over the jetmaker's safety record and regulatory troubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-voluntary-buyouts-knowledge-ads-teams-ai-investment-voluntary-exit-programme-mention-report-2739707-2025-06-12",
      "headline": "Google offers buyout plans amid AI-focused overhaul: ReportGoogle is now giving some employees the option to leave the company with a severance package. This is being called a \"voluntary exit programme\", as per reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dalal-street-falls-nearly-1-percent-us-china-trade-middle-east-tensions-stock-market-falling-sensex-down-700-points-2739681-2025-06-12",
      "headline": "Dalal Street dips nearly 1 percent on global trade and geopolitical concernsStock market today: The fall occurred despite markets erasing early losses as the S&P BSE Sensex fell by 911 points to 81,603.95 and the NSE Nifty50 lost 288.75 points to 24,854.45 by 2:29 pm."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-clarifies-air-india-flight-co-pilot-clive-kunder-wasnt-his-cousin-2740059-2025-06-13",
      "headline": "Vikrant Massey clarifies Air India flight co-pilot Clive Kunder wasn't his cousinActor Vikrant Massey has addressed rumours about losing his cousin in the recent Air India crash. He confirmed that the victim, Clive Kunder, was a close family friend, not a relative.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-saif-ali-khan-karisma-kapoor-house-after-ex-husband-sunjay-kapur-death-2740047-2025-06-13",
      "headline": "Kareena and Saif rush to Karisma Kapoor's house after Sunjay Kapur's deathKareena Kapoor and Saif Ali Khan rushed to Karisma Kapoor's house after her ex-husband Sunjay Kapur's death. Sunjay died of a heart attack while playing polo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eric-dane-opens-up-about-als-diagnosis-in-first-tv-interview-glbs-2740032-2025-06-13",
      "headline": "Eric Dane opens up about ALS diagnosis: I don't think this is end of my storyEric Dane opens up about his ALS diagnosis in an emotional GMA interview, sharing strength, hope, and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mel-brooks-to-return-as-yogurt-in-long-awaited-spaceballs-sequel-glbs-2740022-2025-06-13",
      "headline": "Mel Brooks to Return as Yogurt in Long-Awaited 'Spaceballs' SequelMel Brooks will reprise his role as Yogurt in a new Spaceballs sequel from Amazon MGM, set for 2027. The cult comedy legend returns to acting just ahead of his 99th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/who-is-callum-turner-dua-lipas-fiance-and-award-nominated-actor-glbs-2740016-2025-06-13",
      "headline": "Who is Callum Turner? Dua Lipa's fiancé and award-nominated actorCallum Turner, now engaged to Dua Lipa, has steadily built a celebrated career with acclaimed roles and major nominations, transitioning from modeling to acting and earning a $5 million net worth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-ex-husband-sunjay-kapur-dies-of-heart-attack-at-53-2740002-2025-06-12",
      "headline": "Karisma Kapoor's ex-husband Sunjay Kapur dies of heart attack at 53 Actor Karisma Kapoor's ex-husband, Sanjay Kapur, died of a heart attack in England. He was 53."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dua-lipa-callum-turner-are-engaged-singer-reflects-on-growing-old-with-actor-2739915-2025-06-12",
      "headline": "Dua Lipa, Callum Turner are engaged, singer reflects on growing old with actorSinger Dua Lipa confirmed her engagement to British actor Callum Turner. She also opened up on her future plans with Turner, while reflecting on their bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-romance-with-k-drama-star-chae-soo-bin-in-new-ad-charms-fans-2739885-2025-06-12",
      "headline": "Siddhant Chaturvedi's romance with K-drama star Chae Soo-bin in new ad charms fansSiddhant Chaturvedi teamed up with K-drama star Chae Soo-bin for a new ad that captured a romantic moment between the two - and it's gone viral. Fans love the dreamy vibe, calling it a perfect blend of K-drama aesthetics and Mumbai monsoon romance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/aamir-khan-found-shah-rukh-khans-film-swades-boring-has-still-not-watched-it-2739866-2025-06-12",
      "headline": "Aamir Khan rejected Swades, never watched SRK's film. Here's whyActor Aamir Khan shared that he is yet to watch Shah Rukh Khan starrer 'Swades'. He said the film was initially offered to him, but he found it very boring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-17-abhishek-kumar-recalls-casting-couch-incident-rota-rota-ghar-gaya-2739851-2025-06-12",
      "headline": "Rota rota ghar gaya: Bigg Boss 17's Abhishek Kumar recalls casting couch incidentActor Abhishek Kumar opened up about a distressing casting couch experience in Mumbai. The actor said that the incident left him traumatised and made him reconsider his career in the entertainment industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-defends-endorsing-sports-betting-app-if-it-is-legal-let-me-do-it-2739800-2025-06-12",
      "headline": "Aamir Khan defends endorsing sports betting app: If it is legal, let me do itActor Aamir Khan opened up on his decision to endorse a sports betting app while refraining from alcohol and tobacco advertisements. The actor highlighted his consideration for quality and creative scripts while saying yes to brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-heartbroken-after-ahmedabad-plane-crash-sends-prayers-for-victims-families-2739862-2025-06-12",
      "headline": "SRK heartbroken after Ahmedabad plane crash, sends prayers for victims' familiesActor Shah Rukh Khan shared a note on X, expressing deep grief for the victims of the Ahmedabad plane crash. The actor also sent prayers for the families of those affected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-shares-rare-pic-of-dharmendra-and-prakash-kaur-on-their-71st-anniversary-2739819-2025-06-12",
      "headline": "Bobby Deol shares rare pic of Dharmendra and Prakash Kaur on their 71st anniversaryActor Bobby Deol shared a rare picture of his parents, actor Dharmendra and his first wife, Prakash Kaur, on social media. His post marked the 71st wedding anniversary celebration of his parents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nikhil-siddhartha-reacts-after-india-house-set-accident-confirms-no-human-damage-2739708-2025-06-12",
      "headline": "No human damage: Actor Nikhil Siddhartha reacts after India House set accidentA water tank burst flooded the set of Ram Charan's maiden production 'The India House', causing significant damage but no loss of life. Lead actor Nikhil Siddhartha and producer Abhishek Agarwal confirmed the safety of all involved and thanked the crew for their quick response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-jitendra-kumar-leadership-from-kota-to-phulera-prove-not-all-heroes-wear-capes-2739637-2025-06-12",
      "headline": "Why Jitendra Kumar's leadership from Kota to Phulera prove not all heroes wear capesJitendra Kumar's roles as Jeetu Bhaiya in 'Kota Factory' and Abhishek in 'Panchayat' have quietly redefined how mentorship and leadership are portrayed on screen. Through empathy and simplicity, he's become a relatable guide for both students and senior citizens across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keerthy-suresh-action-comedy-revolver-rita-release-in-august-2739784-2025-06-12",
      "headline": "Keerthy Suresh's action‑comedy Revolver Rita to release in August. Promo outFollowing her Bollywood debut in 'Baby John', Keerthy Suresh returns to Tamil cinema with her upcoming quirky action-comedy 'Revolver Rita', set to hit theatres in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/elijah-cooper-zahara-jolie-pitt-rumoured-fiance-2739770-2025-06-12",
      "headline": "Who is Elijah Cooper, Zahara Jolie-Pitt's rumoured fiance? All you need to knowAngelina Jolie and Brad Pitt's daughter Zahara sparked a social media frenzy after being seen at the celebrity hotspot Craig's with her rumoured boyfriend, Elijah Cooper, wearing a diamond ring. This sighting has left fans buzzing with questions, especially: who is Elijah Cooper?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/salman-khan-indian-supercross-racing-league-kannappa-trailer-launch-postponed-after-ahmedabad-plane-crash-2739790-2025-06-12",
      "headline": "Salman Khan's event, Kannappa trailer launch postponed after Ahmedabad plane crashSalman Khan's event and the 'Kannappa' trailer launch were called off after an Air India flight to London crashed just five minutes after takeoff from Ahmedabad's Sardar Vallabhbhai Patel International Airport on Thursday afternoon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/big-b-playful-reaction-to-director-saying-he-spoiled-industry-work-template-2739674-2025-06-12",
      "headline": "Big B's playful reaction to director saying he spoiled industry's work templateActor Amitabh Bachchan recently shared a light-hearted conversation with one of the directors of his ad film. In his playful blog post, he admitted how people felt he might spoil the industry's work template. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-plane-crash-live-updates-air-india-flight-boeing-london-passengers-death-casualties-rescue-2739697-2025-06-12",
      "headline": "Live: PM Modi arrives at Ahmedabad airport, to visit crash siteAir India Ahmedabad-London Flight Crash Live: At least 265 people have died in the Air India plane crash that took place in Ahmedabad on Thursday. Prime Minister Narendra Modi is likely to visit Ahmedabad to take stock of the situation. The airline, in a post on X, confirmed that only one of the 242 passengers and crew onboard had miraculously survived the crash. Rescue operations at the site have now been completed. The flight bound for London crashed near Ahmedabad airport during take-off. The crash occurred as the aircraft was lifting off, according to early reports. Emergency services are at the scene. Stay with IndiaToday.in for live updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-latest-news-ahmedabad-airport-death-injured-survivor-pm-modi-amit-shah-boeing-cause-investigation-2740044-2025-06-13",
      "headline": "265 dead in Air India crash, 1 survivor; PM to visit accident site shortlyAir India Flight AI171 bound for London crashed moments after taking off from Ahmedabad airport, killing at least 265 people in what authorities described as the world's worst aviation disaster in a decade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-launches-airstrike-in-iran-explosions-heard-in-tehran-report-glbs-2740035-2025-06-13",
      "headline": "Israel launches preemptive strike on Iran without US support; blasts hit TehranThe Israeli Air Force conducted a strike inside Iran in a major escalation in Middle East tensions. Explosions were reported near Tehran, while Israel declared a nationwide emergency in anticipation of possible missile and drone attacks. Israel's Defence Minister warned of imminent retaliation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/air-india-ahmedabad-flight-crash-a-commercial-pilot-gives-first-analysis-2739802-2025-06-12",
      "headline": "Air India crash: What may have gone wrong? A commercial pilot's first analysisVisual evidence shows that as the Boeing 787-8 Dreamliner departed, its landing gear remained extended and its wing flaps were fully retracted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-explainer-how-ill-fated-air-india-171-crashed-2739913-2025-06-12",
      "headline": "Video explainer: How ill-fated Air India AI-171 crashedAn Air India plane with 242 people on board crashed near Sardar Vallabhbhai Patel International Airport shortly after taking-off on Thursday in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/irans-revolutionary-guards-chief-hossein-salam-killed-in-israeli-strike-tehran-state-media-confirms-2740046-2025-06-13",
      "headline": "Iran's Revolutionary Guards chief Hossein Salami killed in Israeli strike: ReportsIranian state media on Friday confirmed the killing of Iran's Revolutionary Guards Commander Hossein Salami in an Israeli strike."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/temperature-high-due-to-burning-of-125-lakh-litre-fuel-no-opportunity-to-save-anyone-amit-shah-2739968-2025-06-12",
      "headline": "No chance to save, 1.25 lakh litre fuel burned: Amit Shah on plane crashOn Thursday, flight AI-171 crashed on a government hospital hostel near Ahemdabad's Sardar Vallabbhai Patel International Airport, leaving a field of debris and scenes of devastation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/former-gujarat-chief-minister-vijay-rupani-dies-in-air-india-ahmedabad-london-plane-crash-state-bjp-chief-2739899-2025-06-12",
      "headline": "Vijay Rupani, former Gujarat Chief Minister, dies in Air India plane crashFormer Gujarat CM Vijay Rupani, who served between 2016 and 2021, was among the passengers on the ill-fated London-bound Dreamliner that went down minutes after take-off from Ahmedabad. Rupani's demise marks the second time a former Gujarat CM has died in a plane crash, six decades after Balwantrai Mehta's fatal air accident in 1965."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/cctv-video-of-deadly-air-india-plane-crash-in-ahmedabad-emerges-2739911-2025-06-12",
      "headline": "Take-off to crash within 1 minute: CCTV video of ill-fated Air India flightIndia Today has accessed exclusive CCTV footage of the Air India plane that crashed in Ahmedabad on Thursday.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-survivor-ahmedabad-jumped-off-2739889-2025-06-12",
      "headline": "Video: Man on seat 11A miraculously walks out after deadly Air India crashOne passenger survived the Air India plane crash after jumping off the flight. The crash killed 204 people in Ahmedabad today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/clive-kunder-vikrant-massey-cousin-air-india-flight-co-pilot-dies-crash-ahmedabad-2739979-2025-06-12",
      "headline": "Clive Kunder, Vikrant Massey's cousin and Air India flight co-pilot, dies in crashVikrant Massey's cousin Clive Kunder was the First Officer on board flight AI171, which was en route to London's Gatwick Airport. The flight crashed moments after takeoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/no-immediate-reason-to-ground-boeing-787-us-officials-after-air-india-crash-glbs-2740026-2025-06-13",
      "headline": "No immediate reason to ground Boeing 787: US officials after Air India crashAfter a deadly Air India crash killed over 240 people, US officials said there's no current reason to ground Boeing 787 jets. Transportation Secretary Sean Duffy confirmed that FAA and NTSB teams are working with Indian authorities and Boeing to investigate. \"We will follow the facts and put safety first,\" Duffy said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/scenes-from-bj-medical-college-civil-hospital-hostel-site-of-air-india-flight-crash-ahmedabad-pics-2739804-2025-06-12",
      "headline": "Plane tail, lunch on tables: Scenes from doctors' hostel, site of Air India crashAir India flight 171 en route to London crashed minutes after it took off from the Ahmedabad airport on Thursday afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/newlywed-from-rajasthan-on-way-to-meet-husband-in-uk-among-victims-of-gujarat-air-crash-2739949-2025-06-12",
      "headline": "Newlywed on way to meet husband in UK among victims of Gujarat air crashKhushboo and Vipul married in January this year. While Vipul had left for UK shortly after the wedding, Khushboo was on her way to join him when the flight she was travelling on crashed in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-netanyahu-iran-nuclear-enrichment-programme-us-arent-involved-middle-east-2740043-2025-06-13",
      "headline": "Israel struck heart of Iran's nuclear enrichment programme: NetanyahuIsrael launched a preemptive strike on Iran, targeting key nuclear and missile sites. Prime Minister Netanyahu called it a decisive moment for Israel, vowing to continue the operation as long as needed. Iran is expected to retaliate with missile and drone attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-day-2-score-alex-carey-pat-cummins-lungi-ngidi-2739984-2025-06-12",
      "headline": "WTC final on a knife's edge as Australia, South Africa trade blows on Day 2WTC 2025 final, SA vs AUS: Alex Carey chipped in with a crucial 43 to rescue Australia from 73 for 7 and help them finish with 144 for 8 at Stumps on Day 2. 28 wickets have fallen in the first two days of the big final at Lord's and Australia have their noses ahead, only by a small margin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dua-lipa-callum-turner-are-engaged-singer-reflects-on-growing-old-with-actor-2739915-2025-06-12",
      "headline": "Dua Lipa, Callum Turner are engaged, singer reflects on growing old with actorSinger Dua Lipa confirmed her engagement to British actor Callum Turner. She also opened up on her future plans with Turner, while reflecting on their bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-help-offer-after-air-india-plane-crash-reaction-terrible-worst-in-aviation-history-2739974-2025-06-12",
      "headline": "Anything we can do to help: Donald Trump after Air India plane crashUS President Donald Trump has offered his support following the Ahmedabad plane crash in which more than 200 people lost their lives. The Boeing 787-8 Dreamliner aircraft crashed five minutes after taking-off near Ahmedabad airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-techie-restarts-career-as-swiggy-delivery-agent-with-a-bigger-plan-ahead-2739950-2025-06-12",
      "headline": "Bengaluru techie restarts career as Swiggy delivery agent with a bigger plan aheadNithin Kumar, a resident of Bengaluru, shared a powerful story on X about his interaction with Swiggy delivery agent Padmanaban Ebbas - a full-stack developer with over 19 years of experience in the tech industry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sonam-raj-kushwaha-murder-of-raja-raghuvanshi-meghalaya-honeymoon-case-police-shocking-details-plan-2740027-2025-06-13",
      "headline": "Raj mastermind, aides killed as favour: New details in Raja Raghuvanshi's murder caseAccording to Shillong Superintendent of Police Vivek Syiem, the murder was planned 11 days before Sonam's wedding to Raja."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-ahmedabad-airport-banswara-family-death-toll-2739989-2025-06-12",
      "headline": "Rajasthan couple headed to London with kids among Air India plane crash victimsThe family was traveling together when the ill-fated aircraft, operating as flight AI171, crashed into a medical college complex in Ahmedabad's Meghaninagar area and erupted into flames."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-ex-husband-sunjay-kapur-dies-of-heart-attack-at-53-2740002-2025-06-12",
      "headline": "Karisma Kapoor's ex-husband Sunjay Kapur dies of heart attack at 53 Actor Karisma Kapoor's ex-husband, Sanjay Kapur, died of a heart attack in England. He was 53."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/might-go-up-trump-signals-hike-in-auto-tariffs-for-more-us-production-glbs-2740024-2025-06-13",
      "headline": "Might go up: Trump signals hike in auto tariffs for more US productionDonald Trump warns of a potential auto tariff hike to boost U.S. manufacturing, citing recent investments by GM and Hyundai. Automakers face rising costs and pressure under existing trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/british-nationals-last-video-air-india-flight-crash-ahmedabad-2739924-2025-06-12",
      "headline": "Going back happily: British nationals in last video before Air India flight crashTwo tourists from Britain shot a video at the Ahmedabad airport, bidding goodbye to India. Shortly after, the flight crashed near the airport, with the fate of the two Britons unclear."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-pat-cummins-on-david-bedingham-handling-the-ball-2740058-2025-06-13",
      "headline": "Did Australia withdraw appeal against David Bedingham in WTC final? Cummins revealsAustralia captain Pat Cummins said that they would've withdrawn the appeal against David Bedingham for handling the ball, if the umpires didn't signal dead ball on Day 2 of the World Test Championship (WTC) final 2025 against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-mumbai-league-shreyas-iyer-team-final-defeat-ipl-punjab-2740005-2025-06-13",
      "headline": "From IPL 2025 to T20 Mumbai: Shreyas Iyer endures back-to-back final heartbreaksT20 Mumbai League 2025: Shreyas Iyer endured a second heartbreak in June as his side, SoBo Mumbai Falcons, lost the final of the inaugural edition of the T20 tournament in Mumbai. On June 3, Shreyas's Punjab Kings lost to RCB in the IPL final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-u-mumba-qualify-for-semifinals-end-dabang-delhi-unbeaten-streak-2740001-2025-06-12",
      "headline": "UTT Season 6: U Mumba qualify for semifinals, end Dabang Delhi's unbeaten streakU Mumba TT clinched the last available semi-final berth in Ultimate Table Tennis (UTT) Season 6 after defeating Dabang Delhi TTC 10-5 in a crucial match held in Ahmedabad on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-lungi-ngidi-reaction-australia-218-run-lead-vs-south-africa-day-2-2739992-2025-06-12",
      "headline": "South Africa well-placed in WTC final: Ngidi confident despite 218-run deficitLungi Ngidi was confident that South Africa's bowlers could finish the job early on the third day, removing the final two Australian wickets and keeping the target below 230—a total he believes would give the Proteas a genuine chance of winning their first World Test Championship title.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-day-2-score-alex-carey-pat-cummins-lungi-ngidi-2739984-2025-06-12",
      "headline": "WTC final on a knife's edge as Australia, South Africa trade blows on Day 2WTC 2025 final, SA vs AUS: Alex Carey chipped in with a crucial 43 to rescue Australia from 73 for 7 and help them finish with 144 for 8 at Stumps on Day 2. 28 wickets have fallen in the first two days of the big final at Lord's and Australia have their noses ahead, only by a small margin. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/air-india-crash-tribute-t20-mumbai-league-final-wankhede-2739969-2025-06-12",
      "headline": "Players observe silence in Mumbai T20 final to mourn Air India plane crash victimsMumbai T20 League 2025 final: Players from both the SoBo Mumbai Falcons and the Mumbai South Central Maratha Royals observed a one-minute silence to mourn the victims of the tragic Air India plane crash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kevin-de-bruyne-joins-napoli-free-transfer-serie-a-champions-league-2739951-2025-06-12",
      "headline": "Kevin De Bruyne joins Napoli on free transfer after leaving Manchester CitySerie A champions Napoli have confirmed the signing of Kevin De Bruyne on a free transfer following his exit from Manchester City at the end of his contract."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-tri-series-afghanistan-uae-asia-cup-uncertainty-2739931-2025-06-12",
      "headline": "Pakistan in talks with Afghanistan for tri-series if Asia Cup is postponedThe Pakistan Cricket Board is negotiating a tri-series with Afghanistan and UAE amid doubts over the Asia Cup in India. India have the hosting rights for the continental tournament, scheduled to be held later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-sideline-babar-azam-muhammad-rizwan-shaheen-afridi-from-t20-plans-2739922-2025-06-12",
      "headline": "Pakistan sideline Babar Azam, Muhammad Rizwan, Shaheen Afridi from T20 plansThe Pakistan selectors have decided to exclude senior players such as Babar Azam, Muhammad Rizwan, and Shaheen Shah Afridi from the upcoming T20 series against the West Indies and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-collision-kyle-verreynne-wtc-final-lords-2739872-2025-06-12",
      "headline": "Watch: Pat Cummins collides with Kyle Verreynne before taking a successful reviewWTC Final, Australia vs South Africa: Pat Cummins collided with Kyle Verreynne during a dramatic LBW appeal, but that didn't stop the Australian skipper from going for the DRS — which ultimately resulted in the wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mehidy-hasan-miraz-bangladesh-odi-captain-2739904-2025-06-12",
      "headline": "Mehidy Hasan Miraz named Bangladesh ODI captain for 12 monthsMehidy Hasan Miraz has replaced Najmul Hossain Shanto as Bangladesh's new ODI captain \"for the next 12 months\". Miraz has previously captained Bangladesh in four ODIs in Shanto's absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kevin-de-bruyne-joins-napoli-free-transfer-serie-a-champions-league-2739951-2025-06-12",
      "headline": "Kevin De Bruyne joins Napoli on free transfer after leaving Manchester CitySerie A champions Napoli have confirmed the signing of Kevin De Bruyne on a free transfer following his exit from Manchester City at the end of his contract."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-tri-series-afghanistan-uae-asia-cup-uncertainty-2739931-2025-06-12",
      "headline": "Pakistan in talks with Afghanistan for tri-series if Asia Cup is postponedThe Pakistan Cricket Board is negotiating a tri-series with Afghanistan and UAE amid doubts over the Asia Cup in India. India have the hosting rights for the continental tournament, scheduled to be held later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-sideline-babar-azam-muhammad-rizwan-shaheen-afridi-from-t20-plans-2739922-2025-06-12",
      "headline": "Pakistan sideline Babar Azam, Muhammad Rizwan, Shaheen Afridi from T20 plansThe Pakistan selectors have decided to exclude senior players such as Babar Azam, Muhammad Rizwan, and Shaheen Shah Afridi from the upcoming T20 series against the West Indies and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-collision-kyle-verreynne-wtc-final-lords-2739872-2025-06-12",
      "headline": "Watch: Pat Cummins collides with Kyle Verreynne before taking a successful reviewWTC Final, Australia vs South Africa: Pat Cummins collided with Kyle Verreynne during a dramatic LBW appeal, but that didn't stop the Australian skipper from going for the DRS — which ultimately resulted in the wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mehidy-hasan-miraz-bangladesh-odi-captain-2739904-2025-06-12",
      "headline": "Mehidy Hasan Miraz named Bangladesh ODI captain for 12 monthsMehidy Hasan Miraz has replaced Najmul Hossain Shanto as Bangladesh's new ODI captain \"for the next 12 months\". Miraz has previously captained Bangladesh in four ODIs in Shanto's absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/matheus-cunha-manchester-united-transfer-dream-move-2739897-2025-06-12",
      "headline": "Matheus Cunha reveals childhood Manchester United dream after big-money transferMatheus Cunha has completed his dream move to Manchester United from Wolves in a £63 million deal. The Brazil forward aims to help United recover after a disappointing Premier League season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-pat-cummins-world-record-five-wicket-haul-lords-2739871-2025-06-12",
      "headline": "Pat Cummins scripts world record, 1st captain to take 5-wicket haul in ICC finalPat Cummins made history by taking a five-wicket haul in the ICC World Test Championship final against South Africa at Lord's. He went past India's Bishan Singh Bedi in an all-time list of captains with most five-fers in Test cricket history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-sa-pacer-david-bedingham-handle-the-ball-controversy-vs-australia-2739839-2025-06-12",
      "headline": "Out or not out? David Bedingham survives the handle-the-ball appeal in WTC finalSouth Africa batter David Bedingham found himself in the middle of a rare on-field controversy during the World Test Championship final against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-test-championship-final-marnus-labuschagne-catch-temba-bavuma-pat-cummins-2739827-2025-06-12",
      "headline": "Watch: Labuschagne's stunning two-handed catch helps Australia remove BavumaWTC final, Australia vs South Africa: Marnus Labuschagne took a blinder of a catch at covers to help remove South Africa's Temba Bavuma just when he looked to attack the Aussie bowlers. South Africa were reeling at 121 for 5 at Lunch on Day 2 in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/radha-yadav-replaces-injured-shuchi-upadhyay-for-upcoming-england-tour-2739803-2025-06-12",
      "headline": "Radha Yadav replaces injured Shuchi Upadhyay in India squad for England tourRadha Yadav comes in as the injury replacement for Shuchi Upadhyay, who was ruled out due to a left shin injury ahead of India Women's upcoming white-ball tour of England. Radha Yadav has not played an international match since December 2024.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-prize-money-increase-highest-singles-payouts-line-judges-removed-2739822-2025-06-12",
      "headline": "Wimbledon prize money increased to record number ahead of 2025 campaignWimbledon has increased its total prize money by 7 percent to a record 53.5 million pounds this year. The tournament will also replace traditional line judges with an electronic system, marking a historic change."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/air-india-ahmedabad-plane-crash-sports-athletes-reaction-2739806-2025-06-12",
      "headline": "Absolutely devastated: Indian sports stars react to Air India plane crash in AhmedabadAn Air India flight from Ahmedabad to London crashed shortly after take-off on Thursday. Indian sports stars, including Virat Kohli, Rohit Sharma and PV Sindhu, reacted to the tragic incident that has left the world in shock. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/radha-yadav-replaces-injured-shuchi-upadhyay-for-upcoming-england-tour-2739803-2025-06-12",
      "headline": "Radha Yadav replaces injured Shuchi Upadhyay in India squad for England tourRadha Yadav comes in as the injury replacement for Shuchi Upadhyay, who was ruled out due to a left shin injury ahead of India Women's upcoming white-ball tour of England. Radha Yadav has not played an international match since December 2024.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-prize-money-increase-highest-singles-payouts-line-judges-removed-2739822-2025-06-12",
      "headline": "Wimbledon prize money increased to record number ahead of 2025 campaignWimbledon has increased its total prize money by 7 percent to a record 53.5 million pounds this year. The tournament will also replace traditional line judges with an electronic system, marking a historic change."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/air-india-ahmedabad-plane-crash-sports-athletes-reaction-2739806-2025-06-12",
      "headline": "Absolutely devastated: Indian sports stars react to Air India plane crash in AhmedabadAn Air India flight from Ahmedabad to London crashed shortly after take-off on Thursday. Indian sports stars, including Virat Kohli, Rohit Sharma and PV Sindhu, reacted to the tragic incident that has left the world in shock. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-needs-time-to-rise-captains-are-not-made-in-1-2-months-harbhajan-singh-2739787-2025-06-12",
      "headline": "Shubman Gill needs time to rise, captains are not made in 1-2 months: Harbhajan SinghFormer India cricketer Harbhajan Singh has backed Shubman Gill to succeed as Test skipper, but said that the youngster will need some time to rise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/poland-manager-michal-probierz-resigns-lewandowski-captaincy-dispute-2739776-2025-06-12",
      "headline": "Poland coach Probierz resigns after Lewandowski captaincy rowPoland manager Michal Probierz resigned on Thursday following a row over his decision to replace the country's record goalscorer Robert Lewandowski as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-steve-smith-embarrassed-after-being-dismissed-by-part-timer-aiden-markram-2739715-2025-06-12",
      "headline": "Steve Smith embarrassed after being dismissed by part-timer Markram in WTC finalSteve Smith was not pleased after his dismissal to Aiden Markram in the first innings of the WTC Final. The Aussie was unable to comprehend how he got out to a part-time bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-2-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2739683-2025-06-12",
      "headline": "AUS vs SA highlights: Australia end Day 2 with 218-run lead at Lord'sAustralia vs South Africa WTC Final 2025 Day 2 highlights: Australia closed the day at 144 for 8, extending their lead to 218 runs in what has been a low-scoring, hard-fought contest. After posting a modest 212 in the first innings—thanks to gritty half-centuries from Beau Webster and Steve Smith—the Australians were bolstered by a superb bowling effort from Pat Cummins, who tore through the South African lineup with figures of 6 for 28, restricting them to just 138. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-kl-rahul-karun-nair-message-bcci-video-2739685-2025-06-12",
      "headline": "Watch: Rahul's heartwarming message to comeback man Nair before England TestsKL Rahul has sent a special message to Karun Nair ahead of his Test comeback after seven years. Karun Nair is expected to play his return game during the first Test between India and England at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-dale-steyn-on-mitchell-starc-2739664-2025-06-12",
      "headline": "Starc's big match temperament in WTC Final leaves Steyn in aweDale Steyn hailed Mitchell Starc's ability to turn up when it matters the most and explained the reason behind the Aussie's success in the big games."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/gael-monfils-hits-back-at-abusive-bettors-after-stuttgart-open-loss-2739661-2025-06-12",
      "headline": "Gael Monfils hits back at angry bettors: We both know I'm s**t, yet you bet on meGael Monfils responded strongly to abusive social media comments following his Stuttgart Open defeat. He condemned racial abuse and urged trolls to keep his family out of their anger."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-marnus-labuschagne-batting-intent-kevin-pietersen-2739625-2025-06-12",
      "headline": "Labuschagne makes Pietersen frustrated: Not there to leave ball all dayKevin Pietersen was left frustrated by Marnus Labuschagne's batting intent on Day 1 of the World Test Championship final between Australia and South Africa on Wednesday, June 11. Labuschagne was timid with his approach and left a lot of deliveries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-gets-called-self-obsessed-for-having-prince-engraving-on-bat-2739602-2025-06-12",
      "headline": "Gill gets called 'self-obsessed' by fans for having 'Prince' engraving on batStar India batter Shubman Gill is being called 'self-obsessed' by fans for having 'Prince' engraved on his bat. Gill is set to use his new bat in the England series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-recalls-rcbs-painful-18-year-wait-for-ipl-trophy-in-emotional-video-2739560-2025-06-12",
      "headline": "AB de Villiers recalls RCB's painful 18-year wait for IPL trophy in emotional videoLegendary South Africa batter AB de Villiers recalled Royal Challengers Bengaluru's (RCB) emotional journey to maiden Indian Premier League (IPL)  triumph in an emotional video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-beau-webster-ricky-ponting-2739547-2025-06-12",
      "headline": "Webster looked completely ready in WTC Final: Ponting praises all-rounderRicky Ponting praised Beau Webster for his vital knock during Day 1 of the World Test Championship final on Wednesday, June 11. Webster top scored for Australia to power them to 212 runs as he saw them through a rough period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-gautam-gambhir-shubman-gill-huddle-talk-squad-2739530-2025-06-12",
      "headline": "Start fighting every ball: Shubman Gill, Gautam Gambhir huddle talk before England TestsIndia coach Gautam Gambhir and captain Shubman Gill inspired the full squad ahead of the England tour with some pep talk. The Indian team is set to embark on a new era under the leadership of Gambhir and Gill in Tests. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}