{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amanta-healthcare-ipo-2025-subscription-status-gmp-review-2779924-2025-09-01",
      "headline": "Amanta Healthcare IPO kicks off with 22% GMP. Should you apply?The IPO will close on September 3, 2025, with the allotment of shares expected on September 4.  The price band for the IPO has been fixed at Rs 120 to Rs 126 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-you-should-never-invest-emergency-funds-in-stocks-mutual-funds-2779909-2025-09-01",
      "headline": "Explained: Why you should never invest emergency funds in stocks, mutual fundsEven disciplined savers can face a harsh reality if emergency funds are illiquid. Safety and immediate access are paramount and returns are secondary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-sbi-card-itr-to-lpg-price-5-big-money-rule-changes-from-september-1-2779884-2025-09-01",
      "headline": "From SBI card, ITR to LPG price: 5 big money rule changes from September 1September kicks off with fresh changes in banking, taxes, and household expenses. From SBI card rules to LPG prices and ITR deadlines, here are the five updates that could directly impact your pocket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/vikran-engineering-ipo-shares-allotment-status-out-gmp-listing-date-market-debut-2779867-2025-09-01",
      "headline": "Vikran Engineering IPO: Check allotment status, GMP and listing dateInvestors who applied for shares can check their allotment status through either the BSE website or the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-china-trade-ties-tianjin-talks-pm-modi-xi-jinping-2779831-2025-09-01",
      "headline": "How India-China trade ties have evolved over the years and why it matters nowTwo decades ago, India-China trade barely existed. In the early 2000s, the numbers were so small they hardly showed up on global trade charts. India exported raw materials like iron ore, while Chinese goods rarely made it into Indian markets. Then came the boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-250-points-nifty-above-24500-infosys-gains-over-15-2779822-2025-09-01",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; Infosys gains over 2%The S&P BSE Sensex was up 368.48 points to 80,178.13, while the NSE Nifty50 added 112.65 points to 24,539.50 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-hridayapoorvam-box-office-day-4-kalyani-priyadarshan-superhero-film-beats-mohanlal-family-drama-2779898-2025-09-01",
      "headline": "Lokah vs Hridayapoorvam box office Day 4: Kalyani's film beats Mohanlal's dramaKalyani Priyadarshan's 'Lokah: Chapter 1', the first female superhero film in India, surpassed the box office numbers of Mohanlal's 'Hridayapoorvam' in theatres. The two films released in theatres on the occasion of Onam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-says-his-family-doesnt-eat-beef-prophet-mohammed-said-its-forbidden-2779896-2025-09-01",
      "headline": "Salim Khan says his family doesn't eat beef: Prophet Mohammed said it's forbiddenSalim Khan's revelation about why his family has never eaten beef has sparked conversations around faith, food, and secularism in Bollywood. The veteran screenwriter not only highlighted Prophet Mohammed's teachings on cow protection but also underlined the Khan family's tradition of celebrating Hindu festivals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-indore-contestant-mimics-amitabh-bachchan-style-opens-up-on-love-life-2779886-2025-09-01",
      "headline": "KBC 17: Indore contestant mimics Amitabh Bachchan's style, opens up on love lifeIn the latest episode of 'Kaun Banega Crorepati 17', an Indore-based contestant spoke about copying Amitabh Bachchan's style. He even opened up about his love life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-episode-highlights-salman-khan-no-elimination-kunickaa-sadanand-2779845-2025-09-01",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: No elimination this week, Kunickaa quits as captainActor Salman Khan provided a reality check to several contestants during the first 'Weekend Ka Vaar' episode of 'Bigg Boss 19'. He also gave all contestants another chance by announcing no eliminations this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-crashes-indian-brides-wedding-in-us-internet-cant-stop-watching-2779866-2025-09-01",
      "headline": "Justin Bieber crashes Indian bride's wedding in US, internet can't stop watchingPop icon Justin Bieber surprised an Indian bride by making an unexpected appearance at her wedding in Los Angeles, creating a viral sensation on social media. A video and several pictures from the bash have since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/guillermo-del-toro-frankenstein-bags-13-min-ovation-cast-get-emotional-oscar-isaac-jacob-elordi-venice-international-film-festival-2025-2779841-2025-09-01",
      "headline": "Frankenstein's team emotional over 13-min standing ovation at Venice Film FestivalFilmmaker Guillermo del Toro's film 'Frankenstein' bagged a 13-minute ovation at the Venice International Film Festival 2025. The film's leads, Oscar Isaac and Jacob Elordi, got emotional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priya-marathe-funeral-marathi-film-industry-prarthana-behere-shalmali-toyle-shalmali-toyle-om-prakash-shinde-astad-kale-suyash-tilak-2779809-2025-09-01",
      "headline": "Prarthana Behere, Shalmali Toyle attend Pavitra Rishta actor Priya Marathe's funeral'Pavitra Rishta' actor Prarthana Behere was seen getting emotional at her co-star Priya Marathe's funeral on Sunday. Other celebrities, including Abhijeet Khandekar, Shalmali Toyle, Om Prakash Shinde, Astad Kale and Suyash Tilak, also paid their last respects.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nikka-zaildar-4-delayed-amid-punjab-floods-ammy-virk-sonam-bajwa-extend-support-2779823-2025-09-01",
      "headline": "Nikka Zaildar 4 delayed amid Punjab floods: Ammy Virk, Sonam Bajwa extend supportAmmy Virk and Sonam Bajwa's upcoming film 'Nikka Zaildar 4' has been postponed due to the Punjab floods. It will not hit the big screens on October 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-his-brother-visit-premanand-maharaj-questions-relationships-viral-video-2779797-2025-09-01",
      "headline": "Badshah visits Premanand Maharaj, rapper's brother asks question about relationshipsRapper Badshah is the latest celebrity to visit Premanand Maharaj in Vrindavan. He paid a visit with his brother, who asked a question about relationships. The rapper is seen patiently listening to the spiritual guru's answer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-back-in-mumbai-atlee-film-grandmother-allu-kanakaratnam-death-2779815-2025-09-01",
      "headline": "Allu Arjun in Mumbai to join Atlee film shoot days after grandmother's deathAllu Arjun returned to Mumbai a day after completing his late grandmother Allu Kanakaratnam's rituals. The 'Pushpa' actor thanked everyone who offered condolences to his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-box-office-sidharth-malhotra-jahnvi-kapoor-film-records-bumper-sunday-2779806-2025-09-01",
      "headline": "Param Sundari box office Day 3: Sidharth, Jahnvi film records bumper SundaySidharth Malhotra and Janhvi Kapoor's 'Param Sundari' earned Rs 10.25 crore on its third day. The film's overall numbers stand at Rs 26.75 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-aaradhya-ganeshotsav-mumbai-traditional-attire-2779776-2025-09-01",
      "headline": "Aishwarya Rai, daughter Aaradhya visit Ganpati pandal to seek blessings. VideoActor Aishwarya Rai and daughter Aaradhya Bachchan visited a Ganpati pandal in Mumbai on Sunday. The duo posed for selfies with fans during their visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-family-ganpati-visarjan-celebration-sisters-ayat-amid-rain-2779773-2025-09-01",
      "headline": "Salman Khan dances with niece Ayat and family at Ganpati Visarjan. Viral videoSalman Khan, on August 31, shared a video of the Ganpati Visarjan celebrations with his family. He was seen dancing with his sister Alvira and niece Ayat amid Mumbai rains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-karnataka-chief-minister-siddaramaiah-mysore-during-peddi-film-shoot-2779680-2025-08-31",
      "headline": "Ram Charan meets Siddaramaiah in Mysore during Peddi shootActor Ram Charan met Karnataka Chief Minister Siddaramaiah in Mysore on Sunday. The photos of their meeting were shared by Siddaramaiah on X. The actor is currently shooting for his upcoming film 'Peddi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/adil-hussain-meets-james-bond-actor-mads-mikkelson-venice-film-festival-praises-humility-2779648-2025-08-31",
      "headline": "Adil Hussain meets James Bond actor Mads Mikkelson in Venice, praises his humilityActor Adil Hussain met Hollywood star Mads Mikkelson at the Venice International Film Festival. The encounter highlights growing global connections in cinema and actor camaraderie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-jitendra-kumar-team-up-upcoming-project-viral-video-2779652-2025-08-31",
      "headline": "Ranbir Kapoor and Jitendra Kumar team up for upcoming project. Video goes viralActors Ranbir Kapoor and Jitendra Kumar are collaborating on an upcoming project. On Sunday, a behind-the-scenes video of the sets surfaced on social media. The video shows both actors dressed in ethnic outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-nargis-fakhri-tony-beig-wedding-viral-video-mumbai-event-2779630-2025-08-31",
      "headline": "Did Farah Khan confirm Nargis Fakhri and Tony Beig's wedding in viral video?Actor Nargis Fakhri made her first appearance with her husband Tony Beig on Sunday. At the event, director Farah Khan referred to Nargis as Tony's wife. The video from the event is now going viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/prem-sagar-ramananad-sagars-son-dies-at-84-arun-govil-sunil-lahiri-mourn-loss-2779619-2025-08-31",
      "headline": "Prem Sagar, Ramananad Sagar's son, dies at 84. Arun Govil, Sunil Lahiri mourn lossIndian film producer and 'Ramayan' director Ramanand Sagar's son Prem Sagar died at the age of 84. Actors Arun Govil and Sunil Lahiri paid their heartfelt tributes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/param-sundari-box-office-collection-sidharth-malhotra-janhvi-kapoor-2779519-2025-08-31",
      "headline": "Param Sundari box office Day 2: Sidharth-Janhvi film sees growth, earns Rs 16 crore'Param Sundari', featuring actors Sidharth Malhotra and Janhvi Kapoor, witnessed decent growth on its second day after a modest box office opening. The film was released on August 29, 2025."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-live-updates-sco-summit-putin-india-china-visit-russia-tianjin-trump-tariffs-2779769-2025-09-01",
      "headline": "Live: PM Modi-Putin bilateral talks begin amid shadow of US tariffsOn Day 2 of his visit, Prime Minister Narendra Modi will hold a bilateral meeting with Russian President Vladimir Putin following the Shanghai Cooperation Organisation (SCO) leaders' meeting in China's Tianjin. The two-day summit, which has drawn over 20 foreign leaders and representatives from 10 international organisations, is focused on tackling security challenges, strengthening financial frameworks, and amplifying the collective voice of Global South nations. PM Modi is also expected to engage with other world leaders on the sidelines of the meet. Stay tuned to IndiaToday.in as we bring you the latest updates on PM Modi's visit to China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ride-or-die-pm-modi-putin-make-a-statement-with-carpool-sco-summit-tianjin-aurus-car-china-india-russia-ties-donald-trump-tariffs-2779910-2025-09-01",
      "headline": "Ride or die: PM Modi, Putin make a statement with carpoolPrime Minister Narendra Modi and Russian President Vladimir Putin shared a ride in an Aurus sedan to their bilateral meeting in Tianjin, with Modi later calling the exchange \"insightful\" in a post on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/at-least-250-killed-400-injured-in-a-60-magnitude-earthquake-in-afghanistan-news-agency-ap-citing-officials-2779877-2025-09-01",
      "headline": "Over 600 killed, 400 injured as strong quake devastates Afghanistan: TalibanAt least 622 people have been killed and 400 injured in the 6.0-magnitude earthquake that hit Afghanistan late Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-in-attendance-pm-modi-questions-certain-nations-support-for-terrorism-in-sco-address-2779837-2025-09-01",
      "headline": "Pak in attendance, PM Modi flags 'certain nations' backing terror at SCO summitAt the SCO Leaders' meeting in China's Tianjin, Prime Minister Narendra Modi warned against double standards on terrorism, citing the recent attack in Jammu and Kashmir's Pahalgam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-pm-modi-putin-xi-jinping-camaraderie-at-sco-summit-tianjin-shehbaz-sharif-left-on-sidelines-2779789-2025-09-01",
      "headline": "Video: PM, Putin, Xi camaraderie at SCO summit; Shehbaz Sharif left on sidelinesPrime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping arrived together at the Shanghai Cooperation Organisation summit in Tianjin, where they were seen shaking hands and sharing a light conversation. At one point, Modi and Putin walked past Shehbaz Sharif as he looked straight ahead, appearing to be on the sidelines of the event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/javed-akhtar-event-kolkata-event-cancelled-mamata-banerjee-west-bengal-urdu-academy-jamiat-ulema-e-hind-wahyahin-2779879-2025-09-01",
      "headline": "Mamata govt bows down to Islamists, Urdu Academy scraps Javed Akhtar eventThe West Bengal government it seems has abjectly surrendered to Islamists. The state government-run Urdu Academy has put off its literary event after the Jamiat Ulema-e-Hind and the Wahyahin Foundation objected to it inviting poet-lyricist Javed Akhtar for a mushaira. They said Akhtar repeatedly \"spoke against religion and God\". The real reason for the event's cancellation was fear of unrest and political fallout ahead of Assembly elections in Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/connectivity-that-bypasses-sovereignty-loses-trust-pm-modis-veiled-swipe-at-china-over-belt-and-road-project-2779850-2025-09-01",
      "headline": "Connectivity that bypasses sovereignty..: PM calls out China's mega road projectAt the SCO summit in Tianjin, Prime Minister Narendra Modi subtly criticised China's Belt and Road Initiative, saying connectivity projects must respect sovereignty or risk losing trust and credibility. Highlighting India's own infrastructure initiatives such as Chabahar Port and the International North-South Transport Corridor, Modi emphasised security, connectivity, and opportunity as the three pillars of India's SCO policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/my-baby-is-back-and-that-real-risk-of-ai-psychosis-mass-hysteria-2779912-2025-09-01",
      "headline": "My Baby Is Back and that real risk of AI psychosis, mass hysteriaCan you get addicted to ChatGPT? In the coming months and years, it is going to be one of the key questions we will have to face as boundaries between human and AI behaviour merge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-crashes-indian-brides-wedding-in-us-internet-cant-stop-watching-2779866-2025-09-01",
      "headline": "Justin Bieber crashes Indian bride's wedding in US, internet can't stop watchingPop icon Justin Bieber surprised an Indian bride by making an unexpected appearance at her wedding in Los Angeles, creating a viral sensation on social media. A video and several pictures from the bash have since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/cannibal-explosion-from-sun-to-hit-earth-today-power-grids-satellites-on-alert-2779918-2025-09-01",
      "headline": "Solar storm coming: Earth to be hit today, satellites in firing rangeThis rare and intense solar event began on August 30, when sunspot region AR 4199 unleashed a long-duration M2.7-class solar flare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/appreciate-india-efforts-resolve-ukraine-crisis-putin-counters-trump-navarro-modis-war-narrative-sco-2779865-2025-09-01",
      "headline": "Putin backs PM's peace efforts on Ukraine, dismisses US's 'Modi's war' narrativePutin countered White House adviser and a top Donald Trump aide Peter Navarro's claim of Ukraine being \"Modi's war,\" instead blaming Nato and \"Western interference\" for the conflict's roots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sco-leaders-strongly-condemn-pahalgam-terror-attack-in-tianjin-declaration-no-mention-of-pakistan-2779873-2025-09-01",
      "headline": "SCO 'strongly condemns' Pahalgam attack in Tianjin declaration, no mention of PakThe Tianjin declaration condemned terrorism in all forms and specifically rejected double standards in countering it, urging nations to adopt a uniform, uncompromising approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/polish-millionaire-identified-as-man-snatched-tennis-star-autographed-hat-child-us-open-video-2779871-2025-09-01",
      "headline": "Polish millionaire identified as man who snatched hat from child at US OpenThe child was left visibly distraught as the millionaire tucked the hat into his wife's bag. A video of the moment has now gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-peter-navarros-another-bizarre-take-on-india-russia-oil-ties-brahmins-profiteering-2779779-2025-09-01",
      "headline": "Brahmins profiteering: Trump aide's another bizarre take on India-Russia oil tiesPeter Navarro sharpened his attack on India, accusing New Delhi of laundering Russian oil, profiteering through Brahmin elites, and destabilising global order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/silent-standoff-pm-modi-shehbaz-sharif-keep-their-distance-at-china-summit-2779777-2025-09-01",
      "headline": "Silent standoff: PM Modi, Shehbaz Sharif keep their distance at China summitPrime Minister Narendra Modi and Pakistan's Shehbaz Sharif kept their distance at the Shanghai Cooperation Organisation summit in Tianjin, with a banquet photo showing them facing away from each other and a family photo placing them far apart. The distancing came against the backdrop of India's Operation Sindoor after April 22 Pahalgam terror attack, underscoring tense ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/president-trump-denies-health-rumours-never-felt-better-2779790-2025-09-01",
      "headline": "Never felt better: Trump hits back amid he is 'dead' buzz onlineDonald Trump was responding to a Truth Social post by American political commentator Rogan O'Handley, who questioned speculation over the US President's health and accused the media of staying silent when \"Joe Biden would go multiple days at a time without any public appearances.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-astronaut-shubhanshu-shuklas-space-training-could-make-your-head-spin-2779890-2025-09-01",
      "headline": "Video: Indian astronaut Shubhanshu Shukla's spinning drill goes viralThe video shows Shukla enduring the rigours of a device designed to recreate the intense and disorienting motions astronauts may encounter in space, particularly in roll, pitch, and yaw axes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/modi-putin-hug-sco-summit-china-visit-trump-tariffs-xi-jinping-india-russia-oil-deal-2779805-2025-09-01",
      "headline": "Always a delight: PM Modi, Putin share a hug at SCO meet; send message to TrumpThe hug comes just hours before their scheduled bilateral meeting on the sidelines of the summit. Officials said the talks would focus on energy ties, defence cooperation, and the evolving global order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dogs-cattle-new-guideline-blood-transfusion-blood-banks-veterinary-care-sop-companion-animals-pets-2777190-2025-09-01",
      "headline": "India has blood banks, transfusion guidelines for your furry friends, cattleIndia has released its first national guidelines for animal blood transfusion, addressing a long-neglected gap in veterinary healthcare. With dogs having 13 blood groups and limited donor awareness, mismatched transfusions have often proved fatal. The new SOPs aim to regulate procedures, boost safety, and improve survival chances for pets and livestock alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-cares-manifesto-bengaluru-stampede-2779874-2025-09-01",
      "headline": "RCB release 6-point manifesto for 'meaningful action' after Bengaluru stampedeRoyal Challengers Bengaluru have released a 6-point manifesto to address the Bengaluru stampede issue. The manifesto aims at providing meaningful action in the aftermath of the tragedy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-miami-leagues-cup-final-luis-suarez-spit-video-2779852-2025-09-01",
      "headline": "Watch: Luis Suarez spits on coaching staff after fight breaks out in Leagues Cup finalLeagues Cup Final: Inter Miami striker Luis Suarez appeared to spit on one of the coaching staff of the opposition team after Inter Miami lost 0-3 to Seattle Sounders in the final of the Leagues Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-molested-robbed-inside-pg-in-suddaguntepalya-accused-masked-man-caught-on-cctv-2779808-2025-09-01",
      "headline": "Sleeping Bengaluru woman molested, robbed inside PG; CCTV shows accused fleeingA woman staying in a paying guest accommodation in Bengaluru was allegedly molested and robbed by an intruder, with CCTV footage showing him fleeing after being chased out by the woman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-family-ganpati-visarjan-celebration-sisters-ayat-amid-rain-2779773-2025-09-01",
      "headline": "Salman Khan dances with niece Ayat and family at Ganpati Visarjan. Viral videoSalman Khan, on August 31, shared a video of the Ganpati Visarjan celebrations with his family. He was seen dancing with his sister Alvira and niece Ayat amid Mumbai rains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mpl-to-fire-60-percent-staff-ceo-says-india-ban-on-paid-online-games-means-zero-revenue-ahead-2779818-2025-09-01",
      "headline": "MPL to fire 60% staff after India ban on paid online gamesIndia's decision to outlaw paid online games has pushed one of the country's biggest gaming companies, Mobile Premier League (MPL), to announce large job cuts. The Bengaluru-based unicorn will let go of nearly 60 per cent of its India staff, or about 300 people. Here is everything you need to know."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-cares-manifesto-bengaluru-stampede-2779874-2025-09-01",
      "headline": "RCB release 6-point manifesto for 'meaningful action' after Bengaluru stampedeRoyal Challengers Bengaluru have released a 6-point manifesto to address the Bengaluru stampede issue. The manifesto aims at providing meaningful action in the aftermath of the tragedy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rahul-dravid-rajasthan-royals-exit-ab-de-villiers-2779868-2025-09-01",
      "headline": "Rahul Dravid was sort of kicked out of Rajasthan Royals job: AB de VilliersIPL 2025: AB de Villiers suggested Rahul Dravid's departure from Rajasthan Royals was owner-driven. The 2008 champions said they parted ways with Dravid after the former India coach refused to accept a broader role in the lead-up to the 2026 auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-miami-leagues-cup-final-luis-suarez-spit-video-2779852-2025-09-01",
      "headline": "Watch: Luis Suarez spits on coaching staff after fight breaks out in Leagues Cup finalLeagues Cup Final: Inter Miami striker Luis Suarez appeared to spit on one of the coaching staff of the opposition team after Inter Miami lost 0-3 to Seattle Sounders in the final of the Leagues Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-vondrousova-us-open-quarter-finals-2024-2779838-2025-09-01",
      "headline": "Aryna Sabalenka eases into quarters, Elena Rybakina stunned in 4th roundUS Open 2025: World No. 1 Aryna Sabalenka will face former Wimbledon champion Marketa Vondrousova in the quarterfinals. Vondrousova outclassed ninth seed Elena Rybakina in the fourth round on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-taylor-townsend-son-2779819-2025-09-01",
      "headline": "Watch: Fiery Taylor Townsend signs off US Open with cutest story about son AJTaylor Townsend capped off her US Open journey with a loss to Barbora Krejcikova in the 4th round of the US Open. After the game, Townsend shared a heartwarming story about her son AJ.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-noivak-djokovic-big-serves-quarterfinal-record-2779796-2025-09-01",
      "headline": "Serve and surge: Novak Djokovic storms into record US Open quarterfinalsNovak Djokovic advanced to the US Open quarter-finals with a dominant straight-sets win over Jan-Lennard Struff. Despite carrying niggles, his serving prowess propelled him into the last eight for the 14th time in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carloz-alcaraz-jannik-sinner-rivalry-2779786-2025-09-01",
      "headline": "Sincaraz rivalry: Spaniard says they are fighting for great things in tennisAfter securing his place in the quarterfinals of the US Open, Carlos Alcaraz opened up on his rivalry with Jannik Sinner. He says that it is important to have high-stakes matches to keep the morale of the sport high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-india-craig-fulton-olympic-gold-world-cup-ambitions-2779766-2025-09-01",
      "headline": "In Craig Fulton we trust: India coach lays out Olympic gold, World Cup ambitionsIndia coach Craig Fulton has seen an overhaul of the system since his appointment in 2023. Despite the recent noise about his position, Fulton has laid out big goals with the Indian team, which include Olympic success and a World Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-trick-shot-2779772-2025-09-01",
      "headline": "Carlos Alcaraz 'playing to the crowd' with outrageous trick shot in US OpenCarlos Alcaraz had the US Open crowd on its feet with a stunning behind-the-back trick shot. After the game, Alcaraz reacted to the viral moment, admitting that he practices those ahead of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-final-2025-match-report-nitish-rana-2779767-2025-09-01",
      "headline": "Captain Nitish Rana powers West Delhi to DPL 2025 titleDPL 2025: West Delhi Lions secured the Delhi Premier League 2025 title by defeating Central Delhi Kings by six wickets. Nitish Rana's unbeaten 79 proved decisive in the final"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-taylor-townsend-heartbreak-barbora-krejcikova-fourth-round-2779759-2025-09-01",
      "headline": "Barbora Krejcikova ends Taylor Townsend's fairytale run to reach US Open quartersBarbora Krejcikova staged a remarkable comeback to defeat Taylor Townsend at the US Open. Her resilience under pressure kept her alive in a thrilling three-set encounter that captivated fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carloz-alcaraz-jannik-sinner-rivalry-2779786-2025-09-01",
      "headline": "Sincaraz rivalry: Spaniard says they are fighting for great things in tennisAfter securing his place in the quarterfinals of the US Open, Carlos Alcaraz opened up on his rivalry with Jannik Sinner. He says that it is important to have high-stakes matches to keep the morale of the sport high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-india-craig-fulton-olympic-gold-world-cup-ambitions-2779766-2025-09-01",
      "headline": "In Craig Fulton we trust: India coach lays out Olympic gold, World Cup ambitionsIndia coach Craig Fulton has seen an overhaul of the system since his appointment in 2023. Despite the recent noise about his position, Fulton has laid out big goals with the Indian team, which include Olympic success and a World Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-trick-shot-2779772-2025-09-01",
      "headline": "Carlos Alcaraz 'playing to the crowd' with outrageous trick shot in US OpenCarlos Alcaraz had the US Open crowd on its feet with a stunning behind-the-back trick shot. After the game, Alcaraz reacted to the viral moment, admitting that he practices those ahead of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-final-2025-match-report-nitish-rana-2779767-2025-09-01",
      "headline": "Captain Nitish Rana powers West Delhi to DPL 2025 titleDPL 2025: West Delhi Lions secured the Delhi Premier League 2025 title by defeating Central Delhi Kings by six wickets. Nitish Rana's unbeaten 79 proved decisive in the final"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-taylor-townsend-heartbreak-barbora-krejcikova-fourth-round-2779759-2025-09-01",
      "headline": "Barbora Krejcikova ends Taylor Townsend's fairytale run to reach US Open quartersBarbora Krejcikova staged a remarkable comeback to defeat Taylor Townsend at the US Open. Her resilience under pressure kept her alive in a thrilling three-set encounter that captivated fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/india-move-closer-to-super-four-with-3-2-win-over-japan-in-asia-cup-2779757-2025-09-01",
      "headline": "India move closer to Super Four with 3-2 win over Japan in Asia CupIndia finds itself on the brink of qualifying for the Super Fours following their win over Japan. China also had a dominant display against Kazakhstan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jiri-lehecka-us-open-quarterfinals-2023-2779755-2025-09-01",
      "headline": "Carlos Alcaraz eases past Rinderknech, Jiri Lehecka into maiden quartersCarlos Alcaraz advanced to the US Open quarterfinals with a commanding win over Arthur Rinderknech. Jiri Lehecka also booked his maiden quarterfinal spot, setting up an exciting clash in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-us-open-behind-the-back-shot-stuns-fans-2779753-2025-09-01",
      "headline": "Watch: Carlos Alcaraz stuns US Open crowd with outrageous behind-the-back trick shotCarlos Alcaraz executed a stunning behind-the-back shot during his US Open fourth-round match against Arthur Rinderknech. The incredible shot electrified the crowd and highlighted Alcaraz's flair as he chases a record Grand Slam quarterfinal achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-u17-womens-saff-championship-bangladesh-loss-crying-unbeaten-run-ends-2779749-2025-09-01",
      "headline": "India U17 Women win SAFF Championship title but tears flow after loss to BangladeshIndia U17 Women crowned SAFF champions despite 4-3 loss to Bangladesh, ending unbeaten run. Anushka Kumari shines as top scorer, Julan leads captaincy, and team now shifts focus to AFC U17 Women's Asian Cup qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-afc-womens-champions-league-group-stage-draw-vs-kitchee-2779748-2025-09-01",
      "headline": "East Bengal qualify for AFC Women's Champions League group-stage with draw vs KitcheeEast Bengal secured a spot in the AFC Women's Champions League group stage after a 1-1 draw with Kitchee SC, with Sangita and Elangbam Panthoi starring, as Hong Kong's side missed a late winner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-shubman-gill-jasprit-bumrah-indian-cricket-team-fitness-test-asia-cup-2779747-2025-09-01",
      "headline": "Rohit Sharma, Shubman Gill, Jasprit Bumrah among Indian players to pass fitness testIndian cricketers including Shubman Gill and Rohit Sharma have successfully cleared the pre-season fitness test at the BCCI Centre of Excellence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/andrey-rublev-us-open-fine-controversy-self-directed-profanity-debate-2779744-2025-08-31",
      "headline": "Andrey Rublev fumes at 3000 US dollars fine: Cannot charge for thisAndrey Rublev was fined 3,000 US dollars at the US Open for using profanity during his match against Coleman Wong. The fine has sparked debate on whether tennis should penalise self-directed outbursts under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-iran-cafa-nations-cup-khalid-jamil-unity-tajikistan-win-2779746-2025-08-31",
      "headline": "Khalid Jamil's India ready for Iran Challenge in CAFA Cup after Tajikistan winIndia head into their crucial CAFA Nations Cup clash against Iran with confidence after a 2-1 win over Tajikistan. Khalid Jamil and key players stress building momentum, unity, and focus as they eye AFC Asian Cup qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-afc-womens-champions-league-group-stage-draw-vs-kitchee-2779748-2025-09-01",
      "headline": "East Bengal qualify for AFC Women's Champions League group-stage with draw vs KitcheeEast Bengal secured a spot in the AFC Women's Champions League group stage after a 1-1 draw with Kitchee SC, with Sangita and Elangbam Panthoi starring, as Hong Kong's side missed a late winner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-shubman-gill-jasprit-bumrah-indian-cricket-team-fitness-test-asia-cup-2779747-2025-09-01",
      "headline": "Rohit Sharma, Shubman Gill, Jasprit Bumrah among Indian players to pass fitness testIndian cricketers including Shubman Gill and Rohit Sharma have successfully cleared the pre-season fitness test at the BCCI Centre of Excellence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/andrey-rublev-us-open-fine-controversy-self-directed-profanity-debate-2779744-2025-08-31",
      "headline": "Andrey Rublev fumes at 3000 US dollars fine: Cannot charge for thisAndrey Rublev was fined 3,000 US dollars at the US Open for using profanity during his match against Coleman Wong. The fine has sparked debate on whether tennis should penalise self-directed outbursts under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-iran-cafa-nations-cup-khalid-jamil-unity-tajikistan-win-2779746-2025-08-31",
      "headline": "Khalid Jamil's India ready for Iran Challenge in CAFA Cup after Tajikistan winIndia head into their crucial CAFA Nations Cup clash against Iran with confidence after a 2-1 win over Tajikistan. Khalid Jamil and key players stress building momentum, unity, and focus as they eye AFC Asian Cup qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-dominik-szoboszlai-freekick-liverpool-beat-arsenal-2779740-2025-08-31",
      "headline": "Dominik Szoboszlai's magical free-kick gives Liverpool 1-0 win vs ArsenalLiverpool secured a narrow 1-0 victory over Arsenal at Anfield thanks to a late free kick from Dominik Szoboszlai. The win boosts Liverpool's title hopes while extending Arsenal's winless run at Anfield beyond a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-us-open-2025-quarterfinals-win-ann-li-2779734-2025-08-31",
      "headline": "Dominant Jessica Pegula makes light work of Ann Li, books quarters berthJessica Pegula advanced to the US Open 2025 women's singles quarterfinals with a dominant win over Ann Li. Last year's runner-up, Pegula, took only 54 minutes to win the match 6-1, 6-2 on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-ends-partnership-coach-gilles-cervara-us-open-2025-exit-2779725-2025-08-31",
      "headline": "Daniil Medvedev parts ways with longtime coach Gilles Cervara after US Open meltdownDaniil Medvedev has ended his long-standing coaching partnership with Gilles Cervara after a challenging year. The split follows poor Grand Slam performances and a controversial meltdown at the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/northern-superchargers-win-hundred-womens-title-beat-southern-brave-2779724-2025-08-31",
      "headline": "Northern Superchargers hammer Southern Brave to claim maiden titleNorthern Superchargers secured their first Hundred Women's title with a commanding seven-wicket win over Southern Brave. In the final, they chased down a target of 116 with 12 balls to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-smackdown-lyon-sami-zyan-us-title-john-cena-logan-paul-2779723-2025-08-31",
      "headline": "SmackDown in Lyon: John Cena confronts Logan Paul, Sami Zayn wins US TitleSmackDown from Lyon set the stage for Clash in Paris, featuring Logan Paul's promo, Sami Zayn winning the US Championship, chaotic tag matches, and rising rivalries, giving fans high-octane WWE action ahead of Sunday's PPV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pathum-nissanka-century-leads-sri-lanka-to-five-wicket-win-over-zimbabwe-2779707-2025-08-31",
      "headline": "Pathum Nissanka 122 powers Sri Lanka to ODI series win in Harare thrillerSL vs ZIM: Pathum Nissanka scored a commanding 122 to lead Sri Lanka to a thrilling five-wicket win over Zimbabwe, securing a 2-0 series whitewash. The visitors chased down 278 in the last over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brighton-defeat-manchester-city-premier-league-erling-haaland-brajan-gruda-pep-guardiola-2779712-2025-08-31",
      "headline": "Brighton stun Manchester City 2-1 to make problems louder for Pep GuardiolaBrighton stunned Manchester City 2-1 at the Amex Stadium, coming from behind for the second consecutive season, as Haaland scored, Milner converted a penalty, and Gruda's late strike exposed Guardiola's defensive concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/dutch-grand-prix-2025-oscar-piastri-lando-norris-crash-ferrari-lewis-hamilton-charles-leclerc-2779699-2025-08-31",
      "headline": "Oscar Piastri wins Dutch GP, Lando Norris crashes out as title hopes take a hitOscar Piastri claimed a controlled victory at the Dutch Grand Prix while teammate Lando Norris retired due to car issues. The race saw Verstappen finish second and young Isack Hadjar achieve his first Formula 1 podium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-ferrari-crash-dutch-grand-prix-2025-2779694-2025-08-31",
      "headline": "Hamilton's woes continue after Dutch GP crash, suffers first Ferrari race retirementLewis Hamilton crashed out of the Dutch Grand Prix while running seventh. This incident deepens Ferrari's ongoing performance challenges in the 2024 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-8-updates-carlos-alcaraz-novak-djokovic-aryna-sabalenka-2779691-2025-08-31",
      "headline": "Day 8 Highlights: Djokovic and Sabalenka into quarters, Rybakina knocked outUS Open 2025 Day 8 Live Updates: Novak Djokovic and Aryna Sabalenka have moved to the quarterfinals of the US Open after comfortable fourth-round victories. Earlier in the day, Taylor Fritz won. Jessica Pegula beat Ann Li to qualify for the quarterfinals. Barbora Krejcikova through to the quarter-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-ayush-badoni-north-zone-central-zone-semi-final-2779687-2025-08-31",
      "headline": "Duleep Trophy: Badoni's unbeaten 204 takes spotlight, North and Central Zones advanceAyush Badoni struck an unbeaten double-century to headline the Duleep Trophy quarter-finals. Both North Zone and Central Zone advanced to the semi-finals after strong performances despite drawn matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-india-world-athletics-championship-team-tokyo-javelin-2779688-2025-08-31",
      "headline": "Neeraj Chopra leads India's 19-member squad for World Athletics ChampionshipsNeeraj Chopra leads a 19-member Indian squad for the World Athletics Championships in Tokyo, aiming for redemption after a narrow Diamond League Final loss, as India sends four men's javelin throwers for the first time."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}