{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extended-for-many-but-not-all-are-you-among-the-exceptions-2732330-2025-05-29",
      "headline": "ITR deadline extended for many, but not all. Are you among the exceptions?While most taxpayers have extra time to file their returns, not everyone's in the safe zone. If audit rules apply to you, your deadline hasn't moved. Does your name fall on the exception list? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-pension-rules-for-psu-employees-key-things-to-know-2732328-2025-05-29",
      "headline": "New pension rules for PSU employees: Key things to knowUnder the newly notified Central Civil Services (Pension) Amendment Rules, 2025, any PSU employee dismissed or removed after absorption due to misconduct could forfeit their PSU-related benefits and pension entitlements earned during their earlier government service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-withdraws-brand-name-of-new-single-malt-whisky-after-objections-2732272-2025-05-29",
      "headline": "Radico Khaitan withdraws brand name of new single-malt whisky after objectionsRadico Khaitan emphasised that the decision was not merely commercial but a mark of respect for public sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-sensex-nifty-set-for-positive-opening-today-2732249-2025-05-29",
      "headline": "Stock Market Today: Sensex, Nifty set for positive opening todayGift Nifty futures were trading at 24,836 as of 8:58 am, indicating a firm start for the Nifty 50, which ended Wednesday at 24,752.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-indusind-bank-irctc-adani-ports-suzlon-in-focus-2732243-2025-05-29",
      "headline": "Stocks to watch today: IndusInd Bank, IRCTC, Adani Ports, Suzlon in focusKeep an eye on IndusInd Bank, Adani Ports, SAIL, IRCTC, and Cummins India today, as earnings, regulatory action, and fundraising updates drive sentiment in the final stretch of May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-late-you-can-earn-33-percent-more-interest-on-tax-refunds-this-year-2731948-2025-05-28",
      "headline": "Filing ITR late? You can earn 33% more interest on tax refunds this yearIf you've paid extra tax via TDS, advance tax, or self-assessment, you're entitled to a refund. As per Section 244A of the Income Tax Act, the department pays 0.5% monthly interest on the excess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-get-debt-free-sooner-5-simple-ways-to-pay-off-your-loan-faster-2731966-2025-05-28",
      "headline": "Want to get debt-free sooner? 5 simple ways to pay off your loan fasterPersonal loans help manage big expenses, but repaying them quickly saves on interest and boosts your credit score.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-higher-msp-14-kharif-crops-2025-26-season-pm-modi-ashwini-vaishnav-2731916-2025-05-28",
      "headline": "MSP boost for farmers as Cabinet clears new rates for Kharif season 2025-26The MSP is the minimum price at which the government promises to buy crops from farmers, even if the market prices are lower. It is set every year for various crops to make sure farmers get a fair price."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-ananya-panday-shoot-for-tu-meri-main-tera-main-tera-tu-meri-video-from-sets-goes-viral-2732332-2025-05-29",
      "headline": "Kartik Aaryan, Ananya Panday shoot for Tu Meri Main…, video from sets goes viralKartik Aaryan and Ananya Panday are currently shooting for their upcoming film 'Tu Meri Main Tera Main Tera Tu Meri'. A video from the sets has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-rajesh-dies-at-75-rajinikanth-close-friend-condolences-2732324-2025-05-29",
      "headline": "Rajinikanth deeply saddened as his close friend and actor Rajesh dies at 75Veteran actor Rajesh died at the age of 75 on Thursday. His close friend and actor Rajinikanth expressed his sadness over his sudden death.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gaddar-film-awards-2025-nag-ashwin-allu-arjun-shreya-ghoshal-win-big-2732321-2025-05-29",
      "headline": "Gaddar Film Awards 2025: Nag Ashwin, Allu Arjun, Shreya Ghoshal win big'Kalki 2898 AD' director Nag Ashwin, along with actors Allu Arjun, Nivetha Thomas and singer Shreya Ghoshal, won the top honours at the Gaddar Film Awards 2025, organised by the Telangana government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-life-gives-you-tangerines-extras-allege-mistreatment-on-set-2732269-2025-05-29",
      "headline": "When Life Gives You Tangerines crew and extras allege mistreatment on setThe makers of 'When Life Gives You Tangerines' are facing backlash after several extras accused them of unacceptable behaviour on set. Reports claim that the production team mistreated background actors. These allegations have sparked concern over working conditions behind the scenes of the popular show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-gazes-lovingly-at-priyanka-chopra-in-romantic-boat-pic-seen-yet-2732297-2025-05-29",
      "headline": "Nick Jonas gazes lovingly at Priyanka Chopra in romantic boat pic. Seen yet?Priyanka Chopra shared a mushy picture with Nick Jonas, and it is all things love. Take a look at their romantic photo here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amid-sandeep-reddy-vanga-row-deepika-padukone-shares-kind-of-people-she-likes-to-collaborate-with-2732284-2025-05-29",
      "headline": "Amid Vanga row, Deepika shares the kind of people she likes to collaborate withDeepika Padukone shared that she likes to work with people who make her feel comfortable. Her statement comes three days after filmmaker Sandeep Reddy Vanga allegedly referred to her as a 'frustrated cat' in a cryptic post about her rumoured exit from 'Spirit'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/global-anime-awards-wave-is-real-india-is-racing-on-2732285-2025-05-29",
      "headline": "Global anime wave is real and India is racing on | Exclusive   Anime has evolved from a niche interest into a vibrant cultural movement in India, embraced by youth and celebrities alike. Streaming platforms and conventions highlight the expanding influence and emotional connection of Indian fans with anime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uvashi-rautela-says-leonardo-dicaprio-called-her-queen-of-cannes-shares-selfie-2732267-2025-05-29",
      "headline": "Urvashi Rautela says Leonardo DiCaprio called her queen of Cannes, shares selfieActor Urvashi Rautela woke up on a Thursday and decided to post a selfie in which she could be seen posing with Hollywood star Leonardo DiCaprio. The actor shared that the 'Titanic' actor called her the 'queen of Cannes'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-all-smiles-lucknow-airport-ipl-qualifier-1-rcb-vs-pbks-2732258-2025-05-29",
      "headline": "Anushka Sharma, Virat Kohli are all smiles at airport ahead of IPL Qualifier 1Anushka Sharma and Virat Kohli were seen smiling at the Lucknow airport a day after RCB's big win. The cricket franchise will now take part in IPL 2025 Qualifier 1 against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-nani-virumaandi-fan-analysis-2732234-2025-05-29",
      "headline": "This is enough, sir: Kamal Haasan's name-drop makes Nani's dayKamal Haasan acknowledged Nani's admiration for his work during an interview. The 'HIT 3' actor was overjoyed as his video caught the attention of his favourite actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-divorce-settlement-angelina-jolie-personal-life-2732225-2025-05-29",
      "headline": "Brad Pitt says settlement with Angelina not a major thing after 8-year battleHollywood actor Brad Pitt broke his silence on his long divorce battle with Angelina Jolie. In an interview, he spoke about how his personal life has always been in the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/billy-williams-acclaimed-gandhi-cinematographer-and-oscar-winner-dies-at-96-glbs-2732217-2025-05-29",
      "headline": "Billy Williams, acclaimed 'Gandhi' cinematographer and Oscar winner, dies at 96Oscar-winning cinematographer Billy Williams, best known for his work on Gandhi (1982), has died at 96, leaving behind a legendary legacy in film and visual storytelling.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddys-ex-girlfriend-cassie-welcomes-third-child-amid-ongoing-sex-trafficking-trial-glbs-2732212-2025-05-29",
      "headline": "Diddy's ex-girlfriend Cassie welcomes third child amid ongoing sex trafficking trialR&B singer Cassie welcomes her third child, a baby boy, just days after testifying against ex-boyfriend Sean \"Diddy\" Combs in a federal sex trafficking case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-brad-pitt-dating-again-all-about-his-stylish-new-girlfriend-glbs-2732201-2025-05-29",
      "headline": "Is Brad Pitt dating again? All about his stylish new girlfriendBrad Pitt opens up about his relationship with Ines de Ramon, reflecting on life under public scrutiny, the end of his divorce from Angelina Jolie, and his upcoming film F1, in a candid GQ Summer Issue interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/childs-play-actor-ed-gale-dies-at-61-glbs-2732194-2025-05-29",
      "headline": "'Child's Play' actor Ed Gale dies at 61Ed Gale, known for portraying Chucky in the original Child's Play films, has died at 61 under hospice care. The actor leaves behind a complex legacy of film roles and controversy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-reacts-to-meme-supporting-deepika-padukone-over-vanga-row-2732064-2025-05-28",
      "headline": "Actor Tamannaah reacts to liking meme supporting Deepika Padukone over Vanga rowActor Tamannaah Bhatia reacted to liking a social media meme backing Deepika Padukone over the recent controversy with filmmaker Sandeep Reddy Vanga. She alleged that it was due to a technical glitch on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zamaana-lage-metro-in-dino-first-song-explores-love-and-loneliness-in-city-2732053-2025-05-28",
      "headline": "Zamaana Lage: Metro In Dino's first song explores love and loneliness in cityThe first song 'Zamaana Lage' from Anurag Basu's film 'Metro…In Dino' has been released, highlighting the emotional struggles of four couples in urban life. Featuring vocals by Arijit Singh and Shashwat Singh with music by Pritam, the track explores themes of love, loss, and loneliness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-season-2-announced-mismatched-to-conclude-with-season-4-2732023-2025-05-28",
      "headline": "Black Warrant Season 2 announced, Mismatched to conclude with Season 4Netflix India announced the second season of 'Black Warrant' and the final season of 'Mismatched' with Season 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nidhi-dutta-ivf-journey-infertility-pregnancy-border-2-2732032-2025-05-28",
      "headline": "Filmmaker Nidhi Dutta on miscarriage, IVF, filming Border 2 during pregnancyFilmmaker Nidhi Dutta shared her four-year IVF journey to normalise infertility in India. Her story highlights the emotional struggles and strength of women facing similar challenges."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/have-better-things-to-do-shashi-tharoor-slams-zealots-after-congress-flak-over-surgical-strike-remark-2732298-2025-05-29",
      "headline": "For those zealots...: Shashi Tharoor's fiery reply on getting flak from CongressShashi Tharoor came under severe criticism from Congress over his remark that India crossed the LoC to carry out surgical strikes 'for the first time' under the Modi government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-administration-us-court-tariffs-india-pakistan-ceasefire-2732263-2025-05-29",
      "headline": "Defending tariffs, Trump team said adverse ruling would risk India-Pak ceasefireThe argument, made last week, failed to convince the Court of International Trade, which blocked Donald Trump's tariffs from going into effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-aide-of-congress-leader-arrested-in-rajasthan-for-allegedly-spying-for-isi-visited-pakistan-6-7-times-2732282-2025-05-29",
      "headline": "Ex-aide of Congress leader held in Rajasthan for 'spying', visited Pak 6–7 timesA Rajasthan government employee, Sakur Khan, was detained for allegedly spying for Pakistan's ISI after intelligence found suspicious links, including visits to Pakistan. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-economy-investment-muhammad-yunus-grameen-bank-tax-exemption-conflict-of-interest-2731970-2025-05-29",
      "headline": "As Yunus fiddles, Bangladesh slides, his Grameen family soarsBangladesh hasn't just seen a rise of Muhammad Yunus, it has seen businesses associated with him switch to top gears. The interim government gave nod to the setting up of Grameen University, allowed Grameen Telecom to operate a mobile wallet, approved manpower export licence for Grameen Employment and reinstated tax-exemption status for Grameen Bank. Though none of the deals are illegal, they have raised a stink, and begs the question -- is Yunus poor Bangladesh's Trump?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/six-hours-that-defied-history-and-death-on-mount-everest-edmund-hillary-tenzing-norgay-2732065-2025-05-29",
      "headline": "Six hours that defied history and death on Mount EverestOn May 29, 1953, Edmund Hillary and Tenzing Norgay created history by summiting Mt Everest, the world's highest peak. On its anniversary, here is an account of the final six hours of humanity's quest for the top of the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-thanks-trump-as-his-time-as-special-government-employee-in-us-presidents-administration-ends-2732215-2025-05-29",
      "headline": "My scheduled time comes to an end: Elon Musk exits Donald Trump's administrationThe billionaire's departure comes one day after he criticised the centerpiece of Trump's legislative agenda, saying he was \"disappointed\" by what the president calls his \"big beautiful bill.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/even-land-of-gandhi-will-not-turn-other-cheek-shashi-tharoor-delegation-panama-op-sindoor-pakistan-warning-2732293-2025-05-29",
      "headline": "Even land of Gandhi won't turn other cheek: Shashi Tharoor's Op Sindoor messageReiterating the country's stance of zero tolerance for terror, Congress leader Shashi Tharoor said India must go after not only the terrorists but also those who enable and support them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-jamal-siddiqui-ram-krishna-muslims-sanatan-dharma-prophet-2732209-2025-05-29",
      "headline": "Sanatan Dharma came before Islam, Muslims descendants of Ram: BJP's Jamal SiddiquiSiddiqui linked Lord Ram and Krishna to Islamic prophethood and said Muslims who do not believe in Ram and Krishna cannot be called Muslims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-4th-largest-economy-is-not-all-cheer-but-it-is-not-a-tragedy-either-2731900-2025-05-28",
      "headline": "Calm down...4th largest economy is not all cheer, but it's not a tragedy eitherWe are still fourth. Not even a podium finish. No medals. A rank which an embarrassed Indian parent would sugarcoat in front of relatives by saying we are in the Top 5 of the class. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-wanted-pause-in-openai-deal-in-middle-east-but-his-efforts-failed-2732283-2025-05-29",
      "headline": "Elon Musk wanted pause in OpenAI deal in Middle East, but his efforts failedElon Musk had reportedly tried to block OpenAI from securing the deal in the Middle East unless his own AI company, xAI, was included. But, he failed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kiren-rijiju-defends-shashi-tharoor-congress-row-over-operation-sindoor-praise-narendra-modi-2732221-2025-05-29",
      "headline": "What does Congress want, Kiren Rijiju backs Shashi Tharoor amid party heatUnion Minister Kiren Rijiju on Wednesday came out in support of Congress MP Shashi Tharoor, questioning the intent of the Congress party after it criticised Tharoor for his remarks praising the Narendra Modi government during an address in Panama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amid-sandeep-reddy-vanga-row-deepika-padukone-shares-kind-of-people-she-likes-to-collaborate-with-2732284-2025-05-29",
      "headline": "Amid Vanga row, Deepika shares the kind of people she likes to collaborate withDeepika Padukone shared that she likes to work with people who make her feel comfortable. Her statement comes three days after filmmaker Sandeep Reddy Vanga allegedly referred to her as a 'frustrated cat' in a cryptic post about her rumoured exit from 'Spirit'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-police-fine-couple-caught-in-car-sunroof-indecent-act-romance-pda-viral-video-2732120-2025-05-28",
      "headline": "Bengaluru couple fined after video of 'indecent act' through car sunroof goes viralA couple in Bengaluru was fined after being filmed engaging in indecent behaviour through a moving car's sunroof. The video, shared online, triggered safety concerns and police action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-4-state-tour-launch-development-projects-in-sikkim-west-bengal-bihar-uttar-pradesh-2732265-2025-05-29",
      "headline": "Act East, Act Fast: PM addresses Sikkim on statehood day, launches infra projectsAddressing the people of Sikkim on the state's golden jubilee via video conferencing, Prime Minister Narendra Modi on Thursday hailed Sikkim's progress over the past 50 years and highlighted his government's contributions to the state's development."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-korea-navy-plane-with-four-people-on-board-crashes-in-mountains-2732322-2025-05-29",
      "headline": "South Korea Navy plane with four people on board crashes in mountainsEmergency workers are currently battling a fire at the crash site, suspected to have been caused by the impact of the plane hitting the ground. Eyewitnesses reported spotting a large plume of smoke rising from the mountains at the crash site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-slouchy-scrolling-breaking-your-back-adult-tummy-time-to-the-rescue-2731810-2025-05-29",
      "headline": "Is mindless scrolling breaking your back? Try 'adult tummy time'Long desk hours, prolonged screen time has definitely locked horns with our backs and necks. Experts weigh in on how the viral 'adult tummy time' may help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-preside-insv-tarini-goa-global-women-led-voyage-mormugao-port-2732266-2025-05-29",
      "headline": "Rajnath Singh to welcome women-led INSV Tarini in Goa today after historic voyageDefence Minister Rajnath Singh will preside over the flag-in of INSV Tarini after its historic eight-month global circumnavigation led by two women officers. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorists-arrested-in-jammu-and-kashmir-shopian-arms-hand-grenades-recovered-army-crpf-2732240-2025-05-29",
      "headline": "2 Lashkar terrorists arrested in J&K's Shopian, arms and grenades recoveredThe operation came as security forces turned the focus of their anti-terror operations to specific areas in south Kashmir after the April 22 attack in Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/nasas-starliner-crew-butch-wilmore-and-sunita-williams-finish-recovery-phase-glbs-2732219-2025-05-29",
      "headline": "Sunita Williams is fully recovered: Starliner crew completes rehabAstronauts Butch Wilmore and Sunita Williams are recovering well after a 9-month ISS mission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uvashi-rautela-says-leonardo-dicaprio-called-her-queen-of-cannes-shares-selfie-2732267-2025-05-29",
      "headline": "Urvashi Rautela says Leonardo DiCaprio called her queen of Cannes, shares selfieActor Urvashi Rautela woke up on a Thursday and decided to post a selfie in which she could be seen posing with Hollywood star Leonardo DiCaprio. The actor shared that the 'Titanic' actor called her the 'queen of Cannes'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-prediction-team-news-match-ups-2732203-2025-05-29",
      "headline": "Qualifier 1 preview: PBKS, RCB chase final spot and a break from heartbreakIPL 2025: Punjab Kings and Royal Challengers Bangalore clash in Qualifier 1, both teams embracing change as they chase their maiden title. While Virat Kohli takes centre stage, this tactical battle between two determined sides promises to ignite the stage in New Chandigarh on Thursday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-car-accident-teen-kills-two-after-hitting-bicycle-with-car-then-crashing-into-slum-2732236-2025-05-29",
      "headline": "Delhi teen kills two after hitting bicycle with car, then crashing into slumAt least two people were killed and three injured after a Swift car, driven by a 19-year-old boy, first hit a cyclist and then crashed into a roadside slum after losing control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-life-gives-you-tangerines-extras-allege-mistreatment-on-set-2732269-2025-05-29",
      "headline": "When Life Gives You Tangerines crew and extras allege mistreatment on setThe makers of 'When Life Gives You Tangerines' are facing backlash after several extras accused them of unacceptable behaviour on set. Reports claim that the production team mistreated background actors. These allegations have sparked concern over working conditions behind the scenes of the popular show. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-playoffs-feature-2732319-2025-05-29",
      "headline": "Can RCB leave the past behind and show consistency in the playoffs? IPL 2025: Royal Challengers Bengaluru have stormed into the playoffs and secured a top-two finish. However, the real test now lies ahead - as the playoffs have always been the stage where their temperament comes under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-rcb-virat-kohlis-playoffs-record-a-worry-for-rcb-2732316-2025-05-29",
      "headline": "Virat Kohli's playoffs record a worry for RCB heading into Qualifier 1Star India and Royal Challengers Bengaluru (RCB) batter Virat Kohli will be eager to end his poor playoffs record as RCB take on Punjab Kings (PBKS) in Qualifier 1 of the Indian Premier League 2025 (IPL 2025). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-virat-kohli-record-2732309-2025-05-29",
      "headline": "Virat Kohli eyes David Warner's all-time record as RCB eye fourth finalIPL 2025: Virat Kohli needs only 31 runs to become the leading run-scorer against the Punjab Kings. The veteran will have a chance to go past David Warner in the Qualifier 1 on Thursday in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2732279-2025-05-29",
      "headline": "Day 5 Order of Play: Djokovic, Sinner, Gauff vye for Round 3 berthsFrench Open 2025, Day 5 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff and other big players will be looking to secure their berths in the third round when they play on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/many-punjabis-dont-support-pbks-and-prefer-other-teams-arshdeep-singh-2732276-2025-05-29",
      "headline": "Many Punjabis don't support PBKS and prefer other teams: Arshdeep SinghIndia and Punjab Kings' (PBKS) seamer Arshdeep Singh has said that PBKS don't get support from Punjab while replying to a fan's comment on Snapchat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-elena-rybakina-frances-tiafoe-holger-rune-2732262-2025-05-29",
      "headline": "Elena Rybakina thumps Iva Jovic, Frances Tiafoe, Holger Rune advanceFrench Open 2025: 12th seed Elena Rybakina beat Iva Jovic 6-3, 6-3, while Frances Tiafoe and Holger Rune also advanced to the third round of the clay-court major. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-recalls-first-meeting-with-ms-dhoni-from-2005-2732253-2025-05-29",
      "headline": "Ravindra Jadeja recalls first meeting with Dhoni: I was hesitant to talk to himStar India all-rounder Ravindra Jadeja recently recalled his first meeting with MS Dhoni from 2005 and revealed how he was hesitant to meet him. Jadeja has played under Dhoni both for India and Chennai Super Kings (CSK). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-shreyas-iyer-qualifier-1-2732239-2025-05-29",
      "headline": "Does captain Shreyas Iyer give Punjab the edge in Qualifier 1Shreyas Iyer has been sensational for PBKS and helped them reach the playoffs of the IPL 2025. Will he be the difference for his side when they go up against RCB in Qualifier 1 on May 29?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-weather-report-mullanpur-pbks-vs-rcb-2732235-2025-05-29",
      "headline": "Qualifier 1 Weather Report: Will rain play spoilsport in Mullanpur?IPL 2025, PBKS vs RCB, Qualifier 1: Let's take a look at the weather conditions in Mullanpur before the all-important clash between Royal Challengers Bengaluru and Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-marco-jansen-arshdeep-singh-qualifier-1-pbks-vs-rcb-2732222-2025-05-29",
      "headline": "No Jansen, no problem? Time for Arshdeep to be Punjab Kings' hero in Qualifier 1IPL 2025, Qualifier 1: With Marco Jansen away on national duty, Arshdeep Singh will have to step up for Punjab Kings in the absence of his bowling partner in Qualifier 1 against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-predicted-xi-2732220-2025-05-29",
      "headline": "PBKS vs RCB IPL 2025 Qualifier 1, Predicted XIs: Will Hazlewood, Chahal return?It's time for the Qualifier 1 of the IPL 2025 campaign with PBKS and RCB locking horns in Mullanpur. With Josh Hazlewood and Yuzvendra Chahal set to return, all eyes will be on the lineups of both teams on Thursday, May 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-recalls-first-meeting-with-ms-dhoni-from-2005-2732253-2025-05-29",
      "headline": "Ravindra Jadeja recalls first meeting with Dhoni: I was hesitant to talk to himStar India all-rounder Ravindra Jadeja recently recalled his first meeting with MS Dhoni from 2005 and revealed how he was hesitant to meet him. Jadeja has played under Dhoni both for India and Chennai Super Kings (CSK). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-shreyas-iyer-qualifier-1-2732239-2025-05-29",
      "headline": "Does captain Shreyas Iyer give Punjab the edge in Qualifier 1Shreyas Iyer has been sensational for PBKS and helped them reach the playoffs of the IPL 2025. Will he be the difference for his side when they go up against RCB in Qualifier 1 on May 29?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-weather-report-mullanpur-pbks-vs-rcb-2732235-2025-05-29",
      "headline": "Qualifier 1 Weather Report: Will rain play spoilsport in Mullanpur?IPL 2025, PBKS vs RCB, Qualifier 1: Let's take a look at the weather conditions in Mullanpur before the all-important clash between Royal Challengers Bengaluru and Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-marco-jansen-arshdeep-singh-qualifier-1-pbks-vs-rcb-2732222-2025-05-29",
      "headline": "No Jansen, no problem? Time for Arshdeep to be Punjab Kings' hero in Qualifier 1IPL 2025, Qualifier 1: With Marco Jansen away on national duty, Arshdeep Singh will have to step up for Punjab Kings in the absence of his bowling partner in Qualifier 1 against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-predicted-xi-2732220-2025-05-29",
      "headline": "PBKS vs RCB IPL 2025 Qualifier 1, Predicted XIs: Will Hazlewood, Chahal return?It's time for the Qualifier 1 of the IPL 2025 campaign with PBKS and RCB locking horns in Mullanpur. With Josh Hazlewood and Yuzvendra Chahal set to return, all eyes will be on the lineups of both teams on Thursday, May 29. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}