{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/heres-a-step-by-step-guide-to-checking-and-updating-kyc-for-mutual-funds-2798640-2025-10-06",
      "headline": "Here's a step-by-step guide to checking and updating KYC for mutual fundsBefore investing in mutual funds, keeping your KYC up to date is essential. Here's a simple step-by-step guide to checking and updating your KYC details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-in-talks-with-insurers-for-climate-linked-insurance-scheme-report-2798572-2025-10-06",
      "headline": "Government in talks with insurers for climate-linked insurance scheme: ReportIndia ranks among the most climate-exposed nations, and to address this, the government has started talks with insurers to build a nationwide climate-linked insurance plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-monday-sensex-nifty-continue-positive-run-banking-it-hospital-shares-2798555-2025-10-06",
      "headline": "Sensex, Nifty continue positive run as banking stocks fuel rallyThe S&P BSE Sensex climbed 582.95 points to settle at 81,790.12, while the NSE Nifty50 advanced 183.40 points to finish above the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-here-is-why-not-every-gift-you-receive-is-tax-free-says-expert-2798498-2025-10-06",
      "headline": "Diwali 2025: Here's why not every gift you receive is tax-free, says expertWhile exchanging gifts is the highlight of Diwali, some presents may surprise you at tax time. Here's what an expert says about taxable gifts this festive season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-pharma-major-eli-lilly-to-invest-1-billion-in-telangana-in-big-boost-to-manufacturing-sector-2798531-2025-10-06",
      "headline": "US pharma major Eli Lilly to invest $1 billion in HyderabadThe company will work with local contract manufacturers and set up a new Manufacturing and Quality hub in Hyderabad to oversee production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-day-1-check-latest-subscription-status-gmp-and-more-2798486-2025-10-06",
      "headline": "Tata Capital IPO: Check latest subscription status, GMP and moreAnalysts have mixed views on the offering. While Tata Capital's strong financials and growth prospects make it appealing for long-term investors, some caution that provisioning for non-performing assets and changes in the company's loan mix may pose risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renault-may-cut-3000-jobs-worldwide-amid-global-market-pressures-report-trump-tariffs-2798478-2025-10-06",
      "headline": "Renault may cut 3,000 jobs worldwide amid global market pressures: ReportFacing slower growth in Europe and increasing competition from rivals, Renault is reportedly planning cuts to its workforce, which could affect around 3,000 employees worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-rises-500-points-dalal-street-rally-key-factors-explained-2798475-2025-10-06",
      "headline": "Sensex jumps over 500 points: Why is the stock market rising today?After a flat opening, the rally on Dalal Street gained momentum as banking, IT, and healthcare stocks led the charge, supported by robust corporate results and steady economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/canara-robeco-ipo-opens-on-october-9-check-price-band-other-key-details-2798448-2025-10-06",
      "headline": "Canara Robeco IPO opens on October 9: Check price band, other key detailsThe Canara Robeco IPO is entirely an Offer for Sale, with 4.98 crore shares being sold at a price band of Rs 253 to Rs 266 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-cyber-insurance-has-become-a-must-have-for-individuals-in-india-2796140-2025-10-06",
      "headline": "Why cyber insurance has become a must-have for individuals in IndiaFrom UPI payments to social media, our lives are increasingly online. With cybercrime on the rise, personal cyber insurance is no longer optional—it's a must-have shield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-all-time-high-can-the-rally-last-btc-prices-cryptocurrency-market-crypto-prices-2798416-2025-10-06",
      "headline": "Bitcoin hits all-time high. Can the rally last?Bitcoin has surged to a new all-time high, crossing $125,000, sparking excitement among investors worldwide. With institutional demand and strong ETF inflows driving the rally, the question remains, can this momentum continue?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-2-benefits-lag-not-passed-on-consumers-localcircles-survey-2798399-2025-10-06",
      "headline": "GST 2.0 cuts aren't reaching most Indian consumers, finds surveyMost Indian consumers are not seeing the benefits of GST 2.0. Despite tax cuts on essentials and aspirational goods, delayed price updates and supply chain gaps keep savings from reaching buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-at-record-high-should-you-buy-now-or-wait-2798335-2025-10-06",
      "headline": "Gold prices at record high. Should you buy now or wait?Gold has hit a fresh record high, leaving buyers unsure whether to make a move now or wait for a price dip. With festive demand and global uncertainty pushing rates up sharply, the big question is — is this the right time to buy?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-gmp-date-review-details-2798256-2025-10-06",
      "headline": "Tata Capital IPO opens: Check GMP, key details, and should you apply or skip?The price band has been set at Rs 310 to Rs 326 per share, with a lot size of 46 shares. This means retail investors need a minimum of Rs 14,260 to participate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/hospital-stocks-rise-after-cghs-rate-revision-should-you-buy-2798235-2025-10-06",
      "headline": "Hospital stocks rise after CGHS rate revision. Should you buy?Hospital stocks are in focus today after the government announced the biggest revision in Central Government Health Scheme package rates in 15 years. The new rates, covering nearly 2,000 medical procedures, will come into effect from October 13, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-sensex-nifty-opening-hospital-shares-2798227-2025-10-06",
      "headline": "Sensex, Nifty see muted start; Tata Capital IPO in focusThe S&P BSE Sensex was up 44.18 points to 81,251.35 around 9:23 am, while the NSE Nifty50 was trading 18.45 points higher at 24,923."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-vs-rd-recurring-deposit-where-should-your-monthly-savings-go-sip-or-rd-which-is-better-2797919-2025-10-05",
      "headline": "SIP vs RD: Where should your monthly savings go?Would you rather sleep peacefully or grow wealthy quietly? That's essentially what the SIP vs RD debate boils down to. Both allow disciplined monthly investing, but one protects capital while the other builds it. So which one deserves your money?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-probes-dark-pattern-after-man-exposes-extra-fees-on-cash-on-delivery-2797655-2025-10-04",
      "headline": "Man flags extra charge on cash-on-delivery payments, Centre launches probeThe Department of Consumer Affairs has launched an investigation into e-commerce sites charging additional fees on cash-on-delivery payments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/akshay-oberoi-sunny-sanskari-ki-tulsi-kumari-always-wanted-to-be-a-dharma-blue-eyed-boy-2798646-2025-10-06",
      "headline": "Akshay Oberoi: Wish I was a Dharma blue-eyed boy | Exclusive Actor Akshay Oberoi shared his experience of working on 'Sunny Sanskari Ki Tulsi Kumari', which was backed by Karan Johar's Dharma Productions. He also shared his wish of being a Dharma blue-eyed boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-the-many-layers-beyond-the-divinity-of-panjurli-and-guliga-2798670-2025-10-06",
      "headline": "Kantara Chapter 1: The many layers beyond the divinity of Panjurli and Guliga While the mystical elements involving the guardian deities Panjurli and Guliga may be the biggest attention grabbers for cine-goers across the country, 'Kantara Chapter 1' has so much more to offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-celebrates-30-years-in-cinema-says-the-fire-still-burns-2798630-2025-10-06",
      "headline": "Bobby Deol celebrates 30 years in cinema, says the fire still burns Bobby Deol has proudly completed thirty years in the film industry, celebrating his journey from his debut in 'Barsaat' to his recent role in Netflix's 'The Ba***ds of Bollywood'. He shared a post on Monday, marking the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-this-week-kurukshetra-swim-to-me-and-more-what-to-watch-where-and-when-2798647-2025-10-06",
      "headline": "OTT this week: Kurukshetra, Swim to Me and more - What to watch, where and when This week, fans will be in for some interesting films and shows releasing on streaming platforms. A glimpse at this week's binge-watching guide, from animation to documentaries to dramas.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-sister-mandhira-alleges-priya-sachdeva-role-breaking-karisma-kapoor-marriage-amid-inheritance-battle-2798626-2025-10-06",
      "headline": "Sunjay Kapur's sister blames Priya Sachdev for his split with Karisma Kapoor Mandhira Kapur Smith claims Priya Sachdev interfered in Sunjay Kapur and Karisma Kapoor's marriage. Allegations arise during an ongoing Rs 30,000 crore inheritance dispute. Priya had previously shared details of her relationship with Sunjay Kapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/malti-chahar-confronts-tanya-mittal-on-bigg-boss-19-asks-about-sarees-baklava-2798613-2025-10-06",
      "headline": "Malti Chahar confronts Tanya Mittal on BB19, asks about sarees, baklava Malti Chahar's bold and straightforward entry as a wild card contestant in Bigg Boss 19 has stirred up the house with sharp exchanges, especially with Tanya Mittal. Her composed yet candid approach is creating a fresh buzz among viewers and housemates alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-fan-daiva-costume-cultural-sensitivity-debate-2798593-2025-10-06",
      "headline": "Internet slams fan's Daiva costume at Kantara show: Not divine, mockery A fan dressed as Daiva during 'Kantara: Chapter 1' screening in Tamil Nadu's Dindigul went viral. Internet users criticised the act as disrespectful to Tulunadu tradition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-joins-the-paradise-nani-telugu-debut-multilingual-film-2026-release-after-aryan-khan-bads-of-bollywood-2798560-2025-10-06",
      "headline": "Raghav Juyal finds The Paradise with Nani after Aryan Khan's Ba***ds of Bollywood Raghav Juyal becomes the latest cast member in 'The Paradise', starring Nani. The film will release in eight languages on March 26, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-the-fate-of-ophelia-music-video-youtube-after-cinema-debut-life-of-a-showgirl-2798553-2025-10-06",
      "headline": "Taylor Swift releases stunning video for new hit The Fate of Ophelia Taylor Swift has unveiled her latest music video 'The Fate of Ophelia' from her new album 'The Life of a Showgirl', blending various eras and iconic styles in a visually captivating narrative. The video premiered exclusively in theatres before its global online release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-team-europe-final-song-sequences-final-song-wrap-filming-2798546-2025-10-06",
      "headline": "Prabhas's The Raja Saab team heads to Europe to film final song, wrap filming 'The Raja Saab', featuring actor Prabhas, has entered the last phase of filming. The team is expected to shoot two key song sequences in Europe before wrapping up the main production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-visits-badrinath-dham-offers-prayers-before-winter-closure-2798548-2025-10-06",
      "headline": "Rajinikanth visits Badrinath Dham, offers prayers ahead of portal closure for winter Actor Rajinikanth visited Badrinath Dham and offered prayers on Monday. The temple committee welcomed him with a prasad and tulsi garland. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/channing-tatum-says-incentivised-to-accept-subpar-productions-for-money-2798539-2025-10-06",
      "headline": "Channing Tatum says actors are incentivised to accept subpar productions for money Actor Channing Tatum openly criticised the current film industry's focus on subpar movies. He stated that streaming services have disrupted Hollywood, creating confusion but also opportunities for change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhruv-vikram-bison-kaalamaadan-first-film-release-october-17-2798519-2025-10-06",
      "headline": "Dhruv Vikram reintroduces himself, says he considers Bison his first film Dhruv Vikram reintroduced himself by calling 'Bison: Kaalamaadan' his first film even though he's two-films old in Tamil cinema. The sports drama directed by Mari Selvaraj releases on October 17 and aims to inspire audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-sharvari-to-star-in-ali-abbas-zafar-romantic-action-drama-2798547-2025-10-06",
      "headline": "Ahaan Panday-Sharvari to star in Ali Abbas Zafar's romantic action drama: Report Sharvari has been cast opposite Ahaan Panday in Ali Abbas Zafar's upcoming untitled action romance, marking the filmmaker's fifth collaboration with Aditya Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-peddi-shoot-delayed-january-2026-detailed-production-2798533-2025-10-06",
      "headline": "Ram Charan's Peddi faces delay, likely to wrap by January 2026 | Exclusive Ram Charan's film 'Peddi' is facing a delay with the shoot extended to January 2026. The film's production and grand sets have pushed the timeline, impacting other projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-adrien-brody-victoria-justice-rashid-khan-at-nba-abu-dhabi-2798511-2025-10-06",
      "headline": "Ranveer Singh shares spotlight with Adrien Brody, Victoria Justice at NBA Abu Dhabi Ranveer Singh made a dazzling appearance courtside at the NBA Pre-Season Game in Abu Dhabi, charming international stars and fans alike with his vibrant energy and stylish look. He was seen posing for pictures with Adrien Brody, Badshah, Rashid Khan and Victoria Justice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-ed-gein-story-x-reviews-charlie-hunnam-crime-show-gets-polarised-reactions-2798516-2025-10-06",
      "headline": "The Ed Gein Story X reviews: Charlie Hunnam's crime show gets polarised reactions Actor Charlie Hunnam's 'Monster: The Ed Gein Story' was released on October 3, 2025. The Netflix series based on America's most notorious criminal opened to mixed reviews from audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-chinai-sexual-harassment-accusation-anu-malik-apology-metoo-support-2798502-2025-10-06",
      "headline": "Alisha Chinai explains why she reunited with Anu Malik after sexual harassment case Singer Alisha Chinai has recalled her 1996 accusation of sexual harassment against Anu Malik and the industry's reaction. She has spoken about her initial isolation in the music industry following her complaint, and revealed why she decided to work with Malik again after he apologised."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-to-vote-on-november-6-11-results-on-14th-2798594-2025-10-06",
      "headline": "Bihar to vote on November 6, 11, results on 14th Live updatesBihar Assembly polls are to be held in two phases on November 6 and 11, and the results will be on November 14, CEC Gyanesh Kumar declared. The term of the 243-member Bihar Assembly will end on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bar-council-suspends-advocate-rakesh-kishore-who-tried-to-attack-chief-justice-br-gavai-from-practice-2798623-2025-10-06",
      "headline": "Supreme Court lawyer suspended for trying to throw shoe at Chief Justice GavaiThe suspension bars the Supreme Court advocate from appearing, acting, pleading or practising in any court, tribunal or authority across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-2025-medicine-award-winners-2798537-2025-10-06",
      "headline": "Nobel in medicine awarded for work on understanding intricacies of immune systemTheir pioneering work on peripheral immune tolerance revealed how a special class of immune cells, known as regulatory T cells, act as guardians against autoimmune disease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-weapons-exceptionally-well-against-india-during-operation-sindoor-pakistan-beijing-made-arms-j-10c-jf-17-fighters-dg-ispr-2798591-2025-10-06",
      "headline": "Chinese weapons did exceptionally well against India during Op Sindoor, claims PakistanDespite evidence that China's PL-15 missiles were shredded, and Indian systems delivered deadly punch, Pakistan's DGISPR Lieutenant General Ahmed Sharif Chaudhry claimed in an interview with Bloomberg that Chinese weapons performed \"exceptionally well\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-do-desi-apps-often-fail-and-what-does-it-say-about-future-of-arattai-2798457-2025-10-06",
      "headline": "Why do Desi apps often fail and what does it say about future of Arattai?Arattai messaging app is all the rage nowadays. It is not the first Indian app that has caught the fancy of social media chatter. And it won't be the last. But like Hike, Koo, and others, this one too will find it difficult to sustain its momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-delivers-first-rare-earth-minerals-shipment-to-us-imran-khan-party-pti-seeks-transparency-pasni-port-trump-munir-2798444-2025-10-06",
      "headline": "Pak ships first batch of rare earths to US, sparks outrage over secret dealsPakistan has dispatched its first shipment of rare earth minerals to the US under a $500-million deal with an American company. The Imran Khan-led PTI has raised concerns over the secrecy of the agreements, demanding full disclosure. Critics fear such deals undermine Pakistan's sovereignty and national interest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mani-meraj-arrested-youtuber-ipl-commentator-and-bhojpuri-actor-arrested-on-rape-forced-religious-conversion-charges-2798629-2025-10-06",
      "headline": "YouTuber, IPL commentator arrested over rape, forced religious conversion chargesPolice investigation revealed that Mani Meraj previously worked as a butcher before gaining popularity on social media through comedy videos, eventually amassing millions of followers. Following his online success, he acted in Bhojpuri films, with one of his movies released recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-told-benjamin-netanyahu-to-take-the-win-on-gaza-plan-says-always-so-fing-negative-2798503-2025-10-06",
      "headline": "Always so f***ing negative: Trump told Netanyahu to 'take the win' on Gaza planBenjamin Netanyahu dismissed Hamas's response to the Gaza peace plan as insignificant. This prompted Donald Trump to snap back and say, \"I don't know why you're always so f***ing negative. This is a win. Take it.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-bigger-games-behind-pakistani-army-chief-field-marshal-asim-munir-pasni-offer-2798454-2025-10-06",
      "headline": "The bigger games behind Munir's Pasni offerIs Asim Munir laying the foundation of a bigger US-funded CPEC passing through Pakistan's southern flanks and into Central Asia?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-chinai-sexual-harassment-accusation-anu-malik-apology-metoo-support-2798502-2025-10-06",
      "headline": "Alisha Chinai explains why she reunited with Anu Malik after sexual harassment caseSinger Alisha Chinai has recalled her 1996 accusation of sexual harassment against Anu Malik and the industry's reaction. She has spoken about her initial isolation in the music industry following her complaint, and revealed why she decided to work with Malik again after he apologised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-atherton-slams-icc-commercialising-india-pakistan-cricket-rivalry-2798529-2025-10-06",
      "headline": "Stop arranging IND vs PAK fixtures, cricket now propaganda tool: Ex-England captainFormer England captain Michael Atherton has argued against 'arranging' for India vs Pakistan fixtures in International Cricket Council tournaments even if they are a cash cow for the global body. In the wake of the Asia Cup tournament, Atheton has argued that the marquee fixture has turned into a tool for political theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-origin-student-grace-omalley-kumar-who-died-nottingham-knife-attack-awarded-uk-bravery-medal-2798689-2025-10-06",
      "headline": "Indian-origin teen who died saving friend in knife attack awarded UK bravery medalGrace O'Malley-Kumar was returning to her University of Nottingham with her friend Barnaby Webber when they were accosted by a knife-wielding man in June 2023. They were both killed in the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-the-many-layers-beyond-the-divinity-of-panjurli-and-guliga-2798670-2025-10-06",
      "headline": "Kantara Chapter 1: The many layers beyond the divinity of Panjurli and GuligaWhile the mystical elements involving the guardian deities Panjurli and Guliga may be the biggest attention grabbers for cine-goers across the country, 'Kantara Chapter 1' has so much more to offer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-bjp-mlas-attacked-shankar-ghosh-khagen-murmu-suvendu-adhikar-slams-tmc-mamata-2798485-2025-10-06",
      "headline": "On camera: BJP MP Khagen Murmu bleeds after locals attack him with stonesBJP MP Khagen Murmu and MLA Shankar Ghosh were attacked by locals in West Bengal's Nagrakata while they were visiting a flood-hit area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-cm-nitish-mumar-gaffe-public-behaviour-joe-biden-patna-assembly-election-tejashwi-yadav-prashant-kishor-2798438-2025-10-06",
      "headline": "Is Nitish Kumar the Sleepy Joe of Bihar?Bihar CM Nitish Kumar, who has, at least for the last two years, shown signs of fatigue and confusion publicly, is facing the Opposition's attacks over his health. RJD leader Tejashwi Yadav and Jan Suraaj's Prashant Kishor's have called him \"clueless and ill\". Will Nitish, who has now been branded the \"Joe Biden of Bihar\" for his gaffes, manage to survive the pre-poll heat and secure a 10th term? Or will he be forced to drop out like Biden?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bjp-leader-annamalai-praises-kantara-chapter-1-for-craftsmanship-cultural-depth-2798450-2025-10-06",
      "headline": "BJP leader Annamalai praises Kantara Chapter 1 for craftsmanship, cultural depthTamil Nadu BJP leader K Annamalai has joined the chorus of praise for Rishab Shetty's 'Kantara: Chapter 1', calling it a powerful blend of faith and folklore that honours tradition and craftsmanship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-fan-daiva-costume-cultural-sensitivity-debate-2798593-2025-10-06",
      "headline": "Internet slams fan's Daiva costume at Kantara show: Not divine, mockeryA fan dressed as Daiva during 'Kantara: Chapter 1' screening in Tamil Nadu's Dindigul went viral. Internet users criticised the act as disrespectful to Tulunadu tradition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-doctor-responsible-top-medical-body-questions-clean-chit-to-cough-syrup-maker-2798456-2025-10-06",
      "headline": "Why is a doctor responsible? Medical body questions clean chit to cough syrup makerThe Indian Medical Association has objected to the arrest of a doctor linked to the ongoing cough syrup controversy, sources said. They have also questioned the reason behind the clean chit given to the alleged cough syrup-making company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/wont-tolerate-insult-to-sanatana-lawyer-attempts-to-throw-shoe-at-chief-justice-gavai-in-courtroom-2798464-2025-10-06",
      "headline": "Doesn't affect me: CJI Gavai rules out action after lawyer tries to throw shoe at himThe police immediately detained the accused lawyer, while Chief Justice Gavai remained composed and continued the proceedings without interruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/meghan-markle-balenciaga-show-paris-fashion-week-diana-2798473-2025-10-06",
      "headline": "Yes, Meghan, now we're talking…Meghan Markle arrived at the Balenciaga show at Paris Fashion Week to support designer Pierpaolo Piccioli on Saturday, and through her dramatic ensemble, she made the world take notice of her once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-polls-date-tejashwi-yadav-nitish-kumar-chief-minister-voters-appeal-2798652-2025-10-06",
      "headline": "Bihar needs CM who is mentally fit: Tejashwi Yadav after poll date announcementIn a long post on X after the announcement of Bihar Assembly polls dates, Tejashwi Yadav said the upcoming election would mark \"the beginning of Bihar's bright future, transformation, development, and rise.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-to-be-first-state-where-evm-ballots-candidate-photos-appear-in-colour-poll-body-chief-2797969-2025-10-05",
      "headline": "17 new reforms to kick off with Bihar polls; to be implemented nationwide laterThe Election Commission has introduced identity cards for booth-level officials, mobile phone deposits outside polling stations, and full webcasting, aiming to make Bihar's Assembly elections more transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/exploring-sex-toys-great-now-lets-talk-about-cleaning-them-2798569-2025-10-06",
      "headline": "Exploring sex toys? Great. Now let's talk about cleaning themWhile the world is using sex toys more enthusiastically (the data speaks for itself), it's equally important to maintain proper hygiene. Neglecting it can lead to infections like UTIs and yeast infections. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-rohit-sharma-2027-world-cup-warning-2798685-2025-10-06",
      "headline": "Rohit Sharma non-committal about World Cup? Expect more bad news then, says Gavaskar Sunil Gavaskar sent a warning to Rohit Sharma and told him to expect more bad news if he remains non-committal about his participation in the 2027 ODI World Cup. Rohit was removed as the captain of the Indian ODI team on October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-australia-2nd-t20i-sells-out-mcg-virat-kohli-rohit-sharma-retirement-2798651-2025-10-06",
      "headline": "No Virat Kohli or Rohit Sharma, but IND vs AUS 2nd T20I at MCG sells out anyway Public tickets for the second T20I between India and Australia at the Melbourne Cricket Ground were sold out more than three weeks before the fixture, underlining the enduring appeal of the contest even without superstars Virat Kohli and Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/yusuf-dikec-turkish-shooter-european-championship-gold-medal-aura-farming-2798649-2025-10-06",
      "headline": "Yusuf Dikec returns with his aura farming: Turkish shooter wins European gold Yusuf Dikec, the popular and viral Turkish shooter, is back in the spotlight with European gold. At 52, his trademark \"aura farming\" style continues to charm fans and deliver results.\f"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-atherton-slams-icc-commercialising-india-pakistan-cricket-rivalry-2798529-2025-10-06",
      "headline": "Stop arranging IND vs PAK fixtures, cricket now propaganda tool: Ex-England captain Former England captain Michael Atherton has argued against 'arranging' for India vs Pakistan fixtures in International Cricket Council tournaments even if they are a cash cow for the global body. In the wake of the Asia Cup tournament, Atheton has argued that the marquee fixture has turned into a tool for political theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-under-pressure-aakash-chopra-womens-world-cup-2025-2798634-2025-10-06",
      "headline": "Harmanpreet Kaur under pressure in what could be her final World Cup: Aakash Chopra Aakash Chopra has claimed that Harmanpreet Kaur will be under pressure after enduring a lean patch in the ongoing Women's World Cup 2025. Harmanpreet has failed to make an impact in the first two matches of the World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sidra-amin-reprimanded-bat-abuse-india-beats-pakistan-icc-womens-world-cup-2025-2798614-2025-10-06",
      "headline": "Pakistan batter reprimanded for breaching ICC Code of Conduct in IND vs PAK clash India defeated Pakistan by 88 runs in the ICC Women's World Cup, while Sidra Amin received a reprimand for equipment abuse during the match. India's win highlights their continuous unbeaten streak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-hero-welcome-cairo-egypt-world-cup-qualifier-djibouti-2798568-2025-10-06",
      "headline": "Watch: Salah gets hero's welcome in Cairo after missing out on Ballon d'Or Mohamed Salah got a hero's welcome in Cairo after missing out on winning the Ballon d'Or this year. Salah finished fourth in the rankings behind Ousmane Dembele, Lamine Yamal and Vitinha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-domestic-cricket-2027-world-cup-iran-pathan-suggests-2798579-2025-10-06",
      "headline": "Rohit Sharma and Virat Kohli need domestic cricket to play 2027 WC: Irfan Pathan Rohit Sharma and Virat Kohli aim for the 2027 ODI World Cup, but match fitness remains their biggest challenge. Irfan Pathan urges domestic cricket to maintain game readiness, keeping hopes alive for fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricketers-join-lanka-premier-league-2023-boost-young-talent-2798543-2025-10-06",
      "headline": "Indian players to feature in sixth edition of Lankan Premier League The Lanka Premier League's sixth edition, beginning December 1, will feature Indian players for the first time, with 24 matches across three venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-crowd-australia-a-match-kanpur-2798532-2025-10-06",
      "headline": "No crowd for Tests, but 24,000 watch India A vs Australia A ODI in Nagpur India A vs Australia A has drawn 24,000 people in Kanpur. In sharp contrast, the Test match between India and West Indies saw barely any crowd in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-batting-concerns-anjum-chopra-warning-after-pakistan-win-womens-world-cup-2798515-2025-10-06",
      "headline": "India urged to fix batting issues after Pakistan win before tougher World Cup games Former India batter Anjum Chopra has called on India to not overvalue their dominant win over Pakistan in the Women's World Cup, warning that unresolved issues, particularly in the batting department, could cost them against stronger teams like South Africa, New Zealand, and Australia. Chopra and skipper Harmanpreet Kaur both highlighted the importance of addressing inconsistencies before facing tougher opponents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-hero-welcome-cairo-egypt-world-cup-qualifier-djibouti-2798568-2025-10-06",
      "headline": "Watch: Salah gets hero's welcome in Cairo after missing out on Ballon d'Or Mohamed Salah got a hero's welcome in Cairo after missing out on winning the Ballon d'Or this year. Salah finished fourth in the rankings behind Ousmane Dembele, Lamine Yamal and Vitinha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-domestic-cricket-2027-world-cup-iran-pathan-suggests-2798579-2025-10-06",
      "headline": "Rohit Sharma and Virat Kohli need domestic cricket to play 2027 WC: Irfan Pathan Rohit Sharma and Virat Kohli aim for the 2027 ODI World Cup, but match fitness remains their biggest challenge. Irfan Pathan urges domestic cricket to maintain game readiness, keeping hopes alive for fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricketers-join-lanka-premier-league-2023-boost-young-talent-2798543-2025-10-06",
      "headline": "Indian players to feature in sixth edition of Lankan Premier League The Lanka Premier League's sixth edition, beginning December 1, will feature Indian players for the first time, with 24 matches across three venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-crowd-australia-a-match-kanpur-2798532-2025-10-06",
      "headline": "No crowd for Tests, but 24,000 watch India A vs Australia A ODI in Nagpur India A vs Australia A has drawn 24,000 people in Kanpur. In sharp contrast, the Test match between India and West Indies saw barely any crowd in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-batting-concerns-anjum-chopra-warning-after-pakistan-win-womens-world-cup-2798515-2025-10-06",
      "headline": "India urged to fix batting issues after Pakistan win before tougher World Cup games Former India batter Anjum Chopra has called on India to not overvalue their dominant win over Pakistan in the Women's World Cup, warning that unresolved issues, particularly in the batting department, could cost them against stronger teams like South Africa, New Zealand, and Australia. Chopra and skipper Harmanpreet Kaur both highlighted the importance of addressing inconsistencies before facing tougher opponents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-new-zealand-live-score-icc-womens-world-cup-updates-indore-2798507-2025-10-06",
      "headline": "NZ vs SA Live: NZ restricted to 231 despite Devine brillianceNew Zealand (NZ) vs South Africa (SA) Women's World Cup Live: New Zealand have been restricted to 231 in the first innings as they fell apart in the death overs. Sophie Devine continued her fine form with 85 runs but the lower-order completely crumbled. South Africa will be happy with their effort and will look to get over the finish line. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-humility-success-cricket-journey-frontline-pacer-india-ipl-2798433-2025-10-06",
      "headline": "I don't like attitude, arrogance: Mohammed Siraj on staying grounded after fameMohammed Siraj reflected on his outlook on life after rising to fame as one of India's premier fast bowlers. The Hyderabad pacer said he has stayed grounded and has not forgotten his humble beginnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-usa-vs-india-gukesh-king-flying-nakamura-disrespect-drama-2798413-2025-10-06",
      "headline": "Hikaru throws away Gukesh's king: Was it drama or disrespect?World No.2 Hikaru Nakamura stoked controversy after beating India's D Gukesh in USA's Checkmate tournament. After his win, Hikaru picked up Gukesh's king and threw it into the crowd. Was it disrespectful, or was the drama done to grab eyeballs?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-match-sevilla-pedri-2798293-2025-10-06",
      "headline": "Barcelona did not know what to do with the ball: Pedri after Sevilla thrashingFC Barcelona fell to their first loss in the LaLiga on Sunday. Sevilla thrashed Barcelona 4-1 to hand them their biggest loss of the season so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captain-2027-world-cup-ms-dhoni-shubman-gill-2798266-2025-10-06",
      "headline": "Path-breaking as captain, Rohit Sharma enters his final act: Can he do a Dhoni?Rohit Sharma's era as India's captain may be over, but his influence is far from finished. As mentor and elder statesman, he can shape the next generation, guide Shubman Gill, and ensure his fearless, path-breaking philosophy endures in the lead-up to the 2027 ODI World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captaincy-monty-panesar-reaction-2798237-2025-10-06",
      "headline": "Wouldn't be surprised if Shubman Gill becomes India's T20I captain too: PanesarFormer England spinner Monty Panesar praised Shubman Gill's appointment as India's next ODI captain and added that he wouldn't be surprised if the star opener were also handed the T20I captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/women-world-cup-pakistan-diana-baig-reaction-muneeba-ali-controversial-run-out-vs-india-2798214-2025-10-06",
      "headline": "Pakistan break silence on Muneeba Ali's controversial run-out vs IndiaPakistan pacer Diana Baig refrained from adding more fuel to the fire over opening batter Muneeba Ali's controversial run-out against India in the sixth match of the Women's World Cup 2025 at the R. Premadasa Stadium in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-record-22-medals-world-para-athletics-championships-navdeep-singh-silver-2798205-2025-10-06",
      "headline": "Navdeep Singh roars as India finish with record medal haul in World Para ChampsOne of India's favourite javelin throwers - Navdeep roared again at the JLN Stadium on Sunday, as the clinched the silver medal in F41 category. With 4 medals on the final day of the competition, India finished with their best ever medal tally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captain-2027-world-cup-ms-dhoni-shubman-gill-2798266-2025-10-06",
      "headline": "Path-breaking as captain, Rohit Sharma enters his final act: Can he do a Dhoni?Rohit Sharma's era as India's captain may be over, but his influence is far from finished. As mentor and elder statesman, he can shape the next generation, guide Shubman Gill, and ensure his fearless, path-breaking philosophy endures in the lead-up to the 2027 ODI World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captaincy-monty-panesar-reaction-2798237-2025-10-06",
      "headline": "Wouldn't be surprised if Shubman Gill becomes India's T20I captain too: PanesarFormer England spinner Monty Panesar praised Shubman Gill's appointment as India's next ODI captain and added that he wouldn't be surprised if the star opener were also handed the T20I captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/women-world-cup-pakistan-diana-baig-reaction-muneeba-ali-controversial-run-out-vs-india-2798214-2025-10-06",
      "headline": "Pakistan break silence on Muneeba Ali's controversial run-out vs IndiaPakistan pacer Diana Baig refrained from adding more fuel to the fire over opening batter Muneeba Ali's controversial run-out against India in the sixth match of the Women's World Cup 2025 at the R. Premadasa Stadium in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-record-22-medals-world-para-athletics-championships-navdeep-singh-silver-2798205-2025-10-06",
      "headline": "Navdeep Singh roars as India finish with record medal haul in World Para ChampsOne of India's favourite javelin throwers - Navdeep roared again at the JLN Stadium on Sunday, as the clinched the silver medal in F41 category. With 4 medals on the final day of the competition, India finished with their best ever medal tally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20i-series-sweep-vs-afghanistan-saif-hassan-sharjah-2798196-2025-10-06",
      "headline": "3rd T20I: Saif Hassan helps Bangladesh complete series sweep over AfghanistanBangladesh completed a commanding 3-0 clean sweep over Afghanistan in the T20I series in Sharjah, successfully executing their chase in all three matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/women-world-cup-kranti-gaud-india-vs-pakistan-controversy-success-mantra-2798188-2025-10-06",
      "headline": "Focus on bowling, not on India-Pakistan talk: Kranti reveals her success mantraIndia's newest pace sensation Kranti Gaud revealed that she remains unfazed by the hype surrounding the India-Pakistan rivalry, saying her focus is solely on her bowling. The young pacer starred with a match-winning spell as India defeated Pakistan by 88 runs in their ICC Women's World Cup clash in Colombo."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-cramps-video-shanghai-masters-2798185-2025-10-06",
      "headline": "Unable to even walk due to cramps, Jannik Sinner retires from Shanghai MastersWorld No.2 Jannik Sinner limped off the court in the third round of the Shanghai Masters. Sinner, facing intense cramps, had to be carried out by his physio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-pakistan-sri-lanka-wins-fielding-errors-drs-mistakes-2798178-2025-10-06",
      "headline": "Women's World Cup: Dodgy India need to tighten up despite dream startIndia are sitting atop the Women's World Cup table, but poor DRS decisions, sloppy catching, and inconsistent batting highlight cracks that could cost them against stronger teams like Australia and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-nz-w-vs-sa-w-sinalo-jafta-press-conference-2798151-2025-10-05",
      "headline": "Can't dwell on one performance, it's a long tournament: Sinalo JaftaSouth Africa wicketkeeper batter Sinalo Jafta said that their team will not dwell too much on the opening match horror against England as they have a long tournament ahead. The Proteas women will next take on New Zealand in their second fixture in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-clinch-series-win-over-australia-a-with-thrilling-two-wicket-chase-2798145-2025-10-05",
      "headline": "IND-A vs AUS-A: Prabhsimran hundred helps India A win 3rd ODI and claim seriesPrabhsimran Singh's blazing hundred and fifties from Shreyas Iyer and Riyan Parag helped India close out a thrilling win against Australia A to win the 3rd ODI and claim the series 2-1 on Sunday, October 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/want-to-win-world-cup-for-pioneers-of-indian-womens-cricket-jemimah-rodrigues-2798150-2025-10-05",
      "headline": "Want to win World Cup for pioneers of Indian women's cricket: Jemimah RodriguesIndia women's cricket team continues their unbeaten streak with a dominant win over Pakistan. The squad aims to honour past pioneers by winning the 2025 Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-kranti-goud-world-cup-heroics-family-led-screen-2798148-2025-10-05",
      "headline": "World Cup: Village watches on giant LED screen as Kranti Goud shines against PakistanKranti Goud was thrilled with her performance against Pakistan and said that her family had installed a big LED screen to watch the game on Sunday, October 5. Goud picked up three wickets to help India beat Pakistan comprehensively. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}