{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-paints-to-acquire-majority-stake-in-akzo-nobel-india-2746932-2025-06-27",
      "headline": "JSW Paints to acquire majority stake in Akzo Nobel IndiaWith this move, JSW Paints will take sole control of Akzo Nobel India, which operates under the Dulux brand, and emerge as the fourth-largest player in the decorative paints segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-140-points-higher-nifty-above-25600-it-stocks-gain-2746923-2025-06-27",
      "headline": "Sensex, Nifty open higher for 4th straight session as global cues aid momentumThe BSE Sensex opened with a gain of over 140 points and was trading 89.06 points higher at 83,844.93 around 9:22 am. The NSE Nifty50 breached the 25,600-mark at the open before paring some gains to trade 25.35 points up at 25,574.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-job-portals-careerbuilder-monster-file-for-bankruptcy-2746877-2025-06-27",
      "headline": "Once-dominant online job boards CareerBuilder, Monster go bankruptCreated through the September merger of CareerBuilder and Monster, the Chicago-based company said it agreed to sell its job board operations, its most recognisable business, to JobGet, which has an app for so-called gig workers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-penalties-missed-refunds-and-what-to-do-next-2746644-2025-06-26",
      "headline": "Filed the wrong ITR form? Penalties, missed refunds and what to do nextWhether you're a salaried professional, freelancer, or a business owner, choosing the right ITR (Income Tax Return) form is important. Getting it wrong might mean missed refunds, penalties, or worse, your return being treated as invalid."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-announces-solo-concert-with-singer-choi-ye-na-details-out-2747129-2025-06-27",
      "headline": "BTS' Jin announces solo concert with singer Choi Ye-na. Here's all about itBTS member Jin is launching his highly anticipated solo fan concert tour. The tour is scheduled to begin in South Korea. Here's everything you need to know about the tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-dropped-from-border-2-amid-row-over-casting-pakistani-actor-hania-amir-in-sardaar-ji-3-sources-2747180-2025-06-27",
      "headline": "Diljit Dosanjh likely to be replaced in Border 2 amid Sardaar Ji 3 row: SourcesActor Diljit Dosanjh is likely to be dropped from 'Border 2' amid row surrounding his Punjabi film 'Sardaar Ji 3'. The film released overseas today (June 27). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/umrao-jaan-director-calls-bhansali-heeramandi-over-the-top-too-palatial-rich-2747118-2025-06-27",
      "headline": "Umrao Jaan director calls Bhansali's Heeramandi over the top: Too palatial and richDirector Muzaffar Ali recently expressed his views on Sanjay Leela Bhansali's show 'Heeramandi'. His classic 'Umrao Jaan' featuring Rekha re-released in theatres on June 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-park-sung-hoon-on-squid-game-3-dealing-with-hate-visiting-india-queen-of-tears-2747164-2025-06-27",
      "headline": "Exclusive: Park Sung-hoon on Squid Game 3, dealing with hate, visiting India | Queen of TearsIn an exclusive conversation with India Today's Bhavna Agarwal, Squid Game 3 star Park Sung-hoon opens up about playing Hyun-ju, a transgender woman with selfless heart in the show, playing villain roles and India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/park-sung-hoon-squid-game-3-hyun-ju-message-for-indian-fans-2747158-2025-06-27",
      "headline": "Exclusive: Park Sung-hoon discusses playing transgender Hyun-ju on Squid Game 3Actor Park Sung-hoon takes on a groundbreaking role as Hyun-ju, a transgender woman, in Squid Game 3. His performance highlights empathy and moral strength amid the series' intense drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-sudhanshu-pandey-slams-ram-kapoor-for-offensive-remarks-apologises-to-women-2747139-2025-06-27",
      "headline": "Actor Sudhanshu Pandey slams Ram Kapoor for offensive remarks, apologises to womenActor Sudhanshu Pandey has openly criticised Ram Kapoor's inappropriate comments made during the 'Mistry' promotional tour. He has also issued a sincere apology to women on behalf of the television industry, highlighting the need for respect and decency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maargan-movie-review-vijay-antony-ambitious-thriller-lacks-nuanced-execution-2747145-2025-06-27",
      "headline": "Maargan review: Vijay Antony's ambitious thriller lacks the punch it promisesReleased-Fri Jun 27, 2025Maargan movie review: Director Leo John Paul's 'Maargan', starring Vijay Antony and Ajay Dhishan, is a convoluted mess of a crime thriller with high ambitions. With a crisp runtime, the whodunnit relies heavily on the twists and turns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-india-release-time-new-cast-details-story-details-of-netflix-out-2747027-2025-06-27",
      "headline": "All you need to know about Squid Game 3: Release time, new cast, and what to expectThe thriller series 'Squid Game 3' has premiered globally on Netflix. The show is expected to release all six episodes at once. Here's all you should know about it before starting to binge-watch.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-review-lee-jung-jae-show-deadly-but-less-thrilling-netflix-2747132-2025-06-27",
      "headline": "Squid Game 3 review: Lee Jung-jae's show is still deadly but less thrillingReleased-Fri Jun 27, 2025'Squid Game 3' review: Lee Jung-jae's 'Squid Game Season 3' released on Netflix today, June 27. The gripping and well-crafted series has its own moments of falter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kannappa-review-prabhas-shines-in-a-legendary-tale-that-misses-its-soul-vishnu-manchu-akshay-kumar-2747097-2025-06-27",
      "headline": "Kannappa review: Prabhas shines in a legendary tale that misses its soulReleased-Fri Jun 27, 2025Kannappa movie review: Starring Vishnu Manchu in the lead, along with extended cameos by Prabhas, Akshay Kumar and Mohanlal, this mythological film banks more on the devotion and star power of the cameos than screenplay, direction and execution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-highly-recommends-marriage-zaheer-iqbal-calls-it-fun-and-amazing-2747116-2025-06-27",
      "headline": "Exclusive: Sonakshi Sinha highly recommends marriage, calls it fun and amazingActor Sonakshi Sinha shared a refreshing take on married life, dispelling myths that it brings drastic changes. In an exclusive interview with us, she emphasised that marriage is far from the negativity often portrayed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-sunjay-kapur-wife-priya-sachdev-talked-about-including-karisma-kapoor-in-family-2747072-2025-06-27",
      "headline": "When Sunjay Kapur's wife Priya talked about including Karisma Kapoor in familyThe late businessman Sunjay Kapur's wife Priya Sachdev spoke about her unusual family dynamics and equation with actor Karisma Kapoor in an earlier interview. She also talked about going on family holidays with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-calls-rekha-her-remaa-in-heartfelt-ode-after-umrao-jaan-screening-2747010-2025-06-27",
      "headline": "Alia Bhatt calls Rekha her ReMaa in heartfelt ode after Umrao Jaan screeningActor Alia Bhatt paid a heartfelt tribute to Rekha at the screening of 'Umrao Jaan' (1981). The former also shared a unique name for the veteran actor in her social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-director-shares-top-gun-3-update-calls-it-tom-cruise-one-last-ride-2746952-2025-06-27",
      "headline": "F1 director shares Top Gun 3 update, calls it Tom Cruise's one last rideDirector Joseph Kosinski confirmed the development of 'Top Gun 3' with a fresh, deeper storyline. He revealed about exploring Maverick's existential crisis and promising one last ride on a much bigger scale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/guru-randhawa-deactivates-x-account-hours-after-his-indirect-dig-at-diljit-dosanjh-2746997-2025-06-27",
      "headline": "Guru Randhawa deactivates X account hours after his indirect dig at Diljit DosanjhSinger Guru Randhawa deactivated his X account on Friday. The move came hours after he took an indirect dig at 'Sardaar Ji 3' actor Diljit Dosanjh for going ahead with the overseas release of the film starring Pakistani actor Hania Aamir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-x-review-prabhas-shines-gripping-second-half-wins-audience-hearts-2747047-2025-06-27",
      "headline": "Kannappa X review: Fans love Prabhas, praise the gripping second halfVishnu Manchu's 'Kannappa' released in theatres on June 27. The film also stars Akshay Kumar, Mohanlal, and Prabhas in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-khan-gets-real-on-parenting-says-her-boys-fuss-when-shes-at-work-praises-saif-2747009-2025-06-27",
      "headline": "Kareena gets real on parenting, says her boys fuss when she's at work, praises SaifKareena Kapoor opened up about the struggles of being a working mother and how Saif Ali Khan supports their children as a hands-on father. She spoke to Vicky Kaushal about the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maa-x-twitter-reviews-fans-call-kajols-film-average-praise-her-acting-and-vfx-2747006-2025-06-27",
      "headline": "Maa X reviews: Fans call Kajol's film average, praise her acting and VFXKajol's 'Maa', a mythological horror film, released in theatres today. The film received mixed reviews, with fans praising her acting and the VFX. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-sreeleela-end-rift-rumours-with-their-appearance-at-event-pushpa-2-2746988-2025-06-27",
      "headline": "Pushpa girls Samantha, Sreeleela end rift rumours with warm hug at event. WatchActors Samantha and Sreeleela put speculations about their rift to rest in their latest public appearance together. Reports emerged in 2024 that claimed Sreeleela had replaced Samantha in a special dance number for 'Pushpa 2'."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gang-rape-case-three-arrested-including-staff-member-2747081-2025-06-27",
      "headline": "Student gangraped in Kolkata law college, Trinamool leader, 2 students arrestedA 24-year-old law college student in south Kolkata was allegedly gangraped inside the campus premises. Three accused have been arrested in the case, including two students and a staffer - who is a Trinamool Congress student wing leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-spurned-marriage-proposal-locked-inside-college-guard-room-and-gang-raped-later-police-2747135-2025-06-27",
      "headline": "Kolkata law student spurned marriage proposal, gang-raped inside guard room: PoliceA 24-year-old student said in her complaint that she was gang-raped inside a Kolkata law college after rejecting a marriage proposal from the main accused. She said the assault was filmed and used to blackmail and threaten her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elderly-woman-tied-men-locked-in-basement-noida-sector-55-old-age-home-raid-reveals-abuse-2747086-2025-06-27",
      "headline": "Urine and faeces on clothes, tied up, locked in rooms: Noida old age home horrorDuring the raid, a woman claiming to be a nurse was found, but investigation revealed she was only 12th-pass. Elderly residents were found in clothes soiled with urine and faeces.The residents were forced to care for themselves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-york-city-zohran-mamdani-gujarat-muslim-narendra-modi-claim-draws-flak-called-out-for-blatant-lies-2747173-2025-06-27",
      "headline": "Zohran Mamdani's Gujarat Muslim claim draws flak, called out for 'blatant lies'It was Zohran Mamdani's claim that only a few Muslims remain in Gujarat that drew criticism from several quarters, including Opposition leaders in India, who were quick to fact-check the far-left figure. Many cited the last published census data of Gujarat, according to which Muslims made up at least 10 percent of the state's population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-dropped-from-border-2-amid-row-over-casting-pakistani-actor-hania-amir-in-sardaar-ji-3-sources-2747180-2025-06-27",
      "headline": "Diljit Dosanjh likely to be replaced in Border 2 amid Sardaar Ji 3 row: SourcesActor Diljit Dosanjh is likely to be replaced by Ammy Virk in 'Border 2'. This comes amid row surrounding his Punjabi film 'Sardaar Ji 3'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/justice-will-be-served-trinamool-as-its-student-leader-2-students-arrested-for-gang-rape-of-law-student-2747174-2025-06-27",
      "headline": "Justice will be served: Trinamool as its student leader arrested for gang-rapeAfter a leader of its student wing was named main accused in a gang-rape of a 24-year-old law college student, Trinamool Congress said that the full weight of the law will be brought to bear on the perpetrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shubhanshu-shukla-international-space-station-iss-india-view-from-space-rakesh-sharma-first-indian-2746977-2025-06-27",
      "headline": "From Sharma to Shukla, night lights reveal India's transformation over the yearsIf Rakesh Sharma, the first Indian to fly to space in 1984, were to travel to space once again, the view of India's night-time lights would leave him transfixed. Night-time lights as seen from space indicate economic progress and urbanisation. This is how the look of India has changed from Sharma to Shubhanshu Shukla in 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/faridabad-murder-casewoman-killed-after-alleged-rape-by-father-in-law-2747130-2025-06-27",
      "headline": "Faridabad murder: Woman was killed after rape by father-in-law, probe findsTannu, a 24-year-old woman, was raped by her father-in-law and later murdered, police investigation revealed"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-review-lee-jung-jae-show-deadly-but-less-thrilling-netflix-2747132-2025-06-27",
      "headline": "Squid Game 3 review: Lee Jung-jae's show is still deadly but less thrillingReleased-Fri Jun 27, 2025'Squid Game 3' review: Lee Jung-jae's 'Squid Game Season 3' released on Netflix today, June 27. The gripping and well-crafted series has its own moments of falter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/politics-and-history-of-inclusion-of-socialist-and-secular-in-the-preamble-the-lowdown-2747095-2025-06-27",
      "headline": "Politics and history of inclusion of 'socialist' and 'secular' in the PreambleThe terms were added during a period of quasi-dictatorship, when the government's word was the law. Critics argue they were imposed without proper debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-rejects-united-nations-help-air-india-crash-probe-2746864-2025-06-27",
      "headline": "India rejects UN help in Air India crash probe: ReportIndia declined a UN aviation investigator's offer to assist in the Air India crash probe that killed 274. Previously, the International Civil Aviation Organisation has deployed investigators to help with certain probe\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/south-africa-country-junked-nuclear-weapons-helped-non-proliferation-treaty-ben-gurion-nehru-golda-meir-iran-2746849-2025-06-27",
      "headline": "How a country that helped Israel get nuclear weapons junked its own nukesIsrael, the only undeclared nuclear power, started work on its N-weapons programme within years of the founding of the Jewish nation. One of its clandestine partners was apartheid-era South Africa. While Israel is said to be in possession of 90 warheads now, South Africa signed the NPT and junked its nukes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/british-f35-jet-stranded-thiruvananthapuram-airport-repair-40-member-team-uk-tow-vehicle-airlift-repair-2746623-2025-06-27",
      "headline": "Tow trolley, 40 staffers from UK as F-35 refuses to leave Kerala even after 13 daysBraving rain on Thiruvananthapuram airport's tarmac, the British $110-million stealth F-35B jet remains grounded in Kerala, now to be towed into a hangar for repairs. A special tow vehicle and 40 UK engineers are flying in to fix the hydraulic snag that's kept the F-35B earthbound since June 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/we-take-pride-in-being-like-our-mothers-but-some-legacies-need-letting-go-2746995-2025-06-27",
      "headline": "We take pride in being like our mothers, but some legacies need letting goFor most of us, the bond we share with our mothers is one of the most cherished. Perhaps that's why we tend to follow them so instinctively. But while their intentions are rarely harmful, many of the legacies they leave behind are unconsciously ingrained, and some of them, though well-meaning, need to be questioned and gently let go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-us-30-billion-investment-help-non-enrichment-civilian-nuclear-programme-donald-trump-war-2747008-2025-06-27",
      "headline": "$30 billion for civil nuclear programme: Report details US proposal for Iran dealAmerica is considering helping Iran access USD 30 billion to build a civilian-energy-producing nuclear programme, in a surprising twist in the diplomatic ties between the two nations, CNN reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/thin-at-what-cost-the-mental-toll-of-the-weight-loss-race-wegovy-ozempic-weight-loss-2747147-2025-06-27",
      "headline": "Thin at what cost? The mental toll of the weight-loss raceThe quest for weight loss has taken a dramatic turn. A wave of new-age solutions, from once-weekly injectables like Wegovy and Mounjaro to oral GLP-1 drugs and off-label prescriptions, has flooded global markets, including India. But as our bodies shrink, our minds may be buckling under pressure…"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/ahmedabad/video/video-elephant-loses-control-triggers-panic-during-rath-yatra-in-ahmedabad-2746967-2025-06-27",
      "headline": "Video: Elephant loses control, triggers panic during Rath Yatra in AhmedabadDuring the 148th Rath Yatra of Lord Jagannath in Ahmedabad, an elephant lost control in the Khadia area, causing panic. The animal lost balance but was soon brought under control with the help of doctors and the forest department. Prompt action by police to clear the area ensured no casualties occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maa-movie-review-kajol-salvages-striking-but-familiar-myth-meets-fantasy-horror-2746906-2025-06-27",
      "headline": "Maa review: Kajol salvages striking but familiar myth-meets-fantasy horrorReleased-Fri Jun 27, 2025'Maa' movie review: 'Maa' features Kajol as a mother battling dark mythological forces in a visually rich horror setting. Despite impressive effects, the film struggles with predictable storytelling and emotional impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gangster-jaggu-bhagwanpurias-mother-shot-dead-rival-group-claims-responsibility-2746935-2025-06-27",
      "headline": "Caught on camera: Gangster Jaggu Bhagwanpuria's mother shot dead in PunjabThe attack occurred near a bakery on Kadian Road in Punjab, where unidentified assailants on a motorcycle opened fire on the Scorpio car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/channapatna-barbies-and-now-labubu-what-our-dolls-say-about-us-2747166-2025-06-27",
      "headline": "Channapatna, barbies and now labubu: What our dolls say about usThey once wore hand-stitched sarees and sipped imaginary chai—now they wear skull hoodies and go viral on TikTok. This is the strange, sentimental journey of our dolls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/delhi-swelters-in-unexpected-humidity-where-are-the-monsoon-rains-2747074-2025-06-27",
      "headline": "Delhi swelters in unexpected humidity: Where are the monsoon rains?The humidity impedes the body's natural cooling through sweat evaporation, making conditions dangerously uncomfortable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/chennai-man-shares-landlord-veg-only-tenants-demand-viral-post-sparks-debate-2747124-2025-06-27",
      "headline": "Chennai man shares landlord's 'veg-only tenants' demand, post sparks debateIn a now-viral post on X, a man searching for flats in Chennai sparked a debate on food-based housing bias after sharing a message he received online."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-neeraj-chopra-nc-classic-fan-request-vvip-experience-bengaluru-2747183-2025-06-27",
      "headline": "Fan asks Rs 2000 to watch NC Classic, Neeraj Chopra offers him VVIP experienceNeeraj Chopra, in a heartwarming gesture, offered a fan full VVIP experience for the upcoming NC Classic in Bengaluru, scheduled to be held on July 5. Neeraj is set to host the event, which will feature some of javelin's finest stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-cricketer-accused-sexual-harassment-rape-guyana-investigation-2747163-2025-06-27",
      "headline": "West Indies cricketer accused of sexual assault, victims allege cover-up: ReportAt least eleven women, including a teenager, have accused a West Indies cricketer of sexual harassment. The player, who is from Guyana, is at the centre of allegations that local authorities have attempted to cover up, according to media reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-women-2025-full-squads-streaming-all-you-need-to-know-2747104-2025-06-27",
      "headline": "ENG vs IND Women's ODI and T20I Live Streaming: All you need to knowEngland vs India Women's ODI, T2OI series 2025 Live Streaming: England will host the Indian women's team for five T20Is and three ODIs. With the ODI World Cup fast approaching, both teams will aim to put their best foot forward and fine-tune their combinations across the series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-clarke-urges-kuldeep-yadav-india-test-series-england-2747134-2025-06-27",
      "headline": "India have to play Kuldeep Yadav to win in England: Michael ClarkeEngland vs India: Former Australia captain Michael Clarke has advised Gautam Gambhir and Shubman Gill to pick Kuldeep Yadav for the remaining Test matches, calling the decision an absolute 'no-brainer.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mixed-disability-cricket-match-lords-london-2747079-2025-06-27",
      "headline": "India win first-ever Mixed Disability match at Lord's, beat hosts EnglandAfter losing the first two matches of the Mixed Disability T20I series, India bounced back to beat England in a historic occasion at Lord's on Wednesday. The fourth match of the seven-match series will be played on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/freestyle-chess-tours-india-cancelled-sponsors-delhi-2746980-2025-06-27",
      "headline": "Freestyle Chess Tour's India-leg cancelled due to lack of sponsorsThe Freestyle Chess Tour's fifth edition that was to be held in Delhi now stands cancelled due to the lack of interest from sponsors. Now the tournament will likely resume with the next edition in Las Vegas later next month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-psg-moral-harrasment-legal-complaint-2747004-2025-06-27",
      "headline": "Mbappe accuses PSG of 'moral harassment, files legal complaint vs ex-clubDespite having made the move to the club of his dreams, Real Madrid, Kylian Mbappe is still at odds with his former club, Paris Saint-Germain, with the French striker accusing the reigning Champions League winners of 'moral harassment'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/avinash-sable-injury-comeback-personal-best-world-athletics-championships-2025-2746969-2025-06-27",
      "headline": "Avinash Sable eyes personal best and World Championship redemptionAvinash Sable has recovered from a year-long injury and is preparing for the World Athletics Championships. His focus is on improving his personal best and making a strong comeback on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-sammy-clarity-adrian-holdstock-contentious-calls-bridgetown-test-wi-vs-aus-2746955-2025-06-27",
      "headline": "WI vs AUS: Coach Sammy meets referee Srinath over contentious TV umpiring decisionsWest Indies coach Darren Sammy spoke with match referee Javagal Srinath to express his apprehensions about Adrian Holdstock officiating in the ongoing Test series against Australia. The West Indies head coach had also raised similar concerns during the series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-t20i-squad-adam-milne-bevon-jacobs-announce-tri-series-zimbabwe-2746948-2025-06-27",
      "headline": "No Williamson; Milne, Henry return as New Zealand announce tri-series squadNew Zealand have named Adam Milne and uncapped Bevon Jacobs in their T20I squad for next month's tri-series in Zimbabwe, but will be without Kane Williamson and Lockie Ferguson as new head coach Rob Walter begins preparations for the 2026 T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/european-teams-usa-weather-fifa-club-world-cup-heat-pitch-conditions-2746925-2025-06-27",
      "headline": "European teams vs USA weather: FIFA Club World Cup is facing the heatSoaring heat and poor pitches at the 2025 Club World Cup in the U.S. left European teams struggling, raising serious concerns for FIFA ahead of next year's expanded World Cup across North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-psg-moral-harrasment-legal-complaint-2747004-2025-06-27",
      "headline": "Mbappe accuses PSG of 'moral harassment, files legal complaint vs ex-clubDespite having made the move to the club of his dreams, Real Madrid, Kylian Mbappe is still at odds with his former club, Paris Saint-Germain, with the French striker accusing the reigning Champions League winners of 'moral harassment'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/avinash-sable-injury-comeback-personal-best-world-athletics-championships-2025-2746969-2025-06-27",
      "headline": "Avinash Sable eyes personal best and World Championship redemptionAvinash Sable has recovered from a year-long injury and is preparing for the World Athletics Championships. His focus is on improving his personal best and making a strong comeback on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-sammy-clarity-adrian-holdstock-contentious-calls-bridgetown-test-wi-vs-aus-2746955-2025-06-27",
      "headline": "WI vs AUS: Coach Sammy meets referee Srinath over contentious TV umpiring decisionsWest Indies coach Darren Sammy spoke with match referee Javagal Srinath to express his apprehensions about Adrian Holdstock officiating in the ongoing Test series against Australia. The West Indies head coach had also raised similar concerns during the series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-t20i-squad-adam-milne-bevon-jacobs-announce-tri-series-zimbabwe-2746948-2025-06-27",
      "headline": "No Williamson; Milne, Henry return as New Zealand announce tri-series squadNew Zealand have named Adam Milne and uncapped Bevon Jacobs in their T20I squad for next month's tri-series in Zimbabwe, but will be without Kane Williamson and Lockie Ferguson as new head coach Rob Walter begins preparations for the 2026 T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/european-teams-usa-weather-fifa-club-world-cup-heat-pitch-conditions-2746925-2025-06-27",
      "headline": "European teams vs USA weather: FIFA Club World Cup is facing the heatSoaring heat and poor pitches at the 2025 Club World Cup in the U.S. left European teams struggling, raising serious concerns for FIFA ahead of next year's expanded World Cup across North America."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}