{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akriti-chopra-zomato-co-founder-and-chief-people-officer-resigns-2607590-2024-09-27",
      "headline": "Akriti Chopra, Zomato co-founder and Chief People's Officer, resignsIn an email to Zomato CEO Deepinder Goyal, Akriti Chopra announced her decision to resign with immediate effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-draft-paper-drhp-sebi-rs-10000-crore-ofs-promoters-zomato-2607407-2024-09-27",
      "headline": "Swiggy files for Rs 10,000 crore IPO: Here's all you need to knowSwiggy's IPO will consist of two main parts: a fresh issue of equity shares worth Rs 3,750 crore, and an offer for sale (OFS) of 18.52 crore shares by existing stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-once-had-a-rs-10000-note-rbi-1938-know-why-it-was-discontinued-2607398-2024-09-27",
      "headline": "India once had a Rs 10,000 note. Know why it was discontinuedThe history of India's Rs 10,000 note dates back to the pre-independence era. In 1938, the Reserve Bank of India (RBI) issued its first Rs 10,000 note, the largest denomination ever printed in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-check-latest-gmp-subscription-status-allotment-expected-listing-gain-2607230-2024-09-27",
      "headline": "KRN Heat Exchanger IPO: Check latest GMP, subscription status, other detailsKRN Heat Exchanger opened for subscription on September 25 looking to raise Rs 341.95 crore from its public issue, and has already seen bids of over 80 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-wipro-it-stocks-rally-4-percent-accenture-fy25-guidance-boost-2607196-2024-09-27",
      "headline": "Accenture guidance boost lifts Infosys, Wipro; IT stocks rally up to 4%Accenture not only exceeded market expectations for its Q4 results but also raised its revenue guidance for FY25 to a range of 3-6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-record-high-for-6th-straight-session-2607157-2024-09-27",
      "headline": "Sensex, Nifty hit record high for 6th straight sessionThe S&P BSE Sensex added 67.47 points to 85,903.59, while the NSE Nifty50 gained 14.70 points to 26,230.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-shares-cross-rs-500-mark-after-gaining-5-more-gains-ahead-2606881-2024-09-26",
      "headline": "Vedanta shares cross Rs 500 mark after gaining 5%. More gains ahead?Vedanta's performance in 2024 has been impressive, with the stock climbing 95% so far this year and gaining 124.35% over the last 12 months. Over a five-year period, the stock has risen by 202%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-all-time-high-market-rally-metal-auto-stocks-2606880-2024-09-26",
      "headline": "Sensex, Nifty close at all-time high led by rally in auto and metal stocksThe S&P BSE Sensex added 666.25 points to end at 85,836.12, while the NSE Nifty50 gained 211.90 points to close at 26,216.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-steel-share-price-gains-five-session-expert-views-buy-hold-or-sell-2606867-2024-09-26",
      "headline": "Tata Steel shares gain for 5th straight session. What should investors do?In the past year, Tata Steel has rallied 28%, with an 18% gain so far in 2024."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-chief-hassan-nasrallah-killed-in-airstrike-in-beirut-says-israeli-military-2607870-2024-09-28",
      "headline": "Hezbollah chief Hassan Nasrallah killed in Beirut airstrike, says Israel Live UpdatesHassan Nasrallah, the elusive and secretive Hezbollah chief, was killed in the massive airstrike in Beirut targeting the Hezbollah headquarters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hussain-nasrallah-hezbollah-headquarter-phantom-death-israeli-bombing-lebanon-beirut-history-2607731-2024-09-28",
      "headline": "Hassan Nasrallah: Vegetable vendor's son who became Israel's mortal enemyRarely seen in public, Hassan Nasrallah was like a phantom who turned Hezbollah into a powerful military and political organisation. Israel targeted him by bombing Hezbollah's headquarters in Beirut. This is how the son of a vegetable vendor became a hero in the Arab world, and how he got marked for death.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorism-will-inevitably-invite-consequences-india-blasts-pakistan-at-un-2607758-2024-09-28",
      "headline": "Terrorism will inevitably invite consequences: India blasts Pakistan at UNExercising its right of reply, India sharply criticised Pakistani Prime Minister Shehbaz Sharif's address at the UN General Assembly, calling his comments on the Kashmir issue a \"travesty.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/nirmala-sitharaman-case-extortion-electoral-bonds-siddaramaiah-congress-bjp-karnataka-bengaluru-court-2607770-2024-09-28",
      "headline": "Case against Nirmala Sitharaman over 'extortion' through electoral bonds A complaint against Nirmala Sitharaman and others was filed by one Adarsh Iyer from the Janaadhikara Sangharsha Sanghatane, alleging that extortion was carried out through electoral bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/censorship-on-ott-curbing-creativity-or-supporting-sensitivity-celebs-discuss-2607753-2024-09-28",
      "headline": "Censorship on OTT: Curbing creativity or supporting sensitivity? Celebs discussWith so much available to watch online, are we fine with the idea of absolute freedom or do we need a body to regulate the content and tell us what is right for us to watch? India Today digital spoke to celebs across the film industry to understand the idea of having censorship on OTT platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hassan-nasrallah-daughter-zainab-killed-israel-beirut-airstrike-report-2607836-2024-09-28",
      "headline": "Hezbollah chief Hassan Nasrallah's daughter killed in Beirut airstrike: ReportIsrael-Hezbollah war: There has been no official confirmation either by Israel or Lebanon of the death of Zainab Nasrallah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/china-human-poop-excreta-fountain-sewage-pipe-blast-video-2607800-2024-09-28",
      "headline": "Sh*t storm: China pipe blast shoots poop 33 feet into air, drenches commutersVisuals splashed across social media showed a fountain of human excreta shooting into the air before splatting the window shields of cars in China's Nanning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-pm-benjamin-netanyahu-united-nations-two-maps-blessing-curse-2607771-2024-09-28",
      "headline": "At UN, Israeli PM shows 2 maps. India shown as 'The Blessing', Iran 'The Curse'Both the maps displayed by Israeli Prime Minister Benjamin Netanyahu showed Palestinian territories – the West Bank and Gaza -- as part of Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/is-it-better-to-be-overdressed-or-underdressed-2607220-2024-09-28",
      "headline": "Is it better to be overdressed or underdressed? While glamming up, we often face a familiar dilemma: should we go all out and dazzle, or play it cool and understated? Let's find out from experts whether it's better to be overdressed or underdressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/kingmakers-in-2024-congress-prospects-in-haryana-assembly-elections-bjp-aap-arvind-kejriwal-2607861-2024-09-28",
      "headline": "Kingmakers in 2024: Can 'Others' damage Congress prospects in Haryana?In 2009 and 2019, Haryana's voters gave marginally fractured mandates, with the Congress and the BJP winning 40 seats each respectively, the halfway mark being 46. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-crew-9-rescue-mission-to-launch-tonight-nasa-green-lights-crew-9-2607848-2024-09-28",
      "headline": "Crew-9: Sunita Williams rescue mission to launch tonightOriginally scheduled for September 26, the launch was postponed due to adverse weather conditions caused by Hurricane Helene impacting the Gulf Coast of Florida. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-on-hezbollah-sayyed-hassan-nasrallah-lebanon-beirut-benjamin-netanyahu-2607687-2024-09-27",
      "headline": "Over 80 bombs reportedly used to kill Hezbollah's Hassan Nasrallah in BeirutIsrael Hezbollah War Live Updates: The Israel Defence Forces (IDF) on Saturday confirmed that it killed Hezbollah chief Hassan Nasrallah during its massive strikes on the group's headquarters in Beirut's southern suburbs. It said it would continue to strike anyone who would threaten Israel and its citizens. Israel and Hezbollah launched tit-for-tat strikes as the news of Nasrallah's death was confirmed by Israel. Hezbollah's al-Manar television reported that four buildings were destroyed and there were many casualties in the multiple strikes, marking a major escalation of Israel's conflict with the Iran-backed group in 11 months. Israeli Prime Minister Benjamin Netanyahu also cut short a visit to the US and was returning home. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-touches-mani-ratnam-feet-iifa-utsavam-2024-ponniyin-selvan-chhiyaan-vikram-2607799-2024-09-28",
      "headline": "Watch: Aishwarya Rai touches 'guru' Mani Ratnam's feet at IIFA UtsavamActor Aishwarya Rai touched filmmaker Mani Ratnam's feet at IIFA Utsavam 2024 after presenting him with the Best Director award for Ponniyin Selvan II.  Watch the video of the heartfelt moment here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/moo-deng-makeup-memes-viral-videos-how-the-world-fell-in-love-with-a-pygmy-hippo-2607503-2024-09-28",
      "headline": "Moo Deng makeup, memes, viral videos: How the world fell in love with a pygmy hippoThe Internet's latest celebrity crush isn't an actor, politician, or sports personality, but a two-month-old pygmy hippo named Moo Deng, residing in a zoo in Thailand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rain-kanpur-washes-out-day-2-of-2nd-test-2607856-2024-09-28",
      "headline": "Persistent rain in Kanpur washes out Day 2 of 2nd TestIndia vs Bangladesh: Persistent rain washed out the second day of the already weather-disrupted second Test between India and Bangladesh at Green Park, Kanpur on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-american-ceo-nikesh-aroras-witty-reply-to-a-user-who-called-him-not-a-trained-engineer-2607835-2024-09-28",
      "headline": "Indian-American CEO's witty reply to X user who called him 'untrained engineer'Nikesh Arora, an Indian-American business executive, gave a witty reply to a user on X who claimed he wasn't a trained engineer.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-sports-business-politics-423-27-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbais-musheer-khan-suffers-neck-injury-in-road-accident-set-to-miss-irani-cup-2607794-2024-09-28",
      "headline": "Musheer Khan suffers neck injury in road accident, set to miss Irani CupSarfaraz Khan's brother Musheer Khan, sustained a serious neck injury following a road accident and is set to be sidelined for an extended period, missing the upcoming Irani Cup,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-high-alert-terror-threat-security-increased-crowded-places-religious-places-police-mock-drills-2607773-2024-09-28",
      "headline": "Mumbai on high alert over possible terror threat, security tightenedThe security has been tightened in the city and the police have been asked to conduct mock drills. Temples have been asked to remain vigilant and report suspicious activity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-birthday-wishes-alia-bhatt-raha-neetu-kapoor-cutest-family-pics-2607860-2024-09-28",
      "headline": "Alia Bhatt celebrates Ranbir Kapoor's 42nd with cutest family pics featuring RahaOn Ranbir Kapoor's 42nd birthday, Alia Bhatt shared heartwarming photos featuring him and their daughter Raha. Family members expressed love and best wishes as Ranbir embarks on his entrepreneurial journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-war-airstrikes-beirut-sayyed-hassan-nasrallah-middle-east-crisis-2607717-2024-09-28",
      "headline": "Israel steps up Lebanon strikes, suspense over Hezbollah chief's fate Live UpdatesThe Israeli military on Friday carried a \"precise strike\" on Hezbollah's central command in Beirut targeting the militant group's powerful leader Hassan Nasrallah. However, the 64-year-old cleric was reportedly unharmed in the missile attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-internet-shutdown-communal-clashes-police-personnel-injured-communal-clashes-bhadrak-2607884-2024-09-28",
      "headline": "Odisha imposes 48-hour internet shutdown in Bhadrak after communal clashesCommunal clashes erupted in Odisha's Bhadrak after a protest against a social media post turned violent. Five policemen suffered injured and a 48-hour internet shutdown was imposed in the district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-4-daughters-found-dead-in-rented-home-cops-suspect-suicide-2607750-2024-09-28",
      "headline": "Delhi man, 4 daughters found dead in rented home, cops suspect murder-suicideThe bodies of the 50-year-old man and his four daughters were found inside a room at their home and all five were foaming at the mouth. Pouches of a poisonous substance were found near the bodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ajith-kumar-launches-his-racing-team-back-in-the-racing-seat-2607904-2024-09-28",
      "headline": "Actor Ajith Kumar launches his racing team: Back in the racing seatAjith Kumar has launched his racing team, Ajith Kumar Racing, with plans to compete internationally. He tested the Ferrari 488 EVO Challenge in Dubai and aims to support young drivers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-as-negative-lead-in-yrfs-dhoom-4-to-shoot-after-ramayana-report-2607893-2024-09-28",
      "headline": "Ranbir Kapoor as negative lead in YRF's Dhoom 4, to shoot after Ramayana: ReportActor Ranbir Kapoor has reportedly agreed on starring in YRF's Dhoom 4. This will mark the 25th film in his career and the shooting will begin once he is done with Nitesh Tiwari's Ramayana series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kaun-banega-crorepati-16-amitabh-bachchan-akash-kumar-sharma-2607888-2024-09-28",
      "headline": "KBC 16: Can you answer Rs 6,40,000 question that the contestant couldn't attempt?In the latest episode of Kaun Banega Crorepati 16, contestant Akash Kumar Sharma answered the Rs 6,40,000 question incorrectly. He took home Rs 3,20,000. \r\n\r\n\r\n\r\n4/4\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-birthday-wishes-alia-bhatt-raha-neetu-kapoor-cutest-family-pics-2607860-2024-09-28",
      "headline": "Alia Bhatt celebrates Ranbir Kapoor's 42nd with cutest family pics featuring RahaOn Ranbir Kapoor's 42nd birthday, Alia Bhatt shared heartwarming photos featuring him and their daughter Raha. Family members expressed love and best wishes as Ranbir embarks on his entrepreneurial journey."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rain-kanpur-washes-out-day-2-of-2nd-test-2607856-2024-09-28",
      "headline": "Persistent rain in Kanpur washes out Day 2 of 2nd TestIndia vs Bangladesh: Persistent rain washed out the second day of the already weather-disrupted second Test between India and Bangladesh at Green Park, Kanpur on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wada-appeals-to-cas-on-jannik-sinner-doping-case-seeks-1-2-year-ban-on-player-2607879-2024-09-28",
      "headline": "WADA appeals to CAS on Jannik Sinner doping case, seeks 1-2 year ban on playerThe World Anti-Doping Agency (WADA) has sent an appeal to the Court Of Arbitration of Sport (CAS) against the independent tribunal's decision to clear Jannik Sinner of any 'wrongdoing or negligence' after he failed drug tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-pooran-breaks-mohammed-rizwan-world-record-in-t20s-2607876-2024-09-28",
      "headline": "WI's Nicholas Pooran breaks Mohammed Rizwan's world record in T20sNicholas Pooran has broken the world record for most runs in a calendar year in T20 cricket, surpassing Mohammad Rizwan's 2021 record. Pooran achieved this feat playing for various teams, including Trinbago Knight Riders and West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rishabh-pant-ashwin-foot-volley-rain-delay-2607873-2024-09-28",
      "headline": "Watch: Pant vs Ashwin star in foot-volley after rain delays Kanpur testRain halted play in Kanpur, but India's stars like Rishabh Pant, Ravichandran Ashwin Mohammed Siraj and Dhruv Jurel turned downtime into a spirited foot-volley match, lifting spirits as fans waited for cricket to resume."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-odi-series-cameron-green-injury-travis-head-2607869-2024-09-28",
      "headline": "Cameron Green knows way to get back: Travis Head optimistic about star's returnAustralia opener Travis Head is confident that Cameron Green will come back strongly after his latest injury setback. Green was ruled out of the England ODI series due to a sore back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-title-race-will-not-affect-pep-guardiola-bond-mikel-arteta-2607849-2024-09-28",
      "headline": "Premier League title race will not affect Pep Guardiola bond: Mikel ArtetaMikel Arteta has claimed that the Premier League title race between Arsenal and Manchester City will not affect the bond he has with Pep Guardiola. City and Manchester City played out a 2-2 draw as tempers flared between both teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-second-test-galle-bundled-out-batting-collapse-prabath-jayasuriya-2607840-2024-09-28",
      "headline": "Ahead of India tour, New Zealand bundled for 88 vs Sri Lanka in Galle TestNew Zealand's batting woes continued as they were bowled out for 88 in Galle, allowing Sri Lanka to enforce the follow-on. This dismal performance raises serious concerns ahead of their upcoming Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-rules-governing-council-meeting-on-saturday-announcement-soon-2607822-2024-09-28",
      "headline": "IPL 2025: Governing Council meeting on Saturday, announcement soonThe Indian Premier League (IPL) retention rules are expected to come out soon as the Governing Council (GC) will be meeting today (28 September, Saturday) in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-akash-deep-mohammed-shami-zaheer-khan-kanpur-2607820-2024-09-28",
      "headline": "Mohammed Shami is the perfect role model for Akash Deep: Zaheer KhanZaheer Khan has claimed that Mohammed Shami is the perfect role model for Akash Deep. The 27-year-old has made a fine start to life with the Indian team in Tests. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-day-two-rain-delay-kanpur-2607801-2024-09-28",
      "headline": "Watch: Indian team returns to hotel as Day 2 of Kanpur Test delayed due to rainThe Indian team has decided to return to their hotel as Day 2 of the second Test against Bangladesh has been delayed by heavy rain in Kanpur on Saturday, September 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbais-musheer-khan-suffers-neck-injury-in-road-accident-set-to-miss-irani-cup-2607794-2024-09-28",
      "headline": "Musheer Khan suffers neck injury in road accident, set to miss Irani CupSarfaraz Khan's brother Musheer Khan, sustained a serious neck injury following a road accident and is set to be sidelined for an extended period, missing the upcoming Irani Cup,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-second-test-galle-bundled-out-batting-collapse-prabath-jayasuriya-2607840-2024-09-28",
      "headline": "Ahead of India tour, New Zealand bundled for 88 vs Sri Lanka in Galle TestNew Zealand's batting woes continued as they were bowled out for 88 in Galle, allowing Sri Lanka to enforce the follow-on. This dismal performance raises serious concerns ahead of their upcoming Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-rules-governing-council-meeting-on-saturday-announcement-soon-2607822-2024-09-28",
      "headline": "IPL 2025: Governing Council meeting on Saturday, announcement soonThe Indian Premier League (IPL) retention rules are expected to come out soon as the Governing Council (GC) will be meeting today (28 September, Saturday) in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-akash-deep-mohammed-shami-zaheer-khan-kanpur-2607820-2024-09-28",
      "headline": "Mohammed Shami is the perfect role model for Akash Deep: Zaheer KhanZaheer Khan has claimed that Mohammed Shami is the perfect role model for Akash Deep. The 27-year-old has made a fine start to life with the Indian team in Tests. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-day-two-rain-delay-kanpur-2607801-2024-09-28",
      "headline": "Watch: Indian team returns to hotel as Day 2 of Kanpur Test delayed due to rainThe Indian team has decided to return to their hotel as Day 2 of the second Test against Bangladesh has been delayed by heavy rain in Kanpur on Saturday, September 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbais-musheer-khan-suffers-neck-injury-in-road-accident-set-to-miss-irani-cup-2607794-2024-09-28",
      "headline": "Musheer Khan suffers neck injury in road accident, set to miss Irani CupSarfaraz Khan's brother Musheer Khan, sustained a serious neck injury following a road accident and is set to be sidelined for an extended period, missing the upcoming Irani Cup,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ecbs-financial-projections-for-the-hundred-is-disconnected-from-reality-lalit-modi-2607782-2024-09-28",
      "headline": "ECB's financial projections for The Hundred is disconnected from reality: LalitLalit Modi, the brain behind the successful IPL, has expressed serious doubts about the ECB's financial projections for 'The Hundred'. He believes the numbers are overly optimistic and disconnected from reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-coach-wants-neymar-to-be-fully-recovered-before-returning-to-national-team-2607772-2024-09-28",
      "headline": "Brazil coach wants Neymar to be fully recovered before national team comebackCoach Dorival Jr said on Friday that he would wait until Neymar is fully fit to bring him back into the Brazil squad as he announced the roster for October's South American qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-4th-odi-haryy-brook-reaction-jofra-archer-lords-2607764-2024-09-28",
      "headline": "Harry Brook says return to form 'just a matter of time': Just needed to clickEngland's stand-in skipper Harry Brook claimed that he knew his return to form was just a matter of time after the win over Australia in the 4th ODI. England secured a 186-run win in the rain-truncated game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-arsenal-pep-guardiola-mikel-arteta-2607755-2024-09-28",
      "headline": "Pep Guardiola hits back at Arsenal, Mikel Arteta: You want a war? Now we warPep Guardiola has hit out at Arsenal and Mikel Arteta, claiming he has been provoked to get into a more intense rivalry with them. City vs Arsenal ended in a 2-2 draw as tempers flared between players from both sides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cameron-green-doubtful-for-test-series-vs-india-2607747-2024-09-28",
      "headline": "Cameron Green doubtful for home Test series vs IndiaAustralian all-rounder Cameron Green's participation in the upcoming five-match Test series against India was thrown into doubt after a back injury ruled him out of the ongoing tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-ireland-1st-t20i-rickelton-hendricks-2607740-2024-09-28",
      "headline": "Rickelton, Hendricks star as South Africa thrash Ireland South Africa registered a comfortable 8-wicket victory over Ireland in the first T20I in Abu Dhabi to take a 1-0 lead in the two-match series. South Africa's openers Ryan Rickelton (76) and Reeza Hendricks (51) put on a 136-run stand in 13 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-arsenal-pep-guardiola-mikel-arteta-2607755-2024-09-28",
      "headline": "Pep Guardiola hits back at Arsenal, Mikel Arteta: You want a war? Now we warPep Guardiola has hit out at Arsenal and Mikel Arteta, claiming he has been provoked to get into a more intense rivalry with them. City vs Arsenal ended in a 2-2 draw as tempers flared between players from both sides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cameron-green-doubtful-for-test-series-vs-india-2607747-2024-09-28",
      "headline": "Cameron Green doubtful for home Test series vs IndiaAustralian all-rounder Cameron Green's participation in the upcoming five-match Test series against India was thrown into doubt after a back injury ruled him out of the ongoing tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-ireland-1st-t20i-rickelton-hendricks-2607740-2024-09-28",
      "headline": "Rickelton, Hendricks star as South Africa thrash Ireland South Africa registered a comfortable 8-wicket victory over Ireland in the first T20I in Abu Dhabi to take a 1-0 lead in the two-match series. South Africa's openers Ryan Rickelton (76) and Reeza Hendricks (51) put on a 136-run stand in 13 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-suspends-argentina-goalkeeper-for-two-world-cup-qualifier-games-2607735-2024-09-28",
      "headline": "FIFA suspends Argentina goalkeeper Martinez for two World Cup qualifier games Argentina's Emiliano Martínez has been handed a two-match suspension by FIFA for violating fair play principles during World Cup qualifiers. The goalkeeper will miss crucial matches against Venezuela and Bolivia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-lords-odi-harry-brook-liam-livingstone-report-2607720-2024-09-28",
      "headline": "Harry Brook, Liam Livingstone fire England to series leveller at Lord's  ENG vs AUS: England drew level in the 5-match ODI series after beating Mitchell Marsh's Australia by 186 runs on Friday at the iconic Lord's Cricket Ground in London. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-warm-ups-schedule-squads-timings-india-australia-2607713-2024-09-27",
      "headline": "Women's T20 World Cup 2024 warm-ups: All you need to knowWomen's T20 World Cup 2024: The warm-ups will have 10 matches to be played across three venues from September 28 to October 1. India's matches are against West Indies and South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-kanpur-weather-2nd-test-rain-forecast-green-park-2607700-2024-09-27",
      "headline": "IND vs BAN, 2nd Test Kanpur Weather Report: Heavy rain likely to washout Day 2The Day 2 of the second Test between India and Bangladesh is likely to be washed out due to heavy rain at Green Park, Kanpur. Bangladesh are 107/3 in 35 overs after Day 1."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}