{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-conclave-puneet-chhatwal-eyes-top-3-spot-for-taj-hotels-in-global-hospitality-2606774-2024-09-26",
      "headline": "Puneet Chhatwal eyes top 3 spot for Taj Hotels in global hospitalityHe envisions the brand securing its place among the top three global hospitality companies in the next five years, a goal driven by Taj's ethos of service, adaptability to changing luxury trends, and a commitment to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radhika-gupta-edelweiss-mutual-fund-dal-chawal-investment-portfolio-2606746-2024-09-26",
      "headline": "80% of your portfolio should be 'Dal-Chawal': Radhika Gupta's investment mantraRadhika Gupta's message focused on the importance of disciplined, long-term investing—what she calls \"Dal-Chawal Investing\"—a simple and sustainable approach she believes will help investors navigate the market's highs and lows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-ipo-opens-review-price-band-gmp-should-you-subcribe-good-bad-2606728-2024-09-26",
      "headline": "Diffusion Engineers IPO opens for subscription: Should you subcribe?The price band for the IPO has been set between Rs 159 and Rs 168 per share. Investors can apply for a minimum lot of 88 shares, requiring a retail investment of Rs 14,784."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-allotment-check-status-online-guide-listing-gain-gmp-today-subscription-2606695-2024-09-26",
      "headline": "Manba Finance IPO allotment: Check status, expected listing gain, subscriptionManba Finance IPO opened for subscription on September 23 and ran until September 25, generating huge bids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motors-ipo-details-market-valuation-nomura-maruti-suzuki-2606690-2024-09-26",
      "headline": "Hyundai Motors IPO: Can it beat Maruti Suzuki's market valuation?Hyundai, the second-largest automaker in India, has maintained a steady market share of 15-17% since 2008. But does it have what it takes to beat market leader Maruti Suzuki's valuation? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-26-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2606675-2024-09-26",
      "headline": "Gold, silver price today, September 26, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 26 September 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-hit-record-high-as-rally-extends-for-5th-straight-session-2606654-2024-09-26",
      "headline": "Sensex, Nifty hit record high as rally extends for 5th straight sessionThe S&P BSE Sensex rose to an all-time high of 85,333.23 in early trade, while the NSE Nifty50 climbed to 26,056."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-to-swiggy-5-big-ipos-set-to-light-up-dalal-street-before-2024-ends-ntpc-ather-energy-hdb-2606435-2024-09-25",
      "headline": "Hyundai to Swiggy: 5 big IPOs set to light up Dalal Street before 2024 endsFrom Hyundai Motors' massive offering to Swiggy's much-anticipated debut, the year's final IPOs could be the most exciting ones yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-hit-record-high-as-power-financial-stock-drive-market-rally-2606268-2024-09-25",
      "headline": "Sensex, Nifty hit record high as power and financial stock drive market rallyThe S&P BSE Sensex added 255.83 points to end at 85,169.87, while the NSE Nifty50 gained 63.75 points to close at 26,004.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-sbi-uco-canara-jm-financial-brokerage-11-psu-bank-stocks-buying-opportunities-selloff-2606209-2024-09-25",
      "headline": "PNB, SBI, UCO: JM Financial lists 11 PSU bank stocks worth buying after selloffSince reaching its 52-week high, the PSU Bank index has dropped by 15%, with banks like UCO Bank, Bank of India (BOI), Indian Overseas Bank (IOB), and Union Bank of India seeing sharper declines of 25-30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-easemytrip-shares-plunge-20-to-record-low-block-deal-nishant-pitti-2606182-2024-09-25",
      "headline": "Easy Trip Planners shares plunge 20% to record low. Here's what happenedThe steep decline in share price was triggered by news that promoter Nishant Pitti plans to sell 15 crore shares, representing 8.5% of the company's total share capital, in a block deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-gujarat-see-lowest-youth-unemployment-kerala-struggles-2606173-2024-09-25",
      "headline": " Madhya Pradesh, Gujarat see lowest youth unemployment, Kerala strugglesMadhya Pradesh and Gujarat have emerged as the best performers, boasting the lowest youth unemployment rates, while Kerala struggles with one of the highest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coldplay-concert-ticket-mumbai-hotel-prices-surge-taj-jw-marriott-westin-2606167-2024-09-25",
      "headline": "Coldplay mania: Mumbai hotel rates up by 300% for concert weekendWith Coldplay set to perform at DY Patil Stadium on January 18-19 and 21, 2025, hotel prices in Mumbai have skyrocketed, which might leave fans scrambling for accommodation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-upper-circuit-5-percent-52-week-high-explained-2606115-2024-09-25",
      "headline": "Explained: Why Reliance Power shares hit 5% upper circuit today Reliance Power stock: What's behind the fresh rally? Investors are buzzing as the company makes big moves—find out what's driving the surge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salaried-employees-work-longer-hours-than-casual-workers-finds-survey-2606102-2024-09-25",
      "headline": "Salaried employees work longer hours than casual workers, finds surveyFor many corporate workers, these 48-hour weeks translate to roughly 9 hours of work each day if they're working five days a week, or 8 hours if it's a six-day work week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motors-rs-25000-crore-ipo-to-hit-markets-soon-gets-sebi-nod-likely-october-2606092-2024-09-25",
      "headline": "Hyundai IPO gets Sebi clearence. Check expected listing date The company submitted its draft papers in June 2024 and the IPO may be launched as soon as October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-opens-for-bidding-details-subscribe-skip-good-bad-expert-review-listing-gains-gmp-2606061-2024-09-25",
      "headline": "KRN Heat Exchanger IPO opens for bidding: Subscribe or skip? The IPO of KRN Heat Exchanger is entirely a fresh issue of 1.55 crore shares and will be open for subscription till September 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-25-2024-yellow-metal-trades-higher-silver-records-dip-mcx-latest-rates-2606054-2024-09-25",
      "headline": "Gold, silver price today, September 25, 2024: Yellow metal trades higher, silver records dip on MCXGold Price Today 25 September 2024: Gold is trading on the higher side while silver rates have recorded a dip on the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-display-module-plant-tamil-nadu-oragadam-usd-1-billion-apple-iphone-production-report-2606044-2024-09-25",
      "headline": "Foxconn eyes $1 billion display module plant in Tamil Nadu: ReportThis will be the first display module facility Foxconn has built in India, and it is expected to mainly support the production of Apple's iPhones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-as-investors-take-breather-after-record-run-2606042-2024-09-25",
      "headline": "Sensex, Nifty open flat as investors take breather after record runThe S&P BSE Sensex was down 20.70 points to 84,893.34 at 10:23 am, while the NSE Nifty50 fell 18.20 points to trade at 25,922.20."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-vikramaditya-singh-eateries-owner-name-congress-criticism-2606786-2024-09-26",
      "headline": "Vikramaditya Singh rebuked by Congress over eateries' order as party faces fireVikramaditya Singh rebuked by Congress over eateries' order as party faces fire"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/p-chidambaram-weaknesses-achievements-pm-modi-digital-payments-2606729-2024-09-26",
      "headline": "What are 3 achievements, weaknesses of Modi government: What Chidambaram saidP Chidambaram credited the NDA government for carrying forward improvement of the network of national highways that was started by Atal Bihari Vajpayee's Golden Quadrilateral project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kangana-ranaut-emergency-release-bombay-high-court-cuts-made-censor-board-suggestions-update-2606721-2024-09-26",
      "headline": "Kangana Ranaut's 'Emergency' can be released if certain cuts are made, court told'Emergency', the film starring actor and BJP MP Kangana Ranaut, can be released only if certain cuts suggested by a panel can be made, the Censor Board told the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-lebanon-war-lonely-top-hassan-nasrallah-iran-hezbollah-chief-death-of-leaders-pagers-blast-2606190-2024-09-26",
      "headline": "Why it's lonely at the top for Hezbollah chief NasrallahIn the past week, Hezbollah has lost many of its top leaders to Israeli offensive. Despite the Iranian support and counsel, Hezbollah chief Hassan Nasrallah might be lonely. Does this provide a golden opportunity for Israel?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/workout-burnout-extreme-diets-the-pressure-to-stay-fit-is-making-gen-z-ill-2606114-2024-09-26",
      "headline": "Workout burnout, extreme diets: The pressure to stay fit is making Gen Z illA craving for validation can drive you to pursue fitness for the wrong reasons, shifting your focus away from health. This approach not only increases the risk of burnout but also negatively affects both your physical and mental wellbeing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-mahalakshmi-fridge-murder-suspect-mukti-ranjan-rai-suicide-odisha-argument-with-victim-2606671-2024-09-26",
      "headline": "Suspect argued with victim before killing her, says suicide noteThe suspect's body was found in Odisha's Bhadrak district. According to the police, he was found hanging, and a case of suicide has been filed at the Dushuri Police Station."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/baps-hindu-temple-vandalised-hindus-go-back-message-us-second-incident-10-days-2606646-2024-09-26",
      "headline": "Temple defaced in US with 'Hindus go back' message, 2nd incident in 10 daysThe Sacremento Police said that the vandalism incident was being classified as a \"hate crime\". Police added that the accused also cut water lines at the property. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/sanjay-raut-shiv-sena-ubt-convicted-sentenced-15-days-imprisonment-defamation-case-kirit-somaiya-wife-medha-somaiya-2606730-2024-09-26",
      "headline": "Mumbai court sentences Sanjay Raut to 15 days imprisonment in defamation caseMedha Somaiya, the wife of former BJP MP Kirit Somaiya, had said in her complaint that Shiv Sena (UBT) MP Sanjay Raut made baseless and completely defamatory allegations against her and her husband."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/inside-sarco-suicide-pod-switzerland-american-woman-death-2606709-2024-09-26",
      "headline": "Inside Doctor Death's 'suicide pod' that has sparked an ethics debateThe futuristic-looking capsule has sparked a global debate on ethics after an American woman became the first person to use the pod to end her life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/guangzhou-baghdad-flight-diverted-to-kolkata-airport-female-passengers-falls-sick-china-2606787-2024-09-26",
      "headline": "China-bound Iraqi Airways flight diverted to Kolkata after passenger falls illChina-bound flight diverted to Kolkata after passenger falls sick 30 minutes before landing"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/more-leadership-drama-at-openai-mira-murati-and-two-others-leave-while-sam-altman-says-thank-you-2606645-2024-09-26",
      "headline": "More leadership drama at OpenAI, Mira Murati and two others leave OpenAI undergoes significant leadership changes as CTO Mira Murati and two senior leaders depart, marking a major transition for the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-minister-atishi-seat-number-1-kejriwal-41-delhi-assembly-new-seating-plan-2606738-2024-09-26",
      "headline": "Atishi no. 1, Arvind Kejriwal in no. 41 in Delhi Assembly's new seating planAtishi, who was sworn in as the Chief Minister of Delhi after Arvind Kejriwal resigned from the position, earlier occupied seat number 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actors-ashton-kutcher-mila-kunis-to-part-ways-after-9-years-heres-the-truth-2606751-2024-09-26",
      "headline": "Actors Ashton Kutcher, Mila Kunis to part ways after 9 years? Here's the truthRecent rumours about Ashton Kutcher and Mila Kunis' relationship have been denied by a source close to the couple. Despite online gossip and resurfaced photos involving Sean 'Diddy' Combs, the couple is not parting ways."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-heavy-rain-schools-colleges-closed-more-showers-imd-waterlogging-maharashtra-2606602-2024-09-26",
      "headline": "1 dead as rain paralyses Mumbai, schools shut today, more showers expected Live UpdatesMumbai rain: One person drowned in an overflowing drain in Mumbai as heavy rain battered the city and affected local train and flight operations. However, the situation returned to normal as rain stopped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-kangana-ranaut-farm-laws-statements-baseless-illogical-spokesperson-jaiveer-shergill-pm-modi-punjab-2606716-2024-09-26",
      "headline": "Consistent rant: BJP leader on Kangana Ranaut's 'baseless' farm law remarksBJP spokesperson Jaiveer Shergill said that Kangana's \"consistent rant, useless, baseless and illogical statements against the Sikh community\" and the farmers of Punjab damaged the \"good work\" being done by Prime Minister Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-congress-one-nation-one-election-india-today-mumbai-conclave-lok-sabha-state-assemblies-2606765-2024-09-26",
      "headline": "BJP bats for One Nation One Election, Congress calls it weapon of mass distractionA war-of-words broke out between the BJP and Congress over the implementation of One Nation One Election -- the idea of holding simultaneous elections to the Lok Sabha and state Assemblies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kbc-16-the-rs-1-crore-question-that-made-chander-prakash-1st-crorepati-of-amitabh-bachchan-show-2606711-2024-09-26",
      "headline": "KBC 16: The Rs 1 crore question that made Chander Parkash 1st crorepati of seasonCan you answer the big Rs 1 crore question that made 21-year-old Chander Parkash the first crorepati of Amitabh Bachchan's show? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-zomato-agent-walks-amid-heavy-rain-to-deliver-order-after-bike-breaks-down-2606712-2024-09-26",
      "headline": "Mumbai Zomato agent walks amid heavy rain to deliver order after bike breaks downA Zomato agent walked through Mumbai's waterlogged streets to deliver food after his bike broke down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/chess-olympiad-champions-prime-minister-narendra-modi-meeting-2606750-2024-09-26",
      "headline": "Never be satisfied with your achievements, PM Modi tells Chess Olympiad championsChess Olympiad 2024: Prime Minister Narendra Modi hosted India's chess champions at his residence on Wednesday, September 25. From discussing the importance of decision-making to listening keenly to the role of Artificial Intelligence in the sport, PM Modi enjoyed his interaction with the star players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/controversy-between-pawan-kalyan-and-prakash-raj-over-tirupati-prasadam-ytvd-2606610-2024-09-26",
      "headline": "Pawan Kalyan and Prakash Raj clash over Tirupati prasadam issueA controversy has emerged between Deputy CM Pawan Kalyan and actor Prakash Raj over the Tirupati prasadam issue. The situation escalated as Prakash Raj urged Kalyan to focus on the investigation, while Kalyan accused Raj of mocking Hindu sentiments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/multiplex-association-hits-back-at-karan-johar-says-movie-outing-costs-rs-1560-not-rs-10000-2606741-2024-09-26",
      "headline": "Multiplex association hits back at KJo: Movie outing costs Rs 1,560 not Rs 10,000Karan Johar claims a movie outing for a family of four costs Rs 10,000, but the Multiplex Association of India states it's only Rs 1,560, citing lower ticket prices and flexible cinema costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/after-coldplay-bookmyshow-mess-make-reselling-concert-tickets-illegal-in-india-2606362-2024-09-26",
      "headline": "After Coldplay-BookMyShow mess, make reselling concert tickets illegal in IndiaBookMyShow has launched a police investigation into the 'third-party' apps that allowed people and dealers to resell Coldplay concert tickets at inflated prices – up to Rs 7.7 lakh for a ticket originally priced at Rs 12,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pulitzer-winning-author-jhumpa-lahiri-noguchi-museum-award-new-york-museum-kaffiyehs-ban-2606665-2024-09-26",
      "headline": "Author Jhumpa Lahiri declines award over New York museum's ban on keffiyehsThe museum said the Pulitzer Prize-winning author withdrew her acceptance after it fired staff members for wearing clothing expressing political views.\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/saturn-emerges-from-behind-the-moon-in-stunning-video-taken-from-earth-2606398-2024-09-26",
      "headline": "Watch: Saturn emerges from behind Moon in stunning videoThe video shows the ringed planet slowly revealing itself from behind the Moon's illuminated edge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-dutta-shares-horrendous-experience-with-indigo-after-flight-cancellation-2606790-2024-09-26",
      "headline": "Actor Divya Dutta shares 'horrendous experience' with IndiGo after flight cancellationActor Divya Dutta slammed IndiGo for cancelling her flight without prior notification. The actor shared her distressing experience on social media and vented out her frustration in a lengthy note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-on-devara-rollercoaster-journey-of-a-father-and-son-2606767-2024-09-26",
      "headline": "Jr NTR on Devara: It's a rollercoaster journey of a father and sonSouth star Jr NTR is eagerly awaiting the release of Devara, as are his fans. Recently, the actor opened up about the plot of the film and said that it revolves around a father-son story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/stree-2-ott-when-and-where-to-watch-amazom-prime-video-rent-2606768-2024-09-26",
      "headline": "Stree 2 on OTT: Here's how and where to watch the Rajkummar, Shraddha-starrerRajkummar Rao and Shraddha Kapoor's Stree 2 is all set to release on OTT. However, there is a catch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-bhulaiyaa-3-new-poster-kartik-aaryan-confirms-rooh-baba-manjulika-face-off-2606754-2024-09-26",
      "headline": "Bhool Bhulaiyaa 3 new poster: Kartik Aaryan confirms Rooh Baba-Manjulika face-offActor Kartik Aaryan and the team of Bhool Bhulaiyaa 3 shared a new poster of the film, confirming the big clash between Rooh Baba and Vidya Balan's Manjulika in the story. The film is releasing this Diwali. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-rishabh-pant-comeback-tests-ind-vs-ban-australian-2606777-2024-09-26",
      "headline": "Wish Pant was Australian: Mitchell Marsh lauds India star's sensational comebackAustralia captain Mitchell Marsh has commended Indian cricketer Rishabh Pant for his incredible recovery and return to the sport after a serious car accident. Marsh said he wished Rishabh Pant was Australian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-all-you-need-to-know-kanpur-pitch-weather-and-team-news-2606769-2024-09-26",
      "headline": "IND vs BAN 2nd Test All you need to know: Kanpur pitch, weather and team newsIndia vs Bangladesh 2nd Test: Green Park Stadium in Kanpur will be hosting the final Test. Can rain play spoilsport in the Kanpur Test match? Here is all you need to know about the contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/chess-olympiad-champions-prime-minister-narendra-modi-meeting-2606750-2024-09-26",
      "headline": "Never be satisfied with your achievements, PM Modi tells Chess Olympiad championsChess Olympiad 2024: Prime Minister Narendra Modi hosted India's chess champions at his residence on Wednesday, September 25. From discussing the importance of decision-making to listening keenly to the role of Artificial Intelligence in the sport, PM Modi enjoyed his interaction with the star players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-lisa-sthalekar-backs-india-to-at-least-reach-semi-finals-2606731-2024-09-26",
      "headline": "Women's T20 World Cup: Lisa Sthalekar backs India to at least reach semi-finalsLisa Sthalekar ranked India as one of the favourites to at least reach the semi-final of the Women's T20 World Cup, if not the final. India will aim to clinch their maiden women's World Cup title. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/greg-chappell-baggy-green-australia-test-cap-goes-missing-2606699-2024-09-26",
      "headline": "Don't know what happened to it: Greg Chappell's Baggy Green goes missingAustralian legend Greg Chappell has revealed that his cherished Baggy Green cap has gone missing after being in storage for about ten years. The former captain discovered the loss upon moving to Adelaide recently, though he stopped short of suggesting it had been stolen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-arrives-in-india-from-us-vacation-amid-wait-for-ipl-retention-rules-2606708-2024-09-26",
      "headline": "MS Dhoni arrives in India from US vacation amid wait for IPL retention rulesMS Dhoni landed in India amid the building anticipation over his retention in CSK franchise for IPL 2025. The BCCI and IPL governing council are expected to announce the retention rules soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2010-csk-became-1st-team-to-win-both-titles-of-ipl-and-clt20-in-a-year-2606691-2024-09-26",
      "headline": "OTD in 2010: CSK became 1st team to win both titles of IPL and CLT20 in a yearOn This Day in 2010, CSK scripted history by becoming the first-ever team to win both IPL and CPL in a single year. They beat Mumbai Indians in IPL 2010 final and Warriors in the summit clash of Champions League T20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jitesh-could-pip-kishan-for-2nd-wicketkeeper-slot-in-t20is-2606674-2024-09-26",
      "headline": "Jitesh could pip Kishan for 2nd wicketkeeper's slot in T20IsIndia vs Bangladesh: Jitesh Sharma could be selected over Ishan Kishan as the second wicketkeeper for the Indian team led by Suryakumar Yadav in the T20I upcoming series. The announcement of the Indian squad is expected later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-indian-team-starts-training-in-kanpur-amid-fun-chats-and-banters-2606667-2024-09-26",
      "headline": "Watch: Indian team starts training in Kanpur amid fun chats and bantersThe Indian team began intense training at the Green Park Stadium in Kanpur amid fun chats and banter among players. The 2nd Test match between India and Bangladesh will begin on September 27.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-deepti-takes-inspiration-from-india-mens-team-eyes-title-2606659-2024-09-26",
      "headline": "Women's T20 World Cup: Deepti takes inspiration from India men's team, eyes titleDeepti Sharma has taken inspiration from the Indian men's team and their recent T20 World Cup triumph. The Indian women's team will eye their maiden women's T20 World  Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2010-csk-became-1st-team-to-win-both-titles-of-ipl-and-clt20-in-a-year-2606691-2024-09-26",
      "headline": "OTD in 2010: CSK became 1st team to win both titles of IPL and CLT20 in a yearOn This Day in 2010, CSK scripted history by becoming the first-ever team to win both IPL and CPL in a single year. They beat Mumbai Indians in IPL 2010 final and Warriors in the summit clash of Champions League T20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jitesh-could-pip-kishan-for-2nd-wicketkeeper-slot-in-t20is-2606674-2024-09-26",
      "headline": "Jitesh could pip Kishan for 2nd wicketkeeper's slot in T20IsIndia vs Bangladesh: Jitesh Sharma could be selected over Ishan Kishan as the second wicketkeeper for the Indian team led by Suryakumar Yadav in the T20I upcoming series. The announcement of the Indian squad is expected later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-indian-team-starts-training-in-kanpur-amid-fun-chats-and-banters-2606667-2024-09-26",
      "headline": "Watch: Indian team starts training in Kanpur amid fun chats and bantersThe Indian team began intense training at the Green Park Stadium in Kanpur amid fun chats and banter among players. The 2nd Test match between India and Bangladesh will begin on September 27.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-deepti-takes-inspiration-from-india-mens-team-eyes-title-2606659-2024-09-26",
      "headline": "Women's T20 World Cup: Deepti takes inspiration from India men's team, eyes titleDeepti Sharma has taken inspiration from the Indian men's team and their recent T20 World Cup triumph. The Indian women's team will eye their maiden women's T20 World  Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-national-cricket-academy-in-bengaluru-almost-ready-dilip-vengsarkar-2606649-2024-09-26",
      "headline": "New National Cricket Academy in Bengaluru almost ready: Dilip VengsarkarDilip Vengsarkar, former India captain and BCCI Apex Council member, expressed his satisfaction with the 'almost ready' National Cricket Academy in Bengaluru. The NCA, featuring modern facilities, will be inaugurated later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-still-a-work-in-progress-despite-great-start-in-laliga-hansi-flick-2606643-2024-09-26",
      "headline": "Barcelona still a work in progress despite great start in LaLiga: Hansi Flick FC Barcelona have started the La Liga season with seven consecutive victories, but manager Hansi Flick believes there's still room for improvement, despite their hard-fought 1-0 win over Getafe on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/going-to-take-another-10-years-to-produce-a-grand-slam-champion-leander-paes-2606633-2024-09-26",
      "headline": "Going to take another 10 years to produce a Grand Slam champion: Leander PaesTennis legend Leander Paes believes India needs a decade and a grassroots transformation to produce a Grand Slam champion. Speaking at the Tennis Premier League auction, he stressed the importance of nurturing young talent and tapping into rural areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-curator-on-pitch-for-second-test-2606627-2024-09-26",
      "headline": "Kanpur curator hints pitch to favour both pace and spin in 2nd TestIndia vs Bangladesh: Green Park curator Shiv Kumar revealed that the pitch for the second Test will offer a balanced contest for both pacers and spinners. The pitch is expected to provide bounce and movement for fast bowlers in the early stages and favour spinners from Day 3 onwards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/no-inspiration-to-play-ipl-shikhar-dhawan-explains-retirement-call-2606624-2024-09-26",
      "headline": "Didn't have inspiration to play IPL and domestic cricket: Shikhar DhawanFormer India opener Shikhar Dhawan revealed that he didn't have the \"inspiration\" left to take the domestic cricket route for a place in the national side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inspired-by-bishan-singh-bedi-yuvraj-singh-coaching-mantra-2606612-2024-09-26",
      "headline": "Inspired by Bishan Singh Bedi: Yuvraj Singh opens up on his coaching mantraIndia great Yuvraj Singh revealed how his coaching philosophy draws inspiration from his late mentor Bishan Singh Bedi. Yuvraj continues to impart Bedi's principles while mentoring young talents like Shubman Gill and Abhishek Sharma in the evolving world of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-eriksen-strike-cancelled-as-manchester-united-draw-vs-twente-2606608-2024-09-26",
      "headline": "Eriksen's strike cancelled as Manchester United draw vs TwenteEuropa League: Manchester United kicked off their 2024/25 campaign with a 1-1 draw against FC Twente at Old Trafford. Christian Eriksen's stunning goal was cancelled out by Sam Lammers' equaliser, leaving United with just a point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-bangladesh-training-before-kanpur-test-2606565-2024-09-25",
      "headline": "Bangladesh start rigorous training before all-important Kanpur TestIND vs BAN: Najmul Hossain Shanto's men have started training hard in a bid to make a comeback in the second Test against India, starting September 27 at the Green Park in Kanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/no-inspiration-to-play-ipl-shikhar-dhawan-explains-retirement-call-2606624-2024-09-26",
      "headline": "Didn't have inspiration to play IPL and domestic cricket: Shikhar DhawanFormer India opener Shikhar Dhawan revealed that he didn't have the \"inspiration\" left to take the domestic cricket route for a place in the national side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inspired-by-bishan-singh-bedi-yuvraj-singh-coaching-mantra-2606612-2024-09-26",
      "headline": "Inspired by Bishan Singh Bedi: Yuvraj Singh opens up on his coaching mantraIndia great Yuvraj Singh revealed how his coaching philosophy draws inspiration from his late mentor Bishan Singh Bedi. Yuvraj continues to impart Bedi's principles while mentoring young talents like Shubman Gill and Abhishek Sharma in the evolving world of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-eriksen-strike-cancelled-as-manchester-united-draw-vs-twente-2606608-2024-09-26",
      "headline": "Eriksen's strike cancelled as Manchester United draw vs TwenteEuropa League: Manchester United kicked off their 2024/25 campaign with a 1-1 draw against FC Twente at Old Trafford. Christian Eriksen's stunning goal was cancelled out by Sam Lammers' equaliser, leaving United with just a point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-bangladesh-training-before-kanpur-test-2606565-2024-09-25",
      "headline": "Bangladesh start rigorous training before all-important Kanpur TestIND vs BAN: Najmul Hossain Shanto's men have started training hard in a bid to make a comeback in the second Test against India, starting September 27 at the Green Park in Kanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-ben-stokes-recovery-hamstring-injury-test-series-2606553-2024-09-25",
      "headline": "Ben Stokes 'on track' for England comeback after hamstring injuryPAK vs ENG: Ben Stokes underwent scans on his hamstring and results showed that he is well on track to recover for England's Test series against Pakistan, starting October 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-harmanpreet-kaur-rana-daggubati-dubai-2606539-2024-09-25",
      "headline": "India women welcomed by Rana Daggubati on Dubai arrival T20 World Cup: Actor Rana Daggubati greeted the Harmanpreet Kaur-led Indian women's team on their arrival in Dubai. India are scheduled to begin their campaign on October 4 against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-kanpur-test-akash-deep-virat-kohli-rohit-sharma-dedication-hard-work-2606524-2024-09-25",
      "headline": "IND vs BAN: Akash Deep in awe of Virat Kohli and Rohit Sharma's dedicationIndia pacer Akash Deep revealed how sharing the dressing room with Indian cricket stars left him inspired by the dedication and hard work of superstars like Virat Kohli and skipper Rohit Sharma. He praised their thought process, hailing it as being on a different level than anyone else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-akash-deep-not-feeling-pressure-australia-selection-2606516-2024-09-25",
      "headline": "Akash Deep not feeling Australia selection pressure : I live in the presentIndia pacer Akash Deep remains focused on the present, not letting pressure affect him ahead of a potential Border Gavaskar Trophy selection. He continues to prioritize the Bangladesh series, following his impressive performances since debuting earlier this year."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}