{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-in-trade-talks-with-us-says-piyush-goyal-day-after-modi-meets-xi-putin-sco-summit-tianjin-china-trump-tariffs-2780601-2025-09-02",
      "headline": "India in trade talks with US, says Piyush Goyal day after Modi meets Xi, PutinCommerce Minister Piyush Goyal on Tuesday said India is holding talks with the United States on a bilateral trade agreement, days after President Donald Trump doubled tariffs on Indian goods over New Delhi's continued imports of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-take-a-loan-against-mutual-fund-follow-these-steps-2780584-2025-09-02",
      "headline": "How to take a loan against mutual fund? Follow these stepsNeed quick cash but don't want to sell your mutual funds? You can now take a loan against your investments and get instant funds while keeping your portfolio intact. Here's how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-salaried-employees-change-tax-regimes-while-filing-itr-old-and-new-tax-regime-2780547-2025-09-02",
      "headline": "Can salaried employees change tax regimes while filing ITR?As tax season nears, a common question among employees is whether they can switch from the old tax regime to the new one, or vice versa, while filing their ITR. Understanding the rules can help maximise tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earnings-from-online-gaming-here-is-how-to-file-itr-2780517-2025-09-02",
      "headline": "Earnings from online gaming? Here's how to file ITRThe September 15 ITR deadline is around the corner, and if you earned money from online games like fantasy cricket, rummy, or poker in FY25, it's time to report your winnings to the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-issues-new-rules-for-intraday-derivatives-trading-check-details-2780496-2025-09-02",
      "headline": "Sebi sets new intraday limits for equity derivatives from October 1. Details hereThe move comes after Sebi's action against US-based high-frequency trading firm Jane Street for using strategies deemed manipulative and harmful to retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-real-estate-developers-eye-big-sales-as-debt-hits-historic-low-2780470-2025-09-02",
      "headline": "Top real estate developers eye Rs 1.5 lakh crore sales as debt hits historic lowFresh data from ANAROCK Research shows that the top 10 listed players have already achieved nearly 30% (Rs 44,317 crore) of their combined Rs 1.49 lakh crore pre-sales target for FY26 in just the first quarter. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-24600-reliance-gains-over-1-2780452-2025-09-02",
      "headline": "Sensex, Nifty open higher ahead of GST Council meet as investors eye major tax cutsThe S&P BSE Sensex gained around 200 points in early trade, while the NSE Nifty50 hovered above 24,600. Broader markets mirrored the upbeat sentiment, extending gains from the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nestle-fires-ceo-over-workplace-relationship-appoints-successor-glbs-2780395-2025-09-02",
      "headline": "Nestlé fires CEO over workplace relationship, appoints successorNestle has dismissed CEO Laurent Freixe for an undisclosed relationship with a subordinate, appointing longtime executive Philipp Navratil as successor. Chairman Paul Bulcke called the move necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-prices-soar-to-all-time-high-rupee-hits-record-low-ahead-of-festive-season-2780243-2025-09-01",
      "headline": "Gold prices soar to all-time high, Rupee hits record low ahead of festive seasonAhead of the festive season, prices for precious metals have hit record highs while the Indian rupee has fallen to an all-time low. Gold crossed the ₹1,04,000 per 10 grams mark, and silver leaped past ₹1,20,000 per kilo, driven by tariff uncertainties and safe-haven demand. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-low-tax-shampoo-tv-hybrid-car-175-items-festive-season-pm-modi-consumption-boost-2780246-2025-09-01",
      "headline": "Shampoos, TVs, hybrid cars to get cheaper as government plans GST cutThe biggest reform of the goods and services tax system in nearly a decade comes amid strained trade ties with the US, with PM Modi making repeated calls for increased use of Indian products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-defence-amca-fighter-jets-bid-project-rs-15000-crore-rajnath-singh-2780209-2025-09-01",
      "headline": "Adani Defence to join race for AMCA stealth fighter jet contractThe AMCA project is being led by the Aeronautical Development Agency (ADA), which functions under the Defence Research and Development Organisation (DRDO)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gst-collection-rises-65-percent-in-august-to-rs-186-lakh-crore-2780159-2025-09-01",
      "headline": "India's GST collection rises 6.5% in August to Rs 1.86 lakh croreGST growth was highest in Sikkim (39%), Meghalaya (35%) and Nagaland (33%). Among big states, Maharashtra, Karnataka, Tamil Nadu and UP posted 9–15% gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-clarifies-on-google-play-alert-no-issues-with-paytm-upi-2780091-2025-09-01",
      "headline": "Paytm clarifies on Google Play alert, no issues with Paytm UPIPaytm noted that this transition is part of its migration to new UPI handles after receiving approval from the National Payments Corporation of India (NPCI) to operate as a Third Party Application Provider (TPAP). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-554-points-higher-nifty-above-24600-mahindra-gains-4-percent-2780080-2025-09-01",
      "headline": "Sensex closes 554 points higher, Nifty above 24,600; Mahindra gains 4%The S&P BSE Sensex gained 554.84 points to close at 80,364.49, while the NSE Nifty50 added 198.20 points to close at 24,625.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-india-rely-on-china-for-trade-amid-trumps-50-tariff-tsunami-2780065-2025-09-01",
      "headline": "Can India rely on China to counter Trump's 50% tariff shock?With US tariffs hitting 50% and Indian exporters scrambling, turning to China may seem tempting. But the strategic and economic risks are real. But can India really rely on China as trade tensions escalate with the US after Donald Trump's tariff tsunami?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hardeep-singh-puri-russia-oil-profit-india-us-tariff-sco-meet-pm-modi-vladimir-putin-china-2780079-2025-09-01",
      "headline": "Is India profiting from Russian oil? Union Minister Hardeep Singh Puri explainsUS President Donald Trump recently announced new tariffs on exports in an effort to discourage India's oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-avoid-a-defective-itr-filing-explains-tax-expert-2780060-2025-09-01",
      "headline": "How to avoid a 'defective' ITR filing, explains tax expertFiling your income tax return is more than just declaring income and paying taxes. Missing key disclosures can make your ITR \"defective\" and even attract steep penalties, warns tax expert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-market-rising-today-sensex-up-500-points-nifty-gain-it-stocks-rally-infosys-techm-2780042-2025-09-01",
      "headline": "Sensex gains 500 points: Why is stock market rising today?The S&P BSE Sensex was up 529.17 points to 80,338.82, while the NSE Nifty50 gained 185.20 points to 24,612.05 as of 2:15 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-higher-fd-returns-these-small-finance-banks-offer-up-to-777-percent-2780012-2025-09-01",
      "headline": "Looking for higher FD returns? These small finance banks offer up to 7.77%If you're hunting for better fixed deposit returns, small finance banks are offering rates as high as 7.77%, outpacing larger lenders. Here's a look at some of the top options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-all-time-low-fall-speculative-bets-hedging-trump-tariff-pm-modi-2780011-2025-09-01",
      "headline": "Rupee falls to all-time low of 88.33 against US dollar amid tariff woesThe fall also came as investors reacted to the recent move by the United States to raise tariffs on goods, which has added to concerns over India's trade and fiscal outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-and-silver-soar-to-record-highs-should-you-buy-now-2779944-2025-09-01",
      "headline": "Gold and silver soar to record highs. Should you buy now?Gold and silver prices have surged to fresh record levels, supported by global uncertainty, Fed rate cut hopes, and a weaker dollar. With bullion shining brighter than ever, many investors are asking the same question, i.e., should you enter now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/amanta-healthcare-ipo-2025-subscription-status-gmp-review-2779924-2025-09-01",
      "headline": "Amanta Healthcare IPO kicks off with 22% GMP. Should you apply?The IPO will close on September 3, 2025, with the allotment of shares expected on September 4.  The price band for the IPO has been fixed at Rs 120 to Rs 126 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-you-should-never-invest-emergency-funds-in-stocks-mutual-funds-2779909-2025-09-01",
      "headline": "Explained: Why you should never invest emergency funds in stocks, mutual fundsEven disciplined savers can face a harsh reality if emergency funds are illiquid. Safety and immediate access are paramount and returns are secondary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-sbi-card-itr-to-lpg-price-5-big-money-rule-changes-from-september-1-2779884-2025-09-01",
      "headline": "From SBI card, ITR to LPG price: 5 big money rule changes from September 1September kicks off with fresh changes in banking, taxes, and household expenses. From SBI card rules to LPG prices and ITR deadlines, here are the five updates that could directly impact your pocket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/vikran-engineering-ipo-shares-allotment-status-out-gmp-listing-date-market-debut-2779867-2025-09-01",
      "headline": "Vikran Engineering IPO: Check allotment status, GMP and listing dateInvestors who applied for shares can check their allotment status through either the BSE website or the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-china-trade-ties-tianjin-talks-pm-modi-xi-jinping-2779831-2025-09-01",
      "headline": "How India-China trade ties have evolved over the years and why it matters nowTwo decades ago, India-China trade barely existed. In the early 2000s, the numbers were so small they hardly showed up on global trade charts. India exported raw materials like iron ore, while Chinese goods rarely made it into Indian markets. Then came the boom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-250-points-nifty-above-24500-infosys-gains-over-15-2779822-2025-09-01",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; Infosys gains over 2%The S&P BSE Sensex was up 368.48 points to 80,178.13, while the NSE Nifty50 added 112.65 points to 24,539.50 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-kundra-punjabi-film-debut-mehar-release-date-cast-2780587-2025-09-02",
      "headline": "Raj Kundra gears up for Punjabi debut film Mehar. Check out trailer, release dateRaj Kundra is making his Punjabi cinema debut with the film 'Mehar', portraying Karamjeet Singh in a heartfelt story of family and resilience. The movie, releasing on September 5, 2025, co-stars Geeta Basra in a pivotal role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/manish-malhotra-bun-tikki-saali-mohabbat-chicago-south-asian-film-festival-2025-2780573-2025-09-02",
      "headline": "Manish Malhotra's Bun Tikki, Saali Mohabbat chosen for Chicago film festivalManish Malhotra's 'Bun Tikki' and 'Saali Mohabbat' have been selected for the Chicago South Asian Film Festival 2025. The fashion icon-turned-producer celebrated the milestone on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/demon-slayer-star-takahiro-sakurai-shares-his-love-for-rajinikanth-rrr-2780527-2025-09-02",
      "headline": "Rajinikanth has a presence I can't dub, says Demon Slayer star Takahiro SakuraiJapanese voice actor Takahiro Sakurai expressed his admiration for Indian superstar Rajinikanth and praised Indian films like 'RRR' and 'Baahubali' for their global appeal. 'Demon Slayer: Infinity Castle Part 1' releases in India on September 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/film-producers-body-slams-influencers-for-extortion-over-negative-reviews-iftpc-2780531-2025-09-02",
      "headline": "Film producers' body slams influencers for extortion over negative reviewsThe Indian Film and Television Producers Council (IFTPC) has accused some social media influencers of extorting producers by demanding money to avoid negative reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-urges-mamata-banerjee-not-to-ban-the-bengal-files-2780495-2025-09-02",
      "headline": "Vivek Agnihotri urges Mamata Banerjee not to ban The Bengal FilesFilmmaker Vivek Agnihotri requested West Bengal CM Mamata Banerjee to permit the release of 'The Bengal Files' in the state. The film is slated for a theatrical release on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-indore-contestants-exits-after-missing-rs-125-lakh-question-2780532-2025-09-02",
      "headline": "KBC 17: Indore contestant exits after missing Rs 12.5 lakh question. Can you answer?In the latest episode of 'Kaun Banega Crorepati 17', an Indore-based contestant exited the show after missing Rs 12.5 lakh"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jon-batiste-india-debut-mumbai-and-delhi-november-2780507-2025-09-02",
      "headline": "Jon Batiste to make India debut in Mumbai and Delhi this NovemberJon Batiste, the globally acclaimed musician and multiple award winner, is set to perform live in India for the first time. Fans in Delhi-NCR and Mumbai can look forward to his concerts this November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-visits-lalbaugcha-raja-without-vip-praises-organisers-devotees-2780490-2025-09-02",
      "headline": "Anupam Kher visits Lalbaugcha Raja without VIP treatment, fans seem unconvincedAnupam Kher's visit to Lalbaugcha Raja without VIP privileges raises questions about equal access for common devotees as he shares his experiences on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-satyamev-jayate-helped-me-come-out-trans-actor-trinetra-haldar-2780469-2025-09-02",
      "headline": "Aamir's Satyamev Jayate helped me come out to parents: Trans actor Trinetra HaldarTrans actor Trinetra Haldar shared a heartfelt note after she met Aamir Khan recently. Haldar credited Khan's popular show 'Satyamev Jayate' for coming out to her parents. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjab-floods-diljit-dosanjh-ammy-virk-sonam-bajwa-relief-support-2780450-2025-09-02",
      "headline": "Punjab floods: Diljit Dosanjh, Ammy adopt villages, Sonam supports relief groupsActors Diljit Dosanjh, Ammy Virk and Sonam Bajwa have extended support to flood victims in Punjab. Dosanjh has adopted 10 villages, while Virk is supporting 200 families. Bajwa has donated to organisations who are actively working on the ground as rescue teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-day-8-episode-9-written-update-neelam-giri-farrhana-bhat-baseer-ali-kunickaa-sadanand-2780431-2025-09-02",
      "headline": "Bigg Boss 19 episode 9: Neelam breaks down, Farrhana clashes with Baseer, KunickaaEpisode 9 of 'Bigg Boss 19' saw Neelam Giri breaking down after a fight with Farrhana Bhatt. Tanya Mittal was confronted over the cleaning room mess. Kunickaa Sadanand was stripped of her captaincy following a vote. Also, a major fight broke out between Farrhana and Baseer Ali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-birthday-wishes-pawan-kalyan-film-political-service-2780445-2025-09-02",
      "headline": "Chiranjeevi's birthday wish to Pawan Kalyan is pure brother goals. See picMegastar Chiranjeevi shared a warm birthday wish to his brother, Pawan Kalyan, with a throwback picture. In his post, he acknowledged his contributions to cinema and politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/milap-zaveri-thanks-riteish-deshmukh-reviving-career-with-masti-4-2780451-2025-09-02",
      "headline": "Riteish Deshmukh backed me when no one did: Milap Zaveri on career comebackFilmmaker Milap Zaveri dedicated an emotional note to Ritesh Deshmukh as the actor wrapped 'Masti 4'. Zaveri credited Deshmukh for reviving his career in the industry when no one showed faith. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-box-office-sidharth-malhotra-janhvi-kapoor-film-struggles-after-weekend-2780442-2025-09-02",
      "headline": "Param Sundari box office Day 4: Monday dip hits Sidharth-Janhvi's rom-com hardSidharth Malhotra and Janhvi Kapoor's 'Param Sundari' witnessed a dip on the first Monday. The film earned Rs 28.19 crore in four days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-kalyani-priyadarshan-rs-30-crore-in-5-days-mohanlal-hridayapoorvam-underperforms-2780441-2025-09-02",
      "headline": "Lokah mints Rs 30 crore in 5 days, Mohanlal's Hridayapoorvam underperforms on MondayKalyani Priyadarshan's 'Lokah Chapter 1: Chandra' earned Rs 30 crore in five days and had a solid Monday in theatres. However, Mohanlal's 'Hridayapoorvam's' collection declined on its first Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-the-smashing-machine-venice-film-festival-emotional-ovation-2780414-2025-09-02",
      "headline": "Dwayne Johnson in tears over 15-min ovation for The Smashing Machine at Venice FestDwayne Johnson's portrayal of Mark Kerr in 'The Smashing Machine' received a 15-minute standing ovation at the Venice Film Festival, fuelling Oscar buzz. The actor and the entire team werre visibly emotional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/vijay-sethupathi-to-host-bigg-boss-tamil-9-makers-reveal-neon-logo-2780320-2025-09-01",
      "headline": "Vijay Sethupathi to host Bigg Boss Tamil 9, makers reveal neon logoAfter eight successful seasons, 'Bigg Boss Tamil' returns for its ninth edition. Actor Vijay Sethupathi will once again be at the helm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-shilpa-shetty-bollywood-celebs-extend-support-to-punjab-flood-victims-2780301-2025-09-01",
      "headline": "Sonu Sood to Shilpa Shetty, Bollywood celebs extend support to Punjab flood victimsPunjab is battling one of its worst flood crises, leaving thousands displaced and homes destroyed. Celebrities like Sonu Sood, Sanjay Dutt, Shilpa Shetty, and Himanshi Khurana have stepped forward with prayers, support, and aid for the affected families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-shares-towel-selfie-on-52nd-birthday-says-he-feels-younger-2780259-2025-09-01",
      "headline": "Ram Kapoor shares towel selfie on 52nd birthday, says he feels youngerRam Kapoor celebrated his 52nd birthday with a towel selfie. He flaunted his 50-kilo weight loss and saying he feels healthier and younger than in 25 years."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/my-dead-mother-abused-from-rjd-congress-stage-an-insult-to-nations-mothers-daughters-pm-modi-2780604-2025-09-02",
      "headline": "Nation's mothers insulted: PM tears into RJD-Congress over abuse to dead motherPrime Minister Narendra Modi on Tuesday accused the RJD and Congress of hurling expletives at him and his late mother during a rally in Bihar, calling the incident an insult to all women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-vikram-32-bit-chip-presented-to-pm-modi-at-semicon-india-2025-2780582-2025-09-02",
      "headline": "First Made-in-India chip presented to PM Modi: What is Vikram-32?The initial lot of Vikram 3201 devices was successfully validated in space during the PSLV-C60 mission, demonstrating its reliability for future space missions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-mla-harmeet-pathanmajra-escapes-punjab-police-custody-rape-charges-open-fire-on-cops-2780516-2025-09-02",
      "headline": "Rebel AAP MLA, arrested for rape, flees from custody after opening fire on copsPunjab AAP legislator Harmeet Singh Pathanmajra, arrested on rape and cheating charges, escaped police custody in Karnal after allegedly firing at officers and running over a policeman with a vehicle. Police teams are pursuing him, and a manhunt is underway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/north-india-heavy-rain-waterlogging-flood-warning-yamuna-danger-mark-forecast-deaths-flights-punjab-delhi-uttarakhand-jammu-kashmir-2780502-2025-09-02",
      "headline": "Rain paralyses north India, dozens dead, key roads flooded, houses washed awayThe water level of the River Yamuna breached the danger mark on Tuesday morning as Delhi-NCR tackled the aftermath of relentless rain with floodwaters entering people's homes. In Punjab, meanwhile, several people died in the \"worst flood in recent history\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shanghai-cooperation-organisation-sco-china-boost-trump-tariffs-quad-struggles-relevance-2780614-2025-09-02",
      "headline": "Trump has given SCO a renewed purpose. Quad stands defangedVisuals of leaders of some of the most populous and influential countries posing for photographs and engaging in candid conversations at the SCO summit in Xi Jinping's backyard were bound to rattle the US. Not too long ago, China found itself in a similar situation, fretting over the re-emergence of the Quad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pawan-khera-dual-epic-numbers-voter-ids-delhi-amit-malviya-vote-chori-charge-2780460-2025-09-02",
      "headline": "BJP's big claim against Pawan Khera after Rahul Gandhi's 'hydrogen bomb' remarkThe EPIC details shared by Amit Malviya on X show that Congress spokesperson Pawan Khera is registered as a voter in two Assembly constituencies in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-gdp-growth-challenges-economic-selfishness-pm-narendra-modi-us-president-donald-trump-tariffs-veiled-dig-2780594-2025-09-02",
      "headline": "7.8% growth despite challenges from economic selfishness: PM's veiled dig at TrumpPrime Minister Narendra Modi took a veiled dig at US President Donald Trump amid the latter's tariffs as he praised India's 7.8 per cent GDP growth in the first quarter of the current fiscal year amid challenges posed by \"economic selfishness\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manoj-jarange-maratha-quota-protest-azad-maidan-clean-up-bmc-police-notice-protesters-vacate-site-hunger-strike-2780461-2025-09-02",
      "headline": "Clean-up begins at Manoj Jarange's quota stir site in Mumbai after clear-out orderThe Bombay High Court ordered Maratha quota protestors to vacate Mumbai streets by Tuesday noon. Following this, the civic body said it conducted a \"deep cleaning\" drive at Azad Maidan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/earth-hit-by-solar-storm-blowing-at-21-lakh-kmph-from-the-sun-power-grids-on-alert-2780513-2025-09-02",
      "headline": "Solar storm blowing at 21 lakh kmph hits Earth, power grids on alertThe drama began on August 30 when solar active region AR 4199 unleashed a long-duration M2.7-class solar flare. This was quickly followed by multiple CMEs erupting in succession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-anticipatory-bail-cartoonist-hemant-malviya-objectionable-modi-cartoons-2780566-2025-09-02",
      "headline": "After apology for PM, RSS posts, Supreme Court grants cartoonist pre-arrest bailThe Supreme Court granted anticipatory bail to cartoonist Hemant Malviya accused of posting objectionable cartoons of PM Modi. The bail is conditional on his cooperation with the police probe and reflects judicial concern over social media misuse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-in-trade-talks-with-us-says-piyush-goyal-day-after-modi-meets-xi-putin-sco-summit-tianjin-china-trump-tariffs-2780601-2025-09-02",
      "headline": "India in trade talks with US, says Piyush Goyal day after Modi meets Xi, PutinCommerce Minister Piyush Goyal on Tuesday said India is holding talks with the United States on a bilateral trade agreement, days after President Donald Trump doubled tariffs on Indian goods over New Delhi's continued imports of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-floods-rain-hoshiarpur-aap-bhagwant-mann-pm-modi-relief-rescue-funds-2780436-2025-09-02",
      "headline": "Punjab floods may worsen: Bhagwant Mann as 29 dead, thousands lose homes in a weekPunjab Flood: Fresh rains on Monday worsened flooding in already affected areas in Punjab. Such was the severity of the crisis that PM Modi, on his return from China, called up Bhagwant Mann to take stock of the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-sco-summit-china-president-xi-russia-vladimir-putin-multipolarism-trump-tariff-unipolar-stance-explained-2779993-2025-09-02",
      "headline": "Is Trump chaos giving birth to a new world order?PM Modi's jovial photo with Russian President Vladimir Putin and Chinese leader Xi Jinping at the SCO summit signals a deeper geopolitical shift. India's assertion of its strategic autonomy amid Trump tariffs finds resonance in China and Russia pushing back against US bullying. This is possibly leading to a new world order."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/dharmasthala-mass-burial-claims-ed-case-whistleblower-karnataka-foreign-funding-2780570-2025-09-02",
      "headline": "ED to probe alleged Dharmasthala conspiracy, NGOs under foreign funds scannerThe Enforcement Directorate is set to probe the Dharmasthala mass burial case after receiving documents from police. The focus is on NGOs Odanadi and Samvada for alleged foreign funding violations. Banks have been asked to share account details and transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-makes-some-iphones-vintage-ahead-of-iphone-17-launch-heres-what-it-means-for-you-2780528-2025-09-02",
      "headline": "Apple makes some iPhones vintage ahead of iPhone 17 launch, what it meansApple has added a handful of iPhones to its vintage list before the launch of the iPhone 17 series on September 9. Let's understand what this really means."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/google-pixel-10-pro-xl-review-smarter-faster-and-better-cameras-2780526-2025-09-02",
      "headline": "Google Pixel 10 Pro XL review: Smarter, faster, and better camerasLast year I loved the Google Pixel phones because they marked a major step forward. This year the Pixel 10 Pro XL is an evolutionary update, but it brings enough of the new stuff — largely its Tensor G5 chipset and AI features — to retain top spot in the list of best Android phones.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/collagen-supplements-no-quick-fix-for-anti-ageing-but-pure-marketing-expert-2780560-2025-09-02",
      "headline": "Collagen supplements no quick fix for anti-ageing but pure marketing: ExpertCollagen isn't found in a jar or a scoop alone. It's built every day through what you eat, how you live, and how well you protect your skin. Here is what the dermatologist tells us."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/scott-bessent-backs-us-india-ties-hits-russian-oil-trade-glbs-2780400-2025-09-02",
      "headline": "India a bad actor: Trump aide fumes over oil buys, calls SCO meet 'performative'Treasury Secretary Scott Bessent, addressing the state of bilateral ties, downplayed concerns about Prime Minister Narendra Modi's participation in a recent meeting with Russian President Vladimir Putin and Chinese President Xi Jinping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-woman-spots-missing-husband-on-instagram-reel-finds-out-he-has-another-wife-2780437-2025-09-02",
      "headline": "UP woman spots missing husband on Instagram reel, finds out he has another wifeA woman in UP found her husband, who had been missing for 7 years, in an Instagram reel with another woman. The man had staged his disappearance and married someone else."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/flood-fears-grip-delhi-as-yamuna-swells-gurugram-shuts-schools-offices-2780415-2025-09-02",
      "headline": "Floodwaters enter Delhi homes as Yamuna swells; Gurugram shuts schools, officesDelhi faces a deepening flood threat as the Yamuna river crossed the danger mark of 205.33 metres early Tuesday, with officials warning levels could touch 206.50 metres by evening. Meanwhile, Gurugram was pounded by over 100 mm of rain in just four hours on Monday, leaving key stretches such as Hero Honda Chowk and the Dwarka Expressway waterlogged."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-sikanderpur-rapid-metro-passenger-video-chaos-suffocating-crowd-after-heavy-rain-delhi-2780522-2025-09-02",
      "headline": "Suffocating crowd at Gurugram Rapid Metro after heavy rain, passenger shares videoThe video showed massive queues and commotion as passengers struggled to board trains at Gurugram's Sikanderpur Rapid Metro station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-manipur-visit-september-13-ethnic-violence-mizoram-trip-bjp-2780464-2025-09-02",
      "headline": "PM likely to visit Mizoram, violence-hit Manipur in second week of SeptemberThe Prime Minister will inaugurate development projects in Mizoram and will then be visiting Manipur for the first time since the ethnic violence in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-ai-quarter-finals-win-alexander-bublik-2780417-2025-09-02",
      "headline": "AI-like Sinner decimates Bublik to leave Kazakh stunned: This is insaneDefending US Open champion Jannik Sinner extended his dominant run at hardcourt Grand Slams with a commanding 6-1, 6-1, 6-1 victory over Kazakhstan's 23rd seed Alexander Bublik. The Kazakh was blown away by the World No. 1's ruthless show in the fourth-round match on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nestle-fires-ceo-over-workplace-relationship-appoints-successor-glbs-2780395-2025-09-02",
      "headline": "Nestlé fires CEO over workplace relationship, appoints successorNestle has dismissed CEO Laurent Freixe for an undisclosed relationship with a subordinate, appointing longtime executive Philipp Navratil as successor. Chairman Paul Bulcke called the move necessary."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-daily-digest-india-make-it-3-out-of-3-as-forwards-finally-click-2780595-2025-09-02",
      "headline": "Hockey Asia Cup daily digest: India make it 3 out of 3 as forwards finally clickIndia produced a statement performance to dismantle Kazakhstan 15-0 to end the pool phase with a 100 percent win record. Ahead of the crucial Super 4s stage, the Indian forwards finally found their groove with field goals finally coming for the hosts in Rajgir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-retires-shubman-gill-joe-root-avoid-no-3-old-school-test-batting-2780574-2025-09-02",
      "headline": "Shubman Gill, Joe Root are reluctant to bat at No. 3, says Nasser HussainNasser Hussain stated that with Cheteshwar Pujara's retirement, the game has lost a one-of-a-kind old-school batter. He added that Shubman Gill and Joe Root are reluctant to take on the challenging No. 3 position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-floods-shubman-gill-mourns-victims-stars-aid-relief-2780559-2025-09-02",
      "headline": "Shubman Gill heartbroken by devastation in Punjab due to floods: We will rise upShubman Gill took to social media to mourn the loss of lives and devastation due to floods in Punjab. The Test captain is in Bengaluru, preparing for Asia Cup 2025, starting September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/naomi-osaka-us-open-coco-gauff-2780536-2025-09-02",
      "headline": "Teary-eyed Osaka recalls watching Gauff post-birth, now beats her at US OpenNaomi Osaka reached the US Open quarterfinals with a straight-sets win over Coco Gauff. After the match, she recalled how she had watched Gauff from the stands after giving birth to her child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-batter-asif-ali-retires-international-cricket-at-33-2780525-2025-09-02",
      "headline": "Out-of-favour Pakistan batter Asif Ali retires from international cricket at 33Pakistan middle-order batsman Asif Ali has confirmed that he will continue playing domestic cricket but has decided to retire from international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/maninder-singh-on-kuldeep-yadav-shreyas-iyer-shubman-gill-asia-cup-2780294-2025-09-02",
      "headline": "Kuldeep's absence felt in England, may get benched again in Asia Cup: ManinderFormer India spinner Maninder Singh feels Kuldeep Yadav is likely to be benched again by the team management in the Asia Cup 2025. The 60-year-old backed Varun Chakravarthy to be India's X-factor in the tournament, starting September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-sweaty-towels-us-open-souvenir-2780500-2025-09-02",
      "headline": "People want your sweaty towels? Iga Swiatek handles 'dumb' question at US OpenUS Open 2025: As she spoke about the furore over a Polish CEO snatching a signed cap from a child at Flushing Meadows, Iga Swiatek was asked by a reporter if she thought it odd that fans might want her sweaty towels as souvenirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-out-india-new-zealand-series-virat-rohit-back-injury-2780484-2025-09-02",
      "headline": "Cummins to miss Virat Kohli, Rohit Sharma's comeback series due to back injuryAustralia's ODI captain Pat Cummins will miss India's much-anticipated white-ball series, which marks the return of Virat Kohli and Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/karolina-muchova-us-open-ex-boyfriend-tears-reveals-reason-2780454-2025-09-02",
      "headline": "Ex-boyfriend in the crowd: Tennis star reveals why she broke down in tearsUS Open 2025: 11th seed Karolína Muchová has explained why she broke down in tears during her second-round match last week. The Czech star revealed that she had spotted her ex-boyfriend in the stands. Muchova will now face Naomi Osaka on Wednesday for a place in the semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-craig-mcmillan-assistant-coach-women-world-cup-2024-2780444-2025-09-02",
      "headline": "New Zealand name Craig McMillan full-time assistant for Women's World CupFormer New Zealand batter Craig McMillan has been confirmed as the full-time assistant coach of the White Ferns after signing a new deal ahead of the ICC Women's ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-t20i-retirement-explains-call-odi-world-cup-india-tour-2780438-2025-09-02",
      "headline": "Starc explains big retirement call, targets India tour and World Cup in 2027Mitchell Starc retired from T20 internationals, five months before the T20 World Cup in India and Sri Lanka. The 35-year-old fast bowler reiterated his commitment to playing Tests and one-dayers for Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-sweaty-towels-us-open-souvenir-2780500-2025-09-02",
      "headline": "People want your sweaty towels? Iga Swiatek handles 'dumb' question at US OpenUS Open 2025: As she spoke about the furore over a Polish CEO snatching a signed cap from a child at Flushing Meadows, Iga Swiatek was asked by a reporter if she thought it odd that fans might want her sweaty towels as souvenirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-out-india-new-zealand-series-virat-rohit-back-injury-2780484-2025-09-02",
      "headline": "Cummins to miss Virat Kohli, Rohit Sharma's comeback series due to back injuryAustralia's ODI captain Pat Cummins will miss India's much-anticipated white-ball series, which marks the return of Virat Kohli and Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/karolina-muchova-us-open-ex-boyfriend-tears-reveals-reason-2780454-2025-09-02",
      "headline": "Ex-boyfriend in the crowd: Tennis star reveals why she broke down in tearsUS Open 2025: 11th seed Karolína Muchová has explained why she broke down in tears during her second-round match last week. The Czech star revealed that she had spotted her ex-boyfriend in the stands. Muchova will now face Naomi Osaka on Wednesday for a place in the semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-craig-mcmillan-assistant-coach-women-world-cup-2024-2780444-2025-09-02",
      "headline": "New Zealand name Craig McMillan full-time assistant for Women's World CupFormer New Zealand batter Craig McMillan has been confirmed as the full-time assistant coach of the White Ferns after signing a new deal ahead of the ICC Women's ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-t20i-retirement-explains-call-odi-world-cup-india-tour-2780438-2025-09-02",
      "headline": "Starc explains big retirement call, targets India tour and World Cup in 2027Mitchell Starc retired from T20 internationals, five months before the T20 World Cup in India and Sri Lanka. The 35-year-old fast bowler reiterated his commitment to playing Tests and one-dayers for Australia. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}