{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-nears-full-profitability-revenue-grows-to-rs-1911-crore-2720453-2025-05-06",
      "headline": "Paytm nears full profitability; revenue grows to Rs 1,911 crorePaytm's revenue increased by 5% quarter-on-quarter, reaching Rs 1,911 crore, reflecting the company's steady performance and continued momentum in its core businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-a-personal-loan-unlock-rs-5-lakh-instantly-using-just-your-pan-card-2720405-2025-05-06",
      "headline": "Need a personal loan? Unlock Rs 5 lakh instantly using just your PAN cardTo apply online, you simply visit the bank or lender's website and fill out the application form. You'll need to provide your name, date of birth, mobile number, and PAN number."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-156-points-lower-nifty-below-24400-adani-enterprises-falls-4-2720369-2025-05-06",
      "headline": "Sensex ends 156 points lower, Nifty below 24,400; Adani Enterprises falls 4%The BSE Sensex ended 155.77 points lower at 80,641.07, while the NSE Nifty50 fell 81.55 points to settle at 24,379.60. Most of the broader market indices also declined during the trading session due to high selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-denies-reports-of-stake-sale-to-japans-smbc-calls-it-speculative-2720360-2025-05-06",
      "headline": "Yes Bank denies reports of stake sale to Japan's SMBC, calls it 'speculative'The private sector lender clarified that while it regularly explores business opportunities, there is nothing material to disclose under current regulatory norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saying-yes-to-a-joint-loan-here-is-how-it-can-affect-your-credit-score-2720344-2025-05-06",
      "headline": "Saying yes to a joint loan? Here's how it can affect your credit scoreEvery time an EMI is paid on time, it reflects positively on both borrowers' credit profiles. Over time, this builds your credit score. If you were added as a co-applicant to help someone get a loan because your own score was low, this is your chance to improve it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-5-common-mistakes-you-must-avoid-while-filing-your-tax-returns-2720287-2025-05-06",
      "headline": "ITR filing 2025: 5 common mistakes you must avoid while filing your tax returnsUsing the wrong ITR form can delay your tax processing or, worse, your return may get rejected. Also, filing your ITR is not the final step, you must also verify it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-the-global-economy-breathing-easier-as-trump-eases-up-on-tariffs-2720249-2025-05-06",
      "headline": "Is the worst over for global economy as Trump eases stance on tariffs?Even as Trump suggests deals are near with countries like India, Japan, and South Korea, and China reviews a fresh proposal from Washington, the global economy isn't breathing easy yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opted-for-new-tax-regime-here-is-a-look-at-key-benefits-what-you-can-claim-itr-filing-2720230-2025-05-06",
      "headline": "Opted for new tax regime? Here's a look at key benefits, what you can claimThe government brought in the new tax regime to make things simpler for taxpayers. It gives you more tax slabs with lower rates, which means you may end up paying less tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-gives-up-listing-gains-slides-4-after-weak-debut-hold-or-sell-2720209-2025-05-06",
      "headline": "Ather Energy gives up listing gains, slides 4% after weak debut. Hold or sell?Ather Energy's stock opened at Rs 328 on the NSE, up 2.2% over its issue price of Rs 321, but slipped over 4% to an intraday low of Rs 308.95 amid weak market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-today-know-why-sensex-nifty-falling-2720190-2025-05-06",
      "headline": "Sensex down over 200 points. Why is the stock market down today?As of 10:48 am, the BSE Sensex was down 213.43 points at 80,583.41, while the NSE Nifty50 slipped 72.40 points to 24,388.75. Broader indices saw sharper cuts, with the Nifty midcap and smallcap indices falling around 1% each, reflecting risk-off sentiment in domestic-focused sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-makes-lukewarm-market-debut-lists-just-2-percent-above-ipo-price-2720179-2025-05-06",
      "headline": "Ather Energy makes muted debut on Dalal Street, lists 2% above IPO priceAt the time of listing, the Bengaluru-based company was valued at around Rs 12,144 crore, slightly below its implied market capitalisation of Rs 12,300 crore at the upper end of the IPO price band (Rs 304–Rs 321)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/japans-smbc-likely-in-advanced-talks-to-buy-majority-stake-in-yes-bank-share-price-market-reaction-2720169-2025-05-06",
      "headline": "Explained: Why Yes Bank shares are rising todayYes Bank shares rose sharply as shareholders reacted positively to the news. At around 9:43 am, shares of the bank were trading 5.30% higher at Rs 18.69."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/why-taylor-swift-and-travis-kelce-skipped-the-2025-met-gala-glbs-2720695-2025-05-07",
      "headline": "Why Taylor Swift and Travis Kelce Skipped the 2025 Met GalaTaylor Swift and Travis Kelce skipped the 2025 Met Gala due to vacation plans. The couple prioritized downtime post-tour and NFL season over fashion's biggest night, despite growing anticipation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rihanna-and-ciara-end-14-year-feud-at-2025-met-gala-with-heartfelt-reunion-glbs-2720664-2025-05-07",
      "headline": "Rihanna and Ciara end 14-year feud at 2025 Met Gala with heartfelt reunion Rihanna and Ciara ended their 14-year feud with a warm reunion at the 2025 Met Gala. The pop stars bonded over motherhood and fashion, celebrating Rihanna's third pregnancy.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a24-taps-alex-garland-for-dark-fantasy-elden-ring-film-adaptation-glbs-2720651-2025-05-07",
      "headline": "A24 taps Alex Garland for dark fantasy Elden Ring film adaptationAlex Garland will direct a live-action Elden Ring film for A24, adapting the acclaimed fantasy RPG. Production is slated for 2026, marking Garland's next major cinematic project.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/adam-lambert-to-star-as-judas-in-jesus-christ-superstar-at-hollywood-bowl-glbs-2720645-2025-05-07",
      "headline": "Adam Lambert to star as Judas in Jesus Christ superstar at Hollywood BowlAdam Lambert will star as Judas alongside Cynthia Erivo as Jesus in Jesus Christ Superstar at the Hollywood Bowl. The three-night production promises a bold, rock-infused theatrical experience.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-anistons-bel-air-home-hit-by-car-in-gate-crash-incident-glbs-2720638-2025-05-07",
      "headline": "Jennifer Aniston's Bel Air home hit by car in gate crash incidentA man was arrested after deliberately ramming his car into Jennifer Aniston's Bel Air home gate. No injuries occurred, and the motive remains under investigation, police confirmed on Tuesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-shine-at-met-gala-2025-after-party-2720541-2025-05-06",
      "headline": "Priyanka Chopra shines in diamond dress at Met Gala after-party with Nick JonasPriyanka Chopra dazzled in a diamond-studded mini dress at the Met Gala 2025 after-party, stealing the spotlight once again. Alongside husband Nick Jonas, the couple's stylish appearances became the talk of the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/100-days-to-go-rajinikanths-coolie-countdown-begins-2720544-2025-05-06",
      "headline": "100 days to go: Rajinikanth's Coolie countdown beginsThe makers of Rajinikanth-starrer 'Coolie' have released a new promo 100 days ahead of the release of Lokesh Kanagaraj's high-octane action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tony-kakkar-shaan-support-sonu-nigam-bengaluru-concert-row-2720536-2025-05-06",
      "headline": "Tony Kakkar, Shaan extend support to Sonu Nigam after Bengaluru concert rowSinger Tony Kakkar and Shaan defended Sonu Nigam after he received backlash, and a police complaint, over his remarks at a Bengaluru concert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-reacts-to-melbourne-concert-controversy-days-after-organisers-claim-2720504-2025-05-06",
      "headline": "Neha Kakkar reacts to Melbourne concert controversy days after organiser's claimNeha Kakkar has responded to allegations that she skipped her Melbourne concert due to low turnout, sharing a video of a lively performance to counter the claims. The controversy continues as event organisers alleged she refused to perform because of the crowd size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthik-subbaraj-on-his-next-after-retro-want-to-make-an-indie-film-2720434-2025-05-06",
      "headline": "Karthik Subbaraj on his next after Retro: Want to make an indie filmAfter directing high-budget films like 'Retro,' director Karthik Subbaraj has revealed his plans to direct an indie film, a low-budget project featuring new artists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wanted-historic-rs-21000-crore-necklace-for-met-gala-2025-but-was-denied-2720440-2025-05-06",
      "headline": "Bling denied: Why Diljit Dosanjh didn't wear Rs 21,000 crore necklace to Met GalaDiljit Dosanjh made a powerful Met Gala debut in a regal Prabal Gurung outfit inspired by the Maharaja of Patiala. His team's attempt to borrow the Maharaja's iconic Rs 21,000 crore Cartier necklace was denied, leading them to commission custom jewellery instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/explained-donald-trump-100-per-cent-tariff-on-foreign-films-and-what-it-means-for-indian-cinema-2720474-2025-05-06",
      "headline": "Trump's 100% tariff on foreign films, and what it means for Indian CinemaWill the Indian film industry be impacted by Donald Trump's policy involving a 100 per cent tariff on foreign films in the US? We spoke to the industry experts to understand the US President's decision, and the respective action to be taken. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/baeksang-arts-awards-korea-when-life-gives-you-tangerines-sweep-trophies-park-bo-gum-iu-lose-2720466-2025-05-06",
      "headline": "When Life Gives You Tangerines sweep Baeksang Awards, but Park Bo-gum, IU loseSouth Korea's prestigious event, the Baeksang Arts Awards, was held on May 5. While 'When Life Gives You Tangerines' secured awards across several categories, its lead actors Park Bo-gum and IU missed out on individual accolades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/controversy-vinay-pathak-accused-plagiarism-gram-chikitsalay-kolkata-filmmaker-2720407-2025-05-06",
      "headline": "Vinay Pathak accused of plagiarising Kolkata director's work in Gram ChikitsalayPrime Video's 'Gram Chikitsalay' faces plagiarism allegations before its release. The TVF series, featuring Vinay Pathak and Amol Parashar, is set to premiere on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-vaidya-slams-virat-kohli-fans-after-getting-blocked-by-the-cricketer-2720401-2025-05-06",
      "headline": "Singer Rahul Vaidya slams Virat Kohli fans after getting blocked by cricketerVirat Kohli's accidental like on Avneet Kaur's Instagram post sparked online buzz, leading him to issue a clarification. Singer Rahul Vaidya mocked the explanation, joking about Instagram glitches and revealing he was blocked by Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/summer-2025-and-south-cinema-a-season-of-surprises-or-a-wasted-opportunity-2720361-2025-05-06",
      "headline": "Summer 2025 and South cinema: A season of surprises or a wasted opportunity?With some surprise hits and notable missteps, the summer of 2025 raises a crucial point. Southern cinema has either capitalised on its potential or missed a golden opportunity to redefine the season's power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-skips-priyanka-chopra-not-shah-rukh-khan-diljit-dosanjh-kiara-advani-in-stories-about-indians-at-met-gala-2025-2720283-2025-05-06",
      "headline": "Karan Johar is all praise for Indian celebs at Met Gala 2025, except for PriyankaFilmmaker Karan Johar reviewed the Met Gala 2025 looks of Indian celebrities. He mentioned everyone from Shah Rukh Khan to Diljit Dosanjh and Kiara Advani, but Priyanka Chopra wasn't to be found on his list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-suriya-retro-director-karthik-subbaraj-overwhelmed-2720284-2025-05-06",
      "headline": "Rajinikanth watches Suriya's Retro, director Karthik Subbaraj is overwhelmedSuperstar Rajinikanth recently watched Suriya's 'Retro' and appreciated director Karthik Subbaraj. The filmmaker expressed his happiness with a special note on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pawandeep-rajan-health-update-multiple-fractures-under-observation-in-icu-2720279-2025-05-06",
      "headline": "Pawandeep Rajan suffered multiple fractures, in ICU and recovering: Singer's teamIndian Idol 12 winner Pawandeep Rajan met with a major accident on May 5 and is currently undergoing treatment in Noida. His team has provided an update on his health, assuring fans that he is doing fine now and is under observation in the ICU."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-strikes-pak-terror-camps-pok-kashmir-first-visuals-2720683-2025-05-07",
      "headline": "Explosion, blackout in first visuals after India strikes terror camps in PakIndia's strikes on the terror camps came in retaliation against the deadly terror attack in Pahalgam that claimed 26 lives. First visuals from after the attack captured explosions, blackouts and rescue work in Pakistan-occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-why-name-india-strikes-pakistan-war-terror-camps-pahalgam-attack-indian-army-explained-2720675-2025-05-07",
      "headline": "Operation Sindoor: In the name is India's message, both humane and heroicIndia hit terror targets in Pakistan and Pakistan-occupied Kashmir (POK) in pre-dawn strikes on Wednesday. It named it Operation Sindoor. Not just the strikes, even the name of the mission is supposed to convey a message to the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-flights-operations-airport-shut-amritsar-jammu-srinagar-dharamshala-2720677-2025-05-07",
      "headline": "Several airports shut, flights affected after India's strikes on Pak terror campsFollowing India's retaliatory strikes on terror targets in Pakistan and POK, flight operations at five northern airports have been suspended, triggering widespread travel disruptions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rafale-jets-pak-terror-camps-operation-sindoor-pahalgam-attack-retaliation-2720674-2025-05-07",
      "headline": "Rafale jets hit Pak terror camps with Scalp missiles, Hammer bombs: SourcesIndia, as part of Operation Sindoor, used Rafale jets to hit Pakistani terror camps with scalp missiles and hammer bombs, as per sources."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-india-hit-bahawalpur-pakistan-operation-sindoor-masood-azhar-jaish-e-mohammed-2720676-2025-05-07",
      "headline": "Why was Bahawalpur hit? Its link with Masood Azhar and JaishThe main targets of the strikes, called Operation Sindoor, were the jihadist structures of Jaish-e-Mohammed and Lashkar-e-Taiba, the two terror organisations responsible for major attacks in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-why-muridke-hit-link-hafiz-saeed-lashkar-2720696-2025-05-07",
      "headline": "Why Muridke was hit; its link with Hafiz Saeed and LashkarAs part of Operation Sindoor, India targeted the jihadist structures of Jaish-e-Mohammed (JeM) and Lashkar-e-Toiba. Located about 33 km from Lahore on the historic Grand Trunk Road, Muridke hosts the headquarters of the Lashkar-e-Toiba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nsa-ajit-doval-marco-rubio-us-secretary-of-state-operation-sindoor-2720673-2025-05-07",
      "headline": "No Pak civilians hit, only terror targeted: India briefs US on retaliatory strikesNational Security Advisor Ajit Doval spoke with US Secretary of State Marco Rubio, and told him that no Pakistani civilian, economic or military targets were hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-india-strikes-terror-camps-pakistan-pok-will-retaliate-2720649-2025-05-07",
      "headline": "Pakistan threatens response 'at time of its choosing' after Indian strikesPakistan has vowed to retaliate after India's airstrikes on Kotli, Bahawalpur, and Muzaffarabad. ISPR DG Lt Gen Ahmed Sharif Chaudhry condemned the strikes, calling them a \"cowardly attack\" and confirmed Pakistan's response at a time and place of its choosing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-strikes-terror-camps-in-pakistan-in-response-to-pahalgam-attack-what-we-know-so-far-2720652-2025-05-07",
      "headline": "India strikes 9 terror camps in Pakistan, POK: What we know so farIn response to the attack in Pahalgam which claimed 26 lives, the Indian Armed Forces conducted precision strikes post midnight on terrorist infrastructure in Pakistan and Pakistan-Occupied Kashmir (POK)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-operation-sindoor-indias-strikes-on-pak-terror-camps-to-retaliate-jk-attack-2720667-2025-05-07",
      "headline": "What is Operation Sindoor? India's strikes on Pak terror camps to retaliate J&K attackUnder Operation Sindoor, the Indian Army and Air Force used precision strike weapons to hit terror camps in Pakistan and POK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-strikes-terror-camps-pakistan-rajnath-singh-yogi-adityanath-hail-army-2720659-2025-05-07",
      "headline": "Bharat Mata Ki Jai: Leaders hail Army after strikes on terror camps in PakistanIndia carried out precision strikes on terror camps in Pakistan and Pakistan Occupied Kashmir post midnight on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/first-visual-proof-airstrike-in-pakistan-hafiz-saeed-linked-mosque-hit-2720687-2025-05-07",
      "headline": "First visual proof of airstrike in Pakistan, Hafiz Saeed-linked mosque hitIndia Today reveals the first visual evidence of India's airstrike on Pakistan, showing a mosque linked to Hafiz Saeed in Muridke. The attack targeted nine locations across the border using Rafale jets with Scalp cruise missiles and Hammer precision guided munitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-marco-rubio-after-india-strikes-9-terror-camps-in-pakistan-2720701-2025-05-07",
      "headline": "Hope this ends soon: Marco Rubio as India launches Operation Sindoor against PakIndian armed forces early on Wednesday carried out missile strikes on nine terror targets in Pakistan and Pakistan-Occupied Kashmir, including in Bahawalpur, a stronghold of the banned Jaish-e-Mohammed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-joint-indian-army-air-force-precision-weapons-pakistan-terror-camps-agency-ani-2720665-2025-05-07",
      "headline": "Operation Sindoor an Army-Air Force op, used precision weapons: ReportOperation Sindoor is a joint Army-Air Force op, news agency ANI reported on Wednesday, after India struck terror camps in Pakistan in POK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/old-images-false-claims-minutes-after-indian-airstrikes-pak-spreads-misinformation-glbs-2720672-2025-05-07",
      "headline": "Old images, false claims: Minutes after Indian airstrikes, Pak spins fake narrativesDespite no official confirmation, Pakistani media outlets are spreading false claims of downed Indian jets and circulating fake images of airstrikes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-video-striking-pakistan-terror-camps-operation-sindoor-2720660-2025-05-07",
      "headline": "Ready to strike: Army's video as it struck Pakistan terror campsThe precision missile attacks, named Operation Sindoor, were carried out on nine terror targets, including in Punjab's Bhawalpur, the stronghold of Jaish-e-Mohammad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/after-india-strikes-pak-new-york-times-drops-militants-for-terrorists-in-headline-glbs-2720693-2025-05-07",
      "headline": "After India strikes Pak, New York Times drops 'militants' for 'terrorists' in headlineAfter India's cross-border strikes, The New York Times shifted its tone, calling Pakistan-based attackers \"terrorists\" in a headline. This comes after facing backlash for earlier referring to the Pahalgam attackers as \"militants.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-ministry-of-defence-releases-full-statement-as-india-strikes-terror-camps-in-pak-glbs-2720650-2025-05-07",
      "headline": "India attacks 9 terror camps in Pak, POK: Read Army full statement on Operation SindoorIndia launched Operation Sindoor, conducting precise airstrikes on nine terror-linked sites in Pakistan and PoK in response to the Pahalgam attack, targeting militant infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-reaches-out-to-top-global-leaders-to-set-the-global-narrative-operation-sindoor-pakistan-war-2720708-2025-05-07",
      "headline": "With swift strike, India prevents Pak from hijacking narrativeWithin an hour of the strikes on terror camps in Pakistan and Pakistan-occupied Kashmir (POK), India's diplomatic machinery was working in full swing — reaching out to major global partners, in a bid to prevent Pakistan from hijacking the narrative by playing victim. While India highlighted its measured response, Pakistan started belting out lies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/longest-papal-election-in-church-history-lasted-1006-days-from-1268-to-1271-2720625-2025-05-07",
      "headline": "The longest papal election in Church history lasted 1,006 days, from 1268 to 1271The longest papal election in the history of the Church took place from 1268 to 1271 CE. It involved a clash between two powerful factions, and even the ordinary people became part of the unfolding drama. Here's a glimpse into that historic episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/india-strikes-pakistani-terrorist-sites-locals-react-from-border-area-2720700-2025-05-07",
      "headline": "Locals react from border area after India strikes Pak terrorist sitesIndia conducted strikes on nine terrorist sites in Pakistan. The action comes in response to the terrorist attack in Pahalgam. Residents near the border describe hearing sounds around 2:30 am, expressing support for the Indian Army's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/do-not-escalate-india-message-to-pakistan-after-cross-border-strikes-operation-sindoor-pahalgam-terror-attack-war-2720711-2025-05-07",
      "headline": "Do not escalate: India's message to Pakistan after cross-border strikesIndia promised to act against the perpetrators of the Pahalgam massacre, and it fulfilled that with pre-dawn, cross-border strikes on Wednesday. However, it sent out a message that it targeted only terror, and not military, infrastructure, in a cautionary note to Pakistan against any escalation of the confrontation. India, however, has been preparing for all eventualities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/why-taylor-swift-and-travis-kelce-skipped-the-2025-met-gala-glbs-2720695-2025-05-07",
      "headline": "Why Taylor Swift and Travis Kelce Skipped the 2025 Met GalaTaylor Swift and Travis Kelce skipped the 2025 Met Gala due to vacation plans. The couple prioritized downtime post-tour and NFL season over fashion's biggest night, despite growing anticipation.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-inter-milan-vs-barcelona-semifinal-report-score-san-siro-2720671-2025-05-07",
      "headline": "Champions League: Inter Milan break Barcelona hearts in thriller, reach finalInter Milan reached the Champions League final after a dramatic 4-3 extra-time win over Barcelona, in the semi-final second leg at San Siro. Late goals from Francesco Acerbi and Davide Frattesi completed Inter's comeback on a night of high drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-match-report-rain-effected-playoffs-hopes-mumbai-2720640-2025-05-07",
      "headline": "IPL 2025: GT win rain-affected thriller to hurt MI's playoff hopesIn a rain-curtailed thriller at Wankhede, Gujarat Titans edged past Mumbai Indians via DLS, snapping MI's winning streak. Despite GT's top-order brilliance, it was Rahul Tewatia and Gerald Coetzee who sealed the tense final-over win under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-squad-selection-update-devajit-saikia-bcci-2720601-2025-05-06",
      "headline": "Rohit Sharma, Virat Kohli for England Tests? BCCI secretary shares selection updateIndia tour of England: The squad for the five-Test series in England is set to be announced before the final of IPL 2025, BCCI secretary Devajit Saikia said. The five-Test series will get underway from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-jos-buttler-run-out-ms-dhoni-style-corbin-bosch-2720599-2025-05-06",
      "headline": "Jos Buttler emulates MS Dhoni with sensational run-out in MI vs GTIPL 2025: Jos Buttler stunned fans with a Dhoni-style no-look run out against MI, showcasing his exceptional wicketkeeping skills and adding yet another highlight to a standout IPL 2025 campaign with the Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-rashid-khan-surgery-wankhede-stadium-mumbai-2720591-2025-05-06",
      "headline": "MI vs GT: Rashid Khan says he is still at 75 percent after fine spellGT spinner Rashid Khan says he is still at 75 percent after a fine spell against MI on Tuesday, May 6. Rashid had struggled to find his rhythm in the early part of the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-csk-ms-dhoni-fitness-training-eric-simons-update-2720586-2025-05-06",
      "headline": "IPL 2025 KKR vs CSK: MS Dhoni skips practice, but will play in Kolkata, says bowling coachIPL 2025, KKR vs CSK: Captain MS Dhoni will play Wednesday's game against Kolkata Knight Riders, confirmed Chennai Super Kings bowling coach Eric Simons. Dhoni did not train in the lead-up to the much-awaited game in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-rohit-sharma-left-arm-pace-trap-arshad-khan-2720565-2025-05-06",
      "headline": "Rohit Sharma flops in Mumbai as Gujarat Titans' left-arm pace plan worksIPL 2025, MI vs GT: Gujarat Titans were rewarded for their tactical move to bring in Arshad Khan for their game in Mumbai. The left-arm pacer dismissed Rohit Sharma cheaply in the powerplay on Tuesday, May 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-uncapped-player-rule-sunil-gavaskar-2720558-2025-05-06",
      "headline": "Sunil Gavaskar wants change in rule that accommodated Dhoni as uncapped playerSunil Gavaskar wants a change to the IPL rule that allowed MS Dhoni to be retained as an uncapped player by CSK ahead of the IPL 2025 auction. Dhoni was retained by Chennai for Rs. 4 Crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-arun-dhumal-interview-94-matches-pahalgam-attack-2720551-2025-05-06",
      "headline": "94 matches in an IPL season? Chairman Arun Dhumal confirms plans for league expansionIPL 2025: Speaking to India Today, Indian Premier League chairman Arun Dhumal said the BCCI will continue to follow the government's directives on cricket ties with Pakistan. He also confirmed that the BCCI is looking to expand the IPL to 94 matches by the 2028 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-future-gautam-gambhir-india-tour-of-england-2720547-2025-05-06",
      "headline": "Gautam Gambhir breaks silence on Virat Kohli, Rohit Sharma Test futuresIndia coach Gautam Gambhir has broken the silence on Rohit Sharma and Virat Kohli's Test futures ahead of the tour of England. Rohit and Kohli's futures has been under the scanner since the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-chairman-exclusive-interview-2720538-2025-05-06",
      "headline": "Nation first: IPL chief Arun Dhumal on cricket amid rising India-Pakistan tensionIPL chairman Arun Dhumal reaffirmed that Indian cricket will follow the government's lead on ties with Pakistan, emphasising \"nation first\" amid rising tensions in the aftermath of the Pahalgam attack. He also confirmed plans to expand the IPL to a 94-match season by 2028 while celebrating the emergence of new Indian talent in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-rohit-sharma-left-arm-pace-trap-arshad-khan-2720565-2025-05-06",
      "headline": "Rohit Sharma flops in Mumbai as Gujarat Titans' left-arm pace plan worksIPL 2025, MI vs GT: Gujarat Titans were rewarded for their tactical move to bring in Arshad Khan for their game in Mumbai. The left-arm pacer dismissed Rohit Sharma cheaply in the powerplay on Tuesday, May 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-uncapped-player-rule-sunil-gavaskar-2720558-2025-05-06",
      "headline": "Sunil Gavaskar wants change in rule that accommodated Dhoni as uncapped playerSunil Gavaskar wants a change to the IPL rule that allowed MS Dhoni to be retained as an uncapped player by CSK ahead of the IPL 2025 auction. Dhoni was retained by Chennai for Rs. 4 Crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-arun-dhumal-interview-94-matches-pahalgam-attack-2720551-2025-05-06",
      "headline": "94 matches in an IPL season? Chairman Arun Dhumal confirms plans for league expansionIPL 2025: Speaking to India Today, Indian Premier League chairman Arun Dhumal said the BCCI will continue to follow the government's directives on cricket ties with Pakistan. He also confirmed that the BCCI is looking to expand the IPL to 94 matches by the 2028 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-future-gautam-gambhir-india-tour-of-england-2720547-2025-05-06",
      "headline": "Gautam Gambhir breaks silence on Virat Kohli, Rohit Sharma Test futuresIndia coach Gautam Gambhir has broken the silence on Rohit Sharma and Virat Kohli's Test futures ahead of the tour of England. Rohit and Kohli's futures has been under the scanner since the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-chairman-exclusive-interview-2720538-2025-05-06",
      "headline": "Nation first: IPL chief Arun Dhumal on cricket amid rising India-Pakistan tensionIPL chairman Arun Dhumal reaffirmed that Indian cricket will follow the government's lead on ties with Pakistan, emphasising \"nation first\" amid rising tensions in the aftermath of the Pahalgam attack. He also confirmed plans to expand the IPL to a 94-match season by 2028 while celebrating the emergence of new Indian talent in 2025."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}