{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-overtakes-jeff-bezos-as-worlds-second-richest-person-2610993-2024-10-04",
      "headline": "Mark Zuckerberg overtakes Jeff Bezos as world's second-richest person The dramatic rise in Mark Zuckerberg's fortune has been fuelled by a 23% increase in Meta's stock price since its better-than-expected Q2 results.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-middle-east-conflict-iran-israel-war-2610988-2024-10-04",
      "headline": "Sensex falls 200 points, Nifty dips on Middle East conflict concernsThe S&P BSE Sensex was down 183.91 points at 82,306.09 at 9:46 am, while the NSE Nifty50 fell 52.25 points to 25,188.05."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-supreme-leader-ayatollah-ali-khamenei-rifle-friday-sermon-symbolism-2611339-2024-10-04",
      "headline": "Rifle in his hand, Iran's Supreme Leader warns Israel 'will not last long' Ayatollah Ali Khamenei, 85, was seen holding a Russian-made Dragunov rifle while addressing thousands of Iranians as he insisted that Iran would not back down in the face of Israeli aggression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-14-naxals-gunned-down-in-bastar-171-ultras-eliminated-so-far-in-2024-2611405-2024-10-04",
      "headline": "31 Naxals gunned down in Chhattisgarh, 185 ultras eliminated so far in 2024Bodies of Naxalites along with a cache of weapons, including an AK-47 rifle and one SLR (self-loading rifle), have been recovered from the encounter spot. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/bugging-device-found-bathroom-benjamin-netanyahu-boris-johnson-israel-uk-britain-2611259-2024-10-04",
      "headline": "Bugging device found in bathroom after Netanyahu used it, claims British ex-PMIn his book, Unleashed, Boris Johnson writes that after Netanyahu visited his department in 2017, his security team found listening devices in the bathroom after the Israeli Prime Minister had used it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/india-first/video/watch-india-today-reports-from-war-fronts-in-lebanon-israel-2611567-2024-10-04",
      "headline": "Watch: India Today reports from war fronts in Lebanon, IsraelIn this episode of India First, watch India Today's Gaurav Sawant and Ashraf Wani's ground reports from war fronts in Israel and Lebanon as tensions escalate in West Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sun-solar-flare-earth-satellite-power-grid-2611087-2024-10-04",
      "headline": "Strongest flare from Sun to hit Earth: Satellite, power grids brace for impactThis event will coincide with an earlier coronal mass ejection (CME) anticipated to arrive between October 4 and 5, heightening the likelihood of geomagnetic storms and auroras this weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/joe-biden-israel-other-alternatives-striking-iran-oil-sites-israel-iran-war-2611594-2024-10-05",
      "headline": "Biden says Israel should seek 'other alternatives' to striking Iran oil sitesUS President Joe Biden on Friday advised Israel against striking Iran's oil facilities, saying he was trying to rally the world to avoid the escalating prospect of all-out war in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/ukraine-and-israel-how-america-war-support-strategies-differ-2611474-2024-10-04",
      "headline": "How America's war support strategies differ for Ukraine and IsraelThe US support for Ukraine and Israel reflects two different paradigms of American foreign policy. The nature of the support, public perception, and diplomatic handling of each situation have been contrasting in many ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-india-report-devine-kerr-loss-dubai-2611555-2024-10-04",
      "headline": "Jittery India slump to big loss in opener vs New ZealandWomen's T20 World Cup: India's campaign in the ICC tournament got off to a shaky start as they suffered a heavy 58-run defeat in their opening match against New Zealand. This is New Zealand's biggest ever win over India in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/israel-iran-middle-east-war-palestine-zionist-lehi-killed-folke-bernadotte-freed-jews-world-war-2-nazi-adolf-hitler-2611104-2024-10-04",
      "headline": "Royal who saved thousands of Jews from Nazis was killed by Zionists. Here's whyCount Folke Bernadotte, a Swedish royal and diplomat, saved thousands, including Jews, from Nazi concentration camps. He even brokered a ceasefire between Israel and Arab nations in the 1948 war. He was, however, shot dead by Zionists in Jerusalem in 1948. Jerusalem, was, in fact, one of the reasons why Zionists killed Bernadotte."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-gangrape-woman-friend-tied-police-release-sketches-accused-arrest-2611400-2024-10-04",
      "headline": "Pune woman raped after friend tied to tree, police release sketches of accusedA 21-year-old woman was allegedly raped by three unidentified men, who also tied her male friend to a tree and assaulted him at an isolated place in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-to-attend-shanghai-cooperation-organisation-meeting-in-pakistan-on-october-15-16-2611256-2024-10-04",
      "headline": "S Jaishankar to visit Pakistan for annual Shanghai Summit on October 15, 16External Affairs Minister S Jaishankar is scheduled to attend Shanghai Cooperation Organisation (SCO) meeting in Pakistan on October 15-16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-joe-biden-frustrated-with-lack-involvement-kamala-harris-campaign-2611314-2024-10-04",
      "headline": "Biden feeling left out, upset at being sidelined in Harris's campaign: ReportPresident Biden is upset that he is no longer part of the national conversation, despite spending decades in American politics. Six people familiar with the matter anonymously told NBC News that Biden has grown frustrated with the lack of his presence in the political discourse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-says-he-was-shocked-when-bullet-hit-his-leg-saw-a-fountain-of-blood-2611230-2024-10-04",
      "headline": "Govinda says he was 'shocked' when bullet hit his leg: Saw a fountain of bloodBollywood actor Govinda addressed the media after being discharged from the hospital following an accidental shooting incident. He thanked the medical staff and explained his reason for owning a gun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/pr-sreejesh-exclusive-resisting-urge-to-play-again-hockey-great-dons-mentor-cap-2611496-2024-10-04",
      "headline": "PR Sreejesh Exclusive: Resisting urge to play again, hockey great dons mentor capHockey India League: PR Sreejesh, speaking to IndiaToday.in, explained how he has been preparing to transition into coaching roles after retiring on a high. The two-time Olympic medalist was unveiled as the mentor and director of the new HIL team Delhi SG Pipers on Friday, October 4 in Noida. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-supreme-leader-khamenei-importance-of-imam-khomeini-grand-mosque-2611301-2024-10-04",
      "headline": "Why Iran's Supreme Leader chose this iconic mosque for his rare sermonThe optics of Iran's Supreme Leader Ayatollah Ali Khamenei addressing thousands of Iranians from a place that played a key role in the 1979 Islamic Revolution was not lost on anyone."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-run-out-amelia-kerr-india-new-zealand-rules-dead-ball-2611463-2024-10-04",
      "headline": "Dead-ball rule explained: Harmanpreet unhappy over run-out callWomen's T20 World Cup 2024: Skipper Harmanpreet Kaur and the Indian cricketers were left fuming after the umpires did not give a run-out ruling in their favour in the match against New Zealand on Friday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/the-story-of-napoleon-bonaparte-who-wanted-to-conquer-india-2611207-2024-10-04",
      "headline": "The story of Napoleon Bonaparte who wanted to conquer IndiaFrom his invasion of Egypt and his declaration to the Directoire that, once he became the master of the land, he would join hands with Indian princes to expel the British, this is the story of a French commander-turned-Emperor who found inspiration for conquering the East in Alexander the Great"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/5-secrets-israel-isnt-telling-you-about-the-war-first-things-fast-2611491-2024-10-04",
      "headline": "5 secrets Israel isn't telling you about the war | First Things Fast In today's episode of First Things Fast, Manish Adhikary delves into the hidden layers of Israel's multi-front war with Gaza, Lebanon, and Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/sanatana-dharma-udhayanidhi-stalin-pawan-kalyan-tiruptai-laddus-row-dmk-janasena-tamil-nadu-andhra-2611241-2024-10-04",
      "headline": "Udhayanidhi Stalin's 'let's wait' retort to Pawan Kalyan's Sanatana Dharma warningA war of words erupted between Tamil Nadu Deputy Chief Minister Udhayanidhi Stalin and his Andhra Pradesh counterpart Pawan Kalyan. While Kalyan is advocating for protective laws for Sanatana Dharma, Stalin has previously called for eradication of Sanatana."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/rahul-gandhi-summoned-pune-court-october-23-defamation-case-savarkar-grandnephew-2611340-2024-10-04",
      "headline": "Rahul Gandhi summoned by Pune court in defamation case by Savarkar's grandnephewVinayak Damodar Savarkar's grand grandnephew filed a defamation case against Rahul Gandhi for \"defaming and abusing\" the Hindutva ideologue at an event in London in March 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ctrl-review-rating-ananya-panday-vikramaditya-motwane-netflix-2611022-2024-10-04",
      "headline": "CTRL review: Clever concept, tedious executionReleased-Fri Oct 04, 2024CTRL movie review: Ananya Panday's film offers an intriguing concept about AI's impact on life and love but falters with a tedious execution, ultimately failing to deliver a compelling message.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hassan-nasrallah-hezbollah-chief-32-years-funeral-dead-israel-lebanon-shot-bunker-ayatollah-khamenei-2611255-2024-10-04",
      "headline": "Nasrallah: A secretive life ends in secrecyHassan Nasrallah, who steered Hezbollah in his image for 32 years, has temporarily been buried in a secret place. He was a vegetable vendor's son who rose as a charismatic orator. A friend of Iran's Khamenei and bitter enemy to Israel, Nasrallah's end was as secretive as his life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amethi-murder-case-accused-arrested-dalit-family-shot-dead-uttar-pradesh-2611370-2024-10-04",
      "headline": "Key accused arrested in Amethi murder case in which four of family were shot deadThe accused, Chandan Verma, had posted a WhatsApp message stating that \"five people will die, I will show you soon,\" indicating a plan to kill all four family members and then commit suicide, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-supersonic-hypersonic-missiles-hit-israel-india-air-defense-system-capabilities-against-china-pakistan-missiles-s400-2610665-2024-10-04",
      "headline": "Does India have an Iron Dome of its own to fend off swarm of missiles?Iran on October 1 fired around 200 ballistic missiles at Israel. It was the biggest test for the Jewish nation's fabled air defence system. Iran, it was reported, used hypersonic missiles too. Can India's air defence system fend off a similar missile attack by its adversaries? This is what we know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anne-hathaway-princess-diaries-3-crazy-rich-asians-director-adele-lim-2611575-2024-10-04",
      "headline": "Princess Diaries 3 announced, Crazy Rich Asians director Adele Lim to helmThe much-loved Princess Diaries film series is set to return with a third instalment. It will be directed by Adele Lim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-sonakshi-sinha-old-dubsmash-video-funny-2611551-2024-10-04",
      "headline": "Watch: Salman Khan, Sonakshi Sinha's old video is too funny to be ignoredSalman Khan and Sonakshi Sinha's hilarious Dubsmash video of a classic dialogue from Mere Apne resurfaced on Reddit. It is too funny to be missed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kangana-ranaut-triple-role-tanu-weds-manu-3-madhavan-aanand-l-rai-2611492-2024-10-04",
      "headline": "Kangana Ranaut to play triple role in Tanu Weds Manu 3: ReportKangana Ranaut is reportedly set to explore a triple role in Tanu Weds Manu 3. The scripting of the film is apparently underway and it will go on floors in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/freedom-at-midnight-second-teaser-nikkhil-advani-2611440-2024-10-04",
      "headline": "Freedom at Midnight: 2nd teaser throws light on partitionFreedom at Midnight's second teaser reveals Jinnah's motivations for seeking a separate nation, offering a glimpse into the historical drama surrounding India's independence."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-jemimah-rodrigues-on-controversial-run-out-call-2611583-2024-10-05",
      "headline": "India respect umpire's decision but it was harsh: Jemimah on controversial callT20 World Cup: India's star batter Jemimah Rodrigues addressed the controversial run-out decision during the team's opening match against New Zealand in the Women's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-india-vs-new-zealand-womens-t20-world-cup-2024-2611580-2024-10-04",
      "headline": "Sophie Devine 'extremely proud' of her team comprehensive win over IndiaNew Zealand captain Sophie Devine revealed that she was extremely proud of her team following a clinical win over India in the opening game of the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/heather-knight-happy-with-polished-england-before-bangladesh-clash-2611502-2024-10-04",
      "headline": "Heather Knight happy with 'polished' England before Bangladesh clashWomen's T20 World Cup 2024: Heather Knight said that she is happy with the progress England have made since crashing out of the mega event back in 2023. Knight and Co. will start their campaign on Saturday against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-india-harmanpreet-kaur-reaction-opening-loss-2611577-2024-10-04",
      "headline": "Harmanpreet dejected after India's heavy loss to New ZealandWomen's T20 World Cup: Captain Harmanpreet Kaur was dejected after India's campaign in the ICC tournament started with a heavy 58-run loss against New Zealand in Dubai on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-iker-casillas-ritika-sajdeh-nba-abu-dhabi-games-2024-2611559-2024-10-04",
      "headline": "Rohit Sharma meets Spain Legend Iker Casillas at NBA Abu Dhabi Games 2024 India captain Rohit Sharma met legendary Spanish goalkeeper Iker Casillas at the NBA Abu Dhabi Games 2024. Rohit recently led India to a 2-0 series win over Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paul-pogba-four-year-drugs-ban-reduced-after-successful-appeal-2611558-2024-10-04",
      "headline": "Paul Pogba's four-year drugs ban reduced after successful appealPaul Pogba's doping suspension has been reduced from four years to 18 months after an appeal at the Court of Arbitration for Sport. This decision allows the French midfielder to return to Juventus by March 2025, earlier than the initial August 2027 ban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-india-report-devine-kerr-loss-dubai-2611555-2024-10-04",
      "headline": "Jittery India slump to big loss in opener vs New ZealandWomen's T20 World Cup: India's campaign in the ICC tournament got off to a shaky start as they suffered a heavy 58-run defeat in their opening match against New Zealand. This is New Zealand's biggest ever win over India in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-kamran-akmal-india-pakistan-ms-dhoni-2611550-2024-10-04",
      "headline": "Gautam Gambhir is like my brother: Kamran Akmal opens up on bond with India starFormer Pakistan cricketer Kamran Akmal recently said that former India opener Gautam Gambhir is like his brother. He also spoke about his bond with MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-knight-england-bangladesh-press-conference-2611500-2024-10-04",
      "headline": "Heather Knight confident of 'refined and evolved' England Women's T20 World Cup 2024: Heather Knight has said that England are up and running for the tournament after crashing out in the semis last time around in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/pr-sreejesh-exclusive-resisting-urge-to-play-again-hockey-great-dons-mentor-cap-2611496-2024-10-04",
      "headline": "PR Sreejesh Exclusive: Resisting urge to play again, hockey great dons mentor capHockey India League: PR Sreejesh, speaking to IndiaToday.in, explained how he has been preparing to transition into coaching roles after retiring on a high. The two-time Olympic medalist was unveiled as the mentor and director of the new HIL team Delhi SG Pipers on Friday, October 4 in Noida. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-fan-reaction-harmanpreet-umpires-kerr-controversial-run-out-2611480-2024-10-04",
      "headline": "Fans slam umpire after controversial run-out call vs IndiaWomen's T20 World Cup 2024: Indian fans were left fuming after New Zealand batter Amelia Kerr was given not out despite being short of her crease as on-filed umpires had already declared the ball dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-india-report-devine-kerr-loss-dubai-2611555-2024-10-04",
      "headline": "Jittery India slump to big loss in opener vs New ZealandWomen's T20 World Cup: India's campaign in the ICC tournament got off to a shaky start as they suffered a heavy 58-run defeat in their opening match against New Zealand. This is New Zealand's biggest ever win over India in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-kamran-akmal-india-pakistan-ms-dhoni-2611550-2024-10-04",
      "headline": "Gautam Gambhir is like my brother: Kamran Akmal opens up on bond with India starFormer Pakistan cricketer Kamran Akmal recently said that former India opener Gautam Gambhir is like his brother. He also spoke about his bond with MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-knight-england-bangladesh-press-conference-2611500-2024-10-04",
      "headline": "Heather Knight confident of 'refined and evolved' England Women's T20 World Cup 2024: Heather Knight has said that England are up and running for the tournament after crashing out in the semis last time around in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/pr-sreejesh-exclusive-resisting-urge-to-play-again-hockey-great-dons-mentor-cap-2611496-2024-10-04",
      "headline": "PR Sreejesh Exclusive: Resisting urge to play again, hockey great dons mentor capHockey India League: PR Sreejesh, speaking to IndiaToday.in, explained how he has been preparing to transition into coaching roles after retiring on a high. The two-time Olympic medalist was unveiled as the mentor and director of the new HIL team Delhi SG Pipers on Friday, October 4 in Noida. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-fan-reaction-harmanpreet-umpires-kerr-controversial-run-out-2611480-2024-10-04",
      "headline": "Fans slam umpire after controversial run-out call vs IndiaWomen's T20 World Cup 2024: Indian fans were left fuming after New Zealand batter Amelia Kerr was given not out despite being short of her crease as on-filed umpires had already declared the ball dead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-run-out-amelia-kerr-india-new-zealand-rules-dead-ball-2611463-2024-10-04",
      "headline": "Dead-ball rule explained: Harmanpreet unhappy over run-out callWomen's T20 World Cup 2024: Skipper Harmanpreet Kaur and the Indian cricketers were left fuming after the umpires did not give a run-out ruling in their favour in the match against New Zealand on Friday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lassana-diarra-case-court-says-fifa-rules-on-player-transfers-break-eu-law-2611426-2024-10-04",
      "headline": "Top court says FIFA rules on player transfers break European Union lawLassana Diarra Case: The European Union's top court said Friday that some of FIFA's rules on player transfers do not comply with European Union laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-fastest-odi-hundred-vs-sri-lanka-1996-nairobi-2611421-2024-10-04",
      "headline": "OTD: Shahid Afridi announces his arrival with fastest ODI hundredPakistan all-rounder Shahid Afridi announced his arrival in international cricket in style as he scored the fastest hundred in his maiden innings of just 37 balls against Sri Lanka in 1996."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-will-look-to-win-t20i-series-vs-india-captain-najmul-shanto-2611409-2024-10-04",
      "headline": "Bangladesh will look to win T20I series vs India: Captain Najmul Shanto Bangladesh captain Najmul Hossain Shanto said that his young team will look to beat the Suryakumar Yadav-led Indian team in the upcoming three-match T20I series, starting on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-cricketer-salil-ankolas-mother-dies-in-pune-2611383-2024-10-04",
      "headline": "Former cricketer Salil Ankola's mother dies in PuneMala Ashok Ankola, mother of ex-cricketer Salil Ankola, was found dead under suspicious circumstances. Police are probing whether it's a murder or suicide, with findings awaited post-autopsy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/world-tennis-league-iga-swiatek-aryna-sabalenka-and-daniil-medvedev-among-stars-for-season-3-2611382-2024-10-04",
      "headline": "World Tennis League: Swiatek, Sabalenka and Medvedev among stars for season 3The World Tennis League on Friday unveiled a star-studded lineup of players for its third season, scheduled to take place at the iconic Etihad Arena from December 19 to 22, 2024. The likes of Iga Swiatek, Aryna Sabalenka and Daniil Medvedev will headline the rosters for season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-dhruv-jurel-abhimanyu-easwaran-mumbai-vs-rest-of-india-2611375-2024-10-04",
      "headline": "Irani Cup: Prithvi Shaw's 76 helps Mumbai take 274-run lead on Day 4Mumbai finished Day 4 of the Irani Cup 153/6 leading by 274 runs against Rest of India. Prithvi Shaw scored a brilliant knock of 76 (105) in the second innings for Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-west-indies-10-wickets-report-dubai-laura-wolvaardt-2611357-2024-10-04",
      "headline": "Rampant South Africa hammer hapless West Indies in DubaiWomen's T20 World Cup 2024: South Africa beat West Indies by 10 wickets in Dubai and made the best possible start to their campaign in the multi-nation event. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-cricketer-salil-ankolas-mother-dies-in-pune-2611383-2024-10-04",
      "headline": "Former cricketer Salil Ankola's mother dies in PuneMala Ashok Ankola, mother of ex-cricketer Salil Ankola, was found dead under suspicious circumstances. Police are probing whether it's a murder or suicide, with findings awaited post-autopsy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/world-tennis-league-iga-swiatek-aryna-sabalenka-and-daniil-medvedev-among-stars-for-season-3-2611382-2024-10-04",
      "headline": "World Tennis League: Swiatek, Sabalenka and Medvedev among stars for season 3The World Tennis League on Friday unveiled a star-studded lineup of players for its third season, scheduled to take place at the iconic Etihad Arena from December 19 to 22, 2024. The likes of Iga Swiatek, Aryna Sabalenka and Daniil Medvedev will headline the rosters for season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-dhruv-jurel-abhimanyu-easwaran-mumbai-vs-rest-of-india-2611375-2024-10-04",
      "headline": "Irani Cup: Prithvi Shaw's 76 helps Mumbai take 274-run lead on Day 4Mumbai finished Day 4 of the Irani Cup 153/6 leading by 274 runs against Rest of India. Prithvi Shaw scored a brilliant knock of 76 (105) in the second innings for Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-west-indies-10-wickets-report-dubai-laura-wolvaardt-2611357-2024-10-04",
      "headline": "Rampant South Africa hammer hapless West Indies in DubaiWomen's T20 World Cup 2024: South Africa beat West Indies by 10 wickets in Dubai and made the best possible start to their campaign in the multi-nation event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-new-zealand-live-updates-harmanpreet-kaur-sophie-devine-2611346-2024-10-04",
      "headline": "IND vs NZ Highlights: New Zealand thrash India by 58 runsWomen's T20 World Cup, IND vs NZ Highlights: India have been beaten by 58 runs in their opening game of the tournament as they got all out for 102 in reply of New Zealand's score of 160/4. Sophie Devine won Player of the Match for scoring 57* (36) in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-fatima-sana-pcb-feature-2611331-2024-10-04",
      "headline": "Pakistan's Fatima Sana needs to be nurtured with utmost careWomen's T20 World Cup 2024: Pakistan skipper Fatima Sana led from the front and helped her team beat Sri Lanka by 31 runs on Thursday at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nandre-burger-back-injury-ire-vs-sa-ban-vs-ire-2611324-2024-10-04",
      "headline": "Nandre Burger ruled out of remaining ODIs vs Ireland and Bangladesh Test tourSouth Africa fast bowler Nandre Burger has been ruled out of the remaining two ODIs against Ireland and the upcoming Test tour of Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-hockey-india-league-launch-hi-asunta-lakra-exclusive-2611326-2024-10-04",
      "headline": "Women's Hockey India League all about the platform, not money: Asunta LakraSpeaking to India Today Digital in an exclusive interaction, former India women's team captain Asunta Lakra feels that the new Women's Hockey India League will be all about the platform for the players and not the money. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}