{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-agrees-to-pay-175-million-dollars-to-settle-six-class-action-lawsuits-over-mccamish-cyber-incident-2693919-2025-03-15",
      "headline": "Infosys agrees to pay $17.5 million to settle lawsuits over US cyber incidentInfosys first disclosed the cyber incident in a stock exchange filing in November 2023. The company said it was working with a cybersecurity products provider to resolve the issue and had launched an independent investigation to assess its impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-3000-for-first-time-trade-tensions-and-fed-bets-drive-rally-glbs-2693649-2025-03-14",
      "headline": "Gold hits $3,000 for first time: Trade tensions and Fed bets drive rallyGold surged past $3,000 an ounce for the first time, driven by trade tensions, recession fears, and Fed rate cut bets. Analysts expect further gains, with prices potentially reaching $3,050 in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-mutual-fund-inflows-10-month-low-amfi-data-3-alternate-investment-options-2693634-2025-03-14",
      "headline": "Mutual fund inflows at 10-month low: Here are 3 alternate investment optionsThe total assets under management (AUM) of the mutual fund industry fell 4%, from Rs 66.98 lakh crore in January to Rs 64.26 lakh crore in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-tesla-unsigned-letter-donald-trump-administration-tariff-threats-trade-war-risks-retaliation-cost-ev-industry-2693577-2025-03-14",
      "headline": "Elon Musk's Tesla warns of tariff risks in letter to Trump administrationIn an unsigned letter to the Donald Trump-led administration, his ally Elon Musk's Tesla has cautioned that the US President's trade war could expose the automaker to retaliatory tariffs and increase the cost of making electric vehicles in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-production-low-cost-model-y-shanghai-china-price-war-sale-drop-india-entry-2693558-2025-03-14",
      "headline": "Tesla planning low-cost Model Y in China. Will India get it too?Production will take place at Tesla's Shanghai factory, its largest production hub, and mass production is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-share-price-jump-15-percent-wall-street-investors-welcome-new-ceo-lip-bu-tan-2693524-2025-03-14",
      "headline": "Intel shares jump 15% as investors welcome new CEO Lip-Bu TanIntel shares closed at $23.70, jumping 14.60% as investors placed their bet on the newly announced CEO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/holi-2025-stock-ideas-these-2-shares-piramal-pharma-ptc-india-could-deliver-up-to-16-percent-gains-2693471-2025-03-14",
      "headline": "Holi 2025 stock ideas: These 2 shares could deliver up to 16% gainsFor Holi 2025, Bajaj Broking has recommended two stocks that could see a 16% upside in the next 12 months amid a market correction that has seen Sensex and Nifty on a downward trend.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-indices-slip-as-trump-eu-tariff-threat-sparks-concerns-2693356-2025-03-13",
      "headline": "Wall Street indices slip as Trump's EU tariff threat raises concernsAt the opening bell, the S&P 500 dipped 0.9 points, or 0.09%, at the open to 5,594.45​, the Dow Jones Industrial Average dropped 70.9 points, or 0.17%, at the open to 41,280.05 and Nasdaq Composite fell 49.9 points, or 0.28%, to 17,598.565."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/found-old-share-certificates-at-home-chandigarh-man-here-is-how-you-can-encash-them-2693296-2025-03-13",
      "headline": "Old share certificates in your drawer? Here's how you can encash themThe stock value of old shares can be calculated by multiplying the number of stocks held by the current market price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/check-sbi-latest-lending-rates-for-march-2025-mclr-and-base-rate-2693293-2025-03-13",
      "headline": "Check SBI's latest lending rates for March 2025: MCLR and base rateThe updated MCLR rates will directly influence interest rates on various financial products, including home loans, personal loans, and other credit facilities offered by the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-close-for-holi-march-14-nse-bse-holiday-trading-equity-2693243-2025-03-13",
      "headline": "BSE, NSE holiday: Is stock market closed for Holi on March 14, 2025?Since there is some uncertainty over whether Holi 2025 falls on Friday or Saturday, it is important to check the official list of stock market holidays for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/policies-are-a-nightmare-zerodha-ceo-nithin-kamath-on-why-life-insurance-is-getting-tougher-2693227-2025-03-13",
      "headline": "Policies are a nightmare: Nithin Kamath on why life insurance is getting tougherSince the onset of COVID-19, insurance companies have faced an increase in claims, which has led them to reassess their underwriting policies and tighten their approval process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-bse-nse-dalal-street-auto-it-stocks-drag-markets-2693194-2025-03-13",
      "headline": "Sensex, Nifty erase early gains to end lower; Auto, IT stocks weigh on marketsThe S&P BSE Sensex lost 200.85 points to end at 73,828.91, while the NSE Nifty50 was down by 73.30 points to close at 22,397.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-sensex-nifty-market-correction-make-sense-to-stop-investing-in-mutual-funds-expert-advice-2693167-2025-03-13",
      "headline": "Does it make sense to stop investing in mutual funds amid market correction?Sensex and Nifty are down nearly 15% from their September all-time highs as volatility continues to make its presence felt, and market correction is the flavour being served on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/march-15-advance-tax-deadline-are-you-required-to-pay-2693153-2025-03-13",
      "headline": "March 15 advance tax deadline: Are you required to pay?Salaried individuals, freelancers, and businesses must pay advance tax if their total tax liability (after TDS/TCS) exceeds Rs 10,000 in FY 2024-25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-to-calculate-advance-tax-and-pay-it-before-filing-your-itr-deadline-march-15-steps-2693128-2025-03-13",
      "headline": "Filing your advance tax? Here's how to calculate itAdvance tax is applicable when the total tax liability for a financial year exceeds Rs 10,000. It is computed based on the estimated income for the year and paid in instalments as per the due dates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-upi-linked-to-an-inactive-mobile-number-this-is-how-npci-protects-you-2693107-2025-03-13",
      "headline": "Is your UPI linked to an inactive mobile number? Here's how NPCI protects youBy March 31, 2025, all banks and payment service providers (PSPs) offering UPI services must update their databases to remove inactive or recycled mobile numbers. The move aims to reduce errors and prevent fraud caused by mobile number churn."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/starlink-india-entry-partnership-spacex-bharti-airtel-reliance-jio-what-it-means-for-india-telecom-sector-2693090-2025-03-13",
      "headline": "Airtel and Jio team up with SpaceX to bring Starlink: What it means for telcosSpaceX is still awaiting permission from the government to officially launch Starlink's services in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-form-16-necessary-for-itr-filing-what-to-do-if-you-do-not-have-it-2693072-2025-03-13",
      "headline": "Is Form 16 necessary for ITR filing? What to do if you don't have it?Form 16 provides details of the deducted tax amount and submission date and helps in ITR filing by ensuring accurate income and tax details, reducing the chances of errors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/extra-work-from-home-wfh-days-at-infosys-needs-manager-nod-report-2693017-2025-03-13",
      "headline": "Extra work from home days at Infosys needs manager's nod: ReportThis comes as the Bengaluru-based IT company rolled out a new mandate on Monday, which requires its employees to work from the office at least 10 days a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-share-price-rise-18-percent-today-after-this-announcement-check-here-asset-monetisation-2692996-2025-03-13",
      "headline": "Explained: Why MTNL share price rose 18% todayOver the past year, the stock has gained 18.61%. Year-to-date (YTD), the stock has declined by 15.66%. In the last six months, the stock has dropped 23.25%  and in the last three months, it has fallen 25.95%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lip-bu-tan-new-intel-ceo-march-18-ai-semiconductor-2692980-2025-03-13",
      "headline": "Who is Lip-Bu Tan, industry veteran named Intel CEO?Lip-Bu Tan, who officially takes over on March 18, has extensive experience in the chip sector and is known for investing in promising tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-why-sensex-and-nifty-are-struggling-after-gaining-in-early-trade-2692977-2025-03-13",
      "headline": "Explained: Why Sensex, Nifty are giving up early gains almost every dayStock market today: Despite multiple signals pointing to a strong opening, the Sensex and Nifty couldn't hold on to early gains. Right now, they are barely 0.10% higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-nearly-200-points-nifty-above-22500-indusind-bank-gains-over-2-2692961-2025-03-13",
      "headline": "Sensex, Nifty gain momentum on inflation relief, IndusInd Bank falls 2%The S&P BSE Sensex gained 250.89 points to 74,280.65, while the NSE Nifty50 added 59.70 points to 22,530.20 as of 10 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-slams-freebies-culture-job-creation-innovative-entrepreneurs-remove-poverty-india-2692954-2025-03-13",
      "headline": "Not freebies, job creation will omit poverty from India: Narayana MurthyInfosys co-founder Narayana Murthy has slammed the freebies of culture, saying that job creation by innovative entrepreneurs will help eliminate poverty from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-13-infosys-bel-ola-electric-tata-motors-and-more-2692948-2025-03-13",
      "headline": "Stocks to watch today: Infosys, BEL, Ola Electric, Tata Motors and moreStocks to watch today (March 13): Infosys, Tata Motors, and Bharat Electronics Limited are likely to be in focus today as domestic markets gear up for a mildly positive start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-opening-prediction-on-march-13-3-key-factors-to-watch-dalal-street-expectation-2692943-2025-03-13",
      "headline": "Will Sensex, Nifty recover today? 3 things to know ahead of stock market openingStock market opening prediction today: Sensex and Nifty are likely to open higher after positive US and domestic retail inflation data. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-deadline-only-3-days-left-to-pay-last-instalment-of-advance-tax-march-15-2692712-2025-03-13",
      "headline": "Income tax deadline: Only 3 days left to pay last instalment of advance taxMaking timely payments is crucial when it comes to tax compliance to avoid penalties and interest. Also, meeting deadlines ensures last-minute stress and a smooth tax filing process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-on-edge-inflation-eases-but-global-retaliation-hits-stocks-hard-glbs-2692795-2025-03-12",
      "headline": "Wall Street on edge: Inflation eases, but global retaliation hits stocks hardAfter jumping to a big early gain on an encouraging inflation update, Wall Street gave back much of it after other countries announced their retaliations following President Donald Trump's latest escalation in his trade war.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-higher-as-softer-inflation-data-boosts-investor-confidence-tesla-leads-market-surge-2692768-2025-03-12",
      "headline": "Wall Street opens higher as softer inflation data boosts investor confidenceAt the opening bell, the S&P 500 rose 52.8 points, or 0.95%, to 5,624.84 and the Dow Jones Industrial Average was up by 144.0 points, or 0.35%, to 41,577.5. The Nasdaq Composite also witnessed a rise of 275.3 points, or 1.58%, to 17,711.41."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/equity-mutual-fund-inflows-fall-26-percent-in-february-amid-market-volatility-2692736-2025-03-12",
      "headline": "Equity mutual fund inflows fall 26% in February amid market volatilityMarket fluctuations impacted mutual fund inflows across categories, with equity and hybrid funds seeing a decline. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-to-7-month-low-in-february-2692648-2025-03-12",
      "headline": "Retail inflation eases to 7-month low of 3.61% in FebruaryRetail inflation in February has cooled to a seven-month low, and it has also fallen below the RBI's medium-term target for the first time in six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tds-rules-changing-from-april-1-higher-tax-free-limits-on-fd-interest-lottery-insurance-commission-mutual-funds-2692626-2025-03-12",
      "headline": "TDS rules from April 1: Higher tax-free limits on FD interest, lotteryTo benefit senior citizens, the government has doubled the TDS threshold for interest income from Rs 50,000 to Rs 1 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-marginally-lower-it-stocks-infosys-tumble-2692622-2025-03-12",
      "headline": "Sensex, Nifty end marginally lower as IT stocks tumble; Infosys falls over 4%The S&P BSE Sensex ended 72.56 points lower at 74,029.76, while the NSE Nifty50 settled 27.40 points lower at 22,470.50. All the other broader market indices also ended in negative territory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/temasek-takes-a-bit-of-haldirams-buy-10-percent-stake-for-1-billion-dollar-2692580-2025-03-12",
      "headline": "Temasek takes a bit of Haldiram's, buys 10% stake for $1 billion: ReportTemasek, which has already invested in Manipal Hospitals and fast-food giant Devyani International (operator of KFC and Pizza Hut in India), is now looking to cash in on the growing snacks market with its Haldiram's bet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-rolls-out-premium-economy-fares-starting-at-rs-599-for-a-limited-time-2692556-2025-03-12",
      "headline": "Air India rolls out premium economy fares starting at Rs 599 for a limited timeThese premium economy fares are above regular economy fares on domestic flights for a limited time. Prices vary based on routes and demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-top-7-billionaires-lose-34-billion-amid-stock-market-slump-2692540-2025-03-12",
      "headline": "India's top 7 billionaires lose $34 billion amid stock market slumpMukesh Ambani, India's richest person, lost $3.13 billion this year, though he still remains India's richest man with a net worth of $87.5 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dalal-street-falls-sensex-nifty-3-factors-behind-stock-market-correction-2692512-2025-03-12",
      "headline": "Sensex falls over 400 points. 3 factors behind today's stock market slumpStock market today: At around 12:42 pm, the S&P BSE Sensex was down 439.77 points to 73,662.55 and the Nifty50 was trading 150.50 points lower at 22,347.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-some-investors-hnis-choosing-fixed-deposits-over-sips-2692474-2025-03-12",
      "headline": "Why are some investors choosing fixed deposits over SIPs?Many stock market experts suggest that mid-cap and small-cap stocks are currently expensive, which has triggered a correction in the last six months."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-plays-holi-with-girlfriend-ankita-kukreti-sanjeeda-shaikh-divorce-2693960-2025-03-15",
      "headline": "Watch: Actor Aamir Ali plays Holi with girlfriend Ankita KukretiTelevision actor Aamir Ali was seen celebrating Holi with his girlfriend Ankita Kukreti.  The couple's public appearance comes after Aamir confirmed his relationship status in a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ted-lasso-starring-jason-sudeikis-show-renewed-for-fourth-season-apple-tv-2693905-2025-03-15",
      "headline": "Ted Lasso returns: Jason Sudeikis show renewed for fourth seasonApple TV+ has renewed Ted Lasso for a fourth season with Jason Sudeikis leading the charge once more. The new season will introduce Ted coaching a women's football team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-says-thank-you-india-shares-lollapalooza-performance-glimpse-photo-dump-2693841-2025-03-15",
      "headline": "Singer Shawn Mendes says 'dhanyawad' to India after Lollapalooza performanceSinger Shawn Mendes visited India for Lollapalooza 2025 and is currently in the nation, expressing his gratitude through social media post. He especially appreciated Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-hosts-hasan-minhaj-indore-treat-2693783-2025-03-15",
      "headline": "Stand-up comic Zakir Khan treats Hasan Minhaj with delicious Indore foodZakir Khan hosted Hasan Minhaj in Indore, introducing him to the city's street food culture and hinting at a future collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-removed-prada-brand-ambassador-kim-sae-ron-death-2693694-2025-03-14",
      "headline": "Kim Soo-hyun removed as Prada's brand ambassador amid Kim Sae-ron scandal: ReportK-drama star Kim Soo-hyun has reportedly been removed as luxury brand Prada's brand ambassador following his alleged involvement in actor Kim Sae-ron's death scandal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-potato-lab-review-kang-taeoh-lee-sunbin-lead-netflix-quirky-comedy-2693681-2025-03-14",
      "headline": "The Potato Lab review: Kang Tae-oh, Lee Sun-bin lead this quirky comedyReleased-Sat Mar 01, 2025The Potato Lab is a fun K-drama set in a picturesque mountain valley. While it offers laughs and visual appeal, it sometimes lacks depth and originality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exploring-age-gaps-in-k-dramas-my-dearest-nemesis-moon-gayoung-choi-hyunwook-2686740-2025-03-14",
      "headline": "Exploring age gaps in K-dramas: Why do they cause so much buzz?K-dramas often feature age differences between lead actors, sparking debate among fans. While such gaps are common in real life, they draw more attention on screen. In this K-Fix, we will find out why do they matter so much."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-returns-with-podcast-about-successful-women-days-after-cooking-show-2693652-2025-03-14",
      "headline": "Meghan Markle returns with podcast about successful women days after cooking showMeghan Markle, Duchess of Sussex, has announced her new stint. She will now be launching a podcast, narrating the stories of successful women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-celebrates-holi-apoorva-mukhija-returns-instagram-india-got-latent-2693645-2025-03-14",
      "headline": "Ashish Chanchlani celebrates Holi with director Abhishek KapoorAmid the India's Got Latent controversy, social media influencers Ashish Chanchlani and Apoorva Mukhija seemed to be moving forward in their respective journeys. Chanchlani stepped out to celebrate Holi, while Mukhija made her Instagram comeback, expressing gratitude to her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hema-malini-seen-with-a-script-for-reality-show-on-indian-idol-fans-react-2693602-2025-03-14",
      "headline": "Hema Malini seen with a 'script for reality show' on Indian Idol, fans reactA Reddit post suggested the scripted nature of Indian Idol as actor Hema Malini was seen holding a detailed script during a recent episode. The revelation has sparked reactions online, questioning the authenticity of reality shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/k-drama-star-lomon-on-family-matters-taj-mahal-speaks-in-hindi-india-all-of-us-are-dead-exclusive-2693616-2025-03-14",
      "headline": "K-drama star Lomon on Family Matters, Taj Mahal, India, All of Us are Dead | ExclusiveK-drama star Lomon sits down with India Today's Bhavna Agarwal to talk about his latest release, Family Matters, now streaming on Channel K. He has a special message for Indian fans as well. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-agency-confirms-he-dated-kim-sae-ron-denies-his-role-in-her-death-official-statement-2693538-2025-03-14",
      "headline": "Kim Soo-hyun's agency confirms he dated Kim Sae-ron, denies his role in her deathSouth Korean actor Kim Soo-hyun has been facing a lot of backlash for his alleged involvement in pushing his former girlfriend Kim Sae-ron to the brink of death. His agency has now clarified that the two were indeed dating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-confirms-his-kaun-banega-crorepati-return-amid-retirement-rumours-2693526-2025-03-14",
      "headline": "Amitabh Bachchan confirms his KBC return amid retirement rumoursAmid speculation of Shah Rukh Khan or Aishwarya Rai hosting the next season of Kaun Banega Crorepati, Amitabh Bachchan has confirmed his return as the host. The veteran actor expressed gratitude for the love and support he received over the past 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-embraces-holi-spirit-sends-wishes-to-fans-2693516-2025-03-14",
      "headline": "Singer Shawn Mendes embraces Holi spirit in India, sends wishes to fansSinger Shawn Mendes is in India for Holi. The artiste, who recently performed at Lollapalooza India, extended his Holi wishes on Friday with a vibrant selfie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-admits-feeling-unqualified-unequipped-in-self-critical-post-2693506-2025-03-14",
      "headline": "Justin Bieber admits feeling 'unqualified, unequipped' in self-critical postSinger Justin Bieber opened up about his inner struggles and feelings of inadequacy amid ongoing health concerns, admitting to often feeling like a fraud despite his success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arjit-singh-martin-garrix-new-single-angles-for-each-other-full-song-out-2693494-2025-03-14",
      "headline": "Home studio to stardom: Arijit Singh, Martin Garrix unveil new singleSinger Arijit Singh and Dutch DJ and record producer, Martin Garrix, collaborated for a new single, 'Angels For Each Other'. The duo unveiled the song ahead of Holi. Garrix lent his vocals for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-its-okay-to-not-be-okay-costar-seo-yeji-dating-rumours-2693389-2025-03-13",
      "headline": "Kim Soo-hyun's co-star Seo Ye-ji on rumours of dating him: Please stopA recent controversy involving K-drama actor Kim Soo-hyun has dragged his former co-star Seo Ye-ji into the limelight. She addressed rumours linking her to the actor and expressed her frustration on her fancafe, clarifying that she has no personal ties with Kim Soo-hyun."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ratna-pathak-shah-karwa-chauth-comment-roshesh-rajesh-kumar-2693342-2025-03-13",
      "headline": "Liberal women like Ratna Pathak Shah often question sanskriti: Actor Rajesh KumarActor Ratna Pathak Shah's remarks on Karva Chauth in 2022 sparked a debate, leading to a response from her co-star Rajesh Kumar, who defended traditional customs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/siddharth-test-character-promo-cricketer-arjun-look-unveiled-by-r-ashwin-2693260-2025-03-13",
      "headline": "It's do or die for Siddharth as cricketer Arjun in Test promo. WatchCricketer R Ashwin unveiled the character promo of Siddharth as Arjun in Netflix's upcoming project, Test. The film will stream on Netflix from April 4."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ranya-rao-gold-smuggling-case-father-dgp-ramachandra-rao-compulsory-leave-2694050-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao's father and DGP Ramachandra Rao sent on compulsory leaveDays after Kannada actor Ranya Rao's arrest in a gold smuggling case, her father, DGP Ramachandra Rao, has been placed on compulsory leave."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-yadav-rjd-police-officer-holi-celebration-patna-dance-face-suspension-bihar-2693946-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Thumka lagao' or get suspended: Tej Pratap's order to cop on Holi sparks rowWhile celebrating Holi with party supporters, RJD leader Tej Pratap Singh Yadav ordered a police officer to dance in the middle of party workers or face suspension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-rahul-gandhi-congress-vietnam-trip-during-holi-frequent-visits-ravi-shankar-prasad-2693988-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP says Rahul Gandhi was in Vietnam during Holi, questions 'frequency' of visitsBJP leader Ravi Shankar Prasad raised concerns over Rahul Gandhi's 'curious' and 'extraordinary fondness for Vietnam', while Amit Malviya claimed it posed serious national security questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-retirement-u-turn-olympics-2694023-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli to play in 2028 Olympics? India star on possible retirement U-turnVirat Kohli has joked that he might come out of T20I retirement to play in the LA Olympics in 2028. The senior Royal Challengers Bengaluru batter said that to be an Olympic champion would be a magnificent feeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-epic-3-hour-podcast-with-lex-fridman-to-be-out-tomorrow-2694048-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi's 'epic 3-hour podcast' with Lex Fridman to be out tomorrowLex Fridman's three-hour podcast with Indian Prime Minister Narendra Modi will be released on March 16, 2025. Fridman described the conversation as one of the most powerful experiences of his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-f35-fighter-jets-order-review-trump-tariff-threat-mark-carney-2693982-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada reviewing F-35 jets order amid US tariff war, says defence ministerPortugal has also indicated that it would ditch its acquisition of F-35 jets. The stealth fighters were also offered by Trump to India during Prime Minister Narendra Modi's US visit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-kolhapur-accident-driver-heart-attack-lost-control-2693999-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Car loses control after driver suffers heart attack, rams 10 vehiclesAt least 10 vehicles, including an auto-rickshaw and two-wheelers, were crushed after a speeding car lost control and crashed into them in Maharashtra's Kolhapur, resulting in the driver's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-is-cbp-home-app-tool-ranjani-srinivasan-used-to-self-deport-from-us-glbs-2694049-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is CBP Home App, tool Ranjani Srinivasan used to self-deport from USIndian student Ranjani Srinivasan self-deported using the CBP Home app after her US visa was revoked over ties to Hamas. The app facilitates self-deportation, aiming to streamline immigration enforcement.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/slapped-denied-food-sleep-duress-actor-ranya-rao-torture-in-custody-gold-smuggling-case-petition-2693924-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao claims she was slapped, made to sign blank pages, starved in custodyActor Ranya Rao, arrested in a gold smuggling case, said in a letter to a top DRI officer that she was implicated in a false case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-ranjani-srinivasan-indian-columbia-student-self-deports-after-visa-revocation-glbs-2693778-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Ranjani Srinivasan? Indian Columbia student self-deports after visa revocationThe DHS confirmed that an Indian Columbia University student self-deported after her visa was revoked for Hamas support, while a Palestinian student was arrested for overstaying her expired visa."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-shocker-man-kills-sons-fearing-they-would-suffer-in-future-due-to-poor-marks-hangs-self-2694029-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man kills sons fearing they would 'suffer' in future due to poor marks, hangs selfThe boys were allegedly drowned by their father in a bucket of water around 10 am on Friday as he was disappointed with their academic performance, police said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-blasts-pakistani-man-over-nose-job-comment-says-you-are-ugly-nadaaniyan-review-2693947-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ibrahim Ali Khan allegedly blasts Pakistani man over nose job comment: You are uglyIbrahim Ali Khan, son of Saif Ali Khan, reportedly hit back at a Pakistani man's comment on his debut film, Nadaaniyan. The exchange sparked mixed reactions from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-reservation-muslim-contractors-government-tenders-bjp-slams-move-2693957-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka's nod to 4% quota for Muslims in government tenders, BJP slams moveBJP leader Ravi Shankar Prasad said the Karnataka government's move was reflective of the 'mentality of Rahul Gandhi'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pawan-kalyan-language-row-tamil-films-dubbed-hindi-bollywood-nep-2693814-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pawan Kalyan's 'Tamil films dubbed in Hindi' jab gets fiery DMK responsePawan Kalyan's remarks come at a time when the BJP-led Centre and DMK-ruled Tamil Nadu are engaged in a bitter spat over the 'three-language formula' that is a part of the New Education Policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/grenade-attack-on-amritsar-thakurdwara-temple-caught-on-cctv-cops-probe-pakistan-link-2693887-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grenade attack on Amritsar temple caught on CCTV, cops probe Pakistan linkTwo assailants hurled a grenade at a temple in Amritsar, causing panic. Police are investigating a possible Pakistan connection to the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/jd-vance-joke-about-wife-usha-vance-upsets-internet-video-viral-2693932-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "JD Vance's 'she has to smile' remark about wife Usha upsets Internet. Watch videoA video of US Vice President JD Vance's \"she has to smile\" remark about his wife Usha Vance has gone viral on social media, sparking backlash online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-459-14-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: India Today News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-vlogger-junaid-accident-death-malappuram-sexual-harassment-case-2693951-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala vlogger, out on bail in sexual assault case, dies in bike crashKerala vlogger Junaid, out on bail in a sexual assault case, died after his bike crashed into a sand mound in Malappuram, causing a fatal head injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/picturisation-of-holi-in-bollywood-through-years-rang-barse-balam-pichkari-lahu-muh-lag-gaya-2693789-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Divided by drama, united by colours: Bollywood's eternal Holi blendHindi cinema's love affair with Holi: Filmmakers have shown Holi on the screen for as long as Hindi cinema had existed. While at times, it has been shown as the juncture where love is professed, thus adding a new colour in the lives of the characters, at others it has been used as a backdrop for a crucial sequence to advance narratives. This cinematic Saturday, have a look at how Holi has been showcased through the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/nepali-student-holy-bell-school-fiery-speech-on-nepal-future-viral-video-2693997-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nepali student's fiery speech on country's future goes viral. Video impresses InternetA video of a Nepali student delivering a fiery speech at a school event has gone viral on social media. The reason? His passionate tone as he speaks about the future of his country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-united-states-travel-ban-pakistan-afghanistan-bhutan-full-list-2693844-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan among 41 nations likely to face Trump's travel ban: ReportUS officials said the travel restrictions would be broader than the curbs imposed during the first term of Donald Trump, when he banned travellers from seven majority-Muslim nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-preview-squad-analysis-schedule-predicted-xi-shreyas-iyer-ricky-ponting-2693963-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PBKS preview: Project Punjab looks for lift off under Shreyas-PontingUnder the new regime of coach Ricky Ponting and captain Shreyas Iyer, Punjab Kings will look to end their playoffs jinx during IPL 2025. Punjab splashed the cash on big names and will be hoping for the rewards. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/local-bjp-leader-shot-dead-by-neighbour-in-haryanas-sonipat-over-land-dispute-2693823-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "On camera, BJP leader chased into shop, shot by neighbour in HaryanaSurendra Jawahar, a local BJP leader, was shot dead in Haryana's Sonipat district over a land dispute. The accused had previously warned him but opened fire when he attempted to clear the land."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-32nd-birthday-neetu-kapoor-kareena-kapoor-katrina-kaif-wish-2694057-2025-03-15",
      "headline": "Neetu-Kareena to Katrina Kaif, celebs wish Alia Bhatt on 32nd birthdayAlia Bhatt turned 32 on March 15. Notable celebrities wished the actor on social media and expressed their affection and well-wishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-asks-people-to-be-kind-to-debutants-as-ibrahim-ali-khan-khushi-kapoor-get-trolled-nadaaniyan-2694022-2025-03-15",
      "headline": "Sonu Sood asks people to be kind to debutants as Ibrahim-Khushi get trolledIn the wake of criticism aimed at star kids Ibrahim Ali Khan and Khushi Kapoor after their film Nadaaniyan, Sonu Sood has called for empathy and support for newcomers in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-assistant-asked-saurabh-shukla-to-change-reaction-kick-2693976-2025-03-15",
      "headline": "Salman asked his assistant to not disturb me: Saurabh Shukla recalls Kick incidentVeteran actor Saurabh Shukla recounts a filming incident where Salman Khan defended his acting approach during a scene in the movie Kick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/birthday-girl-alia-bhatt-highway-gamble-taking-career-risk-early-on-success-2693948-2025-03-15",
      "headline": "When Alia Bhatt took the Highway early in career, chose a path less travelledAlia Bhatt, who entered Bollywood thirteen years ago, defied the norms for female debutants by opting for challenging roles early in her career, with Highway. Her willingness to take risks has set her apart, establishing her as a versatile actor in the industry."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-retirement-test-odi-cricket-2694047-2025-03-15",
      "headline": "Virat Kohli: I might not have another Australia tour in meVirat Kohli sparked retirement rumours on Saturday, March 15 after he said that he might not have another tour of Australia in him. The senior batter said that he was at peace with whatever happened on the recent tour Down Under.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-retirement-u-turn-olympics-2694023-2025-03-15",
      "headline": "Virat Kohli to play in 2028 Olympics? India star on possible retirement U-turnVirat Kohli has joked that he might come out of T20I retirement to play in the LA Olympics in 2028. The senior Royal Challengers Bengaluru batter said that to be an Olympic champion would be a magnificent feeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-hardik-pandya-son-agastya-tilak-varma-mumbai-indians-2693983-2025-03-15",
      "headline": "Watch: Hardik Pandya's son Agastya wins Tilak Varma's heartHardik Pandya's son Agastya shocked Mumbai Indians' Tilak Varma in a beautiful show of sportsman's spirit. The moment was captured and then shared by the MI social media team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-ipl-2025-complete-schedule-full-pbks-fixtures-venues-match-dates-2693980-2025-03-15",
      "headline": "Punjab Kings IPL 2025 Complete Schedule: Full PBKS Fixtures, Venues, Match DatesPunjab Kings IPL 2025 Full Schedule, PBKS Squad: Aiming to end their playoffs jinx, Punjab Kings have brought in some big names to make a big push during the 2025 season. PBKS brought in Shreyas Iyer as their new captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-masters-vs-west-indies-masters-iml-final-livestreaming-sachin-tendulkar-vs-brain-lara-2693970-2025-03-15",
      "headline": "India Masters vs WI Masters IML Final Live streaming: When and where to watchCricketing legends Sachin Tendulkar and Brian Lara set to revive their iconic rivalry as India Masters and West Indies Masters battle for the IML crown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-preview-squad-analysis-schedule-predicted-xi-shreyas-iyer-ricky-ponting-2693963-2025-03-15",
      "headline": "PBKS preview: Project Punjab looks for lift off under Shreyas-PontingUnder the new regime of coach Ricky Ponting and captain Shreyas Iyer, Punjab Kings will look to end their playoffs jinx during IPL 2025. Punjab splashed the cash on big names and will be hoping for the rewards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-australian-grand-prix-race-timing-where-to-watch-2693956-2025-03-15",
      "headline": "Australian GP 2025 live streaming: When and where to watch season openerThe Australian Grand Prix returns as the season opener for the first time since Covid-19. Here's when and where you can watch the race in India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-starc-india-talent-depth-all-format-champions-trophy-2693955-2025-03-15",
      "headline": "IPL shows huge depth in Indian cricket: Australia's Mitchell StarcMitchell Starc lauded the IPL for highlighting India's incredible depth across all formats, crediting the franchise league for shaping a dominant Indian side under Rohit Sharma, which secured back-to-back ICC titles in the T20 World Cup and Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-2024-25-final-liverpool-vs-newcastle-united-team-news-livestreaming-details-2693930-2025-03-15",
      "headline": "Carabao Cup 2024-25 final, Liverpool vs Newcastle United: All you need to knowLiverpool and Newcastle United will lock horns for the Carabao Cup on Sunday, March 16 at the iconic Wembley Stadium. Here's all you need to know about the final as both teams eye their first trophy of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-zaheer-khan-lsg-fan-proposal-video-2693926-2025-03-15",
      "headline": "Watch: Fan who proposed Zaheer Khan on TV returns with another proposal after 20 yearsIPL 2025: The fan who proposed Zaheer Khan back in 2005 returned with another proposal when the former Indian fast bowler joined the Lucknow Super Giants camp a couple of days ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-preview-squad-analysis-schedule-predicted-xi-shreyas-iyer-ricky-ponting-2693963-2025-03-15",
      "headline": "PBKS preview: Project Punjab looks for lift off under Shreyas-PontingUnder the new regime of coach Ricky Ponting and captain Shreyas Iyer, Punjab Kings will look to end their playoffs jinx during IPL 2025. Punjab splashed the cash on big names and will be hoping for the rewards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-australian-grand-prix-race-timing-where-to-watch-2693956-2025-03-15",
      "headline": "Australian GP 2025 live streaming: When and where to watch season openerThe Australian Grand Prix returns as the season opener for the first time since Covid-19. Here's when and where you can watch the race in India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-starc-india-talent-depth-all-format-champions-trophy-2693955-2025-03-15",
      "headline": "IPL shows huge depth in Indian cricket: Australia's Mitchell StarcMitchell Starc lauded the IPL for highlighting India's incredible depth across all formats, crediting the franchise league for shaping a dominant Indian side under Rohit Sharma, which secured back-to-back ICC titles in the T20 World Cup and Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-2024-25-final-liverpool-vs-newcastle-united-team-news-livestreaming-details-2693930-2025-03-15",
      "headline": "Carabao Cup 2024-25 final, Liverpool vs Newcastle United: All you need to knowLiverpool and Newcastle United will lock horns for the Carabao Cup on Sunday, March 16 at the iconic Wembley Stadium. Here's all you need to know about the final as both teams eye their first trophy of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-zaheer-khan-lsg-fan-proposal-video-2693926-2025-03-15",
      "headline": "Watch: Fan who proposed Zaheer Khan on TV returns with another proposal after 20 yearsIPL 2025: The fan who proposed Zaheer Khan back in 2005 returned with another proposal when the former Indian fast bowler joined the Lucknow Super Giants camp a couple of days ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-joins-royal-challengers-bengaluru-squad-2693925-2025-03-15",
      "headline": "Virat Kohli joins Royal Challengers Bengaluru squad ahead of IPL 2025India star Virat Kohli arrived at the Royal Challengers Bengaluru team base on Saturday, March 15. Kohli will once again be the driving force as RCB look to win their first IPL title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-hardik-pandya-kashvee-gautam-bat-video-2693909-2025-03-15",
      "headline": "Watch: Hardik promises to gift 'biggest fan' Kashvee special batWPL 2025: Young all-rounder Kashvee Gautam met India men's all-rounder Hardik Pandya after the Gujarat Giants lost to Mumbai Indians in the Eliminator on Thursday at the Brabourne Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rohit-sharma-264-car-dream-11-ad-mumbai-indians-2693906-2025-03-15",
      "headline": "Rohit Sharma to lose famous 264 car? Indian captain left in tears during new adRohit Sharma is all set to lose his famous 264 car and the Indian captain was left in tears during a hilarious new ad that was released on Saturday, March 15. Rohit is set for his 18th season of the IPL this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-sunrisers-hyderabad-nitish-kumar-reddy-fit-for-season-2693896-2025-03-15",
      "headline": "Good news for SRH as Nitish Kumar Reddy given green light to join squadThere is some good news for Sunrisers Hyderabad fans as Nitish Kumar Reddy has been given the green light to join the squad ahead of the IPL 2025 season. Nitish has been on the sidelines since January this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-t20i-series-squads-streaming-salman-agha-2693886-2025-03-15",
      "headline": "New Zealand vs Pakistan T20I series: Squads, all you need to knowNZ vs PAK: Michael Bracewell's New Zealand and Salman Ali Agha's Pakistan are scheduled to cross swords in a five-match T20I series from Sunday, March 16 in Christchurch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-australian-grand-prix-qualifying-results-lando-norris-mclaren-2693879-2025-03-15",
      "headline": "Australian GP: Lando Norris pips Oscar Piastri for pole as McLaren secure 1-2Lando Norris edged past his teammate Oscar Piastri to secure pole position in the Australian Grand Prix qualifying on Saturday, March 15. Max Verstappen would start from third while the Ferrari drivers had a day to forget at the office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-vs-australia-nathan-mcsweeney-2693846-2025-03-15",
      "headline": "Was naive going into Jasprit Bumrah: Nathan McSweeney hails India pacerAustralia's Nathan McSweeney admitted that he was naive when going up against Jasprit Bumrah during the Border-Gavaskar Trophy last year. Bumrah troubled McSweeney throughout the first 3 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-aryna-sabalenka-indian-wells-final-2693838-2025-03-15",
      "headline": "Old mama vs kid: In awe of Andreeva, Sabalenka braces for finalIndian Wells 2025: World No.1 Aryna Sabalenka heaped praise on 17-year-old sensation Mirra Andreeva before taking on the Russian teenager in the final of the WTA 1000 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-t20i-series-squads-streaming-salman-agha-2693886-2025-03-15",
      "headline": "New Zealand vs Pakistan T20I series: Squads, all you need to knowNZ vs PAK: Michael Bracewell's New Zealand and Salman Ali Agha's Pakistan are scheduled to cross swords in a five-match T20I series from Sunday, March 16 in Christchurch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-australian-grand-prix-qualifying-results-lando-norris-mclaren-2693879-2025-03-15",
      "headline": "Australian GP: Lando Norris pips Oscar Piastri for pole as McLaren secure 1-2Lando Norris edged past his teammate Oscar Piastri to secure pole position in the Australian Grand Prix qualifying on Saturday, March 15. Max Verstappen would start from third while the Ferrari drivers had a day to forget at the office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-vs-australia-nathan-mcsweeney-2693846-2025-03-15",
      "headline": "Was naive going into Jasprit Bumrah: Nathan McSweeney hails India pacerAustralia's Nathan McSweeney admitted that he was naive when going up against Jasprit Bumrah during the Border-Gavaskar Trophy last year. Bumrah troubled McSweeney throughout the first 3 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-aryna-sabalenka-indian-wells-final-2693838-2025-03-15",
      "headline": "Old mama vs kid: In awe of Andreeva, Sabalenka braces for finalIndian Wells 2025: World No.1 Aryna Sabalenka heaped praise on 17-year-old sensation Mirra Andreeva before taking on the Russian teenager in the final of the WTA 1000 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-2025-full-race-calendar-driver-line-up-streaming-details-and-more-2693830-2025-03-15",
      "headline": "Formula One 2025: Full race calendar, driver line up, streaming details and moreThe F1 2025 season is all set to begin with 10 teams battling it out for the top prize. Here's all you need to know about the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wpl-2025-final-harmanpreet-kaur-brabourne-press-conference-2693826-2025-03-15",
      "headline": "MI know the conditions at Brabourne really well: Harmanpreet KaurWPL 2025 Fina, MI vs DC: Harmanpreet Kaur said that Mumbai Indians have knowledge of the conditions at the Brabourne Stadium and will be looking to make use of them in the summit clash against the Delhi Capitals on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-preview-squad-analysis-predicted-xi-sanju-samson-rahul-dravid-2693604-2025-03-15",
      "headline": "Can Sanju Samson find the route to glory with consistency?With a revamped squad and the arrival of head coach Rahul Dravid, Rajasthan Royals are eyeing a consistent campaign in IPL 2025. Key players like Samson, Jaiswal, Rana, and Archer will be crucial to their title ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-harmanpreet-kaur-mi-vs-dc-final-2693815-2025-03-15",
      "headline": "MI tired due to hectic schedule? Harmanpreet Kaur opens up before FinalWPL 2025: Harmanpreet Kaur said that playing four matches in the last six days hasn't affected the Mumbai Indians. On Saturday, MI will be aiming for their second title when they face DC at the Brabourne Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-mumbai-indians-delhi-capitals-final-preview-2693808-2025-03-15",
      "headline": "Mumbai Indians vs Delhi Capitals: Your complete guide to FinalWPL 2025: Having beaten Mumbai Indians in their last three meetings, Delhi Capitals may have the psychological advantage going into the grand finale on Saturday at the Brabourne Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-shocks-iga-swiatek-indian-wells-youngest-final-2693805-2025-03-15",
      "headline": "Mirra Andreeva shocks Iga Swiatek, youngest to reach final in 24 yearsIndian Wells 2025: 17-year-old Mirra Andreeva defeated World No.2 Iga Swiatek and booked a spot in the final of the tournament. Earlier, the Russian teen sensation also got the better of Elena Rybakina and Elina Svitolina, amongst other prominent names. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-can-field-2-3-international-teams-at-the-same-time-dinesh-karthik-2693779-2025-03-15",
      "headline": "India can field 2-3 international teams at the same time due to IPL: Dinesh KarthikFormer India wicketkeeper batter Dinesh Karthik has credited the Indian cricket team's depth due to the Indian Premier League (IPL) and said that they can field two-three international teams at the same time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cole-palmer-reveals-he-didnt-want-to-join-chelsea-glbs-2693785-2025-03-15",
      "headline": "Cole Palmer reveals he didn't want to join ChelseaCole Palmer admitted he initially resisted joining Chelsea, but his move from Manchester City has turned into a success, earning him major awards and establishing him as a key player.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-on-jasprit-bumrah-injury-ipl-2025-2693771-2025-03-14",
      "headline": "Jasprit Bumrah needs to be smarter, he's not young like before: Glenn McGrathLegendary Australia seamer Glenn McGrath feels India speedster Jasprit Bumrah needs to be smarter about his game going forward to avoid injuries as he's not getting any younger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/meg-lanning-not-fussed-about-past-delhi-capitals-vs-mumbai-indians-wpl-2025-2693764-2025-03-14",
      "headline": "Meg Lanning not fussed about past, confident of putting pressure on Mumbai in finalDelhi Capitals captain Meg Lanning said that she isn't thinking too much about the past matches ahead of the Women's Premier League 2025 (WPL 2025) final against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-womens-premier-league-2025-final-delhi-capitals-vs-mumbai-indians-2693724-2025-03-14",
      "headline": "WPL 2025: When and where to watch final between Mumbai Indians and Delhi Capitals?The final of the Women's Premier League 2025 (WPL 2025) will be played between Delhi Capitals and Mumbai Indians on Sunday, March 15 at Brabourne Stadium, Mumbai. Here's the complete broadcast and streaming details of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-vacation-wife-ritika-daughter-maldives-2693718-2025-03-14",
      "headline": "Rohit Sharma enjoys vacation with family in Maldives before IPL 2025: See picsAfter leading India to Champions Trophy glory, Rohit Sharma took a short holiday in the Maldives with his family. The India captain is expected to join the Mumbai Indians camp next week. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}