{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-wins-business-todays-business-icon-of-the-year-award-2697664-2025-03-23",
      "headline": "Kumar Mangalam Birla wins Business Today's Business Icon of the Year awardThe award recognises not only Kumar Mangalam Birla's achievements over the past three decades since he took over the reins of his family business at the tender age of 28, but also showcases his visionary approach in changing times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/kumar-mangalam-birla-honoured-business-icon-of-the-year-bt-mindrush-2697665-2025-03-23",
      "headline": "Kumar Mangalam Birla honoured with Business Icon of the Year at BT MindRushAt Business Today MindRush 2025, Aditya Birla Group Chairman Kumar Mangalam Birla was honoured with the 'Business Icon of the Year' award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-mindrush-2025-nitin-gadkari-tesla-entry-automotive-industry-india-growth-2697517-2025-03-22",
      "headline": "What does Tesla entry mean for India's automotive industry? Nitin Gadkari answersAt the Business Today Mindrush 2025 forum, Nitin Gadkari expressed confidence that India's automotive industry would become the second largest in the world in the next few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-viksit-bharat-vision-2047-on-track-aditya-birla-group-kumar-mangalam-birla-2697500-2025-03-22",
      "headline": "India on track to become 'Viksit Bharat' by 2047, says Kumar Mangalam BirlaAditya Birla Group Chairman Kumar Mangalam Birla said India is on track for Viksit Bharat 2047, crediting policy stability, infrastructure growth, and economic momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-withdraws-20-duty-on-onion-export-to-be-effective-from-april-1-2697490-2025-03-22",
      "headline": "Government withdraws 20% duty on Onion export, to be effective from April 1The Centre has removed the 20 per cent export duty on onions, effective April 1. The duty, imposed to ensure domestic availability, had been in place since September 2024. Despite restrictions, onion exports saw significant growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-retail-investors-lose-money-in-fo-trading-stock-market-think-they-are-smart-sebi-chief-money-loss-2697477-2025-03-22",
      "headline": "Overconfidence leading to F&O losses for retail investors, says Sebi chiefTuhin Kanta Pandey said that studies conducted by the market regulator, Sebi, show that 90% of retail investors lose money in the futures and options (F&O) segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-should-stock-market-traders-be-worried-about-today-sebi-chief-tuhin-kanta-pandey-answers-2697461-2025-03-22",
      "headline": "What should market traders be worried about today? Sebi chief answersSebi chief Tuhin Kanta Pandey pointed to India's efforts to negotiate bilateral trade agreements with the United States and pursue free trade agreements with various other nations as examples of strategic responses to global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/marico-chairman-harsh-mariwala-hiring-good-talent-market-share-company-growth-bt-mindrush-2025-2697459-2025-03-22",
      "headline": "Marico Chairman Harsh Mariwala says war for talent as crucial as market shareMarico Chairman Harsh Mariwala urged entrepreneurs to focus on building strong teams, saying the competition for skilled professionals is intense.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/motilal-oswal-explains-why-retail-investors-fail-to-make-money-from-stock-market-2697433-2025-03-22",
      "headline": "Motilal Oswal explains why retail investors fail to make money from stock marketMotilal Oswal cautioned that most retail investors are engaging in speculative short-term trading or investing in unknown companies, which often leads to losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nse-ceo-ashish-chauhan-retail-investors-derivatives-trade-warning-bt-mindrush-2025-2697396-2025-03-22",
      "headline": "NSE CEO Ashish Chauhan warns retail investors against derivatives tradingNSE chief Ashish Chauhan also advised investors not to believe market tips and discussions on social media platforms.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-you-should-opt-in-2025-26-income-tax-filing-2697107-2025-03-22",
      "headline": "Old vs new tax regime: Which one should you opt for in 2025-26?While the old tax regime promotes savings through tax benefits, the new one is simpler, involves less paperwork and reduces the chances of tax fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-income-tax-regime-what-to-choose-if-you-earn-rs-50-lakh-per-year-2696980-2025-03-21",
      "headline": "Old vs new income tax regime: What to choose if you earn Rs 50 lakh per yearTaxpayers should consider a few key factors before making a choice. The old regime allows deductions, whereas the new regime offers lower tax rates but no major deductions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-performs-badass-hukum-chepauk-csk-vs-mi-match-2697840-2025-03-23",
      "headline": "Anirudh Ravichander's roaring Hukum show sets Chepauk ablaze before CSK vs MISinger and composer Anirudh Ravichander set Chepauk Stadium ablaze with his electrifying 'Badass' performance on Sunday. He energised the crowd with his act ahead of the CSK vs MI match, creating an electrifying atmosphere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rashmika-mandanna-on-working-with-salman-khan-in-sikandar-what-could-be-bigger-than-that-2697816-2025-03-23",
      "headline": "Rashmika on working with Salman Khan in Sikandar: What could be bigger than thatActor Rashmika Mandanna is thrilled as she prepares for the grand release of Sikandar, where she stars alongside Salman Khan. Set to hit theatres on March 30, the film marks their first collaboration.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-31-year-age-gap-with-rashmika-mandanna-will-even-work-with-her-daughter-2697801-2025-03-23",
      "headline": "Salman Khan on 31-year age-gap with Rashmika: Will even work with her daughterSalman Khan addressed trolls over his tired look and age-gap criticism, saying he'll work with his heroines' daughters too. He also joked about proving to social media that he's still around."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-on-working-with-rashmika-mandanna-in-sikandar-she-reminds-me-of-my-younger-self-2697795-2025-03-23",
      "headline": "Salman Khan on working with Rashmika in Sikandar: She reminds me of my younger selfAt the Sikandar trailer launch event on Sunday, Salman Khan reminisced about working with his co-star Rashmika Mandanna. She also taught the superstar how to make her signature Korean finger heart gesture.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhay-deol-says-cousins-sunny-deol-bobby-deol-stayed-away-from-him-because-he-was-annoying-2697756-2025-03-23",
      "headline": "Abhay Deol says cousins Sunny, Bobby stayed away from him as he was annoyingAbhay Deol, part of a renowned Bollywood dynasty, opened up about a childhood shielded from glamour. Despite being the youngest, he shared experiences of being babied yet left out in a joint family setting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-trailer-salman-khan-rashmika-mandanna-action-dialoguebaazi-ar-murugadoss-2697698-2025-03-23",
      "headline": "Sikandar trailer: Salman Khan's Eid release packs punches, romance and dramaSalman Khan's Sikandar trailer promises high-octane action, dialoguebaazi and drama. Directed by AR Murugadoss, the Eid release also stars Rashmika Mandanna and Sathyaraj. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/avneet-kaur-says-was-touched-inappropriately-at-8-verbally-abused-by-director-2697743-2025-03-23",
      "headline": "Avneet Kaur says 'was touched inappropriately at 8, verbally abused by director'Avneet Kaur recalled being inappropriately touched at 8 and verbally abused by a director at 12. She also addressed filler rumours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-is-his-girlfriend-saba-azad-biggest-cheerleader-2697738-2025-03-23",
      "headline": "Hrithik Roshan is his girlfriend Saba Azad's biggest cheerleader. Here's proofSaba Azad dazzled in a glamorous outfit with her boyfriend Hrithik Roshan expressing his admiration. The 'Greek God' showered love on the post, calling her 'beautiful'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-loves-best-friend-selena-gomezs-new-album-i-said-i-love-you-first-with-fiance-benny-blanco-2697730-2025-03-23",
      "headline": "Taylor Swift 'loves' best friend Selena Gomez's new album with fiance Benny BlancoSelena Gomez and Benny Blanco's new album, I Said I Love You First, has been receiving widespread acclaim. The singer-actor's best friend, Taylor Swift, also joined in, giving a special shout-out on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kgf-yash-crashes-honey-singh-bengaluru-concert-agrees-for-collaboration-on-a-condition-2697708-2025-03-23",
      "headline": "Yash crashes Honey Singh's Bengaluru concert, agrees for collab on one conditionKGF star Yash surprised fans at Honey Singh's Bengaluru concert. The actor praised Singh and teased a collaboration only if Singh sings in Kannada. The rapper is currently on the Millionaire India Tour and will next perform in Chandigarh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-trailer-launch-makers-unveil-new-poster-2697701-2025-03-23",
      "headline": "Ahead of Sikandar trailer release, makers drop new poster featuring Salman KhanJust hours before the release of Salman Khan's Sikandar trailer, the makers unveiled a brand-new poster. The poster showcases the film's stellar ensemble cast, with the movie set to release on Eid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amaal-mallik-father-daboo-mallik-reacts-after-singer-cut-ties-with-family-2697688-2025-03-23",
      "headline": "I love you: Singer Amaal Mallik's father reacts after he cut ties with familyAmaal Mallik recently shared his struggles with depression and a strained relationship with his parents, Daboo and Jyoti Mallik. In response, Daboo Malik posted a heartfelt message on Instagram, marking his first public statement on the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-became-devdas-after-split-from-first-wife-reena-dutta-2697682-2025-03-23",
      "headline": "Aamir Khan became 'Devdas' after split from first wife: I drank entire bottle a dayAamir Khan revealed he turned to alcohol and fell into deep depression after his divorce from Reena Dutta. Calling himself a 'Devdas', he shared how he struggled for years before moving on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-becomes-a-hit-in-india-stephen-graham-cant-believe-it-2697672-2025-03-23",
      "headline": "Adolescence becomes a hit in India, Stephen Graham can't believe itActor and producer Stephen Graham expressed surprise over the growing popularity of his web series Adolescence in India. The series has captured the attention of Indian audiences, leading to a significant increase in viewership, within a week of its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neetu-kapoor-throwback-of-cuteness-granddaughter-samara-balam-pichkari-watch-2697671-2025-03-23",
      "headline": "Neetu Kapoor shares 'throwback of cuteness' featuring granddaughter SamaraNeetu Kapoor shared a throwback video of granddaughter Samara Sahni singing Balam Pichkari when she was 2-years-old. Riddhima Kapoor Sahni also wished her daughter with a montage of their pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-on-last-of-stars-tag-for-him-shah-rukh-khan-and-salman-khan-2697655-2025-03-23",
      "headline": "Aamir Khan on 'last of stars' tag for him, SRK and Salman: We won't even be countedAamir Khan reflected on the evolution of Bollywood stardom, suggesting that the era of the Khans is not the end of iconic stars. He also claimed that \"people would forget\" him, Shah Rukh Khan and Salman Khan in the future. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-on-historic-ipl-2025-performance-disha-patani-shah-rukh-khan-2697650-2025-03-23",
      "headline": "Let the world watch what we are: Shreya Ghoshal on her 'historic' IPL performanceShreya Ghoshal wowed fans at Eden Gardens during the IPL 2025 opening ceremony with a grand musical performance. Shah Rukh Khan, Disha Patani, and Karan Aujla also lit up the stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/david-warner-arrives-in-hyderabad-to-launch-trailer-of-debut-telugu-film-robinhood-2697639-2025-03-23",
      "headline": "David Warner arrives in Hyderabad to launch trailer of debut Telugu film RobinhoodDavid Warner is all set to make his debut in Telugu cinema with a cameo in Robinhood. He arrived in Hyderabad to launch the trailer. A fan-favourite in Telugu states, Warner shot his scenes in Australia in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-attends-cricket-event-with-eknath-shinde-to-support-tb-awareness-campaigm-2697634-2025-03-23",
      "headline": "Watch: Salman Khan attends cricket event to support TB awareness campaignSalman Khan attended a cricket match in Mumbai for TB awareness. He posed with Eknath Shinde, interacted with players, and impressed fans with his look. He will launch Sikander's trailer today."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/mark-carney-calls-snap-general-elections-april-28-canada-2697869-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada PM calls snap polls on April 28 to counter 'unjustified' Trump tariffsWith the threat of Donald Trump's additional tariff threat on Canada, Prime Minister Mark Carney announced a snap election for April 28, seeking to secure a huge mandate to take on the US President's trade war."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meerut-woman-muskan-rastog-saurabh-rajput-murder-forged-prescription-anti-anxiety-pills-sahil-shukla-2697883-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meerut woman forged prescription to buy anti-anxiety pills, drugged husbandMuskan Rastogi consulted a doctor claiming to have anxiety, researched the prescribed medicines online, and later forged a blank prescription to procure them, days before she killed her husband."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-comedy-show-eknath-shinde-maharashtra-shiv-sena-attack-case-2697896-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra's jokes on Eknath Shinde sparks row, Sena workers vandalise studioShiv Sena workers vandalised a hotel in Mumbai where comedian Kunal Kamra's show was recorded and demanded that an FIR be lodged against him over his remarks on Maharashtra Deputy Chief Minister Eknath Shinde."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-score-ms-dhoni-vignesh-puthur-chennai-2697879-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Noor Ahmed spins CSK to dominant win as MI's opening-day jinx continuesIPL 2025, CSK vs MI: Noor Ahmed's spin-bowling masterclass and steady fifties from Rachin Ravindra and Ruturaj Gaikwad helped Chennai Super Kings begin their campaign in style. Mumbai Indians lost their opening game for the last 14 years in the T20 league. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-gdb-survey-shows-61-oppose-interfaith-marriages-inter-caste-marriage-troll-2697704-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "61% oppose interfaith marriages; Chandigarh shocks, Kerala soothesSixty-one percent of respondents in India Today's inaugural Gross Domestic Behaviour survey opposed interfaith marriages, while 56% were against inter-caste unions. However, 90% of respondents in Chandigarh opposing interreligious marriages shows that the issue is beyond literacy and urbanity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/new-delhi-massive-rush-on-2-new-delhi-station-platforms-as-departure-of-5-trains-delayed-2697872-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Massive rush on 2 New Delhi station platforms as departure of 5 trains delayedHeavy passenger congestion was witnessed at New Delhi Railway Station's platforms 12 and 13 on Sunday night, leading to chaos as multiple train departures were delayed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/self-styled-christian-prophet-attacks-employees-slaps-woman-case-filed-video-surfaces-2697751-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjab's 'Yashu, Yashu' pastor Bajinder Singh seen thrashing man, womanA viral CCTV video shows self-proclaimed Christian prophet Bajinder Singh thrashing a man and a woman, sparking widespread outrage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/encounter-breaks-out-in-jammu-kashmirs-kathua-after-3-terrorists-spotted-sources-2697808-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Terrorists escape, girl injured in Kathua encounter; search ops to intensifyActing on an intelligence tip-off, security forces launched a massive search operation in the forest area near the international border at Hiranagar in Kathua district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-trailer-salman-khan-rashmika-mandanna-action-dialoguebaazi-ar-murugadoss-2697698-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sikandar trailer: Salman Khan's Eid release packs punches, romance and dramaSalman Khan's Sikandar trailer promises high-octane action, dialoguebaazi and drama. Directed by AR Murugadoss, the Eid release also stars Rashmika Mandanna and Sathyaraj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-wins-business-todays-business-icon-of-the-year-award-2697664-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumar Mangalam Birla wins Business Today's Business Icon of the Year awardThe award recognises not only Kumar Mangalam Birla's achievements over the past three decades since he took over the reins of his family business at the tender age of 28, but also showcases his visionary approach in changing times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-defends-samajwadi-mp-who-called-rajput-king-rana-sanga-a-traitor-2697811-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Akhilesh Yadav defends Samajwadi MP who called Rajput king Rana Sanga a 'traitor'Dismissing the criticism around Samajdwadi Party MP Ramjilal Suman's remark on Rana Sanga, Akhilesh Yadav argued that if BJP leaders can selectively revisit history to discuss figures like Aurangzeb, Suman's remarks should also be seen as part of historical discourse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-2025-mi-vs-csk-2697828-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: 43-year-old MS Dhoni affect lightning quick stumping in CSK vs MIMS Dhoni stunned the fans once again with some lightning-quick work behind the stumps. Dhoni's glove-work helped CSK see the back of Suryakumar Yadav on Sunday, March 23.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/which-milk-best-for-you-cow-buffalo-dairy-alternative-soya-almond-oat-children-toddler-breastfeeding-experts-say-this-2697470-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Which milk is best for you? Cow or buffalo milk, or a dairy alternativeFrom cow milk and buffalo milk to goat and camel milk, the dairy choices are plenty across India now. Dairy alternatives like oat milk, almond milk and soya milk have also flooded the market. There is confusion as to which is the best milk option. India Today Digital decodes that for you after speaking to experts and going through research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/in-bihar-poll-year-how-tejashwi-yadav-is-rewriting-his-playbook-2697753-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In Bihar poll year, how Tejashwi Yadav is rewriting his playbookQuestioning Nitish Kumar's jobs record, the RJD challenger is rejigging his caste strategy and wearing the Lalu legacy as a badge of honour rather than a liability\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-on-trade-deals-in-volatile-world-there-could-be-collateral-benefits-2697633-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trade deals a reality, but India First always: S Jaishankar ahead of pact with USUnion Minister S Jaishankar spoke about trade deals and negotiations and emphasised the need to assess their costs and benefits, especially in the current \"uncertain and volatile world.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-korean-family-us-vacation-missing-grand-canyon-las-vegas-trip-accident-police-2697805-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "South Korean family on vacation in US goes missing during trip to Las VegasJiyeon Lee, 33, her mother Taehee Kim, 59, and aunt Junghee Kim, 54, were on a vacation in the US and were last sighted in Arizona on March 13, their GPS data from the rented white BMW showed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-jojoba-oil-should-be-your-skins-top-food-2697029-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why jojoba oil should be your skin's top foodA common ingredient in many skin and haircare products, the moisturising and protecting qualities of jojoba oil make it a popular beauty staple \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-461-21-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: India Today News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-civic-body-intensifies-property-tax-recovery-as-defaulters-owe-rs-390-crore-2697796-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rs 390 crore owed to us by property tax defaulters: Bengaluru civic bodyBBMP is ramping up efforts to recover Rs 390 crore in unpaid property taxes from 3.49 lakh defaulters, including 1.73 lakh chronic non-payers and 1.76 lakh current-year defaulters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/murdered-meerut-man-saurabh-rajput-wife-muskan-lover-sahil-addicts-ask-for-drugs-jail-2697663-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Murdered Meerut man's wife, her lover refuse food, demand drugs in jail: SourcesSaurabh Rajput was allegedly drugged and then stabbed to death on March 4 before his body was dismembered and sealed in a drum with cement. Muskan and Sahil were arrested on March 18 when Rajput's family reported him missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-exposes-dark-side-of-social-media-for-young-minds-2697420-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Adolescence exposes dark side of social media for young mindsNetflix's Adolescence explores social media's impact on teenagers. Experts warn about its effects on self-worth, identity, and mental health, urging healthier digital habits and open conversations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/sushant-singh-rajput-death-case-cbi-closure-reports-magistrate-what-happens-2697773-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sushant Singh Rajput death case: What happens after closure report is filedThe CBI filed closure reports in two cases related to the death of actor Sushant Singh Rajput, concluding that no evidence was found to establish any foul play. However, the filing of a closure report does not automatically mean the case is closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pope-francis-discharge-pneumonia-vatican-2697630-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pope Francis's first public appearance in 5 weeks as he leaves hospitalPope Francis, 88, has made his first public appearance after a 38-day hospital stay for severe double pneumonia, requiring two months of rest and rehabilitation. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/gujarat-father-daughter-shot-at-us-store-virginia-after-man-waits-all-night-for-alcohol-2697686-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gujarat father-daughter shot dead at US store by man waiting for alcoholDescribing the moments leading up to their deaths, Pradeep's family said that the accused had been lurking around their department store all night. When Pradeep and Urmi arrived, he confronted them, questioning why the store had been closed, saying he had waited all night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-performs-badass-hukum-chepauk-csk-vs-mi-match-2697840-2025-03-23",
      "headline": "Anirudh Ravichander's roaring Hukum show sets Chepauk ablaze before CSK vs MISinger and composer Anirudh Ravichander set Chepauk Stadium ablaze with his electrifying 'Badass' performance on Sunday. He energised the crowd with his act ahead of the CSK vs MI match, creating an electrifying atmosphere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rashmika-mandanna-on-working-with-salman-khan-in-sikandar-what-could-be-bigger-than-that-2697816-2025-03-23",
      "headline": "Rashmika on working with Salman Khan in Sikandar: What could be bigger than thatActor Rashmika Mandanna is thrilled as she prepares for the grand release of Sikandar, where she stars alongside Salman Khan. Set to hit theatres on March 30, the film marks their first collaboration.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/salman-khan-sings-lag-ja-gale-at-sikandar-event-2697804-2025-03-23",
      "headline": "Salman Khan sings Lag Ja Gale at Sikandar event, asks media to joinSalman Khan showcased his singing skills at the Sikandar trailer launch on Sunday. When the host prompted him, after watching Rashmika Mandanna sing in the trailer, Khan effortlessly began crooning the lyrics, much to the delight of the audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-31-year-age-gap-with-rashmika-mandanna-will-even-work-with-her-daughter-2697801-2025-03-23",
      "headline": "Salman Khan on 31-year age-gap with Rashmika: Will even work with her daughterSalman Khan addressed trolls over his tired look and age-gap criticism, saying he'll work with his heroines' daughters too. He also joked about proving to social media that he's still around."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-202-csk-vs-mi-ms-dhoni-vignesh-puthur-kerala-spinner-video-2697907-2025-03-24",
      "headline": "Watch: MS Dhoni applauds Kerala spinner Vignesh Puthur in heartwarming momentIPL 2025, CSK vs MI: 24-year-old Kerala spinner, Vignesh Puthur, was starstruck when he had the opportunity to interact with MS Dhoni on Sunday in Chennai. Vignesh made a fine debut for MI, taking three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-deepak-chahar-hits-bat-csk-vs-mi-chennai-2697904-2025-03-24",
      "headline": "Watch: MS Dhoni playfully hits Deepak Chahar with bat in post-match banterIPL 2025, CSK vs MI: MS Dhoni was in the mood to have some fun as he playfully hit Deepak Chahar with his bat after Chennai Super Kings defeated Mumbai Indians by 4 wickets on Sunday, March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-batting-srh-vs-rr-2697885-2025-03-23",
      "headline": "Ishan turns round corner for SRH: 2 sessions a day at his academy in PatnaIshan Kishan, out of the national team and Mumbai Indians made a sensational comeback in IPL 2025. Ishan scored a hundred in his first match with SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-will-make-me-play-even-on-a-chair-ms-dhoni-2697884-2025-03-23",
      "headline": "MS Dhoni shuts down retirement rumours: Will take it one year at a timeLegendary India and Chennai Super Kings (CSK) wicketkeeper batter MS Dhoni addressed his retirement rumours and said that his team is even willing to play him on a chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-score-ms-dhoni-vignesh-puthur-chennai-2697879-2025-03-23",
      "headline": "Noor Ahmed spins CSK to dominant win as MI's opening-day jinx continuesIPL 2025, CSK vs MI: Noor Ahmed's spin-bowling masterclass and steady fifties from Rachin Ravindra and Ruturaj Gaikwad helped Chennai Super Kings begin their campaign in style. Mumbai Indians lost their opening game for the last 14 years in the T20 league. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vignesh-puthur-details-mumbai-indians-scouting-kerala-spinner-2697877-2025-03-23",
      "headline": "Who is Vignesh Puthur? Auto rickshaw driver's son is MI's latest scouting gemIPL 2025, CSK vs MI: 24-year-old Vignesh Puthur was scouted by Mumbai Indians when he was playing club cricket in Kerala. The left-arm wrist-spinner, an auto-rickshaw driver's son, was a net bowler with MI Cape Town in SA20 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-hundred-pat-cummins-srh-vs-rr-2697865-2025-03-23",
      "headline": "Kishan thanks Cummins, 'different' team environment after century-start at SRHIshan Kishan fit right into the scheme of SRH, hitting a terrific century in the first match of IPL 2025. Kishan spoke after the game and thanked captain Pat Cummins for the freedom that he was given.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-stumping-reactions-csk-vs-mi-2697863-2025-03-23",
      "headline": "MS Dhoni's stumping in CSK vs MI triggers meme rush: Gone in 0.12 secondsIPL 2025, CSK vs MI: MS Dhoni was at his vintage best, effecting a lightning-quick stumping to dismiss Suryakumar Yadav in the season's first El Clasico in Chennai. Here's how social media reacted to Dhoni's outstanding work with the gloves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-2025-mi-vs-csk-2697828-2025-03-23",
      "headline": "Watch: 43-year-old MS Dhoni affect lightning quick stumping in CSK vs MIMS Dhoni stunned the fans once again with some lightning-quick work behind the stumps. Dhoni's glove-work helped CSK see the back of Suryakumar Yadav on Sunday, March 23.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-registers-joint-most-ducks-csk-vs-mi-2697813-2025-03-23",
      "headline": "IPL 2025: Rohit Sharma registers joint-most ducks in tournament's historyMumbai Indians (MI) opening batter Rohit Sharma got dismissed for a four-ball duck against Chennai Super Kings (CSK) in Match 3 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-hundred-pat-cummins-srh-vs-rr-2697865-2025-03-23",
      "headline": "Kishan thanks Cummins, 'different' team environment after century-start at SRHIshan Kishan fit right into the scheme of SRH, hitting a terrific century in the first match of IPL 2025. Kishan spoke after the game and thanked captain Pat Cummins for the freedom that he was given.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-stumping-reactions-csk-vs-mi-2697863-2025-03-23",
      "headline": "MS Dhoni's stumping in CSK vs MI triggers meme rush: Gone in 0.12 secondsIPL 2025, CSK vs MI: MS Dhoni was at his vintage best, effecting a lightning-quick stumping to dismiss Suryakumar Yadav in the season's first El Clasico in Chennai. Here's how social media reacted to Dhoni's outstanding work with the gloves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-2025-mi-vs-csk-2697828-2025-03-23",
      "headline": "Watch: 43-year-old MS Dhoni affect lightning quick stumping in CSK vs MIMS Dhoni stunned the fans once again with some lightning-quick work behind the stumps. Dhoni's glove-work helped CSK see the back of Suryakumar Yadav on Sunday, March 23.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-registers-joint-most-ducks-csk-vs-mi-2697813-2025-03-23",
      "headline": "IPL 2025: Rohit Sharma registers joint-most ducks in tournament's historyMumbai Indians (MI) opening batter Rohit Sharma got dismissed for a four-ball duck against Chennai Super Kings (CSK) in Match 3 of the Indian Premier League 2025 (IPL 2025). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}