{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-oil-companies-trump-administration-boost-venezuelan-oil-production-glbs-2847180-2026-01-06",
      "headline": "US plans talks with oil companies on boosting Venezuela output after Maduro ousterThe meetings are crucial to the administration's hopes of getting top US oil companies back into the South American nation after its government, nearly two decades ago, took control of US-led energy operations there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-322-points-lower-nifty-below-26300-infosys-down-2-percent-2846840-2026-01-05",
      "headline": "Sensex closes 322 points lower, Nifty below 26,300; Infosys down 2%The S&P BSE Sensex was down by 322.39 points to close at 85,439.62, while the NSE Nifty50 lost 78.25 points to end at 26,250.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-warns-insurance-sector-risks-rising-costs-claims-stress-what-should-insurers-know-irdai-2846810-2026-01-05",
      "headline": "What worries RBI about India's insurance sector despite its stability?The RBI highlights that the insurance sector is systemically important because of its size, its role as a long-term investor, and its growing links with the wider financial system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-to-invest-in-gold-long-short-tem-outlook-etf-vs-sgb-vs-digital-gold-price-rate-gst-2846760-2026-01-05",
      "headline": "How investors can manage short-term uncertainty with digital gold, ETFs and SGBsFrom an investment perspective, buying physical gold may no longer be the most efficient choice. When purchasing physical gold, investors must pay 3% GST upfront, which immediately impacts returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-price-rising-again-key-reasons-explained-us-venezuela-tensions-2846720-2026-01-05",
      "headline": "Gold prices rise again as US–Venezuela tensions flare. Buy now or wait?Market participants say the latest geopolitical flare-up has reinforced gold's role as a hedge against uncertainty, at a time when investors are already navigating an uneasy global backdrop."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-in-india-irdai-annual-report-2024-2025-2846709-2026-01-05",
      "headline": "Mis-selling complaints are rising. Here's what IRDAI's latest report showsData in the IRDAI Annual Report 2024–25 shows that grievances categorised under Unfair Business Practices increased to 26,667 in FY25, up from 23,335 in FY24, a rise of around 14% year-on-year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/commodities/story/us-action-venezuela-oil-opportunity-beneift-india-reliance-ongc-share-price-commodities-2846675-2026-01-05",
      "headline": "US action on Venezuela's oil: Is there an opportunity for India?Indian oil refiners and upstream companies could still find opportunities if Venezuelan crude re-enters global markets and long-pending investments and payments are unlocked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/cupid-share-price-bse-reasons-behind-crash-explained-2846649-2026-01-05",
      "headline": "Cupid share price tumbles nearly 20%. Why is it falling today?Cupid shares have now fallen nearly 30% over the past five trading sessions, wiping out a significant portion of the gains made during a recent sharp rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-petrodollar-why-us-attack-venezuela-oil-dollar-explained-donald-trump-nicolas-maduro-2846630-2026-01-05",
      "headline": "Petrodollar power play: How oil dollars connect to the US attack on VenezuelaWhile Washington has cited narcoterrorism charges and security concerns, questions are being raised over whether Venezuela's vast oil reserves and its efforts to trade oil outside the US dollar system played a role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-belll-sensex-nifty-open-lower-it-stocks-decline-hcltech-infosys-metal-2846618-2026-01-05",
      "headline": "Sensex, Nifty open lower as IT stocks see decline in early tradeThe S&P BSE Sensex was down by 68.48 points to 85,693.53, while the NSE Nifty50 lost 15.35 points to 26,313.20 as of 9:23 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-new-ceo-tata-sons-global-search-campbell-wilson-exit-report-2846600-2026-01-05",
      "headline": "Unhappy with pace of change, Tata Group looks to replace Air India CEO: ReportGroup chairman N Chandrasekaran has spoken with chief executives of at least two large airlines based in the UK and the US. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/venezuela-oil-production-cuts-us-blockade-pdvsa-storage-chevron-shipments-glbs-2846558-2026-01-05",
      "headline": "Venezuela cuts crude output as US oil blockade chokes storageCaracas is in political crisis under an interim government after President Nicolas Maduro and his wife were captured by US forces on Saturday. The OPEC country's oil exports, its main source of revenue, are now at a standstill following a US blockade on tankers under sanctions and the seizure of two oil cargoes last month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-control-of-venezuelan-oil-could-unlock-usd-1-billion-in-dues-for-india-lift-output-2846543-2026-01-04",
      "headline": "US control of Venezuelan oil could unlock $1 billion in dues for India, lift outputA US-led takeover or restructuring of Venezuela's oil sector could help India recover nearly $1 billion in long-pending dues and revive crude production from fields operated by ONGC Videsh, analysts and industry sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gig-economy-10-minute-delivery-real-cost-india-zomato-instamart-zepto-bilinkit-2846257-2026-01-04",
      "headline": "Inside the gig economy: The real cost of your 10-minute deliveriesTen-minute deliveries have become part of everyday life in urban India. What makes that speed possible is rarely part of the conversation. Read on to understand the people, platforms and policies behind it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-salaried-indians-need-personal-finance-reset-2026-labour-codes-impact-2845893-2026-01-03",
      "headline": "Why salaried Indians need a personal finance reset in 2026Rising living costs, changing job patterns and sweeping labour law reforms are urging salaried Indians to rethink how secure their finances really are."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/gig-economy-debate-zomato-blinkit-eternal-deepinder-goyal-2845626-2026-01-02",
      "headline": "Ban gig work and you don't solve inequality: Eternal CEO Deepinder GoyalEternal founder Deepinder Goyal argued that the gig economy debate is less about wages and more about discomfort with inequality, warning that bans and over-regulation could erase livelihoods instead of fixing systemic gaps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-573-points-higher-nifty-hits-fresh-high-ntpc-up-5-percent-2845552-2026-01-02",
      "headline": "Sensex closes 573 points higher, Nifty hits fresh high; NTPC up 5%The S&P BSE Sensex added 573.41 points to close at 85,762.01, while the Nifty50 jumped 182 points to end at 26,328.55​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-to-rise-from-february-1-new-tax-calculation-explained-brand-name-cost-cess-2845490-2026-01-02",
      "headline": "Cigarettes to cost more from February 1. Here's how new rates will be decidedThe new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-itr-filing-window-closed-tax-refund-eligiblity-2845428-2026-01-02",
      "headline": "Missed the revised ITR filing deadline? Know what happens to tax refundIn most cases, refunds are issued within a few weeks to a few months. Delays may occur due to mismatches in TDS details, bank account validation issues, or cases selected for scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-update-brokerage-targets-views-buy-sell-hold-2845403-2026-01-02",
      "headline": "ITC shares tumble 4%, down 13% in 2 days: Buy the dip or stay away?The sharp sell-off comes after the finance ministry revised the taxation structure for cigarettes, effective February 1, 2026. Here is all you need to know. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shefali-shah-recalls-being-bullied-punched-and-called-telu-at-school-2847157-2026-01-05",
      "headline": "Shefali Shah recalls being bullied, punched and called 'telu' at school Shefali Shah has opened up about facing bullying and appearance-based judgments during her school years. The actor shared personal experiences of being mocked for her looks in a recent interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-shares-first-glimpse-of-daughter-saraayah-me-and-my-mini-2847132-2026-01-05",
      "headline": "Kiara Advani shares first glimpse of daughter Saraayah: Me and my mini Kiara Advani offered fans a rare look at her daughter Saraayah in a candid Instagram video. The video shows Kiara engaging her daughter in a lighthearted magazine reading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/owen-cooper-timothee-chalamet-hold-hands-pose-for-pics-at-critics-choice-2847085-2026-01-05",
      "headline": "Owen Cooper, Timothee Chalamet hold hands, pose for pics at Critics' Choice. Watch A video of Owen Cooper pausing to chat with Timothee Chalamet at the Critics' Choice Awards has gone viral. In the video, the duo can be seen sharing a candid discussion and posing for photographs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-birthday-fans-light-up-bangalore-with-posters-pics-toxic-teaser-2847073-2026-01-05",
      "headline": "As Yash's birthday nears, fans light up Bangalore with posters. See pics Ahead of his birthday, fans of actor Yash have put up posters across Bangalore to extend their greetings. The teaser for Yash's upcoming film Toxic is also scheduled to release on January 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zarina-wahab-says-family-concept-dead-in-hindi-films-still-alive-in-south-cinema-2847059-2026-01-05",
      "headline": "Zarina Wahab says family concept dead in Hindi films, still alive in South cinema Zarina Wahab praised Telugu cinema for making family-oriented films. The actor will next be seen in Prabhas's 'The RajaSaab'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/krrish-4-rakesh-roshan-debunks-rumours-of-rajat-bedi-playing-villain-2847047-2026-01-05",
      "headline": "Krrish 4: Rakesh Roshan debunks rumours of Rajat Bedi playing villain Director Rakesh Roshan clarified that actor Rajat Bedi will not appear as the villain in the upcoming film Krrish 4. He dispelled recent rumours that gained traction online in October 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/after-vijays-jana-nayagan-trailer-balakrishnas-bhagavanth-kesari-trends-on-ott-2847034-2026-01-05",
      "headline": "After Vijay's Jana Nayagan trailer, Balakrishna's Bhagavanth Kesari trends on OTT Balakrishna's 2023 film Bhagavanth Kesari is trending on OTT after the trailer of Jana Nayagan has triggered fresh discussion about the film among fans, who've drawn similarities"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saba-pataudi-calls-father-mansoor-ali-khan-the-hero-of-my-universe-2847055-2026-01-05",
      "headline": "Saba Pataudi calls father Mansoor Ali Khan the hero of my universe, shares pics Saba Pataudi paid a heartfelt tribute to her late father Mansoor Ali Khan Pataudi on his birth anniversary, calling him \"the hero of my universe\" and sharing rare photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/guillermo-del-toro-again-slams-generative-ai-calls-it-prelude-to-fascism-2846991-2026-01-05",
      "headline": "Guillermo del Toro again slams generative AI, calls it prelude to fascism Guillermo del Toro has said that people saying art is not important is \"always the prelude to fascism.\" The 'Frankenstein' director has been known for his criticism of generative AI in the past as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-hosts-japanese-chef-osawa-takamasa-for-a-special-biryani-feast-2846997-2026-01-05",
      "headline": "Ram Charan hosts Japanese chef Osawa Takamasa for a special biryani feast Japanese biryani chef Osawa Takamasa recently visited actor Ram Charan's residence. He not only prepared biryani for the actor and his family, but also gave a sneak peek into his home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/heeramandi-actor-jason-shah-opens-up-on-copy-paste-trend-in-indian-films-2847008-2026-01-05",
      "headline": "Heeramandi actor Jason Shah opens up on copy-paste trend in Indian films Heeramandi actor Jason Shah said Indian cinema needs more risk-taking filmmakers like Mohit Suri, as he feels the industry is stuck in a cycle of copying violent trends driven by audience demand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-what-went-wrong-with-the-buzz-around-thalapathy-vijays-film-2846961-2026-01-05",
      "headline": "Jana Nayagan: What went wrong with the buzz around Thalapathy Vijay's film? What was meant to be the final surge of excitement ahead of Thalapathy Vijay's farewell film instead exposed doubts around intent, clarity and execution, turning pre-release buzz into uneasy damage control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijays-jana-nayagan-advance-booking-signals-bumper-opening-rs-35-crore-in-already-2846974-2026-01-05",
      "headline": "Vijay's Jana Nayagan advance booking signals bumper opening; Rs 35 crore in already Thalapathy Vijay's upcoming film Jana Nayagan has already earned strong pre-release box office numbers worldwide, with massive overseas sales and significant interest in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-calls-ikkis-a-love-letter-to-peace-praises-dharmendra-agastya-nanda-2846970-2026-01-05",
      "headline": "Karan Johar calls Ikkis a love letter to peace, praises Dharmendra, Agastya Nanda Karan Johar praised Ikkis in a heartfelt Instagram post, calling it a powerful, humane anti-war film and lauding the performances of Dharmendra, Agastya Nanda and Jaideep Ahlawat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaaved-jaafery-criticises-present-dance-reality-shows-wants-boogie-woogie-2-2846901-2026-01-05",
      "headline": "Jaaved Jaafery criticises present dance reality shows, wants Boogie Woogie 2.0 Jaaved Jaaferi criticised the current dance reality shows and said that all of them look the same now. The actor was last seen in Ajay Devgn's 'De De Pyaar De 2' (2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ikkis-disclaimer-suggesting-not-to-trust-pakistanis-goes-viral-2846941-2026-01-05",
      "headline": "Ikkis disclaimer suggesting not to trust Pakistanis goes viral A disclaimer in the Hindi film Ikkis, addressing trust issues with Pakistan and the conduct of its military, has gone viral. The note clarifies the portrayal of a compassionate Pakistani character as an exception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-cute-throwback-and-family-moment-with-nick-jonas-malti-marie-2846925-2026-01-05",
      "headline": "Priyanka Chopra shares cute throwback and family moment with Nick, Malti: Blessed Priyanka Chopra Jonas shared an Instagram reel blending a childhood throwback with a present-day moment featuring Nick Jonas and daughter Malti, calling herself \"blessed.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ikkis-agastya-nanda-on-coming-from-a-renowned-film-family-not-my-legacy-to-own-2846890-2026-01-05",
      "headline": "Not my legacy to own: Ikkis' Agastya Nanda on coming from a renowned film family Newcomer Agastya Nanda, who is Amitabh Bachchan's grandson, recently opened up about the pressure that comes with being associated with a renowned film family. His latest film, Ikkis, is now out in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-teaser-release-january-8-new-avatar-gangster-drama-2846870-2026-01-05",
      "headline": "Exclusive: Yash's Toxic teaser to release on actor's 40th birthday The teaser for Toxic will be unveiled on Yash's 40th birthday, creating a special moment for fans. The film promises a bold, intense portrayal of Yash with a global gangster drama appeal."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ousted-venezuelan-president-nicolas-maduro-pleads-not-guilty-to-narco-terrorism-charges-in-us-court-2847142-2026-01-05",
      "headline": "Was captured, I am a decent man: Nicolas Maduro pleads not guilty in US courtPleading innocent in a US court, Maduro told the judge, \"I was captured,\" as he made his first court appearance on drug trafficking charges, adding, \"I am a decent man, the president of my country.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-operation-sindoor-trade-talks-us-diplomatic-outreach-trump-glbs-2847177-2026-01-06",
      "headline": "Exclusive: How India managed Trump, media, trade talks during Operation SindoorIndia launched Operation Sindoor while engaging the Trump administration in trade and security talks. This dual outreach aimed to manage geopolitical and economic interests amid rising tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/barry-pollack-lawyer-defending-nicolas-maduro-wikileaks-julian-assange-glbs-2847176-2026-01-06",
      "headline": "Meet the lawyer defending Nicolas Maduro who secured Julian Assange's releaseOver a career spanning more than three decades, Barry Pollack has defended corporate executives, political figures and defendants in high-profile federal trials. He is also among the few lawyers to have secured a full acquittal for a former Enron executive after the company's collapse."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hindu-man-shot-dead-in-bangladesh-fifth-incident-in-3-weeks-in-protest-hit-country-2847065-2026-01-05",
      "headline": "Hindu man shot dead in Bangladesh, fifth in 3 weeksThe deceased has been identified as Rana Pratap (45), son of Tushar Kanti Bairagi, a resident of Arua village in Keshabpur upazila. According to eyewitnesses and police sources, unidentified assailants opened fire on Rana Pratap while he was present at the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/xuv700-successor-mahindra-xuv-7xo-launched-in-india-priced-from-rs-1366-lakh-2847092-2026-01-05",
      "headline": "Mahindra XUV 7XO launched in India, price starts at Rs 13.66 lakhMahindra has unveiled the XUV 7XO in India as the successor to the XUV700, introducing updated styling, enhanced cabin technology and advanced safety features, with prices starting at Rs 13.66 lakh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/imd-weather-forecast-fog-condition-cold-wave-cyclone-storm-rains-temperature-2847006-2026-01-05",
      "headline": "Weather update: Dense fog and cold wave to grip India on TuesdayRecent dense fog episodes, with visibility dipping to zero meters in parts of Uttar Pradesh and Madhya Pradesh, signal ongoing transport disruptions and public safety risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-venezuela-conflict-live-updates-nicolas-maduro-arrest-new-york-court-un-legality-debate-oil-stakes-2846866-2026-01-05",
      "headline": "Live: Delcy Rodriguez formally sworn in as Venezuela Interim President amid Maduro's trialUS Strikes Venezuela Live Updates: Ousted Venezuelan leader Nicolás Maduro and his wife Cilia Flores entered a not-guilty plea on Monday, days after US Special Forces captured him in Caracas in Washington's biggest Latin American intervention since 1989. The 63-year-old faces four charges: narco-terrorism, conspiracy to import cocaine, and possession of machine guns and destructive devices. While Maduro loyalists retain control in Caracas, acting President Delcy Rodriguez has signalled willingness to engage the US, even as global powers condemn the seizure. Stay tuned to indiatoday.in for all the live updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-who-killed-ex-lover-nikitha-in-us-siphoned-off-lakhs-before-fleeing-alleges-her-sister-2847031-2026-01-05",
      "headline": "Indian man who killed ex-lover in US looted lakhs before fleeing, says her sisterIn her complaint to the Indian Embassy in the US, the victim's sister, Saraswati, detailed the amount of money which was taken by Arjun in the days leading to Nikitha's murder. According to the sister's complaint, the total amount Arjun thus owed to Nikitha's family was USD 4,500 (Rs 4.7 lakh)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/venezuela-news-who-is-president-nicolas-maduro-son-the-prince-nicolasito-narco-terror-link-us-arrest-ernesto-maduro-guerra-2847013-2026-01-05",
      "headline": "The Prince: Who is Maduro's son with a narco-terror linkAs US authorities put the now deposed President of Venezuela, Nicholas Maduro, before a Manhattan court, attention has turned to the whereabouts of his son, Nicolas Ernesto Maduro Guerra, known as 'The Prince'. Ernesto, who has so far been able to evade US custody, stands accused of the same charges of narco-terrorism that the US has levelled against his father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-pre-dawn-phone-call-nyt-reporter-venezuela-military-op-nicolas-maduro-capture-2846908-2026-01-05",
      "headline": "NYT reporter called Trump at 4.31 am after Venezuela Op. How US President reactedJust ten minutes after announcing the Venezuela strikes and Nicolas Maduro's capture, one of the most dramatic US military actions in decades, Donald Trump answered a cold call from a New York Times reporter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/security-scare-at-us-vice-president-jd-vances-house-after-intruder-breaks-in-2846946-2026-01-05",
      "headline": "Crazy person tried to break in: Vance on security scare at home, windows shatteredThe US Secret Service alerted Cincinnati police around 12.15 am, leading to the detention of a suspect. Authorities said the Vance family was not home and do not believe the residence was entered."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/delhi/story/congress-mp-claims-to-have-new-info-on-air-india-crash-seeks-update-from-ministry-2847016-2026-01-05",
      "headline": "Congress MP claims to have new info on Air India crash, seeks update from ministryThe Congress MP Karti P Chidambaram said that he is now seeking clarity and accountability in the Air India 171 crash matter. He has written a letter to Civil Aviation Minister Ram Mohan Naidu after claiming that new information in the case has emerged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/what-is-the-device-on-deepinder-goyals-temple-brain-monitor-wearable-explained-2846626-2026-01-05",
      "headline": "What is the device on Deepinder Goyal's temple? Brain-monitor wearable explainedZomato founder Deepinder Goyal appeared on a popular podcast wearing an unusual brain-monitoring wearable called Temple, sparking online buzz and memes as he explains how it tracks cerebral blood flow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-triple-murder-laxmi-nagar-man-surrenders-before-cops-after-killing-mother-siblings-in-2847017-2026-01-05",
      "headline": "Delhi man kills mother, sister and brother, walks into police station to confessThe 25-year-old man confessed to the police that he had killed his mother, and his two siblings, aged 24 and 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nicolas-maduro-india-connection-venezuela-ousted-president-wife-cilia-flores-spiritual-ties-sathya-sai-baba-picture-viral-2847091-2026-01-05",
      "headline": "Venezuela's ousted President Nicolas Maduro and his spiritual link to Sathya Sai BabaAs deposed Venezuelan leader Nicolas Maduro faces drug trafficking charges in the US, an old photograph showing him with Indian spiritual leader Sathya Sai Baba resurfaced online, highlighting his long-standing spiritual ties to India through his wife, Cilia Flores."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/maryland-nikita-murder-boyfriend-arjun-sharma-arrested-interpol-tamil-nadu-2846763-2026-01-05",
      "headline": "Indian who fled US after murdering Telugu ex-girlfriend arrested in Tamil NaduAn international manhunt concluded in Tamil Nadu with the arrest of Arjun Sharma, accused of murdering Telugu woman Nikita Godishala in the US and fleeing to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/maduro-dance-angered-trump-to-attack-venezuela-us-forces-caracas-2846616-2026-01-05",
      "headline": "One dance move too many: Maduro's regular TV gigs provoked Trump to bomb Venezuela?In a video that went viral, Maduro was shown bouncing to electronic music on state television while a recorded voice repeated in English, \"No crazy war\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-canada-mark-carney-administration-work-permit-changes-a-million-indian-migrants-at-risk-undocumented-residents-2846808-2026-01-05",
      "headline": "Canada's work permit changes to put over a million Indian immigrants at riskCanada could see a surge in undocumented residents by mid-2026 as more than two million work permits would expire this year, with Indians expected to account for nearly half of those at risk. The development comes amid tighter immigration caps under the Mark Carney administration that have narrowed pathways for temporary workers and students."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-beaten-to-death-after-argument-over-vehicle-parking-greater-noida-two-detained-2847129-2026-01-05",
      "headline": "30-year-old beaten to death after argument over vehicle parking in Noida; 2 detainedPolice said the victim Harkesh and his friend Mohit were attacked by a group of youths who were drinking after a cricket match. Two suspects have been detained, and the investigation is ongoing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-sacked-manchester-united-manager-boardroom-real-problem-2847033-2026-01-05",
      "headline": "Ruben Amorim wasn't a yes man and that's why Manchester United sacked himManchester United have sacked Ruben Amorim after 14 months in charge. However, what finally brought his time at Old Trafford to an end was not merely the club's position in the league table, but his willingness to challenge the authority of those above him, namely Omar Berrada, Jason Wilcox and others within the hierarchy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-shares-first-glimpse-of-daughter-saraayah-me-and-my-mini-2847132-2026-01-05",
      "headline": "Kiara Advani shares first glimpse of daughter Saraayah: Me and my miniKiara Advani offered fans a rare look at her daughter Saraayah in a candid Instagram video. The video shows Kiara engaging her daughter in a lighthearted magazine reading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-navy-insv-kaundinya-voyage-muscat-halfway-arabian-sea-porbandar-thepla-mango-pickle-oman-maritime-link-2846795-2026-01-05",
      "headline": "Kaundinya nears half of journey to Oman, thepla breakfast powers Day 8About a week into its maiden voyage from Porbandar to Muscat, the Indian Navy's stitched sailing vessel INSV Kaundinya is nearing the halfway mark. Early weather conditions slowed progress, but the ship is now back on course. Fresh rations have run out, and the crew has now switched to dry rations. They had thepla and pickle for breakfast on Day 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/ips-isha-singh-transferred-lady-singham-confronted-rebuked-tvk-bussy-anand-crowd-rally-stampede-2846617-2026-01-05",
      "headline": "Lady Singham, who confronted TVK leader seeking more crowd at rally, transferredDuring actor Vijay's Puducherry rally, IPS officer Isha Singh was seen snatching the mic from Bussy Anand mid-announcement. The fierce officer has now been transferred to Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/umar-khalids-partner-reveals-what-he-said-after-supreme-court-denied-him-bail-ab-yahi-zindagi-hai-2846892-2026-01-05",
      "headline": "Ab yahi zindagi hai: Umar Khalid's words to partner after being denied bailA bit of emotion, a bit of relief, this is how Umar Khalid reacted to his partner Banojyotsna Lahiri's brief questions. Ab yahi zindagi hai, Umar Khalid told his partner after she asked him if she could come and visit him, after the Supreme Court denied him bail."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-2026-season-malaysia-open-vimal-kumar-exclusive-2847181-2026-01-06",
      "headline": "Fresh, fit and focused: Can PV Sindhu return to her peak in 2026? At 30, P V Sindhu faces one of the most intriguing challenges of her career: proving that her best days are not in the rear-view mirror. With a series of marquee events lined up in 2026, the two-time Olympic medallist, fresh from an injury layoff, will be hoping for a strong start at this week's Malaysia Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-india-u19-dominate-south-africa-u19-eight-wicket-dls-win-seal-series-2847164-2026-01-05",
      "headline": "Captain Suryavanshi's 24-ball 68 seals YODI series win for India vs South Africa Vaibhav Suryavanshi's rapid 68 off 24 balls helped India seal an eight-wicket win against South Africa in the second youth ODI, via DLS method. Suryavanshi narrowly missed out on Rishabh Pant's record for the fastest fifty by an Indian in Youth ODIs during his whirlwind knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-2026-venue-change-icc-reply-aminul-islam-2847154-2026-01-05",
      "headline": "Bangladesh await ICC reply for next step after T20 World Cup venue change reply After requesting a venue change, Bangladesh Cricket Board president Aminul Islam says that they're waiting for a response from the ICC before taking the next step. Bangladesh cricket sent a letter to the sport's international governing body on Sunday, January 4. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricketer-tests-positive-for-doping-rajan-kumar-2847133-2026-01-05",
      "headline": "Indian cricketer tests positive for doping An Indian cricketer from Uttarakhand has failed the dope test, PTI reported on Monday, January 5. Rajan Kumar, who bowls left arm pace, has tested positive for three different substances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-pv-sindhu-indians-malaysia-open-2847128-2026-01-05",
      "headline": "Indian badminton looks for a reset as Lakshya, Sat-Chi begin season in 2026 Malaysia Open: Indian badminton endured a difficult season in 2025. As the 2026 season begins, Lakshya Sen, PV Sindhu and Satwik-Chirag will hope to raise their levels once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-relieve-head-coach-ruben-amorim-after-premier-league-struggles-2847121-2026-01-05",
      "headline": "Watch: After Manchester United sack, Ruben Amorim seen smiling in viral video Manchester United has dismissed head coach Ruben Amorim after just 14 months in charge, following the club's draw against Leeds. The decision comes as United sit sixth in the Premier League, with Darren Fletcher set to lead the team against Burnley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-vijay-hazare-trophy-delhi-vs-railways-ind-vs-nz-2847082-2026-01-05",
      "headline": "No Virat Kohli in Delhi's Vijay Hazare Trophy match against Railways Vijay Hazare Trophy: Senior batter Virat Kohli will not make his return to the Vijay Hazare Trophy in Delhi's next outing against Railways. DDCA president Rohan Jaitley had earlier showed confidence that Kohli would return to the VHT after his mini-break."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-sacked-manchester-united-manager-boardroom-real-problem-2847033-2026-01-05",
      "headline": "Ruben Amorim wasn't a yes man and that's why Manchester United sacked him Manchester United have sacked Ruben Amorim after 14 months in charge. However, what finally brought his time at Old Trafford to an end was not merely the club's position in the league table, but his willingness to challenge the authority of those above him, namely Omar Berrada, Jason Wilcox and others within the hierarchy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-ben-stokes-sanction-heated-on-field-exchange-marnus-labuschagne-2847064-2026-01-05",
      "headline": "Ashes: Ben Stokes unlikely to face sanction over heated exchange with Labuschagne England captain Ben Stokes was involved in a brief verbal exchange with Marnus Labuschagne on Day 2 of the Sydney Test, but the incident is viewed as trivial and is unlikely to attract any disciplinary action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-youtube-collaboration-mrbeast-invitation-ind-vs-nz-2847060-2026-01-05",
      "headline": "Kohli, I am trying to film with you: MrBeast sends another invite to India star World-renowned YouTuber MrBeast, aka James Stephen Donaldson, has sent another invite to India star Virat Kohli to collaborate for a new video for his channel. Kohli is set to represent India in the series against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/up-warriorz-await-coe-nod-on-pratikas-availability-for-wpl-coach-abhishek-nayar-2846927-2026-01-05",
      "headline": "UP Warriorz await BCCI nod on Pratika Rawal for WPL seasonUP Warriorz head coach Abhishek Nayar said on Monday that the franchise is awaiting a final decision from the BCCI's Centre of Excellence on the availability of India opener Pratika Rawal for the upcoming Women's Premier League season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/savita-punia-retirement-asian-games-la-olympics-2846973-2026-01-05",
      "headline": "Win Asian Games hockey gold, secure LA Olympics qualification and maybe retire: SavitaIndia's veteran goalkeeper Savita Punia has hinted that she may retire from the sport after winning the Asian Games gold this year and securing automatic qualification for the LA Olympics 2028. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-ruturaj-gaikwad-india-odi-snub-kris-srikkanth-2846918-2026-01-05",
      "headline": "Maybe Ruturaj Gaikwad should say I can keep wickets to get India selection: SrikkanthKris Srikkanth has joked that maybe Ruturaj Gaikwad will need to convince the Indian selectors that he can keep wickets to get his spot back in the side. Ruturaj was a surprise omission from the squad for the New Zealand series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nada-registered-testing-pool-2026-mandhana-rodrigues-athletics-surge-2846905-2026-01-05",
      "headline": "Smriti Mandhana, Jemimah added to national anti-doping agency's testing poolSmriti Mandhana and Jemimah Rodrigues have been added to the National Anti-Doping Agency's Registered Testing Pool for 2026. The expanded list highlights India's focus on aggressive testing ahead of the Commonwealth and Asian Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sack-ruben-amorim-board-row-premier-league-2846853-2026-01-05",
      "headline": "Manchester United reluctantly sack Ruben Amorim, offer bizarre explanationManchester United have reportedly sacked Ruben Amorim following the fallout with the club's board in recent days. Amorim's last game in charge came against Leeds United on Sunday, January 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/manpreet-singh-selection-conflict-hockey-india-pro-league-2026-world-cup-2846843-2026-01-05",
      "headline": "On the chopping block: The brewing power struggle over Manpreet Singh's futureA power struggle within Hockey India threatens Manpreet Singh's future, with selectors and coaches at odds as his 411-cap tally nears governing body president Dilip Tirkey's record. Will the 33-year-old remain part of the plans in a busy year that includes the World Cup in August?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-delhi-capitals-captain-wpl-marizanne-kapp-backs-captain-2846834-2026-01-05",
      "headline": "Jemimah Rodrigues should be India's next captain: Marizanne Kapp backs DC skipperMarizanne Kapp believes Jemimah Rodrigues has the leadership qualities to succeed Harmanpreet Kaur as India's next captain after being named Delhi Capitals' skipper for Women's Premier League 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-returns-to-lead-mumbai-vijay-hazare-trophy-spleen-injury-2846829-2026-01-05",
      "headline": "Fit-again Shreyas Iyer to captain Mumbai before New Zealand ODI seriesShreyas Iyer will captain Mumbai in their Vijay Hazare Trophy match against Himachal Pradesh in Jaipur on Tuesday. The fixture marks the Punjab Kings captain's return to competitive cricket following his recovery from a spleen injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-new-management-agency-roundglass-sports-tennis-grand-slam-2846824-2026-01-05",
      "headline": "Sumit Nagal begins 2026 with new tennis academy in ChandigarhSumit Nagal opens his 2026 season with a fresh off-court reset by joining Roundglass Sports. As results fluctuate, the partnership signals renewed focus on structure, stability and a strong return to form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-defends-jamie-smith-risky-shot-ashes-scg-test-criticism-2846807-2026-01-05",
      "headline": "Root defends England teammate's abysmal dismissal: Can't win games by survivingAshes: England batter Joe Root has defended teammate Jamie Smith after the wicketkeeper was criticised for his dismissal during the New Year's Test at the Sydney Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-decision-bangladeshi-golfers-pgti-india-bangladesh-tensions-ipl-2846793-2026-01-05",
      "headline": "Kapil Dev on Bangladesh players' participation in Golf Tour: No decision yetPGTI President Kapil Dev said no decision has yet been made on allowing Bangladeshi golfers to compete amid recent India-Bangladesh cricket tensions following Mustafizur Rahman's Indian Premier League 2026 snub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nikhil-nazar-on-ipl-ban-bangladesh-govt-under-tremendous-pressure-after-kkr-drops-mustafizur-ytvd-2846792-2026-01-05",
      "headline": "Bangladesh Govt Under 'Tremendous Pressure' After KKR Drops MustafizurFollowing the Bangladesh government's decision to ban the Indian Premier League (IPL) telecast indefinitely, sports analyst Nikhil Naz provides an in-depth analysis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-ai-photo-editing-privacy-concerns-grok-platform-response-2846779-2026-01-05",
      "headline": "Pratika Rawal strongly reacts after her edited photos go viral on social mediaAn account claiming to belong to Indian women's cricketer Pratika Rawal spoke out against unauthorised AI-edited photos circulating on social media platforms. Last year, Pratika was one of India's standout performers at the Women's World Cup held on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mansur-ali-khan-pataudi-cricket-resilience-eye-injury-leadership-2846728-2026-01-05",
      "headline": "How India's one-eyed Tiger overcame career-ending injury to score 2793 Test runsA serious eye injury threatened to end Mansur Ali Khan Pataudi's career before it began. Instead, he rebuilt his game, overcame profound limitations and went on to become one of Indian cricket's most influential captains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-comes-up-with-idea-to-help-arrest-indias-test-cricket-slide-report-2846776-2026-01-05",
      "headline": "Shubman Gill comes up with idea to help arrest India's Test cricket slide: ReportIndia's new Test captain Shubman Gill has reportedly proposed dedicated 15-day red-ball camps ahead of every Test series, as the team looks to arrest its slide following back-to-back home series defeats and revive its campaign in the World Test Championship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-england-jamie-smith-worst-ashes-dismissal-nasser-hussain-sydney-test-2846771-2026-01-05",
      "headline": "Former England captain blasts Jamie Smith's SCG Test dismissal: Worst of this AshesJamie Smith's rash dismissal at the SCG shifted England's momentum on Day 2. Nasser Hussain called it one of the worst shots of this Ashes, highlighting England's ongoing struggle with game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-5th-test-travis-head-joe-root-sydney-cricket-score-2846767-2026-01-05",
      "headline": "5th Test: Travis Head 91 follows Joe Root 160 in strong Aussie reply in SydneyAshes 5th Test: Any doubts about Australia's intensity were brushed aside as the hosts came up with an intense bowling show to bowl England out for 384 and then rode on Travis Head's unbeaten 91 off 87 balls to reach 166 for 2 at Stumps on Day 2 in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-steve-smith-ashes-2025-series-sydney-cricket-ground-2846734-2026-01-05",
      "headline": "Travis Head first Australian since Steve Smith with 500 runs in an Ashes editionTravis Head ended Australia's seven-year wait in the Ashes with a stellar 528 runs in the 2025 series. His dominant innings in the final Test at SCG kept Australia competitive despite a strong England total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-government-ban-ipl-telecast-after-mustafizur-rahman-kkr-row-2846745-2026-01-05",
      "headline": "Bangladesh orders indefinite ban on IPL telecast after Mustafizur Rahman rowThe Bangladesh government has imposed an indefinite ban on the telecast and promotion of the Indian Premier League (IPL) in response to the controversy over the removal of national fast bowler Mustafizur Rahman from the Kolkata Knight Riders squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-son-maheika-sharma-hardik-pandya-girlfriend-cute-moment-watch-video-ind-vs-nz-2846717-2026-01-05",
      "headline": "Watch: Rohit's son Ahaan shares adorable moment with Pandya's girlfriendA warm off-field moment involving Mahieka Sharma and Rohit Sharma's son went viral ahead of India's New Zealand ODIs. With the 2026 season beginning, focus also shifts to squad rotation and Rohit's form."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}