{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-roll-out-from-april-1-check-eligibility-and-benefits-2681864-2025-02-18",
      "headline": "Unified Pension Scheme to roll out from April 1. Check eligibility and benefitsUnder the new pension scheme, government employees will contribute 10% of their basic salary along with DA, while the government's contribution will rise from the previous 14% to 18.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elss-explained-check-tax-benefits-under-section-80c-and-other-key-details-2681815-2025-02-18",
      "headline": "ELSS explained: Check tax benefits under Section 80C and other key details ELSS offers market-linked returns and has the potential to generate higher long-term returns as compared to other Section 80C options, including PPF, ULIPS, and NPS, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-tariffs-could-hurt-indian-exports-which-sectors-are-at-risk-2681818-2025-02-18",
      "headline": "Trump's reciprocal tariffs could hurt Indian exports. Which sectors are at risk?While officials are still waiting for details on how these tariffs will be calculated, they are already preparing countermeasures and working on a trade deal proposal to reduce tariffs and boost two-way trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-from-days-low-to-close-flat-it-stocks-lead-recovery-2681781-2025-02-18",
      "headline": "Sensex, Nifty bounce back from day's low to close flat; IT stocks lead recoveryThe S&P BSE Sensex lost 29.47 points to close at 75,967.39, while the NSE Nifty50 was down by 14.20 points to end at 22,945.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-save-taxes-try-these-5-last-minute-investment-options-to-maximise-benefits-2681746-2025-02-18",
      "headline": "Want to save taxes? Try these 5 last-minute investment options to maximise benefitsThe Equity-Linked Savings Scheme (ELSS) is a popular tax-saving tool available under Section 80C, offering a lock-in period of three years. Under this, investments up to Rs 1.5 lakh are eligible for deductions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sugar-gets-costlier-prices-rise-65-percent-in-a-month-as-output-dips-sugar-mill-shutdown-2681770-2025-02-18",
      "headline": "Sugar gets costlier: Prices rise 6.5% in a month as output dipsSugar price hike: A drop in sugar output, caused by adverse weather and the reopening of sugar exports after two years, has led to a supply shortage, pushing up prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-will-taxpayers-with-late-itr-filings-lose-refunds-2681693-2025-02-18",
      "headline": "New Income Tax Bill: Will taxpayers with late ITR filings lose refunds?Late ITR filing refund concern: The Income Tax Act, 1961, does not prevent taxpayers from claiming a refund just because the return was filed after the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/licious-ipo-usd-2-billion-backed-by-temasek-public-listing-2026-profitability-report-2681690-2025-02-18",
      "headline": "Licious, backed by Temasek, preps for massive $2 billion IPO: Report Delightful Gourmet Pvt, the parent company of Licious, is expanding its physical store network and improving delivery times to compete with quick-commerce rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-smallcap-space-bloodbath-what-should-investors-do-2681686-2025-02-18",
      "headline": "Smallcap stocks are bleeding. What should investors do?Smallcap stocks have been battered by the persistent selling by foreign institutional investors (FIIs). A dismal Q3 earnings season has only worsened the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-overseas-bank-iob-rolls-out-aadhaar-based-account-opening-check-details-2681655-2025-02-18",
      "headline": "Indian Overseas Bank rolls out Aadhaar-based account opening. Check detailsThis new initiative allows customers to open savings bank accounts online with minimal documentation, as per Reserve Bank of India's eKYC guidelines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-weakness-continues-sensex-nifty-down-again-3-things-to-know-2681648-2025-02-18",
      "headline": "Sensex, Nifty tumble again as volatility grips Dalal Street. 3 things to knowStock Market Today, 18 Feb 2025: Dalal Street remains under pressure with no immediate relief in sight. Here are some key points investors should know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-eyes-india-entry-for-third-time-why-ev-giants-last-two-attempts-failed-2681614-2025-02-18",
      "headline": "Tesla eyes India entry for third time. Why EV giant's last two attempts failedTesla in India: Tesla has made two previous attempts to enter the Indian market, both of which ended in failure.  Here's a look at the reasons behind its past setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-here-is-the-list-of-job-openings-and-locations-elon-musk-pm-modi-meeting-2681601-2025-02-18",
      "headline": "Tesla begins hiring in India: Here's the list of job openings and locationsTesla India hiring: Tesla has posted 13 job openings on its LinkedIn page, covering both customer-facing and back-end roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-despite-it-stock-gains-metal-banking-drag-2681589-2025-02-18",
      "headline": "Sensex, Nifty open lower despite IT stock gains; metal, banking dragShare Market: The S&P BSE Sensex lost 105.42 points to 75,891.44, while the NSE Nifty50 was down by 57.15 points to 22,902.35 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-tips-dalal-street-continues-to-be-volatile-what-should-investors-do-expert-view-2681557-2025-02-18",
      "headline": "Dalal Street continues to be volatile: What should investors do? Dalal Street volatile: The S&P BSE Sensex gained 57.65 points to settle at 75,996.86, while the NSE Nifty50 added 30.25 points to close at 22,959.50. Despite this recovery, overall market sentiment remains cautious as investors react to various global and domestic factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-a-change-of-name-caused-bira-a-loss-of-rs-80-crore-check-details-2681372-2025-02-17",
      "headline": "How a change of name caused Bira a loss of Rs 80 crore. Check details Ahead of its IPO, B9 Beverages Private Ltd, the owner of Bira beer, changed its name to B9 Beverages Ltd, causing several compliance hurdles and sales disruptions.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-10-faqs-you-should-know-2681326-2025-02-17",
      "headline": "New Income Tax Bill: 10 FAQs you should knowNew Income Tax Bill 2025 explained: The current income tax bill which was enacted in 1961, and came into effect in 1962, consisted of 512,535 words and 819 sections. On the contrary, the new bill consists of 259,676 words, 23 chapters and 536 sections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-gains-600-points-nifty-recover-losses-to-end-marginally-higher-amid-volatility-2681266-2025-02-17",
      "headline": "Sensex, Nifty recover losses to end marginally higher amid volatilityThe S&P BSE Sensex gained 57.65 points to close at 75,996.86, while the NSE Nifty50 added 30.25 points to end at 22,959.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pfrda-warns-against-nps-apy-scams-issues-guidelines-to-stay-protected-2681238-2025-02-17",
      "headline": "Regulatory body warns against rising NPS scams, issues these guidelines The Pension Fund Regulatory and Development Authority (PFRDA) has cautioned subscribers of the National Pension Scheme (NPS) and Atal Pension Yojayna (APY) regarding fraudulent calls demanding money to release pension funds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-mulls-over-setting-a-reserve-fund-for-stable-epfo-interest-rates-2681191-2025-02-17",
      "headline": "Government may set up reserve fund for stable EPFO interest rates: ReportThe labour and employment ministry is conducting an internal study to explore the creation of an interest stabilisation reserve fund under the EPFO, sources said familiar with the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-know-about-eligibility-and-rs-30000-credit-cards-2680106-2025-02-17",
      "headline": "PM SVANidhi scheme: Know about eligibility and Rs 30,000 credit cardsPM SVANidhi scheme eligibility: Finance Minister Nirmala Sitharaman in her Budget 2025 speech announced providing credit cards under the PM SVANidhi scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-safe-in-co-operative-banks-safe-rbi-latest-curbs-on-new-india-co-operative-bank-raise-concern-2681213-2025-02-17",
      "headline": "Is your money safe in co-operative banks safe? RBI's latest curbs raise concernConcerns over New India Co-operative Bank's financial stability and a potential Rs 122 crore scam prompted the RBI to take strict action. This incident has added to the growing list of cooperative banks facing regulatory action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-inc-q3-results-worst-quarter-in-5-years-what-it-means-for-stock-market-views-2681211-2025-02-17",
      "headline": "India Inc sees worst quarter in 5 years: What it means for stock market? The recently concluded Q3 earnings season has been the weakest for India Inc since the first quarter of FY21, according to a report by domestic brokerage firm Motilal Oswal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mutual-fund-ceo-radhika-gupta-market-advice-bad-times-do-not-last-good-investors-do-2681158-2025-02-17",
      "headline": "Radhika Gupta on market volatility: Bad times don't last. Good investors doRadhika Gupta's advice comes as stock markets continue to witness a downward trend, with the sell-off in smallcap and midcap stocks intensifying. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senco-gold-stock-price-tumbles-32-in-2-sessions-heres-what-brokerages-say-2681155-2025-02-17",
      "headline": "Senco Gold share price tumbles 32% in 2 sessions. Here's what brokerages saySenco Gold stock price: The sell-off started on February 14 after the company reported its quarterly numbers showing profits plunged 69.3% to Rs 33.48 crore compared to Rs 109.32 crore a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-markets-down-volatility-up-3-factors-making-dalal-street-investors-nervous-2681132-2025-02-17",
      "headline": "Markets down, volatility up: 3 factors making Dalal Street investors nervousThe NSE Nifty50 has stumbled, dropping 3.2% in just eight trading sessions and slipping below the psychologically important 23,000 mark. The Sensex tells a similar tale of woe, falling over 3% to fall below 76,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-to-issue-hike-letters-soon-salary-raise-likely-between-4-to-8-percent-report-2681124-2025-02-17",
      "headline": "TCS to issue hike letters soon; salary raise likely between 4-8%: ReportThe annual salary hikes at leading IT firms have gradually reduced over the years. In FY24, TCS employees received an average hike of 7-9%, while in FY22, the hikes were around 10.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-avoid-smallcap-midcap-stocks-amid-ongoing-market-correction-2681104-2025-02-17",
      "headline": "Should you avoid smallcap, midcap stocks amid ongoing market correction?One of the primary reasons behind this downturn is the steep valuations of smallcap and midcap stocks, which analysts believe had reached unsustainable levels."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-600-points-3-reasons-why-stock-market-is-falling-today-q3-earning-fii-selling-2681093-2025-02-17",
      "headline": "Sensex tanks over 600 points: 3 reasons why stock market is falling todayStock market today: At 9:58 AM, the S&P BSE Sensex was down 577.20 points, trading at 75,362.01, while the NSE Nifty50 lost 176.30 points, standing at 22,752.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-fall-as-market-sell-off-continues-mahindra-shares-fall-4-percent-2681081-2025-02-17",
      "headline": "Sensex, Nifty fall as market sell-off continues; Mahindra shares fall 4% The S&P BSE Sensex lost 458.91 points to 75,480.30, while the NSE Nifty50 shed 145.70 points to 22,783.55 as of 9:42 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-what-is-tax-year-how-is-it-different-from-assessment-year-explained-2681059-2025-02-17",
      "headline": "New Income Tax bill: What is tax year? How is it different from assessment year?The new bill aims to simplify the existing Income Tax Act and one of the key changes introduced in the New Income Tax Bill, 2025, pertains to the concept of the 'tax year.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hexaware-technologies-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2681046-2025-02-17",
      "headline": "Hexaware Technologies IPO: Check allotment status, listing date and GMPHexaware Technologies IPO Allotment: Investors who applied for the IPO can check their allotment status online through the registrar, KFin Technologies, or via the Bombay Stock Exchange (BSE) website. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-israel-free-trade-deal-on-the-cards-what-it-means-for-both-nations-piyush-goyal-nir-barkat-2681036-2025-02-17",
      "headline": "India-Israel free trade deal on the cards: What it means for both nationsA group of over 100 Israeli companies visited India, and held more than 600 business meetings with Indian business leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-on-usd-21-million-fund-cut-for-voter-turnout-in-india-theyve-lot-of-money-2682095-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump on DOGE slashing 'voter turnout' funds for India: They have a lot of moneyUS President Donald Trump defended DOGE's decision to cancel $21 million for voter turnout in India, citing its strong economy and high tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/andhra-pradesh-issues-ramzan-order-for-muslims-after-bjp-uproar-over-similar-order-by-telangana-government-2682078-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After BJP uproar over Telangana's Ramzan order, similar move by ally in AndhraThe Andhra Pradesh government has allowed Muslim employees to leave work an hour early during Ramzan, days after Telangana's Congress government issued a similar order, which the BJP slammed as \"appeasement politics\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-signs-executive-order-to-make-ivf-more-affordable-2682087-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump signs order to lower IVF costs, auto tariffs set around 25%Donald Trump signed three executive orders on Tuesday, including one to make IVF more affordable in the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-student-suicide-bhubaneswar-kiit-university-protest-odisha-arrested-2681920-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 Odisha university staffers arrested after protests over Nepal student suicideFive officials, including two security guards, were arrested in connection with the alleged suicide of Nepali student Prakriti Lamsal at KIIT, Bhubaneswar. The arrests followed protests over her death and allegations of forceful actions against protesting students.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/at-home-enema-kits-are-now-on-amazon-would-you-try-one-for-good-poop-2681916-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enema, anytime? DIY kits for constipation relief are viralWhat to do when life is complicated, uhm sorry, constipated? Use at-home enema kits, apparently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhatrapati-sambhaji-maharaj-objectionable-comments-wikipedia-maharashtra-devendra-fadnavis-chhaava-2682002-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wikipedia gets police notice over 'objectionable' content on Sambhaji MaharajObjectionable comments about Chhatrapati Sambhaji Maharaj appeared on Wikipedia days after the release of Chhaava, a Bollywood film starring Vicky Kaushal, based on the life of the second Chhatrapati of the Maratha Empire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-russia-donald-trump-vladimir-putin-ukraine-war-zelenskyy-riyadh-meeting-appont-teams-2681928-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia 'won't tolerate' NATO membership to Ukraine, US agrees to another meetWashington and Moscow agreed to address longstanding tensions in the US-Russia bilateral relationship and the process will begin with efforts to resolve the war in Ukraine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-dismisses-claims-of-rift-in-mahayuti-shiv-sena-ncp-bjp-devendra-fadnavis-maharashtra-2682042-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Eknath Shinde denies rift with Devendra Fadnavis: No cold war between usMaharashtra Deputy Chief Minister Eknath Shinde said there was \"absolutely no cold war\" between him and Chief Minister Devendra Fadnavis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bharat-jodo-yatra-inspired-wedding-invite-takes-unity-in-diversity-to-next-level-2681960-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bharat Jodo Yatra inspired wedding invite takes unity in diversity to next levelA wedding invitation titled 'Bharat Jodo Vivah' celebrating the nuptials of a Jammu-based girl and a Kerala-based boy has warmed the hearts of many social media users. Inspired by Congress's Bharat Jodo Yatra, the card highlights the couple's cultural backgrounds, with personal invitations to Rahul and Priyanka Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-stampede-conflicting-accounts-railways-rpf-police-expose-critical-communication-gaps-2682000-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi stampede: Conflicting accounts expose critical communication gapsThe starkly conflicting versions from the Railways, Railway Protection Force (RPF), and Delhi Police about what happened on the night of Delhi stampede not only raise serious questions about the chain of command, but also highlight a significant communication gap among the agencies responsible for managing the station."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/prosecution-seeks-death-penalty-for-1984-anti-sikh-riots-convict-rarest-of-rare-crime-2682086-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prosecution seeks death penalty for 1984 riots convict: Rarest of rare crimeThe prosecution has sought the death penalty for ex-Congress leader Sajjan Kumar, convicted last week for killing two Sikhs in the 1984 riots, calling it graver than Nirbhaya as it targeted an entire community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-orders-termination-of-remaining-joe-biden-era-attorneys-says-we-must-clean-house-2682093-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump orders termination of remaining Biden-era attorneys: We must clean house US President Donald Trump announced on Tuesday he had ordered the Justice Department to fire all remaining Biden-era US attorneys, calling the department \"politicised like never before\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/what-ranveer-allahbadia-did-after-making-crass-joke-audience-member-reveals-2681751-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranveer Allahbadia did this after cracking obscene joke, claims 'audience member'In a now-viral video, a man who claimed to be a member of the audience during the shoot of the controversial episode of India's Got Latent, revealed what Ranveer Allahbadia did after cracking the obscene joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nat-sciver-brunt-gujarat-giants-mumbai-indians-2682041-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All-round Nat Sciver Brunt powers MI to crushing win over Gujarat GiantsWPL 2025: Nat Sciver Brunt put in an all-rounder performance as the Mumbai Indians (MI) beat the Gujarat Giants (GG) by five wickets on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-rajkot-maternity-hospital-private-videos-women-patients-sold-online-youtube-telegram-2682044-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Videos of women patients at Gujarat maternity hospital leaked, sold on TelegramVideos of women patients at Payal Maternity Hospital were uploaded to a YouTube channel, with access offered via a Telegram link for a fee ranging from Rs 999 to Rs 1,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-led-doge-team-allowed-to-access-student-data-despite-privacy-concerns-2682090-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Musk led DOGE team allowed to access student data despite privacy concernsA US judge rejected a bid to block Trump's Musk-led downsizing team from accessing federal student aid data in the US Education Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-government-schools-urdu-sanskrit-language-row-jawaharsingh-bedham-2681997-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Urdu replaced with Sanskrit in 2 Rajasthan government schools, move sparks rowA row erupted after the Rajasthan education department ordered the replacement of Urdu with Sanskrit in two government schools. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-qatar-strengthen-partnership-condemn-terrorism-as-amir-meets-pm-modi-2682032-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi, Qatar Emir condemn terrorism, elevate ties to 'strategic partnership'India and Qatar condemned terrorism, including cross-border attacks, and agreed to enhance cooperation in security, intelligence sharing, and cybercrime prevention. Prime Minister Narendra Modi and Qatar's Emir Sheikh Tamim Bin Hamad Al-Thani also discussed trade, energy, and regional issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-jabs-smriti-irani-past-usaid-role-george-soros-agent-bjp-claps-back-2681976-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress' 'Soros agent' jibe over Smriti Irani's past USAID role, BJP claps backCongress leaders Priyank Kharge and Pawan Khera took a jibe at former Union Minister Smriti Irani, calling her \"real agent of George Soros\". Amit Malviya hit back at the Congress and asked them to \"stop obsessing over Smriti Irani\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-diya-kumaris-lunch-became-a-talking-point-on-rajasthan-budget-2681936-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Diya Kumari's lunch became a talking point on Rajasthan Budget'Green' and 'clean' buzzed as the deputy CM cum finance minister offered broad indicators about her first full-fledged Budget, to be presented on February 19"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-lay-foundation-stone-of-worlds-2nd-highest-trek-in-uttarakhand-on-february-27-2682091-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM to lay foundation stone of world's 2nd highest trek in UttarakhandPrime Minister Narendra Modi will visit Gangotri Mukhba on February 27 to inaugurate Uttarakhand's winter yatra and lay the foundation for the Janaktal trek, the world's second-highest route, boosting winter tourism in the region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-volodymyr-zelenskyy-kremlin-us-talks-saudi-arabia-visit-postponed-2681963-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No decision on Ukraine war behind Kyiv's back: Zelenskyy on US-Russia talksUkrainian President Volodymyr Zelenskyy postponed his Saudi Arabia visit. He insisted that any peace talks must include Ukraine and stressed the need for US and European involvement in Kyiv's security guarantees.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-slams-samajwadi-party-for-urdu-bias-uttar-pradesh-vidhan-sabha-2681872-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath's 'English-medium' dig over Urdu translation demand in UP AssemblySamajwadi Party leader Mata Prasad Pandey demanded inclusion of the Urdu translation of House proceedings. The SP leader's remark evoked a sharp response from Yogi Adityanath, who slammed Akhilesh Yadav's party for advocating Urdu only."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/animal-music-composer-harshavardhan-rameshwar-on-prabhas-spirit-we-are-researching-different-tones-2681938-2025-02-19",
      "headline": "Animal music composer on Prabhas' Spirit: We are researching different tonesDirector Sandeep Reddy Vanga and composer Harshavardhan Rameshwar have commenced music sessions for Spirit, Prabhas' upcoming action film. The team is focusing on research and experimentation to create a unique soundscape for the cop drama."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/harsh-gujral-confirms-arjun-kapoor-is-single-after-break-up-with-malaika-arora-2682073-2025-02-18",
      "headline": "Harsh Gujral confirms Arjun Kapoor is single after break-up with Malaika AroraComedian Harsh Gujral recently confirmed Arjun Kapoor's single status during a press conference for their upcoming film. At the same event, Kapoor also shared insights on love triangles and relationship boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/drunk-man-tears-theatre-screen-while-watching-vicky-kaushal-chhaava-viral-video-report-2682061-2025-02-18",
      "headline": "Drunk man tears theatre screen while watching Chhaava: ReportA man, allegedly intoxicated, tore a theatre screen during the screening of Chhaava in Bharuch. The incident, captured on video, is under police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cine-workers-body-appeals-for-vicky-kaushals-chhaava-to-be-made-tax-free-2682001-2025-02-18",
      "headline": "Cine workers' body appeals for Vicky Kaushal's Chhaava to be made tax-freeThe Federation of Western India Cine Employees (FWICE) has appealed to Maharashtra's Chief Minister for tax-free status for the film, Chhaava. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-new-zealand-babar-azam-rizwan-2681994-2025-02-19",
      "headline": "Defending champions Pakistan face big test vs in-form New Zealand  Champions Trophy: Pakistan recently lost the tri-series final to New Zealand, but will be looking to make amends when the two teams face each other on February 19 at National Stadium in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-awais-ahmad-rohit-sharma-virat-kohli-2682077-2025-02-19",
      "headline": "Dream Champions Trophy chance: Viral Pakistani bowler relishes toe-crushers to RohitChampions Trophy 2025: In an interview with Sports Today, fast bowler Awais Ahmad talked about living his dream while bowling to Virat Kohli and Rohit Sharma during the Indian net session. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-live-streaming-karachi-pitch-report-playing-11-prediction-2682009-2025-02-19",
      "headline": "Pakistan vs New Zealand live streaming: Champions Trophy opener complete guide Champions Trophy 2025, Pakistan vs New Zealand: Defending champions Pakistan face familiar foes New Zealand on Wednesday in the first match of the tournament, which returns after 8 years. It's a crucial match for the hosts ahead of their big game against India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/tom-latham-braces-for-cracking-champions-trophy-opener-vs-pakistan-2682081-2025-02-19",
      "headline": "Tom Latham braces for 'cracking' Champions Trophy opener vs Pakistan Champions Trophy: Tom Latham said that he is expecting for a cracker of a game when New Zealand lock horns with Pakistan on February 19 at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nat-sciver-brunt-gujarat-giants-mumbai-indians-2682041-2025-02-18",
      "headline": "All-round Nat Sciver Brunt powers MI to crushing win over Gujarat GiantsWPL 2025: Nat Sciver Brunt put in an all-rounder performance as the Mumbai Indians (MI) beat the Gujarat Giants (GG) by five wickets on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-preview-team-ratings-podcast-india-pakistan-favourites-2682027-2025-02-18",
      "headline": "Champions Trophy preview and team ratings: Are India the favourites?The Champions Trophy returns to the cricket calendar after eight years, marking a significant moment for Pakistan, which hosts a major ICC event for the first time in 29 years. Eight teams will compete for the prestigious title, once famously dubbed the mini-World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-pakistan-opener-rachin-ravindra-update-tom-latham-2682021-2025-02-18",
      "headline": "New Zealand won't rush Rachin Ravindra's recovery for Pakistan openerChampions Trophy 2025: Wicketkeeper-batter Tom Latham, speaking to the press in Karachi on Tuesday, said New Zealand are wary of Rachin Ravindra's head injury and will not rush his recovery for the opening match on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-siraj-india-umrah-trip-2682017-2025-02-18",
      "headline": "Mohammed Siraj goes on Umrah trip ahead of Champions Trophy Indian fast bowler Mohammed Siraj embarked on a spiritual journey to Masjid Al Haram in Saudi Arabia ahead of the Champions Trophy, set to begin on February 19.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-latest-car-audi-rs-3-crore-customised-2681939-2025-02-18",
      "headline": "Watch: Neeraj Chopra adds Rs 3 crore beast to his collection of luxury cars Neeraj Chopra has added a Rs 3 crore customised SUV to his luxury car collection, featuring exclusive blue-themed details and high-performance upgrades. With a top speed of 305 km/h and a roaring custom exhaust, this the car is the most special addition to his garage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-g-kamalini-mumbai-indians-youngest-2681935-2025-02-18",
      "headline": "India U19 hero G Kamalini becomes youngest debutant with Mumbai Indians capWPL 2025: G Kamalini became the youngest debutant in the history of the tournament after getting her maiden cap for the Mumbai Indians (MI) in the clash against Gujarat Giants (GG) on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-pakistan-opener-rachin-ravindra-update-tom-latham-2682021-2025-02-18",
      "headline": "New Zealand won't rush Rachin Ravindra's recovery for Pakistan openerChampions Trophy 2025: Wicketkeeper-batter Tom Latham, speaking to the press in Karachi on Tuesday, said New Zealand are wary of Rachin Ravindra's head injury and will not rush his recovery for the opening match on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-siraj-india-umrah-trip-2682017-2025-02-18",
      "headline": "Mohammed Siraj goes on Umrah trip ahead of Champions Trophy Indian fast bowler Mohammed Siraj embarked on a spiritual journey to Masjid Al Haram in Saudi Arabia ahead of the Champions Trophy, set to begin on February 19.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-latest-car-audi-rs-3-crore-customised-2681939-2025-02-18",
      "headline": "Watch: Neeraj Chopra adds Rs 3 crore beast to his collection of luxury cars Neeraj Chopra has added a Rs 3 crore customised SUV to his luxury car collection, featuring exclusive blue-themed details and high-performance upgrades. With a top speed of 305 km/h and a roaring custom exhaust, this the car is the most special addition to his garage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-g-kamalini-mumbai-indians-youngest-2681935-2025-02-18",
      "headline": "India U19 hero G Kamalini becomes youngest debutant with Mumbai Indians capWPL 2025: G Kamalini became the youngest debutant in the history of the tournament after getting her maiden cap for the Mumbai Indians (MI) in the clash against Gujarat Giants (GG) on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}