{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahila-samman-yojana-all-you-need-to-know-about-delhi-rs-1000-scheme-2648850-2024-12-12",
      "headline": "Mahila Samman Yojana: Key details about Rs 1000 schemeThe AAP government announced Mahila Samman Yojana, offering Rs 1000 monthly to women in Delhi, with a rise to Rs 2100 if it wins in the upcoming elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-cools-to-548-in-november-from-621-in-october-2648835-2024-12-12",
      "headline": "Retail inflation cools to 5.48% in November from 6.21% in OctoberHouseholds across the world's most populous country are likely to welcome the inflation relief, given that food expenses dominate many family budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-dip-ahead-of-inflation-data-bearish-trend-persists-fmcg-banking-stocks-decline-2648821-2024-12-12",
      "headline": "Sensex, Nifty end lower ahead of inflation data; bearish trend persistsThe S&P BSE Sensex lost 236.18 points to close at 81,289.96, while the Nifty50 was down 93.10 points to end at 24,548.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/advance-tax-deadline-on-december-15-sunday-what-happens-if-you-miss-third-instalment-2648773-2024-12-12",
      "headline": "December 15 advance tax deadline: What you need to knowTaxpayers with liabilities exceeding Rs 10,000 are required to make quarterly advance tax payments to avoid penalties and interest charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/corporate-private-sector-companies-4x-profit-salaries-wages-stagnant-inflation-high-cea-nageswaran-2648775-2024-12-12",
      "headline": "Corporates see 4x profit but keep salaries stagnant: ReportPrivate companies in India have seen their profits hit a 15-year high but failed to give wages that could even beat inflation, shows a report. Despite making 4X profits in four years, the lower spending on wages is not just adding pressure on households, but hitting India's economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-cpi-data-today-december-12-3-things-you-should-know-rbi-2648776-2024-12-12",
      "headline": "Retail inflation data today. 3 things you should knowIn October, inflation rose to 6.2%, surpassing the Reserve Bank of India's (RBI) upper tolerance threshold of 6%, the first time in 14 months, since August 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ril-ntpc-green-mutual-fund-top-stock-picks-in-november-2648760-2024-12-12",
      "headline": "Swiggy, RIL, NTPC Green: Top stocks that mutual funds bought in NovemberSwiggy, which listed on November 13, attracted Rs 5,400 crore from mutual funds, while Zomato Ltd saw the highest MF investment at Rs 5,600 crore, driven by its qualified institutional placement (QIP). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-share-price-jumped-5-today-explained-2648756-2024-12-12",
      "headline": "Explained: Why Waaree Energies share price jumped 5% todayShares of Waaree Energies jumped over 5% during the trading session after it secured a project to develop a 170 MW solar power plant in Madhya Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-prices-go-past-usd-100000-mark-will-rally-continue-cryptocurrency-2648737-2024-12-12",
      "headline": " Yes, Bitcoin has breached the $100,000 mark but will it be able to sustain?Bitcoin's growing popularity has solidified its position as one of the most valuable assets in the world, with its market capitalisation ($1.95 Trillion) almost equalling the GDP of major economies like Canada and Brazil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crosses-100k-again-us-fed-rate-cut-hopes-drive-crypto-rally-2648689-2024-12-12",
      "headline": "Bitcoin crosses $100K again: What sparked the rally?On December 12, Bitcoin surpassed $100,000, bolstered by US inflation data and rate cut speculation, leading to a surge in altcoins and the overall crypto market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-up-2-percent-early-trade-interim-dividend-meeting-december-16-2648691-2024-12-12",
      "headline": "Explained: Why Vedanta share price gained 2% in early trade todayVedanta share price: Shares of the company gained as much as 2% in early trade, continuing its positive run for the past few sessions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shakti-pumps-share-price-5-percent-upper-circuit-today-2648670-2024-12-12",
      "headline": "Why Shakti Pumps share price hit 5% upper circuit today?Shakti Pumps share price: The stock was trading 5% higher at Rs 844.50 apiece on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-delta-corp-shares-fell-after-rising-sharply-in-previous-session-cea-remarks-2648331-2024-12-12",
      "headline": "Why Delta Corp shares fell after rising sharply in previous sessionDelta Corp shares opened lower today after witnessing a sudden climb of 8% yesterday driven by the Chief Economic Advisor's advocacy for balanced innovation in crypto and gaming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rekha-jhunjhunwala-backed-inventurus-knowledge-ipo-open-for-bidding-should-you-invest-review-latest-gmp-2648664-2024-12-12",
      "headline": "Rekha Jhunjhunwala-backed Inventurus Knowledge IPO opens: Should you invest? Inventurus Knowledge IPO: Investors need to bid for a minimum of one lot which has 11 shares in it amounting to Rs 14,619. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pf-withdrawal-directly-from-atms-from-2025-labour-secretary-epfo-2648652-2024-12-12",
      "headline": "PF withdrawals via ATMs likely from 2025. How will it work?PF withdrawal from ATMs: The planned measure is likely to enable claimants, beneficiaries, and insured individuals to access their PF funds with minimal human intervention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mtnl-share-price-jumps-over-12-today-whats-behind-the-rally-2648651-2024-12-12",
      "headline": "MTNL share price jumps over 12% today. What's behind the rally?MTNL share price: The rally came despite the telecom PSU announcing its inability to fund its semi-annual ESCROW account deposit due to insufficient funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-ipo-day-2-gmp-rises-sharply-should-you-subscribe-2648640-2024-12-12",
      "headline": "Mobikwik IPO day 2: GMP rises sharply, should you subscribe? Mobikwik IPO day 2: The grey market premium (GMP) for Mobikwik's IPO surged to Rs 149 on Day 2, up from the previous day, indicating a potential 53.41% listing gain over the upper price band of Rs 279 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/emerald-tyre-ipo-share-price-listing-nse-sme-open-at-90-percent-premium-over-ipo-price-2648628-2024-12-12",
      "headline": "Emerald Tyre IPO shares listing: Stocks open at 90% premium over IPO priceEmerald Tyre share price: Emerald Tyre's made a strong market debut on the NSE SME platform with its shares opening at Rs 180.50, a 90% premium over the issue price of Rs 95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-share-price-fall-reason-5-percent-shareholder-lock-in-period-anchor-investors-end-2648623-2024-12-12",
      "headline": "Explained: Why Bajaj Housing Finance shares fell 5% in early tradeThe share price of Bajaj Housing Finance has tanked close to 8% in the last five days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-higher-driven-by-rise-in-it-stocks-tech-mahindra-gains-2-percent-2648616-2024-12-12",
      "headline": "Sensex, Nifty open higher driven by rise in IT stocks; Tech Mahindra gains 2%The S&P BSE Sensex was up 112.25 points to 81,638.39, while the NSE Nifty50 added 22.20 points to 24,664.00 as of 9:30 AM. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/constitution-debate-in-lok-sabha-today-amid-bjp-congress-stand-off-in-both-houses-of-parliament-2649157-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid BJP-Congress standoff, stage set for Constitution debate in Lok Sabha todayThe debate in the Lok Sabha will open with Defence Minister Rajnath Singh leading the government's narrative. Prime Minister Narendra Modi will deliver the concluding remarks on Saturday, addressing both the debate and counterattacks from the Opposition, sources said. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/fire-tamil-nadu-hospital-dindigul-casualties-dead-injured-2649094-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "6 dead after fire breaks out at private hospital in Tamil Nadu's DindigulAt least six people died in a massive fire that broke out at a private hospital in Dindigul district. At least 29 patients from the hospital have been shifted to Dindigul Government Hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-garry-kasparov-d-gukesh-world-champion-vishy-children-india-2649128-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Era of Vishy's children dawns: Garry Kasparov on D Gukesh's historic triumphChess World Championship 2024: Legendary Garry Kasparov hailed 18-year-old D Gukesh's historic triumph as world champion on Thursday. The Russian great called it a pivotal moment for Indian chess and urged the nation to build on its remarkable success in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-schools-bomb-threat-phone-calls-fire-brigade-police-on-spot-east-of-kailash-cambridge-salwan-2649167-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3 schools in Delhi receive bomb threat via e-mail, police on spotAccording to the Delhi Police, authorities received an e-mail threatening to blow up three schools in the national capital at around 4.30 am on Friday. In its probe, the police have not recovered any suspicious items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-where-should-he-bat-brisbane-test-2649155-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where should Rohit Sharma bat in Brisbane Test?AUS vs IND: After the experiment to send Rohit Sharma at No.6 did not work out, India are faced with a conundrum before the third Test against Australia, starting December 14 at The Gabba in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-illegals-how-porous-border-with-bangladesh-threatens-india-security-2649058-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Operation Illegals: How porous border with Bangladesh threatens India's securityAn India Today team embarked on a week-long investigation along this North Bengal border with Bangladesh to uncover the vulnerabilities and their implications for national security."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-religious-conversion-hindus-chinmoy-das-iskcon-2649154-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Forced conversions take place at sword-point in Bangladesh, claims Iskcon priestIskcon Kolkata Vice President Radharaman Das has alleged that forced religious conversions under threats of violence are occurring in Bangladesh.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/rapper-sean-diddy-combs-drugged-raped-say-3-men-in-fresh-lawsuits-in-new-york-2649148-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rapper Sean 'Diddy' Combs drugged, raped us: 3 men file fresh cases in New YorkSean Combs allegedly drugged and raped multiple men using a consistent pattern of behaviour and then ensured their silence through threats and fear, the complainants' counsel alleged. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-gukesh-dommaraju-profile-world-champion-humility-greatness-anand-carlsen-2649166-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "King in the making: Wise beyond his years, Gukesh begins journey to greatnessChess World Championship 2024: At just 18, Gukesh Dommaraju's skill and relentless spirit earned him the coveted crown on Thursday. His humility and grace position him as a potential ambassador of the sport and a role model to many."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iit-kanpur-student-research-sholar-police-officer-acp-rape-2649140-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT Kanpur scholar files rape case against senior cop, officer transferredThe ACP, who enrolled at IIT-Kanpur for a PhD in cybercrime, allegedly developed a relationship with a research scholar, and promised to marry her after divorcing his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/86-indians-attacked-or-murdered-in-foreign-nations-in-2023-most-in-us-centre-2649160-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "86 Indians attacked or murdered in foreign nations in 2023, most in US: CentreAccording to data from the External Affairs Ministry, out of the 86 Indian nationals who were attacked or murdered in 2023,  the figures for the US stood at 12, while it was 10 each for Canada, the UK and Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/alien-predator-discovered-in-oceans-depth-scientists-name-it-darkness-2648757-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Alien predator discovered in the ocean's depth named DarknessThe species name camanchaca, which translates to \"darkness\", has been taken from indigenous languages in nearby western South America. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-honoured-at-red-sea-film-festival-reflects-on-25-years-in-cinema-2649168-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Priyanka Chopra honoured at Red Sea Film Festival, thanks Nick Jonas on stagePriyanka Chopra was honoured at the Red Sea Film Festival 2024 in Jeddah for her work in global cinema. She thanked Nick Jonas, her late father, family members and filmmakers she collaborated with."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-visa-bulletin-january-2025-indians-green-card-family-sponsored-eb-visa-employment-based-2648725-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indians moved ahead in green card queue: US Visa Bulletin delivers good newsIndians moved up in the queue for green cards in the US as the January 2025 Visa Bulletin revealed advancements in several family-sponsored and employment-based categories. Key updates include progress in final action dates across both visa categories, while filing dates remain largely unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-ding-liren-2649126-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "D Gukesh crowned world champion: How chess legends reacted to historic featChess greats, including Viswanathan Anand, Garry Kasparov and the Polgar sisters, were amongst the many who congratulated D Gukesh for his World Championship triumph. Gukesh defeated China's Ding Liren in the title match in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-president-corporate-tax-rate-incentives-industry-car-market-oil-and-gas-inflation-2649137-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump pledges to lower corporate tax to 15%, big incentives for US manufacturersDonald Trump pledged to lower the corporate tax rate from 21 per cent to 15 per cent and said that he is discussing with his advisers the possibility of reducing levies on capital gains and dividends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-shares-sweet-birthday-wish-for-coolest-and-bossest-rajinikanth-2649125-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRK shares sweet birthday wish for 'coolest and bossest' RajinikanthSuperstar Shah Rukh Khan on Thursday shared the sweetest birthday wish for megastar Rajinikanth. Sharing a photo of himself with the icon, SRK called Rajinikanth 'remarkably simple' and 'inspiring.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-sp-leaders-discordant-note-on-uddhav-sena-is-fresh-sign-of-fissures-in-mva-2648673-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why SP leader's discordant note on Uddhav Sena is fresh sign of fissures in MVAAbu Asim Azmi, the Samajwadi Party's Maharashtra president, doubts his party's continuance in the MVA should the Sena (UBT) return to hardline Hindutva after electoral reverses\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-sheila-dikshit-son-sandeep-dikshit-challenge-arvind-kejriwal-new-delhi-assembly-seat-held-since-2013-2649170-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Seeking revenge, Sheila Dikshit's son to challenge Arvind Kejriwal from New DelhiFormer Delhi Chief Minister Sheila Dikshit lost the New Delhi Assembly seat to Arvind Kejriwal in 2013 and 2015. Congress announced its first list of candidates for the Delhi elections, fielding Sandeep Dikshit from the New Delhi Assembly seat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-isi-northeast-india-bangladesh-visa-policy-security-threat-2649124-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Easy access to ISI in Bangladesh? Country's new Pak visa move sparks concernsBangladesh's decision to relax visa rules for Pakistani citizens, removing security clearance requirements, has raised alarms about potential ISI activity on its soil, with experts warning of implications for India's security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/toyota-urban-cruiser-ev-revealed-india-launch-in-2025-2649032-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Toyota Urban Cruiser EV revealed, India launch in 2025The Toyota Urban Cruiser EV is the badge-engineered Suzuki e Vitara. Both will be manufactured at Maruti Suzuki India's Gujarat plant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/four-indian-americans-among-1500-pardoned-by-us-president-joe-biden-2649141-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Four Indian-Americans among 1,500 granted clemency by Joe BidenFour Indian-Americans--Meera Sachdeva, Babubhai Patel, Krishna Mote, and Vikram Dutta--were among nearly 1,500 individuals granted clemency by US President Joe Biden. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-rs-1000-for-women-scheme-mukhyamantri-mahila-samman-yojana-arvind-kejriwal-election-atishi-2649142-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Delhi's Rs 1,000 for women scheme could be a non-starter before electionsDelhi's Rs 1,000 scheme for women could face delays before elections due to time constraints, the impending Model Code of Conduct (MCC), and logistical challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-class-11-student-kills-mother-stays-with-dead-body-for-six-days-in-gorakhpur-2649147-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Class 11 student kills mother, stays with dead body for six days in UPThe son pushed his mother, Aarti Verma, when she woke him up for school, causing serious injuries. Despite her bleeding, he left for school, and she later died, police said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-picture-perfect-day-in-australia-2649174-2024-12-13",
      "headline": "Family, burger, french fries: Anushka-Virat's picture-perfect day in AustraliaAnushka Sharma shared a glimpse of her 'best day ever' with Virat Kohli at Bluey's World in Brisbane, where the couple enjoyed a delightful family outing with their children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-honoured-at-red-sea-film-festival-reflects-on-25-years-in-cinema-2649168-2024-12-13",
      "headline": "Priyanka Chopra honoured at Red Sea Film Festival, thanks Nick Jonas on stagePriyanka Chopra was honoured at the Red Sea Film Festival 2024 in Jeddah for her work in global cinema. She thanked Nick Jonas, her late father, family members and filmmakers she collaborated with."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-shares-sweet-birthday-wish-for-coolest-and-bossest-rajinikanth-2649125-2024-12-13",
      "headline": "SRK shares sweet birthday wish for 'coolest and bossest' RajinikanthSuperstar Shah Rukh Khan on Thursday shared the sweetest birthday wish for megastar Rajinikanth. Sharing a photo of himself with the icon, SRK called Rajinikanth 'remarkably simple' and 'inspiring.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-injures-his-eye-on-housefull-5-set-2649059-2024-12-12",
      "headline": "Akshay Kumar injures his eye on Housefull 5 set: ReportBollywood star Akshay Kumar reportedly suffered from an eye injury while shooting for the comedy, Housefull 5. The incident took place while the actor was filming a stunt sequence. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-gukesh-dommaraju-profile-world-champion-humility-greatness-anand-carlsen-2649166-2024-12-13",
      "headline": "King in the making: Wise beyond his years, Gukesh begins journey to greatnessChess World Championship 2024: At just 18, Gukesh Dommaraju's skill and relentless spirit earned him the coveted crown on Thursday. His humility and grace position him as a potential ambassador of the sport and a role model to many."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-josh-hazlewood-returns-injury-scott-bolland-replacement-brisbane-test-2649169-2024-12-13",
      "headline": "Adelaide hero left out as Hazlewood returns to Australia XI for 3rd TestAustralia's Pat Cummins confirmed Josh Hazlewood's return for the Brisbane Test against India, replacing Scott Boland despite his solid Adelaide performance. Hazlewood missed out on the Adelaide Test due to a side strain injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-gillespie-pakistan-red-ball-coach-resigns-pcb-statement-gary-kirsten-aqib-javed-2649164-2024-12-13",
      "headline": "After Gary Kirsten, Jason Gillespie resigns as Pakistan cricket coachJason Gillespie stepped down as Pakistan's Test coach, citing irreconcilable differences with the PCB, just days before the South Africa series. This marks another blow to Pakistan cricket following Gary Kirsten's resignation as white-ball coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-where-should-he-bat-brisbane-test-2649155-2024-12-13",
      "headline": "Where should Rohit Sharma bat in Brisbane Test?AUS vs IND: After the experiment to send Rohit Sharma at No.6 did not work out, India are faced with a conundrum before the third Test against Australia, starting December 14 at The Gabba in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-ding-liren-2649126-2024-12-13",
      "headline": "D Gukesh crowned world champion: How chess legends reacted to historic featChess greats, including Viswanathan Anand, Garry Kasparov and the Polgar sisters, were amongst the many who congratulated D Gukesh for his World Championship triumph. Gukesh defeated China's Ding Liren in the title match in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-garry-kasparov-d-gukesh-world-champion-vishy-children-india-2649128-2024-12-13",
      "headline": "Era of Vishy's children dawns: Garry Kasparov on D Gukesh's historic triumphChess World Championship 2024: Legendary Garry Kasparov hailed 18-year-old D Gukesh's historic triumph as world champion on Thursday. The Russian great called it a pivotal moment for Indian chess and urged the nation to build on its remarkable success in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/13-year-old-vaibhav-suryavanshi-excited-to-train-under-rahul-dravid-at-rr-ipl-2025-2649098-2024-12-12",
      "headline": "13-year old Vaibhav Suryavanshi excited to train under Rahul Dravid at RRVaibhav Suryavanshi expressed his excitement about training under the legendary Rahul Dravid in IPL 2025 for Rajasthan Royals. Bought for Rs 1.10 crore, Suryavanshi became the youngest player to be sold in auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-sexual-harrasment-lahore-hc-2649091-2024-12-12",
      "headline": "Babar Azam's alleged sexual harassment case postponed by Lahore HCThe Lahore High Court postponed the hearing of the alleged rape case involving former Pakistan captain Babar Azam until December 16. Babar is currently taking part in the T20I series against South Africa. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-2649010-2024-12-12",
      "headline": "Heartbroken fan to world champion: How Gukesh was fuelled by Anand's lossD Gukesh recalled the times when he was present in the stands during the chess championship title clash between the legendary Viswanathan Anand and Magnus Carlsen in Chennai back in 2013. On Thursday, Gukesh won the championship after beating Ding Liren. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-australia-vs-india-kapil-dev-brisbane-test-2649055-2024-12-12",
      "headline": "Express yourself, give 100 percent: Kapil Dev's advice to India before Brisbane TestAUS vs IND: In an interview with India Today, Kapil Dev said that India need to express themselves and give their 100 percent to make a comeback in the five-match series after losing by 10 wickets at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gukesh-d-world-chess-championship-politicians-tycoons-celebrate-prodigy-2649034-2024-12-12",
      "headline": "'D Gukesh redefined brilliance': Politicians, tycoons celebrate historic chess winPoliticians and business leaders hailed D Gukesh's achievement as a moment of pride for India. He is now the youngest world champion in chess history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/13-year-old-vaibhav-suryavanshi-excited-to-train-under-rahul-dravid-at-rr-ipl-2025-2649098-2024-12-12",
      "headline": "13-year old Vaibhav Suryavanshi excited to train under Rahul Dravid at RRVaibhav Suryavanshi expressed his excitement about training under the legendary Rahul Dravid in IPL 2025 for Rajasthan Royals. Bought for Rs 1.10 crore, Suryavanshi became the youngest player to be sold in auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-sexual-harrasment-lahore-hc-2649091-2024-12-12",
      "headline": "Babar Azam's alleged sexual harassment case postponed by Lahore HCThe Lahore High Court postponed the hearing of the alleged rape case involving former Pakistan captain Babar Azam until December 16. Babar is currently taking part in the T20I series against South Africa. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-2649010-2024-12-12",
      "headline": "Heartbroken fan to world champion: How Gukesh was fuelled by Anand's lossD Gukesh recalled the times when he was present in the stands during the chess championship title clash between the legendary Viswanathan Anand and Magnus Carlsen in Chennai back in 2013. On Thursday, Gukesh won the championship after beating Ding Liren. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-australia-vs-india-kapil-dev-brisbane-test-2649055-2024-12-12",
      "headline": "Express yourself, give 100 percent: Kapil Dev's advice to India before Brisbane TestAUS vs IND: In an interview with India Today, Kapil Dev said that India need to express themselves and give their 100 percent to make a comeback in the five-match series after losing by 10 wickets at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gukesh-d-world-chess-championship-politicians-tycoons-celebrate-prodigy-2649034-2024-12-12",
      "headline": "'D Gukesh redefined brilliance': Politicians, tycoons celebrate historic chess winPoliticians and business leaders hailed D Gukesh's achievement as a moment of pride for India. He is now the youngest world champion in chess history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-asia-cup-2024-niki-prasad-captain-2649028-2024-12-12",
      "headline": "India name squad for U19 Women's Asia Cup, Niki Prasad to lead Niki Prasad will lead India in the upcoming U19 Women's Asia Cup 2024 to be held at the Bayuemas Cricket Oval in Kuala Lumpur in Malaysia. India will start their campaign against Pakistan on December 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/chess-viswanathan-anand-exclusive-gukesh-dommaraju-world-championship-win-2649027-2024-12-12",
      "headline": "Viswanathan Anand exclusive: Gukesh's world championship crown reward for his attitudeSpeaking to India Today after Gukesh Dommaraju won the World Chess Championship, legendary Viswanathan Anand lauded the teenager's never-say-die attitude. Gukesh defeated Ding Liren in the Championship match in Singapore. Anand was a proud mentor as Gukesh joined him in an exclusive club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-gukesh-world-champion-reaction-magnus-carlsen-level-ding-liren-tribute-2649021-2024-12-12",
      "headline": "Hungry for more, world champion D Gukesh targets Carlsen-level greatnessChess World Championship: Speaking after becoming the youngest-ever world champion, India's Dommaraju Gukesh said he dreams of emulating his idol Magnus Carlsen. Gukesh defeated Ding Liren of China in the Championship match in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-viral-video-of-11-year-old-gukesh-revealing-world-championship-dreams-2649013-2024-12-12",
      "headline": "Watch: Viral video of 11-year-old Gukesh revealing world championship dreamsAn 11-year-old D. Gukesh once confidently declared his dream of becoming the youngest World Chess Champion. Fast forward to 2024. That dream is now a reality. Watch the viral clip of a prodigy's remarkable journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/emotional-gukesh-hugs-father-amid-cheers-after-becoming-world-chess-champion-2649004-2024-12-12",
      "headline": "Watch: Emotional Gukesh hugs father amid cheers after becoming world championD Gukesh was emotional as he hugged his father and received a pat on his back after winning the world title. The 18-year-old defeated China's Ding Liren in the decisive Game 14 to clinch the prestigious title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/viswanathan-anand-thrilled-for-world-champion-d-gukesh-a-proud-moment-for-india-2648982-2024-12-12",
      "headline": "Viswanathan Anand thrilled for world champion D Gukesh: A Proud Moment for IndiaWishes pour in from across the country as D. Gukesh became the youngest World Chess Championship. The 18-year-old defeated China's Ding Liren in the decisive Game 14 to clinch the prestigious title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-congratulates-d-gukesh-for-historic-exemplary-world-chess-championship-win-2648980-2024-12-12",
      "headline": "PM congratulates D Gukesh on historic win: 'Unparalleled talent, hard work'Prime Minister Narendra Modi was thrilled for D Gukesh after the 18-year-old from Chennai became the youngest-ever world chess champion. Gukesh defeated Ding Liren in the decisive Game 14 of the Championship match in Singapore on Thursday, December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/emotional-gukesh-hugs-father-amid-cheers-after-becoming-world-chess-champion-2649004-2024-12-12",
      "headline": "Watch: Emotional Gukesh hugs father amid cheers after becoming world championD Gukesh was emotional as he hugged his father and received a pat on his back after winning the world title. The 18-year-old defeated China's Ding Liren in the decisive Game 14 to clinch the prestigious title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/viswanathan-anand-thrilled-for-world-champion-d-gukesh-a-proud-moment-for-india-2648982-2024-12-12",
      "headline": "Viswanathan Anand thrilled for world champion D Gukesh: A Proud Moment for IndiaWishes pour in from across the country as D. Gukesh became the youngest World Chess Championship. The 18-year-old defeated China's Ding Liren in the decisive Game 14 to clinch the prestigious title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-congratulates-d-gukesh-for-historic-exemplary-world-chess-championship-win-2648980-2024-12-12",
      "headline": "PM congratulates D Gukesh on historic win: 'Unparalleled talent, hard work'Prime Minister Narendra Modi was thrilled for D Gukesh after the 18-year-old from Chennai became the youngest-ever world chess champion. Gukesh defeated Ding Liren in the decisive Game 14 of the Championship match in Singapore on Thursday, December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-2024-d-gukesh-ding-liren-final-2648955-2024-12-12",
      "headline": "Watch: Gukesh cries tears of joy after historic World Championship win India's D Gukesh was in tears as he could not believe his luck after becoming the first teenager to win the World Chess Championship with a 7.5-6.5 win over Ding Liren. In the 14th game, with the scores locked at 6.5-6.5, Gukesh had the last laugh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohits-test-form-concern-for-india-ponting-reveals-ideal-batting-position-2648954-2024-12-12",
      "headline": "Rohit's Test form concern for India? Ponting reveals ideal batting positionRicky Ponting revealed Rohit Sharma's ideal batting position and mentioned if Indian captain's form has been a growing concern for the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-d-gukesh-vs-ding-liren-world-chess-championship-youngest-champion-2648943-2024-12-12",
      "headline": "India's D Gukesh becomes youngest-ever world chess championWorld Chess Championship 2024: India's D Gukesh became the youngest-ever world champion on Thursday, December 12. The 18-year-old defeated China's Ding Liren in the decisive Game 14 to clinch the prestigious title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-lauritz-knudsen-principal-sponsor-interview-naresh-kumar-2648915-2024-12-12",
      "headline": "IPL 2025: Lauritz Knudsen joins hands with 'fitting partner' Mumbai Indians IPL 2025: Speaking to India Today, Naresh Kumar, COO of Lauritz Knudsen, shed light on their landmark partnership with Mumbai Indians. The five-time champions announced their new principal sponsor on Thursday, December 12. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}