{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/this-is-a-hatchet-job-mahesh-jethmalani-on-adanis-us-indictment-2641154-2024-11-27",
      "headline": "This is a hatchet job: Mahesh Jethmalani on Adani's US indictmentIn an exclusive interview with India Today TV, senior advocate and former BJP Rajya Sabha MP Mahesh Jatmalani defended Gautam Adani and called the US indictment a 'hatchet job'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-share-price-rally-clarification-us-bribery-charges-should-you-buy-avoid-stocks-2641085-2024-11-27",
      "headline": "Adani shares rally after clarification on US bribery charges. Is the worst over? Adani Power shares closed 20% higher at Rs 525.30, Adani Total Gas gained 19.76% to Rs 694.25, and Adani Enterprises rose 11.56% to Rs 2,398.35. These were the top gainers among all the listed Adani Group companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-adani-group-stocks-rally-up-to-20-percent-2641039-2024-11-27",
      "headline": "Sensex, Nifty end higher as Adani stocks rally up to 20% The S&P BSE Sensex added 230.02 points to close at 80,234.08, while the NSE NIfty50 gained 82.20 points to end at 24,276.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-faces-cyberattack-fraudsters-steal-customer-data-demand-extortion-2641013-2024-11-27",
      "headline": "HDFC Life faces cyberattack: Fraudsters steal customer data, demand extortionThe breach occurred between November 19 and November 21, 2024 and the cybercriminals managed to steal personal information about HDFC Life's customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-18-percent-should-you-buy-now-or-wait-2640982-2024-11-27",
      "headline": "Ola Electric share price jumps 18%: Should you buy now or wait?The rally in Ola Electric shares followed the company's announcement of its new electric scooter lineup, which aims to make EVs more accessible across various segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-20-project-uses-existing-old-pan-card-valid-need-to-upgrade-expert-views-2640953-2024-11-27",
      "headline": "PAN 2.0: Will existing PAN card remain valid or do you need to upgrade?PAN 2.0: With an investment of Rs 1,435 crore, the government aims to introduce advanced Digital PAN/TAN services as part of this e-governance reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-multibagger-returns-qip-should-you-buy-stock-2640932-2024-11-27",
      "headline": "Zomato shares up 131% this year: Should you buy multibagger stock?Zomato share price: On Wednesday, the stock added another 3%, reaching an intraday high of Rs 289.70, inching closer to its September peak of Rs 298.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-enterprise-green-energy-shares-gain-up-to-5-after-clarification-on-us-bribery-charge-2640859-2024-11-27",
      "headline": "Adani Group stocks gain up to 17% after clarification on US bribery chargeAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 10% after a fresh clarification on the US bribery charges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-mobility-share-price-rises-sharply-new-range-of-electric-scooters-2640858-2024-11-27",
      "headline": "Explained: Ola Electric share price jumped 13% todayOla Electric Mobility share price opened at Rs 77.71 on the Bombay Stock Exchange (BSE), a 5% increase from the previous close of Rs 73.47, and touched a high of Rs 83.90, marking an increase of over 13%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stock-market-listing-should-you-hold-or-sell-2640846-2024-11-27",
      "headline": "NTPC Green Energy shares rise after listing. Should you hold or sell?NTPC Green Energy market listing: By 10:40 am, NTPC Green shares climbed further to Rs 120.80, signalling strong post-listing momentum. The upward movement in NTPC Green's share price defied expectations of a muted debut.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stocks-make-muted-debut-on-dalal-street-lists-at-3-percent-premium-2640834-2024-11-27",
      "headline": "NTPC Green Energy shares make muted debut on D-Street, lists at 3% premiumNTPC Green Energy listing: NTPC Green Energy shares opened at Rs 111.50 each on the NSE (National Stock Exchange), marking a 3.24% increase from the issue price of Rs 108."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2640828-2024-11-27",
      "headline": "Enviro Infra Engineers IPO allotment: Step-by-step guide to check statusEnviro Infra Engineers IPO allotment: Investors who have bid for the Enviro Infra Engineers IPO can check their allotment status through the online portals of the Bombay Stock Exchange (BSE) and Bigshare Services Pvt Ltd. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-green-energy-enterprises-shares-gain-2-percent-2640808-2024-11-27",
      "headline": "Sensex, Nifty open flat; Adani Green Energy shares gain 2%The S&P BSE Sensex was down 61.58 points to 79,942.48, while the NSE Nifty50 lost 13.55 points to 24,180.95 "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-ola-electric-mm-ntpc-green-energy-stocks-to-watch-today-2640797-2024-11-27",
      "headline": "Adani Green Energy, Ola Electric, M&M, NTPC Green Energy: Stocks to watch todaySeveral stocks such as NTPC Green Energy, Adani Green Energy, Ola Electric are expected to be in focus today. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-clarification-no-bribery-charges-against-gautam-adani-nephew-in-us-indictment-2640796-2024-11-27",
      "headline": "No bribery charges against Gautam Adani, nephew in US indictment: Adani GreenGautam Adani Bribery Case: Adani Green Energy Ltd (AGEL) highlighted that the charges in the US Department of Justice (DOJ) indictment and the civil complaint by the US Securities and Exchange Commission (SEC) do not include allegations of bribery or corruption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-money-net-worth-children-donates-usd-12-billion-unveils-plans-for-his-wealth-after-death-2640786-2024-11-27",
      "headline": "Warren Buffett donates $1.1 billion, reveals wealth distribution plan after deathWarren Buffett: In his latest letter to Berkshire Hathaway shareholders, the 94-year-old provided a deeply personal reflection on life's unpredictability and shared detailed plans for the distribution of his wealth after his passing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-stocks-drop-as-moodys-downgrades-outlook-for-7-entities-2640712-2024-11-26",
      "headline": "Adani stocks drop as Moody's downgrades outlook for 7 entitiesShares of Adani Group stocks dropped during Tuesday's session after Moody's downgraded the outlook for seven of its companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-on-china-can-india-gain-import-duty-explained-experts-factors-exports-2640315-2024-11-26",
      "headline": "Will India gain as Trump points tariff bazooka at China?US President-elect Donald Trump has announced punitive tariff measures against China, Canada and Mexico. Will India be able to overcome its challenges and seize this opportunity? This is what experts say.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/youth-unemployment-in-india-at-102-percent-says-union-labour-minister-shobha-karandlaje-2640498-2024-11-26",
      "headline": "Youth unemployment in India at 10.2%, says Union Labour ministerA report by the International Labour Organisation's (ILO) Institute for Human Development (IHD) shows the worldwide youth unemployment rate was 15.6% in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-listing-date-share-price-latest-gmp-market-debut-strong-or-muted-expert-view-2640484-2024-11-26",
      "headline": "NTPC Green Energy listing: What does latest GMP signal ahead of market debut? NTPC Green Energy listing: Shares of NTPC Green Energy Limited will make their debut on Dalal Sreet on Wednesday with investors eyeing a strong opening on the stock exchanges. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-leadership-devendra-fadnavis-eknath-shinde-ajit-pawar-delhi-tomorrow-maharashtra-chief-minister-2641034-2024-11-27",
      "headline": "Eknath Shinde says PM will have last word. Decks cleared for Devendra Fadnavis?Shiv Sena chief Eknath Shinde has left the decision on Maharashtra's next Chief Minister to Prime Minister Narendra Modi and the BJP leadership, with indications pointing to Devendra Fadnavis as the likely frontrunner.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/infant-skull-burnt-woman-skull-bones-missing-manipur-family-jiribam-violence-autopsy-report-2641299-2024-11-27",
      "headline": "Eyeballs missing, chopping wound, reveals autopsy of kidnapped Manipur infantThe latest autopsy report from Silchar Medical College and Hospital revealed that a 10-month-old boy named Laishram Lamnganba had both eyeballs missing from the sockets and his body in a state of thawing with a chopping wound and dislocation of the head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/adani-group-us-bribery-row-politically-motivated-sebi-congress-bjp-2641293-2024-11-27",
      "headline": "Politically motivated or scrutiny needed? What top lawyers said on fresh Adani rowWhile advocate Mahesh Jethmalani dismissed the US indictment alleging Adani Group bribery as \"politically motivated\", Congress MP Manish Tewari called for parliamentary discussion, highlighting regulatory accountability concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-air-india-pilot-found-dead-delhi-man-abetment-suicide-andheri-police-arrested-2641278-2024-11-27",
      "headline": "Air India pilot dies by suicide in Mumbai, boyfriend arrested for abetmentInitial investigations revealed that the pilot, Srishti Tuli, was being mentally harassed by Aditya Pandit and was struggling with mental health issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistam-islamabad-protest-imran-khan-aide-pti-gandapur-flees-bushra-bibi-crackdown-2641147-2024-11-27",
      "headline": "Imran Khan aide Gandapur does a hat-trick, flees protest site with Bushra BibiThe 'Final Call' for Imran Khan's release ended in a whimper as Ali Amin Gandapur, the CM of Khyber Pakhtunkhwa and Bushra Bibi, Khan's wife, fled the protest site amid a brutal crackdown. Gandapur, who left despite fervent appeals by protesters, has scored a hat-trick in fleeing protest sites since September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-nishikant-dubey-parliamentary-panel-waqf-amendment-bill-extension-2641130-2024-11-27",
      "headline": "After Opposition, BJP MP seeks more time for Parliamentary panel on Waqf billOpposition MPs have been seeking an extension of the JPC's tenure for the Waqf Amendment Bill. They argue that more time is required for stakeholders to present their cases, as the panel has only met 25 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-share-price-rally-clarification-us-bribery-charges-should-you-buy-avoid-stocks-2641085-2024-11-27",
      "headline": "Adani shares rally after clarification on US bribery charges. Is the worst over? Adani Power shares closed 20% higher at Rs 525.30, Adani Total Gas gained 19.76% to Rs 694.25, and Adani Enterprises rose 11.56% to Rs 2,398.35. These were the top gainers among all the listed Adani Group companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-review-opinions-analysis-2641281-2024-11-27",
      "headline": "IPL 2025 mega auction review: Which team did the best business in Jeddah?IPL 2025 Mega Auction: In the third edition of the Democratic Review System, we try to give our take on who actually won the IPL 2025 Auction in Jeddah. All the 10 teams splashed cash during the 2-day event to fill their spots for the new season. Did Gujarat Titans secure the win or were there other teams who can claim they had the best auction?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-chinmoy-krishna-das-bangladesh-hindu-monk-leader-sanatani-muhammad-yunus-government-profile-2640841-2024-11-27",
      "headline": "The Hindu monk who struck fear in the heart of Yunus government in BangladeshChinmoy Krishna Das Brahmachari rose from obscurity to become the undisputed leader of Hindus in Bangladesh. After getting lakhs to attend his rallies, the monk struck fear in the heart of the caretaker government, which has arrested him in a contentious sedition case. Here's more about the monk whom Iskcon Bangladesh found too hot to handle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-table-parliament-budget-session-2025-opposition-leaders-jpc-2641225-2024-11-27",
      "headline": "Waqf Bill likely to be deferred to Budget Session of Parliament 2025: SourcesThe Waqf Bill, aimed at reforming Waqf property management, faces delays as political discord stalls the Joint Parliamentary Committee's progress. It's now set for potential discussion in the Budget Session 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protests-hindu-monk-arrest-chinmay-krishna-das-high-court-petition-seeks-ban-iskcon-fundamentalist-organisation-2640924-2024-11-27",
      "headline": "Iskcon a fundamentalist organisation, Bangladesh tells court as plea seeks banA writ petition was filed in the Bangladesh High Court demanding a ban on Iskcon, a Hindu religious organisation. The development comes amid protests over the arrest of Hindu leader Chinmoy Krishna Das."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-and-aishwarya-rajinikanth-granted-divorce-2641275-2024-11-27",
      "headline": "Dhanush and Aishwarya Rajinikanth granted divorceDhanush and Aishwarya Rajinikanth were granted divorce by Chennai family court on November 27. The two were married for 18 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-rape-case-fir-consensual-relationship-false-marriage-charge-2641201-2024-11-27",
      "headline": "Supreme Court flags 'worrying trend' of rape cases after relationships turn sourThe Supreme Court held that a prolonged physical relationship between couples without protest or forcing to marry by the female partner indicated a consensual relationship rather than a relationship based on a false pretext of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-lire-game-3-report-score-2641173-2024-11-27",
      "headline": "D Gukesh bounces back, wins Game 3 to level match against Ding LirenChess World Championship: Indian Grandmaster D Gukesh, playing with white pieces, won Game 3 on Wednesday.  Reigning champion Ding Liren lost on time after a mad scramble. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/uk-woman-accidentally-throws-away-ex-partners-hard-drive-with-bitcoin-worth-rs-5900-crore-2641042-2024-11-27",
      "headline": "Woman accidentally dumps ex-partner's hard drive with Bitcoin worth Rs 5,900 croreA UK-based woman accidentally threw away her ex-partner's hard drive containing Bitcoin worth £569 million (Rs 5,900 crore approximately). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-shared-video-message-to-supporters-after-us-presidential-election-defeat-against-donald-trump-2641109-2024-11-27",
      "headline": "Kamala Harris shares video for supporters; have you been drinking, ask peopleUS Vice President Kamala Harris addressed her supporters for the first time through a video since losing the presidential election to Donald Trump on November 5. In the video, Harris appeared subdued, which made people ask if she had too many drinks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/do-women-commanders-in-army-face-training-gap-leaked-letter-sparks-debate-2640857-2024-11-27",
      "headline": "Do women commanders in army face training gap? Leaked letter sparks debateA senior officer's adverse review of eight women colonels under his command reflects the structural challenges in the Indian Army's transition towards gender neutrality\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-legal-dispute-surfaces-in-erstwhile-royal-family-of-bikaner-fir-2641139-2024-11-27",
      "headline": "After Udaipur, legal feud emerges within erstwhile royal family of BikanerA high-stakes property dispute has erupted in Bikaner's former royal family, with cross FIRs filed between MLA Siddhi Kumari and her aunt Rajyashree Kumari, alleging obstruction and misappropriation of assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/indians-paid-most-of-50-bn-that-us-earned-from-overseas-students-in-2023-2641026-2024-11-27",
      "headline": "Indians paid most of $50 bn that US earned from overseas students in 2023Around 29 per cent of international student admissions in the US in 2023-24 were of Indians, says the Department of State's Open Doors Report\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-cm-race-eknath-shinde-shiv-sena-hint-bjp-devendra-fadnavis-chief-minister-2641074-2024-11-27",
      "headline": "Who's next Maharashtra CM? Has Eknath Shinde dropped enough hints?Amid the suspense over the next Maharashtra Chief Minister, Shiv Sena chief Eknath Shinde dropped enough hints that he might not be in contention for the post. BJP MLAs were digging in their heels for Devendra Fadnavis. However, Shinde's body language suggested, whatever be the case, he hadn't got a raw deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-kochi-allu-arjun-rashmika-mandanna-sukumar-fahadh-faasil-2641049-2024-11-27",
      "headline": "Pushpa 2 Kochi event highlights: Allu Arjun praises Fahadh Faasil, Rashmika MandannaPushpa 2 Kochi event highlights: Allu Arjun and Rashmika Mandanna enthralled the crowd in Kochi on November 27. The duo, along with the crew, promoted their much anticipated film, Pushpa 2: The Rule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-influencer-explains-why-he-believed-beggar-frankfurt-techie-claim-2641084-2024-11-27",
      "headline": "Bengaluru influencer explains why he believed beggar's Frankfurt techie claimBengaluru-based influencer Sharath Yuvaraj documented a beggar's story who claimed he was once a techie from Frankfurt. The videos of his story went viral over the weekend. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-pradesh-vishakapatnam-anakapalli-gas-leak-pharma-company-dead-injured-paravada-tagore-2641141-2024-11-27",
      "headline": "1 dead, 8 hospitalised after gas leak at pharma company in AndhraFire department said that toxic gas mixed with hydrochloric acid and chlorine leaked from the Tagoor Laboratories in Andhra Pradesh's Anakapalli on Tuesday afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-slays-at-dubai-event-talks-about-harassment-against-women-2641378-2024-11-28",
      "headline": "Aishwarya Rai looks regal at Dubai event, talks about women empowermentAishwarya Rai Bachchan recently attended an event in Dubai. Looking regal, the actor emphasised women's empowerment and opportunities for women worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-says-fahadh-faasil-has-rocked-in-pushpa-2-calls-rashmika-mandanna-his-home-2641344-2024-11-27",
      "headline": "Allu Arjun says Fahadh Faasil has rocked in Pushpa 2, calls Rashmika his 'home'A grand pre-release event for Pushpa 2: The Rule was held in Kochi on November 27. At the event, Arjun spoke highly of his cast and crew, including Fahadh Faasil, Rashmika Mandanna, director Sukumar and composer Devi Sri Prasad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sreeleela-on-choosing-pushpa-2-kissik-song-rejected-many-but-this-is-not-a-regular-song-2641228-2024-11-27",
      "headline": "Sreeleela on doing Kissik: Rejected many, but this is not a regular songSreeleela recently shared her reasons for choosing to be part of the Pushpa 2: The Rule song, Kissik, during a media interaction. The song was released recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-says-it-was-difficult-to-earn-praise-from-lata-mangeshkar-2641297-2024-11-27",
      "headline": "AR Rahman says it was 'difficult to earn praise' from Lata MangeshkarAR Rahman recently shared insights into his experience of working with Lata Mangeshkar. Speaking at the International Film Festival of India (IFFI) in Goa, he praised her work and paid tribute to the legendary singer."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-and-spains-lamine-yamal-wins-2024-golden-boy-award-2641364-2024-11-27",
      "headline": "LaLiga: Barcelona and Spain's Lamine Yamal wins 2024 Golden Boy awardBarcelona's Lamine Yamal wins the 2024 Golden Boy award after a historic year. The 17-year-old played a key role in Spain's Euro 2024 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-bcci-pcb-icc-board-members-meeting-2641320-2024-11-27",
      "headline": "Champions Trophy 2025: What to expect from November 29 ICC Board meetingThe future of the ICC Champions Trophy 2025 is set to be decided during the ICC Board members meeting on November 29. Here are the key discussions likely to happen during the meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-ding-liren-game-three-analysis-2641306-2024-11-27",
      "headline": "Gukesh's comeback in World Chess Championship against Ding Liren isn't a surpriseGukesh's win against Ding Liren in the third game of the World Chess Championship continues the rich tradition where India's Grandmasters have never been bogged down despite an early setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-review-opinions-analysis-2641281-2024-11-27",
      "headline": "IPL 2025 mega auction review: Which team did the best business in Jeddah?IPL 2025 Mega Auction: In the third edition of the Democratic Review System, we try to give our take on who actually won the IPL 2025 Auction in Jeddah. All the 10 teams splashed cash during the 2-day event to fill their spots for the new season. Did Gujarat Titans secure the win or were there other teams who can claim they had the best auction?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rajat-patidar-madhya-pradesh-shreyas-iyer-mumbai-syed-mushtaq-ali-trophy-2024-25-2641273-2024-11-27",
      "headline": "SMAT 2024: Rajat Patidar, Shreyas Iyer set tounament ablaze with blistering knocksShreyas Iyer scored a breathtaking 71 (39) for Mumbai against Maharashtra in Syed Mushtaq Ali Trophy while Rajat Patidar scored 62 for Madhya Pradesh against Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-liam-livingstone-royal-challengers-bengaluru-chinnaswamy-stadium-2641268-2024-11-27",
      "headline": "RCB new man Liam Livingstone feels Bengaluru will be better for him than PunjabRCB's new addition, Liam Livingstone, feels that the Chinnaswamy stadium will be better suited to him than the ground in Punjab. Livingstone was one of the main buys for RCB during the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-baroda-vs-tamil-nadu-hardik-pandya-sixes-gurjapneet-singh-syed-mushtaq-ali-trophy-2641255-2024-11-27",
      "headline": "Watch: Hardik Pandya smashes CSK recruit Gurjapneet Singh for 4 sixes in an over Syed Mushtaq Ali Trophy 2024: Hardik Pandya's sensational knock of 69 (30 balls) helped Baroda beat Tamil Nadu in a Group B match in Indore on Wednesday, November 27. Hardik hit left-arm pacer Gurjapneet Singh for four sixes in an over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-ding-liren-game-3-win-magnus-carlsen-example-2641240-2024-11-27",
      "headline": "D Gukesh cites Magnus Carlsen example after overcoming slow start with Game 3 winIndian grandmaster D Gukesh cited the example of Magnus Carlsen after he overcame the slow start he made to the World Chess Championship match against Ding Liren. Gukesh secured the win in Game 3 against Liren on November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa-vs-sl-1st-test-south-africa-vs-sri-lanka-lahiru-kumara-vishwa-fernando-asitha-fernando-2641238-2024-11-27",
      "headline": "SA vs SL, 1st Test: Rain saves Proteas after Sri Lanka seamers run riot on Day 1Sri Lanka left South Africa reeling at 80/4 on Day 1 of the first Test in Durban as Lahiru Kumara picked up two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-modi-international-pv-sindhu-lakshya-sen-storm-into-round-2-2641226-2024-11-27",
      "headline": "Syed Modi International: PV Sindhu, Lakshya Sen storm into Round 2Top Indian shuttlers PV Sindhu and Lakshya Sen have advanced to the second round of the Syed Modi International Super 300 tournament. Both players secured straight-game victories in their respective singles matches on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-travis-head-australia-camp-rift-rumours-2641195-2024-11-27",
      "headline": "Travis Head denies rift in Australia camp: Boys hung out together last nightTravis Head has denied claims of a rift within the Australia camp after their loss in the Perth Test to India. Speculations had come in after Josh Hazlewood's comments at the end of Day 3 of the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-baroda-vs-tamil-nadu-hardik-pandya-sixes-gurjapneet-singh-syed-mushtaq-ali-trophy-2641255-2024-11-27",
      "headline": "Watch: Hardik Pandya smashes CSK recruit Gurjapneet Singh for 4 sixes in an over Syed Mushtaq Ali Trophy 2024: Hardik Pandya's sensational knock of 69 (30 balls) helped Baroda beat Tamil Nadu in a Group B match in Indore on Wednesday, November 27. Hardik hit left-arm pacer Gurjapneet Singh for four sixes in an over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-ding-liren-game-3-win-magnus-carlsen-example-2641240-2024-11-27",
      "headline": "D Gukesh cites Magnus Carlsen example after overcoming slow start with Game 3 winIndian grandmaster D Gukesh cited the example of Magnus Carlsen after he overcame the slow start he made to the World Chess Championship match against Ding Liren. Gukesh secured the win in Game 3 against Liren on November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa-vs-sl-1st-test-south-africa-vs-sri-lanka-lahiru-kumara-vishwa-fernando-asitha-fernando-2641238-2024-11-27",
      "headline": "SA vs SL, 1st Test: Rain saves Proteas after Sri Lanka seamers run riot on Day 1Sri Lanka left South Africa reeling at 80/4 on Day 1 of the first Test in Durban as Lahiru Kumara picked up two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-modi-international-pv-sindhu-lakshya-sen-storm-into-round-2-2641226-2024-11-27",
      "headline": "Syed Modi International: PV Sindhu, Lakshya Sen storm into Round 2Top Indian shuttlers PV Sindhu and Lakshya Sen have advanced to the second round of the Syed Modi International Super 300 tournament. Both players secured straight-game victories in their respective singles matches on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-travis-head-australia-camp-rift-rumours-2641195-2024-11-27",
      "headline": "Travis Head denies rift in Australia camp: Boys hung out together last nightTravis Head has denied claims of a rift within the Australia camp after their loss in the Perth Test to India. Speculations had come in after Josh Hazlewood's comments at the end of Day 3 of the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-umran-malik-ipl-2025-mega-auction-kolkata-knight-riders-kkr-2641175-2024-11-27",
      "headline": "Fully fit Umran Malik eager to help KKR win their 2nd consecutive IPL trophyIndia;s young fast bowling sensation Umran Malik said that he's excited to help Kolkata Knight Riders (KKR) win their second consecutive IPL trophy after being bought by the franchise for INR 75 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-lire-game-3-report-score-2641173-2024-11-27",
      "headline": "D Gukesh bounces back, wins Game 3 to level match against Ding LirenChess World Championship: Indian Grandmaster D Gukesh, playing with white pieces, won Game 3 on Wednesday.  Reigning champion Ding Liren lost on time after a mad scramble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-indian-super-league-mumbai-city-fc-vs-punjab-fc-yoell-van-nieff-meets-angry-fans-video-2641143-2024-11-27",
      "headline": "Watch: Mumbai City player tries to pacify disgruntled fans after ISL match lossFollowing Mumbai City FC's 3-0 loss to Punjab, midfielder Yoell van Nieff engaged with fans post-match, urging them to support the team even in losses. The loss meant that Mumbai are currently 10th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-perth-test-hundred-glenn-maxwell-border-gavaskar-trophy-australia-vs-india-2641132-2024-11-27",
      "headline": "Yashavi Jaiswal will get more than 40 Test hundreds: Glenn MaxwellStar Australia all rounder Glenn Maxwell has said that that young India opener Yashasvi Jaiswal will score over 40 centuries in his Test career."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/football-pep-guardiola-clarification-instagram-statement-nose-scratch-harm-2641120-2024-11-27",
      "headline": "Pep Guardiola clarifies 'want to hurt myself' comment with statement on InstagramManchester City manager Pep Guardiola said he did not intend to 'make light of a serious issue' when he made a bizarre comment about scratches on his face after their Champions League draw to Feyenoord on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/faf-du-plessis-bids-goodbye-to-rcb-with-an-emotional-message-after-ipl-auction-2641100-2024-11-27",
      "headline": "Faf du Plessis bids goodbye to RCB with an emotional message after IPL auctionIPL 2025 mega auction: Faf du Plessis penned down an emotional note as he bid farewell to the Royal Challengers Bengaluru. The RCB franchise did not opt to RTM their former captain in auction after releasing him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yuvraj-chaudhary-uttarkhand-vs-sikkim-smat-ipl-2025-auction-lucknow-super-giants-lsg-2641090-2024-11-27",
      "headline": "After IPL contract, LSG all-rounder Yuvraj shines in Syed Mushtaq Ali TrophyUttarakhand all rounder Yuvraj Chaudhary put up a magnificent all round show for his team against Sikkim in the Syed Mushtaq Ali Trophy 2024-25 after earning his maiden IPL contract from LSG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-kl-rahul-lucknow-super-giants-farewell-message-delhi-capitals-2641082-2024-11-27",
      "headline": "KL Rahul sends heartfelt message to Lucknow Super Giants after departureKL Rahul bids farewell to Lucknow Super Giants as he joins Delhi Capitals for the IPL 2025 season. The Indian batter expresses gratitude to LSG while looking forward to new opportunities with Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/football-pep-guardiola-clarification-instagram-statement-nose-scratch-harm-2641120-2024-11-27",
      "headline": "Pep Guardiola clarifies 'want to hurt myself' comment with statement on InstagramManchester City manager Pep Guardiola said he did not intend to 'make light of a serious issue' when he made a bizarre comment about scratches on his face after their Champions League draw to Feyenoord on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/faf-du-plessis-bids-goodbye-to-rcb-with-an-emotional-message-after-ipl-auction-2641100-2024-11-27",
      "headline": "Faf du Plessis bids goodbye to RCB with an emotional message after IPL auctionIPL 2025 mega auction: Faf du Plessis penned down an emotional note as he bid farewell to the Royal Challengers Bengaluru. The RCB franchise did not opt to RTM their former captain in auction after releasing him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yuvraj-chaudhary-uttarkhand-vs-sikkim-smat-ipl-2025-auction-lucknow-super-giants-lsg-2641090-2024-11-27",
      "headline": "After IPL contract, LSG all-rounder Yuvraj shines in Syed Mushtaq Ali TrophyUttarakhand all rounder Yuvraj Chaudhary put up a magnificent all round show for his team against Sikkim in the Syed Mushtaq Ali Trophy 2024-25 after earning his maiden IPL contract from LSG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-kl-rahul-lucknow-super-giants-farewell-message-delhi-capitals-2641082-2024-11-27",
      "headline": "KL Rahul sends heartfelt message to Lucknow Super Giants after departureKL Rahul bids farewell to Lucknow Super Giants as he joins Delhi Capitals for the IPL 2025 season. The Indian batter expresses gratitude to LSG while looking forward to new opportunities with Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sam-curran-chennai-super-kings-csk-ipl-2025-mega-auction-2641054-2024-11-27",
      "headline": "Sam Curran 'super excited' to be back at CSK: Feels like returning homeEngland all-rounder Sam Curran expressed excitement on his return to Chennai Super Kings (CSK) for the Indian Premier League (IPL) 2025 after the franchise bought him for INR 2.40 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shaheen-shah-afridi-icc-bowling-odi-rankings-rashid-khan-2641047-2024-11-27",
      "headline": "Shaheen Afridi loses No.1 spot in latest ODI bowling rankings Pakistani fast bowler Shaheen Shah Afridi lost his No.1 ranking to Afghanistan spinner Rashid Khan after he did not feature in the ODI series against Zimbabwe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/michael-clarkes-tribute-to-phil-hughes-will-have-a-drink-for-him-today-2641033-2024-11-27",
      "headline": "Michael Clarke's tribute to Phil Hughes: Will have a drink for him todayMichael Clarke paid his tribute to Phil Hughes on his 10-year death anniversary. His untimely death sent shock waves across the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-perth-test-criticism-steve-okeefe-australia-team-tall-poppy-syndrome-2641027-2024-11-27",
      "headline": "Tall poppy syndrome: Ex-spinner says intense scrutiny of Australia not justified Australia vs India: Former spinner Steve O'Keefe said he was not impressed by the intense criticism of the Australian Test team after they were rolled over in Perth. O'Keefe expressed confidence in Australia's ability to bounce back. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}