{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-6-excel-utility-now-live-who-is-eligible-to-file-2772650-2025-08-18",
      "headline": "ITR-6 excel utility now live: Who is eligible to file?The Income Tax Department has rolled out the excel utility for ITR-6 for AY 2025-26. But this form isn't meant for everyone — here's who is required to use it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/regaal-resources-ipo-allotment-out-today-status-online-guide-gmp-listing-gains-stock-market-debut-date-2772642-2025-08-18",
      "headline": "Regaal Resources IPO allotment today: Check status, GMP & listing dateInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (previously known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-1000-points-nifty-jump-stock-market-rally-auto-maruti-suzuki-mahindra-tata-motors-bajaj-gst-reform-diwali-2772619-2025-08-18",
      "headline": "Maruti Suzuki rallies 8%: Why GST relief is driving auto stocks higherEarly trade clearly showed strong buying in auto and financial stocks, while IT and pharma names dragged at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-1000-points-simpler-gst-regime-credit-rating-boost-2772615-2025-08-18",
      "headline": "Sensex jumps 1,000 points: Why is stock market rising today?At 9:24 am, the S&P BSE Sensex was up 950.18 points at 81,547.84, while the NSE Nifty50 jumped 310 points to 24,941.90. Broader market indices also gained as investors cheered the prospects of a simplified GST regime and an upgrade in India's sovereign credit rating by S&P."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-rallies-893-points-nifty-above-24900-maruti-suzuki-share-price-jumps-6-percent-2772611-2025-08-18",
      "headline": "Sensex, Nifty surge as PM hints at GST reforms by Diwali; Maruti jumps 7%The S&P BSE Sensex was up 1,062.91 points to 81,659.75, while the NSE Nifty50 jumped 356 points to 24,987.30 as of 9:32 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mandhira-kapur-family-excluded-sona-comstar-after-sunjay-kapur-death-2772541-2025-08-17",
      "headline": "Treated like strangers: Sunjay Kapur's sister alleges family sidelined by companyMandhira Kapur Smith alleged that the family has been treated as strangers and everyone's forgotten the legacy, forgotten that her mother's still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-let-ai-analyse-your-online-spending-habits-ai-and-spending-habits-ai-for-budgeting-ai-personal-finance-tools-2772315-2025-08-17",
      "headline": "Should you let AI analyse your online spending habits?Artificial intelligence is gradually slipping into our wallets. From tracking what we buy to predicting our next expense, AI-based tools are becoming popular. But should you really let AI analyse your online spending habits?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/trade-deal-talks-hit-roadblock-as-us-delegations-india-visit-could-be-delayed-2772307-2025-08-17",
      "headline": "Trade deal talks hit roadblock as US delegation's India visit could be delayedThe India-US trade deal talks face a potential roadblock as the US delegation may delay its August 25 visit to India. This postponement impacts scheduled negotiations that were crucial for preventing additional tariffs. A 50% tariff on Indian goods is set to take effect from August 27. Currently, a 25% tariff is already in place, impacting exporters. The deferment of the meeting does not signify cancellation, but rather a delay. Reasons for the delay could be operational or related to geopolitical outcomes. \"A 50% tariff will be imposed on us from August 27 in totality.\" The BTA deal is anticipated by the end of September or October, with expectations for a meeting by the end of August, contingent on geopolitical developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-negotiators-visit-to-new-delhi-for-bilateral-trade-talks-deferred-to-be-rescheduled-report-2772226-2025-08-16",
      "headline": "Trade deal in limbo as US team's India visit deferred amid tariff warThe United States has been pressing India to open its agriculture and dairy sectors, but New Delhi has ruled out concessions, saying such moves would endanger small farmers and cattle rearers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cuts-rationalisation-simpler-tax-structure-good-simple-tax-cheaper-goods-2772146-2025-08-16",
      "headline": "Real wallet-friendly shake-up: GST 2.0 to feel like 'Good and Simple Tax'The government is set to launch GST 2.0 with major rate cuts, making essentials cheaper and simplifying tax slabs. The overhaul promises lower prices, fewer complications, and a true 'Good and Simple Tax'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-proposes-two-gst-rates-of-5-and-18-tobacco-at-40-tax-cuts-for-farm-and-health-sectors-sources-2771789-2025-08-15",
      "headline": "Government proposes 5%, 18% GST slabs; tobacco at 40%, relief for farmers: SourcesThe government has proposed reducing GST to two slabs: 5% and 18% with sin goods at 40%, aiming to cut taxes on essentials like farm products, health items, handicrafts, and insurance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-rating-importance-what-do-they-mean-india-upgrade-pakistan-sp-global-2771729-2025-08-15",
      "headline": "Credit ratings decoded: How a simple upgrade can change a country's fortuneGlobal credit rating agency S&P Global has upgraded India's long-term unsolicited sovereign credit rating to 'BBB' from 'BBB-'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/gst-council-meeting-in-september-12-slam-may-be-dropped-sources-2771695-2025-08-15",
      "headline": "GST council meeting in September, 12% slam may be dropped: SourcesTwo-day GST Council meetings are expected in September to pave the way for reforms. The announcement was made by the Prime Minister from the ramparts of the Red Fort. These reforms are seen as a Diwali gift for the middle class. Key changes include the removal of the 12% GST slab and rate rationalisation for health and life insurance policies. The government aims to reduce the GST on most items currently in the 12% slab to 5%. This move is expected to make essential items such as footwear, bags, clothes, and toothpastes more affordable. The government is addressing concerns about inflation and the rising cost of living. Feedback regarding health insurance, which impacts the common person, has also been considered. The meetings in September are crucial for approving these changes, with implementation anticipated before Diwali. The Finance Ministry and state finance ministers have been involved in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/removal-of-12-tax-slab-among-key-reforms-to-be-discussed-in-gst-council-meetings-in-september-sources-2771661-2025-08-15",
      "headline": "GST Council may drop 12% slab, more tax reforms in September meeting: SourcesThe meeting comes after Prime Minister Narendra Modi, in his Independence Day speech, announced plans for a major overhaul of the Goods and Services Tax (GST) system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/same-sex-couple-tax-law-biased-uneven-challenge-gits-received-partners-bombay-hc-report-2771623-2025-08-15",
      "headline": "Claiming bias, same-sex couple approaches court over uneven tax: ReportThe petition was admitted by a bench of Justice BP Colabawalla and Justice Firdoush Pooniwalla, which has also issued a notice to the Attorney General as the case raises a constitutional question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/independence-day-pm-modi-announces-next-generation-gst-reform-with-significantly-lower-rates-2771561-2025-08-15",
      "headline": "PM Modi announces next-generation GST reform with significantly lower ratesDuring his Independence Day address, Prime Minister Narendra Modi announced a sweeping overhaul of the GST system, promising to unveil a \"next-generation\" tax regime with substantially lower rates this Diwali, which he hailed as a festive gift from the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-speech-announces-rs-1-lakh-crore-pradhan-mantri-viksit-bharat-rojgar-yojana-scheme-2771555-2025-08-15",
      "headline": "Rs 15,000 from government on 1st private-sector job: PM's big youth schemePM Modi in his Independence Day speech said that the Pradhan Mantri Viksit Bharat Rojgar Yojana will create nearly 3.5 crore new employment opportunities for the youth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-cut-coming-soon-what-to-expect-after-pm-modi-big-diwali-promise-2771554-2025-08-15",
      "headline": "GST cut coming soon? What to expect after PM Modi's big Diwali promisePrime Minister Narendra Modi's announcement has set expectations for a substantial overhaul of the current multi-slab GST structure, which has been in place since 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-chips-2025-end-pm-modi-independence-day-speech-red-fort-gst-diwali-energy-nuclear-2771547-2025-08-15",
      "headline": "India to roll out its own semiconductor chips by end of 2025: PM ModiSpeaking on the country's 79th Independence Day, PM Modi hoisted the national flag for the 12th consecutive time before outlining the government's plans for technology, energy, and economic reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pms-double-diwali-promise-says-next-generation-gst-with-lower-taxes-coming-soon-2771537-2025-08-15",
      "headline": "PM's Double Diwali promise, says next-generation GST with much lower taxes soonPrime Minister Narendra Modi promised the roll-out a next-generation GST regime with substantially lower taxes before this Diwali, calling it a major festive gift to benefit individuals, MSMEs, and the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-5-best-review-gmp-vikram-solar-patel-retail-mangal-gem-aromatics-shreeji-2771335-2025-08-14",
      "headline": "5 IPOs to open for bidding next week: Which is best based on GMP?Next week will see the IPOs of Patel Retail, Vikram Solar, Gem Aromatics, Shreeji Shipping Global and Mangal Electrical. Together, they are looking to raise Rs 3,584.09 crore from the market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-45-day-credit-card-grace-period-might-be-a-debt-trap-explains-ca-2771271-2025-08-14",
      "headline": "Why your 45-day credit card grace period might be a debt trap, explains CAMany believe a credit card's 45-day grace period means free borrowing time. But as an expert explains, even a small unpaid balance can turn it into a costly debt trap."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-it-stocks-gain-offset-broad-decline-infosys-rise-2-percent-2771269-2025-08-14",
      "headline": "Sensex, Nifty end marginally higher as investors await Trump-Putin meet outcomeThe S&P BSE Sensex gained 57.75 points to end at 80,597.66, while the NSE Nifty50 added just 11.95 points to close at 24,631.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-upgraded-to-bbb-on-economic-resilience-and-sustained-fiscal-consolidation-outlook-stable-sp-global-2771259-2025-08-14",
      "headline": "S&P upgrades India's sovereign rating to 'BBB' on growth, fiscal disciplineThe move comes more than a year after S&P revised India's outlook to positive from stable in May 2024, on the back of robust growth and improved expenditure quality. The rating agency also revised India's transfer and convertibility assessment to 'A-' from 'BBB+'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fedex-ups-dhl-courier-service-top-executives-india-antitrust-probe-cci-report-2771243-2025-08-14",
      "headline": "Fresh scrutiny on FedEx, UPS, DHL top brass in antitrust case: ReportExecutives set to be questioned include Subhasish Chakraborty, Managing Director of DTDC Express; R.S. Subramanian, Managing Director of DHL Express India, and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-major-income-tax-changes-in-2025-that-will-impact-your-money-2771231-2025-08-14",
      "headline": "7 major income tax changes in 2025 that will impact your money2025 has brought a wave of changes to India's income tax rules, from bigger exemptions to extended filing deadlines. Here's a simple breakdown of the seven key updates that could directly affect your finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cognizant-salary-hike-eligible-employees-november-1-2771152-2025-08-14",
      "headline": "Cognizant to roll out wage hikes for 80% of eligible employees. Details hereIT giant Cognizant is set to give salary hikes to 80% of eligible employees from November 1, with top performers in India receiving high single-digit increases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jsw-cement-share-price-market-debut-stock-fall-2-percent-buy-sell-book-profit-review-2771158-2025-08-14",
      "headline": "JSW Cement shares fall after listing at 4% premium: Should you hold or sell?JSW Cement's share price listed at 4% above its issue price of Rs 147. On the BSE, the stock opened at Rs 153, up 4.1%, while on the NSE it debuted at Rs 153.50, a gain of 4.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/man-invested-rs-18000month-for-4-years-earned-less-than-fds-ca-explains-why-2771104-2025-08-14",
      "headline": "Man invested Rs 18,000/month for 4 years, earned less than FDs. CA explains whyThe investor believed he was on the right track. His funds showed a compound annual growth rate (CAGR) of 11%. But when he calculated his portfolio XIRR—the actual return on his money—it was just 6%. That's less than the 7% a fixed deposit would have paid over the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-credit-rating-improve-moodys-fitch-reason-inflation-forex-reserve-2771031-2025-08-14",
      "headline": "Pakistan's credit rating gets a lift from Moody's. Here's whyS&P Global Ratings raised Pakistan's rating to B- from CCC+ on July 24, while Fitch Ratings did the same in April. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-cheque-clear-rule-faster-october-4-few-hours-personal-finance-trending-news-money-tips-2771065-2025-08-14",
      "headline": "RBI's new rule: Cheques to clear in just hours starting this dateUnder the new rule, cheques will be scanned, presented, and cleared continuously during business hours, reducing the clearing cycle from the current T+1 days to just a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-cuts-minimum-balance-after-backlash-check-new-rules-and-penalties-2771058-2025-08-14",
      "headline": "ICICI Bank cuts minimum balance after backlash. Check new rules and penaltiesThe bank's decision comes after strong public criticism, particularly over the earlier increase in urban and metro monthly average balance levels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-share-price-market-debut-rs-153-nse-bse-opening-price-4-percent-listing-gain-2771045-2025-08-14",
      "headline": "JSW Cement shares list at 4% premium on stock market debut On the BSE, the shares opened at Rs 153, up 4.1%, while on the NSE they began trading at Rs 153.50, a gain of 4.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/muthoot-finance-shares-jump-10-percnt-to-hit-record-high-after-q1-results-should-you-buy-2771035-2025-08-14",
      "headline": "Muthoot Finance shares jump 10% to hit record high after Q1 results. Should you buy?The gold loan financing company has seen its stock lifted by strong quarterly performance, rising investor confidence, and positive brokerage recommendations. Shares of the company were trading 10.43% higher at Rs 2,772.55 on the BSE at 10:04 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-record-key-reasons-explained-2771025-2025-08-14",
      "headline": "Bitcoin surges past $124,000 to hit all-time high. What's fueling the rally?Bitcoin hit an all-time high of $124,000. Here's why Bitcoin surged past $124K and will it keep climbing?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-over-100-points-nifty-above-24650-infosys-leads-gains-2771019-2025-08-14",
      "headline": "Sensex, Nifty open higher as IT stocks rally; Infosys, Wipro among top gainersThe S&P BSE Sensex opened more than 100 points higher and was trading 51.75 points up at 80,591.66 around 9:25 am. The NSE Nifty50 rose 13.80 points to 24,633.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trade-with-us-impossible-gujarats-textile-industry-worried-50-per-cent-tariffs-levied-by-donald-trump-2770964-2025-08-14",
      "headline": "Gujarat's textile industry threatened by 50% US tariffs demands 10% export incentiveIndia's total textile exports to the US are valued at USD 10–12 billion annually, with Gujarat accounting for more than 15 per cent of that trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbai-real-estate-regulatory-body-acts-against-palais-royale-developer-over-rs-100-crore-dues-2770962-2025-08-14",
      "headline": "Mumbai regulatory body acts against Palais Royale developer over Rs 100 crore duesMahaRERA's adjudicating officer has now issued recovery warrants under Section 40(1) of the RERA Act, enabling the District Collector to recover the amount as arrears of land revenue. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-on-naseeruddin-shah-criticism-of-his-acting-2772697-2025-08-18",
      "headline": "Farhan Akhtar on Naseeruddin's criticism of his acting: Why should I reach outFarhan Akhtar has responded to Naseeruddin Shah's past criticism of his films and acting, explaining why he chose not to reach out. He said the remarks lacked respect and constructive intent, and emphasised that feedback should come from a place of care and love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-collection-day-4-rajinikanth-2772686-2025-08-18",
      "headline": "Coolie box office Day 4: Rajinikanth's film eyes Rs 200 crore, crucial Monday aheadSuperstar Rajinikanth's 'Coolie' has been witnessing a dip in collection ever since it hit theatres. However, the film is just days away from hitting the Rs 200 crore-mark nett in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-uttarakhands-aditya-kumar-becomes-season-1st-crorepati-eyes-rs-7-crore-2772657-2025-08-18",
      "headline": "KBC 17: Uttarakhand's Aditya Kumar becomes season's 1st crorepati, eyes Rs 7 croreUttarakhand's Aditya Kumar becomes the first contestant this season to win Rs 1 crore on Kaun Banega Crorepati and attempts the Rs 7 crore question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/got7jackson-wang-rushed-hospital-fan-signing-event-cancelled-2772635-2025-08-18",
      "headline": "GOT7's Jackson Wang hospitalised due to illness, cancels scheduled fan meetingK-pop group GOT7 member Jackson Wang was admitted to the hospital due to food poisoning and has been advised to rest. It led to the cancellation of his planned fan signing event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-marks-robert-de-niro-birthday-with-emotional-instagram-post-2772629-2025-08-18",
      "headline": "Anupam Kher shares nostalgic pics, moving note on friend Robert De Niro's birthdayAnupam Kher shared a heartfelt birthday tribute to Hollywood legend Robert De Niro, highlighting their friendship and De Niro's global influence on actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/leonardo-dicaprio-vittoria-ceretti-yacht-trip-formentera-balearic-islands-2772607-2025-08-18",
      "headline": "Leonardo DiCaprio-Vittoria Ceretti soak up the sun on yacht during Spain getawayLeonardo DiCaprio and Vittoria Ceretti enjoyed a public display of affection during a yacht trip, marking a rare public appearance of their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanika-kapoor-says-singers-earn-rs-101-for-songs-india-2772614-2025-08-18",
      "headline": "Singer Kanika Kapoor says singers earn just Rs 101 for songs in IndiaPopular singer Kanika Kapoor has opened up about the financial hardships faced by vocalists in the Indian music industry. She revealed that many singers receive minimal payments and rely mainly on live shows for income."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/janhvi-kapoor-reacts-trolling-bharat-mata-ki-jai-chant-dahi-handi-event-2772605-2025-08-18",
      "headline": "Janhvi Kapoor reacts to trolling over Bharat Mata Ki Jai chant at Dahi Handi eventActor Janhvi Kapoor responded to trolls over chanting 'Bharat Mata Ki Jai' slogan at the Janmashtami event. She shared the original clip and apoke about becoming a meme material. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saswata-chatterjee-delhi-files-to-bengal-files-not-in-my-hands-2772598-2025-08-18",
      "headline": "Not a historian: Bengal Files actor Saswata Chatterjee distances himself from rowDisassociating himself with the 'The Bengali Files' controversy, Bengali actor Saswata Chatterjee said the Vivek Agnihotri film was initially titled 'The Delhi Files'. He said he wasn't aware of the film's story or the reason behind its title change at the last minute. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-boyfriend-sam-merchant-sees-her-off-at-mumbai-airport-blue-porsche-2772594-2025-08-18",
      "headline": "Triptii Dimri's rumoured boyfriend Sam Merchant sees her off at Mumbai airportActor Triptii Dimri was seen at Mumbai airport, where her alleged boyfriend, businessman Sam Merchant, dropped her off in his blue Porsche. The two have long been speculated to be dating for a while now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-hold-hands-lead-india-day-parade-in-new-york-2772579-2025-08-18",
      "headline": "Vijay Deverakonda, Rashmika Mandanna hold hands, lead India Day Parade in New YorkVijay Deverakonda and Rashmika Mandanna were the Grand Marshals at the India Day Parade in New York. The two were seen holding hands and waving to their fans at the event. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/terence-stamp-actor-general-zod-superman-dies-aged-87-2772519-2025-08-17",
      "headline": "Actor Terence Stamp, who played Superman villain General Zod, dies at 87Actor Terence Stamp, known for his role as General Zod, has died aged 87. He also played a key role in actor Tom Cruise's World War 2 period-drama 'Valkyrie' (2008)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/veteran-marathi-actor-jyoti-chandekar-dies-at-68-after-prolonged-illness-2772503-2025-08-17",
      "headline": "Veteran Marathi actor Jyoti Chandekar dies at 68 after prolonged illnessVeteran Marathi actor Jyoti Chandekar, known for her role as Poorna Aji in 'Tharala Tar Mag', died in Pune at the age of 68 after a long illness. Her daughter Tejaswini Pandit and the Marathi film industry remembered her for her long and memorable career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-opens-up-on-his-bond-with-daughter-shora-2772500-2025-08-17",
      "headline": "Nawazuddin Siddiqui opens up on his bond with daughter Shora: My biggest criticActor Nawazuddin Siddiqui said his daughter Shora keeps him grounded and often scolds him without caring about his stardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-relish-lucknow-chaat-ahead-of-param-sundari-release-2772490-2025-08-17",
      "headline": "Janhvi-Sidharth relish Lucknow chaat ahead of Param Sundari release. VideoJanhvi Kapoor and Sidharth Malhotra enjoyed chaat in Lucknow while promoting their upcoming film 'Param Sundari'. The romantic drama, releasing on August 29, has already created buzz with its trailer and the duo's on-screen chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kollam-thulasi-faces-heat-for-sexist-outburst-after-amma-malayalam-film-body-elects-woman-president-shwetha-mennon-2772470-2025-08-17",
      "headline": "Men should rule: Kerala actor's sexist rant after film body elects woman headThe Malayalam film body elected Shwetha Menon as its first female president, marking a landmark moment in Malayalam cinema. However, veteran Kollam Thulasi's sexist remarks have overshadowed the celebration, reigniting debates on industry sexism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-shows-off-his-age-old-outfits-janhvi-kapoor-has-the-sweetest-reaction-2772472-2025-08-17",
      "headline": "Boney Kapoor shows off his age-old outfits, Janhvi has the sweetest reactionBoney Kapoor impressed fans on Instagram by posing in a stylish look featuring his 22-year-old jeans and 18-year-old shirt, paired with a fresh haircut. His daughter Janhvi Kapoor added a sweet \"Wow papa\" comment, while fans showered him with love and nostalgic messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-x-twitter-reactions-aryan-khans-glimpse-gives-fans-full-srk-deja-vu-2772422-2025-08-17",
      "headline": "Bads of Bollywood X reactions: Aryan Khan's glimpse gives fans full SRK deja vuAryan Khan's upcoming web series 'The Ba***ds of Bollywood' first teaser sparked widespread attention. The series, written and directed by Aryan Khan, features a star-studded cast and is backed by Gauri Khan, promising a stylised entertainment world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-recalls-losing-film-with-oscar-winning-director-alejandro-gonzalez-inarritu-2772452-2025-08-17",
      "headline": "Fahadh Faasil recalls losing film with Oscar-winning director Alejandro InarrituFahadh Faasil shared that he was once in talks for a film with Hollywood director Alejandro Gonzalez Inarritu but couldn't take it up because of accent issues. He added that he wants his most special projects to come from Malayalam cinema itself."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-may-move-impeachment-motion-against-chief-election-commissioner-amid-vote-chori-row-sources-2772656-2025-08-18",
      "headline": "Opposition may seek impeachment of poll body chief over 'vote chori': SourcesMeanwhile, CEC Gyanesh Kumar on Sunday strongly countered allegations of electoral fraud levelled by the Congress and its leader Rahul Gandhi, defending the integrity of India's voting process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/imd-weather-mumbai-rain-red-alert-maharashtra-red-alert-heavy-downpour-2772648-2025-08-18",
      "headline": "Avoid non-essential travel: Mumbai on alert as heavy rain batters cityAmid the alert, the Greater Mumbai Police Chief advised caution, saying, \"As heavy rainfall continues under the Orange Alert, incidents of waterlogging and reduced visibility are being reported from multiple areas.\" He further warned people against unnecessary travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-tariff-india-russian-oil-china-putin-alska-meet-marco-rubio-2772578-2025-08-18",
      "headline": "Why US spares China, but hits India: Marco Rubio defends Russian oil hypocrisySpeaking to Fox News on August 17, Marco Rubio cautioned that targeting Chinese refiners would have disruptive consequences for the global oil market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-nato-zelenskyy-can-end-war-with-russia-immediately-trump-ahead-of-meeting-with-ukrainian-president-2772576-2025-08-18",
      "headline": "'Forget Nato, Crimea': Is Trump throwing Zelenskyy under the bus for Russia deal?Surprisingly, Trump's remarks ahead of his meeting with Zelenskyy came even after his special envoy, Steve Witkoff, said that Moscow was willing to let the US and its European allies provide Nato-style security guarantees to Kyiv as part of a potential peace deal, describing the development as \"game-changing.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/cp-radhakrishnan-nda-vice-president-nominee-bjp-south-politics-tamil-nadu-2772689-2025-08-18",
      "headline": "The subtle wooing of Tamil Nadu and what Radhakrishnan brings to the Veep tableFrom Coimbatore to Delhi's power corridors, CP Radhakrishnan's rise as NDA's Vice-President nominee blends strategy, symbolism, and subtle wooing of Tamil Nadu, all aimed at shaping the BJP's political narrative in the south."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/om-birla-lok-sabha-public-destroy-government-property-sloganeering-opposition-bihar-sir-vote-theft-election-commission-2772690-2025-08-18",
      "headline": "Public didn't elect you to wreck property: Om Birla to sloganeering Opposition MPsLok Sabha Speaker Om Birla rebuked Opposition MPs as they fiercely sloganeered in the well of the House soon after the proceedings resumed on Monday, warning them with strict action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saswata-chatterjee-delhi-files-to-bengal-files-not-in-my-hands-2772598-2025-08-18",
      "headline": "Not a historian: Bengal Files actor Saswata Chatterjee distances himself from rowDisassociating himself with the 'The Bengali Files' controversy, Bengali actor Saswata Chatterjee said the Vivek Agnihotri film was initially titled 'The Delhi Files'. He said he wasn't aware of the film's story or the reason behind its title change at the last minute. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/first-order-thinking-pitfalls-of-jugaad-and-why-india-fails-to-fix-roads-2772693-2025-08-18",
      "headline": "First-order thinking, pitfalls of jugaad, and why India fails to fix roadsEvery day it seems that problems in India are endless with no solutions in sight. Are we doomed to live with these problems, even the recurring problems like waterlogged roads, forever? Maybe not but definitely until we keep relying on jugaad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-t20-squad-selection-key-player-debates-sky-gill-bumrah-2772667-2025-08-18",
      "headline": "Asia Cup squad selection buzz: Big calls, bold omissions awaitAsia Cup 2025 squad selection: The selectors and team management face a tough task of picking 15 from India's vast pool of T20 talent. Will Test captain Shubman Gill make the cut? Will Jasprit Bumrah play? What about Rinku Singh? All will be revealed on Tuesday, August 19."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/watchmaker-swatch-under-fire-asian-model-slanted-eye-pose-omega-tissot-campaign-revenue-2772666-2025-08-18",
      "headline": "Why model's slanted-eye ad sparked backlash, made Swatch apologiseWatchmaker Swatch was forced to pull an ad and apologise after an Asian model's \"slanted eye\" gesture sparked outrage in China. The ad was condemned as racist and triggered boycott calls. The backlash follows a pattern of consumer-led boycotts in China against global brands over cultural insensitivity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-personnel-assaulted-meerut-toll-plaza-viral-video-arrests-2772608-2025-08-18",
      "headline": "Army jawan restrained, beaten by toll plaza workers in Meerut; 4 arrestedKapil, a soldier stationed in Jammu and Kashmir, was returning to duty from his village and traveling to Delhi with a friend. As they neared the toll plaza on the Karnal Highway, a dispute over the traffic jam and toll fee reportedly escalated into a physical assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-donald-trump-balochistan-bla-terror-tag-leverage-against-india-asim-munir-pakistan-india-relations-explained-2772516-2025-08-18",
      "headline": "Will Trump use this Pakistani tool as leverage against India?Pakistan has already started using the US State Department's 'foreign terror organisation' tag on the Balochistan Liberation Army and the Majeed Brigade against India. Will the Trump White House try to use the tag and Pakistan's claims as leverage against India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-1000-points-simpler-gst-regime-credit-rating-boost-2772615-2025-08-18",
      "headline": "Sensex jumps 1,000 points: Why is stock market rising today?At 9:24 am, the S&P BSE Sensex was up 950.18 points at 81,547.84, while the NSE Nifty50 jumped 310 points to 24,941.90. Broader market indices also gained as investors cheered the prospects of a simplified GST regime and an upgrade in India's sovereign credit rating by S&P."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-dimaond-league-final-tokyo-world-championships-2772595-2025-08-18",
      "headline": "Neeraj Chopra qualifies for Diamond League final ahead of World ChampionshipsStar Indian javelin thrower Neeraj Chopra has qualified for the Diamond League final in Zurich. His qualification comes as a boost before the World Championship final in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/are-weightloss-drugs-for-me-5-things-to-consider-anti-obesity-india-2772571-2025-08-18",
      "headline": "Are weightloss drugs for me? 5 things to considerAnti-obesity drugs like GLP-1 are quite popular now. But, do you really need it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-hold-hands-lead-india-day-parade-in-new-york-2772579-2025-08-18",
      "headline": "Vijay Deverakonda, Rashmika Mandanna hold hands, lead India Day Parade in New YorkVijay Deverakonda and Rashmika Mandanna were the Grand Marshals at the India Day Parade in New York. The two were seen holding hands and waving to their fans at the event. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-monitors-india-pakistan-tensions-daily-calls-for-lasting-peace-deal-2772543-2025-08-17",
      "headline": "US keeps an eye on India-Pakistan situation every single day: Marco RubioUS Secretary of State Marco Rubio said the United States monitors the India-Pakistan situation daily and stressed that maintaining a ceasefire is often challenging, especially after long conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mandhira-kapur-family-excluded-sona-comstar-after-sunjay-kapur-death-2772541-2025-08-17",
      "headline": "Treated like strangers: Sunjay Kapur's sister alleges family sidelined by companyMandhira Kapur Smith alleged that the family has been treated as strangers and everyone's forgotten the legacy, forgotten that her mother's still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-cp-radhakrishnan-ndas-pick-for-vice-president-bjp-2772531-2025-08-17",
      "headline": "Who is CP Radhakrishnan, NDA's pick for Vice President?Maharashtra Governor CP Radhakrishnan, who began his political career as an RSS swayamsevak, was named as NDA's candidate for the upcoming Vice Presidential election. Here's all you need to know about him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/story/volvo-ex30-review-small-car-big-statement-2772601-2025-08-18",
      "headline": "Volvo EX30 Review: Small Car, Big StatementThe Volvo EX30 isn't trying to be everything to everyone—it's a small, stylish EV that knows exactly where it stands. The trick will be in delivering just enough of everything you actually need and not charging you for the extra. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jawan-killed-2-others-injured-in-ied-blast-planted-by-maoists-in-chhattisgarhs-bijapur-district-2772606-2025-08-18",
      "headline": "Jawan killed, 2 injured in IED planted by Maoists in Chhattisgarh's BijapurA jawan of the Chhattisgarh Police's District Reserve Guard and at least two other personnel were killed after an IED planted by Maoists in Bijapur district went off on Monday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-names-maharashtra-governor-cp-radhakrishnan-as-ndas-vice-president-candidate-2772504-2025-08-17",
      "headline": "BJP picks Maharashtra Governor CP Radhakrishnan as NDA Veep candidateThe BJP has announced Maharashtra Governor CP Radhakrishnan as NDA's Vice Presidential candidate after Jagdeep Dhankhar resigned last month citing health reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-school-bomb-threat-dps-dwarka-college-police-squad-reach-site-hoax-email-2772589-2025-08-18",
      "headline": "3 schools, including DPS, and one college in Delhi's Dwarka get bomb threatAt least three schools, including the Delhi Public School, and another college in Dwarka received bomb threats via email on Monday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-tamannaah-bhatia-arrive-in-style-at-mumbai-airport-click-pics-with-fans-2772698-2025-08-18",
      "headline": "Janhvi Kapoor, Tamannaah arrive in style at Mumbai airport, click pics with fansTamannaah Bhatia and Janhvi Kapoor were clicked together at Mumbai airport, delighting fans with their friendly camaraderie and stylish appearances. Both actors shared warm moments and smiles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-on-naseeruddin-shah-criticism-of-his-acting-2772697-2025-08-18",
      "headline": "Farhan Akhtar on Naseeruddin's criticism of his acting: Why should I reach outFarhan Akhtar has responded to Naseeruddin Shah's past criticism of his films and acting, explaining why he chose not to reach out. He said the remarks lacked respect and constructive intent, and emphasised that feedback should come from a place of care and love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-collection-day-4-rajinikanth-2772686-2025-08-18",
      "headline": "Coolie box office Day 4: Rajinikanth's film eyes Rs 200 crore, crucial Monday aheadSuperstar Rajinikanth's 'Coolie' has been witnessing a dip in collection ever since it hit theatres. However, the film is just days away from hitting the Rs 200 crore-mark nett in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-marks-robert-de-niro-birthday-with-emotional-instagram-post-2772629-2025-08-18",
      "headline": "Anupam Kher shares nostalgic pics, moving note on friend Robert De Niro's birthdayAnupam Kher shared a heartfelt birthday tribute to Hollywood legend Robert De Niro, highlighting their friendship and De Niro's global influence on actors."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-us-open-cincinnati-open-final-2772694-2025-08-18",
      "headline": "Sinner, Alcaraz brace for yet another final before US Open festivalJannik Sinner and Carlos Alcaraz are set for another blockbuster final at the Cincinnati Open, their fourth title clash of 2025 and 14th meeting overall. With Alcaraz leading the rivalry 8-5 but Sinner riding the high of his historic Wimbledon triumph, Monday's showdown promises to be a gripping prelude to the US Open.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-cries-santos-6-0-loss-vasco-slams-team-attitude-2772685-2025-08-18",
      "headline": "Watch: Neymar Jr. breaks down in tears after Santos get thrashed 0-6 by VascoNeymar broke down in tears after Santos' 6-0 loss to Vasco da Gama. The star slammed the team's \"terrible attitude\" as Santos sacked coach Cleber Xavier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-t20-squad-selection-key-player-debates-sky-gill-bumrah-2772667-2025-08-18",
      "headline": "Asia Cup squad selection buzz: Big calls, bold omissions awaitAsia Cup 2025 squad selection: The selectors and team management face a tough task of picking 15 from India's vast pool of T20 talent. Will Test captain Shubman Gill make the cut? Will Jasprit Bumrah play? What about Rinku Singh? All will be revealed on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-cincinnati-open-wta-finals-2772655-2025-08-18",
      "headline": "Swiatek qualifies for WTA Finals with final berth in Cincinnati OpenIga Swiatek has secured her spot in the 2025 WTA Finals, marking her fifth consecutive appearance at the season-ending event. She reached the final of the Cincinnati Masters, where she'll face Italy's Jasmine Paolini, after defeating Elena Rybakina in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-ruled-out-duleep-trophy-2025-aashirwad-swain-replacement-2772654-2025-08-18",
      "headline": "Ishan Kishan ruled out of Duleep Trophy, Odisha cricket announces replacementEast Zone captain Ishan Kishan has been ruled out of the Duleep Trophy 2025, with Aashirwad Swain being named as the replacement. In Kishan's absence, Abhimanyu Easwaran will be leading the team in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-miss-out-yashasvi-jaiswal-india-asia-cup-t20-squad-report-2772649-2025-08-18",
      "headline": "Shubman likely to miss, Yashasvi to get nod in India's Asia Cup squad: ReportShubman Gill is reportedly unlikely to make the cut for India's squad in the upcoming Asia Cup 2025, with Yashasvi Jaiswal set to receive the nod as the third opener for the continental tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/cincinnati-open-iga-swiatek-beat-elena-rybakina-faces-jasmine-paolini-in-final-2772638-2025-08-18",
      "headline": "Iga Swiatek downs Elena Rybakina, faces Jasmine Paolini in finalIga Swiatek delivered a relentless performance on Sunday, winning 10 of the last 13 games to defeat Elena Rybakina 7-5, 6-3, setting up a final showdown with Jasmine Paolini."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-reporter-altay-bayindir-error-arsenal-goal-manchester-united-2772623-2025-08-18",
      "headline": "Ruben Amorim snaps back at reporter in Bayindir's defence after Arsenal lossRuben Amorim snapped back at a reporter, coming out swinging in defence of goalkeeper Altay Bayindir following Manchester United's 1-0 defeat to Arsenal, firmly rejecting questions over the Turkish international's place in the starting line-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-ravindra-jadeja-fitness-sword-celebration-warning-2772624-2025-08-18",
      "headline": "Only way Ravindra Jadeja gets injured is through his sword celebration: Brett LeeBrett Lee lauds Ravindra Jadeja's fitness after his stellar England tour, joking that his sword celebration could risk a rotator cuff injury. Lee had also claimed that Jadeja still has two years left in his Test career. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-dimaond-league-final-tokyo-world-championships-2772595-2025-08-18",
      "headline": "Neeraj Chopra qualifies for Diamond League final ahead of World ChampionshipsStar Indian javelin thrower Neeraj Chopra has qualified for the Diamond League final in Zurich. His qualification comes as a boost before the World Championship final in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ruben-amorim-manchester-united-vs-arsenal-2772580-2025-08-18",
      "headline": "Amorim's United show grit and glimpses of change in PL opener vs ArsenalManchester United lost 0-1 to Arsenal in Ruben Amorim's Premier League debut, but the display showed grit and signs of progress. While issues remain in defence and attack, new faces like Cunha and Mbeumo offered hope for the season ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/cincinnati-open-iga-swiatek-beat-elena-rybakina-faces-jasmine-paolini-in-final-2772638-2025-08-18",
      "headline": "Iga Swiatek downs Elena Rybakina, faces Jasmine Paolini in finalIga Swiatek delivered a relentless performance on Sunday, winning 10 of the last 13 games to defeat Elena Rybakina 7-5, 6-3, setting up a final showdown with Jasmine Paolini."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-reporter-altay-bayindir-error-arsenal-goal-manchester-united-2772623-2025-08-18",
      "headline": "Ruben Amorim snaps back at reporter in Bayindir's defence after Arsenal lossRuben Amorim snapped back at a reporter, coming out swinging in defence of goalkeeper Altay Bayindir following Manchester United's 1-0 defeat to Arsenal, firmly rejecting questions over the Turkish international's place in the starting line-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-ravindra-jadeja-fitness-sword-celebration-warning-2772624-2025-08-18",
      "headline": "Only way Ravindra Jadeja gets injured is through his sword celebration: Brett LeeBrett Lee lauds Ravindra Jadeja's fitness after his stellar England tour, joking that his sword celebration could risk a rotator cuff injury. Lee had also claimed that Jadeja still has two years left in his Test career. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-dimaond-league-final-tokyo-world-championships-2772595-2025-08-18",
      "headline": "Neeraj Chopra qualifies for Diamond League final ahead of World ChampionshipsStar Indian javelin thrower Neeraj Chopra has qualified for the Diamond League final in Zurich. His qualification comes as a boost before the World Championship final in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ruben-amorim-manchester-united-vs-arsenal-2772580-2025-08-18",
      "headline": "Amorim's United show grit and glimpses of change in PL opener vs ArsenalManchester United lost 0-1 to Arsenal in Ruben Amorim's Premier League debut, but the display showed grit and signs of progress. While issues remain in defence and attack, new faces like Cunha and Mbeumo offered hope for the season ahead."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}