{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tuhin-kanta-pandey-appointed-sebi-chairman-to-succeed-madhabi-puri-buch-2686719-2025-02-27",
      "headline": "Tuhin Kanta Pandey appointed new Sebi Chairman, to succeed Madhabi Puri BuchTuhin Kanta Pandey, the current Finance Secretary, has been appointed as the new Chairman of market regulator Sebi. He will succeed Madhabi Puri Buch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-india-hit-with-39-million-penalty-for-apparel-trademark-violation-2686565-2025-02-27",
      "headline": "Amazon India hit with $39 million penalty for apparel trademark violationThe lawsuit was filed by Lifestyle Equities, the owner of the Beverly Hills Polo Club (BHPC) horse trademark. It claimed that Amazon India was selling apparel with a similar logo at lower prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fixed-vs-floating-home-loan-interest-rates-which-option-to-choose-2686520-2025-02-27",
      "headline": "Fixed vs floating interest rates: Which option to choose?Floating home loan interest rates are usually lower than fixed rates. Hence, they are more appealing when rates are likely to dip or stay stable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-flat-despite-banking-and-financial-sector-boost-2686451-2025-02-27",
      "headline": "Sensex, Nifty end flat despite banking and financial sector boostThe S&P BSE Sensex added 10.31 points to close at 74,612.43, while the NSE Nifty50 lost 2.50 points to end at 22,545.05. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-flat-despite-banking-and-financial-sector-boost-2686447-2025-02-27",
      "headline": "Sensex, Nifty end flat despite banking and financial sector boostThe S&P BSE Sensex added 10.31 points to close at 74,612.43, while the NSE Nifty50 lost 2.50 points to end at 22,545.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/national-pension-scheme-why-nps-to-be-part-of-retirement-plan-5-things-to-know-2686379-2025-02-27",
      "headline": "Why NPS should be a part of your retirement plan? 5 things to knowWhen compared to fixed deposits (FDs) and Public Provident Funds (PPF), NPS offers superior returns over the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nbfc-stocks-may-offer-stability-in-choppy-markets-bajaj-finance-bajaj-finserv-cholamandalam-holdings-2686391-2025-02-27",
      "headline": "Explained: Why NBFC stocks may offer stability in choppy marketsThe RBI's decision to ease certain loan rules and delay stricter regulations on capital requirements has improved sentiment in the financial sector. This has made NBFC stocks attractive options for investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-drops-over-10-percent-this-week-5-reasons-behind-this-fall-2686345-2025-02-27",
      "headline": "Bitcoin sees 10% drop this week: 5 reasons behind the fallThe largest crypto has witnessed a decline of more than 10% over the last seven days. This downward trend comes amid US President Donald Trump's aggressive trade policies and EU tariff threats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-seeks-to-cut-states-share-of-central-taxes-explained-check-impact-2686346-2025-02-27",
      "headline": "Government seeks to cut states' share of central taxes: ReportBased on the expected tax collections for the ongoing financial year, a 1% swing in the states' share of tax revenue could give the central government about Rs 3,500 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-tumble-4-percent-this-month-should-share-market-investors-be-worried-2686334-2025-02-27",
      "headline": "Sensex, Nifty tumble 4% this month: Should share market investors be worried? Brokerage firm Emkay Global said falling prices make market investors nervous, but there are good signs too. The RBI lowering risk for NBFCs and micro-borrowers helps, and Nifty is now priced better at around 22,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-trainees-complain-to-pm-office-over-forceful-layoffs-mysuru-campus-report-2686326-2025-02-27",
      "headline": "Infosys trainees complain to PM's Office over 'forceful' layoffs: ReportThe employees have sought intervention to be reinstated in their jobs and to prevent similar terminations in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-golden-visa-trump-gold-card-visa-5-key-things-you-need-to-know-about-5-million-path-to-us-citizenship-2686297-2025-02-27",
      "headline": "Trump Gold Card Visa: 5 key things you need to knowUS President Donald Trump believes the new visa will attract wealthy individuals to the US who will spend large sums, pay high taxes, and boost the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nuvama-cut-spicejet-share-price-target-despite-profit-in-q3-2686307-2025-02-27",
      "headline": "Explained: Why Nuvama cut Spicejet share price target despite profit in Q3SpiceJet attributed its Q3 performance to strong passenger demand, better efficiency, and smarter pricing. In the third quarter, the company's revenue jumped 35% to Rs 1,651 crore, and occupancy stayed at 87%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-partners-with-perplexity-for-ai-powered-search-feature-on-app-2686295-2025-02-27",
      "headline": "Paytm partners with Perplexity for AI-powered search feature on appPaytm says this move is to keep up with growing digital demand. The AI search will work in local languages, making it easier for people to use."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ultratech-cement-shares-price-fall-6-percent-why-reason-polycab-india-havells-india-kei-industries-rr-kabel-2686284-2025-02-27",
      "headline": "Explained: Why UltraTech Cement shares fell 6% todayUltraTech Cement Ltd shares fell 6%. The stock opened at Rs 10,796.15 after having closed at Rs 10,968.45 in the previous session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rbi-bank-bandhan-bank-au-small-finance-bank-shares-are-rising-today-2686275-2025-02-27",
      "headline": "Why RBI Bank, Bandhan Bank, AU Small Finance Bank shares are rising today? Shares of RBL Bank, Bandhan Bank, AU Small Finance Bank, IDFC First Bank, and IndusInd Bank gained up to 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multiple-uans-here-how-to-consolidate-them-effective-epf-management-2686271-2025-02-27",
      "headline": "Do you have multiple UANs? Here's how to merge them Every time you join a new company, give your employer the existing UAN so they don't create another. If they've already made a new one, you need to merge it with your old one."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-stake-sale-in-five-psu-banks-up-to-20-percent-ofs-qip-report-2686251-2025-02-27",
      "headline": "5 PSU banks may see government stake sale of up to 20%: ReportThe government is working on a plan in consultation with the Department of Investment and Public Asset Management (DIPAM), the Department of Financial Services (DFS), and state-run banks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-as-banking-and-financial-stocks-gain-in-early-trade-2686229-2025-02-27",
      "headline": "Sensex, Nifty open higher as banking and financial stocks gain in early tradeThe S&P BSE Sensex gained 115.61 points to 74,717.73, while the NSE Nifty50 added37.30 points to 22,584.85 as of 9:20 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-todaytop-3-stocks-deliver-good-return-near-term-bajaj-finance-bajaj-finserv-cholamandalam-holdings-2686222-2025-02-27",
      "headline": "Stock market today: Top 3 stocks that could deliver good return in near term Since peaking at an all-time high in September last year, Dalal Street has seen nearly a 12% correction, leading investors to search for stocks that could offer gains despite market uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-best-place-to-invest-why-is-world-bank-bullish-dalal-street-despite-fii-sell-off-2686213-2025-02-27",
      "headline": "Best place to invest: Why is World Bank bullish on India despite FII sell-off?World Bank Country Director Auguste Tano Kouame, while speaking at the Advantage Assam 2.0 Business Summit, dismissed concerns over the recent market downturn and reaffirmed confidence in India's growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/100-crore-indians-have-no-extra-money-to-spend-report-2686042-2025-02-26",
      "headline": "100 crore Indians have no extra money to spend: ReportA report by a venture capital firm, Blume Ventures, says India's 'consuming class' comprises roughly 140 million people. But about 1 billion (100 crore) Indians do not have the kind of incomes to be able to spend anything on discretionary good."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-planning-universal-pension-scheme-who-will-it-benefit-check-details-eligibility-2685950-2025-02-26",
      "headline": "Government plans Universal Pension Scheme: Who will benefit?The ministry of labour and employment is working on the proposed plan, which is expected to bring existing pension schemes under one framework. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-european-union-trade-tariff-cut-cars-wine-boost-ties-reduce-china-dependence-2685923-2025-02-26",
      "headline": "Explained: Why European Union wants India to cut tariffs on cars, wineApart from trade, the EU also sees India as an important security partner, given rising cyber threats and tensions in regions like the South China Sea and the Indo-Pacific."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/azad-engineering-qip-launch-rs-700-crore-all-you-need-to-know-share-price-2685905-2025-02-26",
      "headline": "Azad Engineering launches Rs 700 crore QIP: All you need to knowThe company's board approved the opening of the issue on February 25 for the QIP of equity shares with a face value of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-only-carmaker-to-wrongly-classify-car-imports-tax-authorities-2685885-2025-02-26",
      "headline": "Volkswagen only carmaker to wrongly classify car imports: Tax authoritiesIndia says Volkswagen used a clandestine scheme to import auto parts in separate shipments, to evade detection and cut taxes, instead of declaring items as \"completely knocked down\", or CKD, units that face higher taxes of 30% to 35%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-gold-real-estate-which-investment-can-make-you-richer-where-to-invest-money-expert-view-2685862-2025-02-26",
      "headline": "Gold, stocks, or property: Which investment can make you richer?More people are turning to stocks, gold, and real estate to grow their wealth, but choosing the right one can be tricky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capgemini-ceo-ashwin-yardi-on-ideal-workweek-not-90-70-not-even-50-hours-2685788-2025-02-26",
      "headline": "Capgemini CEO on ideal workweek: Not 90, not 70, not even 50 hoursCapgemini India's CEO, Ashwin Yardi, has introduced a different perspective, one that supports a more balanced approach in the debate about work-life balance and working hours in a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-like-bel-hal-are-in-a-slump-3-reasons-why-analysts-are-bullish-2685763-2025-02-26",
      "headline": "Defence stocks like BEL, HAL are in a slump. Is it an opportunity to buy? Even after the drop, analysts remain bullish about defence stocks. In the case of BEL, 24 out of 27 analysts have a 'buy' rating on the stock. Most analysts also remain positive about HAL's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-tumble-nearly-9-percent-market-value-dips-below-1-trillion-dollar-key-reasons-2685741-2025-02-26",
      "headline": "Tesla shares tumble nearly 9%, market value dips below $1 trillion. Here's whyTesla share price: The decline followed data from the European Automobile Manufacturers Association, which reported Tesla's sales in Europe fell 45% in January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-44-percent-from-52-week-high-should-you-buy-the-dip-2685727-2025-02-26",
      "headline": "Tata Motors shares down 44% from 52-week high. Should you buy the dip?Tata Motors shares: In the previous trading session, the stock closed lower 1.2% lower at Rs 660.30. So far this year, it's lost over 11%. In six months, it's down 40%. Over a year, it's fallen 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-lending-rules-ease-in-borrowing-for-small-borrowers-and-nbfcs-what-it-means-2685720-2025-02-26",
      "headline": "RBI eases lending rules for small borrowers and NBFCs. Here's what it meansThe RBI has also put on hold its earlier proposals to increase the capital that banks must set aside for new project loans and the liquidity they need to maintain for digital deposits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/new-india-co-op-bank-vault-had-12-times-its-capacity-on-paper-rs-122-crore-report-2685718-2025-02-26",
      "headline": "New India Co-op Bank vault had 12 times its capacity on paper: Report The Mumbai Police's Economic Offences Wing (EOW) is probing an alleged Rs 122-crore embezzlement at the bank and has arrested three people so far, including two former senior executives of the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-employees-get-5-to-8-percent-salary-hikes-lower-than-before-report-2685688-2025-02-26",
      "headline": "Infosys employees get 5-8% salary hikes, lower than before: ReportThe IT firm sent salary revision letters to employees, offering hikes between 5% and 8% for most, depending on their performance rating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/failed-to-deposit-tds-tcs-officials-may-be-knocking-soon-income-tax-department-notice-2685678-2025-02-26",
      "headline": "Failed to deposit TDS? Tax officials may be knocking soonAround 40,000 taxpayers are under scrutiny for potential defaults in tax deductions for the financial years 2022-23 and 2023-24."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/personal-loan-5-hidden-charges-by-banks-you-must-check-2685448-2025-02-25",
      "headline": "Applying for personal loan? 5 hidden charges you must check While banks may not disclose the hidden charges when applying for personal loans, borrowers must understand them when applying for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-dip-check-indusind-dcb-bank-city-union-and-other-top-banks-2685370-2025-02-25",
      "headline": "FD rates dip: Check IndusInd, DCB, City Union and other top banksWith a drop in FD interest rates, depositors might witness a marginal decline in their earnings on fixed deposits.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jubilant-foodworks-issues-clarification-on-fir-against-chairman-2685338-2025-02-25",
      "headline": "Chairman says allegations are false: Jubilant FoodWorks after reports of FIRIn a stock exchange filing, Jubilant FoodWorks said its Chairman Shyam Sundar Bhartia has denied all allegations against him, calling them \"baseless, false and disparaging, and made with clear malafide intent\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-markets-stay-range-bound-as-cautious-sentiment-prevails-sensex-gains-nifty-loses-2685279-2025-02-25",
      "headline": "Sensex gains, Nifty loses: Markets stay range-bound as cautious sentiment prevailsThe S&P BSE Sensex gained 147.71 points to close at 74,602.12, while the NSE Nifty50 lost 5.80 points to end at 22,547.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-withdrawal-relief-for-new-india-cooperative-bank-depositors-check-details-here-2685236-2025-02-25",
      "headline": "RBI withdrawal relief for New India Co-op Bank depositors. Check details hereThis announcement comes just over a week after the central bank prohibited the bank from issuing new loans, dissolved its board and took control owing to 'supervisory concerns.'"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/composer-pritam-thanks-mumbai-police-for-arresting-studio-theft-culprit-2686604-2025-02-27",
      "headline": "Composer Pritam thanks Mumbai Police for arresting studio theft culpritMusic composer Pritam expressed gratitude towards the Mumbai Police for capturing the suspect involved in a Rs 40 lakh theft from his studio. He praised their efforts in a heartfelt Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-boys-5-supernatural-actors-jensen-ackles-jared-padalecki-misha-collins-to-reunite-2686488-2025-02-27",
      "headline": "The Boys 5: Supernatural actors Jensen Ackles, Jared Padalecki to reuniteThe Boys Season 5 will be an exciting reunion as Soldier Boy Jensen Ackles will be joined by his Supernatural co-stars Jared Padalecki and Misha Collins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-review-sass-swag-and-secrets-in-a-soggy-spin-off-2686399-2025-02-27",
      "headline": "Suits LA review: Sass, swag and secrets in a soggy spin-offReleased-Mon Feb 24, 2025'Suits LA' has the flavour of the original 'Suits', but Teddy Black is no Harvey Spector, and you will be reminded of it, despite all the pizazz in the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/o-saathi-re-new-netflix-show-imtiaz-ali-aditi-rao-hydari-avinash-tiwary-arjun-rampal-2686276-2025-02-27",
      "headline": "O Saathi Re: Imtiaz Ali's Netflix series is a modern story with a vintage heartNetflix has released the first look of its new series O Saathi Re, starring Avinash Tiwary, Aditi Rao Hydari, and Arjun Rampal. The series, directed by Arif Ali, will be an 'ode to vintage love in modern times'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-hilarious-dance-mere-husband-mujhko-piyar-nahi-karte-at-sangeet-watch-2686265-2025-02-27",
      "headline": "Prajakta Koli hilariously dances to 'Mere Husband Mujhko Piyar…' at sangeet. WatchPrajakta Koli danced to Mere Husband Mujhko Piyar Nahin Karte at her sangeet, leaving guests in splits. She married Vrishank Khanal in Karjat on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kj-yesudas-hospitalised-chennai-old-age-2686238-2025-02-27",
      "headline": "Vijay Yesudas reacts to fake news about father Yesudas's hospitalisationReports were rife that playback singer Yesudas was hospitalised in Chennai due to age-related illness. His son and playback singer Vijay Yesudas exclusively spoke to India Today and shut down the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-education-actor-alexander-westwood-jailed-for-15-years-for-multiple-sex-offenses-2685969-2025-02-26",
      "headline": "Sex Education actor Alexander Westwood jailed for 15 years for sex offencesSex Education actor Alexander Westwood received a 15-year prison sentence for multiple sex offenses. The case has captured widespread media attention due to Westwood's role in the popular Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-1-ending-explained-pammi-aaditi-pohankar-revenge-baba-nirala-bobby-deol-prakash-jha-2685961-2025-02-26",
      "headline": "Aashram 3 Part 1 ending explained: Will Pammi's revenge end Baba Nirala's reign?With Aashram Season 3 Part 2 releasing on February 27, let us take a look at how the season ended on a cliffhanger with Baba Nirala's misuse of power and a change in dynamics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-jasleen-royal-criticism-coldplay-opening-one-bad-act-wont-damage-reputation-of-indian-2685917-2025-02-26",
      "headline": "Amit Trivedi says Jasleen Royal's opening act for Coldplay was 'unfortunate'Amit Trivedi, in an interview with India Today Digital, discussed the controversy over Jasleen Royal's opening act for Coldplay's India tour and whether it would impact on the image of Indian artists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-trying-to-save-marriage-with-bianca-censori-report-2685911-2025-02-26",
      "headline": "Rapper Kanye West trying to save marriage with Bianca Censori: ReportKanye West is reportedly trying to prevent his marriage with Bianca Censori from ending. An insider reveals that Bianca is considering divorce, and Kanye is panicking."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tuhin-kanta-pandey-appointed-sebi-chairman-to-succeed-madhabi-puri-buch-2686719-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tuhin Kanta Pandey appointed new Sebi Chairman, to succeed Madhabi Puri BuchTuhin Kanta Pandey, the current Finance Secretary, has been appointed as the new Chairman of market regulator Sebi. He will succeed Madhabi Puri Buch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-three-language-policy-kanimozhi-mk-stalin-tamil-nadu-education-policy-bjp-2686705-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's the need to learn Hindi? DMK's Kanimozhi on three-language policy rowDMK leader Kanimozhi opposed the three-language policy, questioning Hindi's necessity in Tamil Nadu and accusing the Centre of withholding funds meant for the state. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kendriya-vidyalaya-teacher-suspended-after-abusive-rant-against-bihar-over-posting-2686694-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar is f***** up: Teacher suspended over viral abusive rant on job postingThe expletives-laden videos against Bihar and its people has sparked backlash and Kendriya Vidyalaya has suspended the teacher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-military-failed-to-protect-civilians-during-october-7-attack-palestine-2686702-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel says it 'failed to protect civilians' during October 7 Hamas attackOn October 7, 2023, the Palestinian militant group Hamas stormed southern Israel, killing 1,200 people and taking more than 250 hostages, which led to a full-blown war in Gaza. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/singer-katy-perry-to-go-to-space-with-2-journalists-jeff-bezos-spacecraft-blue-origin-2686655-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Singer Katy Perry to go to space with 2 journalists aboard Jeff Bezos' spacecraftSinger Katy Perry will join Blue Origin's historic NS-31 mission in spring 2025, marking the first all-female astronaut crew since 1963. Led by Lauren Sanchez, the team includes influential figures from media, activism, and science."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/annamalai-slams-mk-stalin-delimitation-tamil-nadu-dmk-bjp-2686671-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Annamalai slams MK Stalin over delimitation claims, calls it 'fear-mongering'Speaking to India Today TV, K Annamalai accused MK Stalin of fear-mongering over delimitation, dismissing claims of Tamil Nadu losing Lok Sabha seats. Stalin has called the future exercise a threat to federalism, urging collective political resistance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-nitish-kumars-all-bjp-cabinet-induction-signals-a-power-rejig-in-bihar-2686364-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Nitish Kumar's all-BJP cabinet induction signals a power rejig in BiharFor junior ally JD(U), it is a tactical concession for a bigger quid pro quo—perhaps a larger share of seats to contest in the assembly polls"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/dont-miss-watching-the-seven-planet-alignment-it-wont-repeat-for-over-a-decade-2686407-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Seven planets visible in the sky: It won't happen again for over a decadeThe planets — Mercury, Venus, Mars, Jupiter, Saturn, Uranus, and Neptune — will appear in a curved line across the sky, known as the ecliptic, which is the path the Sun traces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/laureus-academy-withdraws-jannik-sinner-sportsman-of-the-year-nomination-over-doping-ban-2686675-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Laureus withdraws Sinner's Sportsman of the Year nomination over doping banThe Laureus Academy has withdrawn World No.1 tennis player Jannik Sinner's nomination for this year's Sportsman of the Year award. The Academy let its decision known via a press release on Thursday, February 27.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/maharashtra/story/visa-office-asked-us-to-leave-father-of-indian-student-battling-for-life-in-us-2686348-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Visa office asked us to leave: Father of Indian student battling for life in USNeelam Shinde, a student from Maharashtra's Satara district, is currently battling for life in a US hospital after an accident on February 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-arm-surrender-deadline-meitei-group-arambai-tenggol-return-firearms-2686623-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Key Meitei group surrenders 246 weapons in Manipur on last day of deadlineArambai Tenggol, a key Meitei group in Manipur, surrendered 246 weapons as the state's seven-day deadline to return illegal and looted arms and ammunition is set to end today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-woman-divorce-dance-video-desi-thriving-powerful-message-women-empowerment-viral-2686591-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistani woman's 'divorced, desi, thriving' dance video comes with a powerful messageA text overlay on the viral video read: \"You found the perfect song to dance to as a recently divorced Pakistani mother of three.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/mk-stalin-vs-amit-shah-who-is-speaking-the-truth-on-delimitation-2686378-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin vs Amit Shah: Who is speaking the truth on delimitation?The Tamil Nadu CM fears delimitation will dilute the South's Lok Sabha seat share and voice in national decision-making. The BJP dismisses his concern as fear-mongering"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/vehicle-rams-people-cops-stabbed-israel-hanna-karkur-intersection-terror-attack-suspected-2686622-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "10 hurt as car rams people in Israel, assailant shot dead; terror attack suspectedReports from Israeli media indicate that two police officers were also stabbed at the Karkur intersection during the attack. The assailant was shot and killed by police at the scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/instagram-floods-users-with-sex-rape-murder-reels-meta-says-error-fixed-zukerburg-graphic-content-2686567-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Instagram floods users with sex, rape, murder Reels; Meta says 'error' fixedInstagram users reported being flooded with graphic content on rape, sex and violence on February 26. Meta has admitted to it and says the 'error' has been fixed. Something very similar happened on February 26, 2023, too. This is all we know about the latest flood of gore on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/russian-mother-protects-child-from-brutal-rottweiler-dog-attack-blood-stained-snow-video-2686505-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Mother protects child from brutal Rottweiler attack as blood stains the snowIn the video, the woman is seen shielding her child lying on the snowy path, while the Rottweiler looms nearby, poised to attack again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afg-vs-aus-lahore-weather-forecast-afghanistan-vs-australia-2686685-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AFG vs AUS Lahore weather forecast: Will rain wash out Afghanistan's hopes?Afghanistan and Australia are all set to lock horns in a crucial clash in the ICC Champions Trophy 2025 on Friday, February 28 at Gaddafi Stadium, Lahore. However, there are dark clouds hovering over the match with heavy chances of rain during the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/pune-rape-inside-bus-woman-dy-chandrachud-former-cji-chief-justice-maharashtra-2686648-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DY Chandrachud recalls Nirbhaya case: 'Implementing laws for women important'Proper implementation of laws made for women is required to prevent incidents of sexual harassment, the former CJI said, adding a lot of changes were made in laws following the Nirbhaya incident in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-viral-fan-faryal-waqar-virat-kohli-deepika-padukone-2686592-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet Faryal Waqar: The viral Pakistani cricket fan who admires Virat Kohli In an exclusive interview with India Today, Faryal Waqar opened up about the whirlwind of attention she has received over the past few days after a video of her reaction to the India vs Pakistan game in Dubai went viral. Faryal, a fan of Mohammad Rizwan and Virat Kohli, bore a striking resemblance to Bollywood star Deepika Padukone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-teaser-salman-khan-action-watch-2686350-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan unleashes action in explosive Sikandar teaserSalman Khan's new Sikandar teaser is out. It promises high-octane action. Directed by AR Murugadoss, the film also stars Rashmika Mandanna. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/idli-sambar-vada-pav-beach-shacks-behind-international-tourism-decline-goa-bjp-mla-michael-lobo-2686571-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Idli-sambar sale on beach shacks behind decline in international tourists: Goa MLAThe BJP legislator, however, did not elaborate on how the popular South Indian breakfast dish is affecting tourism in his state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/plastic-use-banned-idli-making-karnataka-hotels-minister-carcinogenic-elements-mixed-2686442-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Plastic use banned in making of idlis after minister flags carcinogenic elementsThe Karnataka government cracked down on the usage of plastic sheets in preparation of idlis in the states. The ban on use of plastic was issued after 52 hotels in the state were found to be using polythene sheets to make idlis, Health Minister Dinesh Gundu Rao said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-india-hit-with-39-million-penalty-for-apparel-trademark-violation-2686565-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amazon India hit with $39 million penalty for apparel trademark violationThe lawsuit was filed by Lifestyle Equities, the owner of the Beverly Hills Polo Club (BHPC) horse trademark. It claimed that Amazon India was selling apparel with a similar logo at lower prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/no-class-10-certificate-without-punjabi-punjab-vs-cbse-controversy-explained-2686392-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No Class 10 certificate without Punjabi? Punjab vs CBSE controversy explainedThe Punjab government has taken a firm stand on making Punjabi a mandatory subject for passing Class 10 from any board, intensifying its rift with the Centre. The controversy erupted after CBSE's draft policy for the 2025-26 Class 10 board exams omitted Punjabi from the list of regional languages, sparking political outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-letter-to-his-younger-self-dum-laga-ke-haisha-turns-10-2686583-2025-02-27",
      "headline": "Read Ayushmann Khurrana's letter to his younger self who 'dared to dream'Bollywood star Ayushmann Khurrana shared a sweet and touching letter to his younger self as his acclaimed movie, Dum Laga Ke Haisha, turned 10. The movie also starred Bhumi Pednekar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/abhishek-banerjee-shahana-goswami-neeraj-kabi-lbharat-bala-mahasangam-maha-kumbh-2686585-2025-02-27",
      "headline": "Abhishek Banerjee, Shahana Goswami, Neeraj Kabi lead Bharat Bala's 'Mahasangam''Mahasangam', directed by Bharat Bala, features Abhishek Banerjee, Shahana Goswami, and Neeraj Kabi in a story set against the Maha Kumbh festival. It explores the dynamics of a musical inheritance within a family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/video/zoya-akhtar-and-her-team-on-bringing-magic-of-cinema-with-superboys-of-malegaon-2686514-2025-02-27",
      "headline": "Zoya Akhtar and her team on bringing magic of cinema with 'Superboys of Malegaon'Filmmaker Zoya Akhtar and Reema Kagti talk about bringing 'Superboys of Malegaon', their latest film about the joy of filmmaking and making dreams come true, irrespective of the sources. The team of the film, including actors Vineet Kumar Singh, Adarsh Gourav and Shashank Arora, explain why this is a beautiful attempt at making honest cinema. While Ritesh Sidhwani talks about finding the real parameters for success when box office numbers tell a pretty lopsided story, director Kagti breaks down a prominent scene from the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-shiva-rajkumar-worked-through-chemotherapy-all-set-to-join-ram-charans-film-2686452-2025-02-27",
      "headline": "Actor Shiva Rajkumar joins Ram Charan's film, reveals working during chemotherapyKannada superstar Shiva Rajkumar, who recently returned home after receiving treatment and successfully overcoming cancer in Florida, USA, shared in an interview the challenges he faced while shooting films during chemotherapy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ashleigh-gardner-rcb-vs-gg-womens-premier-league-2025-gujarat-beat-rcb-2686712-2025-02-27",
      "headline": "Ashleigh Gardner's all-round show hands RCB third successive defeat in BangaloreGujarat Giants beat Royal Challengers Bengaluru by six wickets in Match 12 of the Women's Premier League 2025 (WPL 2025). Gujarat captain Ashleigh Gardner was adjudged Player of the Match for her match-winning half-century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afg-vs-aus-lahore-weather-forecast-afghanistan-vs-australia-2686685-2025-02-27",
      "headline": "AFG vs AUS Lahore weather forecast: Will rain wash out Afghanistan's hopes?Afghanistan and Australia are all set to lock horns in a crucial clash in the ICC Champions Trophy 2025 on Friday, February 28 at Gaddafi Stadium, Lahore. However, there are dark clouds hovering over the match with heavy chances of rain during the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/laureus-academy-withdraws-jannik-sinner-sportsman-of-the-year-nomination-over-doping-ban-2686675-2025-02-27",
      "headline": "Laureus withdraws Sinner's Sportsman of the Year nomination over doping banThe Laureus Academy has withdrawn World No.1 tennis player Jannik Sinner's nomination for this year's Sportsman of the Year award. The Academy let its decision known via a press release on Thursday, February 27.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-knocked-loss-to-australia-afghanistan-2686669-2025-02-27",
      "headline": "Butcher slams 'arrogant' England team: Everybody wants to see them loseFormer England players Mark Butcher and Alex Hartley have slammed the arrogance of the England side. Butcher has claimed that everyone wants to see England lose because of the team's arrogance on and off the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rassie-van-der-dussen-on-indias-advantage-in-dubai-2686663-2025-02-27",
      "headline": "India's advantage in Dubai puts more pressure on them: Rassie van der DussenSouth Africa batter Rassie van der Dussen said that India would be under more pressure in the knockout stages of the ICC Champions Trophy 2025 to make the most of their advantage in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afghanistan-vs-australia-afg-vs-aus-lahore-pitch-report-live-streaming-details-2686649-2025-02-27",
      "headline": "Afghanistan vs Australia, all you need to know: Lahore pitch report, live streamingAfghanistan and Australia will face-off in one of the most anticipated fixtures of the ICC Champions Trophy 2025 on Friday, February 28 at Gaddafi Stadium in Lahore. The winner of the fixture will qualify for the semi-finals of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-champions-trophy-which-is-the-2nd-best-odi-team-in-asia-2686625-2025-02-27",
      "headline": "Champions Trophy: Which is the 2nd best ODI team in Asia?Two Asian teams - Bangladesh and Pakistan, have already been knocked out of the Champions Trophy 2025. Are the Asian ODI teams in decline? If India is the best ODI team in the continent, who is the second best? Kingshuk and Rishabh discuss in the Clash of Champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-uae-neutral-venue-date-september-2686616-2025-02-27",
      "headline": "Asia Cup 2025 in September, likely to be played at a neutral venue in T20 formatThe 17th edition of the Asia Cup is likely to be played in T20 format. UAE is set to host the tournament as the Asian Cricket Council is keen on picking a neutral venue for the continental tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-australia-are-wary-of-afghanistans-spin-and-pace-threat-marnus-labuschagne-2686605-2025-02-27",
      "headline": "Australia are wary of Afghanistan's spin and pace threat: Marnus LabuschagneAustralia batter Marnus Labuschagne acknowledged Afghanistan's threat in all three departments and said that their batters will especially work on negating their spinners in the middle overs. Australia will take on Afghanistan in their last group game of the Champions Trophy on Friday, February 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-viral-fan-faryal-waqar-virat-kohli-deepika-padukone-2686592-2025-02-27",
      "headline": "Meet Faryal Waqar: The viral Pakistani cricket fan who admires Virat Kohli In an exclusive interview with India Today, Faryal Waqar opened up about the whirlwind of attention she has received over the past few days after a video of her reaction to the India vs Pakistan game in Dubai went viral. Faryal, a fan of Mohammad Rizwan and Virat Kohli, bore a striking resemblance to Bollywood star Deepika Padukone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-faryal-waqar-pakistan-cricket-fan-deepika-padukone-virat-kohli-2686589-2025-02-27",
      "headline": "Privilege to be compared to Deepika Padukone, says viral Pakistani cricket fanChampions Trophy 2025: It wasn't just her reaction that caught everyone's attention. Several cricket fans on social media pointed out that Faryal Waqar resembled Bollywood actors of the likes of Deepika Padukone and Kriti Sanon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-champions-trophy-which-is-the-2nd-best-odi-team-in-asia-2686625-2025-02-27",
      "headline": "Champions Trophy: Which is the 2nd best ODI team in Asia?Two Asian teams - Bangladesh and Pakistan, have already been knocked out of the Champions Trophy 2025. Are the Asian ODI teams in decline? If India is the best ODI team in the continent, who is the second best? Kingshuk and Rishabh discuss in the Clash of Champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-uae-neutral-venue-date-september-2686616-2025-02-27",
      "headline": "Asia Cup 2025 in September, likely to be played at a neutral venue in T20 formatThe 17th edition of the Asia Cup is likely to be played in T20 format. UAE is set to host the tournament as the Asian Cricket Council is keen on picking a neutral venue for the continental tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-australia-are-wary-of-afghanistans-spin-and-pace-threat-marnus-labuschagne-2686605-2025-02-27",
      "headline": "Australia are wary of Afghanistan's spin and pace threat: Marnus LabuschagneAustralia batter Marnus Labuschagne acknowledged Afghanistan's threat in all three departments and said that their batters will especially work on negating their spinners in the middle overs. Australia will take on Afghanistan in their last group game of the Champions Trophy on Friday, February 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-viral-fan-faryal-waqar-virat-kohli-deepika-padukone-2686592-2025-02-27",
      "headline": "Meet Faryal Waqar: The viral Pakistani cricket fan who admires Virat Kohli In an exclusive interview with India Today, Faryal Waqar opened up about the whirlwind of attention she has received over the past few days after a video of her reaction to the India vs Pakistan game in Dubai went viral. Faryal, a fan of Mohammad Rizwan and Virat Kohli, bore a striking resemblance to Bollywood star Deepika Padukone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-faryal-waqar-pakistan-cricket-fan-deepika-padukone-virat-kohli-2686589-2025-02-27",
      "headline": "Privilege to be compared to Deepika Padukone, says viral Pakistani cricket fanChampions Trophy 2025: It wasn't just her reaction that caught everyone's attention. Several cricket fans on social media pointed out that Faryal Waqar resembled Bollywood actors of the likes of Deepika Padukone and Kriti Sanon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jasprit-bumrah-injury-update-bowling-nca-training-video-2686588-2025-02-27",
      "headline": "Jasprit Bumrah starts bowling at NCA, posts training videoIndia pacer Jasprit Bumrah began bowling at the National Cricket Academy in Bengaluru. Bumrah has not played any form of cricket since Border-Gavaskar Trophy 2024/25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-sunil-gavaskar-takes-a-dig-at-harry-brook-afg-vs-eng-2686586-2025-02-27",
      "headline": "Gavaskar takes a dig at Harry Brook after England's exit: Are lights in Lahore ok?Legendary India cricketer Sunil Gavaskar took a dig at Harry Brook following England's exit from the ICC Champions Trophy 2025 after their defeat to Afghanistan in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-bilateral-series-sunil-gavaskar-2686551-2025-02-27",
      "headline": "IND vs PAK bilateral cricket only resume under one condition: GavaskarIndia and Pakistan cannot play bilateral series without solving border issues, said Sunil Gavaskar. Speaking on Pakistani YouTube channel Sports Central, Gavaskar candidly shared his views on the sensitive matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammad-rizwan-on-pakistans-exit-without-a-win-2686543-2025-02-27",
      "headline": "Gutted Mohammad Rizwan not looking for excuses after Champions Trophy exitPakistan Captain Mohammad Rizwan said that he's not looking for any excuses after his team's early exit from the ICC Champions Trophy 2025. Their last game against Bangladesh go washed out in Rawalpindi due to incessant rain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-final-vidharbha-vs-kerala-day-2-report-2686538-2025-02-27",
      "headline": "Ranji Trophy final, VID vs KER: Aditya Sarwate leads Kerala's fightback on Day 2Aditya Sarwate led Kerala's brilliant fightback on Day 2 as they ended the day on 131 for 3 in 39 overs. Vidharbha's innings came to an end at 379 after some late fireworks from the lower order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-fans-bash-pakistan-for-exiting-without-a-win-pak-vs-ban-2686497-2025-02-27",
      "headline": "Lowest point in cricket: Pakistan fans fume after winless Champions Trophy campaignPakistan cricket fans lashed out at their team after their campaign ended in the ICC Champions Trophy 2025 without a single win. Pakistan's last match against Bangladesh got washed out in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-afghanistan-marnus-labuschagne-bilateral-series-ban-2686500-2025-02-27",
      "headline": "Got no issues playing Afghanistan: Marnus Labuschagne on bilateral series banMarnus Labuschagne has said that he has no issues playing against Afghanistan, despite Cricket Australia putting a ban on playing bilateral series against the Asian side. Australia postponed a T20I series against Afghanistan last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-rain-rawalpindi-unwanted-record-points-table-2686458-2025-02-27",
      "headline": "Pakistan finish Champions Trophy at home without a win, set unwanted record Champions Trophy 2025: Pakistan became the first team in 23 years to finish the tournament without a win despite being host nation. Mohammad Rizwan's men finished at the bottom of Group A behind Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-final-vidharbha-vs-kerala-day-2-report-2686538-2025-02-27",
      "headline": "Ranji Trophy final, VID vs KER: Aditya Sarwate leads Kerala's fightback on Day 2Aditya Sarwate led Kerala's brilliant fightback on Day 2 as they ended the day on 131 for 3 in 39 overs. Vidharbha's innings came to an end at 379 after some late fireworks from the lower order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-fans-bash-pakistan-for-exiting-without-a-win-pak-vs-ban-2686497-2025-02-27",
      "headline": "Lowest point in cricket: Pakistan fans fume after winless Champions Trophy campaignPakistan cricket fans lashed out at their team after their campaign ended in the ICC Champions Trophy 2025 without a single win. Pakistan's last match against Bangladesh got washed out in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-afghanistan-marnus-labuschagne-bilateral-series-ban-2686500-2025-02-27",
      "headline": "Got no issues playing Afghanistan: Marnus Labuschagne on bilateral series banMarnus Labuschagne has said that he has no issues playing against Afghanistan, despite Cricket Australia putting a ban on playing bilateral series against the Asian side. Australia postponed a T20I series against Afghanistan last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-rain-rawalpindi-unwanted-record-points-table-2686458-2025-02-27",
      "headline": "Pakistan finish Champions Trophy at home without a win, set unwanted record Champions Trophy 2025: Pakistan became the first team in 23 years to finish the tournament without a win despite being host nation. Mohammad Rizwan's men finished at the bottom of Group A behind Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-afghanistan-hashmatullah-shahidi-glenn-maxwell-remark-2686438-2025-02-27",
      "headline": "Shahidi's hilarious Maxwell remark: You think we come only to play him?Afghanistan captain Hashmatullah Shahidi has said that his side is making plans for the entire Australian team and not just Glenn Maxwell. The all-rounder played an incredible knock against Afghanistan in the ODI World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-mentor-delhi-capitals-new-season-2686387-2025-02-27",
      "headline": "Kevin Pietersen returns to Delhi Capitals, named mentor for IPL 2025Former England captain Kevin Pietersen returned to Delhi Capitals. The franchise announced him as their new mentor for the Indian Premier League 2025 season, starting March 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-dubai-training-rohit-sharma-skips-virat-kohli-spin-2686373-2025-02-27",
      "headline": "IND vs NZ: Rohit Sharma skips batting practice, Virat Kohli focusses more on spinChampions Trophy 2025: Rohit Sharma skipped batting training, but kept a close eye on India's session under the lights in Dubai on Wednesday. India will take on New Zealand in their final Group A match in Dubai on Sunday, March 02. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-new-head-coach-yograj-singh-suggestion-aaqib-javed-2686365-2025-02-27",
      "headline": "Clash of Champions: Pakistan's new coach? Yograj Singh has a bold suggestionPakistan's turbulent run, capped by an early Champions Trophy exit, has reignited talks of another coaching change. If PCB moves on from Aaqib Javed, Yograj Singh has made a bold and unexpected suggestion for Pakistan's next head coach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-press-conference-semi-final-qualification-2686355-2025-02-27",
      "headline": "Afghanistan won't put pressure on themselves thinking of semis: ShahidiAfghanistan captain Hasmatullah Shahidi has claimed that his side won't pressure on themselves too much by thinking about qualifying into the semi-finals of the Champions Trophy. Afghanistan defeated England by 8 runs to retain hope of making it to the final four rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jonathan-trott-press-conference-lahore-2686341-2025-02-27",
      "headline": "Self-belief in Afghanistan squad is quite infectious: coach Jonathan TrottAfghanistan coach Jonathan Trott has claimed that the self-belief within the squad is quite infectious. Afghanistan defeated England to remain in the hunt for a spot in the Champions Trophy semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-live-score-rawalpindi-weather-rizwan-shanto-2686330-2025-02-27",
      "headline": "PAK vs BAN Champions Trophy Highlights: Match abandoned due to rainChampions Trophy, Pakistan (PAK) vs Bangladesh (BAN) Updates: The toss for the clash between Pakistan and Bangladesh has been delayed due to consistent rain at Rawalpindi. The two sides are playing for pride as both teams are out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-england-nasser-hussain-michael-atherton-jos-buttler-captaincy-move-on-2686320-2025-02-27",
      "headline": "England legends urge team to move on from captain Jos Buttler: He is doneMichael Atherton and Nasser Hussain believe Jos Buttler's England captaincy has run its course after their Champions Trophy exit. With mounting criticism, England may soon consider a leadership change following a string of poor performances under Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajasthan-wushu-player-dies-of-heart-attack-during-match-at-chandigarh-university-2686316-2025-02-27",
      "headline": "Rajasthan Wushu player dies of heart attack during match at Chandigarh UniversityMohit, a 21-year-old Wushu player from Rajasthan, suffered a fatal heart attack during a championship match at Chandigarh University on Monday, February 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/rajasthans-wushu-player-dies-due-to-heart-attack-while-competing-in-chandigarh-2686313-2025-02-27",
      "headline": "Rajasthan's Wushu player dies due to heart attack while competing in ChandigarhMohit Sharma, a Wushu player from Rajasthan University, collapsed due to a heart attack in the ring while competing at the All India Inter University Wushu Championship at Chandigarh University on Monday, February 24. Despite immediate medical assistance, he was declared dead at the hospital in Kharar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-jos-buttler-captaincy-press-conference-lahore-2686292-2025-02-27",
      "headline": "Got to work out if I am part of the problem or solution for England: Jos ButtlerEngland captain Jos Buttler has admitted that he needs to work out if he is part of the problem or solution for England after their Champions Trophy 2025 exit. England have been going through a rough patch in white-ball cricket, with the loss to Afghanistan being the latest low point."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}