{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-hikes-minimum-balance-to-rs-50000-metro-urban-areas-penalty-charges-2768696-2025-08-09",
      "headline": "ICICI Bank hikes minimum savings balance to Rs 50,000: What it means for youThe change applies to all new accounts opened after that date, setting a new benchmark in the industry for the highest MAB requirement among domestic banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-minister-piyush-goyal-swiss-firm-land-problem-maharashtra-ease-of-business-endress-hauser-2768661-2025-08-09",
      "headline": "Ease of doing business: Piyush Goyal resolves Swiss firm's land issue in hoursUnion Minister Piyush Goyal resolved a complex land allocation issue for a major Swiss company during a live business conference, highlighting the ease of business in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-war-is-this-indias-1991-moment-montek-singh-ahluwalia-exclusive-2768555-2025-08-08",
      "headline": "Trump's tariff war: Is this India's 1991 moment? Montek Singh Ahluwalia exclusiveAt the Business Today India@100 Summit, Montek Singh Ahluwalia, former Deputy Chairman of the Planning Commission, discusses if the 2025 Trump tariff war presents a 1991-like moment for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-exclusive-whole-world-recognises-india-as-fastest-growing-economy-2768534-2025-08-08",
      "headline": "Piyush Goyal exclusive: Whole world recognises India as fastest-growing economyUnion Minister Piyush Goyal hailed the Indian economy and said the whole world recognises us as the fastest-growing large economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/a-win-for-india-piyush-goyal-on-clinching-uk-free-trade-deal-2768506-2025-08-08",
      "headline": "'A win for India': Piyush Goyal on clinching UK free trade dealUnion Minister Piyush Goyal, speaking at the Business Today India@100 Summit, called the India-UK free trade deal a big win for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-rs-30000-crore-compensation-for-oil-marketing-companies-to-maintain-lpg-price-stability-2768365-2025-08-08",
      "headline": "Cabinet approves Rs 30,000 crore subsidy to oil companies to keep LPG prices stableThe decision aims to protect consumers from changes in global LPG prices and support the financial health of the public sector oil companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-donald-trump-trade-talk-dalal-street-2768343-2025-08-08",
      "headline": "Sensex cracks below 80,000 as tariff fears rattle stock marketsThe S&P BSE Sensex fell 765.47 points to close below the psychological 80,000 mark, while the NSE Nifty50 dropped 232.85 points to settle at 24,363.30. Midcap and smallcap stocks witnessed deeper cuts, reflecting growing investor unease over the evolving global trade scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-not-a-dead-economy-set-to-become-3rd-largest-in-world-amitabh-kant-2768334-2025-08-08",
      "headline": "India not a dead economy, poised to become 3rd-largest in world: Amitabh KantAfter Donald Trump's 'dead economy' jibe, Amitabh Kant calls India a resilient, reform-driven powerhouse on track to become the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-surge-could-stall-indias-manufacturing-momentum-warns-moodys-2768326-2025-08-08",
      "headline": "US tariff surge could stall India's manufacturing momentum, warns Moody'sOn Thursday, US President Donald Trump signed an Executive Order that adds a 25% tariff on Indian goods. This move comes in response to India's continued import of oil from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-fuel-bill-may-rise-by-9-billion-in-fy26-and-12-billion-in-fy27-if-it-stops-russian-oil-import-sbi-2768284-2025-08-08",
      "headline": "How much will India's fuel bill rise if it stops buying oil from Russia?Russia currently provides 10% of the world's crude supply. If multiple countries stop buying from Russia at once, crude oil prices could rise by around 10%, as per the report. That would affect everyone, not just India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-high-of-rs-102-lakh-is-it-the-right-time-to-buy-bullion-rates-2768222-2025-08-08",
      "headline": "Gold hits record high of Rs 1.02 lakh. Is it the right time to buy?The rally in gold comes amid growing concerns over new tariffs announced by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arvind-panagariya-bets-on-these-states-to-leads-indias-growth-by-2047-2768268-2025-08-08",
      "headline": "Arvind Panagariya bets on these states to leads India's growth by 2047Arvind Panagariya explained that India doesn't need to push growth artificially. He believes market forces are already at work, shaping the country's growth naturally."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/milind-soman-86-year-old-mother-nails-skipping-shares-video-2768698-2025-08-09",
      "headline": "Milind Soman's 86-year-old mother nails skipping, fans call it incredibleMilind Soman shared a video of his 86-year-old mother Usha skipping rope with him and wife Ankita Konwar, leaving fans amazed. People called her \"truly incredible\" and praised her for staying active with daily skipping and yoga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raksha-bandhan-2025-riddhima-kapoor-to-sanjay-dutt-celebs-extend-wishes-2768712-2025-08-09",
      "headline": "Raksha Bandhan 2025: Riddhima Kapoor to Sanjay Dutt, celebs extend wishesOn Raksha Bandhan 2025, celebrities from across the film and TV industry celebrated the festival by sharing heartfelt wishes and photos with their siblings on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-turns-50-jr-ntr-chiranjeevi-celebs-wish-actor-on-milestone-birthday-2768708-2025-08-09",
      "headline": "Mahesh Babu turns 50: Jr NTR, Chiranjeevi, celebs wish actor on milestone birthdayMahesh Babu celebrated his 50th birthday on August 9, with fans and celebrities flooding social media with love and wishes. Actors like Jr NTR, Chiranjeevi, and Gopichandh Malineni praised the Tollywood icon for his talent, humility, and inspiring journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb29-ss-rajamouli-shares-mahesh-babu-1st-look-full-glimpse-to-release-in-november-2768686-2025-08-09",
      "headline": "SSMB29: Rajamouli shares Mahesh Babu's 1st look, full glimpse to release in NovemberAn official update on Mahesh Babu and SS Rajamouli's 'SSMB29' is out. On Babu's 50th birthday, the makers shared the first glimpse from the highly-awaited Telugu film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/across-genres-through-hearts-how-british-films-shows-are-finding-their-moment-2767854-2025-08-09",
      "headline": "Across genres, through hearts: How British films, shows are finding their momentBritish content has gone from niche to global hit - thanks to its sharp writing, dry humour, and deeply relatable themes. From binge-worthy dramas to clever comedies, the content is striking a chord with viewers globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-janhvi-kapoor-dazzle-in-ivory-gold-at-gaurav-guptas-bridal-debut-2768637-2025-08-09",
      "headline": "Sidharth Malhotra, Janhvi Kapoor dazzle in ivory-gold at Gaurav Gupta's bridal debutSidharth Malhotra and Janhvi Kapoor mesmerised at Gaurav Gupta's bridal couture launch on Friday. The duo stunned as showstoppers in regal ivory and gold ensembles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-at-50-rd-burman-beer-bottles-whistles-crafted-iconic-score-music-2768641-2025-08-09",
      "headline": "Sholay@50: RD Burman's Beer Bottles and Whistles Crafted an Iconic ScoreBlending Indian and Western musical elements with ease, RD Burman experimented with unconventional instruments like coconut shells and beer bottles. The result wasn't just a film score. It was music that helped turn Sholay into a cinematic legend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-reacts-to-anurag-kashyaps-liar-remark-2-3-people-live-inside-him-2768631-2025-08-09",
      "headline": "Vivek Agnihotri reacts to Anurag Kashyap's liar remark: 2-3 people live inside himFilmmaker Vivek Agnihotri has responded to Anurag Kashyap's allegations, addressing their long-standing professional differences with a mix of criticism and respect. He also backed his past claims about the latter's ''drinking habits''. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshans-pool-workout-video-has-fans-gushing-over-his-sculpted-body-war-2-2768627-2025-08-09",
      "headline": "Hrithik Roshan's pool workout video has fans gushing over his sculpted bodyHrithik Roshan has shared a behind-the-scenes glimpse of his disciplined training regime for his upcoming film 'War 2'. The unfiltered video has got fans gushing over his chiselled body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhasker-slams-troll-casteist-jibe-husband-fahad-ahmad-2768493-2025-08-09",
      "headline": "Swara Bhasker slams troll over casteist, classist jibe at husband Fahad AhmadActor Swara Bhasker strongly reacted to a troll for his derogatory remarks about her husband Fahad Ahmad. She emphasised the classist nature of the slur in her response.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sooraj-barjatya-salman-khan-prem-comeback-age-appropriate-family-film-2768536-2025-08-08",
      "headline": "Sooraj Barjatya on Salman Khan's return as Prem: Script must be age-appropriateDirector Sooraj Barjatya hinted at actor Salman Khan's return as Prem in Rajshri Productions' future project. He opened up on working on an age-appropriate script for Salman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-film-release-audience-reaction-kanhaiyalal-murder-case-2768525-2025-08-08",
      "headline": "Udaipur Files released after long legal battle, audience call it mirror to societyUdaipur Files has been released nationwide after legal hurdles. The film highlights societal silence and calls for justice in the Kanhaiyalal murder case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-fan-decorates-temple-5500-posters-50-years-2768477-2025-08-08",
      "headline": "Fan pays tribute to Rajinikanth with 5,500 posters at temple dedicated to superstarA fan of actor Rajinikanth's celebrated the superstar's 50 years in cinema in a unique way. He decorated a temple with thousands of posters as a tribute to the 'Coolie' actor's legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-fans-figured-out-j-hope-jimin-v-had-drinks-k-pop-news-2768509-2025-08-08",
      "headline": "Here's how BTS fans realised J-Hope, Jimin and V had been drinkingCurrently in Los Angeles, the BTS members enjoyed a day out at an upscale restaurant, though Jungkook and Jin were notably absent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/ai-in-filmmaking-innovation-or-a-threat-to-creative-freedom-2768421-2025-08-08",
      "headline": "AI in filmmaking: Innovation or a threat to creative freedom?Artificial Intelligence is shaping the present phase in films. If used transparently, these tools can be a boon that helps in streamlining pre-production, improving accessibility, and even pushing artistic boundaries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-nine-years-global-dominance-record-tours-new-album-comeback-2768492-2025-08-08",
      "headline": "BLACKPINK still in your area: 9 years on, the band reigns supreme in K-pop sceneBLACKPINK celebrates nine years of redefining K-pop with record-breaking achievements. Their upcoming album and continued global tours hint at sustained dominance and evolving artistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-photo-dump-malti-beach-joy-crashing-jonas-brothers-rehearsals-rakhi-celebrations-2768432-2025-08-08",
      "headline": "Malti crashes Nick's rehearsals, Priyanka celebrates early Rakhi in new photo dumpPriyanka Chopra shared a photo dump featuring all the memorable moments of her family. The carousel featured her daughter Malti enjoying her time at beach and crashing into the Jonas Brothers' rehearsal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-kyunki-saas-bhi-kabhi-bahu-thi-reboot-success-ott-action-content-2768479-2025-08-08",
      "headline": "Smriti Irani reacts to Kyunki Saas Bhi Kabhi Bahu Thi reboot topping TV, OTT chartsActor-politician Smriti Irani is elated as her show 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot is topping the ratings. Irani expressed her gratitude to fans and viewers for their love and support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-vidyarthi-says-he-wont-return-to-bollywood-without-central-roles-2768470-2025-08-08",
      "headline": "Actor Ashish Vidyarthi says he won't return to Bollywood without central rolesVeteran actor Ashish Vidyarthi shares why he's stepped back from films, stating he's waiting for central roles that truly excite him."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-force-chief-ap-singh-pakistan-fighter-jets-shot-down-operation-sindoor-f16-damaged-2768706-2025-08-09",
      "headline": "6 Pak jets shot down in Operation Sindoor: Air Force chief's big revealThis is the first time that any official of the armed forces has publicly revealed the number of Pakistani fighter jets shot down by India during Operation Sindoor in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/alaska-see-yet-another-major-russia-us-real-estate-deal-2768674-2025-08-09",
      "headline": "Could Alaska see yet another major Russia-US real estate deal?Donald Trump will meet Vladimir Putin in Alaska on August 15 – a historic summit with symbolic timing and potential implications for ending the Russia-Ukraine war. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/used-cooking-oil-to-power-aircraft-engines-so-fry-hard-indian-oil-panipat-refinery-2768616-2025-08-09",
      "headline": "Used cooking oil to power jet engines, so fry hardIndian Oil's Panipat refinery has been crowned the country's first to pump out sustainable aviation fuel (SAF) from used cooking oil. Your pakoda oil may now get a second life as rocket juice for a 747."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/two-soldiers-killed-in-gunfight-with-terrorists-in-jks-kulgam-as-operation-akhal-enters-day-9-2768628-2025-08-09",
      "headline": "2 soldiers killed in gunfight with terrorists in J&K as Op Akhal enters day 9Two soldiers were killed and four others injured in an overnight gunfight in Kulgam as Operation Akhal continues in south Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/brics-response-to-trump-tariffs-diplomatic-moves-us-dollar-challenge-cryptocurrency-strategy-global-south-alliance-explained-2768500-2025-08-09",
      "headline": "A heavy Brics blowback brewing for Trump?Russian President Vladimir Putin and his Brazilian counterpart Lula da Silva called up PM Narendra Modi. The Indian PM is set to visit China soon for the SCO summit. Brics activity has gained momentum amid Trump's tariffs, attacks on the bloc and his cryptocurrency bet against the reported Brics currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-hikes-minimum-balance-to-rs-50000-metro-urban-areas-penalty-charges-2768696-2025-08-09",
      "headline": "ICICI Bank hikes minimum savings balance to Rs 50,000: What it means for youThe change applies to all new accounts opened after that date, setting a new benchmark in the industry for the highest MAB requirement among domestic banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-last-row-seating-rahul-gandhi-dinner-meeting-bjp-shiv-sena-2768636-2025-08-09",
      "headline": "Uddhav Thackeray's last-row seat at Rahul Gandhi dinner meet gets BJP tauntLeading the charge, Maharashtra Chief Minister Devendra Fadnavis said when the undivided Shiv Sena was part of the NDA, Uddhav always sat in the first row."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/karnataka-horror-woman-severed-head-chopped-up-body-found-ten-locations-2768701-2025-08-09",
      "headline": "Karnataka horror: Severed head, chopped up body of woman found in 10 locationsAfter an investigation and based on the tattoos on the hands and facial features, police identified the victim as Lakshmidevamma, who had been reported missing since August 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-at-50-years-rd-burman-beer-bottles-and-whistles-crafted-an-iconic-music-score-291-09-08-2025",
      "headline": "Sholay@50: RD Burman's Beer Bottles and Whistles Crafted an Iconic ScoreBlending Indian and Western musical elements with ease, RD Burman experimented with unconventional instruments like coconut shells and beer bottles. The result wasn't just a film score. It was music that helped turn Sholay into a cinematic legend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-noida-gurgaon-heavy-rain-relief-from-humidity-waterlogging-traffic-update-2768603-2025-08-09",
      "headline": "Delhi deluge: Heavy rain brings capital to a standstill, impacts flightsDelhi-NCR rain: The weekend started on a wet note for Delhi-NCR citizens as heavy rain pounded the national capital, Noida and Gurugram overnight. A red alert has been issued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-vladmir-putin-meeting-russia-ukraine-war-volodymyr-zelenskyy-peace-talk-2768695-2025-08-09",
      "headline": "Very far away from this war: Zelenskyy on Trump-Putin summit in AlaskaZelenskyy warned that Donald Trump's planned August 15 summit with Vladimir Putin in Alaska cannot produce a genuine peace deal without Ukraine's involvement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-police-constable-suspended-theft-accused-wears-uniform-custody-2768692-2025-08-09",
      "headline": "Thief wears cop's uniform to impress wife on video call, constable suspendedAccording to police officials, Constable Sonare H R was suspended after it was found that he had allowed Saleem Sheikh, an accused in over 50 theft cases, to wear his police uniform while in custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/across-genres-through-hearts-how-british-films-shows-are-finding-their-moment-2767854-2025-08-09",
      "headline": "Across genres, through hearts: How British films, shows are finding their momentBritish content has gone from niche to global hit - thanks to its sharp writing, dry humour, and deeply relatable themes. From binge-worthy dramas to clever comedies, the content is striking a chord with viewers globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/all-private-school-fee-hikes-in-delhi-now-need-mandatory-government-approval-2768681-2025-08-09",
      "headline": "Delhi passes bill to regulate private school fee hikes, government nod now a mustDelhi has passed a bill requiring all private schools to get government permission before fee hikes, ending decades of unregulated increases and promising more accountability for parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/uttarakhand-glacial-lake-burst-rain-rocks-humans-deadly-mix-dharali-flash-flood-2768675-2025-08-09",
      "headline": "Ice, rain, rocks and humans: The deadly mix behind Dharali flash floodThe cause of the flash flood that struck Uttarkashi's Dharali village on August 5 is still unclear, though experts have proposed several possible triggers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-calls-india-maharaja-of-tariffs-backs-25-per-cent-as-security-measure-glbs-2768579-2025-08-09",
      "headline": "Trump aide calls India 'maharaja of tariffs', backs 50% duty as security measureWhite House trade adviser Peter Navarro defended the additional 25% tariff on India, accusing New Delhi of indirectly funding Moscow's military aggression in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb29-ss-rajamouli-shares-mahesh-babu-1st-look-full-glimpse-to-release-in-november-2768686-2025-08-09",
      "headline": "SSMB29: Rajamouli shares Mahesh Babu's 1st look, full glimpse to release in NovemberAn official update on Mahesh Babu and SS Rajamouli's 'SSMB29' is out. On Babu's 50th birthday, the makers shared the first glimpse from the highly-awaited Telugu film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-513-08-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-cancelled-an-fir-filed-against-a-man-on-wifes-complaint-2768644-2025-08-09",
      "headline": "Remarks on wife's cooking, clothing not cruelty: Court cancels case against manThe Bombay High Court ruled that remarks by a husband on wife's attire or cooking do not amount to cruelty under Section 498A IPC and cancelled the case, finding her allegations exaggerated, contradictory, and lacking evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/regang-la-battle-india-china-war-1962-ladakh-major-shaitan-singh-120-bahadur-army-soldiers-pla-farhan-akhtar-movie-2768180-2025-08-08",
      "headline": "Frozen bodies holding guns: When 120 bahadur took on 5,000 Chinese soldiersJust 120 Indian soldiers, led by Major Shaitan Singh Bhati, beat back 5,000 Chinese troopers at Rezang La in 1962, preventing China's takeover of Ladakh. A search party found frozen bodies of Indian soldiers still holding guns, showing the last stand in which 110 of the 120 Indians were killed. Revisiting the legendary battle of the 1962 Indo-China war, which is the subject of Farhan Akhtar's 120 Bahadur.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-chris-woakes-rehab-over-surgery-injury-update-2768705-2025-08-09",
      "headline": "Rehab over surgery: Chris Woakes ready to take risky route to make it to AshesEngland pacer Chris Woakes is ready to take a big risk to keep his Ashes 2025 hopes alive. The pacer is contemplating whether to take a rehabilitation programme over surgery for his injured shoulder to make it to the squad for the tour to Australia later this year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/ssc-cgl-2025-exam-postponed-to-september-retest-for-55000-candidates-2768659-2025-08-09",
      "headline": "SSC CGL 2025 exam postponed to September, retest for 55,000 candidatesThe Staff Selection Commission - Combined Graduate Level Examination (SSC CGL) 2025 exam has been postponed to the first week of September and retests have been ordered for 55,000 aspirants. This move comes amid widespread protests over exam mismanagement and technical glitches.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/dr-anoop-misra-on-why-indian-mangoes-are-safe-and-a-healthy-option-for-diabetics-safeda-diabetes-glycaemic-index-two-studies-2768436-2025-08-09",
      "headline": "Dr Anoop Misra on why Indian mangoes are safe and a healthy option for diabeticsTwo Indian studies show certain mango varieties help manage blood sugar in type 2 diabetes. Experts advise controlled intake as a substitute for carbohydrates to gain metabolic benefits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-congress-ties-thaw-ahead-of-bengal-polls-mamata-banerjee-rahul-gandhi-abhishek-banerjee-2768571-2025-08-08",
      "headline": "From 'ekla cholo' to handshake: Trinamool-Congress ties thaw ahead of Bengal pollsWith 42 MPs in the Lok Sabha and Rajya Sabha combined, the TMC holds the numbers to sway and stands third on the opposition list with 29 Lok Sabha MPs, after the Congress and the Samajwadi Party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/milind-soman-86-year-old-mother-nails-skipping-shares-video-2768698-2025-08-09",
      "headline": "Milind Soman's 86-year-old mother nails skipping, fans call it incredibleMilind Soman shared a video of his 86-year-old mother Usha skipping rope with him and wife Ankita Konwar, leaving fans amazed. People called her \"truly incredible\" and praised her for staying active with daily skipping and yoga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raksha-bandhan-2025-riddhima-kapoor-to-sanjay-dutt-celebs-extend-wishes-2768712-2025-08-09",
      "headline": "Raksha Bandhan 2025: Riddhima Kapoor to Sanjay Dutt, celebs extend wishesOn Raksha Bandhan 2025, celebrities from across the film and TV industry celebrated the festival by sharing heartfelt wishes and photos with their siblings on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-turns-50-jr-ntr-chiranjeevi-celebs-wish-actor-on-milestone-birthday-2768708-2025-08-09",
      "headline": "Mahesh Babu turns 50: Jr NTR, Chiranjeevi, celebs wish actor on milestone birthdayMahesh Babu celebrated his 50th birthday on August 9, with fans and celebrities flooding social media with love and wishes. Actors like Jr NTR, Chiranjeevi, and Gopichandh Malineni praised the Tollywood icon for his talent, humility, and inspiring journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb29-ss-rajamouli-shares-mahesh-babu-1st-look-full-glimpse-to-release-in-november-2768686-2025-08-09",
      "headline": "SSMB29: Rajamouli shares Mahesh Babu's 1st look, full glimpse to release in NovemberAn official update on Mahesh Babu and SS Rajamouli's 'SSMB29' is out. On Babu's 50th birthday, the makers shared the first glimpse from the highly-awaited Telugu film. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-oval-pitch-curator-lee-fortis-matthew-hayden-greg-blewett-reaction-2768723-2025-08-09",
      "headline": "Gambhir vs Oval curator: Hayden says India coach should have used better languageMatthew Hayden said that Gautam Gambhir should have toned things down a bit during his spat with Oval pitch curator Lee Fortis. Gambhir had a much-publicised spat with Fortis right ahead of the final match of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-chris-woakes-rehab-over-surgery-injury-update-2768705-2025-08-09",
      "headline": "Rehab over surgery: Chris Woakes ready to take risky route to make it to AshesEngland pacer Chris Woakes is ready to take a big risk to keep his Ashes 2025 hopes alive. The pacer is contemplating whether to take a rehabilitation programme over surgery for his injured shoulder to make it to the squad for the tour to Australia later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-rodri-injury-pep-guardiola-2768690-2025-08-09",
      "headline": "Rodri sidelined for Manchester City until mid-September after injury setbackManchester City will start their Premier League campaign without Rodri, as Pep Guardiola confirmed the midfield star faces another injury layoff, ruling him out until at least mid-September after a setback at the Club World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grand-masters-2025-keymer-leads-vidit-gujrathi-shock-arjun-erigaisi-draw-2768682-2025-08-09",
      "headline": "Chennai Grand Masters: Arjun Erigaisi held, Vidit Gujrathi suffers shock lossVincent Keymer takes the sole lead at Chennai Grand Masters 2025 after beating V Pranav, while Vidit Gujrathi suffers a shock loss to Ray Robson. Arjun Erigaisi is held to a draw by Jorden van Foreest as Nihal Sarin splits points with Anish Giri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-nawaz-debut-rizwan-advice-pakistan-vs-west-indies-1st-odi-2025-2768667-2025-08-09",
      "headline": "It's your debut, finish it: Hasan Nawaz on captain Rizwan's message after 1st ODI winPakistan's match-winner, Hasan Nawaz, revealed the message he got from captain Mohammad Rizwan after his stunning knock in the first ODI against West Indies on Friday, August 8. Nawaz guided his side home as Pakistan secured a five-wicket win in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-return-marc-andre-ter-stegen-captaincy-reinstated-laliga-2768649-2025-08-09",
      "headline": "Ter Stegen back as Barcelona captain after medical clearance rowBarcelona have reinstated Marc-André ter Stegen as captain after resolving a dispute over medical clearance, ending a dramatic 24-hour standoff that began when he refused to share his surgery details with La Liga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-nawaz-debut-pakistan-vs-west-indies-1st-odi-2025-2768643-2025-08-09",
      "headline": "WI vs PAK: Hasan Nawaz stars as Pakistan win 1st ODI by 5 wicketsHasan Nawaz hit an unbeaten 63 on debut as Pakistan beat West Indies by 5 wickets in the 1st ODI 2025, taking an early lead in the three-match series on Friday, August 8. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-us-open-2025-withdrawal-injury-message-2768635-2025-08-09",
      "headline": "Paula Badosa forced to withdraw from US Open as injury woes continuePaula Badosa's injury woes continued as she was forced to withdraw from the US Open on Friday, August 8. Badosa was last seen in action in Wimbledon this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-newcastle-transfer-battle-analysis-2768620-2025-08-09",
      "headline": "Theatre of dreams, stage for stars: Manchester United's allure explainedManchester United may have finished 15th last season, but the badge still holds weight. For top players, Old Trafford offers something money can't buy — the chance to write the next great chapter in the Theatre of Dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-workload-management-test-series-selection-debate-2768610-2025-08-09",
      "headline": "DRS: Should Jasprit Bumrah be allowed to pick and choose matches?Jasprit Bumrah is a crucial pillar of India's bowling attack, but allowing him to pick and choose matches could disrupt team balance and increase pressure on other pacers. Data shows that Bumrah has struggled with injuries and workload management, so a structured rest plan is vital rather than an ad-hoc approach. A consistent, well-managed schedule can help maintain his fitness and effectiveness over the long term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-nawaz-debut-pakistan-vs-west-indies-1st-odi-2025-2768643-2025-08-09",
      "headline": "WI vs PAK: Hasan Nawaz stars as Pakistan win 1st ODI by 5 wicketsHasan Nawaz hit an unbeaten 63 on debut as Pakistan beat West Indies by 5 wickets in the 1st ODI 2025, taking an early lead in the three-match series on Friday, August 8. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-us-open-2025-withdrawal-injury-message-2768635-2025-08-09",
      "headline": "Paula Badosa forced to withdraw from US Open as injury woes continuePaula Badosa's injury woes continued as she was forced to withdraw from the US Open on Friday, August 8. Badosa was last seen in action in Wimbledon this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-newcastle-transfer-battle-analysis-2768620-2025-08-09",
      "headline": "Theatre of dreams, stage for stars: Manchester United's allure explainedManchester United may have finished 15th last season, but the badge still holds weight. For top players, Old Trafford offers something money can't buy — the chance to write the next great chapter in the Theatre of Dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-workload-management-test-series-selection-debate-2768610-2025-08-09",
      "headline": "DRS: Should Jasprit Bumrah be allowed to pick and choose matches?Jasprit Bumrah is a crucial pillar of India's bowling attack, but allowing him to pick and choose matches could disrupt team balance and increase pressure on other pacers. Data shows that Bumrah has struggled with injuries and workload management, so a structured rest plan is vital rather than an ad-hoc approach. A consistent, well-managed schedule can help maintain his fitness and effectiveness over the long term."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}