{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-the-8th-pay-commission-be-implemented-here-is-what-you-should-know-2795162-2025-09-29",
      "headline": "When will the 8th Pay Commission be implemented? Here's what you should knowThe Pay Commission affects much more than basic salaries. It influences allowances, pensions, and long-term financial security. In times of rising inflation, employees and pensioners are especially keen for the Commission's work to begin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-sridhar-vembu-whatsapp-alternative-piyush-goyal-radhika-gupta-2795288-2025-09-29",
      "headline": "From CEOs to ministers, support pours in for Zoho's ArattaiThe rise of Arattai has caught the attention of users, industry leaders, and public figures, many of whom have shared their support and congratulations for Zoho and its founder, Sridhar Vembu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/who-should-invest-in-tata-capital-ipo-market-expert-weighs-in-2795243-2025-09-29",
      "headline": "Who should invest in Tata Capital IPO? Market expert weighs inThe Tata Capital IPO is around the corner, and many investors are wondering whether it's the right bet. A market expert has broken down who should consider subscribing and who may want to stay cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-close-flat-investors-turn-cautious-us-india-trade-deal-rbi-mpc-2795219-2025-09-29",
      "headline": "Sensex, Nifty close flat as investors turn cautious over US-India trade dealThe S&P BSE Sensex closed 61.52 points lower to end at 80,364.94, while the NSE Nifty50 lost 19.80 points to close at 24,634.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moodys-rating-india-baa3-stable-outlook-trump-tariff-us-trade-talk-credit-agency-2795201-2025-09-29",
      "headline": "Moody's keeps India's Baa3 rating unchanged with stable outlookMoody's said India's strengths include its large and fast-growing economy, a sound external position, and a stable domestic financing base for fiscal deficits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/beyond-metros-how-festive-cheer-boosts-real-estate-demand-in-tier-2-cities-2795122-2025-09-29",
      "headline": "Beyond metros: How festive cheer boosts real estate demand in Tier-2 citiesWhile metros grab most of the headlines, smaller cities are quietly stealing the show. With festivals around the corner, Tier-2 cities are witnessing a strong spike in property interest and sales."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lufthansa-layoffs-german-airline-job-cut-4000-people-struggle-economy-recession-2795123-2025-09-29",
      "headline": "Lufthansa layoffs: German airline plans 4,000 job cuts over next 5 yearsThe job cuts will mainly affect administrative roles rather than operational positions such as pilots, cabin crew or ground staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-epfos-new-ecr-system-simplify-return-filing-for-employers-2795060-2025-09-29",
      "headline": "Does EPFO's new ECR system simplify return filing for employers?The Employees' Provident Fund Organisation (EPFO) has launched a revamped electronic challan-cum-return (ECR) system, aiming to make return filing easier and more accurate for employers. But does it really simplify the process?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-rbi-announce-a-rate-cut-in-the-upcoming-mpc-meeting-here-what-to-expect-2795045-2025-09-29",
      "headline": "Will RBI announce a rate cut in the upcoming MPC meeting? Here's what to expectThe Reserve Bank of India's Monetary Policy Committee begins its three-day meeting to decide whether it is time to cut interest rates or hold steady. With inflation easing and growth signals mixed, all eyes are on what the central bank does next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/experts-reveal-best-festive-stocks-to-buy-amid-global-uncertainty-banking-fmcg-auto-2795015-2025-09-29",
      "headline": "Experts reveal best festive stocks to buy amid global uncertaintyConcerns over global trade talks with the US and new protectionist measures have weighed on investor sentiment"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-142-points-higher-nifty-above-24500-bel-gains-2-percent-2794982-2025-09-29",
      "headline": "Sensex opens 142 points higher, Nifty above 24,500; BEL gains 2%The S&P BSE Sensex added 114.15 points to 80,540.61, while the NSE Nifty50 gained 36.45 points to 24,691.15 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-ipo-stock-market-debut-founder-sridhar-vembu-says-listing-clash-company-vision-bharat-2794978-2025-09-29",
      "headline": "Arattai success proves why Zoho won't rush going public, says Sridhar VembuIn a post on X, Zoho founder Sridhar Vembu said that some of Zoho's key projects, such as its messaging app Arattai, would have never been built under the financial pressures faced by public companies."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-johar-produces-indias-first-fashion-reality-show-pitch-to-get-rich-2795286-2025-09-29",
      "headline": "Karan Johar produces India's first fashion reality show Pitch To Get Rich India is set to launch its first fashion reality show 'Pitch To Get Rich', aimed at showcasing homegrown designers on a global platform with support from Bollywood stars and major investors. The series highlights the journey of emerging talents from smaller towns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-song-tum-mere-na-huye-na-sahi-ayushmann-khurrana-rashmika-mandanna-2795244-2025-09-29",
      "headline": "Thamma's Tum Mere Na Huye stars Ayushmann, Rashmika in glam avatar The first song from 'Thamma' titled 'Tum Mere Na Huye, Na Sahi' is finally out. Featuring Rashmika Mandanna and Ayushmann Khurrana, the song blends heartbreak with eye-catching dance moves. Have a look. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/riddhima-kapoor-sahni-shares-adorable-mother-daughter-moment-with-samara-2795146-2025-09-29",
      "headline": "My Sam: Riddhima Kapoor Sahni shares adorable mother-daughter moment with Samara Riddhima Kapoor Sahni shared a heartfelt mother-daughter moment with her daughter Samara on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-tribal-pact-land-conflict-rishab-shetty-kannada-film-2795246-2025-09-29",
      "headline": "Before Kantara Chapter 1, here's a recap and guide to world of Rishab Shetty's film 'Kantara: Chapter 1', written, directed and starring Rishab Shetty, is slated for a grand release on October 2. Ahead of the film's release, here is a recap of 'Kantara', which took Kannada cinema to global stardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shoutout-diljit-dosanjh-amar-singh-chamkila-team-after-emmy-nomination-2795242-2025-09-29",
      "headline": "Priyanka gives shout-out to Diljit, Chamkila team for International Emmy nomination Priyank Chopra wrote a special message for Diljit Dosanjh and the 'Amar Singh Chamkila' team after Emmy nominations. The film has bagged nominations in two categories, including Best Performance by an Actor and Best TV Movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-varanasi-college-event-dancing-students-dhadak-2-ott-2795194-2025-09-29",
      "headline": "Siddhant Chaturvedi grooves to Khaike Paan with college students in Varanasi. Watch Actor Siddhant Chaturvedi attended a college event in Varanasi, dancing with students. Videos of the actor enjoying himself with the students have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/an-og-love-letter-when-pawan-kalyan-delivered-fans-said-thank-you-2795148-2025-09-29",
      "headline": "An OG love letter: When Pawan Kalyan delivered, fans said thank you The release of 'They Call Him OG' marks the triumphant return of Pawan Kalyan, rekindling the passion of his devoted fans across India with a powerful blend of style and emotion. This gangster epic is not just a film but a heartfelt celebration of a two-decade-long bond between the star and his unwavering audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-and-ive-jang-wonyoung-dating-internet-spots-alleged-lovestagram-proof-2795066-2025-09-29",
      "headline": "BTS' V and IVE's Jang Wonyoung dating? Internet discovers alleged proof Online speculation grew over a possible relationship between BTS' V and IVE's Jang Wonyoung. Social media users shared a 'proof list' connecting the two K-pop idols."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-ashish-kumar-on-playing-cop-in-the-bads-of-bollywood-2795156-2025-09-29",
      "headline": "Just did my job: Actor Ashish Kumar on his cop act in The Ba***ds of Bollywood Actor Ashish Kumar responded to the allegations about how his character is allegedly based on Sameer Wankhede. Former NCB officer Wankhede sued Aryan Khan, Shah Rukh Khan, and Netflix for defamation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-to-commence-shoot-for-sandeep-reddy-vanga-animal-park-in-2027-2795151-2025-09-29",
      "headline": "Ranbir Kapoor to commence shoot for Sandeep Reddy Vanga's Animal Park in 2027 Actor Ranbir Kapoor announced that the shoot for Animal Park will begin in 2027. This update comes as he prepares for two major film releases in 2026, signalling a busy schedule ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-12-kichcha-sudeep-onti-vs-jenti-twist-audience-voting-2795121-2025-09-29",
      "headline": "Bigg Boss Kannada 12 goes on air, Kichcha Sudeep introduces nineteen contestants Bigg Boss Kannada 12 returns with Kichcha Sudeep as the host and a new 'Onti vs Janti' twist, pitting solo and duo contestants against each other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-neeraj-ghaywanfilm-deserves-india-oscar-entry-janhvi-kapoor-vishal-jethwa-ishaan-khatter-2795111-2025-09-29",
      "headline": "Homebound: Why Neeraj Ghaywan's film deserves to be India's Oscar entry Filmmaker Neeraj Ghaywan's 'Homebound' has received an overwhelming response from fans and critics alike. Selected as India's official Oscar entry, the film proved that it is the country's best bet after 'Laapataa Ladies'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/inside-akaza-transformation-lucien-dodge-backstory-fan-reactions-2795048-2025-09-29",
      "headline": "Demon Slayer's Akaza voice actor Lucien Dodge talks film and fan love In an exclusive interview, Lucien Dodge opens up on voicing Akaza in 'Demon Slayer: Infinity Castle', from his tragic past to becoming anime's most loved anti-hero."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-whole-village-helped-5th-century-research-rukmini-vasanth-jayaram-gulshan-devaiah-2795140-2025-09-29",
      "headline": "Exclusive: How Rishab Shetty and his villagers brought Kantara Chapter 1 to life Ahead of 'Kantara: Chapter 1' release, actor Rishab Shetty shared in an exclusive conversation how his entire village was involved in the filmmaking process. He also spoke about the extensive research that went into the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-fall-ashneer-grover-walks-out-after-heated-exchange-with-aarush-bhola-2795101-2025-09-29",
      "headline": "Rise & Fall: Ashneer Grover walks out after heated exchange with Aarush Bhola Ashneer Grover and Aarush Bhola got into a heated argument on 'Rise & Fall'. The fallout saw Ashneer walking out, highlighting tensions on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shilpa-rao-pays-emotional-tribute-to-late-zubeen-garg-at-ziro-festival-2795095-2025-09-29",
      "headline": "Shilpa Rao pays emotional tribute to late Zubeen Garg at Ziro Festival. Watch Singer Shilpa Rao paid a heartfelt tribute to the late Zubeen Garg at the Ziro Festival, performing a soulful rendition of 'Ya Ali'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-attends-kantara-chapter-1-event-hyderabad-despite-injury-2795107-2025-09-29",
      "headline": "Jr NTR shows discomfort as he attends Kantara Hyderabad event despite injury Actor Jr NTR made a public appearance at the 'Kantara: Chapter 1' pre-release event in Hyderabad on Sunday. The actor was injured a few days prior during a commercial shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/imtiaz-ali-diljit-dosanjh-emmy-nomination-pride-punjab-india-chamkila-2795073-2025-09-29",
      "headline": "Imtiaz Ali praises Diljit's Emmy nod as a moment of pride for India Imtiaz Ali's 'Chamkila' secured two International Emmy nominations, including nod for Diljit Dosanjh's performance. The filmmaker reflected on the film's journey and said that it wouldn't have been possible without Diljit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-starts-shooting-awarapan-2-sequel-bangkok-2795087-2025-09-29",
      "headline": "Emraan Hashmi's Awarapan 2 goes on floors, shoot begins in Bangkok Emraan Hashmi is set to film the eagerly awaited sequel 'Awarapan 2'. The makers announced that they have begun the filming with the first schedule planned in Bangkok. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/leh-apex-body-pulls-out-of-talks-with-centre-demands-apology-for-anti-national-remark-2795281-2025-09-29",
      "headline": "Leh Apex Body quits talks with Centre, seeks apology for 'anti-national' remarkThe next round of talks between the Centre and representatives of Ladakh, including members of the Leh Apex Body and the Kargil Democratic Alliance (KDA), was scheduled for October 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-denied-asia-cup-trophy-mohsin-naqvi-celebration-2795157-2025-09-29",
      "headline": "Silver stolen but spirit of gold: Champions India glitter despite Mohsin Naqvi heistAfter being denied of their moment in the spotlight by a lame attempt from PCB chief Mohsin Naqvi, the Indian team showed, through humour and passion, that their spirit will not be dimmed by any underhand tactics and celebrated their Asia Cup win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/vijay-deliberately-delayed-movement-held-roadshow-without-permission-karur-stampede-fir-blames-tvk-chief-2795199-2025-09-29",
      "headline": "Karur stampede FIR blames Vijay for arriving late, holding roadshow without nod  UpdatesThe Karur stampede FIR blames Tamilaga Vettri Kazhagam chief Vijay for deliberately delaying his movement and conducting a roadshow without permission, worsening conditions that led to 41 deaths at the rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/has-yogi-adityanath-put-akhilesh-yadav-on-the-backfoot-over-i-love-muhammad-row-2795083-2025-09-29",
      "headline": "How 'I love Muhammad' row gives Yogi Adityanath ammo against Akhilesh YadavAnalysts say the issue, initially local, has been transformed into a broader ideological debate, allowing UP Chief Minister Yogi Adityanth to consolidate support on a Hindutva platform during Navratri and force the Samajwadi Party into a balancing act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/garba-dandiya-changing-how-dance-gujarati-folk-festival-diluted-ahmedabad-surat-vadodara-kutch-mumbai-delhi-2794932-2025-09-29",
      "headline": "What's happening in the garb of the garba?Once a spiritual, community-centred dance in Gujarat, garba has now been commercialised. Its folk forms are dying in Gujarat itself, but the dance is uniting people across age groups, from Delhi to Bengaluru. The dhol beats and dandiya clicks might have been replaced by techno, but its new avatar still has the same old energy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-occupied-kashmir-protests-shehbaz-sharif-awami-action-committee-2795142-2025-09-29",
      "headline": "Enough is enough: Thousands in POK erupt in protest against Pak governmentThe Awami Action Committee (AAC) called the \"shutter down wheel-jam\" strike across Pakistan-Occupied Kashmir, forcing authorities to deploy heavy security and internet blackout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-defeat-pak-fans-journalist-former-cricketers-blast-haris-rauf-salman-ali-agha-trophy-mohsin-naqvi-2795247-2025-09-29",
      "headline": "India humare baap hai: How Pakistanis blasted cricket team after Asia Cup lossFrom fans to former cricketers to journalists, Pakistanis are blasting their team and players, left, right and centre, after the team's loss to India in the Asia Cup final. There's a storm of anger, memes, and soul-searching that is laying bare the deep crisis in Pakistan cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/what-the-us-wants-the-pakistan-dictator-playbook-asim-munir-donald-trump-2795132-2025-09-29",
      "headline": "What the US wants – The Pakistan dictator playbookFrom Yahya Khan to Pervez Musharraf, Pakistan's army chiefs have played Washington's game with precision. Their true loyalty, it seems, has always been to the US playbook, not the people they rule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-cuts-travel-to-two-mins-with-highest-bridge-huajiang-grand-canyon-bridge-guizhou-province-faster-than-maggi-2795158-2025-09-29",
      "headline": "Faster than making Maggi: China cuts travel of 2 hours to 2 mins with highest bridgeSlashing travel time across the canyon from two hours to just two minutes, China has opened the Huajiang Grand Canyon Bridge in Guizhou, now the world's highest at 625 meters above the ground. Completed over more than three years, the bridge stretches 1,420 meters across the canyon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/one-man-many-trades-who-is-mohsin-naqvi-pcb-acc-chairman-sidestepped-indian-cricket-team-asim-munir-shehbaz-sharif-aide-us-visit-2795208-2025-09-29",
      "headline": "Who is Mohsin Naqvi? A trophy chor with many chairs in PakistanThe victorious Indian cricket team had to celebrate without the Asia Cup trophy as Asian Cricket Council (ACC) Chairman Mohsin Naqvi left the ground with the prize. Naqvi isn't just ACC Chairman, he is also the head of the Pakistan Cricket Board (PCB) and Pakistani Interior Minister. Here's all about trophy chor Naqvi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/arattai-app-explodes-100x-in-3-days-as-sign-ups-soar-from-3000-to-350000-daily-story-in-5-points-2795057-2025-09-29",
      "headline": "Arattai app explodes 100x in 3 days as sign-ups soar from 3,000 to 350,000 dailyArattai, from Zoho is seeing a massive boost in popularity. The app has recorded a jump in daily sign-ups from 3,000 to 350,000 in just three days. Some users are also calling it a potential WhatsApp killer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ladakh-protests-statehood-pakistan-could-not-kill-him-father-on-kargil-war-veteran-son-tsewang-tharchin-death-leh-2795089-2025-09-29",
      "headline": "Pak couldn't kill him but...: Father on Kargil War veteran killed in Leh protestKargil war veteran Tsewang Tharchin, 46, who served in the Ladakh Scouts during the 1999 India-Pakistan War, was among the four protesters killed last week in police firing in Leh. His father, Stanzin Namgyal, also a Kargil veteran, had received a commendation from the Chief of Army Staff. Tharchin's family is demanding a fair probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/an-og-love-letter-when-pawan-kalyan-delivered-fans-said-thank-you-2795148-2025-09-29",
      "headline": "An OG love letter: When Pawan Kalyan delivered, fans said thank youThe release of 'They Call Him OG' marks the triumphant return of Pawan Kalyan, rekindling the passion of his devoted fans across India with a powerful blend of style and emotion. This gangster epic is not just a film but a heartfelt celebration of a two-decade-long bond between the star and his unwavering audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-hails-pm-narendra-modi-operation-sindoor-tweet-2795216-2025-09-29",
      "headline": "Suryakumar praises PM Modi's Op Sindoor post after Asia Cup win: He bats on front footIndian captain Suryakumar Yadav expressed gratitude for PM Modi's encouraging words after India's Asia Cup triumph. The praise has boosted the team's morale ahead of future challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-should-push-for-swadeshi-tech-but-must-keep-hustlers-away-2795124-2025-09-29",
      "headline": "India should push for Swadeshi tech but must keep hustlers awayThe Ping Browser episode exposed how India's Swadeshi tech push risks being undermined by shortcuts and grift. True self-reliance demands innovation, not copies disguised as indigenous products, and greater vigilance in execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bodoland-territorial-region-election-assam-bjp-loses-10-year-winning-streak-hagrama-mohilary-bpf-sweeps-2025-btc-elections-2795099-2025-09-29",
      "headline": "Who disrupted BJP's 10-year winning streak in Assam?Assam, where the BJP has of late enjoyed an uninterrupted electoral run since 2016, has faced the first defeat as Hagrama Mohilary's Bodo People's Front (BPF) swept the 2025 Bodoland Territorial Council (BTC) elections. The sweep by Mohilary's BPF has disrupted the BJP's dominance, just ahead of the Assam Assembly election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/food-delivery-worker-escapes-after-immigration-agents-chase-him-viral-video-2795278-2025-09-29",
      "headline": "Viral video: Food delivery worker escapes after US immigration agents chase himA video of nearly 10 Immigration agents chasing a food delivery worker in Chicago went viral, sparking debate over enforcement methods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-interview-focus-on-cricket-not-politics-after-india-pakistan-asia-cup-final-2795230-2025-09-29",
      "headline": "Stick to sports: Kapil Dev opens up on India-Pakistan controversy in Asia CupIn an interview with India Today, legendary India captain Kapil Dev urged that cricket remain free from political interference after India's five-wicket win over Pakistan in the Asia Cup final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/indian-travellers-trend-african-safari-masai-mara-tanzania-botswana-best-african-safaris-2795059-2025-09-29",
      "headline": "Indian travellers turn to Africa for the ultimate safari experienceMore and more Indian travellers are now adding African safaris to their bucket list. Here's a look at where people are heading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/israel-haifa-indian-troops-liberation-ottoman-rule-1918-2795228-2025-09-29",
      "headline": "Indian troops, not British, liberated Haifa: Israeli city to correct schoolbooksMayor of Haifa, Yona Yahav, said that the school history books are being corrected to credit the Indian soldiers for liberating the city from Ottoman rule in 1918."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-whole-village-helped-5th-century-research-rukmini-vasanth-jayaram-gulshan-devaiah-2795140-2025-09-29",
      "headline": "Exclusive: How Rishab Shetty and his villagers brought Kantara Chapter 1 to lifeAhead of 'Kantara: Chapter 1' release, actor Rishab Shetty shared in an exclusive conversation how his entire village was involved in the filmmaking process. He also spoke about the extensive research that went into the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-missing-journalist-rajiv-pratap-body-found-in-joshiada-lake-in-uttarkashi-family-alleges-foul-play-2795295-2025-09-29",
      "headline": "Missing Uttarakhand journalist's body found in lake, family alleges foul playTen days after his disappearance, the body of Rajiv Pratap was recovered from a river in Uttarkashi district on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/aspirin-and-heart-attacks-the-evidence-the-risks-and-the-right-way-to-use-it-2795055-2025-09-29",
      "headline": "Aspirin and heart attacks: The evidence, the risks, and the right way to use itIn India, where emergency medical access could sometimes be delayed by traffic snarls, hospital distances, or lack of immediate recognition, the question arises: can something as simple as chewing an aspirin buy a patient precious time?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-press-conference-pakistan-reporter-asia-cup-2025-final-2795014-2025-09-29",
      "headline": "You're getting angry: Suryakumar shuts down salty Pak reporter with witty remarkSuryakumar Yadav shut down a Pakistan reporter who questioned the Indian team's behaviour towards Pakistan during the Asia Cup 2025. India defeated Pakistan to win the title on Sunday, September 28. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-india-vs-pakistan-suryakumar-yadav-t20-world-cup-2795290-2025-09-29",
      "headline": "Suryakumar Yadav shifts focus to T20 World Cup after Asia Cup heist Asia Cup 2025, IND vs PAK: After beating Pakistan by five wickets on Sunday to claim the title, Suryakumar Yadav said that India would now shift their focus to the T20 World Cup to be held next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-played-great-cricket-and-played-like-champions-now-move-on-kapil-dev-2795287-2025-09-29",
      "headline": "India played great cricket and played like champions, now move on: Kapil Dev Former India captain, Kapil Dev wants cricket to move on following the controversial Asia Cup 2025 campaign, which saw many off-field matters take the spotlight as India went on to beat Pakistan in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-defeat-pak-fans-journalist-former-cricketers-blast-haris-rauf-salman-ali-agha-trophy-mohsin-naqvi-2795247-2025-09-29",
      "headline": "India humare baap hai: How Pakistanis blasted cricket team after Asia Cup loss From fans to former cricketers to journalists, Pakistanis are blasting their team and players, left, right and centre, after the team's loss to India in the Asia Cup final. There's a storm of anger, memes, and soul-searching that is laying bare the deep crisis in Pakistan cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-captain-suryakumar-yadav-exclusive-pakistans-provocative-gestures-asia-cup-final-2795263-2025-09-29",
      "headline": "Suryakumar Yadav on India-Pakistan controversy: Not okay if you cross the line In an interview with India Today, Indian captain Suryakumar Yadav discussed Pakistan's provocative gestures in the Asia Cup, highlighting Sahibzada Farhan gunshot celebration and Haris Rauf's planecrash act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-tilak-varma-gifts-autographed-cap-lokesh-nara-chandrababu-naidu-2795256-2025-09-29",
      "headline": "Watch: After Asia Cup win, Tilak Varma gifts signed cap to Andhra Pradesh minister Tilak Varma made a heartfelt gesture, giving away an autographed cap to the Andhra Pradesh cabinet minister, Lokesh Nara following his heroic knock at the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-interview-focus-on-cricket-not-politics-after-india-pakistan-asia-cup-final-2795230-2025-09-29",
      "headline": "Stick to sports: Kapil Dev opens up on India-Pakistan controversy in Asia Cup In an interview with India Today, legendary India captain Kapil Dev urged that cricket remain free from political interference after India's five-wicket win over Pakistan in the Asia Cup final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-hails-pm-narendra-modi-operation-sindoor-tweet-2795216-2025-09-29",
      "headline": "Indian captain on PM Modi's words post-Asia Cup win: Felt he was batting on front foot Indian captain Suryakumar Yadav expressed gratitude for PM Modi's encouraging words after India's Asia Cup triumph. The praise has boosted the team's morale ahead of future challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-denied-asia-cup-trophy-mohsin-naqvi-celebration-2795157-2025-09-29",
      "headline": "Silver stolen but spirit of gold: Champions India glitter despite Mohsin Naqvi heist After being denied of their moment in the spotlight by a lame attempt from PCB chief Mohsin Naqvi, the Indian team showed, through humour and passion, that their spirit will not be dimmed by any underhand tactics and celebrated their Asia Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-malik-india-regret-asia-cup-trophy-2025-2795120-2025-09-29",
      "headline": "Not collecting Asia Cup trophy will haunt India down the line: Shoaib Malik Former Pakistan captain Shoaib Malik has claimed that India will regret the decision not to collect the Asia Cup trophy after winning it on Sunday, September 28. India decided not to take the trophy from ACC chief Mohsin Naqvi after beating Pakistan by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-varun-chakravarthy-tea-cup-post-trolls-pcb-mohsin-naqvi-india-vs-pakistan-2795109-2025-09-29",
      "headline": "Varun Chakravarthy wakes up with Cup, trolls PCB chief Naqvi after Asia Cup drama Following India's Asia Cup 2025 triumph, Varun Chakravarthy humorously mocked the trophy fiasco with a tea cup post. The players celebrated creatively after PCB and ACC chief Mohsin Naqvi walked off with the actual trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-interview-focus-on-cricket-not-politics-after-india-pakistan-asia-cup-final-2795230-2025-09-29",
      "headline": "Stick to sports: Kapil Dev opens up on India-Pakistan controversy in Asia Cup In an interview with India Today, legendary India captain Kapil Dev urged that cricket remain free from political interference after India's five-wicket win over Pakistan in the Asia Cup final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-hails-pm-narendra-modi-operation-sindoor-tweet-2795216-2025-09-29",
      "headline": "Indian captain on PM Modi's words post-Asia Cup win: Felt he was batting on front foot Indian captain Suryakumar Yadav expressed gratitude for PM Modi's encouraging words after India's Asia Cup triumph. The praise has boosted the team's morale ahead of future challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-denied-asia-cup-trophy-mohsin-naqvi-celebration-2795157-2025-09-29",
      "headline": "Silver stolen but spirit of gold: Champions India glitter despite Mohsin Naqvi heist After being denied of their moment in the spotlight by a lame attempt from PCB chief Mohsin Naqvi, the Indian team showed, through humour and passion, that their spirit will not be dimmed by any underhand tactics and celebrated their Asia Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-malik-india-regret-asia-cup-trophy-2025-2795120-2025-09-29",
      "headline": "Not collecting Asia Cup trophy will haunt India down the line: Shoaib Malik Former Pakistan captain Shoaib Malik has claimed that India will regret the decision not to collect the Asia Cup trophy after winning it on Sunday, September 28. India decided not to take the trophy from ACC chief Mohsin Naqvi after beating Pakistan by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-varun-chakravarthy-tea-cup-post-trolls-pcb-mohsin-naqvi-india-vs-pakistan-2795109-2025-09-29",
      "headline": "Varun Chakravarthy wakes up with Cup, trolls PCB chief Naqvi after Asia Cup drama Following India's Asia Cup 2025 triumph, Varun Chakravarthy humorously mocked the trophy fiasco with a tea cup post. The players celebrated creatively after PCB and ACC chief Mohsin Naqvi walked off with the actual trophy."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}