{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-revives-us-investment-plans-amid-ongoing-bribery-case-2687686-2025-03-02",
      "headline": "Adani Group revives US investment plans amid ongoing bribery case: ReportFor now, Adani Group's US footprint remains minimal. Past talks with American companies about petrochemical projects in Texas never led to major deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-fema-violation-notice-company-filing-financial-watchdog-nearbuy-india-little-internet-2687569-2025-03-01",
      "headline": "Paytm clarifies FEMA allegations on acquired subsidiaries. Details hereThe company is seeking legal advice and will take necessary steps to resolve the matter through appropriate regulatory processes in line with applicable laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grubhub-lays-off-500-employees-us-food-delivery-app-merger-with-rival-wonder-2687557-2025-03-01",
      "headline": "US food delivery firm Grubhub lays off 500 employees. Here's whyGrubhub is laying off as many as 500 employees, over 20 per cent of its workforce, following its acquisition by Wonder. The layoffs, spanning all departments, aim to streamline operations as the company integrates with its new parent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tuhin-kanta-pandey-sebi-chaiman-2687522-2025-03-01",
      "headline": "Tuhin Kanta Pandey assumes charge as 11th Sebi chairmanTuhin Kanta Pandey took charge as the 11th Sebi chairman, succeeding Madhabi Puri Buch, who completed her tenure. A former Finance Secretary, Pandey has been appointed for three years.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-remain-fastest-growing-economy-with-65-growth-in-fy26-imf-2687521-2025-03-01",
      "headline": "India to remain fastest growing major economy with 6.5% growth in FY26: IMFIndia's strong economic performance, the IMF said, provides an opportunity for the country to advance critical and challenging structural reforms to realise the ambition of becoming an advanced economy by 2047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-sensex-nifty-crash-what-next-5-things-investors-should-know-2687396-2025-03-01",
      "headline": "From record highs to a five-month slide: Where are Sensex, Nifty headed?From record highs to relentless losses, Dalal Street's dream run has turned into a nightmare in just a few months. Is there any relief in sight for investors or is there more pain ahead? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-stock-market-crash-i-have-no-idea-where-the-markets-go-from-here-2687118-2025-03-01",
      "headline": "Zerodha's Nithin Kamath flags sharp drop in trading activity amid market crashThe stock market fell sharply on Friday, with the Sensex dropping 1,414 points and the Nifty slipping below 22,150. The heavy selling wiped out nearly Rs 9 lakh crore in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/citigroup-employees-typo-nearly-led-to-81-trillion-blunder-details-here-2687054-2025-02-28",
      "headline": "Citigroup employee's typo nearly led to $81 trillion blunder. Details hereThe payment was initially overlooked by two employees before a third employee caught it. Citi later reported the incident as a 'near miss' to the Federal Reserve and the Office of the Comptroller of the Currency (OCC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dont-miss-these-money-deadlines-in-march-2025-special-fds-itr-and-more-2687028-2025-02-28",
      "headline": "Don't miss these money deadlines in March 2025: Special FDs, ITR, and more In case you have missed reporting income or made an error in your ITR, you can still fix it. The final deadline for filing an  updated return (ITR-U) is March 31, 2025.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-ends-1400-points-lower-global-trade-war-fears-rs-9-lakh-crore-gone-2687039-2025-02-28",
      "headline": "Sensex falls 1,400 points as trade war fears rattle D-Street, Rs 9 lakh crore goneStock market crash: During today's trading session, Dalal Street plunged as Sensex tumbled 1,414 points and Nifty sank below 22,150 amid global trade war fears and foreign sell-off, erasing nearly Rs 9 lakh crore in market value. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gdp-grows-q3-2024-25-up-from-q2-figures-2687031-2025-02-28",
      "headline": "GDP grows at 6.2% in Q3 2024-25, up from 5.6% in Q2For the financial year 2023-24, India recorded a real GDP growth rate of 9.2%, marking the highest annual growth in the past 12 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-news-nifty-on-track-for-longest-losing-streak-in-29-years-rs-85-lakh-crore-wiped-out-2687016-2025-02-28",
      "headline": "Nifty posts longest monthly losing streak in 29 years, over Rs 90 lakh crore goneForeign outflows, weak earnings and global uncertainty have wiped out over Rs 90 lakh crore in investor wealth from  since September 2024, when Nifty hit an all-time high of 26,277.35. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billy-joel-stumbles-and-falls-mid-performance-2687699-2025-03-02",
      "headline": "Singer Billy Joel stumbles and falls mid-performance, fans say 'that's painful'During a recent performance, legendary musician Billy Joel stumbled and fell onstage, causing fans to worry about his health. The incident has sparked widespread concern and discussions about the artist's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-vows-to-bring-grammy-to-india-at-sold-out-delhi-concert-watch-2687670-2025-03-02",
      "headline": "At sold-out Delhi concert, Honey Singh vows to bring Grammys to India. WatchAt his Delhi concert, Honey Singh wowed fans with his hits and vowed to bring a Grammy to India, inspired by AR Rahman's Oscars win. He also expressed his deep love for Delhi and its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-set-to-perform-in-delhi-excited-fans-rush-into-venue-2687561-2025-03-01",
      "headline": "Honey Singh set to perform in Delhi, excited fans rush to the venueSinger and rapper Honey Singh is set to perform in Delhi today as part of his ongoing Millionaire India tour. Ahead of the concert, excited fans were seen rushing to the venue as soon as the gates opened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-online-negativity-against-him-ive-been-here-before-youtube-existed-2687499-2025-03-01",
      "headline": "Honey Singh on online negativity against him: I've been here before YouTube existedSinger and rapper Honey Singh took a dig at those spreading negativity about him through YouTube podcasts. During his Lucknow concert last night, he also spoke about his lifestyle changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-twitter-x-account-hacked-warns-fans-2687489-2025-03-01",
      "headline": "Shreya Ghoshal's X account hacked: Tried every thing in my capacityRenowned singer Shreya Ghoshal has disclosed that her X account has been compromised since February 13. Despite efforts, she remains unable to access or delete the account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rushali-yadav-harsh-arora-splitsvilla-15-contestants-are-engaged-2687457-2025-03-01",
      "headline": "Splitsvilla 15's Rushali Yadav-Harsh Arora engaged: Just perfectly usSplitsvilla 15 contestants Rushali Yadav and Harsh Arora are now engaged. The couple fell in love on the show. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-trailer-ibrahim-ali-khan-khushi-kapoor-romance-netflix-2687443-2025-03-01",
      "headline": "Nadaaniyan trailer: Ibrahim, Khushi's romance comes with a priceIbrahim Ali Khan is all set to making his acting debut in Nadaaniyan, a love story with a secret deal. Also starring Khushi Kapoor, the film explores romance, ambition, and chaos. It will start streaming on Netflix from March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-returns-to-delhi-for-sold-out-millionaire-concert-2687376-2025-03-01",
      "headline": "Honey Singh returns to Delhi for sold-out Millionaire concert: What to expectYo Yo Honey Singh's Millionaire India Tour hits Delhi with a sold-out show, 20,000 fans, top celebs, and a surprise setlist. His parents will attend the concert, making this emotional homecoming extra special. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-wishes-to-team-up-with-diljit-dosanjh-urges-fans-to-make-it-happen-2687276-2025-02-28",
      "headline": "Honey Singh wishes to team up with Diljit Dosanjh, urges fans to make it happenSinger Honey Singh, currently touring India for his Millionaire India Tour, expressed his desire to collaborate with Diljit Dosanjh again during his recent concert in Lucknow. He urged fans to tag the Peaches singer, hoping to reunite for a new project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-reacts-to-comparisons-between-dabba-cartel-and-saas-bahu-aur-flamingo-2687163-2025-02-28",
      "headline": "Shabana Azmi reacts to comparisons between Dabba Cartel and Saas, Bahu Aur FlamingoShabana Azmi addressed concerns over comparisons between her Netflix show Dabba Cartel and Dimple Kapadia's Saas, Bahu Aur Flamingo, emphasising the unique elements of each series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palash-sen-diljit-dosanjh-concert-culture-remark-euphoria-20-remixes-2687019-2025-02-28",
      "headline": "Singer Palash Sen on Diljit's concert culture remark, Euphoria 2.0 and remixesEuphoria's lead vocalist Palash Sen opened up about Diljit Dosanjh's controversial concert culture remark, the rebranding of the band and more in an exclusive interaction with India Today Digital. Sen recently collaborated with Bollywood star Akshay Kumar on the song, Mahakal Chalo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lisa-blackpink-album-alter-ego-review-confident-versatile-powerful-2686930-2025-02-28",
      "headline": "Alter Ego review: Blackpink's Lisa's album is versatile and powerfulLisa of Blackpink releases her solo album Alter Ego. With a total of 15 songs and several collaborations, the album has a lot to take away from, but Lisa shines the brightest in her solo elements. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-kerala-congress-stand-united-shashi-tharoor-internal-rift-buzz-2687738-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala Congress leaders stand as one: Rahul Gandhi amid Shashi Tharoor rift buzzRahul Gandhi posted an image on Facebook and captioned it, \"They stand as one, united by the light of purpose ahead.\" The photo was accompanied by the hashtag 'Team Kerala'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/duplicate-voter-id-numbers-doesnt-indicate-fake-voters-poll-body-clarifies-2687728-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Duplicate voter ID numbers doesn't indicate fake voters, poll body clarifiesThe Election Commission of India (ECI) has denied allegations of electoral roll manipulation, clarifying that duplicate EPIC numbers do not indicate fake voters. It attributed the issue to different states using the same alphanumeric series before a centralised system was implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-stops-entry-humanitarian-aid-gaza-first-phase-ceasefire-expires-ramadan-begins-2687729-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel blocks entry of aid to Gaza as ceasefire expires, Ramadan beginsIsrael on Sunday stopped the entry of all goods and supplies into the Gaza Strip. The office of Israel Prime Minister did not give any detail on the decision but warned of \"additional consequences\" if Hamas does not accept what Israel says is a US proposal for an extension of the ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-prediction-form-guide-team-news-dubai-2687570-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, New Zealand battle to keep momentum going in Group A finaleIndia and New Zealand are all set to continue their rivalry as both teams square off on Sunday, March 2 in the Champions Trophy 2025. Despite winning their 2 matches so far and qualifying for the semi-finals, both teams will be looking to keep the momentum going in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-blue-ghost-moon-landing-live-updates-firefly-aerospace-2687722-2025-03-02#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "LIVE: Blue Ghost private lander returns from blackout, landing shortlyFirefly Aerospace's Blue Ghost lunar lander is set for a historic touchdown on the Moon loaded with 10 big science experiments. Blue Ghost is scheduled to touch down in Mare Crisium, a vast lunar plain on the near side of the Moon. This carefully chosen landing site provides an optimal setting for scientific research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-avalanche-race-to-rescue-4-trapped-advanced-drones-to-be-deployed-2687677-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand avalanche: Death toll rises to 5, race to rescue 3 trapped workersA massive avalanche hit a BRO camp near Mana village in Uttarakhand's Chamoli, burying 54 workers. Rescue teams have saved 46 workers, but five died. The search continues for three missing labourers using advanced technology and aerial support."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-congress-worker-himani-narwal-body-suitcase-rohtak-bus-stand-police-case-party-probe-2687626-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress worker's body found in suitcase in Rohtak day before Haryana civic pollsThe body of 22-year-old Congress worker Himani Narwal was found stuffed in a suitcase in Haryana's Rohtak, prompting the police to launch an investigation and file a case. The party demanded a high-level probe into the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/hisar-haryana-viral-video-woman-beats-up-assaults-bites-mother-over-property-dispute-2687672-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will die by my hand: Haryana woman beats up, bites mother over property disputeThe complainant told the police that his sister, Rita, and her husband had confined their mother in the house, depriving her of food and other necessities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/kinnar-akhada-transgenders-claimed-pivotal-place-in-hindu-monastic-order-maha-kumbh-prayagraj-hijra-lgbtq-what-how-2687525-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kinnar Akhada: How transgenders claimed a pivotal place in Hindu monastic orderFrom being empowered by Lord Rama to bestow blessings on all ceremonious occasions to being criminalised under British colonial laws to claiming an akhara in Kumbh Mela, kinnars have carved a distinct religious identity within Hinduism. This is very different from the Hijra traditions. This is all about kinnars, how they are different from hijras, and how they created a place for themselves in the Hindu monastic system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-live-score-dubai-weather-rohit-santner-2687697-2025-03-02#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "IND vs NZ Live: In-form India face first stern testChampions Trophy, India (IND) vs New Zealand (NZ) Live Updates: Both India and New Zealand have won their matches until now and would be looking to top the points table in Group A. India began with a win over Bangladesh before taking down Pakistan in Dubai last Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraines-zelenskyy-loan-deal-uk-keir-starmer-meeting-showdown-donald-trump-white-house-2687642-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UK stands with you: Starmer's royal welcome for Zelenskyy after Trump meltdownUnlike the tense atmosphere at the Oval Office during the talks with US President Donald Trump on ending the Ukraine war, Ukraine President Volodymyr Zelenskyy was warmly embraced by UK PM Keir Starmer in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-american-entrepreneur-vivek-ramaswamy-barefoot-interview-trolled-online-where-are-your-socks-2687654-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vivek Ramaswamy faces online vitriol over barefoot interview: 'Third-world uncle'The interview was held at the 39-year-old Harvard graduate's residence last year. But the resurfaced images sparked a wave of negative comments, with some even saying, \"we aren't in India\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-some-indian-parents-are-homeschooling-their-kids-2687164-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why some Indian parents are homeschooling their kidsHomeschooling is an alternative form of education where parents or guardians take direct responsibility for teaching their children at home instead of sending them to a traditional school."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/chhattisgarh-bilaspur-mayor-puja-vidhani-bjp-oath-taking-faux-pas-swears-uphold-communalism-2687667-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Bilaspur mayor's oath faux pas, swears to uphold 'communalism'Puja Vidhani was elected the Mayor of Bilaspur after the ruling BJP registered a landslide victory in the recently-held urban body polls in Chhattisgarh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/key-accused-in-rs-3558-crore-cloud-particle-scam-arrested-at-delhi-airport-2687698-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Key accused in Rs 3,558 crore 'cloud particle scam' arrested at Delhi airportThe Enforcement Directorate (ED) has arrested Sukhvinder and Dimple Kharour, alleged masterminds of the Rs 3,558 crore 'cloud particle scam', at Delhi's IGI Airport while they attempted to escape the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-rides-unicycle-through-traffic-viral-video-divides-internet-2687685-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru man rides unicycle through traffic. Viral video divides InternetA video of a man riding a unicycle through Bengaluru's heavy traffic has gone viral on social media, dividing users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sandeep-reddy-vanga-on-why-he-didnt-cast-shahid-kapoor-in-animal-2687716-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sandeep Reddy Vanga on why he didn't cast Shahid Kapoor in AnimalFilmmaker Sandeep Reddy Vanga opened up about not casting Shahid Kapoor in the 2023 film Animal. He explained why Ranbir Kapoor was selected for the lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-452-28-02-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rivalry-icc-tournaments-2687540-2025-03-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Zealand: The Holyfield to India's Tyson in ICC tournamentsEvery love story has a beginning, and so does every rivalry. India and New Zealand have played some riveting matches in the ICC tournaments in recent times. Here's how New Zealand are the Holyfield to India's Tyson in world cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-touts-record-low-illegal-immigration-numbers-invasion-of-us-is-over-2687666-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump touts 'record-low' illegal immigration numbers: Invasion of US is overTrump claimed illegal immigration at the US-Mexico border hit historic lows in February, his first full month in office, citing strict policies. He reported 8,326 apprehensions, declaring, \"The invasion of our country is over.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-india-vs-new-zealand-ind-vs-nz-rohit-sharma-vs-matt-henry-2687619-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Virat Kohli, can Rohit Sharma light up Champions Trophy?India captain Rohit Sharma would want to have a big score against his name as India take on New Zealand in the ICC Champions Trophy 2025 on Sunday, March 1 in Dubai. The opening batter has scored 61 runs in the first two matches and a big knock from his bat would hold India in good stead ahead of the semi finals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-revives-us-investment-plans-amid-ongoing-bribery-case-2687686-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adani Group revives US investment plans amid ongoing bribery case: ReportFor now, Adani Group's US footprint remains minimal. Past talks with American companies about petrochemical projects in Texas never led to major deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-department-of-government-efficiency-sends-second-what-did-you-do-last-week-e-mail-federal-workers-2687680-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's DOGE sends 2nd 'what did you do last week' e-mail to federal workersDespite backlash over firing of government employees, the Elon Musk-led DOGE sent the first \"what did you do last week?\" e-mail to hundreds of thousands of US federal workers on February 23, prompting them to list five tasks that they completed over the past week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-sachin-tendulkar-record-2687681-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Never write him off: Ponting backs Kohli to match Tendulkar's ODI recordChampions Trophy 2025: Former Australian skipper Ricky Ponting said that if Virat Kohli can stay hungry and fit, he can go on to break Sachin Tendulkar's record for most runs in ODI cricket. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-celebrates-31st-birthday-with-family-shares-rare-pics-of-son-jack-blues-bieber-2687734-2025-03-02",
      "headline": "Justin Bieber celebrates 31st birthday with family, shares rare pics of son JackPop sensation Justin Bieber marked his 31st birthday with a heartwarming family gathering. He shared rare photos with wife Hailey and their son Jack, capturing the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advanis-miss-universe-worthy-answer-on-twins-surfaces-after-pregnancy-news-2687733-2025-03-02",
      "headline": "Kiara Advani's 'Miss Universe-worthy' answer on twins surfaces after pregnancy newsKiara Advani and Sidharth Malhotra announced their pregnancy on Friday. A throwback video of Kiara talking about twins and wanting Kareena Kapoor's confidence in her daughter has since gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/samantha-receives-award-for-15-years-in-cinema-says-many-more-to-come-2687732-2025-03-02",
      "headline": "Samantha receives award for 15 years in cinema, says 'many more to come'Actor Samantha made her acting debut in 2010 with the Telugu film Ye Maaya Chesave. To celebrate 15 years in the film industry, she was honoured at an event in Chennai, which she attended alongside filmmakers Raj and DK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sandeep-reddy-vanga-on-why-he-didnt-cast-shahid-kapoor-in-animal-2687716-2025-03-02",
      "headline": "Sandeep Reddy Vanga on why he didn't cast Shahid Kapoor in AnimalFilmmaker Sandeep Reddy Vanga opened up about not casting Shahid Kapoor in the 2023 film Animal. He explained why Ranbir Kapoor was selected for the lead role."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-dale-steyn-wants-a-century-from-virat-kohlis-bat-in-300th-odi-ind-vs-nz-2687606-2025-03-02",
      "headline": "A century from Virat Kohli in his 300th ODI would be magical to see: Dale SteynLegendary South Africa fast bowler Dale Steyn expressed his desire to get to see a century from Virat Kohli's bat in his 300th ODI. Kohli will play his 300th ODI vs New Zealand in ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-fighting-spirit-vivian-richards-legendary-india-vs-new-zealand-2687719-2025-03-02",
      "headline": "Virat Kohli is legendary because of his fighting spirit: Viv RichardsWest Indies legend Vivian Richards hailed Virat Kohli's resilience, calling his ability to thrive under pressure \"legendary.\" Kohli's match-winning century against Pakistan in the Champions Trophy silenced a lot of critics that doubted him during his rough patch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-live-score-dubai-weather-rohit-santner-2687697-2025-03-02",
      "headline": "IND vs NZ Live: In-form India face first stern testChampions Trophy, India (IND) vs New Zealand (NZ) Live Updates: Both India and New Zealand have won their matches until now and would be looking to top the points table in Group A. India began with a win over Bangladesh before taking down Pakistan in Dubai last Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-players-to-watch-out-sunil-gavaskar-2687690-2025-03-02",
      "headline": "Sunil Gavaskar points out 2 New Zealand players India need to watch out forSunil Gavaskar said that India will need to be wary of Rachin Ravindra and Glenn Phillips as the main threats during their contest against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-smriti-mandhana-rcb-apology-2687689-2025-03-02",
      "headline": "Smriti Mandhana apologises to fans after RCB's horror Bengaluru legWPL 2025: Skipper Smriti Mandhana apologised to the Bengaluru fans after RCB failed to win a single match on their home ground at the M Chinnaswamy Stadium. The Challengers have slipped to fourth in the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-arshdeep-singh-in-mohammed-shami-injury-india-vs-new-zealand-zaheer-khan-2687687-2025-03-02",
      "headline": "Arshdeep in, no risk needed with Shami vs New Zealand: Zaheer KhanZaheer Khan believes India should rest Mohammed Shami against New Zealand and give Arshdeep Singh a chance, considering Shami's minor injury scare and Arshdeep's impressive T20I form ahead of the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-sachin-tendulkar-record-2687681-2025-03-02",
      "headline": "Never write him off: Ponting backs Kohli to match Tendulkar's ODI recordChampions Trophy 2025: Former Australian skipper Ricky Ponting said that if Virat Kohli can stay hungry and fit, he can go on to break Sachin Tendulkar's record for most runs in ODI cricket. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-aiden-markram-injury-not-feeling-well-marco-jansen-2687671-2025-03-02",
      "headline": "Aiden Markram not feeling too well ahead of semi-final: Marco JansenSouth Africa faces a major setback ahead of their Champions Trophy semi-final as Marco Jansen revealed Aiden Markram is struggling with a hamstring niggle, adding to concerns with Temba Bavuma and David Miller already sidelined due to illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-local-left-arm-spinners-kuldeep-yadav-2687665-2025-03-02",
      "headline": "NZ batters call up local left-arm spinners to prepare for Kuldeep contestNew Zealand roped in two local left-arm wrist spinners to help Tom Latham and Michael Bracewell prepare for India's Kuldeep Yadav ahead of their crucial Champions Trophy clash, with Glenn Phillips highlighting the challenge of India's spin attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sahin-tendulkar-300-odi-appearances-india-vs-new-zealand-2687660-2025-03-02",
      "headline": "Kohli at 300: India star continues to chase perfection, idol Sachin TendulkarVirat Kohli is all set to achieve a landmark in his career as he will be playing in his 300th ODI. At the age of 36, Kohli continues to chase perfection in his game and his idol Sachin Tendulkar's records. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-sachin-tendulkar-record-2687681-2025-03-02",
      "headline": "Never write him off: Ponting backs Kohli to match Tendulkar's ODI recordChampions Trophy 2025: Former Australian skipper Ricky Ponting said that if Virat Kohli can stay hungry and fit, he can go on to break Sachin Tendulkar's record for most runs in ODI cricket. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-aiden-markram-injury-not-feeling-well-marco-jansen-2687671-2025-03-02",
      "headline": "Aiden Markram not feeling too well ahead of semi-final: Marco JansenSouth Africa faces a major setback ahead of their Champions Trophy semi-final as Marco Jansen revealed Aiden Markram is struggling with a hamstring niggle, adding to concerns with Temba Bavuma and David Miller already sidelined due to illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-local-left-arm-spinners-kuldeep-yadav-2687665-2025-03-02",
      "headline": "NZ batters call up local left-arm spinners to prepare for Kuldeep contestNew Zealand roped in two local left-arm wrist spinners to help Tom Latham and Michael Bracewell prepare for India's Kuldeep Yadav ahead of their crucial Champions Trophy clash, with Glenn Phillips highlighting the challenge of India's spin attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sahin-tendulkar-300-odi-appearances-india-vs-new-zealand-2687660-2025-03-02",
      "headline": "Kohli at 300: India star continues to chase perfection, idol Sachin TendulkarVirat Kohli is all set to achieve a landmark in his career as he will be playing in his 300th ODI. At the age of 36, Kohli continues to chase perfection in his game and his idol Sachin Tendulkar's records. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}