{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-26-per-cent-additional-tariffs-on-india-suspended-till-july-9-white-house-2707174-2025-04-10",
      "headline": "Trump's 26% additional tariffs on India suspended till July 9: White HouseOn April 2, US President Donald Trump slapped universal duties on about 60 countries exporting goods to America and additional steep levies on countries like India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-dalal-street-cash-in-on-trump-90-day-tariff-break-indian-stock-market-us-stocks-china-125-percent-tariff-2707047-2025-04-10",
      "headline": "Will Dalal Street cash in on Trump's 90-day tariff timeout?The US President's unexpected decision to announce a 90-day pause on reciprocal tariffs—with China being the notable exception—has reignited global risk appetite. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/italy-prada-agrees-to-buy-fashion-rival-versace-2707066-2025-04-10",
      "headline": "Italy's Prada agrees to buy fashion rival Versace in nearly $1.4 billion dealThe price Prada has agreed to pay for Versace is a big discount to the roughly USD 2.15 billion including debt that Capri paid for Versace in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q4-results-profit-falls-2-to-rs-12224-crore-final-dividend-at-rs-30-2706982-2025-04-10",
      "headline": "TCS Q4 Results: Profit falls 2% to Rs 12,224 crore, final dividend at Rs 30TCS ends FY25 with strong deal wins but earnings miss estimates, capping a tough year for the IT giant as macro headwinds and weak discretionary spending weigh on profit growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-introduces-face-authentication-for-uan-generation-know-details-2706972-2025-04-10",
      "headline": "EPFO introduces face authentication for UAN generation. Know detailsNow, both employers and employees can generate a UAN by simply using facial recognition via the government's UMANG app. This is expected to solve common problems such as incorrect personal details or missing mobile numbers, which often delayed UAN generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-airlifts-600-tons-of-iphones-from-india-to-dodge-trumps-china-tariffs-report-2706960-2025-04-10",
      "headline": "Apple airlifts 600 tons of iPhones from India to dodge Trump's China tariffsThe devices were flown out of the Chennai airport in the southern state of Tamil Nadu, where Apple has been building up production through its manufacturing partners like Foxconn and Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q4-results-dividend-announcement-today-april-9-what-to-expect-growth-us-tariff-2706944-2025-04-10",
      "headline": "TCS Q4 results to be announced today: What to expect from the IT firm?Investors and market watchers are expecting a mixed performance from the IT major. Key focus areas include operating margins, revenue growth, deal wins, employee attrition, and management commentary on guidance for the year ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-jokes-about-trump-tariffs-bring-paracetamol-and-iphone-2706925-2025-04-10",
      "headline": "Sanjeev Sanyal says tariff-hit NRI relatives calling to ask for paracetamol, iPhonesDonald Trump has hinted at imposing new tariffs on pharmaceuticals, a move that could raise costs for Indian pharmaceutical companies. This would make Indian-made generic drugs more expensive for both Americans and Indian consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-donald-trump-tariff-90-day-pause-usd-500-billion-opportunity-2706882-2025-04-10",
      "headline": "90 days, $500 billion, one big shot: India's trade gamble in Trump's tariff pauseThe pause in tariffs is seen in New Delhi as more than just goodwill; it's strategic. By sparing countries like India, the US appears to be isolating China in what is shaping up to be the most aggressive round of trade hostilities since the Covid-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-trade-war-tariff-125-percent-what-it-means-for-india-and-world-global-market-2706864-2025-04-10",
      "headline": "Explained: What US-China trade war means for India and the worldWith tariffs flying thick and fast, supply chains unravelling, and geopolitical tensions rising, India, like much of the world, finds itself watching, waiting, and bracing for impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-jumps-over-6-percent-after-donald-trump-90-day-tariff-break-ethereum-xrp-cardano-solana-dogecoin-shiba-inu-witness-price-rally-2706858-2025-04-10",
      "headline": "Bitcoin jumps over 6% after Trump's 90-day tariff break; Ethereum, XRP rallyBitcoin, along with other major cryptos like Ethereum, XRP, Cardano, Solana, and Dogecoin, etc., are witnessing a surge in their prices post US President Donald Trump's announcement of a 90-day pause on new tariff hikes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-potential-market-crash-investors-may-stay-away-for-years-2706820-2025-04-10",
      "headline": "Zerodha CEO Nithin Kamath on market crash: 'Investors may stay away for years'In 2008, the global market took a major hit with the collapse of Lehman Brothers, a global financial services firm and one of the largest investment banks in the US, causing a ripple effect around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tweet-great-time-to-buy-stock-market-advice-global-market-rally-90-day-pause-tariff-2706794-2025-04-10",
      "headline": "Should stock market investors take Donald Trump's 'buy' tip seriously?From aggressive tariffs on China to sudden pauses and vague reassurances, the whiplash is real and investors are feeling it. Markets bleed one day and bounce back the next, all thanks to a tweet or a policy pivot from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-market-wall-street-nikkei-jump-donald-trump-hits-pause-90-days-on-reciprocal-tariffs-2706732-2025-04-10",
      "headline": "Global markets jump as Donald Trump hits pause on tariffsGlobal markets rise: The S&P 500 and the Nasdaq saw their biggest daily percentage rises in over 10 years, adding over $1.5 trillion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-stock-market-close-holiday-mahavir-jayanti-sensex-nifty-no-trading-nse-bse-global-market-2706727-2025-04-10",
      "headline": "Mahavir Jayanti holiday: Are Sensex and Nifty open for trading today?Stock market holiday: According to the official stock market holiday list, Mahavir Jayanti is one of three holidays in April. The other two are on April 14 for Dr Baba Saheb Ambedkar Jayanti and April 18 for Good Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/msc-turkiye-world-biggest-green-cargo-ship-docks-at-adani-vizhinjam-port-2706724-2025-04-10",
      "headline": "World's biggest green cargo ship, MSC Turkiye docks at Adani's Vizhinjam PortMSC Turkiye: The vessel is 399.9 metres long, 61.3 metres wide, and has a depth of 33.5 metres. It has the capacity to carry 24,346 twenty-foot equivalent units (TEUs), making it one of the largest container ships ever built."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-surges-as-trump-hits-pause-on-tariffs-dow-jumps-over-2300-points-glbs-2706665-2025-04-09",
      "headline": "Wall Street surges as Trump hits pause on tariffs, Dow jumps over 2,300 pointsWall Street jumped after President Trump paused new tariffs for 90 days, easing trade worries. Big tech companies like Apple and Nvidia led the gains. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-over-350-points-nifty-below-22500-banking-stocks-down-2706416-2025-04-09",
      "headline": "Sensex falls over 350 points, Nifty below 22,500; banking stocks downThe S&P BSE Sensex was down 379.73 points to close at 73,847.15, while the NSE Nifty50 lost 136.70 points to end at 22,399.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-rajdhani-to-vande-bharat-investor-criticises-india-lag-in-train-tech-2706391-2025-04-09",
      "headline": "From Rajdhani to Vande Bharat: Investor criticises India's lag in train techWhen Rajdhani was launched in 1969, it placed India among Asia's fastest rail nations, second only to Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-governor-sanjay-malhotra-us-tariff-impact-worried-over-growth-than-inflation-2706354-2025-04-09",
      "headline": "RBI Governor says US tariff impact on growth bigger worry than inflationThe RBI's rate cut comes at a time when inflation appears to be under control, but economic growth faces risks from global uncertainty after US tariffs imposed by President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-impact-market-banking-stocks-down-reason-here-why-bank-margins-2706331-2025-04-09",
      "headline": "RBI rate cut brings relief for borrowers, but banking stocks tumble. Here's whyBanking stocks, especially public sector lenders, took a sharp hit after the rate cut announcement. The Nifty Bank index was down nearly 1%, with major losers including Bank of Baroda, Canara Bank, Punjab National Bank, and SBI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-6-key-takeaways-from-mpc-meeting-governor-sanjay-malhotra-announces-april-9-2025-2706322-2025-04-09",
      "headline": "RBI monetary policy: 6 key takeaways from MPC meetingWith the repo rate cut, borrowing costs for home and personal loans are likely to fall. This would provide a big relief to the homebuyers and could boost the housing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-5-key-development-reforms-you-must-know-2706284-2025-04-09",
      "headline": "RBI MPC meeting: 5 key development reforms you must knowCurrently, UPI payments are mostly capped at Rs 1 lakh for both P2P and P2M. The RBI has suggested that National Payments Corporation of India (NPCI) may now review and revise these limits based on evolving user needs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-cuts-repo-rate-by-25-bps-to-6-gdp-forecast-lowered-to-65-for-fy26-ytvd-2706254-2025-04-09",
      "headline": "RBI cuts Repo Rate by 25 points to 6% amid global trade warThe Reserve Bank of India has cut the repo rate by 25 basis points to 6%, potentially leading to lower EMIs for home loans. The RBI has also lowered the GDP forecast for FY26 to 6.5% from the earlier 6.7%. The Monetary Policy Committee unanimously decided to change the stance from neutral to accommodative, hinting at possible further easing. The RBI Governor expressed concerns over global trade uncertainties and their potential impact on inflation and growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-rate-cut-6-percent-25-bps-home-auto-loan-emis-likely-to-get-cheaper-2706246-2025-04-09",
      "headline": "Cheaper home, auto loan EMIs after RBI rate cut. What it means for youRBI reduces key lending rate to 6%. Lower interest rates are expected to make borrowing cheaper, which can help people buy homes or vehicles more easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-central-bank-moves-from-neutral-to-accommodative-stance-2706237-2025-04-09",
      "headline": "RBI changes stance from neutral to accommodative: What does it mean?The Reserve Bank of India (RBI) Governor Sanjay Malhotra has announced a cut in the repo rate by 25 basis points, bringing it down from 6.25% to 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-gdp-forecast-reduces-fiscal-2025-2026-65-per-cent-from-67-per-cent-donald-trump-us-tariff-war-2706227-2025-04-09",
      "headline": "RBI downgrades 2025-26 GDP forecast to 6.5% from 6.7% amid global tariff warWhile sharing the new projections, Governor Sanjay Malhotra said the downward revision of the GDP forecast was mainly due to growing risks in global trade and policy developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/donald-trumps-26-per-cent-reciprocal-tariffs-on-india-come-into-effect-2706214-2025-04-09",
      "headline": "Donald Trump's 26% reciprocal tariffs on India come into effectA 26% tariff on Indian exports to the USA has come into effect. Key sectors impacted include electronics, gems and jewellery, auto components, and agricultural products. The Union Cabinet is set to meet to discuss India's strategy and the impact on exporters. The Indian government is in touch with exporters to minimise the impact, while also working on a bilateral trade agreement with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-mpc-meeting-cuts-key-rates-again-second-consecutive-time-25-bps-6-per-cent-2706220-2025-04-09",
      "headline": "Home loans to get cheaper as RBI cuts key lending rate by 25 basis points to 6%RBI MPC meeting: This is the second rate cut in a row, following a 25 basis point reduction in February. RBI also changed its earlier stance from neutral to 'accommodative'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-indian-exports-imports-26-per-cent-come-into-effect-government-meeting-narendra-modi-2706212-2025-04-09",
      "headline": "Trump's 26% tariffs on India come into effect, big Cabinet meet todayWith markets in a free fall since Donald Trump's reciprocal tariff announcement, the Union Cabinet will hold a crucial meeting today to strategise on ways to minimise the impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-down-300-points-nifty-below-22500-as-investors-await-rbi-mpc-announcements-2706203-2025-04-09",
      "headline": "Sensex, Nifty open lower as RBI policy and global cues weigh on investorsThe S&P BSE Sensex fell by 255.49 points to 73,971.59, while the NSE Nifty50 lost 86.70 points to 22,449.15 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-will-home-loans-get-cheaper-policy-announcement-today-rate-cut-25-bps-2706195-2025-04-09",
      "headline": "RBI MPC: Will home loans get cheaper after today's policy announcement?RBI MPC meeting: In its last meeting held in February, the RBI cut the repo rate by 25 basis points. This was the first rate cut under RBI Governor Sanjay Malhotra, and also the first cut in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-opening-april-9-rbi-mpc-decision-pause-dalal-street-rally-2706183-2025-04-09",
      "headline": "Stock market today: Will RBI MPC decision pause Sensex, Nifty rally?The Sensex and Nifty ended Tuesday's session with big gains, but a global sell-off and worries about trade tensions are expected to affect today's opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-9-shares-in-focus-today-ntpc-adani-wilmar-vodafone-idea-bpcl-trump-tariff-sensex-nifty-2706171-2025-04-09",
      "headline": "Stocks to watch on April 9: NTPC, Adani Wilmar, Vodafone Idea, BPCLIn today's trade, many shares will be in focus due to key news developments. These include NTPC, BPCL, Adani Wilmar, Vodafone Idea, Cyient, PNB Housing Finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-lowest-close-one-year-reciprocal-tariffs-donald-trump-hopes-fading-2706141-2025-04-09",
      "headline": "S&P 500 hits lowest level in one year as hopes for Trump tariff relief fadeThe S&P 500 reached its lowest level in nearly a year after it reversed a strong morning rally, as hopes faded for any concessions or delays on President Donald Trump's global tariffs on US's trading partners set to come into effect on April 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-dow-jones-nasdaq-sp-500-sensex-nifty-prediction-rally-to-continue-2706027-2025-04-08",
      "headline": "US markets gain sharply on hopes of tariff talks: Will Dalal Street continue rally?If Wall Street wraps up today's session on a strong note, it could deliver a big dose of confidence to investors worldwide, especially in Asian markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opening-us-markets-rally-as-dow-jones-jumps-1100-points-nasdaq-sp-surge-3-percent-2706016-2025-04-08",
      "headline": "US markets rally as Dow Jones jumps 1,100 points, Nasdaq, S&P surge 3%The surge in US stocks came as investors looked for any indication that the US might be open to easing some of its tougher tariffs through negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opting-for-new-tax-regime-know-about-this-rs-7000-post-office-savings-benefit-2705963-2025-04-08",
      "headline": "Opting for new tax regime? Know about this Rs 7,000 post office savings benefitAs per a government notification issued back in 2011, interest from post office savings accounts is exempt under Section 10(15) of the Income Tax Act."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/emma-corrin-jack-lowden-olivia-colman-to-star-in-netflixs-pride-and-prejudice-2707202-2025-04-10",
      "headline": "​Emma Corrin, Jack Lowden, Olivia Colman to star in Netflix's Pride and Prejudice​Emma Corrin, Jack Lowden and Olivia Colman are set to star in Netflix's 'Pride & Prejudice'. The production of the miniseries is scheduled to begin in the UK later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neeraj-ghaywan-homebound-ishaan-khatter-janhvi-kapoor-selected-cannes-2025-un-certain-regard-2707184-2025-04-10",
      "headline": "Neeraj Ghaywan's Homebound with Ishaan Khatter, Janhvi selected for Cannes 2025Filmmaker Neeraj Ghaywan's Homebound, featuring Ishaan Khatter and Janhvi Kapoor, will be screened at Cannes 2025. The movie has been selected for the prestigious Un Certain Regard category. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-visits-manoj-kumar-home-meets-his-family-pays-tribute-2707162-2025-04-10",
      "headline": "Anupam Kher visits Manoj Kumar's home, meets his family and pays tributeActor Anupam Kher recently visited Manoj Kumar's residence and paid tribute to the legendary actor. Kumar died on April 4 due to prolonged illness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-prediction-day-1-sunny-deol-film-poised-for-a-modest-opening-2707154-2025-04-10",
      "headline": "Jaat box office prediction Day 1: Sunny Deol film poised for a modest openingJaat box office prediction Day 1: Actor Sunny Deol's Jaat is looking at a decent day one figure. The actioner also stars Randeep Hooda and Viineet Kumar Singh in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/alappuzha-gymkhana-movie-review-unconventional-sports-drama-with-emotions-2707131-2025-04-10",
      "headline": "Alappuzha Gymkhana review: Unconventional sports drama with emotional uppercutsReleased-Thu Apr 10, 2025Alappuzha Gymkhana movie review: The film is less about the power of punches and more about what it means to stumble, try, and still show up. Despite its tonal shifts and uneven emotional payoff, the film thrives in its charming chaos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ram-gopal-varma-faces-police-complaint-in-andhra-for-hindu-hate-speech-2707134-2025-04-10",
      "headline": "Filmmaker Ram Gopal Varma booked for alleged anti-Hindu remarks on social mediaA regional political party in Andhra Pradesh has accused filmmaker Ram Gopal Varma of making derogatory remarks on Hindu religion through social media, calling for legal action under BNS provisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aaditi-pohankar-on-aashram-game-changer-for-her-wishes-to-work-with-ranbir-kapoor-exclusive-2707124-2025-04-10",
      "headline": "Aaditi Pohankar calls Aashram 'a game changer': It has given me everythingAaditi Pohankar discussed her journey into the limelight, focusing on her breakthrough role in 'Aashram' and her relaxed approach towards fame in the Indian entertainment industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-son-mark-shankar-is-back-home-and-recuperating-chiranjeevi-2707123-2025-04-10",
      "headline": "Pawan Kalyan's son is back home and recuperating, says ChiranjeeviChiranjeevi shared an update about Pawan Kalyan's son's injury. The veteran actor informed that his nephew, Mark Shankar, is back home from the hospital and is recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harry-styles-to-build-ps30m-mansion-after-wildlife-friendly-approval-heres-what-you-need-to-know-glbs-2707120-2025-04-10",
      "headline": "Harry Styles to Build £30M Mansion After Wildlife-Friendly Approval- Here's what you need to knowHarry Styles gets approval to build his £30M Hampstead mansion by merging two historic homes—but must install bat boxes, hedgehog gateways, and insect hotels. With strict wildlife rules and a two-year build ahead, his dream home is finally underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-warns-of-uk-subscription-price-hike-if-government-imposes-streaming-levy-glbs-2707110-2025-04-10",
      "headline": "Netflix warns of UK subscription price hike if government imposes streaming levyNetflix warns UK subscribers of potential price hikes if a proposed 5% streaming levy is enforced. The streamer opposes the plan, saying it would hurt investment and viewers. The UK government hasn't approved the levy yet, keeping prices stable, for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-mirror-season-7-everything-you-need-to-know-about-the-sci-fi-show-glbs-2707099-2025-04-10",
      "headline": "Black Mirror Season 7: Everything you need to know about the sci-fi showBlack Mirror Season 7 premieres April 10 on Netflix, featuring six new episodes, returning stars from USS Callister, and a stellar cast including Peter Capaldi and Awkwafina. Expect mind-bending sci-fi, nostalgic twists, and Charlie Brooker's signature disturbing storytelling.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-to-make-met-gala-debut-buzz-after-instagram-post-2707089-2025-04-10",
      "headline": "Shah Rukh Khan to make Met Gala debut? Buzz after Instagram postShah Rukh Khan is believed to make his grand Met Gala debut this year. The buzz erupted among fans after an Instagram post went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/pulse-actor-ash-santos-on-medical-drama-expectations-vs-reality-bollywood-exclusive-2707084-2025-04-10",
      "headline": "Pulse actor Ash Santos on medical drama, expectations VS reality, Bollywood | ExclusiveAsh Santos is seen in the Netflix show Pulse. In an exclusive chat with India Today's Bhavna Agarwal, she spoke about being a part of a medical drama, the expectation vs reality, how she deals with feedback and the challenges of working in Hollywood"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-dhupia-joins-assam-police-for-parenting-campaign-after-adolescence-fever-2707069-2025-04-10",
      "headline": "Neha Dhupia joins Assam Police for parenting campaign after Adolescence feverActor Neha Dhupia has joined hands with Assam Police for a digital parenting campaign after the Netflix series Adolescence, fever shook the nation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maranamass-review-basil-joseph-rajesh-madhavan-tovino-thomas-2707063-2025-04-10",
      "headline": "Maranamass review: Basil Joseph's film is a treasure trove of absurd comedyReleased-Thu Apr 10, 2025Maranamass movie review: Director Sivaprasad's 'Maranamass' is a dark comedy starring Basil Joseph, Rajesh Madhavan, Siju Sunny and Suresh Krishna. The film has plenty of laughs, but also meanders as it progresses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/graffiti-artist-accuses-cid-for-using-his-artwork-without-credit-deletes-video-2707009-2025-04-10",
      "headline": "Graffiti artist accuses CID for using his artwork without credit, deletes videoA Graffiti artist accused CID of stealing his artwork from YouTube. The artist later deleted his video where he shared his concerns. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-jean-claude-van-damme-denies-trafficking-charges-calls-them-absurd-2707053-2025-04-10",
      "headline": "Actor Jean-Claude Van Damme denies trafficking allegations, calls them absurdActor Jean-Claude Van Damme has denied human trafficking allegations. He has called them \"unfounded and absurd.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pedro-pascals-the-last-of-us-renewed-for-season-three-before-season-two-release-2707013-2025-04-10",
      "headline": "Pedro Pascal's The Last of Us renewed for season threeThe hit series 'The Last of Us,' starring Pedro Pascal, is set for a third season even before its second season airs. The show's renewal underscores its massive popularity and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jaat-review-sunny-deol-film-mass-masala-blast-we-needed-2707006-2025-04-10",
      "headline": "Jaat review: Sunny Deol's film is the mass masala blast we didn't know we neededReleased-Thu Apr 10, 2025Jaat movie review: Sunny Deol's 'Jaat' is an action-packed spectacle that captivates audiences with its high-octane drama and powerful performances, says our review. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-skipper-ruturaj-gaikwad-ruled-out-2707057-2025-04-10",
      "headline": "IPL 2025: MS Dhoni to take over as CSK captain, Ruturaj Gaikwad ruled outChennai Super Kings captain (CSK) Ruturaj Gaikwad has been ruled out of the entire Indian Premier League 2025 (IPL 2025) due to a hairline fracture on his elbow. MS Dhoni is all set to take over the leadership duties for the rest of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-rape-victim-she-invited-trouble-bail-to-accused-controversy-2706952-2025-04-10",
      "headline": "She invited trouble: High Court grants bail to accused in rape caseThe Allahabad High Court said that the rape survivor, being a postgraduate student, was mature and competent enough to understand the morality and significance of her actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/future-of-1-lakh-indian-students-at-stake-us-bill-seeks-to-end-work-visa-route-opt-stem-f1-trump-2707029-2025-04-10",
      "headline": "Future of 1 lakh Indian students at stake as US Bill seeks to end OPT work visaA new Bill in the US Congress aiming to end the Optional Practical Training (OPT) programme adds to the worries of Indian students in STEM courses. The Bill seeks to end their ability to gain work experience in the US after graduation, raising fears of deportation. The Bill, however, has very little chance of being cleared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-hussain-rana-first-photo-visual-video-after-india-extradition-2707160-2025-04-10",
      "headline": "White hair, brown overalls: Tahawwur Rana's first photo after extradition to IndiaDressed in a brown overalls, 64-year-old Tahawwur Hussain Rana was seen with white hair and a beard, facing away from the camera. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/plot-twist-vinesh-phogat-opts-for-rs-4-crore-government-job-bjp-govt-haryana-nayab-singh-saini-2707112-2025-04-10",
      "headline": "Vinesh Phogat opts for Rs 4 crore, not job or plot, from BJP govt in HaryanaWrestler-turned-Congress MLA Vinesh Phogat has opted for a cash reward of Rs 4 crore offered by the BJP-led Haryana government. She was given the option to pick between a cash reward, a residential plot, or a Group A government job under the state's sports policy. This was to honour her for her Paris Olympic efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-report-kl-rahul-bengaluru-chinnaswamy-2707192-2025-04-10",
      "headline": "KL Rahul haunts RCB again in Bengaluru as DC continue unbeaten runLocal boy KL Rahul came back to haunt his former side RCB with a stunning performance as DC maintained their unbeaten run in the IPL 2025 season. RCB were left to rue on the bright start they made as Delhi came back into the contest with their impressive bowling. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-boyfriend-lover-cash-on-delivery-parcel-to-woman-arrested-west-bengal-nadia-2707132-2025-04-10",
      "headline": "Bengal man sends 300 cash-on-delivery parcels to ex-lover as revengeA 25-year-old man in West Bengal allegedly sent nearly 300 unwanted cash-on-delivery (COD) parcels to his ex-girlfriend's residence via Amazon and Flipkart as an act of revenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-us-india-journey-vienna-charter-jet-romania-stopover-2707093-2025-04-10",
      "headline": "Mid-size jet, 11-hour Romania stopover: Tahawwur Rana's Miami to India journeyTahawwur Rana was extradited from US to India, with the special flight carrying the 26/11 attack accused landing on Thursday evening. Here's a look at the details and the transatlantic route of Rana's extradition flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jaat-review-sunny-deol-film-mass-masala-blast-we-needed-2707006-2025-04-10",
      "headline": "Jaat review: Sunny Deol's film is the mass masala blast we didn't know we neededReleased-Thu Apr 10, 2025Jaat movie review: Sunny Deol's 'Jaat' is an action-packed spectacle that captivates audiences with its high-octane drama and powerful performances, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/italy-prada-agrees-to-buy-fashion-rival-versace-2707066-2025-04-10",
      "headline": "Italy's Prada agrees to buy fashion rival Versace in nearly $1.4 billion dealThe price Prada has agreed to pay for Versace is a big discount to the roughly USD 2.15 billion including debt that Capri paid for Versace in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rain-weather-temperature-imd-prediction-noida-gurugram-forecast-dust-storm-2707068-2025-04-10",
      "headline": "Delhi witnesses heavy rain, gusty winds in big heatwave reliefSeveral parts of Delhi and the NCR received light to moderate rain with thunderstorms and gusty winds, bringing relief from the ongoing heatwave. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tukaram-omble-2611-hero-cop-ajmal-kasab-capture-brother-public-hanging-tahawwur-rana-2706991-2025-04-10",
      "headline": "Tahawwur Rana should be hanged publicly: Brother of 26/11 hero cop Tukaram OmbleEknath Omble, brother of Assistant Sub-Inspector Tukaram Omble who was killed while helping capture terrorist Ajmal Kasab, said Tahawwur Rana should be hanged publicly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/white-house-dont-retaliate-rewarded-post-has-x-users-sharing-parenting-tips-2707019-2025-04-10",
      "headline": "White House's 'don't retaliate, rewarded' post has X users sharing parenting tipsThe post came amid US President Donald Trump's surprise announcement of a 90-day pause on tariffs for over 75 countries, a dramatic reversal just a day after imposing sweeping new trade duties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/mamatas-mps-at-war-why-kalyan-banerjee-mahua-moitra-had-a-showdown-2706936-2025-04-10",
      "headline": "Mamata's MPs at war: Why Kalyan Banerjee, Mahua Moitra had a showdownThe public breakdown of decorum has provoked internal criticism in the Trinamool Congress and invited a restraining order from the party chief\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-security-nia-cell-ready-for-tahawwur-rana-key-evidence-big-questions-await-2706902-2025-04-10",
      "headline": "For Tahawwur Rana, a high-security NIA cell, only 'Special 12' have accessTahawwur Rana will be interrogated in a high-security NIA cell, where he will be presented with key evidence related to the 26/11 Mumbai attacks. Access to this special interrogation cell will be restricted to just 12 officers from the investigating agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-electricity-bill-manal-home-1-lakh-himachal-pradesh-electricity-bill-2706996-2025-04-10",
      "headline": "Rs 1 lakh power bill to Kangana Ranaut for Manali house? Electricity board reactsThe Himachal Pradesh Electricity Board refuted BJP MP Kangana Ranaut's claim of a Rs 1 lakh monthly power bill, clarifying it included arrears and also noting her Manali home's power load was 1,500 per cent higher than average."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-to-make-met-gala-debut-buzz-after-instagram-post-2707089-2025-04-10",
      "headline": "Shah Rukh Khan to make Met Gala debut? Buzz after Instagram postShah Rukh Khan is believed to make his grand Met Gala debut this year. The buzz erupted among fans after an Instagram post went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/project-shield-india-today-nationwide-awareness-campaign-digital-fraud-2706966-2025-04-10",
      "headline": "Project Shield: India Today launches nationwide awareness campaign against digital fraudJust last year, Indians lost nearly Rs 23,000 crore to fraudsters. Over 20 lakh people are being defrauded every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/european-union-pauses-countermeasures-after-trumps-reprieve-to-give-negotiations-a-chance-2706993-2025-04-10",
      "headline": "EU pauses countermeasures after Trump's reprieve to give 'negotiations a chance'The European bloc was due to launch counter-tariffs on about 21 billion euros (USD 23.25 billion) of US imports from next Tuesday in response to Trump's 25 per cent tariffs on steel and aluminium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-jean-claude-van-damme-denies-trafficking-charges-calls-them-absurd-2707053-2025-04-10",
      "headline": "Actor Jean-Claude Van Damme denies trafficking allegations, calls them absurdActor Jean-Claude Van Damme has denied human trafficking allegations. He has called them \"unfounded and absurd.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/looking-for-a-car-between-rs-10-lakh-and-rs-20-lakh-consider-these-top-models-2707015-2025-04-10",
      "headline": "Looking for a car between Rs 10 lakh and Rs 20 lakh? Consider these top modelsBuyers have access to models across multiple segments in the price bracket of Rs 10 lakh to Rs 20 lakh (ex-showroom)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-crocodiles-are-dying-mysteriously-in-vadodara-2706281-2025-04-10",
      "headline": "Why crocodiles are dying mysteriously in VadodaraAt least eight crocodiles have died in the Vishwamitri river within months, alarming conservationists and residents; forest department says nothing alarming yet\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-indian-students-self-deport-what-to-do-if-visa-revoked-trump-immigration-green-card-harvard-columbia-university-2706446-2025-04-10",
      "headline": "US asking Indian students to self-deport. Here's what they can doMany Indians are among the scores of international students in American colleges and universities who have received an email stating that their visas have been revoked. Experts suggest self-deportation should be the last option. Amid fear of deportation, here's the legal recourse that students can take."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nia-chief-leading-fight-against-tawahhur-rana-2611-terror-attacks-hero-sadanand-vasant-date-ips-officer-2706928-2025-04-10",
      "headline": "26/11-hero cop who took on Kasab will lead Tahawwur Rana caseIndia is bringing back 26/11 terror plotter Tahawwur Rana to face justice in the country. Leading the fight is none other than 26/11 hero Sadanand Date, who fought terrorists, including Ajmal Kasab, and was severely injured. Date is now the NIA chief. The NIA, formed after the 2008 Mumbai attacks, is at the forefront of getting Rana prosecuted."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-match-winning-knock-rcb-vs-dc-m-chinnaswamy-stadium-2707209-2025-04-10",
      "headline": "Watch: Rahul stamps his authority with calma celebration after classy 93 vs RCBDelhi Capitals (DC) batter KL Rahul brought out an aggressive celebration following his match-winning innings against Royal Challengers Bengaluru (RCB) in Match 24 of the Indian Premier League 2025 (IPL 2025) at the M. Chinnaswamy Stadium in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-tj-watts-steelers-future-in-question-as-contract-nears-end-glbs-2707203-2025-04-10",
      "headline": "NFL: T.J. Watt's Steelers future in question as contract nears endThe Pittsburgh Steelers have built their legacy on a dominant defense, and T.J. Watt has been the face of that tradition. But as a pivotal season approaches, uncertainty looms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-report-kl-rahul-bengaluru-chinnaswamy-2707192-2025-04-10",
      "headline": "KL Rahul haunts RCB again in Bengaluru as DC continue unbeaten runLocal boy KL Rahul came back to haunt his former side RCB with a stunning performance as DC maintained their unbeaten run in the IPL 2025 season. RCB were left to rue on the bright start they made as Delhi came back into the contest with their impressive bowling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ms-dhoni-had-no-hesitation-to-step-in-as-captain-csk-head-coach-2707177-2025-04-10",
      "headline": "MS Dhoni had no hesitation to step in as captain: CSK head coachChennai Super Kings (CSK) head coach Stephen Fleming revealed that legendary wicketkeeper batter MS Dhoni understood the team's situation and had no hesitation to step in as captain after Rututaj Gaikwad got ruled out of the entire Indian Premier League 2025 (IPL 2025) due to an elbow injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-kkr-venkatesh-iyer-press-conference-varun-chakravarthy-2707171-2025-04-10",
      "headline": "Varun Chakravarthy at Chepauk will be an advantage for KKR vs CSK: Venkatesh IyerKKR vice-captain Venkatesh Iyer has said that having Varun Chakravarthy at the Chepauk will be an advantage for them in their clash against CSK on April 11. Varun will be coming to play in his home conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-kuldeep-yadav-vipraj-nigam-mohit-sharma-2707163-2025-04-10",
      "headline": "61 for 0 to 163/7: Kuleep, Vipraj's spin magic choke RCB after fiery startDelhi Capitals (DC) made a remarkable comeback with the ball against Royal Challengers Bengaluru (RCB) in Match 24 of the Indian Premier League 2025 (IPL 2025) as they restricted them to 163 despite a fiery start in the powerplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/csk-head-coach-announces-ms-dhoni-as-captain-for-ipl-2025-2707156-2025-04-10",
      "headline": "Watch: CSK Head coach announces MS Dhoni as captain for remainder of IPL 2025Chennai Super Kings (CSK) head coach Stephen Fleming announced MS Dhoni as their new skipper for the remainder of Indian Premier League 2025 (IPL 2025) after Ruturaj Gaikwad got ruled out due to hairline fracture on his elbow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-virat-kohli-phil-salt-run-out-chinnaswamy-2707155-2025-04-10",
      "headline": "Virat Kohli slammed by fans after Phil Salt's run out in RCB vs DC: SelfishVirat Kohli was slammed by the fans for his involvement in the run out of Phil Salt during the RCB vs DC clash on Thursday, April 10. Salt was in fine form before being run out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-as-chennai-super-kings-captain-is-a-different-beast-sourav-ganguly-2707151-2025-04-10",
      "headline": "MS Dhoni as Chennai Super Kings captain is a different beast: Sourav GangulyFormer India captain Sourav Ganguly has made a big statement on MS Dhoni, saying that he's a different beast altogether as the captain of Chennai Super Kings (CSK). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/the-masters-2025-scheffler-eyes-third-green-jacket-rory-seeks-his-first-glbs-2707150-2025-04-10",
      "headline": "The Masters 2025: Scheffler eyes third green jacket, Rory seeks his firstThe 89th edition of The Masters teed off Thursday with its largest field in a decade and two players firmly in the spotlight: Scottie Scheffler and Rory McIlroy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-captaincy-return-ambati-rayudu-2707130-2025-04-10",
      "headline": "Captain MS Dhoni can pull out his magic and make CSK qualify: Ambati RayuduAmbati Rayudu is very excited to see MS Dhoni return as the captain of the Chennai Super Kings ahead of their clash against KKR on April 11. Dhoni replaces Ruturaj Gaikwad, who has been ruled out of the rest of the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/csk-head-coach-announces-ms-dhoni-as-captain-for-ipl-2025-2707156-2025-04-10",
      "headline": "Watch: CSK Head coach announces MS Dhoni as captain for remainder of IPL 2025Chennai Super Kings (CSK) head coach Stephen Fleming announced MS Dhoni as their new skipper for the remainder of Indian Premier League 2025 (IPL 2025) after Ruturaj Gaikwad got ruled out due to hairline fracture on his elbow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-virat-kohli-phil-salt-run-out-chinnaswamy-2707155-2025-04-10",
      "headline": "Virat Kohli slammed by fans after Phil Salt's run out in RCB vs DC: SelfishVirat Kohli was slammed by the fans for his involvement in the run out of Phil Salt during the RCB vs DC clash on Thursday, April 10. Salt was in fine form before being run out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-as-chennai-super-kings-captain-is-a-different-beast-sourav-ganguly-2707151-2025-04-10",
      "headline": "MS Dhoni as Chennai Super Kings captain is a different beast: Sourav GangulyFormer India captain Sourav Ganguly has made a big statement on MS Dhoni, saying that he's a different beast altogether as the captain of Chennai Super Kings (CSK). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/the-masters-2025-scheffler-eyes-third-green-jacket-rory-seeks-his-first-glbs-2707150-2025-04-10",
      "headline": "The Masters 2025: Scheffler eyes third green jacket, Rory seeks his firstThe 89th edition of The Masters teed off Thursday with its largest field in a decade and two players firmly in the spotlight: Scottie Scheffler and Rory McIlroy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-captaincy-return-ambati-rayudu-2707130-2025-04-10",
      "headline": "Captain MS Dhoni can pull out his magic and make CSK qualify: Ambati RayuduAmbati Rayudu is very excited to see MS Dhoni return as the captain of the Chennai Super Kings ahead of their clash against KKR on April 11. Dhoni replaces Ruturaj Gaikwad, who has been ruled out of the rest of the competition. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}