{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tds-rules-changing-from-april-1-higher-tax-free-limits-on-fd-interest-lottery-insurance-commission-mutual-funds-2692626-2025-03-12",
      "headline": "TDS rules from April 1: Higher tax-free limits on FD interest, lotteryTo benefit senior citizens, the government has doubled the TDS threshold for interest income from Rs 50,000 to Rs 1 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-marginally-lower-it-stocks-infosys-tumble-2692622-2025-03-12",
      "headline": "Sensex, Nifty end marginally lower as IT stocks tumble; Infosys falls over 4%The S&P BSE Sensex ended 72.56 points lower at 74,029.76, while the NSE Nifty50 settled 27.40 points lower at 22,470.50. All the other broader market indices also ended in negative territory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/temasek-takes-a-bit-of-haldirams-buy-10-percent-stake-for-1-billion-dollar-2692580-2025-03-12",
      "headline": "Temasek takes a bit of Haldiram's, buys 10% stake for $1 billion: ReportTemasek, which has already invested in Manipal Hospitals and fast-food giant Devyani International (operator of KFC and Pizza Hut in India), is now looking to cash in on the growing snacks market with its Haldiram's bet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-rolls-out-premium-economy-fares-starting-at-rs-599-for-a-limited-time-2692556-2025-03-12",
      "headline": "Air India rolls out premium economy fares starting at Rs 599 for a limited timeThese premium economy fares are above regular economy fares on domestic flights for a limited time. Prices vary based on routes and demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-top-7-billionaires-lose-34-billion-amid-stock-market-slump-2692540-2025-03-12",
      "headline": "India's top 7 billionaires lose $34 billion amid stock market slumpMukesh Ambani, India's richest person, lost $3.13 billion this year, though he still remains India's richest man with a net worth of $87.5 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dalal-street-falls-sensex-nifty-3-factors-behind-stock-market-correction-2692512-2025-03-12",
      "headline": "Sensex falls over 400 points. 3 factors behind today's stock market slumpStock market today: At around 12:42 pm, the S&P BSE Sensex was down 439.77 points to 73,662.55 and the Nifty50 was trading 150.50 points lower at 22,347.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-some-investors-hnis-choosing-fixed-deposits-over-sips-2692474-2025-03-12",
      "headline": "Why are some investors choosing fixed deposits over SIPs?Many stock market experts suggest that mid-cap and small-cap stocks are currently expensive, which has triggered a correction in the last six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-recover-sharply-after-massive-crash-key-factors-to-know-2692479-2025-03-12",
      "headline": "Explained: Why IndusInd Bank share price is rising today after 27% crashIndusIndi Bank stock price: The stock surged nearly 14% from its intraday low, climbing to Rs 690 on the National Stock Exchange (NSE), breaking a five-day losing streak.At around 12 pm, shares of the company were up 3.18% to Rs 676.80 on the NSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/billionaires-present-at-donald-trump-oath-taking-see-fortunes-dip-elon-musk-mark-zuckerberg-2692454-2025-03-12",
      "headline": "5 billionaires at Trump's swearing-in see over $200 billion vanish in weeks   The start of Donald Trump's second term has been brutal for some of the world's richest billionaires, including those present at his swearing-in ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/jio-and-airtel-sign-deals-with-elon-musks-starlink-for-satellite-internet-in-india-ytvd-2692431-2025-03-12",
      "headline": "Jio and Airtel sign deals with Elon Musk's Starlink for satellite internet in IndiaJio and Airtel have signed separate agreements with Elon Musk's Starlink to bring satellite internet to India. The partnerships aim to provide high-speed broadband to remote and underserved areas. Starlink's service rollout depends on government approval. The deals could improve connectivity for education, healthcare, and businesses in regions lacking fibre-optic infrastructure. Starlink uses a constellation of 6,900 satellites for global broadband coverage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-shares-gain-after-jios-starlink-internet-announcement-details-here-2692424-2025-03-12",
      "headline": "Reliance shares gain after Jio's deal with Elon Musk's SpaceX for StarlinkRIL shares were up over 1% in early trade but gave up some gains due to market volatility. Around 10 am, the stock was trading 0.35% higher at Rs 1,251.50."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-tcs-wipro-why-are-major-it-stocks-falling-today-key-reasons-2692420-2025-03-12",
      "headline": "Infosys, TCS, Wipro: Why are major IT stocks falling today?At around 9:50 am, Infosys shares were down 3.5% and Wipro fell over 3.35%. HCLTech was down over 2.4% and TCS tumbled nearly 2%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-in-green-as-dalal-street-ignores-us-tariff-threats-airtel-shares-gain-over-3-2692407-2025-03-12",
      "headline": "Sensex, Nifty swing between gains and losses in volatile session; IT stocks downThe S&P BSE Sensex, which was up nearly 300 points in early trade, fell 91.43 points to trade at 74,010.37 around 9:30 am. The Nifty50 also fell 40.60 points to trade at 22,457.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-jio-signs-deal-with-elon-musk-spacex-to-bring-starlink-high-speed-satellite-internet-to-india-2692399-2025-03-12",
      "headline": "After Airtel, Jio signs deal with Elon Musk's SpaceX to bring Starlink to IndiaThe partnership aims to expand broadband access across India, especially in remote areas. Jio, which handles more mobile data than any other operator, will use Starlink's satellite network to strengthen its internet services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-will-donald-trump-latest-tariff-threat-impact-dalal-street-sensex-nifty-today-2692398-2025-03-12",
      "headline": "Stock market today: Will Trump's latest tariff threat impact Dalal Street today? Stock market opening today: While domestic stocks remain under pressure, experts suggested that Dalal Street is unlikely to feel the impact of the ongoing weakness in US stock markets. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-markets-remain-under-pressure-after-big-crash-3-things-to-know-2692393-2025-03-12",
      "headline": "US stock markets remain under pressure after Monday's big crash. 3 things to knowThe S&P 500 dropped as low as 5,528.41, marking a 10% fall from its February 19 record of 6,144.15—hitting what traders call a \"market correction.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-sinks-amid-trumps-tariff-hike-on-canadian-metals-glbs-2692284-2025-03-11",
      "headline": "Wall Street sinks amid Trump's tariff hike on Canadian metalsThe US stock market tumbled further after Trump doubled tariffs on Canadian steel and aluminum, with the Dow plunging 554 points amid rising economic uncertainty and fears of a prolonged trade war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-opening-selling-pressure-wall-street-nasdaq-dow-jones-sp-500-2692227-2025-03-11",
      "headline": "US stock market: Wall Street indices remain under pressure amid slowdown fearsAt the opening bell, the Dow Jones Industrial Average dropped 73.8 points, or 0.18%, to 41,837.95. The S&P 500 lost 10.9 points, or 0.19%, to 5,603.65, while the Nasdaq Composite was the only major index that recovered slightly in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-to-meet-ceos-of-america-biggest-firms-after-wall-street-crash-2692181-2025-03-11",
      "headline": "Donald Trump to meet CEOs of America's biggest firms after Wall Street crashPresident Donald Trump is expected to speak with around 100 CEOs at a regular meeting of the Business Roundtable in Washington, an influential group of CEOs leading major US companies from Apple to JPMorgan Chase and Walmart."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/looking-for-fixed-deposit-with-up-to-9-percent-interest-rate-check-these-small-finance-banks-2692166-2025-03-11",
      "headline": "Looking for fixed deposit with up to 9% interest? Check these small finance banksUnity Small Finance Bank offers 9% per annum for a 1001-day fixed deposit and 7.85% per annum for a one-year fixed deposit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-did-elon-musks-wealth-shrink-by-29-billion-in-a-single-day-2692127-2025-03-11",
      "headline": "Why did Elon Musk's wealth shrink by $29 billion in a single day? Tesla's struggles have had a major impact on Musk's financial losses. In the past two months, Tesla's stock has fallen by 35%,wiping out $400 billion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/airtel-signs-deal-with-elon-musk-spacex-starlink-internet-india-2692140-2025-03-11",
      "headline": "Airtel signs deal with Elon Musk's SpaceX to bring Starlink internet to IndiaThe deal depends on SpaceX getting approval from authorities to sell Starlink services in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-marginally-lower-nifty-in-green-indusind-bank-crashes-27-percent-2692102-2025-03-11",
      "headline": "Sensex ends marginally lower, Nifty in green; IndusInd Bank crashes 27%The S&P BSE Sensex lost 12.85 points to end at 74,102.32, while the NSE Nifty50 gained 37.60 points to close at 22,497.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/merchant-fees-on-upi-and-rupay-transactions-may-return-what-it-means-for-you-2692050-2025-03-11",
      "headline": "UPI and RuPay merchant charges may return: What it means for youThe government is planning to introduce a tiered pricing system, where bigger businesses pay higher charges while small businesses pay reduced charges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musk-doge-ceo-job-difficult-to-handle-tesla-share-price-us-stock-market-crash-2692036-2025-03-11",
      "headline": "Elon Musk says balancing DOGE and CEO roles is tough as Tesla shares slideElon Musk has been actively involved in Tesla, SpaceX, X (formerly Twitter), and xAI, along with his inclination to working with the Department of Government Efficiency (DOGE). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-down-25-percent-should-you-buy-hold-sell-2692022-2025-03-11",
      "headline": "IndusInd Bank share price crashes 27%: Buy, hold or sell?IndusInd Bank stock price: At the closing bell, IndusInd Bank shares were down 27.17% to Rs 655.95 on the Bombay Stock Exchange (BSE), marking their worst trading session ever. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-how-much-can-central-government-employees-expect-2692007-2025-03-11",
      "headline": "DA hike: How much can central government employees expect?The expected hike is likely to benefit around 12 million central government employees and pensioners under the 7th Pay Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-bloodbath-on-wall-street-no-major-impact-sensex-and-nifty-2691987-2025-03-11",
      "headline": "US stock market crash: Why Sensex, Nifty aren't feeling the heatThe S&P BSE Sensex was down less than 170 points at around 11:35 am, while the NSE Nifty50 fluctuated between gains and losses. The 50-share index was down barely 20 points but showed no signs of panic. Broader market indices also stayed flat as volatility spiked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/skipped-filing-itr-you-may-get-a-tax-notice-very-soon-2691960-2025-03-11",
      "headline": "Skipped filing ITR? You may get a tax notice very soonThe tax authorities use a risk management strategy (RMS) to flag high-risk non-filers, said the department.  This system looks at high-value transactions (property purchases, large bank deposits, etc.), income from salary, rent, mutual funds, and shares, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-crash-22-percent-52-week-low-should-you-buy-net-worth-loss-rs-1577-crore-2691943-2025-03-11",
      "headline": "IndusInd Bank share crash: Should you buy as stock falls 22% today?The decline in IndusInd Bank share price came after the bank, in an internal review of its derivative portfolio, found discrepancies that could reduce its net worth by an estimated 2.35%. This amounts to an impact of nearly Rs 1,577 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trumps-recession-remark-rattles-wall-street-crash-is-the-fear-justified-2691939-2025-03-11",
      "headline": "US recession: Is it a possibility or just a Wall Street worry?The massive sell-off on Wall Street was triggered by Donald Trump's recent remark on the possibility of a US recession in 2025. But is a US recession actually looming? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-shares-crash-20-to-hit-52-week-low-why-is-it-falling-today-2691909-2025-03-11",
      "headline": "IndusInd Bank shares crash 27% to record worst trading day ever. Here's whyIndusInd Bank's share price plunged 27.17% to Rs 655.95 at the closing bell, marking its worst trading session ever. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-down-nearly-400-points-nifty-below-22500-as-us-recession-fears-spook-investors-2691894-2025-03-11",
      "headline": "Sensex down nearly 400 points: Why is the stock market falling today? The Sensex fell nearly 400 points, while the Nifty dropped over 100 points as investors reacted to growing concerns about a possible recession in the US, along with a sharp fall in IT stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-fall-in-early-trade-wall-street-crash-us-stock-market-indusind-bank-shares-2691891-2025-03-11",
      "headline": "Sensex, Nifty fall as US market crash rattles investors; IndusInd Bank down 10%The S&P BSE Sensex tanked 361.25 points to 73,753.92, while the NSE Nifty50 lost 113.65 points to 22,346.65 as of 9:16 AM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/what-to-expect-sensex-nifty-eye-shaky-opening-as-wall-street-crash-spooks-global-markets-2691869-2025-03-11",
      "headline": "Sensex, Nifty eye shaky opening as Wall Street crash spooks global marketsUS stock markets saw their biggest single-day fall since 2022 on Monday, March 10. The S&P 500 and Nasdaq crashed by up to 4%, while the Dow Jones dropped 2.08%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-shares-in-focus-after-rs-1577-crore-networth-hit-risk-2691864-2025-03-11",
      "headline": "IndusInd Bank shares in focus after Rs 1,577 crore networth hit riskThe stock fell nearly 4% to Rs 900.50 on the NSE in the previous session. IndusInd Bank's stock has lost more than 37% in the past six months, with a 16% decline in the last four weeks alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-tesla-shares-tumble-almost-16-per-cent-2691858-2025-03-11",
      "headline": "Tesla shares tumble almost 16% as US stock markets crashTesla shares plunged 15.4 per cent to USD 222.15 on Monday, their lowest since October, amid investor pessimism over slumping sales and Trump administration trade policy uncertainty. It was Tesla's steepest drop since September 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-loses-usd-4-trillion-in-value-as-donald-trump-continues-to-back-tariffs-2691854-2025-03-11",
      "headline": "Trump tariffs, recession fears slam US markets, wiping out $4 trillion in valueDonald Trump's tariffs have rattled investors, wiping out USD 4 trillion from the S&P 500 as trade uncertainty with Canada, Mexico, and China grows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/world/story/us-stocks-fall-sharply-as-recession-fears-grow-nasdaq-down-4-2691850-2025-03-11",
      "headline": "US stocks fall sharply as recession fears grow; Nasdaq down 4%US stocks fell sharply as concerns over tariffs and a potential government shutdown fuelled recession fears. The S&P 500 had its worst one-day drop since December, falling 2.7%, while the Nasdaq dropped 4%, confirming a correction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-will-wall-street-bloodbath-hurt-sensex-nifty-2691785-2025-03-10",
      "headline": "Wall Street sell-off worsens on Trump tariffs, recession worriesEuropean markets have already taken a hit, and Asian markets are unlikely to be spared. Dalal Street is likely in for a rough session on Tuesday, especially information technology (IT) stocks that rely on the US for business."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-khloe-kardashian-anant-ambani-radhika-merchant-wedding-the-kardashians-6-2692550-2025-03-12",
      "headline": " Kim, Khloe Kardashian search for their missing diamond at Ambani wedding. WatchIn the latest promo of The Kardashian Season 6, Kardashian sisters, Kim and Khloe, are seen panicking over their missing diamond as they attend the grand Anant Ambani-Radhika Merchant wedding in Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/aditi-sharma-rumoured-boyfriend-samarthya-gupta-breaks-silence-amid-infidelity-allegation-by-abhineet-kaushik-2692520-2025-03-12",
      "headline": "TV actor Aditi Sharma's rumoured boyfriend breaks silence amid infidelity allegationApollena actor Aditi Sharma's co-star Samarthya Gupta has denied rumours of an affair with her, calling the allegations baseless and harmful. Aditi's husband had alleged infidelity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-sae-rons-unpublished-statement-emerges-after-dating-rumours-with-kim-soo-hyun-2692490-2025-03-12",
      "headline": "Kim Sae-ron's unpublished statement emerges after dating rumours with Kim Soo-hyunAlmost a month after South Korean actor Kim Sae-ron's death, her aunt has alleged K-drama star Kim Soo-hyun was in a relationship with Sae-ron, and that they began dating when she was only a minor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/did-ekta-kapoor-just-take-a-jibe-at-ram-kapoor-in-a-video-about-ozempic-2692464-2025-03-12",
      "headline": "Did Ekta Kapoor just take a jibe at Ram Kapoor in a video about Ozempic?Filmmaker Ekta Kapoor on Tuesday shared a video on Instagram in which she was seen talking about her weight gain and if she should follow artificial methods to lose some weight. There was also a Ram Kapoor connection. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-re-posts-nadaaniyan-poor-ratings-khushi-kapoor-puzzled-fans-react-2692461-2025-03-12",
      "headline": "Ibrahim Ali Khan re-posts Nadaaniyan's poor ratings, puzzled fans reactIbrahim Ali Khan reposted his film, Nadaaniyan's low ratings. Fans were puzzled by the actor's move in highlighting the film's poor performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ne-yo-introduces-his-four-girlfriends-from-his-polyamorous-relationship-2692414-2025-03-12",
      "headline": "Singer Ne-Yo introduces his four girlfriends from his polyamorous relationship In a candid revelation, American singer and songwriter Ne-Yo introduced his four girlfriends, embracing a polyamorous lifestyle. The musician shared insights into his unique relationship dynamic online, calling it his 'pyramid'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tapu-sonu-wedding-in-taarak-mehta-ka-ooltah-chashmah-fans-say-must-be-bhide-dream-2692416-2025-03-12",
      "headline": "Tapu-Sonu wedding in Taarak Mehta Ka Ooltah…? Fans say 'must be Bhide's dream'A promo of Taarak Mehta Ka Ooltah Chashmah shows Tapu marrying Sonu, leaving fans in shock. Many speculate it's a dream sequence, as Bhide disapproves of Tapu. The sitcom, India's longest-running, first aired in 2008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/louis-tomlinson-one-direction-lollapalooza-india-2025-india-visit-exclusive-2692343-2025-03-12",
      "headline": "Exclusive: Louis Tomlinson on India debut, love for Indian food, and solo career Louis Tomlinson, former One Direction member, embarked on his first solo performance in India at Lollapalooza 2025. He expressed excitement and a fondness for Indian culture, particularly its cuisine, during an exclusive interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/posani-krishna-murali-bail-ysrcp-political-vendetta-andhra-pradesh-2692250-2025-03-11",
      "headline": "Telugu actor-politician Posani Krishna Murali granted bail in all casesActor and YSRCP member Posani Krishna Murali has been granted bail in all cases. The YSRCP accused Chief Minister Chandrababu Naidu-led government of filing 17 cases against him as part of a political vendetta.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-kaun-banega-crorepati-shah-rukh-khan-aishwarya-rai-2692079-2025-03-11",
      "headline": "SRK, Aishwarya Rai top contenders to replace Amitabh Bachchan on KBC: StudyAccording to a recent study conducted among fans, actors Shah Rukh Khan and Aishwarya Rai are the top picks to replace megastar Amitabh Bachchan on his game show Kaun Banega Crorepati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dayaben-actor-disha-vakani-on-how-gayatri-mantra-helped-during-birth-of-daughter-taarak-mehta-ka-oolta-chashma-2692070-2025-03-11",
      "headline": "TV star Disha Vakani was told not to scream during labour: Gayatri Mantra helpedDisha Vakani, famed for her role as Dayaben in TMKOC, opened up about her use of the Gayatri Mantra during the birth of her daughter, Stuti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/former-one-direction-member-louis-tomlinson-on-first-india-visit-solo-career-lollapalooza-love-for-indian-food-exclusive-2692068-2025-03-11",
      "headline": "Louis Tomlinson on first India visit, solo career, Lollapalooza, love for Indian food | Exclusive Former One Direction member Louis Tomlinson finally arrives in India! In this exclusive chat with India Today's Bhavna Agarwal, he talks about his long-awaited visit, his excitement for Lollapalooza, and his deep love for Indian food (yes, he tried butter chicken!). "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-jaffar-express-train-baloch-militants-release-hijack-video-2692565-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video shows how Baloch insurgents blew up track, hijacked Pak passenger trainPak train hijack: The video shows the Jaffar Express, which was carrying over 400 passengers, passing through Sibi city when a bomb blast on the tracks forces it to halt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-nagar-nigam-municipal-elections-mayor-results-gurugram-rohtak-bjp-congress-2692518-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP sweeps Haryana civic polls, breaches Congress's Rohtak strongholdHaryana Municipal Corporation Election Results 2025: The BJP's mayoral candidates won nine of the 10 municipal corporations, including Rohtak - the bastion of Congress stalwart Bhupinder Hooda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/rushikonda-palace-inside-access-india-today-exclusive-jagan-reddy-visakhapatnam-luxury-mansion-2692435-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Exclusive first look inside Jagan Reddy's Rushikonda 'Sheeshmahal' Jagan Mohan Reddy's grand mansion on Rushikonda Hill in Visakhapatnam is at the centre of a political storm. Chandrababu Naidu-led Andhra Pradesh government is in a dilemma to utilise the Rs 500 crore private palace built by the former Chief Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/why-is-yogi-adityanath-trending-in-nepal-2692486-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why is Yogi Adityanath trending in Nepal?A pro-monarchist rally was organised in Kathmandu to welcome Nepal's former king Gyanendra Shah on March 10. And smack dab in the middle of it? Massive images of Adityanath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-train-hijack-how-jinnahs-betrayal-sparked-baloch-movement-pakistan-bangladesh-1971-kalat-2692320-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Jinnah's betrayal sparked Baloch freedom movementBalochistan has seen periods of active rebellion for independence from Pakistan. It was the betrayal and merger of Kalat, a princely state in what is now Balochistan, into Pakistan by Muhammad Ali Jinnah that is one of the causes of the fierce battle for independence by the Baloch people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dri-ranya-rao-arrest-memo-gold-smuggling-case-voluntary-statement-hiding-gold-bars-prior-attempts-2692425-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gold on body, Ranya Rao declared no goods at airport. Then metal detector went offIndia Today accessed the DRI's arrest memo against Ranya Rao who was arrested for smuggling gold from Dubai. The memo reveals details of arrest, confiscation of smuggled goods and Ranya's voluntary statements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-jaffar-express-hijack-baloch-liberation-army-holds-hundreds-hostages-rescue-operations-underway-2692387-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 150 passengers rescued from hijacked Pakistan train, 27 insurgents killed Live UpdatesThe Baloch Liberation Army, a separatist insurgent group, has claimed responsibility for hijacking the Jaffar Express. The group claims to hold about 200 hostages, but authorities have yet to confirm this figure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-top-7-billionaires-lose-34-billion-amid-stock-market-slump-2692540-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's top 7 billionaires lose $34 billion amid stock market slumpMukesh Ambani, India's richest person, lost $3.13 billion this year, though he still remains India's richest man with a net worth of $87.5 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-dream-11-ad-aamir-khan-ranbir-kapoor-jasprit-bumrah-watch-2692524-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Rohit Sharma, Team India help resolve Ranbir-Aamir feud in new adRohit Sharma, Bumrah, Pant, and Hardik Pandya teamed up with Bollywood icons Aamir Khan and Ranbir Kapoor in a hilarious Dream11 ad ahead of the highly anticipated IPL 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/starlink-is-coming-to-india-it-is-different-from-iphone-satellite-texting-and-jio-plus-airtel-airfiber-2692579-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Starlink is coming to India, it is different from iPhone satellite texting and Jio plus Airtel AirFiberStarlink is finally coming to India. But it is also coming in collaboration with Airtel and Jio, both of which have their own wireless broadband service called AirFiber. So, how is the Starlink internet different from Airtel and Jio AirFiber? And how about the iPhone satellite texting feature? All of them are quite different we say. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/meta-whistleblower-sarah-wynn-williams-book-facebook-mark-zuckerberg-sheryl-sandberg-2692471-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Come to bed' request, China link: Ex-Meta employee's explosive claims in memoirIn her tell-all book, former Meta executive Sarah Wynn Williams speaks at length on the conduct of CEO Mark Zuckerberg and former COO Sheryl Sandberg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-trade-war-white-house-claims-india-imposes-150-tariff-american-alcohol-says-not-helping-2692417-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "150% tariff on US alcohol: White House criticises India again amid trade disputeThe White House Press Secretary's remarks came less than a month before US President Donald Trump's looming April 2 deadline to impose reciprocal tariffs on India. As per reports, the US has asked India to remove tariffs on nearly all goods except agricultural products. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/dog-bite-scratch-rabies-vaccine-immunoglobulin-shot-protection-from-virus-central-nervous-system-2692162-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bitten by a dog? Rabies vaccine is not enough, you need more to stay safeIn the event of a dog bite, a person needs more than just the rabies vaccine. Experts highlight the importance of immunoglobulin despite taking a the ARV shot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-nep-2020-has-turned-a-language-battle-in-tamil-nadu-2692146-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why NEP 2020 has turned a language battle in Tamil NaduThe DMK government has slammed the three-language formula of the National Education Policy as a ploy to impose Hindi on the state\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/noida-sector-16-car-market-thar-suv-wrong-side-of-road-rams-multiple-vehicles-video-goes-viral-2692489-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Chaos in Noida market as SUV rams multiple vehicles, then fleesThe police have launched a manhunt for the driver who fled the spot after the incident in Noida's Sector 16 car market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-army-says-russia-launches-3-missiles-133-drones-overnight-attack-2692532-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia launches 3 missiles, 133 drones in overnight attack: Ukraine armyThe Ukrainian military said the air force shot down 98 drones, while another 20 drones did not reach their targets, likely due to electronic warfare countermeasures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/why-meghalayas-byrnihat-has-the-most-polluted-air-in-the-world-2692205-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Meghalaya's Byrnihat has the most polluted air in the worldUnregulated industrial standards and vehicle emissions are the major drivers of the city's pollution. Joint action by the governments and citizens may help in combating the crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-white-house-tesla-vehicles-elon-musk-2692374-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump keeps his promise, buys Tesla, models for fleet outside White HouseAt the press conference on Tuesday, five vehicles were on display at the White Hoouse's South Law, with Donald Trump selecting a red Model S sedan to show his support to Elon Musk as he faces backlash over his efforts to downsize the federal government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohan-babu-named-in-complaint-22-years-after-actor-soundarya-death-2692397-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telugu veteran named in complaint 22 years after actor Soundarya's chopper crashA fresh complaint has been filed against actor Mohan Babu, 22 years after the helicopter crash that took the life of popular South Indian actor Soundarya. She played Radha in Amitabh Bachchan's Sooryavansham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-jio-signs-deal-with-elon-musk-spacex-to-bring-starlink-high-speed-satellite-internet-to-india-2692399-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Airtel, Jio signs deal with Elon Musk's SpaceX to bring Starlink to IndiaThe partnership aims to expand broadband access across India, especially in remote areas. Jio, which handles more mobile data than any other operator, will use Starlink's satellite network to strengthen its internet services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-hilarious-spin-to-insider-vs-outsider-debate-2692504-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karan Johar adds hilarious spin to 'insider vs outsider' debate: What a privilege Karan Johar gave a hilarious twist to the insider and outside debate with a picture on social media. The filmmaker said that he is very 'happy to be entitled' to his own thoughts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-nationals-lured-illegal-fake-jobs-cybercrimes-myanmar-thailand-repatriated-rescued-external-affairs-ministry-2692469-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 500 Indians, lured into illegal jobs in Myanmar and Thailand, rescuedMore than 500 Indian nationals, who became victims of fake job offers in Myanmar and Thailand and subsequently got involved in cybercrimes, have been repatriated, the External Affairs Ministry said in a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-jaffar-express-train-hijacking-man-survivor-recounts-horror-in-video-screaming-firing-blast-militants-balochistan-2692441-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Insurgents checked IDs, shot soldiers: Survivors recount Pak train hijackPassengers who were aboard the Jaffar Express that was hijacked in Pakistan, recounted the horror that unfolded inside the train, including intense screaming, firing and a blast as insurgents took control of the carriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/tamil-literacy-reading-writing-essential-for-tn-govt-jobs-rules-madras-hc-2692409-2025-03-12#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Must learn to read, write Tamil for state government jobs: Madras High CourtThe Madurai Bench of the Madras High Court ruled that Tamil Nadu government job aspirants must read and write Tamil. The ruling came while the court dismissed a Tamil Nadu Electricity Board  employee's petition against being terminated for failing to clear the mandatory Tamil language exam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rosie-odonnell-leaves-us-after-donald-trump-presidency-hoping-people-do-what-is-right-2692555-2025-03-12",
      "headline": "Rosie O'Donnell leaves US after Trump's presidency: Hoping people do what's rightActor and television personality Rosie O'Donnell has moved to Ireland after Donald Trump's election win in the US. In a video shared on Tuesday, she said she wants people to do 'what's right' while she tries to get Irish citizenship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/harshvardhan-rane-sonam-bajwa-star-in-milap-zaveri-deewaniyat-a-film-about-passion-and-heartbreak-2692574-2025-03-12",
      "headline": "Harshvardhan Rane-Sonam Bajwa star in Deewaniyat, story of 'passion & heartbreak'Director Milap Milan Zaveri on Wednesday announced that actor Sonam Bajwa has joined his new film 'Deewaniyat', a story of 'passion and heartbreak', alongside Harshvardhan Rane in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-trolls-kartik-aaryan-is-there-anyone-in-industry-you-havent-dated-2692568-2025-03-12",
      "headline": "Nora Fatehi trolls Kartik Aaryan: Is there anyone in industry you haven't dated?At IIFA 2025, Nora Fatehi teased Kartik Aaryan about dating co-actors, leaving the audience in splits. Meanwhile, Kartik's mom picked 'doctor' as her ideal bahu, sparking rumours about him dating actor Sreeleela."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-khloe-kardashian-anant-ambani-radhika-merchant-wedding-the-kardashians-6-2692550-2025-03-12",
      "headline": " Kim, Khloe Kardashian search for their missing diamond at Ambani wedding. WatchIn the latest promo of The Kardashian Season 6, Kardashian sisters, Kim and Khloe, are seen panicking over their missing diamond as they attend the grand Anant Ambani-Radhika Merchant wedding in Mumbai. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-indian-cricket-team-advantage-icc-jay-shah-andy-roberts-2692629-2025-03-12",
      "headline": "ICC stands for Indian Cricket Board: Andy Roberts slams Champions Trophy fiascoWest Indies legend Andy Roberts has slammed the ICC for giving India an unfair advantage during the Champions Trophy 2025. Roberts feels that the ICC will go anything to help India during tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rahul-dravid-injured-rajasthan-royals-injury-cricket-bengaluru-2692617-2025-03-12",
      "headline": "Rahul Dravid injured while playing in Bengaluru, to rejoin RR camp on March 12IPL 2025: Rahul Dravid took a break from the training camp to recover from a leg injury he suffered while playing cricket in Bengaluru, Rajasthan Royals said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-injury-shane-bond-warning-indian-team-management-2692584-2025-03-12",
      "headline": "Another back injury in same spot could end Jasprit Bumrah's career: Shane BondShane Bond has claimed that another back injury in the same spot could prove to be a career-ender for Jasprit Bumrah. The Indian pacer missed the Champions Trophy 2025 due to a back injury. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-virat-kohli-icc-odi-rankings-kuldeep-yadav-ct-25-final-2692558-2025-03-12",
      "headline": "Rohit Sharma rises to No. 3 in ODI rankings after Champions Trophy final heroics India captain Rohit Sharma was rewarded for his match-winning 76 against New Zealand in the Champions Trophy final. Rohit rose to No. 3 while Virat Kohli slipped to No. 5 in the latest ICC ODI Rankings, updated on March 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shreyas-iyer-trophy-win-bcci-video-2692538-2025-03-12",
      "headline": "Shreyas Iyer 'running out of words' to describe India's Champions Trophy winShreyas Iyer claimed that he is 'running out of words' to describe India's Champions Trophy. Shreyas scored a vital 48 in the final of the tournament against New Zealand on Sunday, March 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-dream-11-ad-aamir-khan-ranbir-kapoor-jasprit-bumrah-watch-2692524-2025-03-12",
      "headline": "Watch: Rohit Sharma, Team India help resolve Ranbir-Aamir feud in new adRohit Sharma, Bumrah, Pant, and Hardik Pandya teamed up with Bollywood icons Aamir Khan and Ranbir Kapoor in a hilarious Dream11 ad ahead of the highly anticipated IPL 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ireland-vs-afghanistan-cancelled-financial-constraints-2692519-2025-03-12",
      "headline": "Ireland cancel multi-format series against Afghanistan due to financial crunchCricket Ireland announced on Tuesday, March 11, that they have decided to cancel the multi-format series against Afghanistan due to financial constraints. Ireland was supposed to face Afghanistan in August. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-round-of-16-psg-vs-liverpool-luis-enrque-2692485-2025-03-12",
      "headline": "PSG showed great personality, character in Liverpool shootout win: Luis EnriqueLuis Enrique was proud of his PSG side after their thrilling shootout win against Liverpool on Tuesday, March 11. PSG entered the quarterfinals of the Champions League with the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-atletico-madrid-champions-league-live-streaming-tv-channel-india-2692472-2025-03-12",
      "headline": "Real Madrid vs Atletico Madrid: All you need to know about big UCL clashReal Madrid look to seal their Champions League quarter-final spot as they face Atletico Madrid in a tense second-leg clash at the Metropolitano, with Jude Bellingham returning to bolster Carlo Ancelotti's attacking options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-world-cup-2027-goal-ricky-ponting-2692453-2025-03-12",
      "headline": "Rohit Sharma must have goal in mind to play in 2027 ODI World Cup: Ricky PontingRicky Ponting feels that Rohit Sharma has the goal of playing the ODI World Cup 2027 in his mind as the Indian captain decided to prolong his career after the Champions Trophy 2027 final win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-new-zealand-batting-coach-uturn-available-2692437-2025-03-12",
      "headline": "Pakistan batting coach makes U-turn after pulling out of New Zealand tourPakistan batting coach Mohammad Yousuf, who had earlier pulled out of the New Zealand tour citing his daughter's health, has made a U-turn. Yousuf has informed that he would be travelling with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ireland-vs-afghanistan-cancelled-financial-constraints-2692519-2025-03-12",
      "headline": "Ireland cancel multi-format series against Afghanistan due to financial crunchCricket Ireland announced on Tuesday, March 11, that they have decided to cancel the multi-format series against Afghanistan due to financial constraints. Ireland was supposed to face Afghanistan in August. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-round-of-16-psg-vs-liverpool-luis-enrque-2692485-2025-03-12",
      "headline": "PSG showed great personality, character in Liverpool shootout win: Luis EnriqueLuis Enrique was proud of his PSG side after their thrilling shootout win against Liverpool on Tuesday, March 11. PSG entered the quarterfinals of the Champions League with the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-atletico-madrid-champions-league-live-streaming-tv-channel-india-2692472-2025-03-12",
      "headline": "Real Madrid vs Atletico Madrid: All you need to know about big UCL clashReal Madrid look to seal their Champions League quarter-final spot as they face Atletico Madrid in a tense second-leg clash at the Metropolitano, with Jude Bellingham returning to bolster Carlo Ancelotti's attacking options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-world-cup-2027-goal-ricky-ponting-2692453-2025-03-12",
      "headline": "Rohit Sharma must have goal in mind to play in 2027 ODI World Cup: Ricky PontingRicky Ponting feels that Rohit Sharma has the goal of playing the ODI World Cup 2027 in his mind as the Indian captain decided to prolong his career after the Champions Trophy 2027 final win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-new-zealand-batting-coach-uturn-available-2692437-2025-03-12",
      "headline": "Pakistan batting coach makes U-turn after pulling out of New Zealand tourPakistan batting coach Mohammad Yousuf, who had earlier pulled out of the New Zealand tour citing his daughter's health, has made a U-turn. Yousuf has informed that he would be travelling with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-indian-cricket-team-virat-kohli-rohit-sharma-hardik-pandya-social-media-2692438-2025-03-12",
      "headline": "India heroes gain big on social media during Champions TrophyThe Indian cricket team stars gained a huge number of followers on social media platforms during the Champions Trophy matches. Virat Kohli and Hardik Pandya were the leaders when it came to gaining followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anand-mahindra-tara-prasad-india-skater-2026-olympics-post-2692426-2025-03-12",
      "headline": "Anand Mahindra backs India skater Tara Prasad for 2026 OlympicsAnand Mahindra praised skater Tara Prasad's success and decision to represent India, highlighting her resilience and determination after overcoming injuries to secure national titles and eye a spot at the 2026 Winter Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-dancing-video-rishabh-pant-sister-wedding-2692421-2025-03-12",
      "headline": "Watch: MS Dhoni dances his heart out at Rishabh Pant's sister's weddingMS Dhoni was seen dancing his heart out alongside Rishabh Pant and Suresh Raina in Mussoorie during the current Indian wicketkeeper's sister's wedding ceremony. Dhoni and Pant will next be in action during IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-on-field-outburst-reason-kuldeep-yadav-teammates-understand-2692403-2025-03-12",
      "headline": "Rohit on on-field outbursts: I shout, but my teammates understandRohit Sharma explains that his on-field criticism is meant to push his teammates toward excellence, ensuring India maintains high standards under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-redemption-redemption-unsung-hero-india-vs-new-zealand-2692390-2025-03-12",
      "headline": "Unsung Hero KL Rahul completes stunning redemption with Champions Trophy winKL Rahul redemption arc is perhaps one of the less discussed stories in the Champions Trophy. Rahul's ability to adapt to conditions and deliver under pressure should earn him more plaudits than what they have in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-liverpool-vs-psg-arne-slot-unlucky-format-2692386-2025-03-12",
      "headline": "Arne Slot says Liverpool 'unlucky' to face PSG after Champions League exitLiverpool manager Arne Slot rues his side's misfortune after crashing out of the Champions League against PSG, despite being the best side in the league phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ajinkya-rahane-kkr-preview-ajinkya-rahane-2692094-2025-03-12",
      "headline": "KKR Preview: Ajinkya Rahane in for big challenge in title defence campaignIPL 2025: Kolkata Knight Riders (KKR) will look to defend their crown under their new skipper Ajinkya Rahane with Venkatesh Ier as his deputy. The Knight Riders will begin their title defence against Royal Challengers Bengaluru (RCB) in the opening match of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shortest-players-in-nbs-history-glbs-2692349-2025-03-11",
      "headline": "Where does Yuki Kawamura rank among shortest players in NBA historyJapan's Yuki Kawamura is currently the shortest NBA player, standing at just 5 feet 8 inches. Where does he rank amongst the rest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-redemption-redemption-unsung-hero-india-vs-new-zealand-2692390-2025-03-12",
      "headline": "Unsung Hero KL Rahul completes stunning redemption with Champions Trophy winKL Rahul redemption arc is perhaps one of the less discussed stories in the Champions Trophy. Rahul's ability to adapt to conditions and deliver under pressure should earn him more plaudits than what they have in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-liverpool-vs-psg-arne-slot-unlucky-format-2692386-2025-03-12",
      "headline": "Arne Slot says Liverpool 'unlucky' to face PSG after Champions League exitLiverpool manager Arne Slot rues his side's misfortune after crashing out of the Champions League against PSG, despite being the best side in the league phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ajinkya-rahane-kkr-preview-ajinkya-rahane-2692094-2025-03-12",
      "headline": "KKR Preview: Ajinkya Rahane in for big challenge in title defence campaignIPL 2025: Kolkata Knight Riders (KKR) will look to defend their crown under their new skipper Ajinkya Rahane with Venkatesh Ier as his deputy. The Knight Riders will begin their title defence against Royal Challengers Bengaluru (RCB) in the opening match of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shortest-players-in-nbs-history-glbs-2692349-2025-03-11",
      "headline": "Where does Yuki Kawamura rank among shortest players in NBA historyJapan's Yuki Kawamura is currently the shortest NBA player, standing at just 5 feet 8 inches. Where does he rank amongst the rest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nba-stephen-curry-viral-reaction-gary-payton-dunk-glbs-2692344-2025-03-11",
      "headline": "Watch: Stephen Curry's hilarious reaction to Gary Payton II's dunk attemptStephen Curry's hilarious reaction to Gary Payton II's dunk attempt went viral on the internet. Curry's reaction came when Payton II missed the dunk in Golden State Warriors' vs Portland Trail Blazers game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nba-mavericks-klay-thompson-glbs-2692340-2025-03-11",
      "headline": "Maverick's end losing streak as Klay Thompson makes bold statementThe Mavericks edged out the Spurs in a thrilling 133-129 victory on Monday, February 10, with only 8 healthy players on their roster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wpl-2025-delhi-capitals-final-mumbai-indians-vs-gujarat-giants-in-eliminator-2692328-2025-03-11",
      "headline": "Delhi Capitals qualify for final, MI to face Gujarat Giants in EliminatorMumbai Indians finished at the 2nd spot in the WPL table after losing their final group-stage match against Royal Challengers Bengaluru. With the result, Delhi Capitals qualified for the final of the competition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-punjab-kings-video-2692319-2025-03-11",
      "headline": "Chirpy Yuzvendra Chahal joins IPL training, wants new batting position at PBKSYuzvendra Chahal joined the Punjab Kings ahead of the Indian Premier League 2025 season. Chahal did  some batting practice while being mic'd-up by the camera team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/will-giannis-lillard-play-tonight-bucks-vs-pacers-injury-updates-glbs-2692311-2025-03-11",
      "headline": "Will Giannis & Lillard play tonight? Bucks vs. Pacers injury updates  Giannis Antetokounmpo and Damian Lillard are questionable for tonight's Bucks vs. Pacers game. With playoff stakes high, Milwaukee's performance could hinge on their availability. Injury updates and key insights inside..\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wfi-suspension-revoked-brj-bhushan-singh-comments-2692309-2025-03-11",
      "headline": "Conspirators could not succeed: Brij Bhushan after ministry revokes suspensionFormer Wrestling Federation of India chief Brij Bhushan Sharan Singh praised the Sports Ministry's decision to revoke the suspension on the federation. The tainted former chief said that justice had been served."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pcb-mohsin-naqvi-pakistan-cricket-shahid-afridi-2692303-2025-03-11",
      "headline": "Pakistan cricket chief Mohsin Naqvi can't be doing three jobs at a time: Shahid AfridiFormer Pakistan cricketer Shahid Afridi has said that PCB chief Mohsin Naqvi cannot be doing three jobs at a time. Apart from being the head of PCB, Naqvi is also the interior minister of Punjab.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/all-england-open-results-lakshya-sen-malavika-bansod-hs-prannoy-2692296-2025-03-11",
      "headline": "Lakshya Sen, Malavika Bansod win tough openers, HS Prannoy exits in 1st roundAll England Open 2025: Lakshya Sen and Malavika Bansod won three-game openers on Tuesday in Birmingham. However, senior shuttler HS Prannoy was shown the door after a straight-game defeat in the men's singles opening round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-change-approach-trophies-hundreds-interview-2692281-2025-03-11",
      "headline": "Trophies over tons: How Rohit Sharma reshaped his game for Team India's successChampions Trophy 2025: India captain Rohit Sharma reflected on his decision to change his batting approach at the top of the order. He is widely credited with leading by example and helping India play without the fear of failure in high-stakes matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunrisers-hyderabad-ipl-2025-complete-schedule-fixtures-match-dates-2692276-2025-03-11",
      "headline": "SRH IPL 2025 Complete Schedule: Full Fixtures, Venues, Match DatesSunRisers Hyderabad IPL 2025 Full Schedule, SRH Squad: SunRisers Hyderabad finished as the runner- up in the previous season of the IPL. Under the leadership of Pat Cummins, they begin their campaign on March 23, against Rajasthan Royals.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-champions-trophy-presentation-pcb-offficials-snub-clarification-2692235-2025-03-11",
      "headline": "Pakistan appalled by trophy ceremony snub, seeks formal clarification from ICCThe Pakistan Cricket Board has sought formal clarification about the absence of PCB officials during the trophy presentation ceremony after the final. However, the PCB is unlikely to get any formal explanation from the global cricket body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-sister-wedding-ms-dhoni-mussoorie-2692220-2025-03-11",
      "headline": "MS Dhoni joins Rishabh Pant in sister's gala wedding at MussoorieTwo generations of Indian wicketkeepers Rishabh Pant and MS Dhoni are currently in Mussoorie for the former's sister's wedding. Rishabh Pant's sister Sakshi is getting married to Ankit Chaudhary.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}