{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sashidhar-jagdishan-hdfc-bank-ceo-fir-mehta-family-lilavati-trust-hospital-2737948-2025-06-09",
      "headline": "Who is Sashidhar Jagdishan? HDFC Bank CEO under financial fraud lensSashidhar Jagdishan has been a part of HDFC Bank since 1996. He joined as a manager in the finance division and quickly rose through the ranks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shein-reliance-aim-to-sell-india-made-clothes-globally-within-a-year-2737928-2025-06-09",
      "headline": "Shein, Reliance aim to sell India-made clothes globally within a year: ReportThe aim is to make Shein-branded clothes in India not just for local sales but also for international markets, starting with the US and UK, within the next 6 to 12 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-salary-fy25-rs-1041-crore-who-earned-more-corporate-networth-2737922-2025-06-09",
      "headline": "Gautam Adani earned Rs 10.41 crore in FY25: Who earned more than him?Gautam Adani earned Rs 10.41 crore in the financial year 2024–25, which is much less than several leading business heads in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bumper-rate-cut-leaves-rupee-exposed-to-fresh-depreciation-2737907-2025-06-09",
      "headline": "RBI's bumper rate cut leaves rupee exposed to fresh depreciation riskThe rupee has already lagged behind its Asian peers in 2025, weighed down by tepid capital inflows. Now, with the RBI easing faster than the US Federal Reserve, the narrowing interest rate differential is expected to keep the rupee on the back foot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-repo-rate-cut-bob-hdfc-lending-rate-reduction-2025-2737895-2025-06-09",
      "headline": "HDFC Bank and BoB cut lending rates after RBI repo rate slashBorrowers can expect EMIs on home loans, personal loans, and other credit products to come down slightly, offering a bit of breathing space amid rising living costs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-department-high-value-transactions-monitoring-tds-rules-large-cash-withdrawals-2737861-2025-06-09",
      "headline": "Income Tax ramps up checks on big transactions with new filing and TDS rulesThe Income Tax Department has ramped up efforts to spot individuals who spend heavily but may be hiding their real income, using data analytics and tighter links with financial institutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rupee-currency-devaluation-wealth-reduction-tax-printing-money-real-estate-crypto-stocks-fd-2737820-2025-06-09",
      "headline": "Currency devaluation is quietly eating into your wealth, expert warnsYour money or assets might look the same in your account, but its real value could be slipping away every year, warns expert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-80-billion-dollar-coal-power-boom-is-running-short-of-water-2737810-2025-06-09",
      "headline": "India's $80 billion coal-power boom is running short of water: ReportThirty-seven of the 44 new projects named in the undated power ministry shortlist of future operations are located in areas that the government classifies as either suffering from water scarcity or stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-largest-container-ship-msc-irina-docks-at-vizhinjam-seaport-2737802-2025-06-09",
      "headline": "World's largest container ship MSC IRINA docks at Vizhinjam SeaportMSC IRINA's docking at Vizhinjam International Seaport signals growing confidence in the port's readiness to handle Ultra-Large Container Vessels (ULCVs)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-382-points-higher-nifty-above-25100-axis-bank-gains-over-1-percent-2737789-2025-06-09",
      "headline": "Sensex opens 382 points higher, Nifty above 25,100; Axis Bank gains over 1%The S&P BSE Sensex added 335.02 points to 82,524.01, while the NSE Nifty50 added 114.85 points to 25,117.90 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-sensex-nifty-trading-setup-today-nse-bse-rally-2737782-2025-06-09",
      "headline": "Stock market opening: Will Sensex, Nifty continue market rally today?As per Gift Nifty futures, the Nifty50 is expected to open above Friday's close of 25,003.05. The futures were trading at 25,182 around 8:35 am, suggesting a stronger start to the new trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-on-june-9-nse-bse-trading-hdfc-bank-fir-infosys-airtel-tata-steel-mcx-bel-2737778-2025-06-09",
      "headline": "Stocks to watch on June 9: HDFC Bank, Infosys, Airtel, Tata Steel, MCX, BELThe policy announcements by the RBI improved market sentiment and pushed indices higher. As trading begins on Monday, investors will be looking at some key companies and developments that may impact share prices."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/edagaiye-apaghatakke-karana-trailer-promises-quirky-crime-comedy-starring-diganth-2737920-2025-06-09",
      "headline": "Edagaiye Apaghatakke Karana trailer promises quirky crime comedy starring DiganthThe recently released trailer of the upcoming Kannada film, 'Edagaiye Apaghatakke Karana' starring Diganth, Nidhi Subbaiah and Dhanu Harsha in the lead, presents a black comedy thriller packed with situational comedy and four murders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vairamuthu-calls-out-tamil-filmmakers-use-of-verses-as-film-titles-2737955-2025-06-09",
      "headline": "Lyricist Vairamuthu calls out Tamil filmmakers for using his verses as film titlesLyricist Vairamuthu criticised Tamil filmmakers for using his verses as Tamil film titles. His post on X drew mixed responses as many X users pointed out that the lyrics feature words that have been in Tamil scripture for eons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-reacts-to-fan-calling-him-hero-of-hera-pheri-a-month-after-his-exit-from-the-film-2737942-2025-06-09",
      "headline": "A month after his exit, Paresh Rawal reacts to fan calling him hero of Hera PheriActor Paresh Rawal answered a fan on X who called him the 'hero' of the 'Hera Pheri' franchise. He responded with a humble gesture, adding a folded-hands emoji. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ranbir-kapoor-alia-bhatt-to-move-into-their-new-home-soon-check-video-2737876-2025-06-09",
      "headline": "Ranbir Kapoor, Alia Bhatt's Rs 250 crore dream home is ready. Check videoRanbir Kapoor and Alia Bhatt's new home in Mumbai is almost ready to move in. Once the finishing touches are completed in a month, the couple will find an auspicious time to conduct the grah pravesh puja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/navjot-singh-singh-comeback-on-great-indian-kapil-show-archana-puran-singh-in-shock-2737923-2025-06-09",
      "headline": "Navjot Singh Sidhu re-enters Kapil Sharma Show, Archana Puran Singh in shock. WatchNavjot Singh Sidhu is set to make a comeback on 'The Great Indian Kapil Show.' Makers released a new video and announced the news. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-mani-ratnam-thug-life-failure-what-went-wrong-2737898-2025-06-09",
      "headline": "What went wrong with Kamal Haasan and Mani Ratnam's Thug Life?Kamal Haasan and director Mani Ratnam's 'Thug Life' had all the ingredients for a gripping gangster saga. It marked the reunion of legendary collaborators, featured a powerful cast, and stunning technical craft, yet, it faltered by trying to juggle too many themes and underdeveloped storylines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-sunita-feels-actor-not-getting-work-because-of-chaplus-circle-2737857-2025-06-09",
      "headline": "Govinda's wife Sunita feels actor not getting work because of chaplus circleActor Govinda's wife, Sunita Ahuja, recently said he had not been getting work for the past 17 years because of his circle. Sunita stated that the actor seeks feedback from people who would give him wrong piece of advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/photo/smriti-irani-amar-upadhyay-to-mouni-roy-celebs-at-ektaa-kapoor-birthday-bash-2737819-2025-06-09",
      "headline": "Smriti Irani, Amar Upadhyay to Mouni Roy, celebs at Ektaa Kapoor's birthday bashProducer Ektaa Kapoor celebrated her 50th birthday with the who's of who of Bollywood and the Indian television industry on June 7. However, it was the reunion of 'Kyunki Saas Bhi Kabhi Bahu Thi' starcast, including actor turned politician Smriti Irani and actor Amar Upadhyay, that created excitement among the fans. Karan Johar, Manish Malhotra, Krystle DSouza, Anita Hassanandani, Jeetendra and Tusshar Kapoor also attended the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-films-to-be-clubbed-trimmed-for-theatrical-re-release-version-report-2737892-2025-06-09",
      "headline": "Baahubali films to be clubbed, trimmed for theatrical re-release version: ReportWhat SS Rajamouli's 'Baahubali' films did for Indian cinema is a pure case study. The makers earlier announced that the film will be re-released in theatres soon, and now, there's a new update on the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/r-madhavan-teams-up-with-priyanka-chopra-mahesh-babu-for-ss-rajamoulis-ssmb29-2737856-2025-06-09",
      "headline": "R Madhavan teams up with Priyanka, Mahesh Babu for Rajamouli's SSMB29: ReportR Madhavan has reportedly joined the team of SS Rajamouli's upcoming film 'SSMB29' starring Priyanka Chopra and Mahesh Babu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/partho-ghosh-dies-at-75-of-heart-attack-tributes-pour-in-2737870-2025-06-09",
      "headline": "Veteran filmmaker Partho Ghosh dies of heart attack at 75, tributes pour inDirector Partho Ghosh died due to a heart attack. He was 75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworth-thor-5-could-be-in-the-works-and-why-that-is-a-brilliant-idea-2737834-2025-06-09",
      "headline": "Chris Hemsworth's Thor 5 could be in the works, and why that is a brilliant ideaThere's a lot that needs exploring in the 'Thor' universe, and if the MCU has planned 'Thor 5' in its next saga post-'Avengers: Secret Wars', then it's absolutely going to be a master-stroke.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-raj-nidimoru-holidaying-in-abu-dhabi-internet-thinks-so-2737826-2025-06-09",
      "headline": "Is Samantha holidaying with Raj Nidimoru in Abu Dhabi? Internet thinks soActor Samantha Ruth Prabhu recently shared photos from her Abu Dhabi holiday.  The Internet thinks that she is holidaying with filmmaker Raj Nidimoru, her rumoured boyfriend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopras-quick-home-trip-nick-jonas-malti-2737821-2025-06-09",
      "headline": "Playing with pets, catching up with friends: Inside Priyanka's quick home tripPriyanka Chopra shared a bunch of pictures from her 'quick trip home' in LA. Starting from her playtime with pets to catching up with friends, everything was adorable. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-akshay-kumar-film-dominates-theatres-eyes-rs-100-crore-2737803-2025-06-09",
      "headline": "Housefull 5 box office Day 3: Akshay's film eyes Rs 100 crore after 1st weekendAkshay Kumar's 'Housefull 5' earned Rs 87 crore in three days. The film directed by Tarun Mansukhani is now inching closer to the Rs 100 crore mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-anushka-sharma-soulmates-incomplete-without-each-other-2737792-2025-06-09",
      "headline": "Virat, Anushka are soulmates incomplete without each other: IPL photographerPhotojournalist Arun Sharma, who covered IPL 2025, described Anushka Sharma and Virat Kohli's bond after RCB's victory over Punjab Kings. He shared their sweet moments after RCB's first IPL win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-4-kamal-haasan-1st-weekend-rs-36-crore-2737772-2025-06-09",
      "headline": "Thug Life box office Day 4: Rs 36 crore for Kamal Haasan's film, lowest in 5 yearsKamal Haasan and director Mani Ratnam's 'Thug Life' minted Rs 36.52 crore nett in its first weekend in theatres. This is Haasan's lowest opening numbers in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-third-anniversary-poetic-message-vignesh-shivan-2737773-2025-06-09",
      "headline": "Nayanthara's poetic anniversary post for Vignesh overflows with love, romanceNayanthara and Vignesh Shivan are celebrating three years of togetherness on June 3. The actor's special post for her husband is just dripping love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-down-with-fever-husband-zaheer-iqbal-lifts-her-mood-2737688-2025-06-08",
      "headline": "Sonakshi Sinha down with fever, husband Zaheer Iqbal lifts her mood. WatchSonakshi Sinha, currently down with fever, was seen cuddling with husband Zaheer Iqbal in a playful video where he tried to cheer her up. Fans loved their light-hearted interaction, calling it adorable and heartwarming.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meghalaya-murder-case-indore-couple-man-killed-sonam-surrender-top-highlights-updates-2737812-2025-06-09",
      "headline": "Honeymoon murder, wife caught, 'lover' arrested: What we know about Meghalaya caseAccording to Raja's brother, Vipul, and sources, Sonam's alleged lover, Raj Kushwaha, was an employee at her father's plywood factory. 'They would constantly talk on phone,' Vipul said, adding, 'I have never seen Raj Kushwaha till now, I have just heard his name.' Raj Kushwaha, who is reportedly five years younger, has been arrested by the Indore Police."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-health-minister-vishwajit-rane-apologises-amid-outrage-over-video-showing-him-berating-doctor-2737863-2025-06-09",
      "headline": "I apologise to doctor: Goa Minister to India Today amid outrage over viral videoGoa Health Minister Vishwajit Rane apologised after facing backlash for publicly scolding a senior doctor during a hospital visit. The minister pointed out that her mother has cancer and he understands the pain of patients. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-asim-munir-back-foot-buzz-of-ex-pm-imran-khan-pti-protest-release-on-june-11-rawalpindi-2737878-2025-06-09",
      "headline": "Will Pak army blink? Buzz of ex-PM Imran Khan's release on June 11A claim by a senior leader of the PTI, Gohar Ali Khan, that Imran Khan may walk free on June 11 has ignited speculation that Army Chief Asim Munir is caving under pressure. The claim comes after Imran Khan last week vowed to lead a nationwide agitation from behind bars, at a time when the Munir-led army appears to be on the back foot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-cracked-nda-on-his-sisters-wedding-day-2737968-2025-06-09",
      "headline": "Astronaut Shubhanshu Shukla cracked NDA on his sister's wedding dayHe had left the house in his wedding attire and returned looking visibly tired, but immediately rejoined the wedding preparations without explaining his absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/lifestyle-diseases-young-indians-rise-poor-diet-stress-sleep-deprivation-2737893-2025-06-09",
      "headline": "Why young Indians are sitting on a ticking time bomb of diseasesYoung Indians increasingly face chronic lifestyle diseases despite appearing healthy. This silent epidemic demands urgent lifestyle and policy changes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/dna-rcb-move-ktaka-hc-to-cancel-case-in-bengaluru-chinnaswamy-stadium-stampede-case-2737943-2025-06-09",
      "headline": "RCB, event organisers move Karnataka High Court to cancel case over stampedeEvent management firm DNA Entertainment Networks and IPL franchise Royal Challengers Bengaluru have approached the Karnataka High Court seeking to cancel the police case against them over the fatal stampede at Chinnaswamy Stadium in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/humpback-whale-entangled-in-rope-off-sydney-coast-rescue-teams-race-against-time-2737969-2025-06-09",
      "headline": "Humpback whale entangled in rope off Sydney coast, rescue teams race against timeThe whale was about eight metres (25 feet) long, a whale rescue group official said, indicating it was still \"quite young\". The rope appeared to be tangled around the whale's left pectoral fin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meghalaya-murder-case-indore-woman-caught-for-husbands-murder-told-up-dhaba-ownerwhat-indore-woman-told-up-dhaba-owner-2737963-2025-06-09",
      "headline": "Was abducted, robbed: Indore woman caught for husband's murder told UP dhaba ownerThe dhaba owner, Sahil Yadav, told India Today TV that Sonam claimed an attempt was made to rob her of her ornaments in Meghalaya, after which she fell unconscious and had no idea how she ended up there. Both Sahil and Govind had alerted the local police, who rushed to the spot and took her into custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/money-cant-buy-love-elon-musk-is-the-latest-in-silicon-valley-to-learn-this-2737839-2025-06-09",
      "headline": "Money can't buy love, Elon Musk is the latest in Silicon Valley to learn thisAs US President Donald Trump puts it — it is over between him and Elon Musk. And Musk has likely learnt, probably again, that all the money in the world is not enough to buy love. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-murdered-by-alleged-lover-in-oyo-hotel-room-police-investigate-case-2737952-2025-06-09",
      "headline": "Bengaluru woman allegedly killed by techie boyfriend in hotel roomA 33-year-old woman was allegedly murdered by a 25-year-old techie in a Bengaluru hotel. The two were close, but she had been distancing herself, said police. Angered by this, he reportedly stabbed her to death."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/singapore-flag-merchant-vessel-catches-fire-off-kerala-coast-indian-coast-guard-deployed-2737950-2025-06-09",
      "headline": "Explosion causes fire on Singaporean cargo ship off Kerala coast, Navy deployedA container ship bearing the Singapore flag caught fire off the coast of Beypore, Kozhikode in Kerala. An explosion was reported on board the cargo vessel, MV Wan Hai on Monday morning, a defence ministry statement said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indias-shubhanshu-shukla-completes-final-launch-rehearsal-says-extremely-fortunate-2737824-2025-06-09",
      "headline": "Indian astronaut completes final launch rehearsal. See pics insideShubhanshu Shukla has termed the preparations for the Axiom-4 mission as an \"amazing journey\" and that he was extremely fortunate to be part of something that is \"much larger than yourself\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/stability-resistance-long-lasting-the-incredible-engineering-behind-chenab-bridge-2737962-2025-06-09",
      "headline": "How Prof Madhavi Latha aced the engineering behind Chenab bridgeConstructing in the rugged Himalayan terrain posed unprecedented challenges. Access was so difficult that initial transport of materials relied on mules and horses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indore-woman-who-went-missing-during-honeymoon-in-meghalaya-arrested-for-husbands-murder-cops-2737762-2025-06-09",
      "headline": "Meghalaya honeymoon case: Wife had 'affair', got hitmen to kill husband, detainedIndore tourist Raja Raghuvanshi was allegedly killed by men hired by his wife, Sonam, during their honeymoon, Meghalaya Director General of Police Idashisha Nongrang said. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-train-accident-people-died-after-falling-off-overcrowded-local-train-2737806-2025-06-09",
      "headline": "Four dead after falling off overcrowded local train in Mumbai, several injuredThe incident occurred between Diva and Kopar railway stations of the Central Railway when 5 people fell on the railway tracks from an overcrowded train. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/pm-modi-30-resounding-mandate-for-a-stronger-bolder-rising-bharat-2737696-2025-06-08",
      "headline": "PM Modi 3.0: A resounding mandate for a stronger, bolder, rising BharatUnder PM Modi 3.0, India's internal and external security has undergone a tectonic shift. The days of reacting to terror with dossiers and diplomatic notes are over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-reacts-to-fan-calling-him-hero-of-hera-pheri-a-month-after-his-exit-from-the-film-2737942-2025-06-09",
      "headline": "A month after his exit, Paresh Rawal reacts to fan calling him hero of Hera PheriActor Paresh Rawal answered a fan on X who called him the 'hero' of the 'Hera Pheri' franchise. He responded with a humble gesture, adding a folded-hands emoji. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-sonam-raghuvanshi-raja-mother-family-mp-police-ghazipur-2737818-2025-06-09",
      "headline": "She should get death penalty if guilty: Arrested Indore woman's mother-in-lawRaja Raghuvanshi's mother said Sonam booked the Meghalaya trip without the family's knowledge and demanded a death penalty if her daughter-in-law is found guilty of plotting her son's murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-mani-ratnam-thug-life-failure-what-went-wrong-2737898-2025-06-09",
      "headline": "What went wrong with Kamal Haasan and Mani Ratnam's Thug Life?Kamal Haasan and director Mani Ratnam's 'Thug Life' had all the ingredients for a gripping gangster saga. It marked the reunion of legendary collaborators, featured a powerful cast, and stunning technical craft, yet, it faltered by trying to juggle too many themes and underdeveloped storylines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sashidhar-jagdishan-hdfc-bank-ceo-fir-mehta-family-lilavati-trust-hospital-2737948-2025-06-09",
      "headline": "Who is Sashidhar Jagdishan? HDFC Bank CEO under financial fraud lensSashidhar Jagdishan has been a part of HDFC Bank since 1996. He joined as a manager in the finance division and quickly rose through the ranks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/a-dating-app-nearly-banned-geminis-are-they-really-that-hard-to-date-2737842-2025-06-09",
      "headline": "A dating app nearly banned Geminis. Are they really that hard to date?No Names, a new socialising app, once put a filter on Geminis. While it has since been removed, here's decoding whether they're really difficult to date (plus, what they're actually looking for)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-vs-jannik-sinner-epic-golden-big-three-era-2737749-2025-06-09",
      "headline": "Alcaraz vs Sinner: A Roland Garros epic promising a golden post-Big Three eraFrench Open 2025: Carlos Alcaraz and Jannik Sinner's epic Roland Garros final reignited the fire of men's tennis, ushering in a thrilling new chapter beyond the Big Three. Their fierce, five-hour, 29-minute duel was a bold promise of greatness to come."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/523-crashes-musks-starlink-satellites-are-falling-from-space-due-to-suns-fury-2737919-2025-06-09",
      "headline": "Elon Musk's 523 Starlink satellites have crashed due to solar stormElon Musk's Starlink has lost 523 satellites from 2020 to 2024, the years associated with the peak of the Solar Cycle. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/gaza-bound-aid-boat-carrying-greta-thunberg-and-other-activists-freedom-flotilla-diverted-to-israel-2737756-2025-06-09",
      "headline": "Israel seizes Gaza-bound aid boat carrying Greta Thunberg, says show is overIsraeli forces intercepted a British-flagged aid boat headed to Gaza, detaining 12 activists — including Greta Thunberg and Rima Hassan — who were attempting to breach the longstanding naval blockade."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-final-spain-vs-portugal-cristiano-ronaldo-lamine-yamal-2737915-2025-06-09",
      "headline": "Cristiano Ronaldo defends Lamine Yamal after Nations League win: Leave him aloneCristiano Ronaldo has jumped to the defence of Lamine Yamal, saying that the Spanish sensation should be left alone and given his space. Yamal had a lacklustre outing in the final of the Nations League against Portugal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-home-season-revised-schedule-delhi-test-november-pollution-2737890-2025-06-09",
      "headline": "Pollution problems? BCCI shifts November Test out of Delhi in fixtures overhaulThe Indian cricket board announced a revised home season schedule for the Test series against West Indies and South Africa later this year. A Test match in Delhi, which was originally scheduled for November, has been moved to Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-cameron-green-jasprit-bumrah-message-australia-vs-south-africa-2737862-2025-06-09",
      "headline": "When Jasprit Bumrah gave Cameron Green confidence with special message before surgeryCameron Green revealed that Jasprit Bumrah reached out to the Australian all-rounder before he underwent back surgery late last year. Green is all set to make a return to the Australia lineup for the World Test Championship final against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-jannik-spain-uefa-nations-league-final-2737836-2025-06-09",
      "headline": "After French Open win, Carlos Alcaraz left sad as Spain lose Nations League finalCarlos Alcaraz was left distraught after Spain lost their UEFA Nations League final against Portugal on Sunday, June 9. Alcaraz secured a comeback win against Jannik Sinner while Spain were beaten on penalties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-final-cristiano-ronaldo-spain-vs-portugal-injury-reaction-2737805-2025-06-09",
      "headline": "For Portugal, would have broken my leg: Cristiano Ronaldo on Nations League final injuryCristiano Ronaldo revealed that he played through pain in the final of the UEFA Nations League against Spain on Sunday, June 8. Ronaldo scored the equaliser in the game as Portugal won their second Nations League title with a win on penalties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-carlos-alcaraz-jannik-sinner-roger-federer-post-roland-garros-2737797-2025-06-09",
      "headline": "3 winners in Paris: Federer's heartwarming post after epic French Open finalRoger Federer posted a heartwarming message for Carlos Alcaraz and Jannik Sinner after their epic French Open final on Sunday, June 8. Alcaraz staged a stunning comeback to beat Sinner in five sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-jannik-sinner-carlos-alcaraz-roland-garros-2737779-2025-06-09",
      "headline": "Sinner explains why his father had to skip French Open final vs AlcarazJannik Sinner explained the reason why his father had to miss the epic French Open 2025 final against Carlos Alcaraz on Sunday, June 8. Sinner lost an epic battle against Alcaraz which went on for 5 hours and 29 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-carlos-alcaraz-jannik-sinner-rafael-nadal-roland-garros-2737758-2025-06-09",
      "headline": "5 Grand Slams at 22 years, 1 month, 3 days, like Nadal: Alcaraz calls it destinyCarlos Alcaraz called it destiny as he levelled Rafael Nadal's tally of grand slam wins at the same age with his thrilling comeback against Jannik Sinner in the final of the French Open 2025 on Sunday, June 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-vs-jannik-sinner-epic-golden-big-three-era-2737749-2025-06-09",
      "headline": "Alcaraz vs Sinner: A Roland Garros epic promising a golden post-Big Three eraFrench Open 2025: Carlos Alcaraz and Jannik Sinner's epic Roland Garros final reignited the fire of men's tennis, ushering in a thrilling new chapter beyond the Big Three. Their fierce, five-hour, 29-minute duel was a bold promise of greatness to come."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/nationsl-league-final-pportugal-vs-spain-result-cristiano-ronaldo-crying-video-2737746-2025-06-09",
      "headline": "Ronaldo in tears as Portugal beat Spain on penalties to clinch Nations LeagueLegendary Cristiano Ronaldo could not hold back his tears as Portugal beat Spain to clinch the Nations League. Portugal, held to a 2-2 draw at extra time, beat Spain in the penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-jannik-sinner-video-2737737-2025-06-09",
      "headline": "Watch: Alcaraz salutes Sinner in touching speech after French Open epicCarlos Alcaraz staged a remarkable comeback to defeat Jannik Sinner in the longest French Open final ever. After the thrilling match, Alcaraz shared a glowing tribute for Jannik Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-jannik-sinner-carlos-alcaraz-roland-garros-2737779-2025-06-09",
      "headline": "Sinner explains why his father had to skip French Open final vs AlcarazJannik Sinner explained the reason why his father had to miss the epic French Open 2025 final against Carlos Alcaraz on Sunday, June 8. Sinner lost an epic battle against Alcaraz which went on for 5 hours and 29 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-carlos-alcaraz-jannik-sinner-rafael-nadal-roland-garros-2737758-2025-06-09",
      "headline": "5 Grand Slams at 22 years, 1 month, 3 days, like Nadal: Alcaraz calls it destinyCarlos Alcaraz called it destiny as he levelled Rafael Nadal's tally of grand slam wins at the same age with his thrilling comeback against Jannik Sinner in the final of the French Open 2025 on Sunday, June 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-vs-jannik-sinner-epic-golden-big-three-era-2737749-2025-06-09",
      "headline": "Alcaraz vs Sinner: A Roland Garros epic promising a golden post-Big Three eraFrench Open 2025: Carlos Alcaraz and Jannik Sinner's epic Roland Garros final reignited the fire of men's tennis, ushering in a thrilling new chapter beyond the Big Three. Their fierce, five-hour, 29-minute duel was a bold promise of greatness to come."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/nationsl-league-final-pportugal-vs-spain-result-cristiano-ronaldo-crying-video-2737746-2025-06-09",
      "headline": "Ronaldo in tears as Portugal beat Spain on penalties to clinch Nations LeagueLegendary Cristiano Ronaldo could not hold back his tears as Portugal beat Spain to clinch the Nations League. Portugal, held to a 2-2 draw at extra time, beat Spain in the penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-jannik-sinner-video-2737737-2025-06-09",
      "headline": "Watch: Alcaraz salutes Sinner in touching speech after French Open epicCarlos Alcaraz staged a remarkable comeback to defeat Jannik Sinner in the longest French Open final ever. After the thrilling match, Alcaraz shared a glowing tribute for Jannik Sinner."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}