{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-set-to-consider-21-bonus-issue-september-20-shares-jump-over-9-percent-2594984-2024-09-06",
      "headline": "Godfrey Phillips set to consider 2:1 bonus issue; shares jump over 9%A bonus issue is a way for companies to reward existing shareholders without making them pay for the additional shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-1000-points-rs-5-lakh-crore-investors-wealth-wiped-off-2594971-2024-09-06",
      "headline": "Sensex crashes 1,000 points, investors lose Rs 5 lakh croreThe bloodbath on Dalal Street has wiped off nearly Rs 5 lakh crore from the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-may-slash-fuel-prices-as-global-crude-oil-costs-decline-report-2594925-2024-09-06",
      "headline": "Government may slash petrol, diesel prices as global crude oil rates fallUS crude oil prices dropped by more than 1% on Wednesday, falling below $70 per barrel. Brent crude prices followed suit, falling by $1 to reach $72.75 per barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inheritance-showdown-godfrey-phillips-bina-modi-to-vote-on-behalf-of-family-trust-agm-2594904-2024-09-06",
      "headline": "Bina Modi to vote on behalf of family trust at Godfrey Phillips AGMThe Delhi High Court recently allowed Bina to cast her vote on behalf of the trust, which holds a 47.5% stake in the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goldman-sachs-sbi-sell-rating-with-revised-target-price-reason-explained-2594888-2024-09-06",
      "headline": "Goldman Sachs gives SBI 'sell' rating with revised target price. Know whyThe brokerage highlighted a growing risk-reward imbalance for SBI's stock, driven by challenges in maintaining a strong return on assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-household-food-spending-dips-to-less-than-50-percent-eac-pm-report-2594878-2024-09-06",
      "headline": "India's household food spending dips to less than 50%: ReportThe change in spending, highlighted in a recent report by the Economic Advisory Council to the Prime Minister (EAC-PM), signals a shift in how Indian families allocate their monthly budgets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-turbulence-sensex-nifty-down-key-factors-explained-2594841-2024-09-06",
      "headline": "Sensex, Nifty down 1%: What's behind today's stock market turbulence?Today's market turbulence is partly linked to investor jitters ahead of the US non-farm payrolls report expected later today.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-tumbles-goldman-sachs-brokerage-view-83-percent-downside-2594825-2024-09-06",
      "headline": "Explained: Why Vodafone Idea shares tumbled over 14% today As of 11:51 am, Vodafone Idea's shares were trading at Rs13.60, down nearly 10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boss-packaging-solution-shares-sme-ipo-list-25-percent-premium-2594809-2024-09-06",
      "headline": "Boss Packaging Solutions makes debut on NSE SME at 25% premiumBoss Packaging Solutions listing: The stock was listed at Rs 82.5 on the NSE SME, marking a 25% premium over its IPO price of Rs 66."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-bloodbath-dalal-street-sensex-nifty-investors-4-lakh-crore-gone-2594807-2024-09-06",
      "headline": "Sensex down nearly 900 points, investors lose over Rs 4 lakh croreStock market turmoil: At 11:27 am, the Sensex was down 883.93 points to 81,317.23, while the Nifty50 fell 255.95 points to 24,889.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rekha-jhunjhunwala-backed-baazar-style-retail-shares-lists-flat-at-dalal-street-rs-389-2594775-2024-09-06",
      "headline": "Rekha Jhunjhunwala-backed Baazar Style Retail lists a flat on Dalal Street Baazar Style Retail listing: Baazar Style Retail's IPO received strong interest from investors, with an overall subscription of nearly 41 times by the time it closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-600-points-nifty-tumbles-ahead-of-key-us-jobs-data-2594751-2024-09-06",
      "headline": "Sensex falls nearly 600 points, Nifty tumbles ahead of key US jobs dataThe S&P BSE Sensex fell 553.9 points to 81,647.26 at 9:55 am, while the NSE Nifty50 was down 156.30 points to 24,988.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-starts-selling-onions-at-rs-35kg-in-delhi-mumbai-amid-rising-prices-2594746-2024-09-06",
      "headline": "Government starts selling onions at Rs 35/kg in Delhi and Mumbai. Check details The National Cooperative Consumer's Federation (NCCF) and the National Agricultural Cooperative Marketing Federation have started selling onions at Rs 35 per kilogram through special vans in Delhi and Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-super-kings-fy24-net-profit-soars-340-percent-rs-229-crore-revenue-jumps-131-percent-2594731-2024-09-06",
      "headline": "CSK hits it out of the park: IPL profit soars, check out jaw-dropping figuresThe overall revenue for Chennai Super Kings Cricket Ltd grew by 131% to Rs 676.40 crore, up from Rs 292.34 crore in FY23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-scheme-for-minors-to-launch-in-two-weeks-check-all-details-here-2594721-2024-09-06",
      "headline": "NPS scheme for minors to launch in 2 weeks. Details here NPS Vatsalya is a modified version of the National Pension System (NPS), designed specifically for minors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/securities-and-exchange-board-of-india-employees-silent-protest-mumbai-toxic-work-environment-2594534-2024-09-05",
      "headline": "Sebi employees stage silent protest at Mumbai office against 'toxic environment'Visuals showed scores of disgruntled employees gathered outside the main building, but within the Sebi headquarters' campus, staging a peaceful protest against the board's top management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prime-minister-narendra-modi-singapore-business-leaders-investment-opportunities-in-india-2594552-2024-09-05",
      "headline": "PM asks Singapore business leaders to look for investment opportunities in IndiaDuring the interaction, PM Modi said India had made transformative progress in the last 10 years and would continue on the same path given its strengths of political stability, policy predictability, ease of doing business, and its reform-oriented economic agenda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nris-face-double-tax-if-they-miss-filing-this-form-details-ddta-form-10f-trc-2594457-2024-09-05",
      "headline": "NRIs face double tax if they miss filing this form. Check detailsNRIs may face double taxation on the same income if their claim for tax relief under DTAA is denied. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bizarre-ipos-of-2024-sme-listings-resourceful-automobile-boss-packing-hariom-atta-spices-2594417-2024-09-05",
      "headline": "Bizarre IPOs of 2024: SME listings that no one saw comingWhile mainboard IPOs are the ones which attract the big bucks, the trend this year has been different with retail inventors breaking their banks for SME IPOs in a bizarre phenomenon."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vinesh-phogat-bajrang-punia-wrestlers-to-join-congress-today-ahead-of-haryana-assembly-elections-2594796-2024-09-06",
      "headline": "Vinesh Phogat, Bajrang Punia join Congress ahead of Haryana electionThe development comes mere days after the two wrestlers met with the party's leader, Rahul Gandhi, in New Delhi on September 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-1000-points-rs-5-lakh-crore-investors-wealth-wiped-off-2594971-2024-09-06",
      "headline": "Sensex crashes 1,000 points, investors lose Rs 5 lakh croreThe bloodbath on Dalal Street has wiped off nearly Rs 5 lakh crore from the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sebi-chief-madhabi-puri-buch-rent-income-wockhardt-mumbai-company-congress-2594926-2024-09-06",
      "headline": "Congress's fresh charge on Sebi chief: Got rent income from firm under probeCongress's Pawan Khera alleged that Madhabi Buch gave one of her properties on rent to a Mumbai company whose affiliated firm was under probe by Sebi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ujjain-rape-busy-road-viral-video-accused-arrested-congress-attacks-bjp-government-2594937-2024-09-06",
      "headline": "Woman raped on busy Ujjain road, bystanders film it, post video onlineThe accused coaxed the woman to drink alcohol and when she was intoxicated, he took her to a roadside shelter and raped her. An eyewitness filmed the incident and posted the video online, where it quickly went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/ic-814-kandahar-hijack-ic-427-amritsar-nsg-commando-india-ended-indian-airlines-hizb-ul-mujahideen-2594784-2024-09-06",
      "headline": "How NSG commandos ended plane-hijack crisis in Amritsar in 5 minutesIn 1993, an Indian Airlines Delhi-Srinagar with 141 people on board was hijacked by a Hizb-ul-Mujahideen terrorist, who hid two pistols in the plaster moulds on his legs. As the plane stopped at Amritsar, NSG commandos stormed IC 427 and ended the hostage crisis in just five minutes. This was in sharp contrast to the IC 814 Kandahar hijacking of 1999."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/vinesh-phogat-joins-congress-bajrang-punia-proud-to-be-part-of-party-that-supports-women-2594998-2024-09-06",
      "headline": "Vinesh Phogat joins Congress: Proud to be part of party that supports womenWrestler Vinesh Phogat joined Congress on Friday and said she was proud of joining a party that \"supports women\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-election-nayab-saini-karan-kamboj-shake-hand-video-bjp-infight-2594967-2024-09-06",
      "headline": "Irked over ticket snub, ex-BJP minister refuses to shake hands with Nayab SainiThe video, which is being widely shared on social media, shows Chief Minister Nayab Singh Saini attempting to shake hands with Karan Kamboj, who folds his hands and walks past."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-chief-mohan-bhagwat-people-will-decide-god-pune-event-manipur-2594831-2024-09-06",
      "headline": "People will decide whether we will become God or not: RSS chief Mohan BhagwatAt an event in Pune, RSS chief Mohan Bhagwat also spoke on the situation in violence-hit Manipur, saying locals were doubtful about their security."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-aandhi-to-indu-sarkar-films-on-emergency-censorship-kangana-ranaut-indira-gandhi-2594890-2024-09-06",
      "headline": "From bans to reels being burnt, the Aandhi some Emergency films weatheredThe Emergency in India in 1975 led to severe film censorship, impacting movies like Aandhi and Kissa Kursi Ka, which had to do with the life and politics of then Prime Minister Indira Gandhi. As Kangana Ranaut's Emergency is caught in a controversy, here's a look at films on Emergency that raised a storm, or silently conveyed the message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/coconut-sprinkles-over-pizza-stunt-former-nyc-mayor-bill-de-blasio-promote-kamala-harris-italian-american-community-paisans-for-kamala-2594916-2024-09-06",
      "headline": "Watch: Former NYC Mayor sprinkles coconut over pizza to support Kamala HarrisFormer New York City Mayor, Bill de Blasio, has created a quirky video where he eats a pizza topped with coconut to show his support for Kamala Harris's presidential campaign. The stunt is part of 'Paisans for Kamala', a virtual event featuring Italian-American celebrities and politicians, to back Harris's campaign."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/chitradurga-challakere-tahsildar-vehicle-car-fire-police-complaint-2594985-2024-09-06",
      "headline": "Man sets tehsildar's vehicle ablaze after cops refuse to file mother's complaintIn retaliation for the police's refusal to register his mother's complaint, a man in Karnataka's Chitradurga set a tehsildar's vehicle on fire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-sumit-antil-interview-javelin-gold-world-record-olympics-dream-2594986-2024-09-06",
      "headline": "Javelin star Sumit Antil exclusive: 'Want to experience feeling of throwing 80m' Paris Paralympics: Speaking to IndiaToday.in, javelin gold medallist Sumit Antil said he is going to work towards throwing 80m after a well-deserved break with family. Sumit recalled a crucial piece of advice from Olympic hero Neeraj Chopra and a heart-warming chat with the legendary Devendra Jhajharia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-health-official-drowns-as-divers-demand-rs-10000-before-rescue-delaying-help-2594932-2024-09-06",
      "headline": "'Transfer Rs 10,000 first': Health official drowns as divers demand payment before rescue After the money was transferred to a shopkeeper's account, the divers tried to assist, but Singh had already drowned by then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-muzaffarpur-government-hospital-abandoned-thieves-health-department-2594735-2024-09-06",
      "headline": "This Rs 5-crore Bihar hospital has not treated a single patient in 10 yearsA government hospital in Bihar, built at a cost of Rs 5 crore and equipped with modern facilities, has become a derelict structure abandoned for almost 10 years even without an inauguration. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/ariko-cafe-ice-cream-parlour-whiskey-laced-ice-cream-excise-department-raid-2594976-2024-09-06",
      "headline": "Hyderabad ice cream parlour caught selling whiskey-laced frozen treatsA local ice cream parlour in Hyderabad found itself in a frosty situation after being caught red-handed selling whiskey-infused ice cream. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-ozempic-delay-ageing-experts-weigh-in-on-new-study-2594358-2024-09-06",
      "headline": "Can Ozempic delay ageing? Experts weigh in on new study Ozempic, the much-talked-about drug for diabetes management and subsequent weight loss, can delay ageing and improve heart health, says a new study."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-closes-starliner-hatch-damaged-spacecraft-to-return-empty-2594763-2024-09-06",
      "headline": "Sunita Williams closes Starliner's hatch to send it home empty Williams and Wilmore removed Starliner's crew seats to optimize space for cargo storage. This modification allows for more efficient packing of materials destined for return to Earth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/governor-rn-ravi-education-system-udhayanidhi-stalin-quality-drugs-2594808-2024-09-06",
      "headline": "75% Tamil Nadu students can't recognise 2-digit numbers: Governor's fresh attackThe Tamil Nadu Governor, RN Ravi, has slammed the state's education system, alleging poor quality education, students' inability to recognise basic numbers, and the distribution of drugs in schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-nine-live-updates-dipesh-kumar-praveen-kumar-kasthuri-rajamani-2594882-2024-09-06",
      "headline": "Day 9 Live: Dipesh Kumar in javelin action, Dilip storms into 400m final Paralympics 2024, Day 9 Live: India's Dipesh Kumar is in action in the Men's Javelin Throw - F54 Final. Meanwhile, Dilip Mahadu, 21, has stormed into the men's 400 T45 final after finishing third in his heat. He set a new season-best timing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/all-about-mucositis-the-condition-hina-khan-faces-alongside-breast-cancer-2594907-2024-09-06",
      "headline": "All about mucositis, the condition Hina Khan faces alongside breast cancerHina Khan, battling stage 3 breast cancer, is suffering from mucositis, a painful side effect of chemotherapy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-mla-rajendra-pal-gautam-joins-congress-ex-minister-dalit-leader-2594839-2024-09-06",
      "headline": "Chinks in INDIA bloc? AAP's Delhi MLA joins CongressRajendra Pal Gautam, a prominent Dalit leader and MLA from Delhi's Seemapuri, joined the Congress today. The development comes amid ongoing alliance talks between the AAP and Congress for the upcoming Haryana assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/supreme-court/story/tamil-nadu-youtuber-felix-gerald-interview-savukku-shankar-women-police-officer-2594938-2024-09-06",
      "headline": "Top court halts order directing shutdown of YouTuber's channel as bail conditionThe Madras High Court had ordered the shutdown of Gerald's YouTube channel as a condition for bail in a case involving remarks against women police officers. The Supreme Court disagreed with this decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vishesh-bhatt-aashiqui-court-order-exclusive-2594920-2024-09-06",
      "headline": "Vishesh Bhatt on filing lawsuit for 'Aashiqui': People were misusing brandThe Delhi High Court ruled in favour of Vishesh Films, issuing an interim injunction against T-Series from using specific titles. Vishesh Bhatt explains the decision to approach the court despite having a trademark on the title in an exclusive interview with IndiaToday.in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-aandhi-to-indu-sarkar-films-on-emergency-censorship-kangana-ranaut-indira-gandhi-2594890-2024-09-06",
      "headline": "From bans to reels being burnt, the Aandhi some Emergency films weatheredThe Emergency in India in 1975 led to severe film censorship, impacting movies like Aandhi and Kissa Kursi Ka, which had to do with the life and politics of then Prime Minister Indira Gandhi. As Kangana Ranaut's Emergency is caught in a controversy, here's a look at films on Emergency that raised a storm, or silently conveyed the message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vishesh-bhatt-aashiqui-court-order-exclusive-2594920-2024-09-06",
      "headline": "Vishesh Bhatt on filing lawsuit for 'Aashiqui': People were misusing brandThe Delhi High Court ruled in favour of Vishesh Films, issuing an interim injunction against T-Series from using specific titles. Vishesh Bhatt explains the decision to approach the court despite having a trademark on the title in an exclusive interview with IndiaToday.in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shabana-azmi-takes-a-dig-at-ott-platforms-for-running-after-established-stars-49-years-of-nishant-2594970-2024-09-06",
      "headline": "Shabana Azmi takes a dig at OTT platforms for 'running after established stars'Shabana Azmi celebrated the 49th anniversary of 'Nishant' and criticised OTT platforms for their focus on established stars, urging more support for new talent. She highlighted Shyam Benegal's role in nurturing newcomers, contrasting it with current OTT trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/panchayat-tamil-remake-thalaivettiyaan-paalayam-release-this-date-2594965-2024-09-06",
      "headline": "'Panchayat' Tamil remake, 'Thalaivettiyaan Paalayam', to release soonThe Tamil remake of 'Panchayat', titled 'Thalaivettiyaan Paalayam', is set to stream on Prime Video from September 20, offering a heartwarming and comedic glimpse into rural Tamil Nadu."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistans-naveed-zadran-ruled-out-of-one-off-test-against-new-zealand-2594993-2024-09-06",
      "headline": "Afghanistan's Naveed Zadran ruled out of one-off Test against New ZealandAfghanistan seamer Naveed Zadran has been ruled out of the one-off Test against New Zealand due to side strain injury. The two teams will lock horns in a single Test match beginning from September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-nathan-lyon-r-aswhin-watch-him-bowl-marnus-labuschagne-2594990-2024-09-06",
      "headline": "Love watching R Ashwin bowl: Nathan Lyon ahead of Border-Gavaskar battleNathan Lyon praises R Ashwin's bowling ahead of the Border-Gavaskar Trophy, highlighting their respectful rivalry and Ashwin's mastery. Marnus Labuschagne adds anticipation, eager to face India's formidable fast-bowling attack in Australian conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-sumit-antil-interview-javelin-gold-world-record-olympics-dream-2594986-2024-09-06",
      "headline": "Javelin star Sumit Antil exclusive: 'Want to experience feeling of throwing 80m' Paris Paralympics: Speaking to IndiaToday.in, javelin gold medallist Sumit Antil said he is going to work towards throwing 80m after a well-deserved break with family. Sumit recalled a crucial piece of advice from Olympic hero Neeraj Chopra and a heart-warming chat with the legendary Devendra Jhajharia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-musheer-khans-monstrous-six-lands-on-chinnaswamys-roof-in-duleep-trophy-2594975-2024-09-06",
      "headline": "Watch: Musheer Khan's monstrous six lands on Chinnaswamy's roof in Duleep TrophyDuleep Trophy: Musheer Khan hit a monstrous six which landed on the roof of Chinnaswamy Stadium and bounced back onto the field. However, in the same over, he was dismissed by Kuldeep Yadav for 181 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-highlights-shan-masood-vs-babar-azam-problem-in-pakistan-cricket-2594957-2024-09-06",
      "headline": "R Ashwin highlights Shan Masood-Babar Azam conundrum in Pakistan CricketIndia off-spinner Ravichandran Ashwin highlighted a major issue in Pakistan cricket with Shan Masood captaining he poster boy of Pakistan, Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/sumit-antil-exclusive-paralympics-gold-medal-records-80m-neeraj-chopra-2594954-2024-09-06",
      "headline": "Never said I wanted to compete in both Olympics and Paralympics: Sumit AntilParalympics 2024: Speaking to IndiaToday.in, javelin star Sumit Antil said he was not happy with his effort in Paris. Despite defending his title with a gold medal, Sumit rued missing another world record. The Haryana athlete, supported by GoSports Foundation, cleared the air around his plans for the future in a candid chat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-hails-tamil-nadu-teammate-baba-indrajiths-fighting-72-in-duleep-trophy-2594929-2024-09-06",
      "headline": "R Ashwin hails Tamil Nadu teammate Baba Indrajith's fighting 72 in Duleep TrophyRavichandran Ashwin hailed his Tamil Nadu teammate Baba Indrajith for his gritty knock for India C in the Duleep Trophy tournament. Indrajith scored 72 runs in IndiaC's first innings.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-new-rules-indian-assistant-coach-red-card-challenge-concussion-sub-2594908-2024-09-06",
      "headline": "Concussion sub and other new ISL rules ahead of 2024-25 seasonThe Indian Super League (ISL) introduces new rules for the 2024-2025 season, including concussion substitutions and the ability to challenge wrongful red cards, aiming to improve fairness, player safety, and the development of homegrown talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-3rd-test-match-preview-and-live-streaming-when-and-where-to-watch-live-2594886-2024-09-06",
      "headline": "England vs Sri Lanka 3rd Test match Live streaming: When and where to watch liveThe 3rd Test match between England and Sri Lanka will be played at The Oval. Find out all the live streaming details of the last match of the English summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-nine-live-updates-dipesh-kumar-praveen-kumar-kasthuri-rajamani-2594882-2024-09-06",
      "headline": "Day 9 Live: Dipesh Kumar in javelin action, Dilip storms into 400m final Paralympics 2024, Day 9 Live: India's Dipesh Kumar is in action in the Men's Javelin Throw - F54 Final. Meanwhile, Dilip Mahadu, 21, has stormed into the men's 400 T45 final after finishing third in his heat. He set a new season-best timing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/sumit-antil-exclusive-paralympics-gold-medal-records-80m-neeraj-chopra-2594954-2024-09-06",
      "headline": "Never said I wanted to compete in both Olympics and Paralympics: Sumit AntilParalympics 2024: Speaking to IndiaToday.in, javelin star Sumit Antil said he was not happy with his effort in Paris. Despite defending his title with a gold medal, Sumit rued missing another world record. The Haryana athlete, supported by GoSports Foundation, cleared the air around his plans for the future in a candid chat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-hails-tamil-nadu-teammate-baba-indrajiths-fighting-72-in-duleep-trophy-2594929-2024-09-06",
      "headline": "R Ashwin hails Tamil Nadu teammate Baba Indrajith's fighting 72 in Duleep TrophyRavichandran Ashwin hailed his Tamil Nadu teammate Baba Indrajith for his gritty knock for India C in the Duleep Trophy tournament. Indrajith scored 72 runs in IndiaC's first innings.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-new-rules-indian-assistant-coach-red-card-challenge-concussion-sub-2594908-2024-09-06",
      "headline": "Concussion sub and other new ISL rules ahead of 2024-25 seasonThe Indian Super League (ISL) introduces new rules for the 2024-2025 season, including concussion substitutions and the ability to challenge wrongful red cards, aiming to improve fairness, player safety, and the development of homegrown talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-3rd-test-match-preview-and-live-streaming-when-and-where-to-watch-live-2594886-2024-09-06",
      "headline": "England vs Sri Lanka 3rd Test match Live streaming: When and where to watch liveThe 3rd Test match between England and Sri Lanka will be played at The Oval. Find out all the live streaming details of the last match of the English summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-nine-live-updates-dipesh-kumar-praveen-kumar-kasthuri-rajamani-2594882-2024-09-06",
      "headline": "Day 9 Live: Dipesh Kumar in javelin action, Dilip storms into 400m final Paralympics 2024, Day 9 Live: India's Dipesh Kumar is in action in the Men's Javelin Throw - F54 Final. Meanwhile, Dilip Mahadu, 21, has stormed into the men's 400 T45 final after finishing third in his heat. He set a new season-best timing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-emotional-milestone-career-goals-watch-video-portugal-2594877-2024-09-06",
      "headline": "Watch: Cristiano Ronaldo gets emotional after netting 900th career goalCristiano Ronaldo became emotional after netting his milestone 900th career goal during Portugal's UEFA Nations League win over Croatia. The moment highlighted his incredible journey, solidifying his status as one of football's all-time greats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marco-jansen-quinton-de-kock-laura-wolvaardt-csa-annual-awards-2594837-2024-09-06",
      "headline": "Marco Jansen, Quinton de Kock, Wolvaardt among big winners at CSA Annual awardsSouth Africa cricketers Marco Jansen, Quinton de Kock and Laura Wolvaardt won major awards at the Cricket South Africa annual awards ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-defends-ollie-popes-dry-run-calls-out-english-culture-towards-sport-2594836-2024-09-06",
      "headline": "Ben Stokes defends Ollie Pope's dry run, calls out 'English culture towards sport'Ben Stoke defended Ollie Pope for not being able to score runs in the last two Tests against Sri Lanka. He also called out the English culture towards the sport amid criticism for Pope. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pickleball-boom-india-trendy-sport-manish-rao-sunil-valavakar-2594812-2024-09-06",
      "headline": "Pickleball Boom: The trendy, social sport is winning hearts in India tooPickleball is booming worldwide, and India is no exception. Once played in parking lots and alleys, it's now entering the professional era. Pioneers Sunil Valavakar and Manish Rao, in conversation with IndiaToday.in, highlight the sport's rapid growth and its ability to transcend age groups and make a meaningful impact on enthusiasts' lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-pm-narendra-modi-kapil-parmar-judo-bronze-medal-congratulations-post-2594819-2024-09-06",
      "headline": "PM Modi praises Kapil Parmar for 'special' Paralympics Judo bronze medalPrime Minister Narendra Modi hailed Kapil Parmar's historic bronze medal in Judo at the Paris Paralympics, marking India's first-ever Judo Paralympic medal and celebrating the inspiring journey of the visually impaired para-athlete from Madhya Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-anantapur-stadium-packed-chinnaswamy-stands-in-bengaluru-empty-2594797-2024-09-06",
      "headline": "Duleep Trophy: Anantapur stadium packed, Chinnaswamy stands in Bengaluru emptyDuleep Trophy: Huge crowd turned up at the Anantapur stadium in Andhra Pradesh for India C vs India D match. Meanwhile, the stands at the M Chinnaswamy Stadium in Bengaluru were empty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-farewell-angel-di-maria-argentina-retirement-chile-world-cup-qualifiers-2594795-2024-09-06",
      "headline": "Messi's heartfelt farewell to Di Maria on retirement: We'll miss you a lotLionel Messi delivered an emotional tribute to Angel Di Maria at Estadio Mâs Monumental, honoring his 16-year Argentina career. The farewell left Di Maria in tears, marking the end of an era in Argentine football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vikram-rathour-rangana-herath-new-zealand-afg-vs-nz-sl-vs-nz-2594780-2024-09-06",
      "headline": "Vikram Rathour, Rangana Herath to help New Zealand prepare for Test season in Asia New Zealand Cricket have onboarded Vikram Rathour and Rangana Herath to help them prepare for the upcoming Test season in Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-pm-narendra-modi-kapil-parmar-judo-bronze-medal-congratulations-post-2594819-2024-09-06",
      "headline": "PM Modi praises Kapil Parmar for 'special' Paralympics Judo bronze medalPrime Minister Narendra Modi hailed Kapil Parmar's historic bronze medal in Judo at the Paris Paralympics, marking India's first-ever Judo Paralympic medal and celebrating the inspiring journey of the visually impaired para-athlete from Madhya Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-anantapur-stadium-packed-chinnaswamy-stands-in-bengaluru-empty-2594797-2024-09-06",
      "headline": "Duleep Trophy: Anantapur stadium packed, Chinnaswamy stands in Bengaluru emptyDuleep Trophy: Huge crowd turned up at the Anantapur stadium in Andhra Pradesh for India C vs India D match. Meanwhile, the stands at the M Chinnaswamy Stadium in Bengaluru were empty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-farewell-angel-di-maria-argentina-retirement-chile-world-cup-qualifiers-2594795-2024-09-06",
      "headline": "Messi's heartfelt farewell to Di Maria on retirement: We'll miss you a lotLionel Messi delivered an emotional tribute to Angel Di Maria at Estadio Mâs Monumental, honoring his 16-year Argentina career. The farewell left Di Maria in tears, marking the end of an era in Argentine football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vikram-rathour-rangana-herath-new-zealand-afg-vs-nz-sl-vs-nz-2594780-2024-09-06",
      "headline": "Vikram Rathour, Rangana Herath to help New Zealand prepare for Test season in Asia New Zealand Cricket have onboarded Vikram Rathour and Rangana Herath to help them prepare for the upcoming Test season in Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-final-ready-one-more-time-missed-opportunity-jessica-pegula-2594771-2024-09-06",
      "headline": "Aryna Sabalenka ready for Final after 'missed opportunity' last yearAryna Sabalenka, determined to avenge last year's heartbreak, secured her second consecutive US Open final spot. Ready to \"give it her all,\" she faces Jessica Pegula in a high-stakes showdown for her first US Open title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jessica-pegula-credits-small-momentum-flip-moments-for-maiden-us-open-semis-win-2594766-2024-09-06",
      "headline": "Jessica Pegula credits 'small momentum flip moments' for maiden US Open semis winJessica Pegula credited small momentum flip moments which contributed to her first-ever win in the US Open semi-final. She beat Karolina Muchova 1-6, 6-4, 6-2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/curtly-ambrose-picks-virat-kohli-among-batters-he-would-love-to-bowl-against-2594756-2024-09-06",
      "headline": "Curtly Ambrose picks Virat Kohli among batters he would love to bowl againstLegendary West Indies fast bowler Curtly Ambrose picked star batter Virat Kohli among batters he would love to bowl against in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-announces-player-of-the-month-nominees-no-indians-named-in-both-categories-2594730-2024-09-06",
      "headline": "ICC announces Player of the Month nominees, no Indians named in both categoriesThe ICC announced the Player of the Month nominees for the month of August. However, no Indian made a cut to the nomination for both men's and women's categories. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}