{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-erase-early-gains-to-end-flat-in-volatile-trade-2688182-2025-03-03",
      "headline": "Sensex, Nifty erase early gains to end flat in volatile tradeThe S&P BSE Sensex lost 21,85 points to end at 73,176.25, while the NSE Nifty50 was down by 5.40 points to close at 22,119.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-recover-2-percent-after-4-percent-drop-on-ed-notice-over-fema-violations-2688167-2025-03-03",
      "headline": "Paytm shares recover after 4% drop on ED notice over FEMA violationsPaytm earlier informed stock exchanges that it had received a show cause notice from the Enforcement Directorate (ED) on February 28 at 7:27 PM. The notice, dated 27 February, was related to alleged violations of FEMA rules between 2015 and 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/md-and-ceo-of-edelweiss-mutual-fund-radhika-gupta-compared-nifty-to-shah-rukh-khan-details-here-2688133-2025-03-03",
      "headline": "Why has Radhika Gupta compared Nifty to Shah Rukh Khan? Details hereNifty has hit its longest losing streak in 29 years, wiping out Rs 90 lakh crore in investor wealth since hitting its peak in September. The Sensex has fallen over 12% since its September 2024 all-time high, when it touched its peak at 85,478.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smallcap-and-midcap-stocks-free-fall-what-should-investors-do-2688089-2025-03-03",
      "headline": "Smallcap and midcap stocks are in free fall. What should investors do?The broader market saw heavy selling pressure last month, dragging the BSE Smallcap index down 15%—its first double-digit monthly decline since the pandemic sell-off—while the Nifty Midcap 100 fell over 10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-growth-hits-14-month-low-in-february-on-soft-demand-2688091-2025-03-03",
      "headline": "India's manufacturing growth hits 14-month low in February on soft demandThe HSBC final India Manufacturing Purchasing Managers' Index, compiled by S&P Global, fell to 56.3 in February - its lowest since December 2023 - from 57.7 in January. A preliminary estimate was much higher at 57.1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pli-scheme-government-focus-on-exports-and-value-creation-2688074-2025-03-03",
      "headline": "Government looks to enhance PLI scheme to boost exports. Details hereIntroduced in April 2020, the PLI scheme has drawn substantial investment in 14 sectors, attracting original equipment manufacturers (OEMs) and contract manufacturers to scale up production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-fall-reason-why-over-5-percent-to-hit-52-week-low-today-2688053-2025-03-03",
      "headline": "Explained: Why Ola Electric shares fell over 5% to hit 52-week low todayIn the past five days, Ola Electric shares have lost more than 9%, and in six months, it has crashed a whopping 52%. Since the start of this year, the stock is down over 37%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-ril-tumbled-over-3-percent-today-hitting-a-fresh-52-week-low-2688045-2025-03-03",
      "headline": "Explained: Why Reliance share price tumbled over 3% today Foreign investors have been aggressively selling Indian equities, dragging down heavyweight stocks like RIL. The company's market value has shrunk as a result, reflecting the broader negative sentiment in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-likely-to-cut-1-000-jobs-amid-rising-losses-report-share-price-52-week-low-2688040-2025-03-03",
      "headline": "Ola Electric likely to cut over 1,000 jobs amid rising losses: ReportThe job cuts will affect multiple departments, including procurement, fulfilment, customer relations, and charging infrastructure. Ola Electric shares also fell 5% to hit its 52-week low of Rs 54. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-often-can-taxpayers-switch-between-new-and-old-tax-regime-2688033-2025-03-03",
      "headline": "How often can taxpayers switch between new and old tax regime? Salaried employees can select their tax regime at the start of each financial year. If no preference is given, employers will deduct tax under the new regime by default."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-400-points-nifty-erase-early-gains-why-is-stock-market-falling-today-fii-selling-2688032-2025-03-03",
      "headline": "Sensex, Nifty erases early gains: Why is stock market falling today? By 11:13 AM, the S&P BSE Sensex had fallen 388.70 points to 72,809.40, while the NSE Nifty50 was down 111.50 points to 22,013.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-co-founder-sergey-brin-shares-sweet-spot-of-work-hours-60-for-employees-check-details-2688020-2025-03-03",
      "headline": "Google co-founder shares 'sweet spot' of work hours for employees. Check detailsGoogle co-founder Sergey Brin expressed concern about employees working less than the recommended hours or doing the bare minimum. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tenali-rama-fire-disrupts-shoot-no-casualties-reported-2688145-2025-03-03",
      "headline": "TV show Tenali Rama set catches fire, shoot haltedA fire broke out on the set of TV show Tenali Rama due to a generator malfunction, halting production. There were no casualties, but the set suffered damage and repairs are underway.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-trailer-abhishek-bachchan-reunites-with-ludo-co-actor-inayat-verma-in-feel-good-film-2688128-2025-03-03",
      "headline": "Be Happy: Abhishek Bachchan reunites with Ludo co-actor Inayat in feel-good filmThe trailer of Abhishek Bachchan and Inayat Verma's upcoming dance-drama Be Happy was released today. Directed by Remo D'Souza, the heartfelt film will premiere on Prime Video on March 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-seoul-concert-new-song-fan-proposal-and-special-appearance-by-jin-2688072-2025-03-03",
      "headline": "BTS' J-hope's Seoul concert: New song, fan proposal and special appearance by JinBTS member and rapper J-hope recently held a concert in Seoul which was attended by his close friend and singer Kim Seokjin (Jin). The concert was one big event for the fans as it consisted of many other surprises besides the central performance by the artiste. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-release-date-announced-2688039-2025-03-03",
      "headline": "Khakee The Bengal Chapter: Jeet and Prosenjit announce release date with fun clipThe next installment of Netflix's critically acclaimed thriller series Khakee, Khakee: The Bengal Chapter will premiere on Netflix in March. The makers of the show announced its release date with a fun video. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupamaa-actor-sudhanshu-pandey-breaks-silence-on-rumoured-feud-with-rupali-ganguly-2687828-2025-03-02",
      "headline": "Anupamaa actor Sudhanshu Pandey breaks silence on rumoured feud with Rupali GangulyActor Sudhanshu Pandey has addressed the ongoing rumours about a feud with his Anupamaa co-star Rupali Ganguly. In an interview, he clarified the situation and dismissed the speculations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brit-awards-2025-charli-xcx-wins-album-of-the-year-full-winners-list-here-2687772-2025-03-02",
      "headline": "BRIT Awards 2025: Charli XCX wins album of the year, full winners list hereCharli XCX emerged as a major winner at the Brit Awards 2025, securing multiple accolades. Artists including Sabrina Carpenter and Billie Eilish also took home some of the biggest awards of the night.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-delhi-millionaire-concert-a-night-of-nostalgia-surprises-iconic-hits-2687778-2025-03-02",
      "headline": "Honey Singh's Millionaire Delhi concert: A night of nostalgia, iconic hitsHoney Singh's Delhi concert was packed with nostalgic hits, emotional tributes, surprise guests, and exclusive remixes. The rapper promised bigger things ahead as his Millionaire Tour continues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-celebrates-31st-birthday-with-family-shares-rare-pics-of-son-jack-blues-bieber-2687734-2025-03-02",
      "headline": "Justin Bieber celebrates 31st birthday with family, shares rare pics of son JackPop sensation Justin Bieber marked his 31st birthday with a heartwarming family gathering. He shared rare photos with wife Hailey and their son Jack, capturing the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billy-joel-stumbles-and-falls-mid-performance-2687699-2025-03-02",
      "headline": "Singer Billy Joel stumbles and falls mid-performance, fans say 'that's painful'During a recent performance, legendary musician Billy Joel stumbled and fell onstage, causing fans to worry about his health. The incident has sparked widespread concern and discussions about the artist's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-vows-to-bring-grammy-to-india-at-sold-out-delhi-concert-watch-2687670-2025-03-02",
      "headline": "At sold-out Delhi concert, Honey Singh vows to bring Grammys to India. WatchAt his Delhi concert, Honey Singh wowed fans with his hits and vowed to bring a Grammy to India, inspired by AR Rahman's Oscars win. He also expressed his deep love for Delhi and its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-set-to-perform-in-delhi-excited-fans-rush-into-venue-2687561-2025-03-01",
      "headline": "Honey Singh set to perform in Delhi, excited fans rush to the venueSinger and rapper Honey Singh is set to perform in Delhi today as part of his ongoing Millionaire India tour. Ahead of the concert, excited fans were seen rushing to the venue as soon as the gates opened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-online-negativity-against-him-ive-been-here-before-youtube-existed-2687499-2025-03-01",
      "headline": "Honey Singh on online negativity against him: I've been here before YouTube existedSinger and rapper Honey Singh took a dig at those spreading negativity about him through YouTube podcasts. During his Lucknow concert last night, he also spoke about his lifestyle changes."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-youtuber-ranveer-allahbadia-indias-got-latent-comments-row-censorship-filthy-language-2688143-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court allows Ranveer Allahbadia to resume podcast after filthy language rebukeThe Supreme Court came down heavily on Ranveer Allahbadia, saying that freedom of speech has its limitations, observing that using foul language is not humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/mk-stalin-urges-people-to-have-babies-immediately-to-counter-delimitation-impact-2688062-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Have babies immediately: MK Stalin's advice to Tamil people amid delimitation rowTamil Nadu Chief Minister MK Stalin urged people to have children immediately, warning that population-based delimitation could reduce the state's parliamentary representation due to its success in family planning.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-captain-ajinkya-rahane-venkatesh-iyer-2688179-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL 2025: Ajinkya Rahane to lead KKR, Venkatesh Iyer named vice-captainIPL 2025: Defending champions KKR have announced that Ajinkya Rahane will be their captain for the upcoming 2025 season on March 3. Rahane is back at KKR for his second stint and Venkatesh Iyer will; serve as his deputy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israels-haifa-but-stand-attack-killed-injured-shooting-stabbing-2688176-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One killed, four injured in shooting and stabbing attack in Israel's HaifaA suspected terror attack at a busy bus station in Haifa on Monday left one person dead and four others wounded, while the unidentified assailant was also killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/sabyasachi-moment-on-oscars-2025-red-carpet-courtesy-goldie-hawn-2688139-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sabyasachi moment on the Oscars 2025 red carpet. Courtesy, Goldie HawnActress Goldie Hawn attended the Academy Awards in a Dolce & Gabbana corset gown, but it was her stunning Sabyasachi necklace that stole the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/unimpressive-captain-congress-leader-shama-mohamed-fat-shames-rohit-sharma-bjp-hits-back-2687973-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress's damage control, asks leader to delete post fat-shaming Rohit SharmaCongress spokesperson Shama Mohamed stirred controversy by calling Rohit Sharma \"fat for a sportsman\" and the \"most unimpressive\" captain India has had. The BJP criticised the Congress and accused the party of \"body-shaming\" a World Cup winner. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-killed-jordan-security-forces-border-eyewitness-relative-illegal-immigration-2688118-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Relative of Kerala man shot dead near Jordan border shares chilling accountThomas Gabriel Periera and his relative left for Jordan on February 5. Last week, Periera's family was informed by the Indian Embassy that he had died."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mandya-mla-ravi-ganiga-slams-rashmika-mandanna-for-refusing-to-attend-bengaluru-film-festival-2688152-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress MLA wants Rashmika Mandanna taught a lesson for 'disregarding' KannadaCongress MLA Ravi Ganiga from Mandya, Karnataka, criticised actor Rashmika Mandanna for allegedly refusing to attend the Bengaluru International Film Festival. He accused her of disregarding the Kannada film industry where she began her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendar-modi-gir-lion-safari-world-wildlife-protection-day-vantara-2688071-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi shares glimpses from lion safari at Gir in nostalgic post. See picsPM Modi shared some glimpses from his visit to the Gir Wildlife Sanctuary in Gujarat, where he captured breathtaking pictures of flora and fauna on World Wildlife Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-mamata-banerjee-warned-of-indefinite-dharna-against-election-commission-2687174-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Mamata Banerjee warned of indefinite dharna against Election Commission'Won't let outsiders occupy Bengal,' the Trinamool Congress chief has said, alleging voter list manipulation by the BJP with the Election Commission's 'help'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-bcci-secretary-devajit-saikia-rohit-sharma-congress-shama-mohamed-fat-shaming-2688137-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma is fit: BCCI hits back at 'derogatory' fat-shaming comments BCCI secretary Devajit Saikia and vice-president Rajeev Shukla defended Rohit Sharma, asserting that the India captain is among the team's fittest cricketers. The cricket board strongly condemned a post by Congress National Spokesperson Shama Mohamed that fat-shamed Rohit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/replacing-humans-with-robots-akhilesh-yadav-rips-into-calls-for-90-hour-workweek-2688160-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Replacing humans with robots: Akhilesh Yadav rips into calls for 90-hour workweekThe long workweek debate intensified as Samajwadi Party chief Akhilesh Yadav challenged business leaders, asking if they had ever worked 90-hour weeks themselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-against-concrete-art-complex-in-cubbon-park-green-lung-heart-city-tech-hub-pollution-2688116-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru against concrete in green lung Cubbon Park, says no to art complexActivists and locals are protesting against an art complex in Cubbon Park, also known as the \"green lung\" of Bengaluru. They argue that any alterations or private takeovers would threaten the shrinking park. The Lok Sabha MP of Bengaluru Central has also written to Karnataka Chief Minister Siddaramiah against the art complex."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-bihar-clings-to-ashokas-ancient-shield-development-kv-teacher-abuses-suspension-nitish-kumar-gaya-patna-2687391-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why today's Bihar clings to Ashoka's ancient shieldA Kendriya Vidyalaya teacher was suspended for her abusive rant about Bihar. People celebrated her suspension on social media, with some invoking Bihar's ancient glory. Resorting to the pride of the past, however, overlooks the massive challenges that the state currently faces. These are the areas that Bihar can't turn a blind eye to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-dubai-advantage-criticism-india-vs-australia-semifinal-2688177-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dubai is not our home: Rohit Sharma dismisses unfair advantage criticism Speaking to the press ahead of India's semi-final against Australia, captain Rohit Sharma said the Men in Blue playing all their games in Dubai is not giving them any kind of advantage. India remained unbeaten in the group stage, beating New Zealand, Pakistan and Bangladesh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-congress-worker-himani-narwal-murder-suitcase-accused-confesses-extortion-2688004-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suspect had affair with Congress worker, killed her due to extortion: SourcesThe accused, Sachin, was arrested in Delhi on Monday, two days after Himani's body was found stuffed in a suitcase near a bus stand in Rohtak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/inside-indias-cancer-surge-the-numbers-the-science-and-the-hope-2688097-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Inside India's cancer surge: The numbers, the science, and the hopeAs India faces a growing burden of cancer cases, greater investment in public awareness, lifestyle interventions, and technology-driven treatment solutions are crucial in its fight, besides lifestyle changes at the policy level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/oscar-2025-full-winners-list-97th-academy-awards-2687953-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oscar 2025 full winners list: Best film Anora dominates 97th Academy AwardsThe 97th Academy Awards have wrapped up as of March 3 in EST (March 4 in IST). Sean Baker's Anora took home 5 top honours of the night including Best Picture and Best Actress.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/volodymyr-zelenskyy-speak-on-donald-trump-meet-usa-ukraine-2688021-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zelenskyy breaks silence on Trump's public dressing-down: Don't think it's rightZelenskyy reiterated that he hopes to mend ties with Trump despite their tense Oval Office meeting, while making it clear that Ukraine won't cede territory to Russia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nick-fury-samuel-jackson-reunites-with-iron-man-robert-downey-jr-oscars-2025-2688130-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oscars 2025: 'Nick Fury' Samuel Jackson reunites with 'Iron Man' Robert Downey JrAt the 2025 Academy Awards, Samuel L Jackson and Robert Downey Jr caught attention with their unexpected reunion. Their meeting stirred excitement among fans, recalling their Marvel collaborations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-woman-shares-blinkit-ambulance-saved-grandfather-zomato-ceo-deepinder-goyal-reacts-2688146-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gurugram woman shares how Blinkit ambulance saved her grandfather, Zomato CEO reactsIn a now-viral post on LinkedIn, Komal Kataria shared how Blinkit's ambulance service changed her perspective on emergency medical response. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-immigration-bigger-threat-putin-dont-end-up-like-europe-2687991-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says immigration bigger threat than Putin: Don't end up like EuropeUS President Donald Trump said that his primary concern is not Russian President Vladimir Putin but curbing illegal immigration to prevent the country from following Europe's path."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/dr-george-p-abraham-found-dead-in-thuruthissery-farmhouse-ernakulam-kerala-2688105-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Renowned nephrologist found dead in Kerala farmhouse, suicide note recoveredDr George P Abraham, a pioneer in kidney transplantation, was found dead at his farmhouse in Ernakulam, Kerala. According to a suicide note found at the scene, he cited declining surgical proficiency as the reason for suicide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-taunts-trump-ally-offers-ukraine-citizenship-after-resignation-calls-2687960-2025-03-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zelenskyy taunts Trump ally, offers Ukraine citizenship after resignation callsUkrainian President Volodymyr Zelenskyy dismissed calls to resign by US officials. Intended to reset US-Ukraine ties, the meeting grew confrontational, leading Lindsey Graham to suggest Zelenskyy step aside or send a replacement for negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-vanga-breaks-silence-on-prabhas-spirit-beating-baahubali-2-records-2688178-2025-03-03",
      "headline": "Sandeep Vanga breaks silence on Prabhas's Spirit beating Baahubali 2 recordsAnimal director Sandeep Reddy Vanga revealed his take on the subject of comparison between his upcoming film Spirit and Baahubali, both starring Prabhas. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mandya-mla-ravi-ganiga-slams-rashmika-mandanna-for-refusing-to-attend-bengaluru-film-festival-2688152-2025-03-03",
      "headline": "Congress MLA wants Rashmika Mandanna taught a lesson for 'disregarding' KannadaCongress MLA Ravi Ganiga from Mandya, Karnataka, criticised actor Rashmika Mandanna for allegedly refusing to attend the Bengaluru International Film Festival. He accused her of disregarding the Kannada film industry where she began her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-adrien-brody-oscar-winner-the-brutalist-2688149-2025-03-03",
      "headline": "Sonu Sood congratulates two-time Oscar winner Adrien Brody: Many more on your wayActor Sonu Sood congratulated two-time Oscar winner Adrien Brody with a throwback picture. He mentioned that many more Oscars are coming his way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-video-alia-bhatt-attends-meet-and-greet-with-fans-in-mumbai-2688110-2025-03-03",
      "headline": "Watch: Alia Bhatt attends meet-and-greet with fans in MumbaiAlia Bhatt delighted fans at a special event in Mumbai, where she interacted. The actor was spotted in a stylish casual outfit."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-captain-ajinkya-rahane-venkatesh-iyer-2688179-2025-03-03",
      "headline": "IPL 2025: Ajinkya Rahane to lead KKR, Venkatesh Iyer named vice-captainIPL 2025: Ajinkya Rahane to lead KKR, Venkatesh Iyer named vice-captain"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-dubai-advantage-criticism-india-vs-australia-semifinal-2688177-2025-03-03",
      "headline": "Dubai is not our home: Rohit Sharma dismisses unfair advantage criticism Speaking to the press ahead of India's semi-final against Australia, captain Rohit Sharma said the Men in Blue playing all their games in Dubai is not giving them any kind of advantage. India remained unbeaten in the group stage, beating New Zealand, Pakistan and Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-bcci-secretary-devajit-saikia-rohit-sharma-congress-shama-mohamed-fat-shaming-2688137-2025-03-03",
      "headline": "Rohit Sharma is fit: BCCI hits back at 'derogatory' fat-shaming comments BCCI secretary Devajit Saikia and vice-president Rajeev Shukla defended Rohit Sharma, asserting that the India captain is among the team's fittest cricketers. The cricket board strongly condemned a post by Congress National Spokesperson Shama Mohamed that fat-shamed Rohit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-varun-chakravarthy-magic-portion-harbhajan-singh-2688111-2025-03-03",
      "headline": "What is Varun Chakravarthy's 'magic portion?' Harbhajan Singh's interesting takeHarbhajan Singh feels that the 'magic portion' in Varun Chakravarthy's bowling is due to the fact that he hasn't played a lot of international cricket. Varun picked up 5 wickets against New Zealand on Sunday, March 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-axar-patel-promoted-batting-position-2688054-2025-03-03",
      "headline": "Axar Patel relishing promoted batting role: Can do well with confidence Axar Patel credited his improved batting confidence to his promoted position in India's lineup, which allowed him to play freely. His crucial 42-run knock against New Zealand proved vital in India's unbeaten Champions Trophy group-stage campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-varun-chakravarthy-good-decision-ashwin-2688042-2025-03-03",
      "headline": "Playing Varun unbelievably good decision from Rohit-Gambhir: R AshwinRavichandran Ashwin praised Rohit Sharma and Gautam Gambhir for backing Varun Chakravarthy against New Zealand. He highlighted how Varun's five-wicket haul could be a game-changer for India's Champions Trophy semi-final against Australia on March 4 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-sunil-gavaskar-prediction-dubai-2688026-2025-03-03",
      "headline": "India will be favourites vs Australia in semi-final on Dubai track: GavaskarSunil Gavaskar feels that India will be the favourites against Australia in the semi-final of the Champions Trophy 2025 as they're playing in Dubai. India continued their fine form in Dubai with another win over New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-australia-semi-final-shreyas-iyer-hundred-s-sreesanth-exclusive-2688008-2025-03-03",
      "headline": "Want to see big hundred from Shreyas Iyer in semi-final vs Australia: S SreesanthFormer India pacer S. Sreesanth has said that he wants to see a big hundred from Shreyas Iyer in India's semi-final against Australia in Dubai in the Champions Trophy 2025. Shreyas is in fine form for India during the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-icc-venue-dubai-south-africa-india-vs-australia-semi-finals-2688005-2025-03-03",
      "headline": "Why is the Champions Trophy venue setup getting so chaotic?South Africa and Australia's early travel to Dubai before their semi-final opponents and venue were confirmed has sparked criticism on the ICC's handling of the Champions Trophy match distribution, especially after the pre-tournament drama involving India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-varun-chakravarthy-press-conference-dubai-2688000-2025-03-03",
      "headline": "Definitely planned out, not luck: Varun Chakravarthy on 5 for 42 vs New ZealandVarun Chakravarthy has claimed that all the wickets he took in the match against New Zealand were planned out and not down to luck. Varun's 5 for 42 did feature Willo Young chopping on to the stumps and Michael Bracewell not reviewing a call that would have seen him extend his time at the crease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-matt-henry-bowled-brilliantly-dubai-advantage-2687985-2025-03-03",
      "headline": "India bowled beautifully despite Dubai advantage: New Zealand's Matt HenryNew Zealand pacer Matt Henry acknowledged India's advantage of playing all their Champions Trophy fixtures at the Dubai International Stadium but credited their bowlers, especially Varun Chakravarthy's five-wicket haul, for securing a dominant win and extending their unbeaten run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-sunil-gavaskar-prediction-dubai-2688026-2025-03-03",
      "headline": "India will be favourites vs Australia in semi-final on Dubai track: GavaskarSunil Gavaskar feels that India will be the favourites against Australia in the semi-final of the Champions Trophy 2025 as they're playing in Dubai. India continued their fine form in Dubai with another win over New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-australia-semi-final-shreyas-iyer-hundred-s-sreesanth-exclusive-2688008-2025-03-03",
      "headline": "Want to see big hundred from Shreyas Iyer in semi-final vs Australia: S SreesanthFormer India pacer S. Sreesanth has said that he wants to see a big hundred from Shreyas Iyer in India's semi-final against Australia in Dubai in the Champions Trophy 2025. Shreyas is in fine form for India during the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-icc-venue-dubai-south-africa-india-vs-australia-semi-finals-2688005-2025-03-03",
      "headline": "Why is the Champions Trophy venue setup getting so chaotic?South Africa and Australia's early travel to Dubai before their semi-final opponents and venue were confirmed has sparked criticism on the ICC's handling of the Champions Trophy match distribution, especially after the pre-tournament drama involving India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-varun-chakravarthy-press-conference-dubai-2688000-2025-03-03",
      "headline": "Definitely planned out, not luck: Varun Chakravarthy on 5 for 42 vs New ZealandVarun Chakravarthy has claimed that all the wickets he took in the match against New Zealand were planned out and not down to luck. Varun's 5 for 42 did feature Willo Young chopping on to the stumps and Michael Bracewell not reviewing a call that would have seen him extend his time at the crease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-matt-henry-bowled-brilliantly-dubai-advantage-2687985-2025-03-03",
      "headline": "India bowled beautifully despite Dubai advantage: New Zealand's Matt HenryNew Zealand pacer Matt Henry acknowledged India's advantage of playing all their Champions Trophy fixtures at the Dubai International Stadium but credited their bowlers, especially Varun Chakravarthy's five-wicket haul, for securing a dominant win and extending their unbeaten run."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}