{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-holdings-shares-hit-all-time-high-rise-70-percent-in-just-4-sessions-2631568-2024-11-11",
      "headline": "JSW Holdings shares hit all-time high, surging 70% in just 4 sessionsJSW Holdings Ltd shares: The rally has positioned the stock as one of the year's top performers, delivering multibagger returns with a 228.18% rise on a year-to-date (YTD) basis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-last-flights-today-bids-farewell-before-air-india-merger-loyalty-program-tickets-2631480-2024-11-11",
      "headline": "Goodbye, Vistara: Airline set for final flight today as it merges with Air IndiaThe Vistara airline began its operations on January 9, 2015, with an inaugural flight from Delhi to Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-surges-past-81000-record-high-reason-what-is-driving-the-surge-us-election-trump-2631448-2024-11-11",
      "headline": "Bitcoin rallies past $81,000. What's driving the surge?Bitcoin surged past $81,000 for the first time, hitting a record high on Monday with its market cap reaching $1.6 trillion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-of-8438-against-us-dollar-trump-us-election-2631433-2024-11-11",
      "headline": "Rupee plunges to all-time low of 84.38 against US dollarThe rupee dropped to a new low of 84.3875 in early trading, surpassing its previous record set last Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-allotment-step-by-step-online-guide-to-check-status-latest-gmp-2631411-2024-11-11",
      "headline": "Swiggy IPO allotment: Step-by-step guide to check status Swiggy IPO allotment: Investors can check their allotment status by logging in to the BSE website or the registrar Link Intime India's portal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-despite-gain-in-it-and-auto-stocks-2631388-2024-11-11",
      "headline": "Sensex, Nifty open flat despite gains in IT and auto stocks The S&P BSE Sensex was down 48.63 points to 79,437.69, while the Nifty50 lost 20.40 points to 24,127.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crazy-capitalist-over-organised-socialist-ruchir-sharma-on-why-billionaires-back-donald-trump-2631143-2024-11-10",
      "headline": "Ruchir Sharma on why billionaires support 'crazy capitalist' Donald TrumpDespite his 'crazy capitalist' persona, Donald Trump's pro-business approach continues to win over America's influential elites and billionaires.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrencies-here-to-stay-as-an-asset-class-says-ruchir-sharma-2630941-2024-11-09",
      "headline": "Cryptocurrencies here to stay as an asset class, says Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained why cryptocurrencies, alongside gold, are emerging as long-term alternatives to traditional assets, particularly the US dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-stimulus-economic-crisis-us-deal-india-stance-interview-ruchir-sharma-2630931-2024-11-09",
      "headline": "China's stimulus may stabilise economy, but won't solve crisis: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma highlighted that China's growth is unlikely to exceed 2.5% annually over the next decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-foreign-investors-outflows-indian-stock-market-2630910-2024-11-09",
      "headline": "Only a weaker dollar will bring foreign investors back to India: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained that the primary factor hindering foreign capital inflows into India is the strength of the dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-donald-trump-india-us-trade-ties-tariff-plans-interview-2630877-2024-11-09",
      "headline": "Should India worry about Donald Trump's tariff plans? Ruchir Sharma explainsRuchir Sharma warned that under Donald Trump, India must brace for a more transactional approach, where deals could be made based on America's interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bookingcom-parent-company-booking-holdings-job-cuts-company-reorganisation-plan-2630694-2024-11-09",
      "headline": "Booking plans job cuts as part of company's reorganisation planBooking Holdings, which owns brands like Booking.com and Kayak, did not disclose how many jobs would be affected but said it expected to provide more details on timing, likely impact on employees and financials \"in due course\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-market-value-rises-electric-automaker-shares-jumped-elon-musk-donald-trump-2630662-2024-11-09",
      "headline": "Elon Musk's Tesla hits $1 trillion market value after Trump winThe electric automaker's shares jumped 8.2 per cent to $321.22, catapulting the company's valuation above the trillion-dollar mark for the first time in more than two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-most-powerful-women-2024-awards-kalli-purie-speech-2630633-2024-11-09",
      "headline": "A woman's soulmate is another woman: Kalli Purie at Business Today MPW 2024Kalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, delivered the vote of thanks at Business Today's Most Powerful Women 2024 awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indias-women-achivers-honoured-at-business-todays-most-powerful-women-2024-awards-2630631-2024-11-09",
      "headline": "Watch: Trailblazers awarded at Business Today's Most Powerful Women 2024Business Today unveiled the 21st edition of its Most Powerful Women in Business list on Friday, celebrating 60 exceptional women leaders who are pioneering change, driving growth, and inspiring progress across diverse industries. This year's edition brings in 12 fresh faces and recognises four returning achievers, underscoring the dynamic nature of leadership in business. Watch the award ceremony here on India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/i-salute-the-trailblazers-kalli-purie-at-business-todays-most-powerful-women-event-2630629-2024-11-09",
      "headline": "I salute the trailblazers: Kalli Purie at Business Today's Most Powerful Women eventKalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, lauded the growing accomplishments and transformation of women leaders in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trailblazers-on-business-today-most-powerful-women-2024-list-2630545-2024-11-08",
      "headline": "Trailblazers on Business Today's Most Powerful Women 2024 listThis year's Business Today Most Powerful Women list introduces 12 new faces, four returning achievers, and 37 repeat honourees from last year. Two trailblazers entered the MPW Hall of Fame after seven-time wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/americans-can-learn-a-lesson-or-two-from-india-piyush-goyal-on-women-representation-2630574-2024-11-08",
      "headline": "Americans can learn a lesson or two from India: Piyush Goyal on women representationUnion Minister of Commerce & Industry Piyush Goyal lauded India's approach to women's empowerment and said that Americans can learn a lesson or two from India on women representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-cut-tariffs-harley-davidson-donald-trump-us-president-2630573-2024-11-08",
      "headline": "Harley-Davidson tariffs to be cut after Trump's return? Piyush Goyal respondsSpeaking at the Business Today's Most Powerful Women 2024 event, Piyush Goyal expressed India's openness to reconsidering the tariffs on the iconic motorcycles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-leaders-share-insights-on-achieving-work-life-balance-and-success-at-bt-mpw-2024-2630562-2024-11-08",
      "headline": "Women leaders share insights on achieving work-life balance and success at BT MPW 2024At the Business Today MPW 2024 session, Ritu Arora, CEO & CIO of Allianz Investment Management, Asia Pacific, Nirupa Shankar, Joint MD of Brigade Group; and Devita Saraf, Chairperson & CEO of Vu Group, shared insights on striking a fine balance between work, life, health and wealth."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-ban-firecrackers-delhi-air-pollution-no-religion-encourages-pollution-2631524-2024-11-11",
      "headline": "No religion encourages pollution: Supreme Court for round-the-year cracker banIn a stern rebuke to the Delhi government over the rampant disregard for the firecracker ban during Diwali, the Supreme Court asked why there wasn't a year-round ban on firecrackers to address the chronic air pollution crisis in the capital.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-caste-politics-opposition-congress-divide-society-2631512-2024-11-11",
      "headline": "PM Modi warns of opposition's caste politics: Attempt to divide societyPrime Minister Narendra Modi emphasised that India needs to be united against such 'national enemies' who are conspiring to divide society to make it a developed nation by 2047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/chief-justice-sanjiv-khanna-profile-important-judgments-supreme-court-2631550-2024-11-11",
      "headline": "Article 370 to Arvind Kejriwal bail: Justice Sanjiv Khanna's defining judgmentsJustice Sanjiv Khanna has been a part of the Supreme Court benches that have delivered important judgements pertaining to elections, bail and personal liberty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-last-flights-today-bids-farewell-before-air-india-merger-loyalty-program-tickets-2631480-2024-11-11",
      "headline": "Goodbye, Vistara: Airline set for final flight today as it merges with Air IndiaThe Vistara airline began its operations on January 9, 2015, with an inaugural flight from Delhi to Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-justice-of-india-justice-sanjiv-khanna-uncle-hr-khanna-denied-post-indira-gandhi-adm-jabalpur-case-emergency-2631506-2024-11-11",
      "headline": "Indira denied Justice HR Khanna CJI's job 50 years ago. His nephew is CJI nowJustice Sanjiv Khanna took oath as the Chief Justice of India (CJI) on Monday. About 50 years ago, Justice HR Khanna, Saniv Khanna's uncle and then the senior-most SC judge, was denied the CJI's post by then Prime Minister Indira Gandhi. A look into why Justice HR Khanna is celebrated as one of India's most fearless judges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-sanjay-manjrekar-gautam-gambhir-press-conference-2631519-2024-11-11",
      "headline": "Manjrekar lashes out at Gautam Gambhir: BCCI should keep him away from pressIn a strongly-worded social media post, former cricketer Sanjay Manjrekar lashed out at Gautam Gambhir, saying the head coach doesn't have the 'right demeanour' to represent the Indian cricket team in press conferences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/joe-biden-beach-walk-stumble-near-fall-delaware-jill-biden-donald-trump-transition-talks-2631491-2024-11-11",
      "headline": "Watch: Biden stumbles, nearly takes a tumble during stroll on sandy beachThe 81-year-old US President was seen repeatedly losing his balance as he navigated the loose, uneven sand at the beach, with his wife Jill reaching out to steady him at one point."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/yogendra-yadav-criticises-air-india-shares-very-sad-experience-airline-reacts-2631453-2024-11-11",
      "headline": "Yogendra Yadav criticises Air India, shares 'very sad experience' with airline In a post on X, Yogendra Yadav shared that while he usually avoids posting personal grievances publicly, this incident with Air India \"is worth recording\" as it \"may be of use to others.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zomato-delivery-food-restaurants-food-rescue-feature-deepinder-goel-x-new-feature-unbeatable-price-discount-2631532-2024-11-11",
      "headline": "Zomato to sell food at unbeaten price to cut cancelled-orders wastageA new feature by food delivery app Zomato intending to cut food wastage plans to provide cancelled orders at greatly reduced prices. The 'food rescue' plan comes amid 4 lakh orders getting cancelled a month. This is how Zomato's new feature will work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/is-sunita-williamss-health-deteriorating-in-space-heres-the-latest-update-2631518-2024-11-11",
      "headline": "Is Sunita Williams's health on a decline in space? Latest update hereThe concerns arose after recent images of Williams appeared to show significant weight loss, with some describing her as looking \"gaunt\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-4-suggestions-zomato-food-rescue-job-offer-deepinder-goyal-2631526-2024-11-11",
      "headline": "Bengaluru man's 4 suggestions for Zomato get him a job offer from Deepinder GoyalIn a bid to reduce food wastage, Zomato introduced Food Rescue, which allows users to buy cancelled orders at a discounted price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-putin-call-russia-ukraine-war-zelenskyy-2631325-2024-11-11",
      "headline": "Donald Trump spoke to Putin, told him not to escalate war in Ukraine: ReportAccording to a report by The Washington Post, Trump took the call from his resort in Florida, and advised Putin not to escalate the war in Ukraine. He also reminded Putin of Washington's sizeable military presence in Europe"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/taylor-swift-jimin-of-bts-and-lisa-shine-at-mtv-emas-2024-full-list-of-winners-2631527-2024-11-11",
      "headline": "Taylor Swift, Jimin of BTS and Lisa shine at MTV EMA 2024Taylor Swift and Tyla were big winners at the 2024 MTV Europe Music Awards (EMAs). Korean singers Jimin and Lisa also took home awards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/robot-dogs-now-guarding-donald-trump-house-after-his-us-election-win-2631530-2024-11-11",
      "headline": "Robot dogs now guarding Donald Trump house after his US election winAfter Donald Trump's election victory, his Mar-a-Lago estate now features a robot dog as part of heightened security measures by the Secret Service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-2024-revdi-freebie-list-mahayuti-mva-ladki-banin-eknath-shinde-2630830-2024-11-11",
      "headline": "How MVA compelled Mahayuti to scale up revdi promises in MaharashtraIn the fight for Maharashtra, India's richest state, there is a bitter battle of 'revdis'. The BJP-led Mahayuti has been forced to promise higher cash dole after big guarantees by the Congress-led Maha Vikas Aghadi. Here's a look at who's promising what ahead of the Maharashtra Assembly election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-kl-rahul-rohit-sharma-border-gavaskar-trophy-aus-vs-ind-2631465-2024-11-11",
      "headline": "Gautam Gambhir continues to back KL Rahul: How many teams have a player like him?India head coach Gautam Gambhir has continued to back their star batter KL Rahul who's been undergoing terrible form hailing him for his versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-bangar-child-aryan-to-anaya-transwoman-cricket-instagram-2631513-2024-11-11",
      "headline": "Aryan to Anaya: Sanjay Bangar's child shares hormonal transformation journeyAnaya Bangar, former cricketer Sanjay Bangar's child, shared her journey as a transgender woman, highlighting hormone therapy's impact on her cricket career and advocating for inclusive policies in the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-navnirman-sena-chief-raj-thackeray-mns-assembly-election-mahayuti-bjp-shiv-sena-mumbai-2631554-2024-11-11",
      "headline": "Raj Thackeray finds comfort zone with BJP, says fighting polls to show strengthMNS chief Raj Thackeray, ahead of the Maharashtra Assembly elections, stated his natural affinity for the BJP and emphasised his party's solo contest to demonstrate its strength."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/perimenopause-struggles-why-losing-weight-gets-tougher-than-ever-2631495-2024-11-11",
      "headline": "Why losing weight becomes harder than ever in perimenopauseWomen in their 40s and 50s (sometimes even in their 30s) often struggle with belly fat due to slowed metabolism and hormonal changes during perimenopause. Experts help understand why this happens and what can be done about it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/who-is-arsh-dalla-khalistani-terrorist-hardeep-nijjar-aide-arrest-canada-2631442-2024-11-11",
      "headline": "Who is Arsh Dalla, Khalistani terrorist and Nijjar aide, arrested in Canada? Arsh Dalla has been leading the banned Khalistan Tiger Force (KTF) since the killing of Khalistani terrorist Hardeep Singh Nijjar last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/new-maruti-suzuki-dzire-5-star-safety-rated-sedan-launched-price-features-mileage-engine-complete-details-2631414-2024-11-11",
      "headline": "New Maruti Suzuki Dzire launched in India2024 Maruti Suzuki Dzire will directly lock horns with the Hyundai Aura, Honda Amaze and Tata Tigor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-kl-rahul-rohit-sharma-gautam-gambhir-shubman-gill-abhimanyu-easwaran-perth-test-2630427-2024-11-11",
      "headline": "AUS vs IND: Can India bet on KL Rahul in Rohit Sharma's absence for 1st Test?Star India batter KL Rahul has been going through a rough patch in Test cricket in the past few months. Can the team management bank on him to open in place of Rohit Sharma for the first Test in Perth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jadavpur-university-professor-mainak-pal-kolkata-found-dead-uttarakhand-west-bengal-2631438-2024-11-11",
      "headline": "Jadavpur University professor found dead with throat slit in Uttarakhand hotelMainak Pal, a professor in the Philosophy Department at Jadavpur University, was found dead in the washroom of a hotel in Uttarakhand, with deep cuts on his neck and hands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chief-minister-siddaramaiah-dares-prime-minister-modi-to-prove-rs-700-cr-excise-scam-in-karnataka-2631401-2024-11-11",
      "headline": "Will quit if proven: Siddaramaiah on excise funds being used in Maharashtra pollsThe Karnataka Chief Minister's response was to PM Modi's charge that the Congress was collecting Rs 700 crore from liquor shop owners to fund the party's election campaign in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/veteran-tamil-actor-delhi-ganesh-cremated-with-air-force-honours-watch-video-2631546-2024-11-11",
      "headline": "Veteran Tamil actor Delhi Ganesh cremated with Air Force honoursDelhi Ganesh, a veteran Tamil actor and former Indian Air Force officer, was cremated in Chennai with full military honours. He died on November 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-shares-why-he-lives-in-a-rented-house-despite-working-for-40-years-2631551-2024-11-11",
      "headline": "Anupam Kher shares why he lives in a rented house despite working for 40 yearsActor Anupam Kher talked about not believing in owning any property for himself. The 69-year-old actor mentioned buying a house for his mother, but living in a rented apartment himself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/sudha-murty-shares-why-she-flies-economy-and-not-business-kapil-sharma-show-2631549-2024-11-11",
      "headline": "Sudha Murty shares why she prefers flying economy over business classNarayana and Sudha Murty discussed their difference of opinion on The Great Indian Kapil Show, including flying preferences. The couple also revisited their love story on the show.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/taylor-swift-jimin-of-bts-and-lisa-shine-at-mtv-emas-2024-full-list-of-winners-2631527-2024-11-11",
      "headline": "Taylor Swift, Jimin of BTS and Lisa shine at MTV EMA 2024Taylor Swift and Tyla were big winners at the 2024 MTV Europe Music Awards (EMAs). Korean singers Jimin and Lisa also took home awards. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-cannot-happen-without-india-says-aakash-chopra-after-bccis-stance-2631553-2024-11-11",
      "headline": "Champions Trophy can't happen without India: Aakash Chopra after BCCI's stanceFormer India cricketer Aakash Chopra said that the Champions Trophy cannot happen without India. India will not travel to Pakistan for the Champions Trophy, the ICC has informed Pakistan Cricket Board via an official email,"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/javed-miandad-pakistan-cricket-board-icc-champions-trophy-2025-bcci-2631542-2024-11-11",
      "headline": "Pakistan cricket will not only survive but prosper without India: Javed MiandadFormer Pakistan cricketer Javed Miandad has made a bold statement after India's reluctance to travel to Pakistan for Champions Trophy 2025 saying that Pakistan cricket can survive without India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanjay-bangar-child-aryan-to-anaya-transwoman-cricket-instagram-2631513-2024-11-11",
      "headline": "Aryan to Anaya: Sanjay Bangar's child shares hormonal transformation journeyAnaya Bangar, former cricketer Sanjay Bangar's child, shared her journey as a transgender woman, highlighting hormone therapy's impact on her cricket career and advocating for inclusive policies in the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-sanjay-manjrekar-gautam-gambhir-press-conference-2631519-2024-11-11",
      "headline": "Manjrekar lashes out at Gautam Gambhir: BCCI should keep him away from pressIn a strongly-worded social media post, former cricketer Sanjay Manjrekar lashed out at Gautam Gambhir, saying the head coach doesn't have the 'right demeanour' to represent the Indian cricket team in press conferences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-manager-ruben-amorim-ready-difficult-challenge-manchester-united-2631515-2024-11-11",
      "headline": "Incoming manager Amorim ready for difficult challenge at Manchester UnitedNew Manchester United head coach Ruben Amorim admits he has no illusions about the challenges that await him in England but says he is eager to take them on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-gautam-gambhir-sa-vs-ind-gqeberha-2631502-2024-11-11",
      "headline": "Varun Chakravarthy reveals Gambhir's words of clarity after career turnaroundIndia wrist spinner Varun Chakravarthy revealed how head coach Gautam Gambhir gave him clarity about his role in the team after a magnificent five wicket haul in the second T20I vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-didnt-care-about-losing-pak-series-clarke-on-resting-key-players-for-3rd-odi-2631500-2024-11-11",
      "headline": "We didn't care about losing vs Pak: Clarke on resting key players for 3rd ODIMichael Clarke pointed out that Australia didn't care about losing an ODI bilateral series against Pakistan as they rested key players in the series decider. Pakistan registered an ODI series win in Australia after 22 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-south-africa-varun-chakravarthy-heroics-2nd-t20i-2631492-2024-11-11",
      "headline": "Varun Chakravarthy 2.0: How spinner rebooted himself to find success in T20sSA vs IND: India spinner Varun Chakravarthy took his maiden 5-wicket-haul in T20I cricket on Sunday, 10 November. Varun explained how he completely changed his technique after getting dropped from the Indian team, back in 2021.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-kl-rahul-rohit-sharma-gautam-gambhir-shubman-gill-abhimanyu-easwaran-perth-test-2630427-2024-11-11",
      "headline": "AUS vs IND: Can India bet on KL Rahul in Rohit Sharma's absence for 1st Test?Star India batter KL Rahul has been going through a rough patch in Test cricket in the past few months. Can the team management bank on him to open in place of Rohit Sharma for the first Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-world-cup-holders-are-getting-ready-vs-india-tim-paine-after-odi-series-loss-2631467-2024-11-11",
      "headline": "The World Cup holders are getting ready vs India: Paine after ODI series lossTim Paine reacted to the criticism over Australia's ODI series loss vs Pakistan at home. He said that the ODI World Cup holders are preparing for the India challenge in the upcoming Border Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-kl-rahul-rohit-sharma-border-gavaskar-trophy-aus-vs-ind-2631465-2024-11-11",
      "headline": "Gautam Gambhir continues to back KL Rahul: How many teams have a player like him?India head coach Gautam Gambhir has continued to back their star batter KL Rahul who's been undergoing terrible form hailing him for his versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-didnt-care-about-losing-pak-series-clarke-on-resting-key-players-for-3rd-odi-2631500-2024-11-11",
      "headline": "We didn't care about losing vs Pak: Clarke on resting key players for 3rd ODIMichael Clarke pointed out that Australia didn't care about losing an ODI bilateral series against Pakistan as they rested key players in the series decider. Pakistan registered an ODI series win in Australia after 22 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-south-africa-varun-chakravarthy-heroics-2nd-t20i-2631492-2024-11-11",
      "headline": "Varun Chakravarthy 2.0: How spinner rebooted himself to find success in T20sSA vs IND: India spinner Varun Chakravarthy took his maiden 5-wicket-haul in T20I cricket on Sunday, 10 November. Varun explained how he completely changed his technique after getting dropped from the Indian team, back in 2021.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-kl-rahul-rohit-sharma-gautam-gambhir-shubman-gill-abhimanyu-easwaran-perth-test-2630427-2024-11-11",
      "headline": "AUS vs IND: Can India bet on KL Rahul in Rohit Sharma's absence for 1st Test?Star India batter KL Rahul has been going through a rough patch in Test cricket in the past few months. Can the team management bank on him to open in place of Rohit Sharma for the first Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-world-cup-holders-are-getting-ready-vs-india-tim-paine-after-odi-series-loss-2631467-2024-11-11",
      "headline": "The World Cup holders are getting ready vs India: Paine after ODI series lossTim Paine reacted to the criticism over Australia's ODI series loss vs Pakistan at home. He said that the ODI World Cup holders are preparing for the India challenge in the upcoming Border Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-kl-rahul-rohit-sharma-border-gavaskar-trophy-aus-vs-ind-2631465-2024-11-11",
      "headline": "Gautam Gambhir continues to back KL Rahul: How many teams have a player like him?India head coach Gautam Gambhir has continued to back their star batter KL Rahul who's been undergoing terrible form hailing him for his versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-press-conference-full-text-india-coach-border-gavaskar-trophy-australia-2631440-2024-11-11",
      "headline": "Gautam Gambhir presser full text: What the coach said before Australia tourBorder-Gavaskar Trophy: Before departing for Australia, India head coach Gautam Gambhir addressed a press conference in Mumbai, confidently fielding tough questions with straightforward—and blunt—answers. However, he left fans disappointed by not confirming Rohit Sharma's availability for the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gerald-cooetzee-is-getting-some-ipl-attention-dale-steyn-hails-all-round-heroics-2631446-2024-11-11",
      "headline": "Gerald Cooetzee is getting some IPL attention: Dale Steyn hails all-round heroicsDale Steyn hailed Gerald Cooetzee for his all-round heroics vs India in the T20I series so far. Steyn said that the all-rounder would be on the radar of IPL franchises ahead of the IPL 2025 mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-dinesh-karthik-champions-trophy-2025-sa-vs-ind-2631441-2024-11-11",
      "headline": "Dinesh Karthik demands Varun Chakravarthy's selection for Champions Trophy 2025Former India wicketkeeper batter Dinesh Karthik has asked for wrist spinner Varun Chakravarthy's selection in the team for the Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-gautam-gambhir-pre-departure-press-conference-border-gavaskar-trophy-2631421-2024-11-11",
      "headline": "Gautam Gambhir plays down pressure, backs Virat and Rohit to shine in AustraliaAhead of the Border-Gavaskar Trophy in Australia, India's head coach Gautam Gambhir attended a press conference in Mumbai, where he confidently addressed tough questions. While he defended under-pressure captain Rohit Sharma and star batter Virat Kohli, affirming their \"incredible hunger\" to perform, Gambhir did not confirm Rohit's availability for the first Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-social-media-border-gavaskar-trophy-2024-25-aus-vs-ind-2631419-2024-11-11",
      "headline": "What difference does social media make: Gambhir 'not feeling the heat' after NZ lossIndia head coach Gautam Gambhir has shrugged off social media criticism after a tumultuous start to his coaching tenure of the Indian Cricket Team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-arrives-in-perth-ahead-of-1st-test-vs-australia-squad-coming-in-batches-2631412-2024-11-11",
      "headline": "Virat Kohli arrives in Perth ahead of 1st Test, squad coming in batchesVirat Kohli landed in Perth ahead of the 1st Test vs Australia, starting November 22. The jumbo squad left in two batches and Kohli was the first Indian player to arrive in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-will-lead-india-if-rohit-sharma-is-unavailable-coach-gautam-gambhir-2631395-2024-11-11",
      "headline": "Jasprit Bumrah will lead India if Rohit Sharma is unavailable: Coach Gautam GambhirBorder-Gavaskar Trophy: India head coach Gautam Gambhir has confirmed that Jasprit Bumrah will lead India if Rohit Sharma misses the first Test against Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-availability-for-1st-test-vs-australia-gautam-gambhir-unsure-2631379-2024-11-11",
      "headline": "India coach Gautam Gambhir hopeful of Rohit Sharma's participation in Perth TestTeam India head coach Gautam Gambhir was hopeful about captain Rohit Sharma's availability for the 1st Test vs Australia. The Indian captain might miss the Perth Test for personal reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-social-media-border-gavaskar-trophy-2024-25-aus-vs-ind-2631419-2024-11-11",
      "headline": "What difference does social media make: Gambhir 'not feeling the heat' after NZ lossIndia head coach Gautam Gambhir has shrugged off social media criticism after a tumultuous start to his coaching tenure of the Indian Cricket Team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-arrives-in-perth-ahead-of-1st-test-vs-australia-squad-coming-in-batches-2631412-2024-11-11",
      "headline": "Virat Kohli arrives in Perth ahead of 1st Test, squad coming in batchesVirat Kohli landed in Perth ahead of the 1st Test vs Australia, starting November 22. The jumbo squad left in two batches and Kohli was the first Indian player to arrive in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-will-lead-india-if-rohit-sharma-is-unavailable-coach-gautam-gambhir-2631395-2024-11-11",
      "headline": "Jasprit Bumrah will lead India if Rohit Sharma is unavailable: Coach Gautam GambhirBorder-Gavaskar Trophy: India head coach Gautam Gambhir has confirmed that Jasprit Bumrah will lead India if Rohit Sharma misses the first Test against Australia in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharmas-availability-for-1st-test-vs-australia-gautam-gambhir-unsure-2631379-2024-11-11",
      "headline": "India coach Gautam Gambhir hopeful of Rohit Sharma's participation in Perth TestTeam India head coach Gautam Gambhir was hopeful about captain Rohit Sharma's availability for the 1st Test vs Australia. The Indian captain might miss the Perth Test for personal reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-gautam-gambhir-ricky-ponting-virat-kohli-criticism-2631378-2024-11-11",
      "headline": "Gautam Gambhir hits out at Ricky Ponting over Virat Kohli criticismIndia head coach Gautam Gambhir has backed senior players Rohit Sharma and Virat Kohli amid their poor form and said that Ricky Ponting should only focus on Australian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bring-ramandeep-singh-on-at-number-8-robin-uthhappa-after-indias-gqeberha-loss-2631355-2024-11-11",
      "headline": "Bring Ramandeep on at number 8: Uthhappa after India's Gqeberha lossRobin Uthappa suggests India should bring in Ramandeep Singh at No. 8 to bolster their lower-order batting depth, a missing element that contributed to their T20I loss against South Africa. His all-round capabilities could prove crucial in upcoming matches.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-press-conference-live-updates-november-11-mumbai-ind-vs-aus-border-gavaskar-trophy-2631354-2024-11-11",
      "headline": "Highlights: Will Rohit Sharma play Perth Test? What coach Gautam Gambhir saidGautam Gambhir Press Conference Highlights: India men's team head coach Gautam Gambhir has addressed Rohit Sharma's participation, India's challenging Australia tour and the form of Virat Kohli in a pre-departure press conference before leaving for Australia ahead of the high-octane Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-played-terrible-shots-boucher-critical-despite-stubbs-brilliance-2631353-2024-11-11",
      "headline": "South Africa played terrible shots: Boucher critical despite Stubbs' brillianceFormer South Africa player Mark Boucher believed that the team played terrible shots to make their life difficult in a 125-run chase against India. Boucher lauded Tristan Stubbs, who kept a cool head and guided SA to a victory.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}