{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-at-strongest-since-october-2024-as-it-breaks-84-per-dollar-mark-2718379-2025-05-02",
      "headline": "Rupee at strongest since October 2024 as it breaks 84/dollar markThis marks a nearly 2% weekly gain for the rupee, powered by a sustained rally in Indian equities and growing optimism over an early US-India trade deal under the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-zomato-eternal-shares-are-rising-despite-78-percent-drop-in-q4-profit-2718371-2025-05-02",
      "headline": "Zomato shares rise despite 78% drop in Q4 profit. Should you buy, hold or sell?Eternal posted revenue of Rs 5,830 crore, broadly in line with analyst estimates. EBITDA margin slipped to 1.2%—falling short of expectations—but the company managed to maintain stable contribution margins in both food delivery and quick commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-share-price-rise-5-percent-enterprises-good-q4-results-boost-adani-stocks-2718368-2025-05-02",
      "headline": "Adani Group stocks rise up to 5%. Here's whyAdani Enterprises' shares climbed more than 2% on Friday after the company reported an increase in its net profit for the January–March quarter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-wall-street-rally-boosts-global-markets-2718360-2025-05-02",
      "headline": "Sensex gains 900 points. 3 reasons why stock market is rising todayThe S&P BSE Sensex was up 867.48 points at 81,109.72 around 10 am, while the NSE Nifty50 gained 247.90 points to trade at 24,582.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-jumps-450-points-nifty-above-24400-adani-ports-up-4-percent-2718356-2025-05-02",
      "headline": "Sensex, Nifty soar as trade deal hopes lift sentiment; FII buying boosts rallyThe S&P BSE Sensex went past the 81,000 mark while NSE Nifty50 was close to surpassing 24,600 level as Dalal Street surged in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-check-allotment-status-online-guide-latest-gmp-listing-gain-market-debut-date-2718355-2025-05-02",
      "headline": "Ather Energy IPO: Check allotment status, latest GMP and listing dateThe total number of bids received was 7,67,49,068 against the offer of 5,11,22,370 shares. Through the IPO, Ather Energy raised Rs 2,980.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-rise-or-fall-may-2-nse-bse-trading-fii-buying-2718350-2025-05-02",
      "headline": "Stock market opening today: Will Sensex, Nifty rise or fall on May 2?In the last two sessions, both Sensex and Nifty ended slightly lower. There was uncertainty among investors due to rising tension between India and Pakistan. However, markets are expected to start the day on a stronger note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-focus-eternal-zomato-tata-motors-adani-enterprises-infosys-mahindra-q4-2718333-2025-05-02",
      "headline": "Stocks to watch: Eternal, Tata Motors, Adani Enterprises, Infosys, MahindraBoth the Sensex and Nifty ended slightly lower in the last session, as cautious sentiment prevailed among investors over rising India-Pakistan tension. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-losses-pakistan-airspace-closure-shut-consequences-pahalgam-terror-attack-2718279-2025-05-01",
      "headline": "Air India expects $600 million in losses if Pak airspace shut for a year: ReportThe closure of Pakistani airspace for a year would result in losses of USD 600 million for the country's national carrier, Air India, news agency PTI reported, citing sources. The airline has sought the government's assistance to address the challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-makes-pravaah-portal-mandatory-for-financial-institutions-starting-may-2025-2718086-2025-05-01",
      "headline": "RBI makes PRAVAAH portal mandatory for financial institutions starting May 1The PRAVAAH portal provides all necessary forms, along with simple instructions. Users can submit their application, track its progress, and even get alerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gst-collection-record-high-april-data-rs-237-lakh-crore-rise-126-percent-tax-2718033-2025-05-01",
      "headline": "GST collections hit record Rs 2.37 lakh crore in April, up 12.6%In March, GST collections stood at Rs 1.96 lakh crore, showing a 9.9% rise from the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodha-founder-and-ceo-nithin-kamath-exposes-whatsapp-investment-scam-using-his-name-to-dupe-investors-details-here-2718012-2025-05-01",
      "headline": "Nithin Kamath exposes this scam using his name to dupe investors. Details hereZerodha's CEO Nithin Kamath has urged investors to stay alert, always check the source, and never act on random financial advice sent on messaging apps."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-to-those-harassing-kashmiris-you-are-validating-pak-propaganda-2718418-2025-05-02",
      "headline": "Javed Akhtar to those 'harassing Kashmiris': You are validating Pak propagandaPoet and lyricist Javed Akhtar recalled the Kargil War with Pakistan and blamed the neighbours for never wanting peace with India. He spoke at an event and slammed those 'harassing Kashmiris' after the Pahalgam terrorist attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-roasts-karan-johar-parenting-and-sports-skills-at-waves-summit-2025-2718393-2025-05-02",
      "headline": "SRK roasts Karan Johar's parenting and sports skills: You get trained firstAt the WAVES Summit 2025, Shah Rukh Khan playfully roasted Karan Johar during a fun-filled chat about parenting and attending their children's school events. Their friendship and fun banter stole the show, leaving the audience in splits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-thanks-fans-for-all-the-birthday-love-2718391-2025-05-02",
      "headline": "Anushka Sharma thanks fans for all the birthday love. See postActor Anushka Sharma shared a picture of herself on social media to express gratitude for the love she received on her birthday. The actor turned 37 on May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-pushpa-pose-being-first-south-indian-actor-to-sport-six-packs-waves-summit-2718382-2025-05-02",
      "headline": "Allu Arjun recreates Pushpa pose, admits being 1st South star with six-pack absAllu Arjun was one of the chief guests at WAVES Summit 2025 on Thursday in Mumbai. The actor recreated his iconic Pushpa pose, which received cheers from audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-vs-retro-box-office-collection-day-1-detailed-report-nani-and-suriya-films-make-a-roaring-start-2718380-2025-05-02",
      "headline": "HIT 3 vs Retro box office Day 1: Nani and Suriya's films make a roaring start 'HIT: The Third Case' and 'Retro' have taken over the box office in the South industry. Both films began on a solid note, with a double-digit opening, and are looking at fabulous first-weekend figures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sparsh-shrivastava-music-debut-ji-huzoor-tv-stint-facing-rejection-exclusive-2718209-2025-05-02",
      "headline": "Has Sparsh Shrivastava faced bias due to TV background? Actor answersSparsh Shrivastava, known for his roles in 'Laapataa Ladies' and 'Dupahiya', has ventured into music with his single 'Ji Huzoor', showcasing his diverse talents. In an exclusive interview, he opened up about his TV stint, facing rejections and pursuing music seriously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/hania-aamir-reacts-fake-post-blaming-pakistan-army-pahalgam-terror-attack-2718366-2025-05-02",
      "headline": "Assigning blame without proof...: Hania Aamir's dig at India over Pahalgam attackPakistani actor Hania Aamir, taking a swipe at India for holding Pakistan accountable for the Pahalgam attack, asserted that assigning blame without proof only 'deepens the divide'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-1-detailed-report-ajay-devgn-film-opens-strong-raises-bollywood-hopes-2718361-2025-05-02",
      "headline": "Raid 2 box office Day 1: Ajay Devgn's film opens strong, raises Bollywood's hopesAjay Devgn's 'Raid 2' has begun its box office journey on a fabulous note. The film received mixed reviews, but the audience gave it a positive chance to work well. It could be the first Bollywood film of the year to be looking at reaching the benchmark of Rs 100 crore in a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-racing-comeback-driver-team-owner-2718349-2025-05-02",
      "headline": "Ajith Kumar opens up about racing comeback and looking beyond films | ExclusiveAjith Kumar opened up about his dual career as a racing driver and team owner, revealing his passion for motorsports despite past challenges. He shared insights into his aspirations and the support he receives from family and teammates, in an exclusive chat with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/british-comedian-russell-brand-to-appear-in-london-court-today-on-rape-charges-2718336-2025-05-02",
      "headline": "British comedian Russell Brand to appear in London court today on rape chargesBritish actor-comedian Russell Brand will appear in a London court after being charged with rape and sexual assault in cases related to four women over two decades ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-help-to-fix-her-dress-from-mira-rajput-viral-video-waves-summit-2025-2718335-2025-05-02",
      "headline": "Mira Rajput lends helping hand to Deepika Padukone in adorable viral videoShahid Kapoor's wife Mira Rajput helped Deepika Padukone fix her dress at the WAVES summit 2025, held on Thursday in Mumbai. The viral video of the two from the event has emerged on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/selena-gomez-reflects-on-justin-bieber-breakup-and-finding-love-with-benny-blanco-glbs-2718315-2025-05-02",
      "headline": "Selena Gomez Reflects on Justin Bieber breakup and finding love with Benny BlancoSelena Gomez reflects on her journey of heartbreak following her breakup with Justin Bieber. Now engaged to Benny Blanco, she says she has found emotional peace, joy, and lasting love.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jeremy-renner-slams-disney-over-pay-cut-for-hawkeye-season-2-glbs-2718314-2025-05-02",
      "headline": "Jeremy Renner slams Disney over pay cut for Hawkeye Season 2 Jeremy Renner claims Disney offered him half the pay for Hawkeye Season 2 following his near-fatal accident, calling the offer insulting. Disney sources disputed his version but offered no details.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/all-about-met-gala-2025-theme-dress-code-and-star-co-chairs-glbs-2718311-2025-05-02",
      "headline": "All about Met Gala 2025: Theme, dress code, and star co-chairsThe 2025 Met Gala returns May 5 with the theme \"Superfine: Tailoring Black Style,\" honoring Black fashion. Co-chaired by celebrities, it celebrates heritage, history, and bold menswear creativity.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-rejects-plea-deal-faces-life-sentence-in-federal-sex-trafficking-trial-glbs-2718295-2025-05-02",
      "headline": "Diddy rejects plea deal, faces life sentence in federal sex trafficking trialSean \"Diddy\" Combs has rejected a federal plea deal and will face trial next week on sex trafficking and racketeering charges. He denies all allegations and pleads not guilty.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-piece-animator-sota-shigetsugu-blasts-toei-animation-sound-team-2718193-2025-05-01",
      "headline": "One Piece animator wants sound team of anime to be 'immediately fired'One Piece animator Sota Shigetsugu has sparked controversy by criticising the sound team for their 'unprofessional' work in the latest episode of the anime. The criticism comes after the release of Episode 1127, where the sound effects were deemed outdated and poorly executed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/tourist-family-review-sasikumar-simran-beautiful-emotional-drama-all-white-and-pure-love-2718167-2025-05-01",
      "headline": "Tourist Family review: Sasikumar-Simran film is all white and pure loveReleased-Thu May 01, 2025Tourist Family review: Director Abishan Jeevinth's 'Tourist Family' starring Sasikumar, Simran, Mithun Jai Shankar and Kamalesh, is a beautiful drama about humanity. It's also a brilliant example of what simple films can evoke in you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-on-retirement-padman-bhushan-exclusive-interview-2718153-2025-05-01",
      "headline": "Ajith Kumar reflects on life and retirement after Padma Bhushan honourTamil star Ajith Kumar, who recently received the Padma Bhushan, shared insights on his approach to life and retirement, emphasising the value of making the most of every moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-weighs-in-on-insider-vs-outsider-debate-i-have-a-problem-2718099-2025-05-01",
      "headline": "Shah Rukh Khan weighs in on insider vs outsider debate: I have a problemShah Rukh Khan recently weighed in on the insider vs outsider debate at the WAVES Summit 2025. The actor mentioned how he has a problem with the distinction. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-unveils-vizhinjam-international-seaport-in-kerala-india-1st-trans-shipment-hub-2718414-2025-05-02",
      "headline": "PM unveils Vizhinjam seaport in Kerala, India's 1st transhipment hubPrime Minister Narendra Modi officially inaugurated the Vizhinjam International Seaport in Kerala's Thiruvananthapuram on Friday. The seaport was completed at an estimated cost of Rs 8,867 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-entry-financial-action-task-force-grey-list-terror-funding-pahalgam-attack-2718402-2025-05-02",
      "headline": "India plans twin financial strikes on Pakistan to curb terror funding: SourcesIn the wake of the Pahalgam terror attack, sources said India is likely to actively pursue getting Pakistan back onto the Financial Action Task Force (FATF) grey list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/weather-forecast-severe-thunderstorm-and-rain-alert-in-parts-of-north-east-south-india-2718299-2025-05-02",
      "headline": "Over 100 flights delayed, 4 dead as rain, strong winds batter Delhi-NCRDelhi-NCR was hit by heavy rainfall coupled with severe thunderstorms and gusty winds early on Friday. An orange alert is in place in the national capital, with flights being delayed due to the inclement weather conditions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rivers-in-pakistan-arent-drying-yet-here-is-why-2718197-2025-05-01",
      "headline": "Rivers in Pakistan aren't drying yet. Here's whyOfficial data and satellite imagery processed by India Today's Open-Source Intelligence (OSINT) team suggest rivers allocated to Pakistan under the IWT – the Indus, Chenab, and Jhelum (collectively called Western rivers) – continued to flow their normal course and speed as of April 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/hania-aamir-reacts-fake-post-blaming-pakistan-army-pahalgam-terror-attack-2718366-2025-05-02",
      "headline": "Assigning blame without proof...: Hania Aamir's dig at India over Pahalgam attackPakistani actor Hania Aamir, taking a swipe at India for holding Pakistan accountable for the Pahalgam attack, asserted that assigning blame without proof only 'deepens the divide'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indias-response-to-pahalgam-terror-attack-should-avoid-regional-war-jd-vance-glbs-2718312-2025-05-02",
      "headline": "India's response to Pahalgam terror attack should avoid regional war: JD VanceUnderlining that India's response to last week's Pahalgam attack should avoid the risk of a broader regional conflict, US Vice President JD Vance hoped that Pakistan would work with India to track down terrorists who carried out the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-wall-street-rally-boosts-global-markets-2718360-2025-05-02",
      "headline": "Sensex gains 900 points. 3 reasons why stock market is rising todayThe S&P BSE Sensex was up 867.48 points at 81,109.72 around 10 am, while the NSE Nifty50 gained 247.90 points to trade at 24,582.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-debunks-air-force-officers-sacking-claims-on-not-fighting-war-against-pak-2718313-2025-05-02",
      "headline": "Government fact-checks claims of Air Force officer's sacking over Pak war stanceThe government fact-checked claims by several pro-Pakistan social media accounts that said that Vice Chief of Air Staff Air Marshal Sujeet Pushpakar Dharkar was sacked for refusing to fight a war against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bjp-caste-census-strike-why-did-modi-government-make-a-u-turn-2718168-2025-05-01",
      "headline": "BJP's caste census strike: Why did Modi government make a U-turn?The Bharatiya Janata Party-led Centre has announced it will conduct a caste census in a decision that has surprised the Opposition and political analysts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-pm-modi-thiruvananthapuram-airport-vizhinjam-seaport-kerala-2718294-2025-05-02",
      "headline": "Shashi Tharoor receives PM in Kerala, takes dig at 'dysfunctional' Delhi airportCongress MP Shashi Tharoor, a four-time lawmaker from Kerala's Thiruvananthapuram, said he \"managed to land in time\" to receive Prime Minister Narendra Modi in the city and slammed the Delhi airport for flight delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-at-strongest-since-october-2024-as-it-breaks-84-per-dollar-mark-2718379-2025-05-02",
      "headline": "Rupee at strongest since October 2024 as it breaks 84/dollar markThis marks a nearly 2% weekly gain for the rupee, powered by a sustained rally in Indian equities and growing optimism over an early US-India trade deal under the Trump administration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-losses-pakistan-airspace-closure-shut-consequences-pahalgam-terror-attack-2718279-2025-05-01",
      "headline": "Air India expects $600 million in losses if Pak airspace shut for a year: ReportThe closure of Pakistani airspace for a year would result in losses of USD 600 million for the country's national carrier, Air India, news agency PTI reported, citing sources. The airline has sought the government's assistance to address the challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/amaravati-proposed-andhra-pradesh-greenfield-capital-city-construction-relaunch-revival-2718268-2025-05-02",
      "headline": "Amaravati revived: All you need to know about Andhra Pradesh's capital in makingAfter years of uncertainty, development of Andhra Pradesh's capital Amaravati is back on track. Revived by Chief Minister Chandrababu Naidu's 2024 return to power and fresh funding, Prime Minister Narendra Modi will relaunch the construction work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/west-bengal-madhyamik-result-2025-wbbse-10th-result-pass-percentage-toppers-2718274-2025-05-02",
      "headline": "WBBSE Madhyamik 10th Result 2025 Live Declared: 86.56% pass WB Class 10th board result, Raiganj boy tops, check link WB Madhyamik Result 2025: The WBBSE 10th Result has been declared today at 9 am on the official websites and India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-opens-attari-wagah-border-gate-after-24-hours-begins-taking-back-citizens-deported-india-pahalgam-terror-attack-2718396-2025-05-02",
      "headline": "Pak opens Attari-Wagah border gate, begins taking back its citizens from IndiaThe move came after nearly 24 hours of silence from Islamabad, during which several Pakistani nationals - many of them elderly or visiting family - were left in limbo on Indian soil despite New Delhi's readiness to facilitate their return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/will-tariffs-make-iphones-more-expensive-tim-cook-reveals-2718347-2025-05-02",
      "headline": "Will tariffs make iPhones more expensive? Tim Cook revealsApple has recently opened about the US-imposed tariff and its impact on its business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-vaibhav-suryavanshi-duck-dishant-yagnik-2718344-2025-05-02",
      "headline": "Was Suryavanshi under pressure after hundred? RR coach reacts after MI lossRR's assistant coach Dishant Yagnik has refuted claims that Vaibhav Suryavanshi was under media pressure during the MI game after scoring his maiden IPL hundred. Suryavanshi failed to impress with the bat against Mumbai on Thursday, May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/waves-summit-2025-aamir-khan-kareena-kapoor-aishwarya-rai-bachchan-2718367-2025-05-02",
      "headline": "WAVES 2025: Need a lot more theatres in India, says Aamir KhanWAVES Summit 2025 live Day 2: PM Modi inaugurated the four-day summit in Mumbai on May 1. On the second day, celebrities including Aamir Khan, Aishwarya Rai Bachchan and Kareena Kapoor will take part in talk sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-child-custody-home-cooked-food-kerala-high-court-2718339-2025-05-02",
      "headline": "Man loses custody of children as top court flags lack of home-cooked mealsThe Supreme Court set aside a Kerala High Court order granting interim custody to a father, citing his failure to provide home-cooked meals and adequate care.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/will-akhilesh-ambedkar-poster-row-mar-sps-dalit-votes-plan-2718060-2025-05-01",
      "headline": "Will Akhilesh-Ambedkar poster row mar SP's Dalit votes plan?The poster, conceded by Akhilesh Yadav as a mistake, has raked up controversy at a time his party is making visible attempts to woo the Dalit electorate"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-pushpa-pose-being-first-south-indian-actor-to-sport-six-packs-waves-summit-2718382-2025-05-02",
      "headline": "Allu Arjun recreates Pushpa pose, admits being 1st South star with six-pack absAllu Arjun was one of the chief guests at WAVES Summit 2025 on Thursday in Mumbai. The actor recreated his iconic Pushpa pose, which received cheers from audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-violates-loc-border-ceasefire-for-eighth-straight-night-army-responds-2718321-2025-05-02",
      "headline": "Pakistan violates border ceasefire for 8th straight night, Army respondsPakistani troops continued ceasefire violations along the Line of Control for the eighth consecutive night with unprovoked firing in Kupwara, Baramulla, Poonch, Naushera, and Akhnoor areas of Jammu and Kashmir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nepali-student-found-dead-hostel-room-kiit-university-bhubaneswar-2718275-2025-05-01",
      "headline": "Nepali student found dead in Bhubaneswar university hostel, 2nd case in 3 monthsPolice said the Nepali student was found hanging in her room around 7 pm in one of the girls' hostels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/who-is-adrita-sarkar-wbbse-madhyamik-10th-topper-with-9943-aims-for-medical-2718375-2025-05-02",
      "headline": "No need for strict schedule: WB Class 10 topper Adrita Sarkar shares study mantraAdrita Sarkar from Uttar Dinajpur has topped the WB Madhyamik 2025 exam with 99.43% and plans to pursue medicine. He shared more about his preparation strategy and tips for students while speaking to media."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-rohit-sharma-suryakumar-yadav-jasprit-bumrah-2718423-2025-05-02",
      "headline": "Rohit's resilience, Surya's flair, MI looking like the team to beat in IPLFrom 1 win in 5 matches to 6 straight victories — Mumbai Indians aren't just back, they're terrifying once again. The top players are back in form once again and MI are looking like the team to beat this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-avani-lekhara-ipl-2025-jerseys-pink-promise-2718409-2025-05-02",
      "headline": "Watch: RR exchange jerseys with Paralympian Avani Lekhara in heartfelt interactionIPL 2025, RR vs MI: Paralympic medallist Avani Lekhara was a part of the Rajasthan Royals' Pink Promise campaign in the match against Mumbai Indians on Thursday at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-hyderabad-daniel-vettori-press-conference-2718387-2025-05-02",
      "headline": "SRH have let themselves down: Daniel Vettori gutted after poor campaignIPL 2025, GT vs SRH: Sunrisers Hyderabad head coach Daniel Vettori said that the Orange Army haven't been up to the mark and hence, are struggling at the bottom half of the table. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-preview-predicted-xis-team-news-ahmedabad-pitch-weather-report-2718383-2025-05-02",
      "headline": "GT vs SRH: Gujarat look to edge closer to playoff spot as Hyderabad on the brinkShubman Gill and Gujarat Titans will be looking to edge closer to the IPL 2025 spots as Sunrisers Hyderabad battle for survival in Ahmedabad on Friday, May 2.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-hardik-pandya-mi-vs-rr-ipl-2025-2718370-2025-05-02",
      "headline": "Suryakumar, Hardik critical despite MI's huge win vs RR. Here's whyIPL 2025, RR vs MI: Hardik Pandya and Suryakumar Yadav engaged in a fun conversation after Mumbai Indians beat the Rajasthan Royals by 100 runs on Thursday in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-mi-deepak-chahar-press-conference-mumbai-indians-2718363-2025-05-02",
      "headline": "What's the reason behind MI's impressive IPL 2025 run? Deepak Chahar decodesDeepak Chahar feels that players coming into form at the right time has been the reason behind MI's resurgence and dream run in the IPL 2025 season. MI have moved to the top of the table with a 6-match winning run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-mi-jos-buttler-rajasthan-royals-dishant-yagnik-press-conference-2718353-2025-05-02",
      "headline": "Does RR miss Jos Buttler in IPL 2025? Assistant coach says it's time to look aheadRR assistant coach Dishant Yagnik is saying that it is time for the franchise to look beyond Jos Buttler after releasing the England wicketkeeper ahead of IPL 2025. Royals were knocked out of the tournament after their loss to MI while Buttler and his new team GT continue to impress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-vaibhav-suryavanshi-duck-dishant-yagnik-2718344-2025-05-02",
      "headline": "Was Suryavanshi under pressure after hundred? RR coach reacts after MI lossRR's assistant coach Dishant Yagnik has refuted claims that Vaibhav Suryavanshi was under media pressure during the MI game after scoring his maiden IPL hundred. Suryavanshi failed to impress with the bat against Mumbai on Thursday, May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-jasprit-bumrah-form-mumbai-indians-2718322-2025-05-02",
      "headline": "Nasty-fasty Jasprit Bumrah peaking at the right time for MIJasprit Bumrah bowled a fiery spell against Rajasthan on Thursday, May 1, guiding his team to the top spot of the IPL points table. Bumrah bowled some nasty bouncers in the game, which rattled the Royals batters in Jaipur.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-semi-final-results-manchester-united-bruno-fernandes-2718334-2025-05-02",
      "headline": "Europa League: Manchester United thrash 10-man Athletic Bilbao, Spurs down BodoA brace from Bruno Fernandes and a goal from Casemiro in the first half saw Manchester United thrash 10-man Athletic Bilbao in the first leg of the Europa League semi-final on Thursday, May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-mi-deepak-chahar-press-conference-mumbai-indians-2718363-2025-05-02",
      "headline": "What's the reason behind MI's impressive IPL 2025 run? Deepak Chahar decodesDeepak Chahar feels that players coming into form at the right time has been the reason behind MI's resurgence and dream run in the IPL 2025 season. MI have moved to the top of the table with a 6-match winning run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-mi-jos-buttler-rajasthan-royals-dishant-yagnik-press-conference-2718353-2025-05-02",
      "headline": "Does RR miss Jos Buttler in IPL 2025? Assistant coach says it's time to look aheadRR assistant coach Dishant Yagnik is saying that it is time for the franchise to look beyond Jos Buttler after releasing the England wicketkeeper ahead of IPL 2025. Royals were knocked out of the tournament after their loss to MI while Buttler and his new team GT continue to impress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-vaibhav-suryavanshi-duck-dishant-yagnik-2718344-2025-05-02",
      "headline": "Was Suryavanshi under pressure after hundred? RR coach reacts after MI lossRR's assistant coach Dishant Yagnik has refuted claims that Vaibhav Suryavanshi was under media pressure during the MI game after scoring his maiden IPL hundred. Suryavanshi failed to impress with the bat against Mumbai on Thursday, May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-jasprit-bumrah-form-mumbai-indians-2718322-2025-05-02",
      "headline": "Nasty-fasty Jasprit Bumrah peaking at the right time for MIJasprit Bumrah bowled a fiery spell against Rajasthan on Thursday, May 1, guiding his team to the top spot of the IPL points table. Bumrah bowled some nasty bouncers in the game, which rattled the Royals batters in Jaipur.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-semi-final-results-manchester-united-bruno-fernandes-2718334-2025-05-02",
      "headline": "Europa League: Manchester United thrash 10-man Athletic Bilbao, Spurs down BodoA brace from Bruno Fernandes and a goal from Casemiro in the first half saw Manchester United thrash 10-man Athletic Bilbao in the first leg of the Europa League semi-final on Thursday, May 1. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}