{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-appointed-chairman-of-tata-trusts-ratan-tata-death-successor-2615226-2024-10-11",
      "headline": "Noel Tata to succeed Ratan Tata, unanimously appointed Chairman of Tata TrustsNoel Tata has been a part of the Tata Group for over 40 years. The appointment was made during a meeting held in Mumbai and was unanimously agreed upon by the board of Tata Trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-noel-tata-lead-race-to-become-tata-trusts-chairman-report-2615175-2024-10-11",
      "headline": "Mehli Mistry, Noel Tata lead race to become Tata Trusts chairman: ReportNoel Tata is already a trustee in the Sir Dorabji Tata Trust and the Sir Ratan Tata Trust, which together hold a 66% stake in Tata Sons, the holding company of the Tata Group. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to all-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tatas-legacy-as-humanitarian-bigger-than-as-industrialist-birla-group-chief-2614740-2024-10-10",
      "headline": "Ratan Tata's legacy as humanitarian bigger than as industrialist: Birla Group chiefIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, reflected on the life and legacy of Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-it-firm-consolidated-net-profit-up-5-percent-yoy-to-rs-11909-crore-2614736-2024-10-10",
      "headline": "TCS Q2 Results: IT firm's net profit up 5% YoY to Rs 11,909 crore The company's net profit reached Rs 11,909 crore, up from Rs 11,342 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-successor-at-tata-trusts-who-are-the-frontrunners-noel-venu-srinivasan-vijay-singh-2614721-2024-10-10",
      "headline": "Ratan Tata's successor at Tata Trusts: Who are the frontrunners?The trusts, particularly the Sir Dorabji Tata Trust and Sir Ratan Tata Trust, collectively hold 66% of Tata Sons, making them the company's primary shareholders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-higher-banking-metal-stocks-shine-2614706-2024-10-10",
      "headline": "Sensex, Nifty end marginally higher; banking, metal stocks shine The S&P BSE Sensex added 144.31 points to close at 81,611.41, while the NSE Nifty50 gained 16.50 points to end at 24,998.45. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/canada-pm-justin-trudeau-met-pm-modi-laos-spoke-about-safety-of-canadians-2615380-2024-10-11",
      "headline": "Justin Trudeau says met PM Modi in Laos: Real issues we need to solveAccording to Trudeau, he spoke to PM Modi about the \"work that we need to do\", alluding to the strained ties between the two nations after he alleged New Delhi's involvement in the killing of Khalistani terrorist Hardeep Singh Nijjar last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-condemns-attack-on-un-peacekeepers-in-lebanon-israel-hezbollah-conflict-2615308-2024-10-11",
      "headline": "600 Indian soldiers at risk, Delhi flags concern after Israel attack on UN postsIndia's statement came a day after the UN said the Naqoura headquarters of the United Nations Interim Force In Lebanon (UNIFIL) and nearby positions have been repeatedly hit by Israeli forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nihon-hidankyo-japanese-group-awarded-nobel-peace-prize-advocate-nuclear-weapons-abolition-2615342-2024-10-11",
      "headline": "All about Nihon Hidankyo, the Japanese group awarded Nobel Peace PrizeNihon Hidankyo's primary mission is to advocate for the abolition of nuclear weapons, support the welfare of atomic bomb survivors, and raise awareness about the devastation caused by nuclear warfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/elon-musk-ride-in-tesla-self-driving-robotaxi-cybercab-cybertruck-price-2615336-2024-10-11",
      "headline": "Video: Elon Musk takes a ride in Tesla's self-driving robotaxiUS car-making giant Tesla has shared a video of its owner and billionaire Elon Musk riding the new Robotaxi. In the video, one can see that the car's automated doors open as soon as Musk approaches the vehicle, he sits inside and makes himself comfortable. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-government-withdraws-2022-hubballi-riot-cases-against-aimim-leaders-138-others-2615170-2024-10-11",
      "headline": "Karnataka government withdraws 2022 Hubballi riot cases against AIMIM leadersThe Congress-led Karnataka government has decided to withdraw criminal cases against AIMIM leaders who were accused of leading a mob that attacked the police and threatened to break into the police station in Hubballi in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-domestic-cricket-rule-changes-ranji-trophy-batter-retiring-hurt-2615362-2024-10-11",
      "headline": "Voluntarily retiring hurt to be deemed out: BCCI revamps Domestic cricket rulesThe Board of Control for Cricket in India has opted to make major changes in domestic cricket. One of the main changes states that batters who retire voluntarily will be deemed out unless they are injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/agniveers-killed-artillery-shell-burst-firing-exercise-maharashtra-2615337-2024-10-11",
      "headline": "2 Agniveers killed as artillery shell burst during firing exercise in MaharashtraThe Agniveers had come from Hyderabad for training at Artillery School in Deolali, Nashik in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jigra-review-alia-bhatt-sparkle-cannot-save-this-dull-film-vedang-raina-vasan-bala-2615216-2024-10-11",
      "headline": "Jigra review: Alia Bhatt's sparkle can't save this dull filmReleased-Fri Oct 11, 2024Alia Bhatt-starrer Jigra has promise, and the lead star shines brightest in the Vasan Bala directorial. However, the storyline leaves us wanting. Read the complete review of the film here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/cctv-captures-theft-of-kali-crown-gifted-by-pm-modi-to-bangladeshs-jeshoreshwari-temple-2615207-2024-10-11",
      "headline": "CCTV captures theft of Kali crown gifted by PM Modi to Bangladesh templeA crown gifted by Indian Prime Minister Narendra Modi to the Jeshoreshwari Kali Temple in Satkhira in Bangladesh, has been stolen. The silver, gold-plated crown, presented during Modi's visit in 2021, was stolen on Thursday afternoon after the temple priest left following worship. CCTV footage captured a man stealing the crown.\r\n\r\nMeanwhile, India has expressed its concern over the incident and urged the Bangladesh government to recover the stolen crown and bring the culprits to justice. Police said they are analysing the CCTV footage to identify the suspect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/meesho-announced-a-nine-day-reset-and-recharge-leave-for-employees-october-26-to-november-3-2615373-2024-10-11",
      "headline": "Meesho announces 9-day leave for its employees. Internet is impressedMeesho has announced a nine-day leave for its employees from October 26 to November 3. The initiative has won over the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-loses-her-cool-at-durga-puja-pandal-2615309-2024-10-11",
      "headline": "Watch: Kajol loses her cool at Durga Puja pandalDuring the Durga Puja celebrations, a video surfaced of Kajol expressing her displeasure over attendees wearing shoes near the idol. The event also saw Alia Bhatt and her sister actively participating in the traditional rituals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-samajwadi-party-bjp-jp-narayan-centre-lucknow-gate-barricade-tin-sheets-2615051-2024-10-11",
      "headline": "Akhilesh Yadav vs BJP over JP Narayan Centre and an appeal to Nitish KumarProtests by the Samajwadi Party erupted after Akhilesh Yadav claimed that the BJP installed tin sheets in front of JP Narayan Centre's main gate in Lucknow to prevent him from entering to mark the socialist leader's birth anniversary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-responds-india-statement-attack-on-peacekeepers-hezbollah-using-un-posts-as-shields-2615349-2024-10-11",
      "headline": "Hezbollah using UN posts as shields: Israel's response on attacks at peacekeepersResponding to India's comments on the attacks at the UN peacekeeping headquarters in southern Lebanon, Israeli envoy, Reuven Azar, said that Hezbollah is firing at Israel in proximity to UNIFIL outposts, criminally using them as a shield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nayab-saini-likely-to-take-oath-as-haryana-chief-minister-on-october-15-assembly-election-results-bjp-2615231-2024-10-11",
      "headline": "Nayab Saini likely to take oath as Haryana Chief Minister on October 15: SourcesBJP's Nayab Singh Saini is likely to take oath as the Haryana Chief Minister on October 15, sources said, days after the BJP secured a stunning hat-trick in the Assembly polls, winning 48 seats in the 90-member House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/geomagnetic-storm-hits-earth-northern-lights-seen-india-leh-world-aurora-borealis-2615118-2024-10-11",
      "headline": "Aurora lights up Leh skies as geomagnetic storm hits EarthSkies in Leh, Ladakh were lit up by a rare aurora borealis due to a strong geomagnetic storm that reached Earth on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/parsis-india-sugar-in-milk-story-persia-gujarat-sanjan-hindu-king-ratan-tata-2615043-2024-10-11",
      "headline": "A tale of sugar and milk: How Parsis found a home in IndiaIn the 8th century, a group of Zoroastrians, fleeing persecution in Persia (modern-day Iran), arrived at the coast of Gujarat, seeking refuge. The Indian King of Sanjan allowed the strangers to stay on his land. The migrants promised to blend in, like sugar in milk, which has been the hallmark of their relationship with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-prime-minister-narendra-modi-gujarat-one-word-message-ratan-tata-2008-2615037-2024-10-11",
      "headline": "When PM brought Nano plant to Gujarat after 1 word SMS to Ratan Tata in 2008Then Gujarat Chief Minister Narendra Modi had sent a one word SMS to the then Tata Group Chairman Ratan Tata after the Nano project was withdrawn from West Bengal in 2008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-assembly-election-2024-bjp-loss-jknc-congress-victory-meaning-for-naya-kashmir-omar-abdullah-2614024-2024-10-11",
      "headline": "The Kashmir story is much bigger than BJP's fortunesThe present and future of Kashmir matters more than the fortunes of political parties. That a free-and-fair election was held in Jammu and Kashmir and saw enthusiastic participation by the people is much more significant than the electoral outcome. This is why the process, and not its performance, should enthuse the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-rekha-mentioned-reuniting-with-amitabh-bachchan-on-screen-he-is-my-inner-conscience-2615361-2024-10-11",
      "headline": "When Rekha mentioned reuniting with Big B on screen: He's my inner conscienceRekha and Amitabh Bachchan were last seen together in the 1981 film Silsila. The duo never worked together despite their hit chemistry. Rekha once talked about the same in an old interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-revdi-donald-trump-us-election-promise-slash-energy-costs-half-bjp-2615225-2024-10-11",
      "headline": "Arvind Kejriwal's zinger as Donald Trump vows to slash energy costs by halfArvind Kejriwal drew a parallel between his own promise of freebies and a similar pledge made by former US President Donald Trump to make a point about the universal appeal of such subsidised services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-audi-hit-and-run-bike-rider-killed-google-building-2615063-2024-10-11",
      "headline": "Delivery man killed after Audi rams his bike in Pune, driver detainedThe accident occurred in Pune when the Audi first hit three people riding an Activa, causing them to fall and sustain minor injuries. Shortly after, the luxury car rammed a biker, a Swiggy delivery agent, who later succumbed to his injuries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chennai-man-arrested-molesting-woman-chennai-jaipur-indigo-flight-police-2615202-2024-10-11",
      "headline": "Man arrested for molesting woman on Chennai-bound IndiGo flightA 45-year-old man was arrested for allegedly inappropriately touching a woman passenger while aboard a Chennai-bound IndiGo flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/netflix-renews-nobody-wants-this-for-second-season-adam-brody-2615408-2024-10-11",
      "headline": "Netflix renews rom-com series Nobody Wants This for a second seasonNetflix has renewed the rom-com series Nobody Wants This for a second season, promising to delve deeper into the evolving relationship between rabbi Noah and podcaster Joanne, amidst cultural challenges and personal growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-rekha-mentioned-reuniting-with-amitabh-bachchan-on-screen-he-is-my-inner-conscience-2615361-2024-10-11",
      "headline": "When Rekha mentioned reuniting with Big B on screen: He's my inner conscienceRekha and Amitabh Bachchan were last seen together in the 1981 film Silsila. The duo never worked together despite their hit chemistry. Rekha once talked about the same in an old interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/martin-review-dhruva-sarja-arjun-sarja-film-offers-more-noise-less-noise-2615352-2024-10-11",
      "headline": "Martin review: Dhruva Sarja's film offers more noise, less musicReleased-Fri Oct 11, 2024Martin Movie Review: With a story written by Arjun Sarja, Martin stars his nephew, Kannada actor Dhruva Sarja, in the lead. The film is a two-and-a-half-hour ride full of loud dialogues, over-the-top action, bad BGM and a mess of a story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bougainvillea-trailer-jyothirmayi-fahadh-faasil-promise-an-intense-thriller-2615350-2024-10-11",
      "headline": "Bougainvillea trailer: Jyothirmayi, Fahadh Faasil promise an intense thrillerBougainvillea, directed by Amal Neerad, promises to deliver a gripping psychological thriller featuring a stellar cast that includes Kunchacko Boban, Jyothirmayi, and Fahadh Faasil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-iphone-15-is-now-available-for-with-rs-27000-discount-but-only-for-limited-time-2615422-2024-10-11",
      "headline": "Apple iPhone 15 is now available for with Rs 27,000 discount, but only for limited time Apple is offering significant discounts on iPhone 15 and iPhone 15 Plus. With offers extending up to Rs 27,000 off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-tesla-humanoid-optimus-says-hardest-part-of-being-a-robot-is-trying-to-be-human-2615330-2024-10-11",
      "headline": "Elon Musk's Tesla humanoid Optimus reveals hardest part of being a robotElon Musk unveiled the latest generation of Tesla's humanoid Optimus at the We, Robot event. While according to Musk, the robots can now do anything, Optimus reveals that the hardest part of being a robot is learning how to be human. Read on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/star-health-insurance-hack-led-to-personal-data-of-31-million-customers-being-compromised-story-in-5-points-2615354-2024-10-11",
      "headline": "Star Health hack led to data leak of 31 million customers: Story in 5 pointsIndia's popular health insurers, Star Health insurance, faced a massive data leak this week, which may have led to the data of 31 million customers being compromised. Here is everything that has happened in the case so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/video/how-to-get-new-siri-with-apple-intelligence-in-india-first-look-at-ios-181-more-features-2615301-2024-10-11",
      "headline": "How to get new Siri with Apple Intelligence in India? First look at iOS 18.1 & more featuresApple has released the latest developer Beta for iOS 18.1, showcasing some new features like the new Siri, Writing Tools and more. Watch the video to know more. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-ollie-pope-enters-englands-record-win-over-pakistan-on-multan-stadiums-board-2615398-2024-10-11",
      "headline": "Ollie Pope makes hilarious mistake while recording England's historic win in MultanEngland captain Ollie Pope made a hilarious mistake while entering his team's record win over Pakistan in the first Test in Multan on the stadium's board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-press-conference-nick-pothas-hyderabad-t20i-2615386-2024-10-11",
      "headline": "Lot of countries with bad tours in India: Bangladesh fielding coach IND vs BAN: Bangladesh fielding coach Nick Pothas defended the Tigers saying that the team has made improvements over the last 12 months. Bangladesh will go into the Hyderabad T20I after conceding the T20I series 2-0 against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-puneri-paltan-squad-analysis-title-defence-v-ajith-kumar-2615385-2024-10-11",
      "headline": "Puneri Paltan eye PKL title defence with established heroesPuneri Paltan will be determined to defend their PKL title in Season 11, despite the loss of star defender Mohammadreza Chiyaneh. Retaining their core squad gives them a strong chance, but the left-side defense remains a concern.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-ravi-shastri-note-2615381-2024-10-11",
      "headline": "Ravi Shastri pens glowing tribute for Rafael Nadal: You kept tennis aliveFormer India head coach Ravi Shastri paid a glowing tribute to Rafael Nadal after his retirement from tennis. Shastri credited Nadal for keeping the sport alive with his sensational performances.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-2615374-2024-10-11",
      "headline": "Australia know how hard it is to beat India: Healy on blockbuster clashWomen's T20 World Cup 2024: Australia skipper Alyssa Healy said that India could pose them a big threat when the teams face each other on Sunday at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-third-t20i-predicted-eleven-harshit-rana-mayank-yadav-hyderabad-2615371-2024-10-11",
      "headline": "IND vs BAN, 3rd T20I Predicted XI: Harshit Rana in for Mayank Yadav?India, already securing the T20I series against Bangladesh, eyes a dominant whitewash in Hyderabad, while speculations arise about giving new talents like Harshit Rana a chance in the final match of the series.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/captain-ollie-pope-might-lose-his-spot-if-ben-stokes-returns-in-2nd-test-hussain-2615369-2024-10-11",
      "headline": "Captain Pope might lose his spot if Ben Stokes returns in 2nd Test: HussainEngland captain Ollie Pope might be forced to sit out in case Ben Stokes returns for the 2nd Test match, said Nasser Hussain. England hammered Pakistan in the 1st Test, but Pope was not able to make a mark with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-domestic-cricket-rule-changes-ranji-trophy-batter-retiring-hurt-2615362-2024-10-11",
      "headline": "Voluntarily retiring hurt to be deemed out: BCCI revamps Domestic cricket rulesThe Board of Control for Cricket in India has opted to make major changes in domestic cricket. One of the main changes states that batters who retire voluntarily will be deemed out unless they are injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-olympic-association-incompetency-of-treasurer-international-olympic-committee-2615356-2024-10-11",
      "headline": "Indian Olympic body highlights incompetency of treasurer leading to financial lossThe Indian Olympic Association brought to light the incompetency of its treasurer in filing the necessary annual financial reports despite repeated reminders from the International Olympic Committee (IOC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20is-mehidy-hasan-miraz-hyderabad-press-conference-2615355-2024-10-11",
      "headline": "Bangladesh looking to 'find a role' for Mehidy in T20Is: Nick PothasIND vs BAN: Bangladesh fielding coach Nick Pothas said that the Tigers are trying to find the apt role for Mehidy Hasan Miraz in the T20I team. Earlier, Mehidy returned to the T20I team after more than a year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-selection-committee-revamp-aleem-dar-multan-test-vs-england-2615348-2024-10-11",
      "headline": "Former umpire Aleem Dar named in revamped Pakistan selection committeeAfter Pakistan's crushing loss to England in the Multan Test, PCB revamped their selection committee, appointing Aleem Dar and other former cricketing stars in a bid to revitalize the struggling team ahead of future challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/captain-ollie-pope-might-lose-his-spot-if-ben-stokes-returns-in-2nd-test-hussain-2615369-2024-10-11",
      "headline": "Captain Pope might lose his spot if Ben Stokes returns in 2nd Test: HussainEngland captain Ollie Pope might be forced to sit out in case Ben Stokes returns for the 2nd Test match, said Nasser Hussain. England hammered Pakistan in the 1st Test, but Pope was not able to make a mark with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-domestic-cricket-rule-changes-ranji-trophy-batter-retiring-hurt-2615362-2024-10-11",
      "headline": "Voluntarily retiring hurt to be deemed out: BCCI revamps Domestic cricket rulesThe Board of Control for Cricket in India has opted to make major changes in domestic cricket. One of the main changes states that batters who retire voluntarily will be deemed out unless they are injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-olympic-association-incompetency-of-treasurer-international-olympic-committee-2615356-2024-10-11",
      "headline": "Indian Olympic body highlights incompetency of treasurer leading to financial lossThe Indian Olympic Association brought to light the incompetency of its treasurer in filing the necessary annual financial reports despite repeated reminders from the International Olympic Committee (IOC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20is-mehidy-hasan-miraz-hyderabad-press-conference-2615355-2024-10-11",
      "headline": "Bangladesh looking to 'find a role' for Mehidy in T20Is: Nick PothasIND vs BAN: Bangladesh fielding coach Nick Pothas said that the Tigers are trying to find the apt role for Mehidy Hasan Miraz in the T20I team. Earlier, Mehidy returned to the T20I team after more than a year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-selection-committee-revamp-aleem-dar-multan-test-vs-england-2615348-2024-10-11",
      "headline": "Former umpire Aleem Dar named in revamped Pakistan selection committeeAfter Pakistan's crushing loss to England in the Multan Test, PCB revamped their selection committee, appointing Aleem Dar and other former cricketing stars in a bid to revitalize the struggling team ahead of future challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhanas-spin-hitting-is-positive-sign-ahead-of-australia-game-shafali-verma-2615323-2024-10-11",
      "headline": "Smriti Mandhana's spin-hitting is positive sign ahead of Australia game: Shafali India batter Shafali Verma has said that Smriti Mandhana hitting spinners well is a positive sign for the team ahead of their next fixture against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-temba-bavuma-ruled-out-aiden-markram-2615321-2024-10-11",
      "headline": "Bavuma ruled out of 1st Test vs Bangladesh, Markram to stand in BAN vs SA: Aiden Markram will lead South Africa in their opening Test against Bangladesh in Mirpur after Temba Bavuma was ruled out due to muscle strain on his left triceps"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-11-patna-pirates-swot-analysis-narender-redhu-2615305-2024-10-11",
      "headline": "Patna Pirates aim to recapture lost glory in PKL season 11The Patna Pirates will be aiming to recapture their lost glory during season 11 of the Pro Kabaddi League. Pirates were active during the auction and bolstered their team with a lot of signings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-test-cricket-mentally-weak-shan-masood-2615296-2024-10-11",
      "headline": "Are Pakistan mentally weak in Test cricket? Shan Masood respondsPakistan captain Shan Masood was grilled in the post-match press conference after the team's loss in the Multan Test. Masood was asked if his team was mentally weak  in the red-ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-dani-carvajal-crutches-uefa-nations-league-injury-spain-national-team-watch-2615287-2024-10-11",
      "headline": "Injured Rodri and Dani Carvajal visit Spain camp in crutches, get warm welcomeSpanish footballers Rodri and Dani Carvajal, sidelined by serious injuries, received a heartwarming ovation during their visit to Spain's national team camp before the UEFA Nations League clash against Denmark, underscoring concerns over modern football's packed schedules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varma-nitish-kumar-reddy-enjoy-hyderabad-homecoming-2615269-2024-10-11",
      "headline": "Watch: Tilak Varma, Nitish Kumar Reddy enjoy Hyderabad homecomingThe Indian team touched down in Hyderabad on Thursday, October 10 for the third and final T20I match against Bangladesh. Nitish Kumar Reddy and Tilak Varma welcomed the team to their city for the final clash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-harry-brook-joe-root-lunchtime-chat-triple-century-multan-test-2615248-2024-10-11",
      "headline": "Harry Brook reveals lunchtime chat with Joe Root that led to Multan 300Harry Brook and Joe Root's record-breaking 454-run partnership propelled England to a massive 823 total, securing a commanding innings-and-47-run victory over Pakistan in the Multan Test, further deepening Pakistan's home humiliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-nets-session-hilarious-comment-2615240-2024-10-11",
      "headline": "Watch: Rohit Sharma's hilarious reaction to 1st ball 6 demand in netsRohit Sharma had a hilarious reaction when he was asked if he would start a nets session with a six. Rohit has started his preparations for the upcoming series against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-dani-carvajal-crutches-uefa-nations-league-injury-spain-national-team-watch-2615287-2024-10-11",
      "headline": "Injured Rodri and Dani Carvajal visit Spain camp in crutches, get warm welcomeSpanish footballers Rodri and Dani Carvajal, sidelined by serious injuries, received a heartwarming ovation during their visit to Spain's national team camp before the UEFA Nations League clash against Denmark, underscoring concerns over modern football's packed schedules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tilak-varma-nitish-kumar-reddy-enjoy-hyderabad-homecoming-2615269-2024-10-11",
      "headline": "Watch: Tilak Varma, Nitish Kumar Reddy enjoy Hyderabad homecomingThe Indian team touched down in Hyderabad on Thursday, October 10 for the third and final T20I match against Bangladesh. Nitish Kumar Reddy and Tilak Varma welcomed the team to their city for the final clash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-harry-brook-joe-root-lunchtime-chat-triple-century-multan-test-2615248-2024-10-11",
      "headline": "Harry Brook reveals lunchtime chat with Joe Root that led to Multan 300Harry Brook and Joe Root's record-breaking 454-run partnership propelled England to a massive 823 total, securing a commanding innings-and-47-run victory over Pakistan in the Multan Test, further deepening Pakistan's home humiliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-nets-session-hilarious-comment-2615240-2024-10-11",
      "headline": "Watch: Rohit Sharma's hilarious reaction to 1st ball 6 demand in netsRohit Sharma had a hilarious reaction when he was asked if he would start a nets session with a six. Rohit has started his preparations for the upcoming series against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-announcement-jannik-sinner-reaction-davis-cup-2615224-2024-10-11",
      "headline": "Rafael Nadal's retirement tough news for tennis world: Jannik SinnerJannik Sinner has claimed that the impending retirement of Rafael Nadal is tough news for the tennis world. Nadal will leave the sport at the end of the Davis Cup finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-shan-masood-captain-2615220-2024-10-11",
      "headline": "Pakistan hurt as a nation: Shan Masood slams bowling unit after Multan lossPakistan captain Shan Masood slammed his bowlers after their loss in Multan Test match. After hitting 556 runs in the first innings, Pakistan lost the match by an innings and 47 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-jack-leach-catch-shaheen-afridi-home-defeat-2615215-2024-10-11",
      "headline": "PAK vs ENG: Jack Leach takes a stunning catch to dismiss Shaheen AfridiJack Leach's brilliant caught-and-bowled dismissal of Shaheen Afridi capped a dominant performance as England secured a commanding victory over Pakistan by an innings and 47 runs in the first Test at Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-first-test-ollie-pope-reaction-joe-root-harry-brook-multan-2615214-2024-10-11",
      "headline": "Multan Test: Ollie Pope credits Brook-Root and bowlers for historic winOllie Pope credited Joe Root-Harry Brook and the bowlers for their historic win in the Multan Test on October 11, Friday. England won the match by an innings and 47 runs despite conceding 556 runs upfront. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}