{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-proposes-two-gst-rates-of-5-and-18-tobacco-at-40-tax-cuts-for-farm-and-health-sectors-sources-2771789-2025-08-15",
      "headline": "Government proposes 5%, 18% GST slabs; tobacco at 40%, relief for farmers: SourcesThe government has proposed reducing GST to two slabs: 5% and 18% with sin goods at 40%, aiming to cut taxes on essentials like farm products, health items, handicrafts, and insurance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-rating-importance-what-do-they-mean-india-upgrade-pakistan-sp-global-2771729-2025-08-15",
      "headline": "Credit ratings decoded: How a simple upgrade can change a country's fortuneGlobal credit rating agency S&P Global has upgraded India's long-term unsolicited sovereign credit rating to 'BBB' from 'BBB-'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/gst-council-meeting-in-september-12-slam-may-be-dropped-sources-2771695-2025-08-15",
      "headline": "GST council meeting in September, 12% slam may be dropped: SourcesTwo-day GST Council meetings are expected in September to pave the way for reforms. The announcement was made by the Prime Minister from the ramparts of the Red Fort. These reforms are seen as a Diwali gift for the middle class. Key changes include the removal of the 12% GST slab and rate rationalisation for health and life insurance policies. The government aims to reduce the GST on most items currently in the 12% slab to 5%. This move is expected to make essential items such as footwear, bags, clothes, and toothpastes more affordable. The government is addressing concerns about inflation and the rising cost of living. Feedback regarding health insurance, which impacts the common person, has also been considered. The meetings in September are crucial for approving these changes, with implementation anticipated before Diwali. The Finance Ministry and state finance ministers have been involved in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/removal-of-12-tax-slab-among-key-reforms-to-be-discussed-in-gst-council-meetings-in-september-sources-2771661-2025-08-15",
      "headline": "GST Council may drop 12% slab, more tax reforms in September meeting: SourcesThe meeting comes after Prime Minister Narendra Modi, in his Independence Day speech, announced plans for a major overhaul of the Goods and Services Tax (GST) system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/same-sex-couple-tax-law-biased-uneven-challenge-gits-received-partners-bombay-hc-report-2771623-2025-08-15",
      "headline": "Claiming bias, same-sex couple approaches court over uneven tax: ReportThe petition was admitted by a bench of Justice BP Colabawalla and Justice Firdoush Pooniwalla, which has also issued a notice to the Attorney General as the case raises a constitutional question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/independence-day-pm-modi-announces-next-generation-gst-reform-with-significantly-lower-rates-2771561-2025-08-15",
      "headline": "PM Modi announces next-generation GST reform with significantly lower ratesDuring his Independence Day address, Prime Minister Narendra Modi announced a sweeping overhaul of the GST system, promising to unveil a \"next-generation\" tax regime with substantially lower rates this Diwali, which he hailed as a festive gift from the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-speech-announces-rs-1-lakh-crore-pradhan-mantri-viksit-bharat-rojgar-yojana-scheme-2771555-2025-08-15",
      "headline": "Rs 15,000 from government on 1st private-sector job: PM's big youth schemePM Modi in his Independence Day speech said that the Pradhan Mantri Viksit Bharat Rojgar Yojana will create nearly 3.5 crore new employment opportunities for the youth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-cut-coming-soon-what-to-expect-after-pm-modi-big-diwali-promise-2771554-2025-08-15",
      "headline": "GST cut coming soon? What to expect after PM Modi's big Diwali promisePrime Minister Narendra Modi's announcement has set expectations for a substantial overhaul of the current multi-slab GST structure, which has been in place since 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-chips-2025-end-pm-modi-independence-day-speech-red-fort-gst-diwali-energy-nuclear-2771547-2025-08-15",
      "headline": "India to roll out its own semiconductor chips by end of 2025: PM ModiSpeaking on the country's 79th Independence Day, PM Modi hoisted the national flag for the 12th consecutive time before outlining the government's plans for technology, energy, and economic reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pms-double-diwali-promise-says-next-generation-gst-with-lower-taxes-coming-soon-2771537-2025-08-15",
      "headline": "PM's Double Diwali promise, says next-generation GST with much lower taxes soonPrime Minister Narendra Modi promised the roll-out a next-generation GST regime with substantially lower taxes before this Diwali, calling it a major festive gift to benefit individuals, MSMEs, and the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-5-best-review-gmp-vikram-solar-patel-retail-mangal-gem-aromatics-shreeji-2771335-2025-08-14",
      "headline": "5 IPOs to open for bidding next week: Which is best based on GMP?Next week will see the IPOs of Patel Retail, Vikram Solar, Gem Aromatics, Shreeji Shipping Global and Mangal Electrical. Together, they are looking to raise Rs 3,584.09 crore from the market. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-day-2-rajinikanth-reigns-supreme-with-rs-119-crore-in-india-2771984-2025-08-16",
      "headline": "Coolie box office Day 2: Rajinikanth reigns supreme with Rs 119 crore in IndiaRajinikanth's latest film 'Coolie' sets new records, becoming the first Tamil film to earn Rs 100 crore in two days, and breaking records overseas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-celebrates-family-milestones-india-independence-day-jonas-anniversaries-birthdays-2771976-2025-08-16",
      "headline": "Priyanka Chopra's New York celebrations blend family milestones, Independence DayPriyanka Chopra marked a series of family celebrations and extended her best wishes for India's Independence Day. Alongwith a bunch of lively photos, the celebrated star wrote a thoughtful and lengthy note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-deeply-grateful-as-pm-narendra-modi-congratulates-him-on-50-years-in-cinema-2771964-2025-08-16",
      "headline": "Rajinikanth deeply grateful as PM Modi congratulates him on 50 years in cinemaPrime Minister Narendra Modi warmly congratulated Rajinikanth on completing 50 years in cinema, praising his iconic journey and diverse roles. The superstar expressed heartfelt gratitude in a post on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dear-students-teaser-nayanthara-nivin-pauly-reunite-in-comedy-drama-with-a-twist-2771958-2025-08-16",
      "headline": "Dear Students teaser: Nayanthara, Nivin Pauly reunite in comedy drama with a twistThe teaser for 'Dear Students', starring Nayanthara and Nivin Pauly, sets up a mystery-filled narrative. Directed by Sandeep Kumar and George Philip Roy, it features intriguing characters and action sequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-prime-video-this-weekend-2771635-2025-08-16",
      "headline": "Top films and shows to watch on Prime Video this weekendTop picks to stream on Prime Video this weekend, from horror to espionage thrillers to animation and documentaries. Here is a glimpse at the new releases to add to your binge-list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadhas-tricolour-themed-independence-day-feast-at-home-2771865-2025-08-15",
      "headline": "Parineeti Chopra, Raghav Chadha's tricolour-themed Independence Day feast at homeParineeti Chopra and Raghav Chadha shared a glimpse of their Independence Day with a tricolour-themed lunch at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uorfi-javed-backs-mrunal-thakur-bipasha-basu-remark-backlash-2771823-2025-08-15",
      "headline": "Uorfi Javed backs Mrunal Thakur over Bipasha Basu remark: We all said things in pastInfluencer Uorfi Javed defended actor Mrunal Thakur amid controversy over her past remarks on actor Bipasha Basu. She shared Mrunal's controversial clip on her Instagram story. Javed said that we have all said things in the past that we don't agree with any more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raj-kundra-responds-to-trolls-after-offering-kidney-to-premanand-maharaj-2771836-2025-08-15",
      "headline": "Raj Kundra responds to trolls after offering kidney to Premanand MaharajRaj Kundra has responded strongly to online trolls who labelled his kidney donation offer to spiritual leader Premanand Maharaj as a PR stunt. In his Instagram post on Friday, he emphasised compassion and humanity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-allegations-going-after-married-men-ambitious-women-are-blamed-2771811-2025-08-15",
      "headline": "Kangana Ranaut on allegations of going after married men: Ambitious women are blamedActor Kangana Ranaut addressed the allegations of pursuing married men with kids. She emphasised society's tendency to blame ambitious women while excusing men's behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-govinda-wife-sunita-youtube-debut-most-entertaining-biwi-2771799-2025-08-15",
      "headline": "Farah cheers for Govinda's wife Sunita on her YouTube debut: Most entertaining biwiFilmmaker Farah Khan backed actor Govinda's wife Sunita as she started her new YouTube channel. This came after social media users compared Sunita to Farah Khan. Sunita's debut vlog has already garnered over 5 lakh views."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-team-brings-bheegi-saree-magic-in-bts-video-on-adnan-samis-birthday-2771803-2025-08-15",
      "headline": "Param Sundari team brings Bheegi Saree magic in BTS video on Adnan Sami's birthdayOn Adnan Sami's 54th birthday, the makers shared a viral BTS video of the singer performing the soulful track 'Bheegi Saree' from 'Param Sundari'. The film features actors Sidharth Malhotra and Janhvi Kapoor in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-daughter-klin-kaaras-independence-day-2025-moment-delights-fans-2771801-2025-08-15",
      "headline": "Ram Charan, daughter Klin Kaara's Independence Day moment delights fansTollywood star Ram Charan celebrated India's 79th Independence Day by sharing a heartfelt video saluting the national flag with his daughter Klin Kaara. The clip captured the hearts of fans across social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kabir-khan-marks-13-years-of-ek-tha-tiger-remembers-debut-with-salman-khan-and-katrina-kaif-2771762-2025-08-15",
      "headline": "Kabir Khan marks 13 years of Ek Tha Tiger, remembers debut with Salman and KatrinaKabir Khan celebrated 13 years of 'Ek Tha Tiger', recalling its record-breaking debut and how it became the foundation of the YRF Spyverse. He credited Aditya Chopra for the vision, praised the film's real action with minimal VFX."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/special-ops-2-muzammil-ibrahim-says-debut-was-better-than-ranbir-kapoor-industry-bias-2771784-2025-08-15",
      "headline": "Special Ops 2 actor says his debut was better than Ranbir's: They favour star-kidsActor Muzammil Ibrahim has said that he deserved the Best Debut award over actor Ranbir Kapoor in 2007. He alleges industry bias and feels A-listers see him as a threat to their stardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-make-sleek-statement-in-luxury-bmw-m2-at-hyderabad-airport-2771785-2025-08-15",
      "headline": "Naga Chaitanya-Sobhita make sleek statement in luxury BMW M2 at Hyderabad airportTollywood stars Naga Chaitanya and Sobhita Dhulipala were seen at Rajiv Gandhi International Airport in a recently acquired BMW M2, catching attention with their stylish departure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-says-only-losers-use-dating-apps-calls-them-gutter-of-society-2771757-2025-08-15",
      "headline": "Kangana Ranaut says only losers use dating apps, calls them gutter of societyKangana Ranaut criticised dating apps and their users in a recent interview. She called dating apps the 'true gutter' of our society and referred to these apps as a lowly practice. The actor expressed that only people who desire validation and lack confidence go to such places. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/yrf-spy-universe-has-a-woman-problem-and-it-is-beyond-bikinis-from-kiara-advani-in-war-2-deepika-padukone-in-pathaan-to-katrina-kaif-in-tiger-2771755-2025-08-15",
      "headline": "YRF's spy universe has a woman problem, and it's beyond bikinisFrom medal ceremonies to midriff shots, YRF's spy universe has reduced its women from agents to accessories. And no, a \"women-led\" 'Alpha' won't fix a universe that can't imagine its heroines doing anything more than waiting for the hero to save the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-celebrates-his-50th-birthday-with-priyanka-chopra-on-ssmb29-set-2771753-2025-08-15",
      "headline": "Mahesh Babu celebrates his 50th birthday with Priyanka Chopra on SSMB29 setPriyanka Chopra and Mahesh Babu's recent picture from the Hyderabad schedule of SSMB29 has created a buzz on social media. The Telugu actor marked his birthday with Chopra on August 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shweta-menon-first-woman-president-amma-artistes-of-malayalam-movie-association-2771764-2025-08-15",
      "headline": "Shwetha Menon becomes first woman president of Malayalam film bodyActor Shwetha Menon has been elected as the first woman president of the Association of Malayalam Movie Artistes (AMMA). In August 2024, the Mohanlal-led committee resigned after the damning Hema Committee report."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-fox-interview-putin-meet-alaska-russia-sanctions-ukraine-war-2771978-2025-08-16",
      "headline": "Relief for India? Trump softens stance on Russia oil buyers after Putin meetIn an interview with Fox News, Donald Trump said the meeting with Russian President Putin in Alaska went well, rating it a '10/10'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/made-great-progress-during-meeting-with-vladimir-putin-in-alaska-trump-on-ukraine-peace-talks-2771944-2025-08-16",
      "headline": "'No deal until there's a deal': Trump-Putin meet ends with no Ukraine ceasefire  UpdatesUS President Donald Trump and Russian President Vladimir Putin concluded a nearly three-hour summit in Alaska on the Ukraine war. No final deal was reached, but both leaders reported progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-putin-meeting-alaska-ukraine-war-optics-the-beast-chat-red-carpet-welcome-handshake-2771967-2025-08-16",
      "headline": "Red carpet, secret chat in The Beast: Trump came in roaring, Putin left laughingTrump-Putin meeting: Trump arrived for the summit roaring. He threatened Putin with 'severe consequences' over the Ukraine war. However, when the two leaders met, Trump's compulsive bluster was gone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/there-would-have-been-ukraine-war-trump-president-2022-putin-after-alaska-talks-glbs-2771943-2025-08-16",
      "headline": "Ukraine war would not have happened if Trump was president in 2022: PutinRussian President Vladimir Putin, after his first meeting with Donald Trump in five years, said the Ukraine war would not have happened if Trump was in office in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-shuttlecocks-crisis-bai-secretary-2771982-2025-08-16",
      "headline": "How China's changing food habits has forced a shuttlecock crisisThe world of badminton is going through a shuttlecock crisis. With China shifting its food habits, the badminton community stares at an unprecedented crisis in its hands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-rain-death-glooding-waterlogging-flight-ops-imd-red-alert-2771963-2025-08-16",
      "headline": "2 dead as heavy rain batters Mumbai; roads waterlogged, flights hitMumbai has been battered by heavy rain since Friday, causing severe flooding and a deadly landslide. The situation has disrupted daily life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/in-alaska-trump-greets-putin-with-red-carpet-cold-war-jets-overhead-glbs-2771920-2025-08-16",
      "headline": "Trump flexes military might, greets Putin with B-2 bomber flyover in AlaskaTrump and Putin began their Alaska summit with a warm handshake and Cold War-era jets overhead, opening high-stakes talks on Ukraine amid symbolic displays of US military power.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-uer-ii-dwarka-expressway-cutting-noida-to-igi-airport-travel-2771980-2025-08-16",
      "headline": "Noida to Delhi airport in 20 minutes: PM to open UER-II, Dwarka ExpresswayPM Modi will inaugurate two major expressways improving connectivity to IGI Airport on Sunday. The projects aim to reduce travel time and ease traffic congestion across Delhi-NCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/stray-dogs-attacks-debate-delhi-supreme-court-speciesism-peter-singer-philosophers-say-pigs-animals-2770783-2025-08-16",
      "headline": "Are hands that feed strays to blame for dog attacks?Our preference for dogs over other animals reflects speciesism. We favour those we live with and love, not those whose suffering is equal. Protecting dogs is valid, but not at the predictable cost of vulnerable humans. Here's a philosophical take on the stray dog debate that takes into account ethics and morality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-rates-alaska-summit-with-putin-10-despite-no-ukraine-ceasefire-glbs-2771954-2025-08-16",
      "headline": "No truce, Trump puts ball on Zelenskyy's court after '10/10' meet with PutinUS President Donald Trump said Friday that he and Russian President Vladimir Putin made \"very productive\" progress but reached no final agreement after a nearly three-hour summit in Anchorage, Alaska, focused on the war in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-terror-nexus-exposed-again-army-official-minister-honours-terrorist-killed-in-operation-sindoor-2771872-2025-08-15",
      "headline": "Pak's terror nexus exposed again: Top brass honour terrorist killed in Op SindoorTop Pakistan Army official and ministers were seen paying tribute at grave of Lashkar terrorist killed in Indian strike in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-quips-might-start-liking-hillary-clinton-over-nobel-peace-nod-glbs-2771927-2025-08-16",
      "headline": "Trump quips he might 'start liking' Hillary Clinton over Nobel Peace Prize nodHillary Clinton, who lost the 2016 presidential election to Trump, said on the \"Raging Moderates\" podcast that she would nominate Trump for a Nobel Peace Prize if he brought an end to the war in Ukraine while keeping Ukrainian territory intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-backed-first-2771866-2025-08-15",
      "headline": "Virat Kohli deserved support at first, not if slump lasts for 5 years: Irfan PathanIrfan Pathan believes that Virat Kohli should have been backed during his initial slump in form but backing him during a later dip came at the cost of the team"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/next-time-in-moscow-putin-extends-trump-invitation-as-alaska-summit-ends-glbs-2771949-2025-08-16",
      "headline": "Watch: In rare switch to English, Putin invites Trump, says 'next time in Moscow'Putin invited Trump to Moscow for a potential follow-up to their Alaska summit. Trump called it \"an interesting possibility\" but acknowledged it could draw political heat.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/tariffing-india-wont-end-ukraine-war-us-democrats-panel-says-punish-putin-2771900-2025-08-15",
      "headline": "Tariffing India won't end Ukraine war: US Democrats Panel says punish PutinThe panel said that if President Trump really wanted to stop the Ukraine war, he should punish Putin and provide direct military aid to Kyiv."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nisars-giant-reflector-fully-deployed-commissioning-underway-in-space-2771988-2025-08-16",
      "headline": "Nisar's giant reflector fully deployed, commissioning underway in spaceThe deployment of the gigantic reflector, which unfurled like a precision-made umbrella, is critical to Nisar's mission of capturing high-resolution radar imagery of Earth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-healthy-couch-potato-simple-tricks-to-binge-watch-and-still-feel-great-health-eye-health-diet-weight-loss-2771326-2025-08-16",
      "headline": "The healthy couch potato: Simple tricks to watch for hours and still feel greatBinge all weekend without the aches, eye strain, or snack guilt. These easy, zero-effort health tweaks will keep you comfortable, hydrated, and pain-free, even after hours on the couch... "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-514-15-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/watch-putin-pulls-a-face-at-journalists-question-in-viral-alaska-summit-donald-trump-moment-2771960-2025-08-16",
      "headline": "Watch: Putin pulls a face at journalist's question in viral Alaska summit momentWhen a journalist, seated across from Putin and Trump, asked him, \"Will you stop killing civilians?\", the Russian President pulled a strange expression and pointed to his ears — signalling that he either hadn't heard the question or couldn't understand it. The moment quickly turned into a meme fest on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-deeply-grateful-as-pm-narendra-modi-congratulates-him-on-50-years-in-cinema-2771964-2025-08-16",
      "headline": "Rajinikanth deeply grateful as PM Modi congratulates him on 50 years in cinemaPrime Minister Narendra Modi warmly congratulated Rajinikanth on completing 50 years in cinema, praising his iconic journey and diverse roles. The superstar expressed heartfelt gratitude in a post on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/body-expert-dissects-trump-putin-alaska-handshake-glbs-2771935-2025-08-16",
      "headline": "Like two old friends: Body language expert dissects Trump-Putin Alaska handshakePatty Ann Wood said the greeting was a blend of \"deference, control, and familiarity,\" with both leaders making calculated moves before the talks that could reshape the Ukraine war and US–Russia relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-and-raj-thackeray-to-form-alliance-in-upcoming-maharashtra-municipal-poll-says-sanjay-raut-2771904-2025-08-16",
      "headline": "Thackeray brothers to join forces for Maharashtra municipal polls: Sanjay RautShiv Sena MP Sanjay Raut announced that the alliance will contest elections not only in Mumbai but also in Nashik, Thane, and Kalyan-Dombivli, with the aim of uniting Marathi voters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-parliamentary-board-meet-finalise-vice-presidential-candidate-nda-2771871-2025-08-15",
      "headline": "BJP Parliamentary Board to meet on Sunday to finalise Veep pickThe BJP Parliamentary Board will meet on Sunday to finalise its Vice Presidential candidate, with the nomination set for August 21 following Jagdeep Dhankhar's sudden resignation citing health reasons. T"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-day-2-rajinikanth-reigns-supreme-with-rs-119-crore-in-india-2771984-2025-08-16",
      "headline": "Coolie box office Day 2: Rajinikanth reigns supreme with Rs 119 crore in IndiaRajinikanth's latest film 'Coolie' sets new records, becoming the first Tamil film to earn Rs 100 crore in two days, and breaking records overseas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-celebrates-family-milestones-india-independence-day-jonas-anniversaries-birthdays-2771976-2025-08-16",
      "headline": "Priyanka Chopra's New York celebrations blend family milestones, Independence DayPriyanka Chopra marked a series of family celebrations and extended her best wishes for India's Independence Day. Alongwith a bunch of lively photos, the celebrated star wrote a thoughtful and lengthy note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-deeply-grateful-as-pm-narendra-modi-congratulates-him-on-50-years-in-cinema-2771964-2025-08-16",
      "headline": "Rajinikanth deeply grateful as PM Modi congratulates him on 50 years in cinemaPrime Minister Narendra Modi warmly congratulated Rajinikanth on completing 50 years in cinema, praising his iconic journey and diverse roles. The superstar expressed heartfelt gratitude in a post on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dear-students-teaser-nayanthara-nivin-pauly-reunite-in-comedy-drama-with-a-twist-2771958-2025-08-16",
      "headline": "Dear Students teaser: Nayanthara, Nivin Pauly reunite in comedy drama with a twistThe teaser for 'Dear Students', starring Nayanthara and Nivin Pauly, sets up a mystery-filled narrative. Directed by Sandeep Kumar and George Philip Roy, it features intriguing characters and action sequences."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-2025-26-season-preview-mikel-arteta-title-challenge-2771994-2025-08-16",
      "headline": "Premier League: Can Mikel Arteta crack the code and lead Arsenal to glory?After years of near-misses, Mikel Arteta's Arsenal enter 2025-26 with new signings, depth, and belief. Is this the year they win it all? The Gunners are under pressure to deliver silverware, but their squad will once again be put to the test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-cricket-bob-simpson-passes-away-89-former-captain-coach-2771989-2025-08-16",
      "headline": "Former Australia captain and coach Bob Simpson dies at 89Former Australia captain and their first full-time coach Bob Simpson passed away on Saturday, August 16, at the age of 89. Simpson is considered to be an influential figure in the history of Australian cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-shuttlecocks-crisis-bai-secretary-2771982-2025-08-16",
      "headline": "How China's changing food habits has forced a shuttlecock crisisThe world of badminton is going through a shuttlecock crisis. With China shifting its food habits, the badminton community stares at an unprecedented crisis in its hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-irfan-pathan-2009-selection-call-career-hint-2771983-2025-08-16",
      "headline": "Dhoni to blame? Irfan Pathan hints at career-threatening selection call in 2009Irfan Pathan hinted that MS Dhoni played a crucial role in his 2009 omission from the India ODI team, despite some strong performances. Pathan's career slowly came to an end after being dropped from the side during the tour of New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohammed-salah-diogo-jota-liverpool-tribute-premier-league-2771979-2025-08-16",
      "headline": "Watch: Mohamed Salah in tears as Liverpool fans sing Jota tribute at AnfieldMohamed Salah was moved to tears as Liverpool honoured the late Diogo Jota in their opening game. The emotional tribute highlighted the deep bond between players and fans amid the recent tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2025-liverpool-bournemouth-antoine-semenyo-racist-abuse-anfield-2771962-2025-08-16",
      "headline": "Racist abuse of Antoine Semenyo overshadows Liverpool's win over BournemouthLiverpool's 4-2 win over Bournemouth in the Premier League 2025-26 opener was overshadowed as Antoine Semenyo suffered racist abuse at Anfield, forcing a first-half stoppage. Semenyo scored a brace for the Cherries despite the incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-wicketkeeper-sanju-samson-jitesh-sharma-ishan-kishan-dhruv-jurel-2771956-2025-08-16",
      "headline": "India face tricky wicketkeeping puzzle ahead of Asia Cup title defenceAsia Cup 2025: With less than a month to go before the tournament, India face a tense wicketkeeping dilemma, balancing Sanju Samson's explosive centuries against the recent form and promise of Jitesh Sharma, Ishan Kishan, and Dhruv Jurel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arteta-backs-odegaard-captaincy-tony-adams-declan-rice-comments-2771899-2025-08-15",
      "headline": "Martin Odegaard to stay Arsenal captain after team vote, confirms Mikel ArtetaMikel Arteta has defended Martin Odegaard's captaincy after Tony Adams called for Declan Rice to take the armband. Arteta says a squad vote saw Odegaard win \"by 100 miles\" and insists his team will keep pushing for their first title since 2004."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-irfan-pathan-sydney-test-pr-stunt-2771873-2025-08-15",
      "headline": "Did Rohit Sharma pull a PR stunt with SCG Test snub? Pathan breaks silenceFormer Indian cricketer Irfan Pathan said that Rohit Sharma should have fought for his place and not dropped him from the New Year's Test earlier this year against Australia at the Sydney Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-backed-first-2771866-2025-08-15",
      "headline": "Virat Kohli deserved support at first, not if slump lasts for 5 years: Irfan PathanIrfan Pathan believes that Virat Kohli should have been backed during his initial slump in form but backing him during a later dip came at the cost of the team"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-wicketkeeper-sanju-samson-jitesh-sharma-ishan-kishan-dhruv-jurel-2771956-2025-08-16",
      "headline": "India face tricky wicketkeeping puzzle ahead of Asia Cup title defenceAsia Cup 2025: With less than a month to go before the tournament, India face a tense wicketkeeping dilemma, balancing Sanju Samson's explosive centuries against the recent form and promise of Jitesh Sharma, Ishan Kishan, and Dhruv Jurel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arteta-backs-odegaard-captaincy-tony-adams-declan-rice-comments-2771899-2025-08-15",
      "headline": "Martin Odegaard to stay Arsenal captain after team vote, confirms Mikel ArtetaMikel Arteta has defended Martin Odegaard's captaincy after Tony Adams called for Declan Rice to take the armband. Arteta says a squad vote saw Odegaard win \"by 100 miles\" and insists his team will keep pushing for their first title since 2004."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-irfan-pathan-sydney-test-pr-stunt-2771873-2025-08-15",
      "headline": "Did Rohit Sharma pull a PR stunt with SCG Test snub? Pathan breaks silenceFormer Indian cricketer Irfan Pathan said that Rohit Sharma should have fought for his place and not dropped him from the New Year's Test earlier this year against Australia at the Sydney Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-backed-first-2771866-2025-08-15",
      "headline": "Virat Kohli deserved support at first, not if slump lasts for 5 years: Irfan PathanIrfan Pathan believes that Virat Kohli should have been backed during his initial slump in form but backing him during a later dip came at the cost of the team"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}