{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Made to sign documents: Rani Kapur seeks AGM delay after son Sanjay Kapur's deathRani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "India-UK trade deal: How DCC agreement could open doors for Indian workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-under-old-regime-claim-these-5-home-loan-tax-benefits-new-tax-regime-2761154-2025-07-25",
      "headline": "Filing ITR under old regime? Claim these 5 home loan tax benefits If you are sticking to the old tax regime this year, make sure you don't miss out on the big tax savings your home loan can offer. Here are five home loan benefits you must know for your ITR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/who-has-to-file-itr-by-when-all-2025-deadlines-explained-income-tax-filing-2761076-2025-07-25",
      "headline": "Who has to file ITR by when? All 2025 deadlines explainedFiling your ITR on time can save you from paying extra penalties. But not everyone has the same deadline this year. Here's a quick look at who must file by when for the 2025 cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-why-stock-markets-are-in-the-red-today-2761014-2025-07-25",
      "headline": "Sensex tumbles over 600 points: Why stock markets are in the red today The benchmark S&P BSE Sensex fell 624.64 points to 81,559.53 by 10:41 am, while the NSE Nifty50 slipped 215.85 points to 24,846.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-gain-11-percent-why-reason-q1-results-indian-energy-exchange-stock-up-2761005-2025-07-25",
      "headline": "Explained: Why IEX share price gained 11% todayIEX stock opened at Rs 137.00 today, higher than the previous close of Rs 132.45. It climbed further to touch a high of Rs 149.45 in morning trade. As of 9:37 am, the share was trading at Rs 146.80, up 10.84%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-bajaj-finance-shares-tumbled-up-to-6-percent-despite-strong-q1-results-2761000-2025-07-25",
      "headline": "Explained: Why Bajaj Finance shares tumbled 6% despite strong Q1 resultsThe Bajaj Finance stock was down 5.42% at Rs 907 on the BSE at around 9:28 am, while Bajaj Finserv also fell nearly 5%. Bajaj Finance touched an intraday low of Rs 898.10, marking a 6.3% decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nsdl-ipo-check-price-band-gmp-key-dates-issue-size-and-more-2760994-2025-07-25",
      "headline": "NSDL IPO: Check price band, GMP, key dates, issue size and moreThe IPO, a pure offer for sale, aims to raise Rs 4,011 crore. It will open for subscription on July 30 and close on August 1, with anchor bids starting a day earlier on July 29."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-falls-300-points-at-opening-nifty-below-25000-bajaj-finance-tanks-5-percent-2760986-2025-07-25",
      "headline": "Sensex falls 300 points at opening, Nifty below 25,000; Bajaj Finance tanks 5%The S&P BSE Sensex was down by 389.42 points to 81,794.75, while the NSE Nifty50 lost 133.70 points to 24,928.40 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-q1-results-indian-energy-exchange-stock-in-focus-why-cerc-market-coupling-2760976-2025-07-25",
      "headline": "IEX stock: Indian Energy Exchange shares to be in focus today. Here's whyIEX shares fell sharply on Thursday, July 24. The stock dropped as much as 28% and touched a 52-week low of Rs 135.26 on the BSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-layoffs-25000-job-cut-ceo-lip-bu-tan-chipmaker-cost-cutting-tech-roles-us-report-restructuring-2760964-2025-07-25",
      "headline": "Intel layoffs: 25,000 roles at risk as company braces for big reset, says reportIn a letter to employees, Intel's new CEO Lip-Bu Tan acknowledged the difficult period the company is going through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-microsoft-tech-hiring-in-us-donald-trump-warning-indians-ai-race-america-first-policy-2760959-2025-07-25",
      "headline": "Why Donald Trump doesn't want Google, Microsoft to hire IndiansSpeaking at an AI Summit in Washington on Wednesday, Donald Trump said American companies must now put national interest first, especially in the fast-growing field of artificial intelligence."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-review-vaani-kapoor-ambitious-thriller-dares-to-dig-deep-but-loses-its-way-2761160-2025-07-25",
      "headline": "Mandala Murders Review: An ambitious thriller that dares to dig deep, but loses its wayRelease Date:Fri Jul 25, 2025Mandala Murders series review: 'Mandala Murders', Netflix's latest Hindi thriller, weaves Indian mythology and crime in a gripping yet uneven narrative set in Uttar Pradesh. While rich in atmosphere and performances, the series struggles with pacing and clarity, making it a one-time watch for thriller enthusiasts in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-7-detailed-report-what-a-fascinating-1st-week-for-ahaan-panday-aneet-padda-love-story-2761173-2025-07-25",
      "headline": "Saiyaara box office Day 7: What a fascinating 1st week for Ahaan-Aneet's love story!YRF's 'Saiyaara' has made the audience rush to theatres. The Ahaan Panday and Aneet Padda starrer finished its glorious first week at the box office, and performed so well that every day seemed like a celebration in cinema halls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-sreeleela-bobby-deol-team-new-film-title-to-be-out-soon-2761146-2025-07-25",
      "headline": "Ranveer Singh, Sreeleela, Bobby Deol team up for new film, title to be out soonRanveer Singh, Sreeleela and Bobby Deol are set to team up for a new film. The title and first look of the upcoming project will be out next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-collection-day-1-detailed-report-pawan-kalyan-film-beats-vakeel-saab-for-biggest-opening-of-career-2761140-2025-07-25",
      "headline": "Hari Hara Veera Mallu box office Day 1: Pawan Kalyan's film beats Vakeel SaabPawan Kalyan's film 'Hari Hara Veera Mallu' breaks records with Rs 44 crore opening day collection, surpassing the opening record of his previous hit, 'Vakeel Saab'. Here's how the film fared on its first day at the box office in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-x-review-marvel-new-film-masterpiece-vanessa-kirby-pedro-pascal-2761023-2025-07-25",
      "headline": "Fantastic Four First Steps X review: Fans praise MCU's strongest masterpiece yetMarvel's 'The Fantastic Four: First Steps' released in theatres today with mixed reviews. Fans praised the stellar performances of the actors Vanessa Kirby and Pedro Pascal, who stand out in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-kelce-taylor-swift-romance-instagram-lock-screen-official-2761092-2025-07-25",
      "headline": "Travis Kelce makes his romance with Taylor Instagram and lock screen officialTravis Kelce posted some adorable couple photos with Taylor Swift on Instagram, revealing that his phone lock screen is a black-and-white picture of the two of them together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-launches-kindness-curriculum-so-positive-teach-children-empathy-art-2761087-2025-07-25",
      "headline": "Ananya Panday launches kindness curriculum to teach children empathy through artActor Ananya Panday is taking her mission of spreading kindness to the next level with the launch of a Kindness Curriculum under her So Positive platform, in collaboration with NGO Slam Out Loud. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-fans-disrupt-uk-screening-with-confetti-theatre-staff-respond-2761048-2025-07-25",
      "headline": "Chaos breaks out at Pawan Kalyan's Hari Hara Veera Mallu UK screening, video viralFans of the film 'Hari Hara Veera Mallu' caused a disruption at a UK theatre by throwing confetti during the screening, leading to widespread criticism and the screening being halted. The film, starring Pawan Kalyan, has received mixed reviews in India for its ambitious storyline but flawed execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/johny-lever-daughter-jamie-lever-recalls-being-asked-to-strip-in-scam-audition-2760989-2025-07-25",
      "headline": "Johny Lever's daughter Jamie recalls being asked to strip in scam auditionJamie Lever, actor-comedian and daughter of Johny Lever, recently recalled a disturbing audition experience where she was asked to strip. She shared that while she had been informed the role was 'bold', the audition quickly took an uncomfortable and inappropriate turn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-ayan-mukerji-hrithik-roshan-jr-ntr-kiara-advani-2761016-2025-07-25",
      "headline": "War 2 trailer: It's Hrithik Roshan vs Jr NTR in a never-seen-before action sagaThe much-anticipated trailer for 'War 2', starring the never-seen-before actor-duo Hrithik Roshan and Jr NTR is out. The film, a sequel to the 2019 film 'War', is scheduled for an Independence Day release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-fantastic-four-first-steps-review-marvel-first-family-gets-a-well-deserved-reboot-pedro-pascal-2761008-2025-07-25",
      "headline": "Fantastic Four First Steps review: Marvel's first family gets a well-deserved reboot Release Date:Fri Jul 25, 2025Marvel's 'The Fantastic Four: First Steps' refreshes the classic superhero team with a nostalgic yet modern twist, set in a vibrant 1960s retro-futuristic universe. The film shines through its heartfelt character moments and stylish visuals, making it a promising new beginning for the franchise despite some familiar villain shortcomings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-wants-to-drive-an-uber-in-barcelona-after-his-retirement-2760993-2025-07-25",
      "headline": "Fahadh Faasil wants to drive an Uber in Barcelona after his retirementMalayalam actor Fahadh Faasil has shared his heartfelt retirement dream of driving an Uber in Barcelona, highlighting his love for simple joys beyond cinema. The actor is currently promoting his latesy film 'Mareesan'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/su-from-so-movie-review-a-superb-natural-comedy-film-that-blends-well-with-social-drama-2760928-2025-07-25",
      "headline": "Su From So review: A superb natural comedy that doubles up as social dramaRelease Date:Fri Jul 25, 2025Su From So movie review: Directed by JP Thuminad, this Kannada comedy is a fun ride filled with laughter throughout. The film weaves social drama with comedy and presents a beautiful story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-finds-cheerleader-in-veer-pahariya-at-fashion-show-watch-video-2760960-2025-07-25",
      "headline": "Tara Sutaria finds cheerleader in Veer Pahariya at fashion show. Watch VideoActor Tara Sutaria and Veer Pahariya's chemistry at a recent fashion show added fuel to dating rumours. Their subtle gestures caught the fans' attention. They also clicked while leaving the event together as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rangeen-review-bold-gigolo-drama-falls-flat-viineet-kumar-siingh-2760925-2025-07-25",
      "headline": "Rangeen review: Bold gigolo drama loses impact in executionRelease Date:Fri Jul 25, 2025Rangeen series review: 'Rangeen' is a bold series about a man turning gigolo for revenge. The show, featuring Viineet Kumar Siingh and Rajshri Deshpande, struggles with tone and underdeveloped characters despite boasting an intriguing premise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mahavatar-narsimha-review-emotionally-uplifting-devotion-compassion-animation-mahavatar-cinematic-universe-2760938-2025-07-25",
      "headline": "Mahavatar Narsimha review: Emotionally uplifting tale about devotion, compassionRelease Date:Fri Jul 25, 2025'Mahavatar Narsimha' movie review: 'Mahavatar Narsimha' narrates the story of a young child named Prahlad's devotion to Lord Vishnu. The film makes a powerful statement about faith, compassion, hatred and devotion. Is the animation movie worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/heisenberg-devara-leo-lyricist-director-lokesh-kanagaraj-gives-clue-2760751-2025-07-25",
      "headline": "Who is Heisenberg, Tamil cinema's anonymous lyricist? Here's an interesting clueTamil cinema boasts a lyricist named Heisenberg, who is known only by his name. Director Lokesh Kanagaraj, who has worked with him, gave a clue without blowing his cover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-review-ibrahim-ali-khan-kajol-prithviraj-sukumaran-film-forgets-sar-loses-zameen-still-thinks-it-patriotic-2760917-2025-07-25",
      "headline": "Sarzameen review: A film that forgets Sar, loses Zameen, still thinks it's patrioticRelease Date:Fri Jul 25, 2025Sarzameen movie review: In this Ibrahim Ali Khan, Kajol and Prithviraj Sukumaran-starrer, neither the patriotism lands nor the emotional family drama connects. What you get instead is a hollow story trying hard to feel important."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-july-25-mandala-murders-the-sandman-season-2-2760502-2025-07-25",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup caters to a diverse audience base. From intense crime-dramas to spine-chilling horror as well as fantasy and comedy genres, there is a mix of various themes in this weekend's releases which appeals to all viewers."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ullu-altt-desiflix-and-other-ott-platforms-banned-for-showing-soft-porn-content-2761128-2025-07-25",
      "headline": "Ullu, ALTT, Desiflix, among 25 OTT platforms banned for showing soft pornThe government has cracked down on multiple streaming platforms like Ullu, ALTT and Desiflix for hosting soft porn, blocking apps, websites and social media handles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/roof-of-school-building-collapses-in-rajasthans-jhalawar-many-feared-dead-2760997-2025-07-25",
      "headline": "7 students dead, over 15 injured as school roof collapses in Rajasthan's JhalawarThe roof of a primary school collapsed in Rajasthan's Jhalawar on Friday morning, leaving six  students dead and at over 15 injured. Several others are feared trapped under the debris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/avoid-travel-to-7-provinces-india-issues-advisory-on-thailand-amid-clash-with-cambodia-2761143-2025-07-25",
      "headline": "Avoid travel to 7 provinces: India's advisory on Thailand amid clash with CambodiaThe escalating clashes between Thailand and Cambodia along their disputed border have killed at least 14 people, injured several others, and forced mass evacuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-congress-should-serve-jagdeep-dhankhar-some-dhokla-bjp-indira-gandhi-resignation-vice-president-election-2760947-2025-07-25",
      "headline": "Why Congress should serve Dhankhar some dhoklaWill Jagdeep Dhankhar return in a non-BJP avatar? It shouldn't be difficult for a protégé of Chaudhary Charan Singh, known for his flexibility, but will Opposition parties, especially the Congress, make the most of a disgruntled BJP leader? The Opposition would do well to serve Dhankhar some dhokla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-london-visit-chai-pe-charcha-viral-video-akhil-patel-tea-seller-2761139-2025-07-25",
      "headline": "From one chaiwala to another: Indian tea seller's viral moment with PM in UKThe incident happened when PM Modi and his British counterpart Keir Starmer marked the signing of the landmark free trade agreement (FTA) by sharing a cup of tea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dharmasthala-whistleblower-karnataka-rape-murder-mass-burial-sowjanya-sit-probe-five-big-questions-2760717-2025-07-25",
      "headline": "Dharmasthala mass-burial case: 5 big questions that raise a stinkA probe by an SIT has been ordered by the Karnataka government into allegations that mass burials of raped and murdered women were carried out over the years in Dharmasthala, a popular temple town. Despite the claims by a whistleblower, there are several unanswered questions that make the case curious."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Made to sign documents: Rani Kapur seeks AGM delay after son Sanjay Kapur's deathRani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/deadline-looming-how-the-mammoth-bihar-voter-roll-revision-is-unfolding-on-the-ground-2760625-2025-07-24",
      "headline": "How the mammoth Bihar voter roll revision is unfolding on the groundThe exercise has been a mixed bag: over 90 per cent voters tracked, 1.86 million reported deceased, 2.6 million shifted, 750,000 on multiple lists and 11,000 untraceable"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-review-vaani-kapoor-ambitious-thriller-dares-to-dig-deep-but-loses-its-way-2761160-2025-07-25",
      "headline": "Mandala Murders Review: An ambitious thriller that dares to dig deep, but loses its wayRelease Date:Fri Jul 25, 2025Mandala Murders series review: 'Mandala Murders', Netflix's latest Hindi thriller, weaves Indian mythology and crime in a gripping yet uneven narrative set in Uttar Pradesh. While rich in atmosphere and performances, the series struggles with pacing and clarity, making it a one-time watch for thriller enthusiasts in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-consensus-government-opposition-bihar-sir-operation-sindoor-2761189-2025-07-25",
      "headline": "Differences ironed out, Lok Sabha to see smooth functioning from MondayDifferences ironed out, Lok Sabha to see smooth functioning from Monday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/menopause-before-30-is-rising-what-it-means-for-fertility-and-how-ivf-helps-2761067-2025-07-25",
      "headline": "Menopause before 30 is rising: What it means for fertility and how IVF helpsWhat exactly is early menopause? Why is it happening to younger Indian women? And why are so few people talking about it? Doctors answer on World IVF Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "India-UK trade deal: How DCC agreement could open doors for Indian workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/will-the-whole-world-go-dark-on-august-2-heres-the-truth-total-solar-eclipse-2761080-2025-07-25",
      "headline": "Will the whole world go dark on August 2?Some posts even claim a once-in-a-century event will unfold in 2025, sending schools and skywatchers into a frenzy of false anticipation.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-foreign-visits-expenditure-2021-2025-rajya-sabha-2761125-2025-07-25",
      "headline": "PM's foreign trips cost Centre Rs 362 crore in 5 years, Rs 67 crore in 2025 alonePM Modi's foreign visits from 2021 to 2025 cost the government over Rs 362 crore. The most expensive in 2025 was his trip to France at over Rs 25 crore, according to data shared in the Rajya Sabha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-rishabh-pant-jofra-archer-manchester-test-2761071-2025-07-25",
      "headline": "Just not cricket: Should Stokes and Archer have attacked Pant's broken toe?ENG vs IND, 4th Test: Rishabh Pant sustained a toe injury on Day 1 at Old Trafford, but the left-handed batter returned to score a gutsy half-century on the second day, helping India put up a score of 358 on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thailand-rejects-mediation-from-third-countries-amid-conflict-with-cambodia-2761155-2025-07-25",
      "headline": "Thailand rejects mediation from third countries amid conflict with CambodiaSimmering border tensions between Thailand and Cambodia have flared into open hostilities at multiple locations along the frontline, with exchanges of artillery for a second straight day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/foreigner-records-video-of-slums-from-chennai-5-star-hotel-sparks-india-wealth-gap-debate-2761110-2025-07-25",
      "headline": "Foreigner's 'slums near Chennai 5-star hotel' video sparks India wealth gap debateDeclan Rowlands, a travel influencer, shared a video from a gym at a luxury hotel in Chennai with a striking view overlooking modest housing structures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-looming-google-earth-lens-how-indias-strategic-assets-lie-exposed-vulnerable-to-harm-2760192-2025-07-23",
      "headline": "How India's strategic assets lie exposed, vulnerable to harmWith detailed imagery of military bases, nuclear plants, border posts and more easily accessible to Open Source Intelligence, how dangerous is this for national security?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/convict-serving-life-sentence-in-2011-soumya-rape-murder-case-escapes-from-high-security-prison-in-kerala-2761001-2025-07-25",
      "headline": "Disabled rape-murder convict scales 15-foot wall to escape Kerala jail, caughtGovindachamy, convicted in the 2011 Soumya rape and murder case, escaped from Kannur Central Jail but was caught hours later. CCTV footage surfaced. Jail DGP confirmed his arrest and promised action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-bank-women-short-dresses-government-employees-protest-ban-taliban-controversy-2761025-2025-07-25",
      "headline": "'Talibani era' in Bangladesh? Dress code for women, protest gag order spark rowEarlier this week, the Bangladesh Bank caused a storm after it barred women employees from wearing short dresses and clothing with short sleeves. After a backlash, it withdrew the order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/overlooked-signs-of-anxiety-in-daily-life-2760659-2025-07-25",
      "headline": "Overlooked signs of anxiety in daily lifeFeeling a little off lately? Tapping your feet nonstop? Overthinking something on repeat? These could be subtle signs of anxiety hiding in plain sight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xavi-hernandez-applicant-aiff-head-coaching-job-vacancy-2761044-2025-07-25",
      "headline": "Barcelona legend Xavi applies for coaching role, AIFF rejects: ReportThe AIFF was left stumped after the legendary Spanish midfielder, Xavi Hernandez had applied for the role of India's new head coach after Manolo Marquez's departure from the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kamal-haasan-enters-rajya-sabha-takes-mp-oath-in-tamil-2761051-2025-07-25",
      "headline": "Kamal Haasan makes Parliament debut, takes oath in Tamil as Rajya Sabha MPActor and MNM chief Kamal Haasan took oath in Tamil as a Rajya Sabha MP on Friday. Backed by DMK, he was elected unopposed after opting for a Parliament seat over the Lok Sabha polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-review-ibrahim-ali-khan-kajol-prithviraj-sukumaran-film-forgets-sar-loses-zameen-still-thinks-it-patriotic-2760917-2025-07-25",
      "headline": "Sarzameen review: A film that forgets Sar, loses Zameen, still thinks it's patrioticRelease Date:Fri Jul 25, 2025Sarzameen movie review: In this Ibrahim Ali Khan, Kajol and Prithviraj Sukumaran-starrer, neither the patriotism lands nor the emotional family drama connects. What you get instead is a hollow story trying hard to feel important."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-7-detailed-report-what-a-fascinating-1st-week-for-ahaan-panday-aneet-padda-love-story-2761173-2025-07-25",
      "headline": "Saiyaara box office Day 7: What a fascinating 1st week for Ahaan-Aneet's love story!YRF's 'Saiyaara' has made the audience rush to theatres. The Ahaan Panday and Aneet Padda starrer finished its glorious first week at the box office, and performed so well that every day seemed like a celebration in cinema halls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-sreeleela-bobby-deol-team-new-film-title-to-be-out-soon-2761146-2025-07-25",
      "headline": "Ranveer Singh, Sreeleela, Bobby Deol team up for new film, title to be out soonRanveer Singh, Sreeleela and Bobby Deol are set to team up for a new film. The title and first look of the upcoming project will be out next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-collection-day-1-detailed-report-pawan-kalyan-film-beats-vakeel-saab-for-biggest-opening-of-career-2761140-2025-07-25",
      "headline": "Hari Hara Veera Mallu box office Day 1: Pawan Kalyan's film beats Vakeel SaabPawan Kalyan's film 'Hari Hara Veera Mallu' breaks records with Rs 44 crore opening day collection, surpassing the opening record of his previous hit, 'Vakeel Saab'. Here's how the film fared on its first day at the box office in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-x-review-marvel-new-film-masterpiece-vanessa-kirby-pedro-pascal-2761023-2025-07-25",
      "headline": "Fantastic Four First Steps X review: Fans praise MCU's strongest masterpiece yetMarvel's 'The Fantastic Four: First Steps' released in theatres today with mixed reviews. Fans praised the stellar performances of the actors Vanessa Kirby and Pedro Pascal, who stand out in the film."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dc-open-emma-raducanu-naomi-osaka-venus-williams-round-of-16-results-2761182-2025-07-25",
      "headline": "DC Open: Raducanu dominates Osaka, Venus Williams defeated in pre-quartersEmma Raducanu cruised past Naomi Osaka 6-4, 6-2 to reach the Washington Open quarter-finals and reclaim the British No. 1 spot. Venus Williams' comeback ended with a straight-sets loss to Magdalena Frech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-aakash-chopra-england-vs-india-manchester-test-2761149-2025-07-25",
      "headline": "Pant wasn't even able to walk: Chopra hails batter's unbreakable spiritENG vs IND, 4th Test: Rishabh Pant showed incredible courage by batting with a fractured toe during the fourth Test against England. Former cricketer Aakash Chopra praised his spirit, calling it inspiring and unforgettable. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-needs-virat-kohli-mentality-test-series-comeback-manchester-2761123-2025-07-25",
      "headline": "Need that Virat Kohli mentality: Gill urged to lead India's series comebackENG vs IND: Michael Vaughan feels that Shubman Gill and Co need to channel in that Virat Kohli mentality to lead a fightback on Day 3 of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-england-vs-india-manchester-test-2761115-2025-07-25",
      "headline": "Not one backup middle-order batter: Chopra questions India's squad balanceENG vs IND, 4th Test: Aakash Chopra raised concerns about India's lack of middle-order depth after Day 2 of the fourth Test. While the visitors struggled with their batting balance, Ben Stokes and Jofra Archer's standout performances helped keep England in the game with a disciplined effort.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-rishabh-pant-jofra-archer-manchester-test-2761071-2025-07-25",
      "headline": "Just not cricket: Should Stokes and Archer have attacked Pant's broken toe?ENG vs IND, 4th Test: Rishabh Pant sustained a toe injury on Day 1 at Old Trafford, but the left-handed batter returned to score a gutsy half-century on the second day, helping India put up a score of 358 on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ravi-shastri-england-vs-india-4th-test-2761054-2025-07-25",
      "headline": "If Rishabh Pant's bravery doesn't lift India, nothing will: Ravi ShastriENG vs IND, 4th Test: Rishabh Pant showed grit and came out to bat in Manchester despite a toe injury. He scored 54 runs and helped India put up 358 on the board in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xavi-hernandez-applicant-aiff-head-coaching-job-vacancy-2761044-2025-07-25",
      "headline": "Barcelona legend Xavi applies for coaching role, AIFF rejects: ReportThe AIFF was left stumped after the legendary Spanish midfielder, Xavi Hernandez had applied for the role of India's new head coach after Manolo Marquez's departure from the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-kuldeep-yadav-england-vs-india-manchester-2761015-2025-07-25",
      "headline": "Obsession with batting: Ashwin slams India for underutilising KuldeepENG vs IND, 4th Test: Former Indian spinner R Ashwin questioned India's priorities in the series against England, urging the team to value wicket-taking ability over marginal lower-order runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-tactics-ricky-ponting-jasprit-bumrah-bowling-end-manchester-test-2761011-2025-07-25",
      "headline": "Shubman Gill's tactics slammed by Ponting: Bumrah bowled from wrong endRicky Ponting was heavily critical of Shubman Gill's captaincy on Day 2 of the Manchester Test. The former Australian skipper reckons that Gill has gotten it wrong tactically giving England a quick start in the first innings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-india-england-nasser-hussain-manchester-2760969-2025-07-25",
      "headline": "Poor India handed Rishabh Pant's runs back to England: Nasser HussainENG vs IND, 4th Test: Nasser Hussain said that India were poor in their tactics on Day 2, allowing England to dominate in the ongoing Test at the Old Trafford in Manchester. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-yash-dayal-sexual-harrasment-case-trouble-2760979-2025-07-25",
      "headline": "Yash Dayal in more trouble, faces another sexual harassment caseAn FIR has been registered against cricketer Yash Dayal after a woman accused him of sexually assaulting her over two years, allegedly using emotional manipulation and false promises of helping her build a cricket career to exploit her.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xavi-hernandez-applicant-aiff-head-coaching-job-vacancy-2761044-2025-07-25",
      "headline": "Barcelona legend Xavi applies for coaching role, AIFF rejects: ReportThe AIFF was left stumped after the legendary Spanish midfielder, Xavi Hernandez had applied for the role of India's new head coach after Manolo Marquez's departure from the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-kuldeep-yadav-england-vs-india-manchester-2761015-2025-07-25",
      "headline": "Obsession with batting: Ashwin slams India for underutilising KuldeepENG vs IND, 4th Test: Former Indian spinner R Ashwin questioned India's priorities in the series against England, urging the team to value wicket-taking ability over marginal lower-order runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-tactics-ricky-ponting-jasprit-bumrah-bowling-end-manchester-test-2761011-2025-07-25",
      "headline": "Shubman Gill's tactics slammed by Ponting: Bumrah bowled from wrong endRicky Ponting was heavily critical of Shubman Gill's captaincy on Day 2 of the Manchester Test. The former Australian skipper reckons that Gill has gotten it wrong tactically giving England a quick start in the first innings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-india-england-nasser-hussain-manchester-2760969-2025-07-25",
      "headline": "Poor India handed Rishabh Pant's runs back to England: Nasser HussainENG vs IND, 4th Test: Nasser Hussain said that India were poor in their tactics on Day 2, allowing England to dominate in the ongoing Test at the Old Trafford in Manchester. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-yash-dayal-sexual-harrasment-case-trouble-2760979-2025-07-25",
      "headline": "Yash Dayal in more trouble, faces another sexual harassment caseAn FIR has been registered against cricketer Yash Dayal after a woman accused him of sexually assaulting her over two years, allegedly using emotional manipulation and false promises of helping her build a cricket career to exploit her.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zak-crawley-shubman-gill-lords-test-manchester-press-conference-2760956-2025-07-25",
      "headline": "It wasn't intentional: Crawley hits back at Shubman's 90 seconds claimENG vs IND, 4th Test: England opener Zak Crawley responded to Shubman Gill's claims that England were 90 seconds late to come out to bat in their second innings of the Lord's Test. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pants-pain-bearing-capacity-is-immense-shardul-thakur-2760919-2025-07-25",
      "headline": "Rishabh Pant's pain-bearing capacity is high, spirit unmatched: Shardul ThakurIndia all-rounder Shardul Thakur hailed Rishabh Pant for his immense pain-bearing capacity as the wicketkeeper-batter battled through a toe fracture to bat for the team during the fourth Test at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-manchester-test-injury-substitutes-system-drs-2760922-2025-07-25",
      "headline": "DRS: Is it time for injury replacements in cricket?Rishabh Pant braved the pain to come out and bat for India on Day 2 of the Manchester Test after suffering a broken toe. While Pant won hearts with his bravery, was it a move that was necessary? Could we have a system where a substitute for a seriously injured player can be brought in to maintain the balance between both sides? In the latest edition of India Today's Democratic Review System, we discuss whether substitutes are needed in cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/hulk-hogan-death-john-cena-triple-h-ric-flair-tribute-2760911-2025-07-25",
      "headline": "Hulk Hogan dies: Cena, Triple H and wrestling world mourn death of WWE legendJohn Cena, Triple H and the wrestling world paid their tributes to Hulk Hogan after the WWE Hall Of Famer passed away on Thursday, July 24. Hogan leaves behind a rich legacy as one of the greatest of all time in wrestling history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-41-ball-century-vs-england-champions-in-wcl-2760907-2025-07-25",
      "headline": "AB de Villiers goes berserk, slams 41-ball century vs England Champions in WCLSouth Africa Champions captain AB de Villiers clobbered a 41-ball hundred during Match 8 of the World Championship of Legends (WCL) against England Champions and guided them to a 10-wicket win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-4th-test-day-2-rishabh-pant-fight-indian-bowlers-manchester-2760878-2025-07-24",
      "headline": "Manchester Test: Injured Pant puts up brave fight, but bowlers drop the ballManchester Test, Day 2: Rishabh Pant showed great courage batting with a fractured toe to push India's total past 350. However, India's bowling unit failed to contain England as they reduced the deficit significantly by stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-6th-t20i-report-tim-seifert-ish-sodhi-2760876-2025-07-24",
      "headline": "Seifert, Rachin and Sodhi help New Zealand thump Zimbabwe before finalTim Seifert and Ish Sodhi starred as New Zealand defeated Zimbabwe by 60 runs in the tri-series. The win keeps New Zealand unbeaten and gain momentum ahead of their final against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-reaches-final-faces-divya-deshmukh-all-indian-womens-world-cup-2760871-2025-07-24",
      "headline": "Koneru Humpy sets up historic all-Indian Women's World Cup final vs Divya DeshmukhGrandmaster Koneru Humpy advanced to the final of the FIDE Women's World Cup after a thrilling tiebreak victory over China's Lei Tingjie. She will face 19-year-old Divya Deshmukh in the first-ever all-Indian final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-41-ball-century-vs-england-champions-in-wcl-2760907-2025-07-25",
      "headline": "AB de Villiers goes berserk, slams 41-ball century vs England Champions in WCLSouth Africa Champions captain AB de Villiers clobbered a 41-ball hundred during Match 8 of the World Championship of Legends (WCL) against England Champions and guided them to a 10-wicket win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-4th-test-day-2-rishabh-pant-fight-indian-bowlers-manchester-2760878-2025-07-24",
      "headline": "Manchester Test: Injured Pant puts up brave fight, but bowlers drop the ballManchester Test, Day 2: Rishabh Pant showed great courage batting with a fractured toe to push India's total past 350. However, India's bowling unit failed to contain England as they reduced the deficit significantly by stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-6th-t20i-report-tim-seifert-ish-sodhi-2760876-2025-07-24",
      "headline": "Seifert, Rachin and Sodhi help New Zealand thump Zimbabwe before finalTim Seifert and Ish Sodhi starred as New Zealand defeated Zimbabwe by 60 runs in the tri-series. The win keeps New Zealand unbeaten and gain momentum ahead of their final against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-reaches-final-faces-divya-deshmukh-all-indian-womens-world-cup-2760871-2025-07-24",
      "headline": "Koneru Humpy sets up historic all-Indian Women's World Cup final vs Divya DeshmukhGrandmaster Koneru Humpy advanced to the final of the FIDE Women's World Cup after a thrilling tiebreak victory over China's Lei Tingjie. She will face 19-year-old Divya Deshmukh in the first-ever all-Indian final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-3rd-t20i-score-shahibzada-farhan-2760867-2025-07-24",
      "headline": "Pakistan avoid embarrassing clean sweep in Bangladesh, win 3rd T20I in DhakaBAN vs PAK, 3rd T20I: Pakistan rode on a quick-fire 63 from Sahibzada Farhan and an all-round bowling effort to hammer Bangladesh by 74 runs and avoid a clean sweep in Dhaka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-resumption-aiff-kalyan-chaubey-new-india-coach-2760858-2025-07-24",
      "headline": "ISL will take place this year, new India coach in 10 days: Kalyan ChaubeyAll India Football Federation president Kalyan Chaubey has assured that the Indian Super League will take place this year. The AIFF chief also said that the new India coach will be announced in 10 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-hulk-hogan-dies-71-cardiac-arrest-wrestling-2760845-2025-07-24",
      "headline": "WWE great Hulk Hogan dies at 71 due to cardiac arrestLegendary American wrestler Hulk Hogan died due to cardiac arrest, aged 71, on Thursday, WWE confirmed on Thursday. Hogan helped World Wrestling Entertainment catapult into mainstream popularity in the 1980s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-badminton-pv-sindhu-fan-unnati-hooda-profile-2760812-2025-07-24",
      "headline": "Who is Unnati Hooda? 17-year-old PV Sindhu fan who just stunned her idolChina Open 2025: At 17, Unnati Hooda clinched the biggest win of her career when she defeated PV Sindhu in the pre-quarterfinals of the Super 1000 tournament on Thursday. The Haryana shuttler, a fan of Sindhu, is starting to make waves at the highest level. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-cover-n-jagadeesan-manchester-test-2760796-2025-07-24",
      "headline": "N Jagadeesan to be added to India squad as cover for injured Rishabh PantN Jagadeesan is reportedly being roped in as cover for the injured Rishabh Pant for the remainder of the England vs India series. Pant came out to bat despite his injury on Day 2 of the Manchester Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alexander-isak-leave-newcastle-united-transfer-report-rumours-2760788-2025-07-24",
      "headline": "Newcastle United's Alexander Isak keen to explore transfer options: ReportAlexander Isak has reportedly told Newcastle United of his desire to leave the club and explore his options with another club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-character-sanjiv-goenka-manchester-test-2760766-2025-07-24",
      "headline": "This is character: Sanjiv Goenka salutes Pant's fight in Manchester TestENG vs IND: Rishabh Pant received massive praise from the Lucknow Super Giants owner, Sanjiv Goenka for his resolve and willpower to come out and bat despite the concerning injury on his foot.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injured-comes-to-bat-manchester-test-2760728-2025-07-24",
      "headline": "Watch: Manchester gives standing ovation as injured Pant walks out to batThe Old Trafford crowd were up on their feet as Rishabh Pant braved through the pain to come to bat on Day 2 of the Manchester Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/stefanos-tsitsipas-parts-ways-goran-ivanisevic-coach-tennis-news-2760718-2025-07-24",
      "headline": "Tsitsipas parts ways with coach Goran Ivanisevic after disappointing runTsitsipas' split with Ivanisevic marks another chapter in his ongoing struggle to recapture past brilliance—one that now demands both a rethink and a reset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-fit-to-bat-foot-injury-manchester-test-england-2760699-2025-07-24",
      "headline": "Injured Rishabh Pant available to bat if needed, won't keep wicketsIndia vs England: Rishabh Pant is available to bat if required, despite sustaining a foot injury on Day 1 of the ongoing Manchester Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}