{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-6-lakh-in-taxes-on-a-rs-13-lakh-car-ca-reveals-the-hidden-cost-2744873-2025-06-23",
      "headline": "Rs 6 lakh in taxes on a Rs 13 lakh car? CA reveals the hidden costUpgrading or buying a new car used to be a moment of joy for many middle-class families, but today, it's overshadowed by the heavy financial pressure it brings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-closure-iran-parliament-israel-us-attack-crude-oil-impact-price-rise-india-world-impact-2744885-2025-06-23",
      "headline": "Will Iran close Hormuz Strait? What it means for oil prices in India and worldThe Strait of Hormuz is a narrow waterway connecting the Persian Gulf with the Arabian Sea. It is one of the most important oil transport routes in the world. Nearly 20% of all global crude oil passes through this strait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/debt-disguised-as-achievement-financial-analyst-on-growing-emi-trap-2744876-2025-06-23",
      "headline": "Debt disguised as achievement: Financial expert on India's deepening EMI trapA rising income shouldn't come at the cost of peace of mind. Financial freedom means having choices, not just things. And that starts with avoiding EMIs that quietly chip away at your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-5-common-errors-in-pre-filled-forms-and-how-to-fix-it-2744833-2025-06-23",
      "headline": "Filing ITR? 5 common errors in pre-filled forms and how to fix itA pre-filled Income Tax Return (ITR) form is a partially completed form provided by the Income Tax Department to make filing easier for taxpayers. These forms are automatically filled with details taken from trusted sources such as your PAN, Aadhaar, Form 16, and bank data from Form 26AS and the AIS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-how-to-vacation-without-the-financial-hangover-2744803-2025-06-23",
      "headline": "Explained: How to vacation without the financial hangoverA dream vacation should leave you with great memories, not months of financial stress. With a little planning, you can enjoy the trip and return home without breaking your budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-markets-slide-after-us-iran-tensions-buy-the-dip-or-wait-it-out-2744790-2025-06-23",
      "headline": "Stock markets slide amid US-Iran tensions: Buy the dip or wait it out?The Nifty 50 fell 257.25 points to 24,855.15, and the BSE Sensex was down 863.78 points to 81,544.39 as of 9:49 am. Broader indices mirrored the decline, with both mid- and small-cap indices slipping sharply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-600-points-why-is-the-stock-market-down-falling-today-2744774-2025-06-23",
      "headline": "Sensex tumbles 700 points: Why is the stock market falling today?At around 9:19 am, the BSE Sensex was down 580 points, trading at 81,828.11, while the NSE Nifty50 fell over 175 points to 24,937.25. Broader market indices mirrored the slide, and volatility indicators jumped sharply, signalling a bumpy trading session ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-tanks-500-points-nifty-below-25000-infosys-down-2-percent-it-stocks-fall-2744771-2025-06-23",
      "headline": "Sensex, Nifty sink in early trade as US-Iran conflict rattles investorsThe S&P BSE Sensex was down by 791.58 points to 81,616.59, while the NSE Nifty lost 244.25 points to 24,868.15 as of 9:53 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/arisinfra-solutions-ipo-allotment-status-out-how-to-check-latest-gmp-listing-date-bse-link-intime-india-2744763-2025-06-23",
      "headline": "Arisinfra Solutions IPO allotment out: Here's how to check status and latest GMPInvestors who took part in the public issue can check their allotment status online through the Bombay Stock Exchange (BSE) website or the official registrar for the IPO, Link Intime India Private Ltd."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-23-trading-setup-sensex-nifty-crash-today-us-attack-iran-nse-bse-trading-key-levels-2744747-2025-06-23",
      "headline": "Stock market opening: Sensex, Nifty to crash today after US attack on Iran?The Gift Nifty futures, as of 8:10 am, were trading at 25,015, indicating a lower opening compared to the previous close of 25,112.4. Benchmark indices rose about 1.6% last week, driven by gains in financial stocks, which provided some cushion against the geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-23-nse-bse-trading-iran-israel-share-market-news-tcs-waree-hal-bel-makemytrip-2744743-2025-06-23",
      "headline": "Stocks to watch on June 23: TCS, Waree Renewable, HAL, BEL, MakeMyTripReports suggest the United States may have bombed a nuclear facility in Iran, triggering fresh concerns over the conflict with Israel. These developments could impact market sentiment on Dalal Street at the start of the week."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-oil-imports-strait-of-hormuz-iran-israel-conflict-us-strikes-nuclear-sites-2744663-2025-06-22",
      "headline": "Why India may not feel the heat if Iran closes Strait of HormuzIndia, which has traditionally sourced its oil from the Middle East and more recently from Russia, is unlikely to see a major impact on its energy reserves if Iran decides to shut down the vital oil corridor of the Strait of Hormuz."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fatima-sana-shaikh-recalls-being-treated-like-2nd-grade-actor-in-her-initial-days-2744837-2025-06-23",
      "headline": "Fatima Sana Shaikh recalls being treated like 2nd grade actor in her initial daysActor Fatima Sana Shaikh opened up about facing bias and disrespect during the early years of her career, especially while playing side roles. She also revealed how a co-star once tried to overshadow her in scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/johnny-depp-breaks-silence-on-amber-heard-case-will-fight-until-bitter-f-end-2744870-2025-06-23",
      "headline": "Will fight until bitter f****** end: Johnny Depp breaks silence on Amber Heard caseThree years after winning the defamation lawsuit against his ex-wife Amber Heard, actor Johnny Depp spoke about losing out on opportunities but sticking to speaking the truth without any fear. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-backs-deepika-padukone-8-hour-shift-request-bollywood-nikita-roy-2744852-2025-06-23",
      "headline": "Sonakshi Sinha backs Deepika's 8-hour shift request: You need time for yourselfSonakshi Sinha backed Deepika Padukone's work hour debate and said how it cannot be the same for female actors as well. In an exclusive chat, the actor said that she is all up for this. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-is-not-my-brother-darsheel-safary-on-not-reaching-out-to-actor-for-work-2744775-2025-06-23",
      "headline": "Aamir Khan is not my brother: Darsheel Safary on not reaching out to actor for workActor Darsheel Safary recently opened up on why he doesn't approach actor-producer Aamir Khan for work. He stated his reasons for not approaching Khan despite making his debut in the latter's directorial 'Taare Zameen Par'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suresh-gopi-anupama-parameswarans-film-2744822-2025-06-23",
      "headline": "Censor board stalls Union Minister Suresh Gopi's film over use of 'Janaki' in titleThe CBFC has asked the makers of Malayalam film, 'Janaki vs State of Kerala', to change the film's title due to religious concerns, delaying its release. Filmmakers and industry bodies in Kerala have criticised the demand and threatened protests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-collection-day-3-detailed-report-dhanush-telugu-film-scores-excellent-opening-weekend-2744817-2025-06-23",
      "headline": "Kuberaa box office Day 3: Dhanush's Telugu film scores excellent opening weekend'Kuberaa' has already emerged as Dhanush's biggest opener worldwide, and now it's on its way to surpassing 'Raayan' at the box office. The film saw a fantastic opening weekend in India. Monday looks promising. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-touches-chiranjeevi-feet-kuberaa-success-event-2744811-2025-06-23",
      "headline": "Dhanush touches Chiranjeevi's feet at event, Nagarjuna compares Rashmika to SrideviNagarjuna, Dhanush, and Rashmika Mandanna's latest release 'Kuberaa' refuses to slow down at the box office. The team recently held a grand event to celebrate the film's success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-collection-day-3-detailed-report-aamir-khan-does-the-unthinkable-in-1st-weekend-2744793-2025-06-23",
      "headline": "Sitaare Zameen Par box office Day 3: Aamir Khan does the unthinkable in 1st weekend'Sitaare Zameen Par' finished its opening weekend on a glorious run at the box office. The Aamir Khan film collected around Rs 60 crore nett in three days, and now it's looking at a very promising Monday to beat the lifetime collection of 'Laal Singh Chaddha'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-anupamaa-set-catches-fire-cine-association-seeks-action-no-injuries-reported-2744787-2025-06-23",
      "headline": "Anupamaa set catches fire: Cine association seeks action, no injuries reportedA massive fire broke out on the set of the popular TV show 'Anupamaa' in Mumbai's Film City early Monday, completely gutting the set just before shooting was about to begin. Fortunately, no one was injured, even though several crew members were present at the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mamitha-baiju-thalapathy-vijay-jana-nayagan-last-film-reply-2744785-2025-06-23",
      "headline": "Actor Mamitha asked Vijay if Jana Nayagan was his last film. His reply thrilled fansThalapathy Vijay had initially announced that 'Jana Nayagan' would be his last film so he could concentrate on his politics. Recently, actor Mamitha Baiju talked about the conversation she had with him about his final film"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-show-returns-to-youtube-on-different-channel-after-row-fans-want-new-content-2744769-2025-06-23",
      "headline": "Samay Raina's Latent show returns on YouTube after row, fans ask for new contentComedian Samay Raina's popular show, 'India's Got Latent's clips resurfaced on YouTube, sparking excitement among fans, with many wondering if there are going to be new episodes soon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-children-stand-sunjay-kapur-wife-priya-sachdev-prayer-meet-delhi-kareena-kapoor-saif-ali-khan-2744752-2025-06-23",
      "headline": "Karisma Kapoor, Kareena-Saif offer prayers at Sunjay Kapur's memorial meetKarisma Kapoor, along with her children, Samaira and Kiaan, attended the prayer meet of her ex-husband Sunjay Kapur in Delhi. The actor was joined by her sister Kareena Kapoor and Saif Ali Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-release-pakistani-actor-hania-aamir-release-skips-india-release-overseas-2744745-2025-06-23",
      "headline": "Diljit Dosanjh skips India release of Sardaar Ji 3 starring Pak actor Hania Aamir'Sardaar Ji 3', featuring Diljit Dosanjh and Pakistani actor Hania Aamir, will not release in India due to the Indian film industry's ban on Pakistani actors. The film is set for an overseas release on June 27 and is a horror comedy satire on ghostbusting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/trisha-thalapathy-vijay-birthday-viral-photo-2744727-2025-06-23",
      "headline": "Actor Trisha calls Thalapathy Vijay bestest in adorable birthday post. Viral picActor Trisha Krishnan shared a cute birthday post for her long-time friend, Thalapathy Vijay. She called him 'bestest' in her Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-casual-sunday-vibe-wins-fans-over-see-pic-2744611-2025-06-22",
      "headline": "Salman Khan's casual Sunday vibe wins fans over. See picActor Salman Khan on Sunday shared his new photo on Instagram. The photo created excitement amongst his fans, who complimented his style and mannerisms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaideep-ahlawat-joins-king-says-shah-rukh-khan-convinced-siddharth-anand-2744595-2025-06-22",
      "headline": "Jaideep Ahlawat joins King, says Shah Rukh Khan convinced Siddharth AnandActor Jaideep Ahlawat will also be seen in the much-anticipated film 'King'. The actor confirmed joining the cast and said that director Siddharth Anand was initially hesitant to offer him the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-turns-51-atlee-and-dulquer-salman-extend-wishes-2744460-2025-06-22",
      "headline": "Thalapathy Vijay turns 51: Atlee, Dulquer Salman and celebs extend wishesThalapathy Vijay, who is celebrating his 51th birthday on Sunday, received wishes from the big wigs of Tamil film industry. Filmmaker Atlee shared a picture of fans celebrating the re-release of 'Mersal' to wish the actor on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-love-stories-have-evolved-but-dilwale-dulhania-le-jayenge-would-still-win-hearts-today-2744582-2025-06-22",
      "headline": "Kajol says love stories have evolved but DDLJ would still win hearts todayKajol feels that while love stories have evolved with time, a classic like 'Dilwale Dulhania Le Jayenge' would still resonate with today's audience. In an exclusive interview with India Today, she emphasised that timeless films with strong storytelling and memorable music continue to hold their charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-in-new-delhi-with-kareena-kapoor-khan-and-saif-ali-khan-for-sunjay-kapur-prayer-meet-2744543-2025-06-22",
      "headline": "Karisma Kapoor in Delhi with Kareena and Saif for Sunjay Kapur's prayer meetActor Karisma Kapoor is in New Delhi with her family to attend the prayer service of her ex-husband Sunjay Kapoor. Actors Kareena Kapoor Khan and Saif Ali Khan also accompanied her. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-strikes-6-iranian-military-airports-15-fighter-jets-and-helicopters-destroyed-2744869-2025-06-23",
      "headline": "Israel strikes 6 Iranian military airports, 15 fighter jets and helicopters destroyedThe IDS claimed that jets that were destroyed by their military were intended for use against their aircraft and to thwart Israel's attacks on Iranian territory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-strikes-iran-b2-bombers-nuclear-sites-trump-israel-middle-east-coflict-tehran-2744848-2025-06-23",
      "headline": "Some B-2 bombers went West, real attackers flew East: US decoy plan to bomb IranIn a covert strike named \"Midnight Hammer\", the US used B-2 stealth bombers and a Pacific-bound decoy to mask an 18-hour mission eastward that struck three major Iranian nuclear sites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assembly-bypoll-result-2025-live-updates-bjp-aap-congress-bengal-gujarat-punjab-kerala-2744715-2025-06-23",
      "headline": "Congress wins Nilambur, AAP leads in Ludhiana and Gujarat's Visavadar  Live UpdatesAssembly Bypoll Result 2025 Live Updates: The bypoll results for five constituencies across four states - Bengal, Punjab, Kerala and Gujarat - will be announced today. Bypolls were held in two seats in Gujarat - Visavadar and Kadi - and one each in Punjab (Ludhiana West), Kerala (Nilambur) and Bengal (Kaliganj)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-india-sees-iran-ties-kashmir-issue-chabahar-port-israel-war-balancing-act-2744875-2025-06-23",
      "headline": "How India sees Iran as it walks a tightrope in the Middle East warWhile Iran has been a long-standing friend to India, bound by deep cultural and civilisational ties, relations with Israel, particularly in defence and technology, have strengthened in the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-us-secretly-armed-iran-missiles-1980s-war-iraq-reagan-hawk-tow-contra-case-2744669-2025-06-23",
      "headline": "Why US secretly armed Iran with missiles during a warThe US, which has attacked Iran's nuclear sites, once supplied the Islamic Republic with HAWK surface-to-air and TOW anti-tank missiles despite an arms-export ban. The covert deal during the Reagan era 40 years ago, known as the Iran-Contra case, became one of America's biggest political scandals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indigo-trainee-pilot-accuses-three-colleagues-of-casteist-abuse-says-they-called-him-chamar-bhangi-2744831-2025-06-23",
      "headline": "'Go stich slippers': Trainee IndiGo pilot accuses colleagues of casteist abuseBased on the complaint filed by the victim, Sharan Kumar's father, Ashok Kumar, a case was registered under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act against the three accused.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-pm-narendra-modi-praise-operation-sindoor-prime-asset-for-india-2744804-2025-06-23",
      "headline": "Prime asset for India: Shashi Tharoor's big praise for PM on Op Sindoor outreachCongress MP Shashi Tharoor has once again heaped praise on Prime Minister Narendra Modi in a column on Operation Sindoor global outreach mission, saying the latter is a \"prime asset for India\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/uranium-enrichment-explained-why-the-us-bombed-irans-fordow-nuclear-plant-2744884-2025-06-23",
      "headline": "Uranium enrichment explained: Why the US bombed Iran's Fordow plantUranium-235 is essential for nuclear reactors and weapons, and for that, enrichment is necessary. The process starts by converting uranium ore into uranium hexafluoride (UF6) gas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/chatgpt-brain-rot-and-who-should-use-ai-and-who-should-not-2744838-2025-06-23",
      "headline": "ChatGPT, brain rot and who should use AI and who should notWhat was once suspected now seems to have been confirmed: using ChatGPT can degrade the brain. So, should you still use it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Iran warns of 'powerful operation' after US strikes, vows heavy consequencesIran's media have claimed that the nuclear sites destroyed in Sunday's US bombings are presently being rebuilt by Iran's Atomic Energy Agency. Meanwhile, the US State Department has issued a Worldwide Caution alert, warning American citizens to exercise increased vigilance while travelling abroad. \r\n\r\nThe Israeli Defence Forces also stated that around 20 Israeli Air Force fighter jets carried out intelligence-based strikes using over 30 munitions across several locations in Iran, including Kermanshah, Hamedan, and Tehran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/congress-candidate-aryadan-shoukath-wins-keralas-nilambur-assembly-bypoll-defeats-cpms-m-swaraj-by-over-2744895-2025-06-23",
      "headline": "Congress defeats CPIM by over 11,000 votes in Kerala's Nilambur Assembly bypollCongress candidate Aryadan Shoukath defeated CPI(M)'s M Swaraj by 11,077 votes to win the Nilambur Assembly constituency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/anti-war-protests-us-cities-new-york-los-angeles-washington-israel-iran-war-donald-trump-bombs-nuclear-sites-2744782-2025-06-23",
      "headline": "Hands off Iran: Anti-war protests flood US cities after strikes on nuclear sitesAnti-war protests erupted across several major US cities, including New York and Washington DC, after America bombed three Iranian nuclear sites as part of 'Operation Midnight Hammer', marking a major escalation in the Middle East crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-how-to-vacation-without-the-financial-hangover-2744803-2025-06-23",
      "headline": "Explained: How to vacation without the financial hangoverA dream vacation should leave you with great memories, not months of financial stress. With a little planning, you can enjoy the trip and return home without breaking your budget."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-local-body-polls-on-hold-high-court-puts-clarity-reservation-government-2744855-2025-06-23",
      "headline": "Court puts Uttarakhand local polls on hold over lack of clarity in reservationA day after panchayat poll dates were announced, the Uttarakhand High Court halted the election process, citing lack of clarity on reservation policy, putting the entire schedule on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/delhi-university-lists-muslim-as-language-calls-it-form-error-after-row-2744859-2025-06-23",
      "headline": "Urdu missing, 'Muslim' listed as language: Delhi University blames tech glitchDelhi University has clarified that listing 'Muslim' as a language and leaving out Urdu from its UG admission form was a clerical mistake after it faced criticism from faculty and civil society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-release-pakistani-actor-hania-aamir-release-skips-india-release-overseas-2744745-2025-06-23",
      "headline": "Diljit Dosanjh skips India release of Sardaar Ji 3 starring Pak actor Hania Aamir'Sardaar Ji 3', featuring Diljit Dosanjh and Pakistani actor Hania Aamir, will not release in India due to the Indian film industry's ban on Pakistani actors. The film is set for an overseas release on June 27 and is a horror comedy satire on ghostbusting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/lpg-cylinder-leak-blast-terrifying-video-man-woman-escape-unhurt-2744835-2025-06-23",
      "headline": "Man, woman escape unhurt as LPG cylinder leak triggers blast in terrifying videoA shocking video showing a man and a woman escaping unhurt from a massive LPG cylinder explosion inside a house went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-boasts-of-monumental-damage-to-irans-nuke-sites-calls-it-bullseye-strike-obliteration-2744736-2025-06-23",
      "headline": "'Bullseye!!' Trump claims monumental damage to Iran nuke sites in US strikesThe strikes came as a major escalation and the first direct US military involvement in the conflict alongside Israel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-oil-imports-strait-of-hormuz-iran-israel-conflict-us-strikes-nuclear-sites-2744663-2025-06-22",
      "headline": "Why India may not feel the heat if Iran closes Strait of HormuzIndia, which has traditionally sourced its oil from the Middle East and more recently from Russia, is unlikely to see a major impact on its energy reserves if Iran decides to shut down the vital oil corridor of the Strait of Hormuz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-us-strikes-iran-nuclear-sites-modi-government-trump-middle-east-tensions-2744812-2025-06-23",
      "headline": "Congress slams Trump for bombing Iran: Mockery of his own call for dialogueCongress leader Jairam Ramesh slammed Donald Trump for using American air power on Iran's nuclear site, while questioning the Modi government's silence in the Middle East fallout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/sunscreen-sticks-viral-dermatologists-2744794-2025-06-23",
      "headline": "Do dermats even approve of sunscreen sticks?Sunscreen sticks are having a moment - but how effective are they really? Dermatologists weigh in on everything you need to know about the viral skincare essential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-pahalgam-kashmir-tourism-revival-photos-terror-attack-2744757-2025-06-23",
      "headline": "Bustling with activity: Omar Abdullah shares lively tourist scenes from PahalgamBack in Pahalgam for his second visit in a month, Omar Abdullah shared images of crowded streets and traffic jams as Kashmir began to see the first signs of a tourism revival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-closure-iran-parliament-israel-us-attack-crude-oil-impact-price-rise-india-world-impact-2744885-2025-06-23",
      "headline": "Will Iran close Hormuz Strait? What it means for oil prices in India and worldThe Strait of Hormuz is a narrow waterway connecting the Persian Gulf with the Arabian Sea. It is one of the most important oil transport routes in the world. Nearly 20% of all global crude oil passes through this strait."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-airspace-midnight-hammer-social-media-pib-fact-check-iran-israel-conflict-2744714-2025-06-23",
      "headline": "Did US use Indian airspace to strike Iran nuke sites? Government clarifiesThe Press Information Bureau (PIB) in a fact check, said that the route taken by the B2 bombers was explained by US Joint Chiefs of Staff Chair Gen. Dan Caine during a press briefing and Indian airspace was not used for the strike. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-defends-ipl-preparation-after-mitchell-johnson-criticism-2744856-2025-06-23",
      "headline": "IPL over Australia? Hazlewood responds to Mitchell Johnson's criticismJosh Hazlewood has responded to Mitchell Johnson's criticism after Australia's WTC final loss. He explained that playing the IPL was the best preparation possible before the Test final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-travis-head-backs-marnus-labuschagne-test-squad-exclusion-2744810-2025-06-23",
      "headline": "Marnus Labuschagne will be back soon: Head defends dropped Australia batterTravis Head has shown strong support for Marnus Labuschagne following his exclusion from Australia's Test squad. The Australian team looks to rebuild with new talent as the World Test Championship cycle begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-kl-rahul-batting-leeds-test-2744820-2025-06-23",
      "headline": "KL Rahul is India's best Test batter, but needs to convert starts: PujaraKL Rahul has to convert starts into big scores, says Cheteshwar Pujara. Rahul has got starts in both innings and would hope to capitalise on the same on Day 4 of the 1st Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-kohinoor-dinesh-karthik-5-wicket-haul-leeds-2744791-2025-06-23",
      "headline": "Bumrah as valuable as Kohinoor: Karthik praises pacer after Leeds heroicsFormer India cricketer Dinesh Karthik couldn't hide his admiration for Jasprit Bumrah, describing him as, valuable as the Kohinoor diamond\" while pointing out that the Indian pacer holds the best bowling average (19.33) among all 86 bowlers in Test history with 200 or more wickets.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-injury-update-2744772-2025-06-23",
      "headline": "Aided by cold England weather, Bumrah hints at playing more than 3 TestsEngland vs India: Jasprit Bumrah has indicated he might play more than 3 Tests in England as he feels fresh in cold conditions. His availability will be invaluable in overseas conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-real-madrid-manchester-city-juventus-advance-knockout-2744770-2025-06-23",
      "headline": "Real Madrid beat Pachua despite early red, Manchester City and Juventus advanceTen-man Real Madrid showed their depth and resilience, while Manchester City delivered a ruthless attacking display, as both European giants secured key victories in the Club World Cup group stage on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-coach-exclusive-comeback-story-india-vs-england-test-series-2744744-2025-06-23",
      "headline": "Karun Nair comeback story: One more chance, 3006 days laterIndia tour of England: Karun Nair returned to the Test side after 3006 days, earning a place in Shubman Gill's new-look India. After a record-breaking triple century in 2016, he had vanished from the team without a goodbye. But he never gave up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-genius-nasser-hussain-shane-warne-test-cricket-2744748-2025-06-23",
      "headline": "Jasprit Bumrah is an absolute genius: Hussain likens India pacer to WarneFormer England captain Nasser Hussain lavished praise on Jasprit Bumrah, calling him an \"absolute genius\" and comparing his ability to leave batters clueless to that of legendary leg-spinner Shane Warne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/lalit-kumar-upadhyay-retires-international-hockey-two-olympic-bronze-medals-2744742-2025-06-23",
      "headline": "Double Olympic medallist Lalit Upadhyay retires from international hockeyTwo-time Olympic medallist and Indian forward Lalit Kumar Upadhyay announced his retirement from international hockey on Sunday, shortly after India concluded their FIH Pro League campaign with a 4-3 victory over Belgium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-harry-brook-eng-vs-ind-headingley-test-cheteshwar-pujara-2744692-2025-06-23",
      "headline": "Little bit of Rishabh Pant in Harry Brook: Pujara makes bold comparisonCheteshwar Pujara made a bold comparison as he saw glimpses of Rishabh Pant in English batting star Harry Brook. The latter scored 99 runs, narrowly missing out on a century, but his contribution was crucial in helping England secure a slender first-innings lead"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-kl-rahul-batting-potential-2744725-2025-06-23",
      "headline": "Total team man KL Rahul doesn't know how good a player he is: Sunil GavaskarSunil Gavaskar feels that KL Rahul is yet to achieve his full potential after the Indian opener made another fine start with the bat for India against England. Rahul remained unbeaten on 47 as India ended the day on 90 for two."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-coach-exclusive-comeback-story-india-vs-england-test-series-2744744-2025-06-23",
      "headline": "Karun Nair comeback story: One more chance, 3006 days laterIndia tour of England: Karun Nair returned to the Test side after 3006 days, earning a place in Shubman Gill's new-look India. After a record-breaking triple century in 2016, he had vanished from the team without a goodbye. But he never gave up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-genius-nasser-hussain-shane-warne-test-cricket-2744748-2025-06-23",
      "headline": "Jasprit Bumrah is an absolute genius: Hussain likens India pacer to WarneFormer England captain Nasser Hussain lavished praise on Jasprit Bumrah, calling him an \"absolute genius\" and comparing his ability to leave batters clueless to that of legendary leg-spinner Shane Warne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/lalit-kumar-upadhyay-retires-international-hockey-two-olympic-bronze-medals-2744742-2025-06-23",
      "headline": "Double Olympic medallist Lalit Upadhyay retires from international hockeyTwo-time Olympic medallist and Indian forward Lalit Kumar Upadhyay announced his retirement from international hockey on Sunday, shortly after India concluded their FIH Pro League campaign with a 4-3 victory over Belgium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-harry-brook-eng-vs-ind-headingley-test-cheteshwar-pujara-2744692-2025-06-23",
      "headline": "Little bit of Rishabh Pant in Harry Brook: Pujara makes bold comparisonCheteshwar Pujara made a bold comparison as he saw glimpses of Rishabh Pant in English batting star Harry Brook. The latter scored 99 runs, narrowly missing out on a century, but his contribution was crucial in helping England secure a slender first-innings lead"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-kl-rahul-batting-potential-2744725-2025-06-23",
      "headline": "Total team man KL Rahul doesn't know how good a player he is: Sunil GavaskarSunil Gavaskar feels that KL Rahul is yet to achieve his full potential after the Indian opener made another fine start with the bat for India against England. Rahul remained unbeaten on 47 as India ended the day on 90 for two."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}