{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-mocks-cannes-dress-code-with-fake-nude-long-train-outfit-2729887-2025-05-24",
      "headline": "Vir Das mocks Cannes dress code with fake 'nude, long train' outfitComedian Vir Das hilariously trolled Cannes 2025's strict red carpet dress code by posting a photo-shopped image of himself in an exaggerated nude gown with a long train. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cinematic-saturday-neurodivergent-down-syndrome-autistic-spectrum-disorder-individual-in-mainstream-bollywood-2729651-2025-05-24",
      "headline": "Bollywood expands spectrum as neurodivergent actors become Sitaare Zameen ParBollywood is gradually embracing neurodivergent individuals to share their stories, moving beyond stereotypical portrayals seen before. Films like 'Sitaare Zameen Par' highlight autism and Down syndrome with more authenticity, though challenges remain in true representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-dev-mourns-brother-mukul-dev-death-says-will-be-missed-in-instagram-post-2729895-2025-05-24",
      "headline": "Rahul Dev mourns brother Mukul's death, cremation to be held in Delhi todayActor Rahul Dev shared a statement after his brother, Mukul Dev's, death. The cremation will take place today, May 24, at 5 pm in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukul-dev-death-manoj-bajpayee-hansal-mehta-celebs-mourn-2729859-2025-05-24",
      "headline": "Jr NTR to Ajay Devgn, celebs mourn Mukul Dev's deathActor Mukul Dev died at 54 after a brief illness, leaving the Indian film industry in mourning. Friends and colleagues from Bollywood paid heartfelt tributes, remembering him as both a gifted actor and a warm-hearted person.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-worried-ball-hits-virat-kohli-helmet-at-rcb-srh-ipl-match-lucknow-2729847-2025-05-24",
      "headline": "Anushka Sharma gets worried as ball hits Virat Kohli's helmet at IPL matchAnushka Sharma was in Lucknow on May 23 to support her husband-cricketer Virat Kohli, during the RCB Vs SRH match. The actor looked visibly worried after a ball hit Kohli's helmet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/actor-mukul-dev-dead-bollywood-films-son-of-sardaar-television-roles-2729820-2025-05-24",
      "headline": "Mukul Dev, former model and versatile actor known for villain roles, dies at 54Actor Mukul Dev, known for his work in Bollywood films like 'Son of Sardaar', 'Yamla Pagla Deewana' and more, died on Friday, May 23. He was 54."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-box-office-day-1-rajkummar-rao-wamiqa-gabbi-film-sees-a-slow-start-2729811-2025-05-24",
      "headline": "Bhool Chuk Maaf box office Day 1: Rajkummar Rao's film sees a slow startRajkummar Rao and Wamiqa Gabbi's 'Bhool Chuk Maaf' released in theatres on May 23. The film witnessed a lukewarm opening with Rs 6.75 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-apologises-to-wife-hailey-for-mean-message-after-her-magazine-cover-2729787-2025-05-24",
      "headline": "Justin Bieber apologises to Hailey for 'mean' dig after she features on Vogue coverSinger Justin Bieber apologised to his wife Hailey Bieber for his 'mean' remarks after she appeared on the latest edition of a magazine cover. The singer has now edited his caption after facing backlash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-sparkles-in-giorgio-armani-bejewelled-dress-at-cannes-dont-miss-the-bold-headpiece-2729771-2025-05-24",
      "headline": "Alia Bhatt sparkles in bejewelled dress at Cannes. Don't miss the bold headpieceActor Alia Bhatt sparkled like a diamond in her second appearance at Cannes. The actor wore a bejewelled dress and left fans swooning over her looks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/muthina-haara-a-patriotic-tale-of-a-soldier-his-family-their-pride-and-pain-2728222-2025-05-24",
      "headline": "Muthina Haara: A patriotic tale of Kodava soldier, his family, pride and pain'Muthina Haara' is a 1990 Kannada war drama film directed by three-time National Award winner Rajendra Singh Babu, starring Dr Vishnuvardhan and Suhasini Maniratnam in the lead. From pride and patriotism to mental trauma and the repercussions of war, this film depicts both sides of the coin and remains a timeless classic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-wheel-of-time-cancelled-heres-why-it-wont-get-season-4-glbs-2729740-2025-05-24",
      "headline": "Why The Wheel of Time won't return for Season 4Prime Video has canceled The Wheel of Time after three seasons due to declining viewership. The fantasy series, based on Robert Jordan's novels, concludes with a legacy of ambitious storytelling.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-brings-vintage-drama-to-cannes-film-festival-debut-in-peach-outfit-2729678-2025-05-23",
      "headline": "Alia Bhatt brings vintage drama to Cannes debut in peach outfitAlia Bhatt made a stunning red carpet debut in a gorgeous ensemble at the Cannes Film Festival. Pictures of the actor from the red carpet have gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-dipika-kakar-back-home-from-hospital-shoaib-asks-fans-to-keep-her-in-prayers-2729616-2025-05-23",
      "headline": "Actor Dipika Kakar back home from hospital, Shoaib asks fans to keep her in prayersActor Dipika Kakar's husband Shoaib Ibrahim shared her health update with her fans after the delay in tumour resection surgery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-trains-in-low-oxygen-conditioning-for-war-drama-on-galwan-valley-clash-2729589-2025-05-23",
      "headline": "Salman Khan trains in low-oxygen condition for war-drama on Galwan valley clashActor Salman Khan, known for his rigorous fitness regime, is busy training in low-oxygen conditioning for his upcoming war drama. The film is based on the 2020 Galwan valley clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayan-mukerji-shares-war-2-bts-pics-hrithik-roshan-jr-ntr-and-kiara-advani-bring-drama-depth-star-power-2729592-2025-05-23",
      "headline": "Ayan Mukerji shares War 2 BTS pics: Hrithik, Jr NTR bring drama, depth, star powerDirector Ayan Mukerji shared behind-the-scenes photos and a heartfelt note ahead of 'War 2' release, highlighting the film's emotional depth and star-studded cast. The action-thriller, part of the YRF Spy Universe, is set to hit theatres on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-is-all-praise-for-tourist-family-meets-director-abishan-jeevinth-2729593-2025-05-23",
      "headline": "Suriya is all praise for Tourist Family, meets director Abishan JeevinthAfter Dhanush and Rajinikanth, Suriya is all praise for the Tamil film 'Tourist Family'. Debutant director Abishan Jeevinth shared pictures with the actor and expressed admiration for him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-janhvis-param-sundari-teaser-leaked-online-creates-buzz-ahead-of-release-2729560-2025-05-23",
      "headline": "Sidharth-Janhvi's Param Sundari teaser leaked online, creates buzz ahead of releaseThe teaser for 'Param Sundari', starring Sidharth Malhotra and Janhvi Kapoor, was leaked online after being shown in theatres with 'Bhool Chuk Maaf'. Fans are loving the chemistry, visuals, and Sonu Nigam's vocals. The film is slated to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-supports-aamir-khan-amid-sitaare-zameen-par-row-2729534-2025-05-23",
      "headline": "Don't judge the past: Suniel Shetty has Aamir Khan's back amid Sitaare Zameen Par rowActor Suniel Shetty recently reacted to boycott calls for Aamir Khan's 'Sitaaare Zameen Par.' The actor said that people should not judge the past.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/kesari-veer-review-weak-plot-poor-cgi-suniel-shetty-sooraj-pancholi-chhaava-knockoff-2729545-2025-05-23",
      "headline": "Kesari Veer review: Suniel Shetty is the only spark in this Chhaava knockoffReleased-Fri May 23, 2025Kesari Veer movie review: Kesari Veer, despite its grand scale and star cast, fails to deliver a compelling historical drama. The film's poor execution and weak CGI undermine its potential impact."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-niti-aayog-meeting-states-speed-of-development-unity-pitch-2729898-2025-05-24",
      "headline": "PM Modi's 'one state, one global destination' pitch at Niti Aayog meetNiti Aayog meet: This was the first meeting of Prime Minister Narendra Modi with state chief ministers following Operation Sindoor and India's hostilities with Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-becomes-indias-37th-test-captain-appointed-skipper-for-for-england-tests-2729877-2025-05-24",
      "headline": "Shubman Gill becomes India's 37th Test captain, Rishabh Pant named vice-captainIndia tour of England: Shubman Gill was named as India's 37th Test captain on Saturday. Rishabh Pant was appointed as the vice-captain of the Test team as India begin a new cycle of World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/actor-mukul-dev-dead-bollywood-films-son-of-sardaar-television-roles-2729820-2025-05-24",
      "headline": "Mukul Dev, former model and versatile actor known for villain roles, dies at 54Actor Mukul Dev, known for his work in Bollywood films like 'Son of Sardaar', 'Yamla Pagla Deewana' and more, died on Friday, May 23. He was 54."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-health-worker-arrested-sharing-information-bsf-air-force-pakistani-spy-2729872-2025-05-24",
      "headline": "Health worker arrested for sharing information on BSF, air force with Pak spyThe accused, a resident of Gujarat, was reportedly in contact with Pakistan's Inter-Services Intelligence (ISI). He has been brought to Ahmedabad for further questioning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cinematic-saturday-neurodivergent-down-syndrome-autistic-spectrum-disorder-individual-in-mainstream-bollywood-2729651-2025-05-24",
      "headline": "Bollywood expands spectrum as neurodivergent actors become Sitaare Zameen ParBollywood is gradually embracing neurodivergent individuals to share their stories, moving beyond stereotypical portrayals seen before. Films like 'Sitaare Zameen Par' highlight autism and Down syndrome with more authenticity, though challenges remain in true representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/covid-cases-tracker-india-coronavirus-delhi-mumbai-kerala-bengaluru-hospitals-alert-2729835-2025-05-24",
      "headline": "Kerala, Mumbai, Delhi see Covid surge, hospitals told to keep beds, oxygen readyCoronavirus cases: Delhi, Maharashtra, Kerala, Tamil Nadu and Karnataka have all reported fresh cases this month. However, most of the cases are mild."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aircraft-window-shades-defence-airports-photography-ban-western-border-pakistan-dgca-2729867-2025-05-24",
      "headline": "Aircraft window shades to remain shut at defence airports near Pak borderThe DGCA directive, which comes days after India's western borders saw hostilities with Pakistan, applies to dual-use airports that serve both civilian and military operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-jammu-and-kashmir-poonch-family-shelling-congress-2729868-2025-05-24",
      "headline": "Rahul Gandhi's door-to-door visit in J&K's Poonch, meets Pak shelling victimsRahul Gandhi met victims of recent cross-border shelling in Jammu and Kashmir's Poonch district and promised to raise their concerns nationally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-tour-of-england-ajit-agarkar-workload-concerns-2729903-2025-05-24",
      "headline": "Jasprit Bumrah won't play all five Tests in England, confirms selector Ajit AgarkarIndia tour of England: Jasprit Bumrah is unlikely to play all five Tests in England, chief selector Ajit Agarkar said after announcing the 18-man squad for the upcoming tour, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-attack-blast-report-bla-taliban-ttp-islamic-state-civilian-death-2729913-2025-05-24",
      "headline": "Pak ranks 7th in civilian deaths from blasts, worse than some countries at warIn 2024, Pakistan ranked seventh globally for civilian casualties from explosive weapons, recording 790 casualties. It marked the highest incident count since 2014, according to a report by Action on Armed Violence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/conductor-averts-accident-after-bus-driver-prabhu-suffers-heart-attack-in-tamil-nadu-2729846-2025-05-24",
      "headline": "Conductor averts accident after bus driver suffers heart attack in Tamil NaduAs the bus was crossing Kanakampatti, driver Prabhu called the conductor, attempting to signal that he was experiencing extreme chest pain, but before anyone could react, Prabhu fainted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/monsoon-to-arrive-in-kerala-within-24-hours-earliest-onset-in-state-in-16-years-2729793-2025-05-24",
      "headline": "Monsoon arrives in Kerala 8 days before schedule, earliest onset in 16 yearsThis year's monsoon onset in Kerala is the earliest in the last 16 years. The last time the monsoon arrived this early in the state was in 2009 and 2001."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukul-dev-death-manoj-bajpayee-hansal-mehta-celebs-mourn-2729859-2025-05-24",
      "headline": "Jr NTR to Ajay Devgn, celebs mourn Mukul Dev's deathActor Mukul Dev died at 54 after a brief illness, leaving the Indian film industry in mourning. Friends and colleagues from Bollywood paid heartfelt tributes, remembering him as both a gifted actor and a warm-hearted person.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dropped-arshdeep-singh-earns-maiden-test-call-up-2729881-2025-05-24",
      "headline": "Mohammed Shami dropped, Arshdeep Singh earns maiden Test call-up for England tourThe Board of Control for Cricket in India (BCCI) announced the squad for the upcoming five-match Test series against England, set to begin from June 20. Senior fast bowler Mohammed Shami failed to find a spot in the team while Arshdeep Singh earned his maiden Test call up."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-catches-husband-with-girlfriend-gets-thrashed-by-both-in-public-video-goes-viral-2729866-2025-05-24",
      "headline": "Video: UP woman catches husband with girlfriend, gets thrashed by both in publicVictim Mohini Yadav got injured in the incident, following which she rushed to lodge a police complaint, demanding action against the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/samsung-galaxy-triple-fold-may-debut-by-september-with-a-hefty-price-tag-2729896-2025-05-24",
      "headline": "Samsung Galaxy triple fold may debut by September with a hefty price tagThe Samsung Galaxy triple-fold smartphone is rumoured to be released in Q3 of this year. It is also rumoured that the high-end phone could cost double the price of its upcoming Galaxy Z Fold 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/bachendri-pal-first-indian-woman-to-climb-mount-everest-2729830-2025-05-24",
      "headline": "How Bachendri Pal's 43 minutes on Everest made her India's first woman to summitBachendri Pal, India's first woman to climb Mount Everest, was born on May 24, 1954, in a small town in Tehri, nestled in the breathtaking mountains of Uttarakhand. The 43 minutes she spent on Mount Everest made her the first Indian woman to achieve this feat. Despite falling ill at the training camp of the trek, Bachendri chose to continue the climb and went on to write her name in history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-486-23-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/angad-singh-chadok-wanted-in-india-multiple-bank-fraud-cases-deported-from-us-2729828-2025-05-24",
      "headline": "Angad Chandok, wanted in India in multiple bank fraud cases, deported from USAngad Singh Chandok, 34, was living in California and had been convicted in the US of running a large-scale money laundering operation. He was sentenced to six years in US federal prison in March 2022."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/girl-toddler-raped-murdered-in-kadapa-district-of-andhra-pradesh-2729878-2025-05-24",
      "headline": "Man rapes, murders 3-year-old girl after luring her with banana in Andhra PradeshThe accused allegedly lured the girl, who was playing outside, with a banana to a deserted area, where he reportedly raped and murdered her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/low-vitamin-d-newborns-linked-autism-adhd-schizophrenia-risk-mental-health-disorders-2729504-2025-05-24",
      "headline": "Low vitamin D at birth could predict future mental illnessesA Lancet study finds low vitamin D levels in newborns increase the risk of autism, ADHD, and schizophrenia. This discovery highlights the potential benefits of vitamin D supplementation during pregnancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/harvard-university-trump-foreign-student-enrolment-ban-raghav-chadha-aap-mp-2729786-2025-05-24",
      "headline": "In Harvard T-shirt, Raghav Chadha's blunt message amid row: Wear my coloursAAP MP and Harvard alumnus Raghav Chadha called for safeguarding academic freedom and global collaboration of the university, as he criticised US President Donald Trump's move to bar the university from enroling international students. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-pahalgam-attack-ceasefire-indus-water-treaty-water-flow-dam-flushing-satellite-photo-2729373-2025-05-23",
      "headline": "One month since Indus Waters Treaty suspension: What satellite images revealSince India suspended the Indus Waters Treaty after the April 22 Pahalgam terror attack, satellite and flow data show India has intensified dam flushing operations, causing fluctuating water flows into Pakistan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistani-intruder-shot-dead-in-gujarat-by-border-forces-while-attempting-to-cross-border-2729849-2025-05-24",
      "headline": "Pakistani man crosses border in Gujarat despite warning by forces, shot deadThe BSF foiled an infiltration attempt and shot dead a Pakistani intruder in Gujarat's Banaskantha district on May 23 after he ignored repeated warnings to retreat. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-test-england-squad-announcement-ajit-agarkar-press-conference-2729927-2025-05-24",
      "headline": "Gill new Test captain: Selector Ajit Agarkar explains 18-man England tour squadIndia tour of England: Chief selector Ajit Agarkar addressed the press in Mumbai after announcing India's 18-man squad for the five-Test series, starting June 20. Shubman Gill was named India's new Test captain and Rishabh Pant was appointed his deputy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-informed-early-april-ajit-agarkar-2729926-2025-05-24",
      "headline": "Kohli made up his mind about Test retirement in early April: AgarkarAjit Agarkar confirmed Virat Kohli had already communicated his decision to retire from Test cricket in April, as India shifted focus to youth with Shubman Gill leading a new-look side for the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/malaysia-masters-kidambi-srikanth-into-final-yushi-tanaka-win-2729869-2025-05-24",
      "headline": "Kidambi Srikanth enters first final in six years at Malaysia MastersKidambi Srikanth reached his first BWF final in six years, defeating Japan's Yushi Tanaka in straight games at the Malaysia Masters 2024, marking a strong comeback after a prolonged dip in form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-sarfaraz-khan-dropped-karun-nair-returns-2729924-2025-05-24",
      "headline": "Why Karun Nair, why not Sarfaraz Khan? Selector explains big England tour callIndia tour of England: Karun Nair returned to the Test fold for the first time in eight years. Mumbai batter Sarfaraz Khan was dropped despite India naming an 18-man squad for a five-Test series, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajit-agarkar-on-rishabh-pants-vice-captaincy-india-tour-of-england-2729918-2025-05-24",
      "headline": "Why Rishabh Pant was made India's Test vice-captain? Chief selector revealsIndia's chief selector Ajit Agarkar revealed what made him pick Rishabh Pant as the vice captain of the Test team as they announced squad for the upcoming England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-tour-of-england-ajit-agarkar-workload-concerns-2729903-2025-05-24",
      "headline": "Jasprit Bumrah won't play all five Tests in England, confirms selector Ajit AgarkarIndia tour of England: Jasprit Bumrah is unlikely to play all five Tests in England, chief selector Ajit Agarkar said after announcing the 18-man squad for the upcoming tour, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dropped-arshdeep-singh-earns-maiden-test-call-up-2729881-2025-05-24",
      "headline": "Mohammed Shami dropped, Arshdeep Singh earns maiden Test call-up for England tourThe Board of Control for Cricket in India (BCCI) announced the squad for the upcoming five-match Test series against England, set to begin from June 20. Senior fast bowler Mohammed Shami failed to find a spot in the team while Arshdeep Singh earned his maiden Test call up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-becomes-indias-37th-test-captain-appointed-skipper-for-for-england-tests-2729877-2025-05-24",
      "headline": "Shubman Gill becomes India's 37th Test captain, Rishabh Pant named vice-captainIndia tour of England: Shubman Gill was named as India's 37th Test captain on Saturday. Rishabh Pant was appointed as the vice-captain of the Test team as India begin a new cycle of World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-working-hard-for-england-tour-wants-to-lead-pace-attack-with-jasprit-bumrah-2729861-2025-05-24",
      "headline": "Shami working hard for England tour, wants to lead pace attack with BumrahStar India fast bowler Mohammed Shami has revealed that he's working extremely hard to be fit for the England tour and is looking to lead the pace attack alongside Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-rajat-patidar-pat-cummins-fined-slow-over-rate-2729845-2025-05-24",
      "headline": "Pat Cummins, Rajat Patidar fined for slow-over rate in RCB vs SRH clashRCB captain Rajat Patidar and SRH skipper Pat Cummins fined for slow over-rate during IPL 2025 clash; other players also penalized with fines based on match fees following the May 23 clash in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-team-news-jaipur-pitch-report-2729838-2025-05-24",
      "headline": "Punjab Kings eyeing top spot against battered Delhi CapitalsPunjab Kings (PBKS) and Delhi Capitals (DC) are all set to lock horns in Match 66 of the Indian Premier League 2025 (IPL 2025) in Jaipur. Delhi have been knocked out of the tournament following their loss against Mumbai Indians (MI), while Punjab are eyeing a top two finish. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dropped-arshdeep-singh-earns-maiden-test-call-up-2729881-2025-05-24",
      "headline": "Mohammed Shami dropped, Arshdeep Singh earns maiden Test call-up for England tourThe Board of Control for Cricket in India (BCCI) announced the squad for the upcoming five-match Test series against England, set to begin from June 20. Senior fast bowler Mohammed Shami failed to find a spot in the team while Arshdeep Singh earned his maiden Test call up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-becomes-indias-37th-test-captain-appointed-skipper-for-for-england-tests-2729877-2025-05-24",
      "headline": "Shubman Gill becomes India's 37th Test captain, Rishabh Pant named vice-captainIndia tour of England: Shubman Gill was named as India's 37th Test captain on Saturday. Rishabh Pant was appointed as the vice-captain of the Test team as India begin a new cycle of World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-working-hard-for-england-tour-wants-to-lead-pace-attack-with-jasprit-bumrah-2729861-2025-05-24",
      "headline": "Shami working hard for England tour, wants to lead pace attack with BumrahStar India fast bowler Mohammed Shami has revealed that he's working extremely hard to be fit for the England tour and is looking to lead the pace attack alongside Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-rajat-patidar-pat-cummins-fined-slow-over-rate-2729845-2025-05-24",
      "headline": "Pat Cummins, Rajat Patidar fined for slow-over rate in RCB vs SRH clashRCB captain Rajat Patidar and SRH skipper Pat Cummins fined for slow over-rate during IPL 2025 clash; other players also penalized with fines based on match fees following the May 23 clash in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-team-news-jaipur-pitch-report-2729838-2025-05-24",
      "headline": "Punjab Kings eyeing top spot against battered Delhi CapitalsPunjab Kings (PBKS) and Delhi Capitals (DC) are all set to lock horns in Match 66 of the Indian Premier League 2025 (IPL 2025) in Jaipur. Delhi have been knocked out of the tournament following their loss against Mumbai Indians (MI), while Punjab are eyeing a top two finish. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}