{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/missed-september-16-itr-deadline-heres-how-to-file-your-return-now-2788320-2025-09-17",
      "headline": "Missed September 16 ITR deadline? Here's how to file your return nowA look at options and consequences for taxpayers who do not file their income tax return by the extended due date of 16 September 2025, including late filing penalties, deadlines for belated returns, and whether tax regimes can be changed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/confident-of-good-outcome-under-pm-modi-hardeep-singh-puri-on-us-india-trade-talks-2788247-2025-09-16",
      "headline": "Confident of good outcome under PM Modi: Hardeep Puri on US-India trade talksAs US-India trade talks resumed with the arrival of the US chief negotiator in India, Union Minister for Petroleum and Natural Gas, Hardeep Singh Puri expressed confidence of a good outcome under PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-resume-with-india-first-focus-says-hardeep-singh-puri-2788262-2025-09-16",
      "headline": "India–US trade talks resume with 'India First' focus, says Hardeep Singh PuriAs fresh trade talks begin between India and the US, Union Minister Hardeep Singh Puri, in an exclusive interview with India Today said the government will prioritise national interests, with farmers and MSMEs at the heart of its strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-will-us-india-trade-talk-impact-markets-ahead-nse-bse-sensex-nifty-modi-trump-2788261-2025-09-16",
      "headline": "How will US-India trade talk impact markets ahead?Experts said that any progress in the India-US trade deal is likely to trigger short covering on Dalal Street and the market is also looking forward to pent-up consumer demand from Navaratri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodhas-nithin-kamath-flags-regulatory-risk-for-weekly-options-2788205-2025-09-16",
      "headline": "Zerodha's Nithin Kamath flags regulatory risk for weekly optionsWeekly options in India are under scrutiny, and Zerodha CEO Nithin Kamath has warned about the mounting regulatory risks that could reshape trading in these short-term derivatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-595-points-nifty-above-25200-kotak-bank-gains-3-percent-2788193-2025-09-16",
      "headline": "Sensex jumps 595 points, Nifty above 25,200; Kotak Bank gains 3%The S&P BSE Sensex gained 594.95 points to close at 82,380.69 points, while the NSE Nifty50 added 169.90 points to end at 25,239.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/apollo-tyres-shares-jump-2-percent-reason-bcci-new-sponsor-team-india-2788188-2025-09-16",
      "headline": "Apollo Tyres shares jump 2% after it's named India cricket team jersey sponsorApollo Tyres shares jumped to the day's high of Rs 490.80 after opening at Rs 479.45. Apollo Tyres shares closed at Rs 486.80, up 1.56% after the news. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-rs-25000-salary-fund-both-your-home-and-car-2788098-2025-09-16",
      "headline": "Can a Rs 25,000 salary fund both your home and car?Think a Rs 25,000 salary can't get you a house and a car? Think again. With the right strategy and disciplined savings, even modest paychecks can turn into big dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-gst-overhaul-mother-dairy-slashes-product-prices-milk-cheaper-by-rs-2-2788112-2025-09-16",
      "headline": "Mother Dairy slashes ghee, butter prices, tetra-pack milk cheaper by Rs 2Mother Dairy announced a cut in prices across its portfolio of dairy and processed foods, saying it is passing on the benefits of the government's GST 2.0 reforms directly to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-listing-september-17-bse-nse-strong-subscription-expected-gains-gmp-2788093-2025-09-16",
      "headline": "Urban Company to debut on BSE, NSE: What investors can expect on listing dayUrban Company is set to list on the BSE and NSE on September 17, 2025 after its IPO was subscribed nearly 109 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-trump-blinks-cheese-corn-agriculture-dairy-sectors-2788074-2025-09-16",
      "headline": "Say cheese: Trump blinks on trade as talks resume with IndiaIndia-US trade negotiations have resumed, weeks after Trump imposed steep 50% tariffs last month. The US, now, doesn't want sweeping access to India's agricultural and dairy markets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-portal-still-facing-glitches-is-1-day-extension-enough-for-taxpayers-2788012-2025-09-16",
      "headline": "1-day ITR extension: Is it enough for taxpayers?Filing income tax returns turned into a nightmare this year, as taxpayers battled login errors, frozen screens and missed payments. Now, with just a one-day extension, many are asking, is that really enough?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jane-fonda-meryl-streep-leonardo-dicaprio-tribute-to-robert-redford-after-death-at-89-2788484-2025-09-17",
      "headline": "He stood for America: Jane Fonda, Meryl Streep's tribute to Robert RedfordActor Robert Redford's death at 89 prompts tributes from former co-stars and industry peers. Jane Fonda, Meryl Streep, Morgan Freeman, and others share reflections on his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/photo/margot-robbie-stuns-in-vintage-mugler-at-a-big-bold-beautiful-journey-premiere-2788455-2025-09-17",
      "headline": "Margot Robbie stuns in vintage Mugler at A Big Bold Beautiful journey premiereActors Margot Robbie and Colin Farrell made a stylish appearance at the premiere of their upcoming film 'A Big Bold Beautiful Journey' in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/us-consul-general-meets-jr-ntr-stresses-on-bilateral-relations-job-creation-2788367-2025-09-16",
      "headline": "US Consul General meets Jr NTR, stresses on bilateral relations, job creationActor Jr NTR met US Consul General Laura Williams in Hyderabad. Williams shared a social media post highlighting the growing collaboration and stronger ties between India and the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-and-fall-pawan-singh-nayandeep-rakshit-wear-saree-bindi-viral-video-2788333-2025-09-16",
      "headline": "Rise & Fall: Pawan Singh tells Nayandeep Rakshit to wear saree, bindi. Video viralA video from reality show 'Rise & Fall' featuring Pawan Singh and Nayandeep Rakshit has gone viral. In the clip, Pawan can be seen telling Nayandeep to wear a saree and a bindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-arshad-jolly-llb-3-gets-ua-rating-alcohol-brand-abusive-dialogues-cut-2788316-2025-09-16",
      "headline": "Akshay, Arshad's Jolly LLB 3 gets U/A rating - alcohol brand, abusive dialogues cut'Jolly LLB 3' received a U/A certificate after the CBFC suggested a few modifications. The courtroom-drama features actors Akshay Kumar, Arshad Warsi, Huma Qureshi and Amrita Rao in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-courtroom-drama-film-nyaya-saiyaara-success-report-2788296-2025-09-16",
      "headline": "After Saiyaara, Aneet Padda to star in a courtroom drama: ReportActor Aneet Padda, following her successful debut in Saiyaara, has reportedly signed her next film. Unlike what many were expecting, her next film is not going to be romantic. Here's everything you need to know about her next film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijays-classic-kushi-returns-to-theatres-after-25-years-2788337-2025-09-16",
      "headline": "Thalapathy Vijay's classic Kushi returns to theatres after 25 yearsThalapathy Vijay and Jyotika's romantic comedy 'Kushi' is set to return to the big screen. Marking 25 years since its original release, the film will be re-released in theatres on 25 September.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-starts-youtube-channel-in-memory-of-shefali-jariwala-2788335-2025-09-16",
      "headline": "After NGO, Parag Tyagi starts YouTube channel in memory of Shefali JariwalaParag Tyagi has launched a YouTube channel to share his and late wife Shefali Jariwala's story, with proceeds going to the Shefali Jariwala Rise Foundation. The initiative follows his pledge to carry forward Shefali's dreams of supporting underprivileged children and empowering women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ileana-d-cruz-shares-she-nearly-quit-barfi-after-anurag-basu-lashed-out-2788030-2025-09-16",
      "headline": "Ileana D'Cruz reveals she almost quit Barfi! after Anurag Basu's outburstIleana D'Cruz shared that she almost quit 'Barfi' after director Anurag Basu lashed out at her on set, leaving her in tears. The actor said she was calmed down by producer Siddharth Roy Kapur, after which she reconciled with Basu and continued with the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-shares-why-aryan-khan-rarely-smiles-on-camera-2788301-2025-09-16",
      "headline": "Raghav Juyal shares why Aryan Khan rarely smiles on cameraRaghav Juyal shared that Aryan Khan avoids smiling on camera due to a \"phobia,\" preferring to maintain a serious persona despite his playful side off-screen. Aryan is all set to make his directorial debut with the Netflix satire 'Ba***ds of Bollywood', releasing on September 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vir-das-says-its-impossible-to-gauge-sensitivities-before-show-am-not-that-artiste-2788319-2025-09-16",
      "headline": "Vir Das says it's impossible to gauge sensitivities before show: Am not that artisteVir Das announced his new stand-up tour 'Sounds of India', celebrating the country's everyday rhythms from Kanyakumari to Kashmir. At the launch, the Emmy-winning comedian opened up about the challenge of balancing comedy with social responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/robert-redford-oscar-winning-actor-and-director-dies-at-89-2788304-2025-09-16",
      "headline": "Robert Redford, Oscar-winning actor and director, dies at 89Actor-director Robert Redford, known for his role in 'Butch Cassidy and the Sundance Kid', died at the age of 89. He was celebrated for his iconic roles and for founding the Sundance Institute, which nurtured independent filmmakers across the globe.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jackie-shroff-calls-out-traffic-chaos-after-ambulance-struggles-to-move-in-mumbai-2788268-2025-09-16",
      "headline": "Jackie Shroff calls out traffic chaos after ambulance struggles to move in MumbaiJackie Shroff voiced concern over Mumbai's traffic after witnessing an ambulance stuck in a jam, warning that such delays could cost lives. The actor also made headlines for snapping at paparazzi over excessive flashlights before resuming his usual cheerful interactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lakshmi-manchu-reacts-sexist-remark-questions-mahesh-babu-going-shirtless-at-50-2788228-2025-09-16",
      "headline": "Lakshmi Manchu reacts to sexist remark, questions Mahesh Babu going shirtless at 50Actor Lakshmi Manchu confronts a reporter for questioning her dressing sense. She raised concerns about gendered double standards in media interviews and advocated for greater responsibility among journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coachella-2026-headliners-sabrina-carpenter-justin-bieber-karol-g-announced-2788250-2025-09-16",
      "headline": "Sabrina Carpenter, Justin Bieber and Karol G to headline Coachella 2026Coachella has revealed its headline acts for 2026, featuring Sabrina Carpenter, Justin Bieber and Karol G, with tickets set to go on sale this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-mahieka-sharma-all-about-hardik-pandyas-new-rumoured-partner-2788203-2025-09-16",
      "headline": "Who is Mahieka Sharma? All about Hardik Pandya's new rumoured partnerHardik Pandya has sparked dating rumours with model Mahieka Sharma after a Reddit thread spotted a male figure in the background of her selfie. While neither has confirmed the speculation, social media is abuzz as fans connect the dots after Hardik's recent separation from Natasa Stankovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shinchan-goes-desi-director-masakazu-hashimoto-on-bollywood-humour-indian-debut-2788134-2025-09-16",
      "headline": "Shinchan goes desi: Director Masakazu Hashimoto on Bollywood, humour, Indian debutThe 33rd Shinchan film, 'Crayon Shin-chan the Movie: Super Hot! The Spicy Kasukabe Dancers' brings Japan's most notorious cartoon kid to India for the first time, mixing masala, mischief, and a lot of dance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nidradevi-next-door-review-a-technically-brilliant-film-by-suraag-sagar-that-deserves-more-love-2788140-2025-09-16",
      "headline": "Nidradevi Next Door review: A technically brilliant film that deserves more loveRelease Date:Fri Sep 12, 2025Nidradevi Next Door review: This Kannada film written and directed by Suraag Sagar is a psychological drama flavoured with romance, that tastefully presents sensitive issues such as chronic insomnia due to emotional baggage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karanvir-sharma-bigg-boss-19-choosing-kajol-the-trial-2-2787610-2025-09-16",
      "headline": "Karanvir Sharma on saying no to Bigg Boss 19, choosing Kajol's The Trial 2Ahead of 'The Trial 2' premiere, actor Karanvir Sharma told IndiaToday.in that his biggest disadvantage in Bollywood has been his looks. He also opened up about turning down 'Bigg Boss 19' to prioritise the courtroom drama series. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-thanks-president-trump-for-birthday-wishes-in-first-call-since-june-backs-his-ukraine-peace-push-2788436-2025-09-16",
      "headline": "Thank you, my friend: PM gets birthday call from Trump, backs his Ukraine peace pushThis was the first call between the two world leaders since June 17. The relationship between India and US turned sour after Trump imposed an additional sanction of 25 per cent on India, with total levy of 50 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-vs-uae-confirmed-boycott-threat-u-turn-handshake-2788462-2025-09-17",
      "headline": "Pakistan make U-turn on boycott threat, will go ahead with UAE match: SourcesPakistan's dramatic boycott threat has ended in a U-turn. Despite the ICC rejecting their demand to remove match referee Andy Pycroft, sources told India Today that Pakistan will face the UAE on Wednesday in Dubai. The decision followed consultations between PCB chief Mohsin Naqvi and Prime Minister Shehbaz Sharif."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tyler-robinsons-confession-trans-partner-after-shooting-charlie-kirk-glbs-2788477-2025-09-17",
      "headline": "I worry about...: Suspect confesses to trans partner after shooting Charlie KirkThe suspect appeared virtually for his first court hearing since he was formally charged on seven counts today. Prosecutors say they will seek the death penalty, citing text messages and a handwritten note in which he appeared to confess to the crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-pushes-islamic-arab-nato-doha-summit-implications-concerns-for-india-turkey-arab-nations-2788345-2025-09-16",
      "headline": "Pakistan pushes for Islamic Nato. What's in it for India?At a summit of over 40 Muslim countries in Doha after Israel's strike in Qatar, a proposal was floated for an Islamic Nato. Pakistan aggressively pitched for an \"Arab-Islamic task force\", reviving talks about a Nato-style military alliance. Though targeted at Israel, does the bloc, with Pakistan and Turkey, have any implications for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-sarvesh-kusale-high-jump-final-ranking-sixth-finish-belief-2788487-2025-09-17",
      "headline": "Whisper to roar: Sarvesh Kushare's lead into the world's eliteSarvesh Kushare cleared 2.28m to finish sixth in Tokyo, the highest-ever by an Indian high jumper at a World Championship, turning a world ranking of 38 into a stage where his belief outjumped expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dont-know-how-accident-happened-bmw-crash-case-accuseds-husband-tells-police-2788423-2025-09-16",
      "headline": "Took different cabs: Delhi crash accused's husband, who was in same BMW, to copsParikshit claimed he did not know how the accident happened and said Gaganpreet took the victims to a hospital by taxi while he followed separately. Police are verifying his version with call detail records and location data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/brs-padi-kaushik-reddy-congress-mps-voted-for-ndas-veep-candidate-on-revanth-reddys-orders-2788435-2025-09-16",
      "headline": "Congress MPs voted for NDA's Veep candidate on Revanth Reddy's orders: BRS MLAA Bharat Rashtra Samithi MLA alleged that several Congress MPs voted for CP Radhakrishnan for the Vice President post on the instruction of Revanth Reddy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ceasefire-offer-came-via-us-but-india-did-not-agree-pakistan-foreign-minister-ishaq-dar-big-admission-operation-sindoor-trump-mediation-claims-2788299-2025-09-16",
      "headline": "India refused third-party role in truce talks: Pak minister busts Trump claimPakistan's Foreign Minister Ishaq Dar has admitted that India never accepted any third-party mediation in ceasefire talks. He said a ceasefire offer had come via the US, but India insisted the issue remain bilateral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2014-the-man-behind-narendra-modi-2788258-2025-09-16",
      "headline": "From the India Today archives (2014) | The man behind Narendra ModiNarendra Modi turning 75 is also time to remember Lakshmanrao Inamdar, the RSS veteran who perhaps had the most profound impact on the prime minister's early years"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-joins-russia-and-belarus-zapad-military-drills-amid-trade-rift-with-us-glbs-2788476-2025-09-17",
      "headline": "India joins Russia and Belarus Zapad military drills amid trade tensions with USThe manoeuvres brought together around 100,000 troops, backed by nuclear-capable bombers, warships, and heavy artillery. Russian President Vladimir Putin, wearing military fatigues, personally supervised the exercises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tyler-robinson-wears-protective-vest-in-first-court-appearance-for-charlie-kirk-murder-utah-university-shooting-2788488-2025-09-17",
      "headline": "Unshaven, in protective vest: Charlie Kirk murder accused in 1st court appearanceProsecutors are seeking the death penalty, presenting new evidence in the form of text messages sent to his live-in partner, in which Tyler Robinson allegedly admitted to fatally shooting the conservative activist Charlie Kirk at Utah University last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-mohammad-yousuf-slur-suryakumar-yadav-pig-comment-explanation-2788422-2025-09-16",
      "headline": "After pig jibe against Suryakumar, ex-Pak cricketer offers bizarre explanationFormer Pakistan cricketer Mohammad Yousuf sparked outrage by calling India's Suryakumar Yadav a 'pig' during a heated TV debate, a slur that has further escalated tensions following the handshake row. Suryakumar refused to shake hands with Pakistan players during India's Asia Cup match on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/red-rain-alert-in-dehradun-heavy-rainfall-likely-after-cloudburst-leaves-13-dead-2788397-2025-09-16",
      "headline": "Red rain alert in Dehradun, heavy rainfall likely after cloudburst leaves 13 deadThe state government has issued a red alert for Dehradun, Champawat, and Udham Singh Nagar, warning of extremely heavy rain and the risk of further fatalities, landslides, and infrastructure collapse through September 20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/fbi-director-kash-patel-clashes-with-senator-booker-senate-hearing-2788464-2025-09-17",
      "headline": "Trump will cut you loose: Kash Patel clashes with Democrats during Senate testimonyFBI Director Kash Patel told the Senate panel there was no credible information that Jeffrey Epstein trafficked women and underage girls to anyone but himself, seeking to defuse criticism of the Trump administration's move to end its review of the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/sexual-predator-indian-origin-surgeon-amal-bose-united-kingdom-jailed-for-groping-female-colleagues-england-crime-lancashire-2788375-2025-09-16",
      "headline": "Grabbed breasts, groped staff: Indian-origin surgeon jailed in UK for sexual assaultA 55-year-old Indian-origin surgeon in the UK has been sentenced to six years in jail for sexually assaulting five staff members and also branded \"a sexual predator hiding in plain sight\" by the judge. All the victims were staff members at Blackpool Victoria Hospital, where he served as head of the cardiovascular surgery department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-arshad-jolly-llb-3-gets-ua-rating-alcohol-brand-abusive-dialogues-cut-2788316-2025-09-16",
      "headline": "Akshay, Arshad's Jolly LLB 3 gets U/A rating - alcohol brand, abusive dialogues cut'Jolly LLB 3' received a U/A certificate after the CBFC suggested a few modifications. The courtroom-drama features actors Akshay Kumar, Arshad Warsi, Huma Qureshi and Amrita Rao in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-says-trade-talks-with-us-positive-forward-looking-ground-set-for-6th-round-2788398-2025-09-16",
      "headline": "India says trade talks with US positive, forward-looking; ground set for 6th roundThe Commerce Ministry said the discussions with the US trade officials were \"positive and forward-looking\" and covered various aspects of the proposed trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/commonwealth-leaked-report-2024-pakistan-general-election-rigging-shehbaz-sharif-asim-munir-army-pti-imran-khan-2788344-2025-09-16",
      "headline": "Pakistan rigged election, Commonwealth panel buried it: Leaked reportThe Commonwealth is facing criticism for allegedly suppressing its observer report on Pakistan's 2024 general election. A leaked document accuses the military-backed Shehbaz Sharif government of widespread rigging and curbing political freedoms. Despite protocol, the Commonwealth failed to publish the findings for the first time in 70 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ex-nepal-minister-np-saud-admits-failures-after-gen-z-protests-2788336-2025-09-16",
      "headline": "We didn't deliver good governance: Ex-Nepal minister admits failures after protestsIn a candid interview with India Today TV, Former Foreign Minister Narayan Prakash Saud reflects on Nepali youths' disillusionment, corruption, and the challenges facing the interim government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-dark-showering-the-secret-to-better-sleep-and-mental-health-2788220-2025-09-16",
      "headline": "Is dark showering the secret to better sleep and mental health?Wellness trends come and go, but this one feels timeless. And experts unpack why it makes more sense now than ever before."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/man-falsely-confessed-to-shooting-charlie-kirk-glbs-2788461-2025-09-17",
      "headline": "I shot him, now shoot me: Man falsely confessed to shooting Charlie KirkThe man, identified as George Zinn, shouted at officers in the chaotic aftermath of the shooting, \"I shot him, now shoot me.\" According to newly released documents, Zinn's actions caused confusion among police, leading to his arrest on charges of obstruction of justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/anti-immigrant-uk-unite-the-kingdom-rally-leader-tommy-robinson-surprising-take-on-indians-hindus-allies-britain-2788130-2025-09-16",
      "headline": "Anti-immigrant UK leader Tommy Robinson has surprising take on IndiansDespite his hardline anti-immigrant stance, UK leader Tommy Robinson has repeatedly praised Indians, particularly Hindus, calling them allies who integrate into British life. Robinson, who recently led a massive rally through the heart of London, had pledged street muscle for Hindus, who he saw as distinctly different from other immigrants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/missed-september-16-itr-deadline-heres-how-to-file-your-return-now-2788320-2025-09-17",
      "headline": "Missed September 16 ITR deadline? Here's how to file your return nowA look at options and consequences for taxpayers who do not file their income tax return by the extended due date of 16 September 2025, including late filing penalties, deadlines for belated returns, and whether tax regimes can be changed."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-javelin-qualification-tokyo-neeraj-arshad-nadeem-timing-2788506-2025-09-17",
      "headline": "Javelin: Neeraj and Arshad in focus as 4 Indians eye berths in finalWorld Athletics Championships 2025: While the spotlight will be on defending champion Neeraj Chopra and Olympic champion Arshad Nadeem, as many as four Indians will look to make it to the final. The qualification round gets underway at 3:40 pm IST with 84.50m being the automatic qualification mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-neeraj-chopra-vs-arshad-nadeem-javelin-india-vs-pakistan-rivalry-2788495-2025-09-17",
      "headline": "Neeraj Chopra vs Arshad Nadeem: How the India vs Pakistan javelin rivalry stacks upNeeraj Chopra vs Arshad Nadeem, World Athletics Championships: India's Neeraj Chopra holds a commanding 9-1 lead in head-to-head contests against Pakistan's Arshad Nadeem in men's javelin throw. Their rivalry has become one of the most compelling storylines in international athletics, especially on the stage of the Olympics and World Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-sarvesh-kusale-high-jump-final-ranking-sixth-finish-belief-2788487-2025-09-17",
      "headline": "Whisper to roar: Sarvesh Kushare's lead into the world's eliteSarvesh Kushare cleared 2.28m to finish sixth in Tokyo, the highest-ever by an Indian high jumper at a World Championship, turning a world ranking of 38 into a stage where his belief outjumped expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-litton-das-silent-support-rivals-sri-lanka-super-4-race-2788467-2025-09-17",
      "headline": "Asia Cup: Litton Das stays coy on backing Sri Lanka for Bangladesh's Super 4s raceBangladesh captain Litton Das remains coy on supporting Sri Lanka in Asia Cup Super 4s race. The Tigers' tournament fate now hinges on the Sri Lanka-Afghanistan match outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-bangladesh-afghanistan-sri-lanka-super-4-qualification-scenario-2788463-2025-09-17",
      "headline": "Asia Cup 2025: Bangladesh's Super 4 hopes rest on 'Naagin' rivals, Sri LankaBangladesh's Super 4 hopes hinge on Sri Lanka's clash against Afghanistan. The final Group B match could trigger a three-way tie decided by net run rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-vs-uae-confirmed-boycott-threat-u-turn-handshake-2788462-2025-09-17",
      "headline": "Pakistan make U-turn on boycott threat, will go ahead with UAE match: SourcesPakistan's dramatic boycott threat has ended in a U-turn. Despite the ICC rejecting their demand to remove match referee Andy Pycroft, sources told India Today that Pakistan will face the UAE on Wednesday in Dubai. The decision followed consultations between PCB chief Mohsin Naqvi and Prime Minister Shehbaz Sharif."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-pakistan-resume-training-boycott-threat-uae-clash-2788457-2025-09-17",
      "headline": "Asia Cup: Despite threatening boycott, Pakistan train on eve of UAE matchPakistan resumed training ahead of their decisive Asia Cup match against UAE. The team's future in the tournament remains uncertain amid ongoing tensions with India and PCB deliberations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bangladesh-beat-afghanistan-alive-super-4-race-2788456-2025-09-17",
      "headline": "Asia Cup: Bangladesh stay alive in Super 4 race with 8-run win vs AfghanistanAsia Cup: Bangladesh fought hard to claim an 8-run victory over Afghanistan in a must-win Group B clash, keeping their Super Four hopes alive in the Asia Cup 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-mohammad-yousuf-suryakumar-yadav-pig-slur-madan-lal-2788447-2025-09-16",
      "headline": "Mohammad Yousuf's slur on Suryakumar shows Pakistan's character: Madan LalAsia Cup 2025: World Cup-winning former India fast bowler Madan Lal, speaking to India Today, criticised Mohammad Yousuf for his derogatory remarks against Suryakumar Yadav. Madan Lal said such comments from Pakistan cricketers shows the true character of their country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-west-indies-announce-squad-for-india-tests-ahmedabad-delhi-2788433-2025-09-16",
      "headline": "IND vs WI: West Indies name squad for India Tests, Chanderpaul returnsCricket West Indies has named a 15-member squad for the upcoming two-Test series against India. The selection features recalls and a maiden spinner call-up, aiming to tackle challenging Indian conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-lose-afc-champions-league-2-opener-to-ahal-fk-late-goal-2788432-2025-09-16",
      "headline": "Mohun Bagan stunned at home: Late Ahal strike hands 1-0 home defeat in ACL2 openerMohun Bagan started their AFC Champions League 2 campaign with a 1-0 defeat to Ahal FK at Salt Lake Stadium. The loss highlights defensive issues and raises concerns about their qualification hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-pakistan-resume-training-boycott-threat-uae-clash-2788457-2025-09-17",
      "headline": "Asia Cup: Despite threatening boycott, Pakistan train on eve of UAE matchPakistan resumed training ahead of their decisive Asia Cup match against UAE. The team's future in the tournament remains uncertain amid ongoing tensions with India and PCB deliberations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bangladesh-beat-afghanistan-alive-super-4-race-2788456-2025-09-17",
      "headline": "Asia Cup: Bangladesh stay alive in Super 4 race with 8-run win vs AfghanistanAsia Cup: Bangladesh fought hard to claim an 8-run victory over Afghanistan in a must-win Group B clash, keeping their Super Four hopes alive in the Asia Cup 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-mohammad-yousuf-suryakumar-yadav-pig-slur-madan-lal-2788447-2025-09-16",
      "headline": "Mohammad Yousuf's slur on Suryakumar shows Pakistan's character: Madan LalAsia Cup 2025: World Cup-winning former India fast bowler Madan Lal, speaking to India Today, criticised Mohammad Yousuf for his derogatory remarks against Suryakumar Yadav. Madan Lal said such comments from Pakistan cricketers shows the true character of their country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-west-indies-announce-squad-for-india-tests-ahmedabad-delhi-2788433-2025-09-16",
      "headline": "IND vs WI: West Indies name squad for India Tests, Chanderpaul returnsCricket West Indies has named a 15-member squad for the upcoming two-Test series against India. The selection features recalls and a maiden spinner call-up, aiming to tackle challenging Indian conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-lose-afc-champions-league-2-opener-to-ahal-fk-late-goal-2788432-2025-09-16",
      "headline": "Mohun Bagan stunned at home: Late Ahal strike hands 1-0 home defeat in ACL2 openerMohun Bagan started their AFC Champions League 2 campaign with a 1-0 defeat to Ahal FK at Salt Lake Stadium. The loss highlights defensive issues and raises concerns about their qualification hopes."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}