{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-president-impact-of-potential-trade-tariff-world-economic-forum-president-borge-brende-interview-2667549-2025-01-20",
      "headline": "Donald Trump is a dealmaker: WEF President Børge Brende on potential US trade tariffsWorld Economic Forum President Børge Brende said while some tariffs may be introduced by the US administration, Donald Trump's ultimate goal will likely be to negotiate favourable deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-avoid-paying-credit-card-annual-fees-here-are-3-easy-tips-2667436-2025-01-20",
      "headline": "Want to avoid paying credit card annual fees? Here are 3 easy tipsSometimes banks may waive your annual fees as a goodwill gesture, if you are a loyal customer with a good credit history.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-elites-wealth-tripled-in-2024-4-new-billionaires-every-week-oxfam-2667393-2025-01-20",
      "headline": "Global elites' wealth grew 3x faster in 2024; 4 new billionaires weekly: OxfamOxfam International, in its latest assessment of global inequality timed to the opening of the World Economic Forum meeting, also predicts at least five trillionaires will crop up over the next decade. A year ago, the group forecast that only one trillionaire would appear during that time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-how-can-government-make-healthcare-more-affordable-2667381-2025-01-20",
      "headline": "Budget 2025: How can government make healthcare more affordableThe healthcare sector expects lowered costs on medical equipment in Budget 2025, thereby boosting affordability and accessibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-rally-as-banking-stocks-power-markets-higher-zomato-falls-7-percent-2667343-2025-01-20",
      "headline": "Sensex, Nifty rally as banking stocks power markets higher; Zomato falls 7%Share Market Today: The S&P BSE Sensex gained 454.11 points to close at 77,073.44, while the NSE Nifty50 added 141.55 points to end at 23,344.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-q3-results-share-price-fall-over-as-net-profit-drops-over-57-percent-2667342-2025-01-20",
      "headline": "Zomato shares decline 7% as Q3 profit tumbles over 57%Zomato Stock Price: Soon after the Q3 results were released, Zomato shares sharply declined over 7%, hitting a day's low of Rs 228.80. At market closing, the food delivery giant's shares fell 3.14% to Rs 240.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-new-income-tax-bill-likely-to-be-introduced-for-simpler-taxation-2667315-2025-01-20",
      "headline": "Budget 2025: New income tax bill likely to be introduced for simpler taxationThe bill will be introduced directly in Parliament, wherein stakeholder inputs including taxpayers and experts, would be incorporated, before being finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ian-bremmer-sheds-light-on-impact-of-us-president-elect-donald-trumps-second-term-2667289-2025-01-20",
      "headline": "Ian Bremmer sheds light on impact of Trump's second term In an exclusive interview with India Today TV, Ian Bremmer shared his insights on the implications of Donald Trump's second term for the US, India and the world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rallis-india-share-price-falls-8-percent-after-q3-results-should-you-sell-or-hold-2667288-2025-01-20",
      "headline": "Rallis India share price falls 8% after Q3 results. Should you sell or hold?Shares of Rallis India were down 8% in early trade and were down 6.82% to Rs 269.85 at around 1:56 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ian-bremmer-calls-elon-musk-the-most-powerful-man-after-donald-trump-in-us-davos-wef-2667287-2025-01-20",
      "headline": "Ian Bremmer calls Elon Musk the most powerful man after Donald Trump in USIan Bremmer responded with a yes when asked if Musk is right now the most powerful man in the US after Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/faster-pf-transfers-direct-online-claims-check-benefits-of-new-epfo-rules-2667279-2025-01-20",
      "headline": "Faster PF transfers, direct online claims: Check benefits of new EPFO rulesThe newly introduced measures are expected to minimise the turnaround time, thereby benefiting about 94% of the 13 million claims filed during FY 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-600-points-why-is-stock-market-rising-today-2667253-2025-01-20",
      "headline": "Sensex jumps 600 points. Why is stock market rising today?Stock market today: While volatility on Dalal Street rose during the trading session, gains in major shares such as Kotak Mahindra Bank, Wipro, Bajaj Finance, Bajaj Finserv, SBI and Reliance Industries contributed to the market gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-q3-fy25-financial-results-revenue-surges-to-rs-1828-crore-closer-to-profitability-2667232-2025-01-20",
      "headline": "Paytm Q3 FY25 results: Revenue surges to Rs 1,828 crore, gets closer to profitabilityThe growth was propelled by the company's robust payments business and an expanding portfolio in financial services distribution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bankrupt-airline-go-first-liquidation-plea-approved-by-law-tribunal-2667226-2025-01-20",
      "headline": "Bankrupt airline Go First's liquidation plea approved by law tribunalGo First's lenders decided to liquidate the bankrupt budget carrier's assets in August of last year after rejecting bids by interest suitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-vodafone-idea-share-price-surged-15-percent-today-reason-agr-dues-waiver-2667211-2025-01-20",
      "headline": "Explained: Why Vodafone Idea share price surged 15% todayVodafone Idea stock: The shares hit the day's high of Rs 10.48, rising close to 15% after it closed at Rs 9.12 in the previous session. 10.03"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-richest-10-percent-took-half-of-colonial-indias-wealth-report-2667204-2025-01-20",
      "headline": "UK's richest 10% took half of colonial India's wealth: ReportA report mentioned that colonialism was responsible for ruining Indian industrial output by imposing strict protectionist policies which prevented Asian textiles from competing in the global market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-gains-after-reporting-q3-results-check-details-here-2667202-2025-01-20",
      "headline": "Paytm share price gains after reporting Q3 results. Check details herePaytm shares were up 1.44% to Rs 912.60 on the Bombay Stock Exchange (BSE) at 11:25 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kotak-mahindra-bank-share-price-up-10-after-q3-results-buy-hold-or-sell-2667185-2025-01-20",
      "headline": "Kotak Mahindra Bank share price up 10% after Q3 results. Buy, hold or sell?Kotak Mahindra Bank stock price: The private lender's shares have got several upgrades from brokerage firms following its strong third-quarter performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/laxmi-dental-ipo-share-price-opens-at-23-percent-premium-on-dalal-street-hold-sell-expert-view-2667166-2025-01-20",
      "headline": "Laxmi Dental IPO listing: Shares open at 23% premium on D-Street. Hold or sell?  Laxmi Dental stock price: The shares of Laxmi Dental opened at Rs 528 on the Bombay Stock Exchange (BSE) reflecting a gain of 23.36% over its IPO price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-boosted-by-banking-stocks-kotak-bank-gains-10-percent-2667153-2025-01-20",
      "headline": "Sensex, Nifty open higher boosted by banking stocks. Kotak Bank gains 10%The S&P BSE Sensex was up 168.02 points to 76,787.35, while the NSE Nifty50 was up 31.55 points to 23,234.75 as of 10 AM. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-inauguration-swearing-in-ceremony-latest-news-washington-weather-jd-vance-biden-elon-musk-melania-speech-parade-2667380-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's second act: Swearing-in today, over 200 executive actions tomorrow Live UpdatesTrump oath ceremony: Donald Trump is set to be sworn in as the 47th President of the United States today. He will hit the ground running in his second term, pledging to issue \"close to 100\" executive orders on his first day in office on hot-button issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/biden-preemptive-pardons-general-mark-milley-dr-anthony-fauci-january-6-panel-members-trump-inauguration-2667454-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Biden's pre-emptive pardons for Dr Fauci, army general hours before Trump oathTrump, who will be inaugurated later on Monday, has previously signalled plans to target political adversaries in his second term, vowing \"retribution\" against those who sought to hold him accountable for the January 6 Capitol riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-letter-donald-trump-inauguration-s-jaishankar-special-envoy-us-india-relations-2667519-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi's letter for Trump as he takes charge, S Jaishankar is messengerS Jaishankar is representing PM Modi as his special envoy at Donald Trump's inauguration in Washington. He will hand over a letter from the PM to the new US President."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sharon-raj-murder-case-who-is-greeshma-youngest-woman-to-get-death-penalty-in-kerala-2667443-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sharon Raj murder case: Who is Greeshma, youngest woman to get death penalty in Kerala?Greeshma wanted to end her relationship with Sharon as she was engaged to another man but Sharon refused, following which Greeshma conspired to kill him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-lashes-out-media-portal-attack-saif-ali-khan-stop-this-now-2667398-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leave us alone: Kareena Kapoor Khan reacts to reel in now-deleted angry postIn a social media post, actor Kareena Kapoor Khan requested the media to respect her family's privacy following a knife attack on Saif Ali Khan. However, she deleted the post later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-oath-ceremony-live-updates-washington-dc-all-set-for-inauguration-event-s-jaishankar-to-represent-india-2667239-2025-01-20?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Joe Biden, wife Jill meet Donald Trump and wife Melania ahead of inaugurationDonald Trump Swearing In Ceremony Live Updates: Donald Trump will take the oath as the 47th President of the United States in an inauguration ceremony at the Capitol Rotunda in Washington DC on Monday (local time). The inauguration ceremony was shifted indoors because of the forecast of severe windchill. Ahead of the mega event, External Affairs Minister S Jaishankar reached the United States to represent India. He also held meetings with his counterparts from Australia and Japan here during which they discussed bilateral issues and those pertaining to QUAD. Follow India Today for all the latest updates of Donald Trump's swearing-in ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bengaluru-techie-suicide-atul-subhash-wife-gets-custody-of-child-supreme-court-dismisses-mothers-plea-2667464-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atul Subhash's wife gets child's custody, Supreme Court dismisses mother's pleaThe Supreme Court has allowed Atul Subhash's wife, who was blamed by the techie in the suicide note he left behind, to have custody of their 4-year-old son. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/video/trump-inauguration-supporters-emotional-washington-india-todav-exclusive-2667422-2025-01-20?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Trump supporters get teary-eyed ahead of inauguration: 'He loves us'Excitement is palpable among the MAGA supporters as they wait for President-elect Donald Trump to take his place in the White House. Braving cold and rain, two women supporters stood endlessly in the long line for Trump's inauguration. India Today TV's Anjana Om Kashyap, who is reporting live from Washington DC, spoke to the Trump supporters and asked them what they would like to say to Trump.  \"Thank you, thank you for saving us,\" one of them said. \r\n\r\nThe two women got teary-eyed.\r\n\r\n\"He is for us, he loves us, he wants to save our country,\" one of them said. \"He almost died two times.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-himani-mor-love-story-united-states-dowry-uncle-exclusive-2667316-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jab Neeraj met Himani: Olympian's uncle shares couple's love story Neeraj Chopra's uncle, Surendra Chopra, revealed details about the Olympian's destination wedding in Shimla in an interview with India Today. The Olympic medallist tied the knot with his long-time girlfriend, Himani Mor, a former tennis player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rg-kar-case-kolkata-trainee-doctor-rape-murder-convict-sanjay-roy-sentence-court-sealdah-life-sentence-fine-2667311-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RG Kar rape-murder convict gets life term, court says 'not rarest of rare case'The CBI court on Monday sentenced Sanjay Roy to life imprisonment till death and a fine of Rs 50,000 for the rape and murder of a trainee doctor at Kolkata's RG Kar Hospital last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/premanand-maharaj-advice-on-same-sex-relations-is-viral-2667472-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Spiritual guru Premanand Maharaj's advice on same-sex relations goes viralA man attended the spiritual guru's satsang and revealed that while his family was pushing him to get married, he felt drawn to men. Here's what Premanand Maharaj said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-oath-ceremony-first-executive-order-male-female-transgender-day-one-2667320-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Men will be men: Trump to sign gender-identity Executive Order on Day 1One of Donald Trump's first executive orders will mandate government documents in the US to reflect biological sex instead of self-assessed gender identity, says a report. It would also end tax-funded sex change surgeries for inmates. The order will also remove biological men from women's jails, sports and locker rooms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-two-spoons-of-rum-at-night-cure-your-winter-cough-2667458-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can two spoons of rum at night cure your winter cough?Many believe drinking rum or brandy with warm water can help deal with coughing during winter. But what do doctors say?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-day-9-live-updates-jannik-sinner-iga-swiatek-melbourne-2667100-2025-01-20?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 9 Live Updates: Swiatek storms into quarters, Monfils retires hurt vs SheltonAustralian Open Day 9 Live Updates: Iga Swiatek decimates Eva Lys, a qualifier, 6-0, 6-1 to storm into the quarters. Gael Monfils's inspired run came to an end with an injury in the fourth round against Ben Shelton. Jannik Sinner defeated Holger Rune in his fourth round fixture at the Rod Laver Arena by 6-3, 3-6, 6-3, 6-2. Gael is also Monflis is in action vs Ben Shelton at Margaret Court Arena. On the other hand, Elena Rybakina got knocked out after losing against Madison Keys. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-international-airlines-pia-inaugural-gwadar-airport-china-investment-global-times-bri-debt-trap-cpec-2667488-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan rejoices over Gwadar airport, China dubs it donationThe newly inaugurated Gwadar airport in Balochistan has been branded a \"donation\" by the Chinese Communist Party's mouthpiece, Global Times. This even as Pakistan hailed the USD 230-million airport as a \"symbol of friendship\". Critics are calling it another cog in Beijing's debt-trap diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-has-vowed-to-prosecute-kamala-harris-barack-obama-intel-officers-2667394-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kamala Harris, ex-intel officers: Who Trump has vowed to prosecute as PresidentThroughout his campaign, US President-elect Donald Trump was vocal about his intent to confront anyone he viewed as obstructing his path back to the White House. With his victory now secured, apprehension is growing over whether Trump will make good on his fiery promises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/then-and-now-melania-trump-gears-up-for-white-house-return-what-has-changed-2667383-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Then and now: As Melania Trump gears up for White House return, what has changed?Melania Trump is all set to take charge as the First Lady of the United States for the second term after a gap of four years. Here's how it is going to be different this time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-stabbing-incident-mumbai-police-attacker-shariful-bangladeshi-citizen-2667355-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Mumbai Police found out Saif Ali Khan's attacker was a Bangladeshi nationalWhen the police confronted Shariful, he said that he was a resident of West Bengal. On probing further, Shariful was unable to give details of his residence and whereabouts in West Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-reacts-coldplay-special-shoutout-mumbai-concert-2667438-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah reacts to Coldplay's special shoutout in Mumbai concertIndia's star pacer Jasprit Bumrah reacted to Coldplay vocalist Chris Martin's special shout-out to him during their concert in Mumbai on Saturday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/iit-madras-director-v-kamakoti-says-american-research-paper-prove-cow-urine-benefits-scientifically-2667424-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT Madras Director stands by cow urine's 'health benefits' remark amid backlashIIT Madras Director V Kamakoti stuck to his remarks on cow urine. He said he could present research papers that scientifically prove the benefits of cow urine. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-air-quality-pollution-caqm-grap-4-restriction-guidelines-confusion-traffic-police-challan-ncr-2667184-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi fighting confusion, not pollution, this winterFrequent imposition of crippling Grap restrictions without any formal communication has left Delhi NCR residents scrambling. Not only has it hit the livelihood of the poor, hefty traffic fines of Rs 20,000 have sown chaos in Delhi-NCR even as pollution persists this winter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-oath-ceremony-second-term-fears-foreign-policy-trade-economy-h-1b-visa-indians-explained-2667304-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Trump 2.0 shouldn't scare you. 5 big pointsThere's widespread apprehension surrounding Donald Trump's return to the Oval Office. However, his track record and promises show potential opportunities for economic growth, global stability, and pragmatic governance. Here's explained in five points, why Trump 2.0 might bring more balance than chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mela-2025-satellite-images-huge-tent-city-devotees-2667477-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Satellite images capture huge tent city, sea of devotees in Maha Kumbh Mela 2025The first set of high resolution satellite pictures show the area possibly affected by Sunday's blaze at Kumbh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-rishabh-pant-lsg-captain-auction-price-money-2667471-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rishabh Pant reacts to his record IPL Auction bid: Money is not the main thingRishabh Pant was named the captain of Lucknow Super Giants on Monday, January 20. Asked about the pressure of price tag, given he is the most expensive player in IPL history, Pant said that money was not the main thing for him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/sanjay-dutt-visits-saif-ali-khan-at-the-hospital-2667526-2025-01-20",
      "headline": "Watch: Sanjay Dutt visits Saif Ali Khan at the hospitalBollywood star Sanjay Dutt paid a visit to Lilavati hospital to check on actor Saif Ali Khan. The actor is currently undergoing treatment after being stabbed after being stabbed by an intruder who broke into his Mumbai residence during a burglary attempt on Thursday (January 16). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-shares-most-horrifying-moments-in-his-career-2667525-2025-01-20",
      "headline": "R Madhavan shares his most 'horrifying moments' in careerActor R Madhavan recently shared the 'most horrifying moments' of his career. In an interview, he opened up on his OTT and theatre experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-reacts-to-attack-on-saif-ali-khan-glad-he-is-safe-2667506-2025-01-20",
      "headline": "Akshay Kumar reacts to attack on Saif Ali Khan: Glad he's safeActor Akshay Kumar said he's glad Saif Ali Khan is safe following the knife attack. He recalled their past collaboration on Main Khiladi Tu Anari."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-sells-his-oshiwara-duplex-for-rs-83-crore-2667473-2025-01-20",
      "headline": "Amitabh Bachchan sells his Oshiwara duplex for Rs 83 croreBollywood actor Amitabh Bachchan has sold his duplex apartment in Mumbai's Oshiwara locality for Rs 83 crore. In 2021, the property was rented to Kriti Sanon for a monthly rent of Rs 10 lakh."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-gautam-gambhir-under-pressure-brendon-mccullum-2667524-2025-01-20",
      "headline": "He is a strong leader of men: McCullum backs under-fire Gautam GambhirIND vs ENG: England coach Brendon McCullum backed under-fire Gautam Gambhir ahead of the 1st T20I match of the series. Gambhir, who recently lost Test series against New Zealand and Australia, will be under pressure in the white-ball series against England and the Champions Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-mother-esther-tears-alex-de-minaur-quarterfinal-1st-time-2667508-2025-01-20",
      "headline": "Mother in tears as Alex de Minaur reaches quarters for 1st timeAlex de Minaur's mother Esther could not hide her emotions after the tennis star reached the Australian Open 2025 quarter-final for the first time. Alex de Minaur will face defending champion Jannik Sinner in the quarter-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-rishabh-pant-punjab-kings-joke-captain-lucknow-sanjiv-goenka-2667503-2025-01-20",
      "headline": "Rishabh Pant takes cheeky dig at Punjab Kings after being named Lucknow captainIPL 2025: Rishabh Pant joked about Punjab Kings' big purse, saying he was scared they would bid for him. The wicketkeeper-batter was named Lucknow Super Giants captain on Monday, January 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-rishabh-pant-lsg-captain-auction-price-money-2667471-2025-01-20",
      "headline": "Rishabh Pant reacts to his record IPL Auction bid: Money is not the main thingRishabh Pant was named the captain of Lucknow Super Giants on Monday, January 20. Asked about the pressure of price tag, given he is the most expensive player in IPL history, Pant said that money was not the main thing for him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-reacts-coldplay-special-shoutout-mumbai-concert-2667438-2025-01-20",
      "headline": "Jasprit Bumrah reacts to Coldplay's special shoutout in Mumbai concertIndia's star pacer Jasprit Bumrah reacted to Coldplay vocalist Chris Martin's special shout-out to him during their concert in Mumbai on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/lewis-hamilton-day-1-ferrari-driver-f40-car-classic-photoshoot-mercedes-formula-one-2667420-2025-01-20",
      "headline": "Lewis Hamilton celebrates Day 1 as Ferrari driver in a classic fashionLewis Hamilton began an exciting new chapter in his legendary Formula 1 career by joining Ferrari. He celebrated his first day as a driver with a nostalgic photoshoot featuring the iconic Ferrari F40, captivating fans worldwide with the announcement.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yashasvi-jaiswal-mumbai-squad-ranji-trophy-game-2667407-2025-01-20",
      "headline": "Rohit Sharma, Yashasvi Jaiswal named in Mumbai squad for next Ranji Trophy gameIndia captain Rohit Sharma and opener Yashasvi Jaiswal were named in Mumbai's 17-member squad for their next Ranji Trophy encounter against Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-iga-swiatek-gael-monfils-vs-ben-shelton-2667358-2025-01-20",
      "headline": "Iga Swiatek reaches quarter-finals with dominant win, 'injured' Monfils crashes outAustralian Open: Former World No.1 Iga Swiatek continued her brilliant run in the tournament. She knocked out Lucky Loser Eva Lys in the fourth round of the competition in straight sets. In the men's division, Gael Monfils' terrific run ended due to an ankle injury."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/neeraj-chopra-himani-mor-met-in-united-states-uncle-surendra-chopra-2667338-2025-01-20",
      "headline": "Neeraj and Himani met in the United States, reveals javelin star's uncleTwo-time Olympic medallist javelin star Neeraj Chopra's uncle, Surendra Chopra, shared that the Olympian met his wife, Himani Mor, in the United States. The couple got to know each other there before eventually tying the knot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-himani-mor-love-story-united-states-dowry-uncle-exclusive-2667316-2025-01-20",
      "headline": "Jab Neeraj met Himani: Olympian's uncle shares couple's love story Neeraj Chopra's uncle, Surendra Chopra, revealed details about the Olympian's destination wedding in Shimla in an interview with India Today. The Olympic medallist tied the knot with his long-time girlfriend, Himani Mor, a former tennis player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-reply-elon-musk-message-australian-open-broadcaster-row-2667326-2025-01-20",
      "headline": "Musk's swipe at legacy media after Djokovic posts video, tennis star concursNovak Djokovic subtly acknowledged Elon Musk's support after an Australian journalist's controversial comments. The Serbian tennis star remained composed amidst criticism, showing his resilience during the Australian Open 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yashasvi-jaiswal-mumbai-squad-ranji-trophy-game-2667407-2025-01-20",
      "headline": "Rohit Sharma, Yashasvi Jaiswal named in Mumbai squad for next Ranji Trophy gameIndia captain Rohit Sharma and opener Yashasvi Jaiswal were named in Mumbai's 17-member squad for their next Ranji Trophy encounter against Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-iga-swiatek-gael-monfils-vs-ben-shelton-2667358-2025-01-20",
      "headline": "Iga Swiatek reaches quarter-finals with dominant win, 'injured' Monfils crashes outAustralian Open: Former World No.1 Iga Swiatek continued her brilliant run in the tournament. She knocked out Lucky Loser Eva Lys in the fourth round of the competition in straight sets. In the men's division, Gael Monfils' terrific run ended due to an ankle injury."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/neeraj-chopra-himani-mor-met-in-united-states-uncle-surendra-chopra-2667338-2025-01-20",
      "headline": "Neeraj and Himani met in the United States, reveals javelin star's uncleTwo-time Olympic medallist javelin star Neeraj Chopra's uncle, Surendra Chopra, shared that the Olympian met his wife, Himani Mor, in the United States. The couple got to know each other there before eventually tying the knot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-himani-mor-love-story-united-states-dowry-uncle-exclusive-2667316-2025-01-20",
      "headline": "Jab Neeraj met Himani: Olympian's uncle shares couple's love story Neeraj Chopra's uncle, Surendra Chopra, revealed details about the Olympian's destination wedding in Shimla in an interview with India Today. The Olympic medallist tied the knot with his long-time girlfriend, Himani Mor, a former tennis player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-reply-elon-musk-message-australian-open-broadcaster-row-2667326-2025-01-20",
      "headline": "Musk's swipe at legacy media after Djokovic posts video, tennis star concursNovak Djokovic subtly acknowledged Elon Musk's support after an Australian journalist's controversial comments. The Serbian tennis star remained composed amidst criticism, showing his resilience during the Australian Open 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ipl-rishabh-pant-lucknow-super-giants-captain-sanjiv-goenka-2667319-2025-01-20",
      "headline": "Rishabh Pant will become the best captain in IPL history: LSG owner Sanjiv GoenkaIPL 2025: Lucknow Super Giants (LSG) owner Sanjiv Goenka appointed India wicketkeeper batter Rishabh Pant as the new captain of the Lucknow-based franchise. The LSG owner said Pant would become the best captain in Indian Premier League (IPL) history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-axar-patel-reveals-indias-new-mantra-about-not-having-fixed-batting-slots-2667312-2025-01-20",
      "headline": "Axar Patel reveals India's new mantra about not having fixed batting slotsIndia all-rounder Axar Patel has revealed that no one in the Indian batting line up has a fixed place in the T20I side apart from the openers ahead of the England series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-cricketer-rinku-singh-to-marry-samajwadi-party-mp-priya-saroj-2667305-2025-01-20",
      "headline": "India cricketer Rinku Singh to marry Samajwadi Party MP Priya SarojStar Indian batter Rinku Singh is set to get married to Samajwadi Party (SP) MP Priya Saroj, according to her family. Priya's father, Tufani Saroj, confirmed the matrimonial alliance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-caoch-gautam-gambhir-hardik-pandya-chat-eden-gardens-2667296-2025-01-20",
      "headline": "Coach Gautam Gambhir, Hardik Pandya in 30-minute chat amid vice-captaincy rumoursDuring India's first training session at the Eden Gardens for the T20I series against England, head coach Gautam Gambhir and Hardik Pandya had an intense discussion for over 30 minutes. Hardik was not named India's vice-captain for the upcoming Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-prepares-for-england-t20is-with-intense-bowling-session-2667280-2025-01-20",
      "headline": "Watch: Mohammed Shami prepares for England T20Is with intense bowling sessionStar India fast bowler Mohammed Shami has begun preparations for his team India comeback as he engaged in an intense practice session at Eden Gardens ahead of 1st T20I vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-bat-responsibility-champions-trophy-suresh-raina-2667282-2025-01-20",
      "headline": "Rishabh Pant needs to play with more responsibility in Champions Trophy: RainaFormer India batter Suresh Raina has urged Rishabh Pant to take \"responsibility\" with the bat in the home ODI series against England and the Champions Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nigeria-beat-new-zealand-u19-womens-world-cup-script-history-cricket-2667263-2025-01-20",
      "headline": "Nigeria script history after beating New Zealand in U-19 World CupNigeria created history by defeating New Zealand in the ICC Women's U19 T20 World Cup, securing their first-ever victory. Despite rain-curtailed conditions and a modest total, Nigeria's disciplined bowling and exceptional fielding sealed a thrilling two-run win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yograj-singh-urges-kohli-rohit-to-play-domestic-cricket-2667249-2025-01-20",
      "headline": "Yograj Singh urges Kohli-Rohit to play domestic cricket: No one's bigger than gameFormer India cricketer Yograj Singh has urged senior players Virat Kohli and Rohit Sharma to play in domestic cricket saying that no one's bigger than the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-prepares-for-england-t20is-with-intense-bowling-session-2667280-2025-01-20",
      "headline": "Watch: Mohammed Shami prepares for England T20Is with intense bowling sessionStar India fast bowler Mohammed Shami has begun preparations for his team India comeback as he engaged in an intense practice session at Eden Gardens ahead of 1st T20I vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-bat-responsibility-champions-trophy-suresh-raina-2667282-2025-01-20",
      "headline": "Rishabh Pant needs to play with more responsibility in Champions Trophy: RainaFormer India batter Suresh Raina has urged Rishabh Pant to take \"responsibility\" with the bat in the home ODI series against England and the Champions Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nigeria-beat-new-zealand-u19-womens-world-cup-script-history-cricket-2667263-2025-01-20",
      "headline": "Nigeria script history after beating New Zealand in U-19 World CupNigeria created history by defeating New Zealand in the ICC Women's U19 T20 World Cup, securing their first-ever victory. Despite rain-curtailed conditions and a modest total, Nigeria's disciplined bowling and exceptional fielding sealed a thrilling two-run win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yograj-singh-urges-kohli-rohit-to-play-domestic-cricket-2667249-2025-01-20",
      "headline": "Yograj Singh urges Kohli-Rohit to play domestic cricket: No one's bigger than gameFormer India cricketer Yograj Singh has urged senior players Virat Kohli and Rohit Sharma to play in domestic cricket saying that no one's bigger than the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-beat-holger-rune-injury-reach-australian-open-quarterfinal-2667242-2025-01-20",
      "headline": "Jannik Sinner overcomes Rune, injury scare to reach quarterfinalDefending champion Jannik Sinner battled past Holger Rune 6-3, 3-6, 6-3, 6-2 to reach the men's singles quarterfinal of the Australian Open 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-siraj-in-ravindra-jadeja-out-aakash-chopra-suggests-india-squad-2667203-2025-01-20",
      "headline": "Mohammed Siraj in, Ravindra Jadeja out for Champions Trophy: Aakash ChopraAakash Chopra believes India's Champions Trophy squad missed a trick by excluding Mohammed Siraj, suggesting his inclusion could have bolstered the pace attack at the expense of Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-madison-keys-knocks-out-elena-rybakina-in-gruelling-4th-round-clash-2667215-2025-01-20",
      "headline": "Australian Open: Madison Keys knocks out Rybakina in gruelling 4th round clashMadison Keys stunned sixth seed Elena Rybakina in her fourth round fixture of the Australian Open 2025 beating her 6-3, 1-6, 6-3 at the Margaret Court Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-broadcaster-after-novak-djokovics-post-match-interview-controversy-2667220-2025-01-20",
      "headline": "Australian broadcaster says Djokovic comments were banter, apologises on airAustralian broadcaster Tony Jones has apologised to Novak Djokovic and his fans after the legendary player refused to give a post-match interview after his fourth round fixture in the Australian Open 2025."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}