{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maximising-returns-how-to-select-top-mutual-funds-for-your-portfolio-investment-tips-money-wealth-2595507-2024-09-07",
      "headline": "Maximising returns: How to select top mutual funds for your portfolioMutual funds have emerged as a popular investment option, offering a balanced approach to growing wealth without the complexity of managing individual stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-criticises-auditor-bdo-exit-call-recordings-illegal-requests-demands-2595495-2024-09-07",
      "headline": "'Multiple call recordings exist': Byju's cries foul after auditor BDO resignsIn a strong response to BDO's resignation, Byju's has accused the audit firm of making unethical requests and manipulating the audit process, including suggesting the backdating of financial reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-auditor-bdo-resigns-financial-crisis-trouble-mounts-edtech-firm-legal-challenges-2595469-2024-09-07",
      "headline": "Byju's crisis worsens as second auditor BDO resigns over financial concernsBDO's exit comes just a year after Deloitte, the company's previous auditor, stepped down citing problems with Byju's financial reporting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-propose-18-percent-tax-on-digital-transactions-up-to-rs-2000-report-2595232-2024-09-06",
      "headline": "Payment aggregators may face 18% GST for transactions up to Rs 2,000: ReportThe final decision will be made at the GST Council's 54th meeting, chaired by Finance Minister Nirmala Sitharaman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-economy-data-adds-142000-jobs-in-august-unemployment-rate-drops-to-42-percent-expert-view-2595171-2024-09-06",
      "headline": "US adds 1,42,000 jobs in August; unemployment rate drops to 4.2%While the job data fell short of expectations, a slight dip in the unemployment rate to 4.2% indicated that the labour market is gradually cooling off, but not dramatically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-study-ipo-investors-not-looking-beyond-listing-gains-are-they-missing-out-expert-view-analysis-2595125-2024-09-06",
      "headline": "IPO investors are not looking beyond listing gains, are they missing out?According to a Sebi study, 70% of the shares, by value, were sold within a year of the IPO. The quick turnover is particularly noticeable in cases where IPO shares see a strong rise in value right after listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anant-ambani-donates-20-kg-gold-crown-worth-rs-15-crore-to-lalbaugcha-raja-2595102-2024-09-06",
      "headline": "Anant Ambani donates 20 kg gold crown worth Rs 15 crore to Lalbaugcha RajaLalbaugcha Raja, Mumbai's most popular Ganesh idol, was unveiled on Thursday ahead of Ganesh Chaturthi. Devotees visit the Lalbaugcha Raja for darshan during the 10-day Ganesh festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-share-price-surges-15-percent-record-high-despite-stock-market-crash-explained-2595026-2024-09-06",
      "headline": "Explained: Why Godfrey Phillips shares hit record high despite market downturnAt the closing bell, the shares of Godfrey Phillips were up 12.69% at Rs 7,204.35 on the Bombay Stock Exchange (BSE). Earlier, the stock jumped 14.50% to reach a record high of Rs 7,320, defying a sharp correction in the domestic indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-decline-for-6th-straight-day-is-it-a-good-time-to-buy-2595008-2024-09-06",
      "headline": "Tata Motors shares decline for 6th straight day. Is it a good time to buy?Tata Motors stock settled over 1.8% lower on Friday, extending losses for the sixth consecutive session. Read on to know whether it is the right time to buy the stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-crashes-1000-point-nifty-slips-under-24900-on-us-data-jitters-2595006-2024-09-06",
      "headline": "Sensex crashes 1,000 points, Nifty slips under 24,900 on US data jittersThe S&P BSE Sensex lost 1017.23 points to close at 81,183.93, while the NSE Nifty50 ended 292.95 points lower to end at 24,852.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-set-to-consider-21-bonus-issue-september-20-shares-jump-over-9-percent-2594984-2024-09-06",
      "headline": "Godfrey Phillips set to consider 2:1 bonus issue; shares jump over 9%A bonus issue is a way for companies to reward existing shareholders without making them pay for the additional shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-1000-points-rs-5-lakh-crore-investors-wealth-wiped-off-2594971-2024-09-06",
      "headline": "Sensex crashes 1,000 points, investors lose Rs 5 lakh croreThe bloodbath on Dalal Street has wiped off nearly Rs 5 lakh crore from the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-may-slash-fuel-prices-as-global-crude-oil-costs-decline-report-2594925-2024-09-06",
      "headline": "Government may slash petrol, diesel prices as global crude oil rates fallUS crude oil prices dropped by more than 1% on Wednesday, falling below $70 per barrel. Brent crude prices followed suit, falling by $1 to reach $72.75 per barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inheritance-showdown-godfrey-phillips-bina-modi-to-vote-on-behalf-of-family-trust-agm-2594904-2024-09-06",
      "headline": "Bina Modi to vote on behalf of family trust at Godfrey Phillips AGMThe Delhi High Court recently allowed Bina to cast her vote on behalf of the trust, which holds a 47.5% stake in the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goldman-sachs-sbi-sell-rating-with-revised-target-price-reason-explained-2594888-2024-09-06",
      "headline": "Goldman Sachs gives SBI 'sell' rating with revised target price. Know whyThe brokerage highlighted a growing risk-reward imbalance for SBI's stock, driven by challenges in maintaining a strong return on assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-household-food-spending-dips-to-less-than-50-percent-eac-pm-report-2594878-2024-09-06",
      "headline": "India's household food spending dips to less than 50%: ReportThe change in spending, highlighted in a recent report by the Economic Advisory Council to the Prime Minister (EAC-PM), signals a shift in how Indian families allocate their monthly budgets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-turbulence-sensex-nifty-down-key-factors-explained-2594841-2024-09-06",
      "headline": "Sensex, Nifty down 1%: What's behind today's stock market turbulence?Today's market turbulence is partly linked to investor jitters ahead of the US non-farm payrolls report expected later today.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-tumbles-goldman-sachs-brokerage-view-83-percent-downside-2594825-2024-09-06",
      "headline": "Explained: Why Vodafone Idea shares tumbled over 14% today As of 11:51 am, Vodafone Idea's shares were trading at Rs13.60, down nearly 10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boss-packaging-solution-shares-sme-ipo-list-25-percent-premium-2594809-2024-09-06",
      "headline": "Boss Packaging Solutions makes debut on NSE SME at 25% premiumBoss Packaging Solutions listing: The stock was listed at Rs 82.5 on the NSE SME, marking a 25% premium over its IPO price of Rs 66."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/vinesh-phogat-haryana-election-congress-candidate-bjp-leader-brij-bhushan-singh-wrestler-2595453-2024-09-07",
      "headline": "God punished you: Brij Bhushan's Olympic 'cheating' dig at Vinesh PhogatBJP leader Brij Bhushan Singh accused Olympic wrestler Vinesh Phogat of cheating to attend the games, claiming she didn't win a medal because God had punished her."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kannauj-woman-beaten-head-shaved-nephew-sexual-harassment-viral-video-2595447-2024-09-07",
      "headline": "Video: UP woman beaten, head shaved after complaining of nephew's harassmentThe viral video shows the woman, with her head shaved and hands and legs tied, being beaten repeatedly with a wooden stick by her husband in front of a small crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-criticises-auditor-bdo-exit-call-recordings-illegal-requests-demands-2595495-2024-09-07",
      "headline": "'Multiple call recordings exist': Byju's cries foul after auditor BDO resignsIn a strong response to BDO's resignation, Byju's has accused the audit firm of making unethical requests and manipulating the audit process, including suggesting the backdating of financial reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williamss-starliner-becomes-only-spacecraft-to-launch-with-crew-return-empty-2595199-2024-09-07",
      "headline": "Starliner becomes only spacecraft to launch with crew but return emptyThis unique situation marks a significant moment in space exploration and highlights the challenges faced in developing new spacecraft systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gayatri-devi-indira-gandhi-emergency-marriage-proposals-sewer-rats-tihar-jail-delhi-2595099-2024-09-07",
      "headline": "Gayatri Devi's days in Emergency: Marriage proposals and sewer rats in TiharThe Princess of Cooch Behar and Maharani of Jaipur, Gayatri Devi, was jailed for five-and-a-half months during the Emergency. She spent those months in Tihar jail with political prisoners, pickpockets, prostitutes, and sewer rats for company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/kolkata-rape-murder-case-sealdah-court-central-bureau-of-investigation-cbi-sanjay-roy-2595256-2024-09-06",
      "headline": "Shall I grant bail to RG Kar accused? Court blasts CBI over lawyer's absenceKolkata rape-murder case: The CBI lawyer eventually arrived 40 minutes late to the court. The court rejected the bail plea of Sanjay Roy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-ollie-pope-england-vs-sri-lanka-oval-2595483-2024-09-07",
      "headline": "ENG vs SL: England's Ollie Pope scripts Test cricket history with unique featEngland vice-captain Ollie Pope registered a unique feat as he scored his seventh Test century on Day 1 of the third Test against Sri Lanka. Pope scored an unbeaten 103 (103) on Day 1 at the Oval."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shoe-trader-thrashed-cow-thief-suspicion-maharashtra-beed-4-arrested-2595353-2024-09-06",
      "headline": "Maharashtra man takes photo of injured cow, thrashed on 'cow thief' suspicion The man was heading home when some people, who called themselves 'Gau Rakshaks', beat him with sticks after falsely accusing him of being involved in cow trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mehbooba-mehbooba-to-tauba-tauba-makers-on-evolution-of-item-songs-2594277-2024-09-07",
      "headline": "Mehbooba Mehbooba to Tauba Tauba: Makers on evolution of item songs'Item songs' or 'item numbers' have been a part of Hindi cinema for ages, and have featured multiple times every decade since the 1950s. In today's edition of Cinematic Saturday, we speak to producers and music artistes to decode their evolution and impact on Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-16-iphone-16-pro-to-launch-at-apple-glowtime-event-india-stream-time-and-how-to-watch-2595494-2024-09-07",
      "headline": "iPhone 16, iPhone 16 Pro to launch at Apple Glowtime event: India stream time and how to watchApple to unveil iPhone 16 series at the 'Apple Glowtime' event on September 9, 2024, at 10:30 PM IST. The event will feature four variants of the iPhone 16 and other new devices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/manju-hooda-bjp-garhi-sampla-kiloi-congress-bhupinder-hooda-haryana-assembly-election-candidate-2595425-2024-09-07",
      "headline": "Cop's daughter, gangster's wife is BJP pick against Bhupinder Hooda in HaryanaManju Hooda, the BJP candidate for the Garhi Sampla-Kiloi constituency, is set to contest against Congress strongman Bhupinder Singh Hooda in the upcoming Haryana Assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-new-era-changing-of-guard-jannik-sinner-taylor-fritz-alcaraz-novak-djokovic-2595454-2024-09-07",
      "headline": "A new era dawns: 2024 signals changing of the guard in men's singles tennis The US Open final on Sunday, September 8, will feature Jannik Sinner, the first Italian man to reach this stage, and Taylor Fritz, the first American man in 18 years to compete in the title match in New York. Remarkably, for the first time since 2002, none of the Big Three -- Novak Djokovic, Roger Federer, or Rafael Nadal has won a Grand Slam title in a calendar year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-aandhi-to-indu-sarkar-films-on-emergency-censorship-kangana-ranaut-indira-gandhi-2594890-2024-09-06",
      "headline": "From bans to reels being burnt, the Aandhi some Emergency films weatheredThe Emergency in India in 1975 led to severe film censorship, impacting movies like Aandhi and Kissa Kursi Ka, which had to do with the life and politics of then Prime Minister Indira Gandhi. As Kangana Ranaut's Emergency is caught in a controversy, here's a look at films on Emergency that raised a storm, or silently conveyed the message."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/delhi-liquor-policy-case-cash-to-goa-mlas-election-aap-aam-aadmi-party-cbi-chargesheet-supreme-court-2595474-2024-09-07",
      "headline": "Liquor policy scam: AAP paid ex-Goa MLAs in cash for poll expenses, claims CBIIn its final chargesheet in the Delhi liquor policy case, the CBI accused Arvind Kejriwal of being involved in a criminal conspiracy, alleging that cash payments were made to two former Goa MLAs for election expenses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-birthday-new-film-dominic-and-the-ladies-purse-first-poster-2595486-2024-09-07",
      "headline": "Mammootty shares first poster of Dominic and The Ladies' Purse on 73rd birthdayMalayalam actor Mammootty announced the name of his new film on his 73rd birthday today (September 7). Titled Dominic and The Ladies' purse, the film might have the actor in the role of a detective. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/environment/story/goa-landslides-wayanad-climate-crisis-deforestation-mining-western-ghats-2595183-2024-09-07",
      "headline": "Why Goa could be the next WayanadGoa's landscape — characterised by plateaus and steep slopes — is particularly vulnerable to erosion and landslides if its natural features are disturbed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-politics-sports-420-06-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-abdullah-afzal-guru-execution-hanging-parliament-attack-jammu-kashmir-elections-2595293-2024-09-06",
      "headline": "Omar Abdullah on Afzal Guru's hanging: No purpose served by executing himOmar Abdullah said that 2001 Parliament attack convict Afzal Guru's hanging \"served no purpose\", adding that he didn't believe in capital punishment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rg-kar-former-principal-sandip-ghosh-ed-raids-property-luxurious-bungalow-land-south-24-parganas-2595429-2024-09-07",
      "headline": "Raids lead Enforcement Directorate to RG Kar ex-principal's luxurious bungalowED officials discovered a luxurious bungalow in Bengal's South 24 Parganas linked to former RG Kar Medical College and Hospital principal Dr Sandip Ghosh, as part of an ongoing probe into alleged financial irregularities at the institution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-man-indy-nelson-detained-as-a-spy-four-times-still-breaks-guinness-world-record-2595466-2024-09-07",
      "headline": "US man who visited every country had to prove he was not a spy 4 times. Full StoryIndy Nelson, a US traveller, had to prove he wasn't a spy on four separate occasions as he visited every country of the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pakistani-man-arrested-for-plotting-attack-in-us-on-anniversary-of-hamas-attack-2595434-2024-09-07",
      "headline": "Pak man arrested for plotting attack in US on anniversary of Hamas attackAccording to the prosecution authorities in the US, the Pakistani man was arrested in Canada for allegedly plotting a mass shooting at a Jewish centre in Brooklyn on the first anniversary of the October 7 attack by Hamas that sparked the latest conflict in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-wife-didnt-recognise-him-in-sector-36-poster-2595473-2024-09-07",
      "headline": "Vikrant Massey's wife didn't recognise him in Sector 36 poster: 'Kaun Hai?'Vikrant Massey and Deepak Dobriyal star in the upcoming Netflix film Sector 36, which is presumably inspired by the 2006 Nithari killings. Vikrant's transformation for the film left his wife surprised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/fritz-and-pegula-first-time-an-american-man-and-woman-in-us-open-final-since-2002-2595477-2024-09-07",
      "headline": "Fritz and Pegula: First time an American man and woman in US Open final since 2002Two Americans, Jessica Pegula and Taylor Fritz, reached the final of the US Open 2024. It was the first time since 2002 that an American man and woman reached the US Open final together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-akshay-kumar-gets-uncomfortable-as-female-fan-touches-him-for-photo-in-viral-video-2595506-2024-09-07",
      "headline": "Watch: Akshay Kumar gets uncomfortable as female fan touches him for photoAkshay Kumar was posing with a woman for a quick photo when she put a hand on his chest. The actor looked uncomfortable, but he posed anyway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-actor-nithiin-wife-shalini-announce-birth-of-baby-boy-2595502-2024-09-07",
      "headline": "Pic: Telugu actor Nithiin, wife Shalini announce birth of baby boyTelugu actor Nithiin and wife Shalini welcomed their first child, a baby boy. Nithiin shared the news with a photo on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mehbooba-mehbooba-to-tauba-tauba-makers-on-evolution-of-item-songs-2594277-2024-09-07",
      "headline": "Mehbooba Mehbooba to Tauba Tauba: Makers on evolution of item songs'Item songs' or 'item numbers' have been a part of Hindi cinema for ages, and have featured multiple times every decade since the 1950s. In today's edition of Cinematic Saturday, we speak to producers and music artistes to decode their evolution and impact on Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/remo-dsouza-recalls-100-per-cent-blockage-in-heart-and-how-salman-khan-helped-in-2020-2595485-2024-09-07",
      "headline": "Remo D'Souza recalls '100 per cent blockage' in heart and how Salman Khan helpedChoreographer-director Remo D'Souza suffered a massive heart attack in 2020 when he was working out at a gym. He revisited the incident in an interview now, and mentioned how Salman Khan was the \"main person\" constantly checking on him. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paulo-dybala-lionel-messi-number-ten-argentina-vs-chile-honour-reaction-2595504-2024-09-07",
      "headline": "Dybala on donning Messi's Argentina number 10 kit: I know it's not minePaulo Dybala embraced the honor of wearing Lionel Messi's iconic number 10 jersey during Argentina's World Cup Qualifier against Chile. Despite Messi's absence, Dybala expressed his determination to live up to the legendary number's values, contributing to Argentina's 2-0 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manav-suthar-auditions-for-spinners-role-with-a-7-wicket-haul-in-duleep-trophy-2595503-2024-09-07",
      "headline": "Manav Suthar auditions for spinner's role with a 7-wicket haul in Duleep TrophyDuleep Trophy 2024: Manav Suthar auditioned for India's upcoming spinner in the longest format of the game. He impressed with a seven-wicket haul for India C in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jurgen-klopp-borussia-dortmund-return-watch-testimonial-lukasz-piszczek-jakub-blaszczykowski-2595492-2024-09-07",
      "headline": "Jurgen Klopp returns to Borussia Dortmund for special testimonial matchJürgen Klopp's return to Borussia Dortmund, seen in the club's official training kit, has fans buzzing with nostalgia. Back for a special testimonial match, his presence fuels speculation about his next managerial chapter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-ollie-pope-england-vs-sri-lanka-oval-2595483-2024-09-07",
      "headline": "ENG vs SL: England's Ollie Pope scripts Test cricket history with unique featEngland vice-captain Ollie Pope registered a unique feat as he scored his seventh Test century on Day 1 of the third Test against Sri Lanka. Pope scored an unbeaten 103 (103) on Day 1 at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-taylor-fritz-celebration-final-first-american-watch-jannik-sinner-2595481-2024-09-07",
      "headline": "Watch: Fritz's thunderous celebration on reaching historic US Open FinalTaylor Fritz erupted in a passionate celebration after becoming the first American to reach the US Open Men's Singles Final since 2003, defeating Frances Tiafoe in a thrilling five-set semi-final. Now, he faces World No. 1 Jannik Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/fritz-and-pegula-first-time-an-american-man-and-woman-in-us-open-final-since-2002-2595477-2024-09-07",
      "headline": "Fritz and Pegula: First time an American man and woman in US Open final since 2002Two Americans, Jessica Pegula and Taylor Fritz, reached the final of the US Open 2024. It was the first time since 2002 that an American man and woman reached the US Open final together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-taylor-fritz-frances-tiafoe-jannik-sinner-2595468-2024-09-07",
      "headline": "Watch: Taylor Fritz breaks down after reaching maiden US Open final beating TiafoeTaylor Fritz was seen breaking down after advancing to his maiden Grand Slam final after beating his compatriot Frances Tiafoe in the second semi-final of US Open 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-new-era-changing-of-guard-jannik-sinner-taylor-fritz-alcaraz-novak-djokovic-2595454-2024-09-07",
      "headline": "A new era dawns: 2024 signals changing of the guard in men's singles tennis The US Open final on Sunday, September 8, will feature Jannik Sinner, the first Italian man to reach this stage, and Taylor Fritz, the first American man in 18 years to compete in the title match in New York. Remarkably, for the first time since 2002, none of the Big Three -- Novak Djokovic, Roger Federer, or Rafael Nadal has won a Grand Slam title in a calendar year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-2024-day-10-schedule-prachi-yadav-simran-arshad-in-focus-2595455-2024-09-07",
      "headline": "India at Paralympics 2024, Day 10 schedule: Prachi Yadav, Simran, Arshad in focusIndian para-athletes will continue their country's medal rush at the Paralympics 2024. Day 10 promises to be action-packed with many medal matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-frances-tiafoe-taylor-fritz-us-open-2024-2595442-2024-09-07",
      "headline": "US Open: Taylor Fritz edges past Frances Tiafoe in epic five-set semi-finalTaylor Fritz advanced to his maiden Grand Slam final, beating Frances Tiafoe in an epic five-set second semi-final of the US Open 2024. He will next face world number 1 Jannik Sinner in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-reveals-his-weaknesses-after-drapers-too-nice-remarks-at-us-open-2595435-2024-09-07",
      "headline": "Jannik Sinner reveals his weaknesses after Draper's 'too nice' remarks at US OpenJannik Sinner opened up about his weaknesses after Jack Draper said that the Italian is 'too nice'. Sinner beat Draper in the semi-final to become the first Italian to reach the US Open final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-taylor-fritz-frances-tiafoe-jannik-sinner-2595468-2024-09-07",
      "headline": "Watch: Taylor Fritz breaks down after reaching maiden US Open final beating TiafoeTaylor Fritz was seen breaking down after advancing to his maiden Grand Slam final after beating his compatriot Frances Tiafoe in the second semi-final of US Open 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-new-era-changing-of-guard-jannik-sinner-taylor-fritz-alcaraz-novak-djokovic-2595454-2024-09-07",
      "headline": "A new era dawns: 2024 signals changing of the guard in men's singles tennis The US Open final on Sunday, September 8, will feature Jannik Sinner, the first Italian man to reach this stage, and Taylor Fritz, the first American man in 18 years to compete in the title match in New York. Remarkably, for the first time since 2002, none of the Big Three -- Novak Djokovic, Roger Federer, or Rafael Nadal has won a Grand Slam title in a calendar year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-2024-day-10-schedule-prachi-yadav-simran-arshad-in-focus-2595455-2024-09-07",
      "headline": "India at Paralympics 2024, Day 10 schedule: Prachi Yadav, Simran, Arshad in focusIndian para-athletes will continue their country's medal rush at the Paralympics 2024. Day 10 promises to be action-packed with many medal matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-frances-tiafoe-taylor-fritz-us-open-2024-2595442-2024-09-07",
      "headline": "US Open: Taylor Fritz edges past Frances Tiafoe in epic five-set semi-finalTaylor Fritz advanced to his maiden Grand Slam final, beating Frances Tiafoe in an epic five-set second semi-final of the US Open 2024. He will next face world number 1 Jannik Sinner in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-reveals-his-weaknesses-after-drapers-too-nice-remarks-at-us-open-2595435-2024-09-07",
      "headline": "Jannik Sinner reveals his weaknesses after Draper's 'too nice' remarks at US OpenJannik Sinner opened up about his weaknesses after Jack Draper said that the Italian is 'too nice'. Sinner beat Draper in the semi-final to become the first Italian to reach the US Open final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-hokato-sema-indias-bronze-medallist-from-nagaland-shines-in-paralympics-2595424-2024-09-07",
      "headline": "Who is Hokato Sema? India's bronze-medallist from Nagaland shines in ParalympicsHokato Hotozhe Sema's bronze at the Paralympics 2024 marks a historic moment for Nagaland and India. Overcoming personal tragedy, he shattered the Paralympic record and brought glory to country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-vomiting-jannik-sinner-us-open-2024-2595421-2024-09-07",
      "headline": "Jack Draper points out 'anxiety and humidity' for vomiting incident in semi finalJack Draper blamed humidity and his anxiety after a vomiting incident in the first semi-final of the US Open 2024 against Jannik Sinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-mark-wood-ruled-out-remainder-2024-right-elbow-injury-2595418-2024-09-07",
      "headline": "Mark Wood ruled out for remainder of 2024 after right elbow injuryMark Wood has been ruled out of the remainder of 2024 due to an elbow injury. Wood would be looking to get fit before the tour of India and Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jack-draper-vomits-court-jannik-sinner-semi-final-2595414-2024-09-07",
      "headline": "Ailing Jack Draper vomits on court, goes down fighting in semi-finalUS Open: UK's Jack Draper vomited on the court and looked in some discomfort during his semi-final against World No.1 Jannik Sinner on Friday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-tough-challenge-final-jack-draper-2595411-2024-09-07",
      "headline": "Jannik Sinner ready to embrace 'tough challenge' in first finalUS Open 2024: Jannik Sinner was happy to be playing in the final at Flushing, but also acknowledged the challenges that come with playing in the summit clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-semi-final-jack-draper-dream-run-2595388-2024-09-07",
      "headline": "Jannik Sinner first Italian man to qualify for US Open singles finalUS Open 2024: Jannik Sinner put his best foot forward and beat Jack Draper 7-5, 7-6 (7-3), 6-2 in the semi-final of the men's singles on Friday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-praveen-kumar-gold-hokato-sema-bronze-india-medals-wrap-2595383-2024-09-07",
      "headline": "Praveen Kumar, Hokato Sema extend India's medal tally to 27 Paralympics 2024: Praveen Kumar won gold in men's high jump while Hokato Sema clinched bronze in men's shot put. India extended their medals' tally to 27 in the quadrennial event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-hokato-sema-bronze-medal-shot-put-athletics-2595380-2024-09-07",
      "headline": "Hokato Sema wins shot put bronze as India seals 15th athletics medal Paris Paralympics: India's Hokato Hotozhe Sema clinched bronze in the men's shot put F57 event with the best attempt of 14.65 metres at Stade de France. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-tough-challenge-final-jack-draper-2595411-2024-09-07",
      "headline": "Jannik Sinner ready to embrace 'tough challenge' in first finalUS Open 2024: Jannik Sinner was happy to be playing in the final at Flushing, but also acknowledged the challenges that come with playing in the summit clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-semi-final-jack-draper-dream-run-2595388-2024-09-07",
      "headline": "Jannik Sinner first Italian man to qualify for US Open singles finalUS Open 2024: Jannik Sinner put his best foot forward and beat Jack Draper 7-5, 7-6 (7-3), 6-2 in the semi-final of the men's singles on Friday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-praveen-kumar-gold-hokato-sema-bronze-india-medals-wrap-2595383-2024-09-07",
      "headline": "Praveen Kumar, Hokato Sema extend India's medal tally to 27 Paralympics 2024: Praveen Kumar won gold in men's high jump while Hokato Sema clinched bronze in men's shot put. India extended their medals' tally to 27 in the quadrennial event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-hokato-sema-bronze-medal-shot-put-athletics-2595380-2024-09-07",
      "headline": "Hokato Sema wins shot put bronze as India seals 15th athletics medal Paris Paralympics: India's Hokato Hotozhe Sema clinched bronze in the men's shot put F57 event with the best attempt of 14.65 metres at Stade de France. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-james-anderson-pakistan-bowling-consultant-new-zealand-tours-2595378-2024-09-07",
      "headline": "James Anderson extends consultant role until Pakistan, New Zealand toursENG vs SL: James Anderson said that he will stay as the England bowling consultant until the tour of New Zealand and Pakistan later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-womens-doubles-jelena-ostapenko-lyudmyla-kichenok-2595373-2024-09-07",
      "headline": "Jelena Ostapenko, Lyudmyla Kichenok clinch women's doubles title US Open 2024: Jelena Ostapenko and Lyudmyla Kichenok won the women's doubles title after beating Zhang Shaui and Kristina Mladenovic 6-4, 6-3 in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-men-semi-finals-jack-draper-jannik-sinner-frances-tiafoe-taylor-fritz-2595357-2024-09-06",
      "headline": "US Open semi-finals Highlights: Taylor Fritz beats Frances Tiafoe to set up final clash with SinnerUS Open 2024 Highlights: World No.1 Jannik Sinner made his way through to the final after beating USA's Jack Draper in straight sets. Taylor Fritz beat Frances Tiafoe 4-6, 7-5, 4-6, 6-4, 6-1 to enter his maiden Grand Slam final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paralympics-praveen-kumar-gold-in-men-high-jump-india-26th-medal-2595354-2024-09-06",
      "headline": "Praveen Kumar wins gold in men's high jump as India clinch 26th medalIndia's Praveen Kumar won the gold medal at the men's high jump T64 final during the 2024 Paris Paralympics on Friday. Praveen secured gold this time with a jump of 2.08 metres. This is India's sixth gold and 26th medal at the Paris Paralympics. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}