{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-wins-business-todays-business-icon-of-the-year-award-2697664-2025-03-23",
      "headline": "Kumar Mangalam Birla wins Business Today's Business Icon of the Year awardThe award recognises not only Kumar Mangalam Birla's achievements over the past three decades since he took over the reins of his family business at the tender age of 28, but also showcases his visionary approach in changing times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/kumar-mangalam-birla-honoured-business-icon-of-the-year-bt-mindrush-2697665-2025-03-23",
      "headline": "Kumar Mangalam Birla honoured with Business Icon of the Year at BT MindRushAt Business Today MindRush 2025, Aditya Birla Group Chairman Kumar Mangalam Birla was honoured with the 'Business Icon of the Year' award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-mindrush-2025-nitin-gadkari-tesla-entry-automotive-industry-india-growth-2697517-2025-03-22",
      "headline": "What does Tesla entry mean for India's automotive industry? Nitin Gadkari answersAt the Business Today Mindrush 2025 forum, Nitin Gadkari expressed confidence that India's automotive industry would become the second largest in the world in the next few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-viksit-bharat-vision-2047-on-track-aditya-birla-group-kumar-mangalam-birla-2697500-2025-03-22",
      "headline": "India on track to become 'Viksit Bharat' by 2047, says Kumar Mangalam BirlaAditya Birla Group Chairman Kumar Mangalam Birla said India is on track for Viksit Bharat 2047, crediting policy stability, infrastructure growth, and economic momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-withdraws-20-duty-on-onion-export-to-be-effective-from-april-1-2697490-2025-03-22",
      "headline": "Government withdraws 20% duty on Onion export, to be effective from April 1The Centre has removed the 20 per cent export duty on onions, effective April 1. The duty, imposed to ensure domestic availability, had been in place since September 2024. Despite restrictions, onion exports saw significant growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-retail-investors-lose-money-in-fo-trading-stock-market-think-they-are-smart-sebi-chief-money-loss-2697477-2025-03-22",
      "headline": "Overconfidence leading to F&O losses for retail investors, says Sebi chiefTuhin Kanta Pandey said that studies conducted by the market regulator, Sebi, show that 90% of retail investors lose money in the futures and options (F&O) segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-should-stock-market-traders-be-worried-about-today-sebi-chief-tuhin-kanta-pandey-answers-2697461-2025-03-22",
      "headline": "What should market traders be worried about today? Sebi chief answersSebi chief Tuhin Kanta Pandey pointed to India's efforts to negotiate bilateral trade agreements with the United States and pursue free trade agreements with various other nations as examples of strategic responses to global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/marico-chairman-harsh-mariwala-hiring-good-talent-market-share-company-growth-bt-mindrush-2025-2697459-2025-03-22",
      "headline": "Marico Chairman Harsh Mariwala says war for talent as crucial as market shareMarico Chairman Harsh Mariwala urged entrepreneurs to focus on building strong teams, saying the competition for skilled professionals is intense.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/motilal-oswal-explains-why-retail-investors-fail-to-make-money-from-stock-market-2697433-2025-03-22",
      "headline": "Motilal Oswal explains why retail investors fail to make money from stock marketMotilal Oswal cautioned that most retail investors are engaging in speculative short-term trading or investing in unknown companies, which often leads to losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nse-ceo-ashish-chauhan-retail-investors-derivatives-trade-warning-bt-mindrush-2025-2697396-2025-03-22",
      "headline": "NSE CEO Ashish Chauhan warns retail investors against derivatives tradingNSE chief Ashish Chauhan also advised investors not to believe market tips and discussions on social media platforms.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-you-should-opt-in-2025-26-income-tax-filing-2697107-2025-03-22",
      "headline": "Old vs new tax regime: Which one should you opt for in 2025-26?While the old tax regime promotes savings through tax benefits, the new one is simpler, involves less paperwork and reduces the chances of tax fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-income-tax-regime-what-to-choose-if-you-earn-rs-50-lakh-per-year-2696980-2025-03-21",
      "headline": "Old vs new income tax regime: What to choose if you earn Rs 50 lakh per yearTaxpayers should consider a few key factors before making a choice. The old regime allows deductions, whereas the new regime offers lower tax rates but no major deductions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-trailer-launch-makers-unveil-new-poster-2697701-2025-03-23",
      "headline": "Sikandar trailer launch: Makers unveil new poster featuring Salman Khan, full castJust hours before the release of Salman Khan's Sikandar trailer, the makers unveiled a brand-new poster. The poster showcases the film's stellar ensemble cast, with the movie set to release on Eid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amaal-mallik-father-daboo-mallik-reacts-after-singer-cut-ties-with-family-2697688-2025-03-23",
      "headline": "I love you: Singer Amaal Mallik's father reacts after he cut ties with familyAmaal Mallik recently shared his struggles with depression and a strained relationship with his parents, Daboo and Jyoti Mallik. In response, Daboo Malik posted a heartfelt message on Instagram, marking his first public statement on the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-became-devdas-after-split-from-first-wife-reena-dutta-2697682-2025-03-23",
      "headline": "Aamir Khan became 'Devdas' after split from first wife: I drank entire bottle a dayAamir Khan revealed he turned to alcohol and fell into deep depression after his divorce from Reena Dutta. Calling himself a 'Devdas', he shared how he struggled for years before moving on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-becomes-a-hit-in-india-stephen-graham-cant-believe-it-2697672-2025-03-23",
      "headline": "Adolescence becomes a hit in India, Stephen Graham can't believe itActor and producer Stephen Graham expressed surprise over the growing popularity of his web series Adolescence in India. The series has captured the attention of Indian audiences, leading to a significant increase in viewership, within a week of its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neetu-kapoor-throwback-of-cuteness-granddaughter-samara-balam-pichkari-watch-2697671-2025-03-23",
      "headline": "Neetu Kapoor shares 'throwback of cuteness' featuring granddaughter SamaraNeetu Kapoor shared a throwback video of granddaughter Samara Sahni singing Balam Pichkari when she was 2-years-old. Riddhima Kapoor Sahni also wished her daughter with a montage of their pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-on-last-of-stars-tag-for-him-shah-rukh-khan-and-salman-khan-2697655-2025-03-23",
      "headline": "Aamir Khan on 'last of stars' tag for him, SRK and Salman: We won't even be countedAamir Khan reflected on the evolution of Bollywood stardom, suggesting that the era of the Khans is not the end of iconic stars. He also claimed that \"people would forget\" him, Shah Rukh Khan and Salman Khan in the future. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-on-historic-ipl-2025-performance-disha-patani-shah-rukh-khan-2697650-2025-03-23",
      "headline": "Let the world watch what we are: Shreya Ghoshal on her 'historic' IPL performanceShreya Ghoshal wowed fans at Eden Gardens during the IPL 2025 opening ceremony with a grand musical performance. Shah Rukh Khan, Disha Patani, and Karan Aujla also lit up the stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/david-warner-arrives-in-hyderabad-to-launch-trailer-of-debut-telugu-film-robinhood-2697639-2025-03-23",
      "headline": "David Warner arrives in Hyderabad to launch trailer of debut Telugu film RobinhoodDavid Warner is all set to make his debut in Telugu cinema with a cameo in Robinhood. He arrived in Hyderabad to launch the trailer. A fan-favourite in Telugu states, Warner shot his scenes in Australia in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-attends-cricket-event-with-eknath-shinde-to-support-tb-awareness-campaigm-2697634-2025-03-23",
      "headline": "Watch: Salman Khan attends cricket event to support TB awareness campaignSalman Khan attended a cricket match in Mumbai for TB awareness. He posed with Eknath Shinde, interacted with players, and impressed fans with his look. He will launch Sikander's trailer today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-exposes-dark-side-of-social-media-for-young-minds-2697420-2025-03-23",
      "headline": "How Adolescence exposes dark side of social media for young mindsNetflix's Adolescence explores social media's impact on teenagers. Experts warn about its effects on self-worth, identity, and mental health, urging healthier digital habits and open conversations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-tests-her-french-skills-rides-scooty-in-bts-video-from-paris-2697623-2025-03-23",
      "headline": "Deepika Padukone tests her French skills, rides scooty in BTS video from ParisDeepika Padukone shared a fun BTS video from Paris Fashion Week, testing her French skills, riding a scooty, and prepping for the Louis Vuitton show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/karan-aujla-tauba-tauba-ipl-2025-opening-ceremony-disha-patani-2697506-2025-03-22",
      "headline": "Karan Aujla goes Tauba Tauba, Disha Patani dazzles at IPL 2025 openingKaran Aujla and Disha Patani delivered electrifying performances at the IPL 2025 opening ceremony on Saturday. Hosted by Shah Rukh Khan, the event also featured a mesmerising act by Shreya Ghoshal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-virat-kohli-recreate-jhoome-jo-pathaan-rinku-singh-ipl-opening-ceremony-2697449-2025-03-22",
      "headline": "SRK, Virat Kohli steal the show with Pathaan steps at IPL 2025 openingShah Rukh Khan hosted the star-studded opening ceremony of IPL 2025 on March 22. The King of Bollywood set the stage on fire, dancing to Lutt Putt Gaya with Rinku Singh and Jhoome Jo Pathaan with Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreya-ghoshal-maa-tujhhe-salaam-ipl-opening-ceremony-2697458-2025-03-22",
      "headline": "Watch: Shreya Ghoshal and crowd go Maa Tujhhe Salaam at IPL opening ceremonyShreya Ghoshal delighted the audience at Kolkata's Eden Gardens at the IPL opening ceremony in 2025. She performed 'Maa Tujhhe Salaam' and several of her hits ahead of the KKR vs RCB ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-confirmed-for-march-2026-release-2697438-2025-03-22",
      "headline": "Yash's Toxic confirmed for March 2026 releaseKannada superstar Yash's highly anticipated film Toxic has officially set its release date. The film is scheduled to hit the silver screen in March 2026.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-ss-rajamouli-join-tree-plantation-drive-in-odisha-2697405-2025-03-22",
      "headline": "Mahesh Babu and Rajamouli join tree plantation drive in Odisha. PicsIn a bid to promote environmental awareness, actor Mahesh Babu and film-maker SS Rajamouli joined hands for a tree-planting initiative in Odisha. Unseen photos of the event have now taken the internet by storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-empuraan-not-rs-100-crore-film-where-rs-80-crore-goes-to-salaries-2697408-2025-03-22",
      "headline": "Prithviraj says Empuraan 'not Rs 100 crore film where Rs 80 crore goes to salaries'Prithviraj Sukumaran ensured L2: Empuraan's budget was spent on filmmaking, not salaries. Neither he nor Mohanlal charged a fee. He also revealed Akshay Kumar worked for free on Selfiee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jugal-hansraj-on-career-setbacks-typecasting-and-new-beginnings-2697386-2025-03-22",
      "headline": "No regrets: Jugal Hansraj on career setbacks, typecasting and new beginningsJugal Hansraj was praised for his performance in Nadaaniyan. In an exclusive interview with us, he shared insights on Bollywood's evolution, his career struggles, and overcoming typecasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-confirms-performing-at-csk-vs-mi-match-with-fun-cryptic-post-2697382-2025-03-22",
      "headline": "Anirudh Ravichander rehearses Leo's Badass ahead of CSK vs MI matchAnirudh Ravichander confirmed performing at the CSK vs MI match on Sunday in Chennai's Chepauk stadium. The music composer and singer was seen rehearsing Leo's Badass on Saturday. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/gujarat-father-daughter-shot-at-us-store-virginia-after-man-waits-all-night-for-alcohol-2697686-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gujarat father-daughter shot dead at US store by man waiting for alcoholDescribing the moments leading up to their deaths, Pradeep's family said that the accused had been lurking around their department store all night. When Pradeep and Urmi arrived, he confronted them, questioning why the store had been closed, saying he had waited all night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-on-trade-deals-in-volatile-world-there-could-be-collateral-benefits-2697633-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trade deals a reality, but India First always: S Jaishankar ahead of pact with USUnion Minister S Jaishankar spoke about trade deals and negotiations and emphasised the need to assess their costs and benefits, especially in the current \"uncertain and volatile world.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/murdered-meerut-man-saurabh-rajput-wife-muskan-lover-sahil-addicts-ask-for-drugs-jail-2697663-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Murdered Meerut man's wife, her lover refuse food, demand drugs in jail: SourcesSaurabh Rajput was allegedly drugged and then stabbed to death on March 4 before his body was dismembered and sealed in a drum with cement. Muskan and Sahil were arrested on March 18 when Rajput's family reported him missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-gdb-survey-shows-61-oppose-interfaith-marriages-inter-caste-marriage-troll-2697704-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "61% oppose interfaith marriages; Chandigarh shocks, Kerala soothesSixty-one percent of respondents in India Today's inaugural Gross Domestic Behaviour survey opposed interfaith marriages, while 56% were against inter-caste unions. However, 90% of respondents in Chandigarh opposing interreligious marriages shows that the issue is beyond literacy and urbanity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/which-milk-best-for-you-cow-buffalo-dairy-alternative-soya-almond-oat-children-toddler-breastfeeding-experts-say-this-2697470-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Which milk is best for you? Cow or buffalo milk, or a dairy alternativeFrom cow milk and buffalo milk to goat and camel milk, the dairy choices are plenty across India now. Dairy alternatives like oat milk, almond milk and soya milk have also flooded the market. There is confusion as to which is the best milk option. India Today Digital decodes that for you after speaking to experts and going through research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/totally-preposterous-incredible-delhi-judge-denies-cash-stash-seen-in-video-2697618-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Totally preposterous, incredible: Delhi judge denies cash stash seen in videoJustice Varma, who was not present at his residence on the night of the incident on March 14, further stated that his daughter and staff had informed him that the authorities did not show any sacks of charred notes or currency being taken away after the blaze was doused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-air-india-slams-plane-pilot-2697638-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "David Warner slams Air India: Why board passengers on a plane with no pilots?Former Australian batter David Warner slammed Air India after he boarded a flight with no pilot and had to wait for several hours. Air India also issued a statement, replying to Warner's query. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-woman-slits-sons-throat-after-disneyland-trip-amid-custody-battle-2697624-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-origin woman takes son to Disneyland, slits his throat amid custody battleSaritha Ramaraju, 48, has been charged with one felony count of murder for slitting her son's throat, killing the boy after they went on a vacation to Disneyland during a custody visit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/are-women-free-to-spend-the-money-they-earn-what-gdb-survey-reveals-2697531-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Are women free to spend the money they earn? What GDB survey revealsThe inaugural India Today Gross Domestic Behaviour (GDB) survey reveals that a woman's right to manage her earnings remains a divisive issue in India, with attitudes differing by region. Surveying over 9,000 respondents on 'Gender Attitudes,' it highlights deep gender disparities in household decision-making and personal freedom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-wins-business-todays-business-icon-of-the-year-award-2697664-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumar Mangalam Birla wins Business Today's Business Icon of the Year awardThe award recognises not only Kumar Mangalam Birla's achievements over the past three decades since he took over the reins of his family business at the tender age of 28, but also showcases his visionary approach in changing times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-girl-died-tree-fell-heavy-rainfall-flights-diverted-roads-waterlogged-2697666-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru rains: Tree collapse kills toddler, roads waterlogged, flights divertedTraffic snarled on waterlogged roads as heavy rains lashed Bengaluru on Saturday. A three-year-old girl was killed after a tree collapsed on her amid downpour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amaal-mallik-father-daboo-mallik-reacts-after-singer-cut-ties-with-family-2697688-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I love you: Singer Amaal Mallik's father reacts after he cut ties with familyAmaal Mallik recently shared his struggles with depression and a strained relationship with his parents, Daboo and Jyoti Mallik. In response, Daboo Malik posted a heartfelt message on Instagram, marking his first public statement on the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/fire-erupts-walt-disney-world-epcot-theme-park-florida-2697678-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Smoke and screams as fire breaks out at Disney World in FloridaA fire broke out at Walt Disney World's Epcot theme park in Florida, leading to evacuations. The blaze was contained with no injuries reported.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-future-csk-vs-mi-sunil-gavaskar-2697683-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MS Dhoni future speculation irks Sunil Gavaskar: Why put pressure on him?Sunil Gavaskar is unhappy with the constant chatter around MS Dhoni's future in the IPL as he asked why people are looking to put extra pressure on the CSK legend. Dhoni is all set to play his 18th season of the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-match-preview-ipl-2025-sunrisers-hyderabad-vs-rajasthan-royals-indian-premier-league-pat-cummins-riyan-parag-2697422-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRH vs RR Match Preview, IPL 2025: Riyan faces fiery Hyderabad in captaincy debutIPL 2025, Sunrisers Hyderabad vs Rajasthan Royals Match Preview: Sunrisers Hyderabad and Rajasthan Royals will square off in the second match of the IPL 2025 season with Riyan Parag set to make his captaincy debut. Will Hyderabad's fiery batting serve up another show at the Uppal or will the Royals silence the home crowd? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rhea-chakraborty-lawyer-welcomes-cbi-closure-report-says-she-endured-untold-misery-2697635-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rhea Chakraborty endured untold misery: Lawyer welcomes CBI closure reportThe CBI filed closure reports in two cases related to the death of Sushant Singh Rajput. The reports were submitted to a Mumbai court, concluding that no evidence was found to establish any foul play behind his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-became-devdas-after-split-from-first-wife-reena-dutta-2697682-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aamir Khan became 'Devdas' after split from first wife: I drank entire bottle a dayAamir Khan revealed he turned to alcohol and fell into deep depression after his divorce from Reena Dutta. Calling himself a 'Devdas', he shared how he struggled for years before moving on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-461-21-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: India Today News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-rains-man-harvests-25000-litres-rainwater-video-viral-2697653-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru man harvests 25,000 litres of rainwater in 30 minutes, shares videoA Bengaluru man shared a video of his rainwater collection system, impressing social media users with his sustainable approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-world-order-western-myth-geopolitical-shift-2697510-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaishankar calls world order a western myth: Won't go around singing paeansS Jaishankar said even though the world order was on the threshold of change, India won't go around 'singing paeans' to the world if challenges arise.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-exposes-dark-side-of-social-media-for-young-minds-2697420-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Adolescence exposes dark side of social media for young mindsNetflix's Adolescence explores social media's impact on teenagers. Experts warn about its effects on self-worth, identity, and mental health, urging healthier digital habits and open conversations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mehul-choksi-in-belgium-india-looks-to-extradite-fugitive-businessman-report-2697575-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mehul Choksi in Belgium, India looks to extradite fugitive businessman: ReportFugitive businessman Mehul Choksi is reportedly living in Antwerp, Belgium, with his wife, Preeti Choksi, after obtaining a residency card, according to a media report. Indian authorities have requested Belgium to begin his extradition, as per the Caribbean-based outlet Associated Times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/german-woman-stuns-uber-cab-driver-by-speaking-fluent-malayalam-in-viral-video-2697641-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "German woman stuns Uber cab driver by speaking fluent Malayalam in viral videoA video of a German woman speaking in fluent Malayalam with an Uber cab driver has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sushant-singh-rajput-death-suicide-cbi-case-rhea-chakraborty-abetment-drug-use-patna-mumbai-2697608-2025-03-23#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sushant Singh Rajput death: Why CBI closed abetment and drug prescription casesThe CBI has ruled out any foul play in the death of Bollywood actor Sushant Singh Rajput, who was found hanging at his Mumbai residence on June 14, 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-trailer-launch-makers-unveil-new-poster-2697701-2025-03-23",
      "headline": "Sikandar trailer launch: Makers unveil new poster featuring Salman Khan, full castJust hours before the release of Salman Khan's Sikandar trailer, the makers unveiled a brand-new poster. The poster showcases the film's stellar ensemble cast, with the movie set to release on Eid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amaal-mallik-father-daboo-mallik-reacts-after-singer-cut-ties-with-family-2697688-2025-03-23",
      "headline": "I love you: Singer Amaal Mallik's father reacts after he cut ties with familyAmaal Mallik recently shared his struggles with depression and a strained relationship with his parents, Daboo and Jyoti Mallik. In response, Daboo Malik posted a heartfelt message on Instagram, marking his first public statement on the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-became-devdas-after-split-from-first-wife-reena-dutta-2697682-2025-03-23",
      "headline": "Aamir Khan became 'Devdas' after split from first wife: I drank entire bottle a dayAamir Khan revealed he turned to alcohol and fell into deep depression after his divorce from Reena Dutta. Calling himself a 'Devdas', he shared how he struggled for years before moving on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-becomes-a-hit-in-india-stephen-graham-cant-believe-it-2697672-2025-03-23",
      "headline": "Adolescence becomes a hit in India, Stephen Graham can't believe itActor and producer Stephen Graham expressed surprise over the growing popularity of his web series Adolescence in India. The series has captured the attention of Indian audiences, leading to a significant increase in viewership, within a week of its release. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-live-score-updates-ipl-2025-sunrisers-hyderabad-vs-rajasthan-royals-pat-cummins-riyan-parg-2697702-2025-03-23",
      "headline": "SRH vs RR Live Score, IPL 2025: Riyan-led Rajasthan ready for high-scoring HyderabadSunrisers Hyderabad (SRH) vs Rajasthan Royals (RR) Live Score, IPL 2025: It's time for the battle between two teams that made it to the playoffs as Sunrisers Hyderabad welcome Rajasthan Royals to the Rajiv Gandhi International stadium. The Royals will have a new captain in the form of Riyan Parag as Sanju Samson continues to recover from a finger injury. SRH, on the other hand, will bank on their big hitters once again this season and will look for a quick start to the new campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-bangladesh-bcb-bowling-communication-2697700-2025-03-23",
      "headline": "Shakib not happy with BCB over communication after bowling suspensionBangladesh all-rounder Shakib Al Hasan said that he wasn't quite happy with how the BCB communicated with him after he was suspended for a suspect bowling action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-future-csk-vs-mi-sunil-gavaskar-2697683-2025-03-23",
      "headline": "MS Dhoni future speculation irks Sunil Gavaskar: Why put pressure on him?Sunil Gavaskar is unhappy with the constant chatter around MS Dhoni's future in the IPL as he asked why people are looking to put extra pressure on the CSK legend. Dhoni is all set to play his 18th season of the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-mi-ipl-2025-match-live-streaming-telecast-when-and-where-to-watch-online-chennai-super-kings-vs-mumbai-indians-2697679-2025-03-23",
      "headline": "CSK vs MI Live Streaming, Telecast, When And Where To WatchIPL 2025, Chennai Super Kings vs Mumbai Indians Live streaming, Telecast: After failing to qualify for the playoffs in the previous season, both teams will be looking to make a winning start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-jasprit-bumrah-absence-chepauk-kedhar-jadhav-chennai-2697675-2025-03-23",
      "headline": "Without Bumrah, it is difficult for MI to break opener jinx vs CSK: Kedhar JadhavFormer India cricketer Kedhar Jadhav feels that it will be tough for the Mumbai Indians to end their opening match jinx against Chennai Super Kings on Sunday, March 23, especially with the absence of Jasprit Bumrah. The star pacer is still recovering from the back injury he suffered in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-mi-playing-11-ipl-2025-team-prediction-suryakumar-yadav-2697656-2025-03-23",
      "headline": "Mumbai Indians set for 'flexibility' in Bumrah, Hardik's absenceCSK vs MI Playing 11, Chennai Super Kings vs Mumbai Indians Prediction: Stand-in captain Suryakumar Yadav had earlier said that MI will be a tad flexible with their batting lineup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-mi-r-ashwin-noor-ahmad-matheesha-pathirana-chepauk-kedhar-jadhav-2697658-2025-03-23",
      "headline": "CSK's X-factors in IPL 2025: Kedhar Jadhav names R Ashwin and 2 young starsIn an exclusive interaction with India Today, former India cricketer Kedhar Jadhav named R Ashwin, along with Noor Ahmad and Matheesha Pathirana, as the X-factors for Chennai Super Kings in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shardul-thakur-lsg-mohsin-khan-2697430-2025-03-23",
      "headline": "Injury-hit LSG rope in Shardul Thakur, replaces Mohsin KhanLucknow Super Giants have roped in Shardul Thakur to replace Mohsin Khan for the Indian Premier League 2025. Shardul joins LSG at his base price - Rs 2 crore.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-match-pitch-report-weather-forecast-ma-chidambaram-stadium-chepauk-chennai-2697654-2025-03-23",
      "headline": "CSK vs MI, pitch, weather report: Delayed start for El Clasico in Chennai?Chennai (CSK) vs Mumbai (MI) Match Pitch Report, Weather forecast: The stage is set for the IPL El Clasico with Chennai Super Kings squaring off against the Mumbai Indians. Will the Chennai pitch continue to be a heaven for spinners and will we see rain play a part in the clash on Sunday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-mi-match-preview-ipl-2025-chennai-super-kings-vs-mumbai-indians-indian-premier-league-suryakumar-yadav-ms-dhoni-2697628-2025-03-23",
      "headline": "CSK vs MI Match Preview: Weakened Mumbai aim to end opener jinx at ChennaiIPL 2025, Chennai Super Kings vs Mumbai Indians Match Preview: It's time for the IPL El Clasico as Chennai Super Kings and Mumbai Indians clash in the first big game of the new season on March 23. With the opener jinx weighing over their shoulders, can a weakened Mumbai side spring a surprise over Chennai at the Chepauk?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-mi-playing-11-ipl-2025-team-prediction-suryakumar-yadav-2697656-2025-03-23",
      "headline": "Mumbai Indians set for 'flexibility' in Bumrah, Hardik's absenceCSK vs MI Playing 11, Chennai Super Kings vs Mumbai Indians Prediction: Stand-in captain Suryakumar Yadav had earlier said that MI will be a tad flexible with their batting lineup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-mi-r-ashwin-noor-ahmad-matheesha-pathirana-chepauk-kedhar-jadhav-2697658-2025-03-23",
      "headline": "CSK's X-factors in IPL 2025: Kedhar Jadhav names R Ashwin and 2 young starsIn an exclusive interaction with India Today, former India cricketer Kedhar Jadhav named R Ashwin, along with Noor Ahmad and Matheesha Pathirana, as the X-factors for Chennai Super Kings in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shardul-thakur-lsg-mohsin-khan-2697430-2025-03-23",
      "headline": "Injury-hit LSG rope in Shardul Thakur, replaces Mohsin KhanLucknow Super Giants have roped in Shardul Thakur to replace Mohsin Khan for the Indian Premier League 2025. Shardul joins LSG at his base price - Rs 2 crore.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-match-pitch-report-weather-forecast-ma-chidambaram-stadium-chepauk-chennai-2697654-2025-03-23",
      "headline": "CSK vs MI, pitch, weather report: Delayed start for El Clasico in Chennai?Chennai (CSK) vs Mumbai (MI) Match Pitch Report, Weather forecast: The stage is set for the IPL El Clasico with Chennai Super Kings squaring off against the Mumbai Indians. Will the Chennai pitch continue to be a heaven for spinners and will we see rain play a part in the clash on Sunday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-mi-match-preview-ipl-2025-chennai-super-kings-vs-mumbai-indians-indian-premier-league-suryakumar-yadav-ms-dhoni-2697628-2025-03-23",
      "headline": "CSK vs MI Match Preview: Weakened Mumbai aim to end opener jinx at ChennaiIPL 2025, Chennai Super Kings vs Mumbai Indians Match Preview: It's time for the IPL El Clasico as Chennai Super Kings and Mumbai Indians clash in the first big game of the new season on March 23. With the opener jinx weighing over their shoulders, can a weakened Mumbai side spring a surprise over Chennai at the Chepauk?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-air-india-slams-plane-pilot-2697638-2025-03-23",
      "headline": "David Warner slams Air India: Why board passengers on a plane with no pilots?Former Australian batter David Warner slammed Air India after he boarded a flight with no pilot and had to wait for several hours. Air India also issued a statement, replying to Warner's query. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-mi-mumbai-indians-opening-match-jinx-hardik-pandya-suryakumar-yadav-2697636-2025-03-23",
      "headline": "IPL 2025: MI cannot keep calm about the menacing opening day jinx any moreSince 2013, Mumbai Indians have endured a rather bizarre streak of not winning their opening match of an IPL season. While success has come in the form of 5 IPL titles during this period, the past few years haven't been great for the franchise, as a loss in Game 1 has set an unwanted tone for the season early on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-rr-match-pitch-report-weather-forecast-rajiv-gandhi-international-stadium-2697632-2025-03-23",
      "headline": "SRH vs RR, Hyderabad pitch, weather report: Will rain play spoilsport?Hyderabad (SRH) vs Rajasthan (RR) Match Pitch Report, Weather forecast: The Sunrisers will look to get off to a winning start at home after finishing as the runners-up last season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-virat-kohli-rajat-patidar-phil-salt-2697631-2025-03-23",
      "headline": "Early impression: Ee Sala Cup Namde? RCB's bold start fuels big dreamsIPL 2025, KKR vs RCB: Yes, it's far too early for sweeping conclusions, but if RCB's opening night at Eden Gardens was any indication, their fans can dare to dream-perhaps even of a long-awaited title run. With a near-perfect performance, RCB made a bold statement: they mean business this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-virat-kohli-phil-salt-partnership-kkr-vs-rcb-josh-hazlewood-2697627-2025-03-23",
      "headline": "Virat Kohli, Phil Salt's partnership set the match for RCB: Josh HazlewoodIPL 2025, KKR vs RCB: Josh Hazlewood, in the post-match press conference, said that Virat Kohli and Phil Salt's massive 95-run stand off 8.3 overs laid the platform for Royal Challengers Bengaluru in their seven-wicket win over Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-ipl-2025-match-live-streaming-telecast-when-and-where-to-watch-online-sunrisers-hyderabad-vs-rajasthan-royals-2697375-2025-03-23",
      "headline": "SRH vs RR Live Streaming, Telecast, When And Where To WatchIPL 2025, Sunrisers Hyderabad vs Rajasthan Royals Live streaming, Telecast: Riyan Parag's RR and Pat Cummins' SRH will look to get off to a winning start when they face each other on March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-playing-11-ipl-2025-team-prediction-ishan-kishan-riyan-parag-2697383-2025-03-23",
      "headline": "SRH vs RR Playing XI: Where does Kishan feature in dynamite Hyderabad lineup?Sunrisers Hyderabad vs Rajasthan Royals Playing 11, SRH vs RR Prediction: The explosive Sunrisers Hyderabad will take on Rajasthan Royals in the second match of the IPL 2025 season in Hyderabad on March 23. All eyes will be on Ishan Kishan and how he will fit into the current lineup at SRH. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-ram-navami-eden-gardens-bcci-2697622-2025-03-23",
      "headline": "BCCI pushing to keep KKR vs LSG Ram Navami clash in Eden GardensThe Indian Cricket Board is trying to not move KKR vs LSG from Kolkata to Guwahati. A top BCCI source has told India Today that negotiations are happening to make sure that the IPL match can be played in Kolkata without any hassle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-virat-kohli-phil-salt-partnership-kkr-vs-rcb-josh-hazlewood-2697627-2025-03-23",
      "headline": "Virat Kohli, Phil Salt's partnership set the match for RCB: Josh HazlewoodIPL 2025, KKR vs RCB: Josh Hazlewood, in the post-match press conference, said that Virat Kohli and Phil Salt's massive 95-run stand off 8.3 overs laid the platform for Royal Challengers Bengaluru in their seven-wicket win over Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-ipl-2025-match-live-streaming-telecast-when-and-where-to-watch-online-sunrisers-hyderabad-vs-rajasthan-royals-2697375-2025-03-23",
      "headline": "SRH vs RR Live Streaming, Telecast, When And Where To WatchIPL 2025, Sunrisers Hyderabad vs Rajasthan Royals Live streaming, Telecast: Riyan Parag's RR and Pat Cummins' SRH will look to get off to a winning start when they face each other on March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-playing-11-ipl-2025-team-prediction-ishan-kishan-riyan-parag-2697383-2025-03-23",
      "headline": "SRH vs RR Playing XI: Where does Kishan feature in dynamite Hyderabad lineup?Sunrisers Hyderabad vs Rajasthan Royals Playing 11, SRH vs RR Prediction: The explosive Sunrisers Hyderabad will take on Rajasthan Royals in the second match of the IPL 2025 season in Hyderabad on March 23. All eyes will be on Ishan Kishan and how he will fit into the current lineup at SRH. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-ram-navami-eden-gardens-bcci-2697622-2025-03-23",
      "headline": "BCCI pushing to keep KKR vs LSG Ram Navami clash in Eden GardensThe Indian Cricket Board is trying to not move KKR vs LSG from Kolkata to Guwahati. A top BCCI source has told India Today that negotiations are happening to make sure that the IPL match can be played in Kolkata without any hassle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ajinkya-rahane-press-conference-after-kkr-vs-rcb-dont-want-to-pinpoint-negative-things-2697621-2025-03-23",
      "headline": "Rahane unruffled after RCB hammering: Don't want to pinpoint negative thingsIPL 2025, KKR vs RCB: Ajinkya Rahane said that he doesn't want to focus too much on negative things after Kolkata Knight Riders suffered a hefty seven-wicket defeat at the hands of Royal Challengers Bengaluru on Saturday at the Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-rr-match-preview-ipl-2025-sunrisers-hyderabad-vs-rajasthan-royals-indian-premier-league-pat-cummins-riyan-parag-2697422-2025-03-23",
      "headline": "SRH vs RR Match Preview, IPL 2025: Riyan faces fiery Hyderabad in captaincy debutIPL 2025, Sunrisers Hyderabad vs Rajasthan Royals Match Preview: Sunrisers Hyderabad and Rajasthan Royals will square off in the second match of the IPL 2025 season with Riyan Parag set to make his captaincy debut. Will Hyderabad's fiery batting serve up another show at the Uppal or will the Royals silence the home crowd? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suyash-sharma-andre-russell-josh-hazlewood-kkr-vs-rcb-press-conference-2697617-2025-03-23",
      "headline": "Suyash showed guts to dismiss Russell: Hazlewood praises courageous RCB bowlerIPL 2025: Josh Hazlewood said that Suyash Sharma's timely wicket of Andre Russell denied KKR from putting up a big target for RCB to chase down in the opening game at Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-phil-salt-ajinkya-rahane-kkr-vs-rcb-advantage-2697613-2025-03-23",
      "headline": "Phil Salt knew the conditions, had an advantage vs KKR: Ajinkya RahaneIPL 2025: Ajinkya Rahane praised Phil Salt, saying that the Royal Challengers Bengaluru (RCB) batter took full advantage of his experience of playing last year for the Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sachin-tendulkar-ms-dhoni-retirement-rumours-ruturaj-gaikwad-2697612-2025-03-23",
      "headline": "Even Sachin is batting well at 50: CSK captain on Dhoni retirement rumoursChennai Super Kings are banking on MS Dhoni's short and impactful knocks in IPL 2025, said captain Ruturaj Gaikwad. The CSK skipper expects Dhoni to play a few more years in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-virat-kohli-new-shot-2697611-2025-03-23",
      "headline": "What is Virat Kohli's new shot that could give oppositions headacheVirat Kohli took down the Kolkata Knight Riders' in the opener of the Indian Premier League. One of Kohli's shots became the talking point after the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-rcb-vs-kkr-match-2697591-2025-03-23",
      "headline": "Virat Kohli steals the show in IPL opener: Dance with SRK, gun with batVirat Kohli scored a power-packed innings of 59* off 36 balls to guide RCB to a victory over KKR. Kohli had a splendid day around as the old generation triumphed over the new on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-virat-kohli-philip-salt-krunal-pandya-ajinkya-rahane-2697587-2025-03-23",
      "headline": "IPL 2025: Patidar opens up on his 'aggressive leadership' after thrashing KKRRoyal Challengers Bengaluru (RCB) finally ended their four-match losing streak against Kolkata Knight Riders (KKR) by beating them by seven wickets in the first game of the Indian Premier League 2025 (IPL 2025). Here's a look at the post match reactions from both captains and Player of the Match Krunal Pandya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-rcb-ajinkya-rahane-virat-kohli-philip-salt-ajinkya-rahane-2697550-2025-03-22",
      "headline": "IPL 2025: Virat Kohli, Phil Salt fire up RCB's title hunt in style, decimate KKRRoyal Challengers Bengaluru (RCB) got their Indian Premier League 2025 (IPL 2025) campaign off to a winning start by defeating Kolkata Knight Riders by 7 wickets in the opening fixture. Philip Salt (56 off 31), Virat Kohli (59* off 36) and Krunal Pandya (3/29) were the top performers for RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-guides-rajat-patidar-kkr-vs-rcb-2697496-2025-03-22",
      "headline": "IPL 2025: Leader Virat Kohli guides Rajat Patidar on captaincy debut vs KKRRoyal Challengers Bengaluru (RCB) batter Virat Kohli was seen guiding Rajat Patidar on his captaincy debut during the opening game of the Indian Premier League 2025 (IPL 2025) against Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ajinkya-rahane-kkr-vs-rcb-flying-start-silence-criticism-2697495-2025-03-22",
      "headline": "IPL 2025: Captain Rahane silences critics with flying start for KKR vs RCBAjinkya Rahane silenced critics in style, leading Kolkata Knight Riders with a blistering 25-ball fifty in their IPL 2025 opener against Royal Challengers Bengaluru. The new KKR captain took charge after an early setback, displaying aggressive strokeplay and proving why he is the right man for the job."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}