{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/earning-rs-30-lakh-a-year-but-little-wealth-why-many-dual-income-no-kids-dink-couples-fall-behind-2874972-2026-02-26",
      "headline": "Earning Rs 30 lakh a year but little wealth? Why many DINK couples fall behindWith two salaries and no childcare costs, DINK couples are often seen as having a clear financial advantage. Yet many high-earning couples find their wealth growing slower than expected. Is lifestyle inflation quietly eroding their investment potential?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-israel-sign-mous-to-link-upi-systems-boost-digital-payment-ties-2874935-2026-02-26",
      "headline": "India, Israel sign MoU to link UPI systems, boost digital payment tiesThe integration is expected to help Indian and Israeli businesses and individuals carry out financial transactions more easily. It could also reduce transaction costs and processing time, making payments faster and more convenient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/borge-brende-steps-down-as-president-and-ceo-of-world-economic-forum-after-epstein-revelations-2874873-2026-02-26",
      "headline": "World Economic Forum chief Borge Brende quits amid probe into Epstein tiesBorge Brende, President and CEO of the World Economic Forum, has stepped down amid scrutiny over his past interactions with Jeffrey Epstein. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-lower-us-iran-conflict-it-stocks-rise-2874819-2026-02-26",
      "headline": "Sensex and Nifty erase early gains to end flat over global uncertaintyThe S&P BSE Sensex lost 27.46 points to close at 82,248.61, while the NSE Nifty50 gained 14.05 points to end at 25,496.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meity-secretary-s-krishnan-social-media-constitutional-limits-dnpa-conclave-2026-2874767-2026-02-26",
      "headline": "MeitY Secretary S Krishnan says social media must work within constitutional limitsS Krishnan defended the government's approach to regulating digital platforms. He said the Ministry's actions are firmly rooted in the Constitution and follow due legal process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-stellar-rally-last-year-will-the-momentum-conitnue-in-2026-2874762-2026-02-26",
      "headline": "Gold jumped 72% and silver soared 122% last year. Can 2026 deliver the same rally?Gold and silver may not climb the way they did in 2025, but the base remains firm. This year calls for clear judgement, realistic expectations and a focus on long-term signals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-mandates-20-ethanol-blended-petrol-with-ron-95-from-april-1-2874756-2026-02-26",
      "headline": "Government mandates 20% ethanol-blended petrol with RON 95 from April 1In a notification issued on February 17, the Ministry of Petroleum and Natural Gas directed oil marketing companies to supply ethanol-blended petrol, also called E20 petrol, across all states and Union Territories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-progresses-salary-hikes-and-retirement-benefits-in-focus-2874725-2026-02-26",
      "headline": "8th Pay Commission progresses: Salary and pension on the rise?Among the main demands are a higher fitment factor, bigger annual increments, improved retirement benefits and changes in pension and promotion policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-dips-silver-slips-should-you-buy-now-2874700-2026-02-26",
      "headline": "Gold dips, silver slips: Should you buy now?After recent gains, gold and silver prices have slipped marginally. While the fall is small, many buyers and investors are now wondering if this correction offers a chance to buy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-financers-1-crore-buy-home-or-invest-in-stocks-property-vs-equity-2874666-2026-02-26",
      "headline": "The Rs 1 crore question: Should you invest in stocks or buy a home?For India's middle class, owning a home is not just a financial goal. It is security. It is respect. It is stability for the family. Many parents believe a rented house means uncertainty, while a home of your own means safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/property-deals-under-rs-20-lakh-pan-may-not-be-needed-from-april-1-2874649-2026-02-26",
      "headline": "Property deals under Rs 20 lakh? PAN may not be needed from April 1At present, PAN must be quoted when buying or selling immovable property, such as a house, flat, or plot, if the transaction value exceeds Rs 10 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepinder-goyal-wins-ey-entrepreneur-of-the-year-2025-uday-kotak-special-jury-award-mumbai-2874625-2026-02-26",
      "headline": "Deepinder Goyal wins EY Entrepreneur Of The Year 2025 awardDeepinder Goyal was recognised for his focus on innovation, strong operations and long-term thinking. The jury also noted that his businesses have created thousands of jobs for youth and gig workers and supported a wider ecosystem of entrepreneurs across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/credit-card-tips-how-to-avoid-debt-trap-smart-spending-2874596-2026-02-26",
      "headline": "Love swiping your credit card? Here's how to use it without falling into a debt trapMore Indians are now swiping their credit cards, though most have not learned the habits needed to stay out of debt. This article shows the mistakes people make and the simple habits that help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-200-points-higher-nifty-above-25500-it-stocks-rise-tech-m-infosys-tcs-2874556-2026-02-26",
      "headline": "Sensex, Nifty open higher buoyed by IT stocksThe S&P BSE Sensex was up 53.27 points to 82,329.34, while the NSE Nifty50 gained 33.90 points to 25,516.40 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-february-26-will-stock-market-rise-or-fall-today-gift-nifty-fii-dii-data-2874552-2026-02-26",
      "headline": "Sensex, Nifty opening: Will stock market rise or fall today?Gift Nifty futures were trading at 25,676 at 8:00 am, suggesting that the Nifty 50 may open above Wednesday's closing level of 25,482.5. The early signal points to a mild positive start for the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-website-whats-inside-and-how-employees-can-share-views-2874333-2026-02-25",
      "headline": "8th Pay Commission website: What's inside and how employees can share viewsWith the launch of the 8th Pay Commission portal, central government employees can now track updates, explore past pay recommendations, and share their suggestions. Have you checked the website yet?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-entrepreneur-sells-startup-exits-sweden-xenophobic-system-2874313-2026-02-25",
      "headline": "Destroyed my life: Indian CEO sells firm, quits Sweden, blames xenophobiaWhat was meant to be a startup success story in Sweden has ended in an anguished exit for Indian entrepreneur Abhijith Nag Balasubramanyam. Ten months after founding a company, he has been forced to sell his business and return to India. What's behind the move? What challenges did he face? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-down-erase-early-gains-ril-sbi-down-2874206-2026-02-25",
      "headline": "Sensex, Nifty erase early gains to end marginally higher; RIL down 2%The S&P BSE Sensex added 50.15 points to close at 82,276.07, while the NSE Nifty50 gained 57.85 points to end at 25,482.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-rs-12-lakh-salary-still-feels-tight-even-with-just-rs-55000-emis-2874098-2026-02-25",
      "headline": "Why your Rs 1.2 lakh salary still feels tight even with just Rs 55,000 EMIsWith a Rs 1.2 lakh monthly income and Rs 55,000 in EMIs, you would expect to have enough left for savings and comfort. But many people still feel financially stretched. Are hidden fixed expenses quietly consuming your income?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ai-impact-on-it-stocks-should-you-buy-it-stocks-or-it-mutual-funds-now-2874124-2026-02-25",
      "headline": "With AI hurting IT sector, what's the smarter bet: Stocks or IT mutual funds?While AI fears have driven the sharp fall in IT stocks, the correction has also reset valuations, prompting some long-term investors to see a potential entry opportunity."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-nayanika-reddy-host-pre-wedding-bash-for-industry-friends-on-march-2-2875117-2026-02-27",
      "headline": "Allu Sirish to host pre-wedding bash for industry friends on March 2. Details Allu Sirish shared a post on X and informed that the family is set to host their pre-wedding bash on March 2. The actor will marry Nayanika Reddy on March 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-says-new-show-is-an-ode-to-the-stranger-read-why-2875093-2026-02-26",
      "headline": "Vir Das says his new show is an 'ode to the stranger.' Read why Comedian Vir Das opens up on his journey as an immigrant in the US, AI, and need for imperfection in art, as he gears up for his Hey Stranger US Tour\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhadak-2-screenings-ivy-league-universities-social-themes-indian-cinema-2875024-2026-02-26",
      "headline": "Dhadak 2 screens at Brown, Yale; Karan Johar shares pride Karan Johar's 2025 production Dhadak 2, starring Siddhant Chaturvedi and Triptii Dimri, has found an academic audience overseas with special screenings at Brown University and Yale University. The producer shared his excitement on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/charak-trailer-sudipto-sens-folklore-thriller-unravels-occult-rituals-2874904-2026-02-26",
      "headline": "Charak trailer: Sudipto Sen film promises a haunting look at superstitious rituals Sudipto Sen-backed folklore thriller Charak: Fair of Faith is about occult rituals. The film aims to explore the repercussions of radical fanaticism."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/piracy-will-be-impossible-to-control-the-kerala-story-2-makers-ask-high-court-to-pause-order-halting-release-2875032-2026-02-26",
      "headline": "Kerala Story 2 makers' fierce fight against halt on release, but no court relief The makers of The Kerala Story 2 challenged the single judge order halting the film's release, contending that India should not be so fragile that a movie can threaten a religion. They also added that films have previously depicted Hindu gods and goddesses in a satirical light without similar restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-man-who-taught-me-true-love-rashmika-mandannas-emotional-note-for-vijay-deverakonda-2874983-2026-02-26",
      "headline": "The man who taught me true love: Rashmika's emotional note for Vijay Rashmika Mandanna dedicated an emotional note to her actor-husband Vijay Deverakonda, sharing first pics from their wedding. She thanked Vijay for teaching her what 'true love' and 'peace' actually mean."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-experts-back-toxic-strong-eid-2026-debut-dhurandhar-the-revenge-2875001-2026-02-26",
      "headline": "Don't underestimate Yash: Experts back Toxic for strong Eid 2026 debut As Yash gears up for his big-screen return with Toxic on Eid 2026, trade experts and exhibitors across India are betting big on the film's box office potential. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wedding-celebration-anand-deverakonda-welcomes-rashmika-mandanna-as-vadina-2875000-2026-02-26",
      "headline": "Anand Deverakonda finally has an answer for fans who asked about his sister-in-law Anand Deverakonda shared an emotional message for his brother Vijay Deverakonda and sister-in-law Rashmika Mandanna. The two married in Udaipur, with close friends and family in attendance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-wants-to-work-with-mrunal-thakur-fans-cant-keep-calm-2874948-2026-02-26",
      "headline": "Allu Arjun wants to work with Mrunal Thakur, fans can't keep calm After winning Best Actor at the 70th Filmfare Awards South for Pushpa 2: The Rule, Allu Arjun received a heartfelt message and bouquet from Mrunal Thakur. The Telugu actor expressed gratitude and shared his wish to work with her in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-announces-wedding-shares-love-story-with-rashmika-mandanna-i-made-my-best-friend-my-wife-2874980-2026-02-26",
      "headline": "So, I made my best friend...my wife: Vijay shares his love story with Rashmika Actor Vijay Deverakonda confirmed his wedding to Rashmika Mandanna, sharing an emotionally charged post and photos that highlighted the couple's connection during their ceremony. He called her his best friend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-share-first-pics-from-wedding-look-regal-2874651-2026-02-26",
      "headline": "Mrs and Mr Deverakonda: Rashmika-Vijay post first pics as couple Rashmika Mandanna and Vijay Deverakonda got married in Udaipur on Thursday in two wedding ceremonies. The two opted for traditional ensembles for the big day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/narendra-modi-meets-fauda-cast-israel-selfie-february-2026-visit-2874956-2026-02-26",
      "headline": "PM Modi meets Fauda team in Israel: Only a selfie, no undercover work Prime Minister Narendra Modi met the cast and crew of the global hit Israeli TV show Fauda during his visit to Israel, sharing a witty caption on social media and highlighting the strong ties between India and Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thaai-kizhavi-radikaa-sarathkumar-womens-agency-patriarchy-review-2874924-2026-02-26",
      "headline": "Thaai Kizhavi review: Womanhood, wit and Radikaa Sarathkumar in all her gloryRelease Date:Thu Feb 26, 2026 Thaai Kizhavi movie review: Director Sivakumar Murugesan's film, starring Radikaa Sarathkumar, Singampuli, Aruldoss and Bala Saravanan, is a hilarious drama about women's agency and breaking generational chains without ever getting preachy or melodramatic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-season-4-part-2-review-romance-class-tension-character-growth-2874921-2026-02-26",
      "headline": "Bridgerton S4 Part 2 review: Dear gentle readers, the Ton hits its sweet spot againRelease Date:Thu Feb 26, 2026 Bridgerton Season 4 Part 2 series review: The series focusses on romance facing social challenges. The story highlights privilege, dignity, and evolving relationships in high society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-wedding-june-13-ocean-house-rhode-island-2874870-2026-02-26",
      "headline": "Taylor Swift, Travis Kelce set for Rhode Island wedding in June: Report As per reports, Taylor Swift and Travis Kelce are preparing to marry in June at the Ocean House in Rhode Island, with rapper Flavor Flav volunteering to officiate. Official paperwork is anticipated to be finalised within 30 days of the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hera-pheri-3-priyadarshan-addresses-delay-reports-discord-with-paresh-rawal-2874859-2026-02-26",
      "headline": "Hera Pheri 3: Priyadarshan addresses delay reports, discord with Paresh Rawal Production of Hera Pheri 3 has been delayed due to unresolved legal issues over film and music rights, with director Priyadarshan stating the project will not move forward this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ramayana-actor-dipika-chikhlias-daughter-juhi-gets-married-wedding-pics-out-2874851-2026-02-26",
      "headline": "Ramayana actor Dipika Chikhlia's daughter Juhi gets married, wedding pics out Ramayan fame Dipika Chikhlia's daughter Juhi recently got married. The actor shared a heartfelt video montage capturing the joyful and emotional moments from the wedding celebrations, giving fans a glimpse into the intimate ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-wedding-private-telugu-kodava-ceremonies-2874761-2026-02-26",
      "headline": "Rashmika-Vijay's wedding pics out? Here's the truth behind viral photos Photos of Vijay Deverakonda and Rashmika Mandanna have surfaced online, sparking speculation among fans that they are from the couple's wedding. However, with the duo yet to release any official pictures, fans continue to wait for confirmation from their team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/infuriating-ileana-dcruz-slams-trolls-for-body-shaming-rihanna-after-childbirth-2874798-2026-02-26",
      "headline": "Infuriating: Ileana D'Cruz slams trolls for body-shaming Rihanna after childbirth Ileana D'Cruz has spoken out against the online criticism directed at Rihanna for her post-pregnancy body, highlighting the unrealistic expectations placed on women to 'bounce back' after childbirth."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/afghanistan-launches-large-scale-offensive-along-pakistan-border-in-retaliation-to-airstrikes-taliban-2875063-2026-02-26",
      "headline": "Is this war? Taliban claim 15 border posts captured, many Pak soldiers killedThe Afghan administration had vowed retaliation after it said dozens of civilians, including women and children, were reported killed on Sunday in airstrikes carried out by the Pakistani military in two Afghan provinces bordering Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-ind-vs-zim-super-8-avengers-assemble-chepauk-india-alive-semifinal-race-2875089-2026-02-26",
      "headline": "IND vs ZIM: Avengers Assemble in Chennai as India storm back into semifinal raceIND vs ZIM, T20 World Cup Super 8: Forget solo acts. India's ensemble cast turned up the heat at Chepauk, plundering a record 256 to outclass Zimbabwe and reignite their T20 World Cup dreams in Chennai. Brian Bennett's valiant 97 went in vain as Zimbabwe lost by 72 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/judicial-corruption-erased-ncert-books-controversy-class-8-chapter-cji-contemptuous-pm-modi-concerned-2875048-2026-02-26",
      "headline": "All good. Judicial corruption has been erased from NCERT Class 8 textbookThe Supreme Court ordered a ban on a Class 8 NCERT textbook that referred to corruption in the judiciary. It ordered seizure of all copies and sought minutes of the meeting of the Syllabi Board which cleared the textbook. It is believed that even PM Modi was agonised by the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/hillary-clinton-denies-knowledge-of-jeffrey-epstein-crimes-testimony-glbs-2875064-2026-02-26",
      "headline": "Bid to cover up Trump's crimes: Hillary Clinton's fiery testimony in Epstein probeHillary Clinton's appearance before the US House Oversight Committee came after months of political sparring over access to Epstein-related records and testimony from prominent figures linked to the late offender's network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-israel-visit-did-benjamin-netanyahu-wear-jawaharlal-nehru-jacket-indian-style-attire-fashion-diplomacy-2874999-2026-02-26",
      "headline": "Did Netanyahu wear a Nehru jacket or a Modi jacket to meet Modi?Israeli Prime Minister Benjamin Netanyahu's Indian-style jacket at a dinner hosted for Indian PM Narendra Modi in Jerusalem. But it sparked a debate: was it a Nehru classic or a Modi-era update? The sartorial gesture shows how diplomacy and fashion are intertwined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-sends-advanced-f22-raptor-stealth-jets-israel-amid-tension-with-iran-donald-trump-nuclear-talks-2875108-2026-02-26",
      "headline": "In a first, US sends advanced F22 stealth jets to Israel amid Iran standoffFor the first time, the US has sent top of the line F-22 Raptor jets to Israel, amid continued tension with Iran over the latter's nuclear programme plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-share-first-pics-from-wedding-look-regal-2874651-2026-02-26",
      "headline": "Mrs and Mr Deverakonda: Rashmika-Vijay post first pics as coupleRashmika Mandanna and Vijay Deverakonda got married in Udaipur on Thursday in two wedding ceremonies. The two opted for traditional ensembles for the big day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-what-a-sanctioned-country-looks-like-kalli-purie-on-myth-vs-reality-of-iran-2875094-2026-02-26",
      "headline": "Not what a sanctioned country looks like: Kalli Purie on myth vs reality of IranThe India Today team presents a fresh perspective on life in Tehran, challenging common stereotypes about sanctioned countries. Their on-ground reporting reveals a vibrant culture and everyday normalcy amidst economic and social complexities.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-win-zimbabwe-keeps-semifinal-qualification-2875082-2026-02-26",
      "headline": "Zimbabwe conquered. How can India qualify for T20 World Cup semis? ExplainedT20 World Cup, IND vs ZIM: Suryakumar Yadav's India defeated Zimbabwe by 72 runs at the MA Chidambaram Stadium on Thursday and will next face the West Indies on March 1 in a bid to secure a place in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/jharkhand/story/jharkhand-man-feeds-pregnant-girlfriend-poison-golgappas-attempted-strangle-forest-relationship-another-child-pretext-of-marriage-2875065-2026-02-26",
      "headline": "The gift of golgappas that was not. Jharkhand man's plot to kill pregnant loverSaket Keshari, 26, and the 23-year-old woman were in a six-year-long relationship but were made to break up by the villagers. They had a child a year earlier. The accused reconciled with the woman and promised marriage before she fell pregnant again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/sanjiv-mehta-east-india-company-london-based-luxury-lifestyle-brand-shuts-down-again-british-colonial-trading-firm-eic-2874374-2026-02-26",
      "headline": "East India Company goes bankrupt, shuts down again after 170 yearsThe East India Company, once ruler of vast Indian territories, has closed for the second time. Relaunched in the 2000s by Indian entrepreneur Sanjiv Mehta as a Mayfair luxury brand, which sold high-end teas and fine foods. It owed over £950,000 and entered creditors' voluntary liquidation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/piracy-will-be-impossible-to-control-the-kerala-story-2-makers-ask-high-court-to-pause-order-halting-release-2875032-2026-02-26",
      "headline": "Kerala Story 2 makers' fierce fight against halt on release, but no court reliefThe makers of The Kerala Story 2 challenged the single judge order halting the film's release, contending that India should not be so fragile that a movie can threaten a religion. They also added that films have previously depicted Hindu gods and goddesses in a satirical light without similar restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/narendra-modi-meets-fauda-cast-israel-selfie-february-2026-visit-2874956-2026-02-26",
      "headline": "PM Modi meets Fauda team in Israel: Only a selfie, no undercover workPrime Minister Narendra Modi met the cast and crew of the global hit Israeli TV show Fauda during his visit to Israel, sharing a witty caption on social media and highlighting the strong ties between India and Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncert-textbook-controversy-pm-modi-reaction-judicial-corruption-displeasure-action-2874927-2026-02-26",
      "headline": "Why teach Class 8 students about judicial corruption? PM upset over NCERT rowPrime Minister Narendra Modi has expressed concern over the inclusion of judicial corruption in a Class 8 textbook, questioning its appropriateness for young students. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-aide-howard-lutnick-meets-piyush-goyal-india-us-trade-deal-tariffs-2874848-2026-02-26",
      "headline": "Trade tables flip? Trump aide's quiet India visit after tariff setbackThe tide seems to have turned after the US Supreme Court struck down Trump's tariffs. Several countries that struck trade deals are now reassessing their positions. India also postponed the visit of its trade team. Against this backdrop, Howard Lutnick's quiet Delhi visit holds significance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/andhra-pradesh-indian-student-ganti-abhishek-london-home-fire-death-peddapuram-mba-career-opportunities-others-escape-suffocation-2875023-2026-02-26",
      "headline": "26-year-old Indian MBA student from Andhra dies in fire at London homeGanti Abhishek, 26, failed to escape the sudden fire that had broken out at the home in London where he stayed. He is believed to have died due to suffocation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rashmika-mandanna-vijay-deverakonda-in-regal-anamika-khanna-outfits-wedding-photos-2874978-2026-02-26",
      "headline": "Vijay, Rashmika's wedding outfits by Anamika Khanna are pure regal dramaRashmika Mandanna and Vijay Deverakonda kept it regal at their wedding ceremony, and wore traditional ensembles designed by Anamika Khanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-a-dry-eye-left-in-israel-after-your-moving-statement-in-knesset-netanyahu-to-pm-modi-2874841-2026-02-26",
      "headline": "Not a dry eye left in Israel: Netanyahu on PM Modi's moving Knesset speechPrime Minister Narendra Modi's visit to Israel was marked by deep emotional moments and strengthened strategic ties between the two nations. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-bonu-komali-youtuber-science-degree-student-suicide-found-dead-note-mother-brother-boyfriend-emotional-distress-2874811-2026-02-26",
      "headline": "YouTuber found dead in Hyderabad flat; scared to move on, she wrote on breakupPreliminary inquiry suggested that 21-year-old Bonu Komali, a YouTuber as well as a college student, had been in severe emotional distress in recent months. She had sent a message, expressing affection, to her mother before being found dead at her Hyderabad flat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/mexico-drug-cartel-leader-el-mencho-killed-onlyfans-instagram-model-maria-julissa-statement-no-involvement-viral-2874964-2026-02-26",
      "headline": "OnlyFans model denies she's girlfriend who led cops to drug lord El MenchoOnlyFans model, Maria Julissa, has denied leading Mexican authorities to the country's most notorious cartel leader, El Mencho, that ultimately led to his death, and plunged at least 20 states into unrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/israel-pm-netanyahus-love-story-has-an-indian-restaurant-connection-2874918-2026-02-26",
      "headline": "Israel PM Netanyahu's love story has an Indian restaurant connectionIsrael PM took a trip down memory lane, recalling his date night with his wife, Sara Netanyahu, several years ago. Netanyahu said he owed India a \"great personal debt.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kerala-elephant-lifts-man-throws-him-aside-during-festival-video-goes-viral-2874820-2026-02-26",
      "headline": "Elephant lifts man, throws him aside during festival in Kerala. Video goes viralAn elephant attacked a man during the Valiyavilakku festival in Kerala by lifting and throwing him aside, leaving him seriously injured. A now-viral video of the incident led to discussions on animal rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-news-central-bank-governor-mostaqur-rahman-appointment-ahsan-mansur-dismissal-jamaat-shafiqur-rahman-2874957-2026-02-26",
      "headline": "Loan-defaulter made Bangladesh central bank chief; Jamaat trains guns on govtA controversy has erupted over the appointment of the Governor of Bangladesh Bank. The BNP-led government abruptly ended the tenure of the Muhammad Yunus-era governor, Ahsan Habib Mansur. Mostaqur Rahman, a businessman with no banking experience and a history of defaulting on loans, was given the post, leading to fierce criticism from Jamaat-e-Islami chief Shafiqur Rahman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/moon-navy-blue-red-lunar-eclipse-march-2026-science-ozone-layer-science-news-astronomy-news-2874930-2026-02-26",
      "headline": "Why will the Moon turn blood-red on March 3? Science explainedThe total lunar eclipse on March 3, 2026 will feature a rare navy blue fringe caused by the ozone layer. This stunning celestial event highlights how Earth's atmosphere filters sunlight to create vibrant colours on the Moon.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/aiden-markram-south-africa-vs-west-indies-press-conference-2875118-2026-02-27",
      "headline": "Aiden Markram cautious despite South Africa's unbeaten run: Can't take things for granted T20 World Cup 2026, SA vs WI: Aiden Markram said that South Africa can't take things for granted despite their unbeaten run in the tournament. On Thursday, the Proteas beat West Indies by nine wickets after which India's win over Zimbabwe helped them qualify for the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/west-indies-vs-south-africa-t20-world-cup-shai-hope-super-8-semifinals-2875110-2026-02-26",
      "headline": "West Indies will look to turn things around quickly against India: Shai Hope T20 World Cup, WI vs SA: Speaking to the reporters after the nine-wicket loss to South Africa, Shai Hope said that West Indies will look to bounce back when they face India in their must-win clash at the Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-becomes-indias-highest-wicket-taker-t20-world-cup-india-beats-zimbabwe-2875092-2026-02-26",
      "headline": "Arshdeep Singh breaks Jasprit Bumrah's major record with 3-wicket haul vs Zimbabwe Arshdeep Singh became India's highest wicket-taker in T20 World Cup history during the Super 8 match against Zimbabwe. His record-breaking performance helped India secure a dominant 72-run victory and strengthened their semi-final hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-ind-vs-zim-super-8-avengers-assemble-chepauk-india-alive-semifinal-race-2875089-2026-02-26",
      "headline": "IND vs ZIM: Avengers Assemble in Chennai as India storm back into semifinal race IND vs ZIM, T20 World Cup Super 8: Forget solo acts. India's ensemble cast turned up the heat at Chepauk, plundering a record 256 to outclass Zimbabwe and reignite their T20 World Cup dreams in Chennai. Brian Bennett's valiant 97 went in vain as Zimbabwe lost by 72 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-win-zimbabwe-keeps-semifinal-qualification-2875082-2026-02-26",
      "headline": "Zimbabwe conquered. How can India qualify for T20 World Cup semis? Explained T20 World Cup, IND vs ZIM: Suryakumar Yadav's India defeated Zimbabwe by 72 runs at the MA Chidambaram Stadium on Thursday and will next face the West Indies on March 1 in a bid to secure a place in the semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-t20-world-cup-2026-form-tim-southee-backs-england-star-2875025-2026-02-26",
      "headline": "Jos Buttler's form a concern? Tim Southee backs England batter amid horrid form T20 World Cup, NZ vs ENG: Tim Southee has backed Jos Buttler to bounce back when England lock horns with New Zealand in their last Super 8 game on Friday in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-fifty-t20-world-cup-2026-india-zimbabwe-chennai-2875006-2026-02-26",
      "headline": "IND vs ZIM: Abhishek Sharma puts form woes behind him with sizzling fifty in Chennai IND vs ZIM: Abhishek Sharma silenced his critics with a patient and measured 55 off 30 balls against Zimbabwe at Chepauk, earning a standing ovation from the Chennai crowd in the T20 World Cup Super 8s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-zim-playing-xis-sanju-samson-axar-patel-return-chepauk-chennai-2874967-2026-02-26",
      "headline": "IND vs ZIM: Samson gets roaring Chepauk welcome, Axar return ends Sundar experiment IND vs ZIM, T20 World Cup 2026: Chepauk gave Sanju Samson a roaring welcome as vice-captain Axar Patel's return brought Washington Sundar's brief experiment in the XI to an abrupt end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-vs-england-rob-walter-press-conference-super-8-2874963-2026-02-26",
      "headline": "New Zealand don't want to leave semifinal hopes on external factors: Rob Walter T20 World Cup 2026, NZ vs ENG: Speaking to the reporters, New Zealand coach Rob Walter said that the Black Caps don't want to leave their semi-final hopes to external factors when they face England on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-t20-world-cup-win-india-west-indies-boosts-semi-final-chances-2874945-2026-02-26",
      "headline": "South Africa help India, hammer West Indies to keep semifinal race spicy T20 World Cup, SA vs WI: South Africa defeated West Indies by nine wickets on Thursday at the Narendra Modi Stadium in Ahmedabad, also giving India a boost in their race to qualify for the semifinals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/auqib-nabi-dar-jk-pacer-ranji-trophy-india-dream-2874947-2026-02-26",
      "headline": "Do it the Auqib Nabi way: J&K star shows how you can also knock on India's doorsFrom hilly terrains in Baramulla to the top of India's domestic bowling charts, Auqib Nabi Dar's journey is a masterclass in chasing small wins until the biggest one arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-vs-karnataka-day-3-report-mayank-hundred-2874940-2026-02-26",
      "headline": "J&K eye big lead despite Mayank's hundred for Karnataka on Day 3Jammu and Kashmir remained firmly in control of the Ranji Trophy final at stumps on Day 3, even as Mayank Agarwal produced the knock of rare grit and character to keep Karnataka afloat. The hosts ended the day on 220 for 5, still trailing J&K's imposing first-innings total of 584, with Mayank unbeaten on 130 in a lone battle of defiance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dasun-shanaka-urges-fans-keep-faith-sri-lanka-cricket-t20-world-cup-exit-2874896-2026-02-26",
      "headline": "Dasun Shanaka appeals to fans after T20 WC exit: Don't lose faith on Sri Lanka cricketSri Lanka skipper Dasun Shanaka urged fans to stay supportive despite the team's T20 World Cup 2026 exit, acknowledging their disappointment and promising to always give his best for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-threat-new-zealand-must-win-t20-world-cup-match-colombo-2874828-2026-02-26",
      "headline": "New Zealand coach wary of Harry Brook threat before must-win clash vs EnglandT20 World Cup, ENG vs NZ: Head coach Rob Walter said New Zealand are well aware of the threat Harry Brook poses as the Kiwis face England on Friday in Colombo. On Tuesday, Brook's century propelled England into the semifinals with a two-wicket win over Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-live-score-ind-zim-t20-world-cup-super-8-match-chennai-2874821-2026-02-26",
      "headline": "IND vs ZIM Highlights: Bennett 97 in vain as India beat Zimbabwe by 72 runsIndia (IND) vs Zimbabwe (ZIM), T20 World Cup Super 8 Highlights: Brian Bennett scored 97 runs, but his knock went in vain as India beat Zimbabwe by 72 runs at the MA Chidambaram Stadium in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-rajasthan-royals-us-tycoon-bid-david-blitzer-ipl-2026-buying-suitor-2874764-2026-02-26",
      "headline": "RCB, RR get new suitor as US tycoon enters bidding race for IPL franchiseDavid Blitzer's interest has intensified the battle for stakes in RCB and Rajasthan Royals. With global investors now circling IPL franchises, the league's financial pull continues to grow beyond traditional cricket markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cristiano-ronaldo-acquires-25-percent-stake-in-ud-almeria-to-boost-la-liga-promotion-2874799-2026-02-26",
      "headline": "Ronaldo becomes part-owner, buys 25 percent stake in Spanish 2nd-tier sideCristiano Ronaldo has become a part-owner of the Spanish second-tier side Almeria as he enters the world of football management. Almeria is battling to return to the LaLiga next season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umran-malik-expensive-spells-dy-patil-t20-cup-kkr-troubles-ipl-2026-2874765-2026-02-26",
      "headline": "KKR's Umran Malik concedes 36 in an over, 59 in two in DY Patil T20 Cup spellKolkata Knight Riders pacer Umran Malik endured a nightmare outing in the DY Patil T20 Cup, conceding 59 runs in just two overs while representing Tata Sports Club against Mumbai Customs on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-virender-sehwag-suggests-resting-abhishek-sharma-vs-zimbabwe-2874678-2026-02-26",
      "headline": "Would have given Abhishek Sharma a break: Sehwag's bold call before IND vs ZIMT20 World Cup: Former opener Virender Sehwag has called for Abhishek Sharma to be rested ahead of India's crucial Super 8 encounter with Zimbabwe. Sehwag said India should pick players based on form for the must-win match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-west-indies-live-score-wi-sa-t20-world-cup-super-8-match-ahmedabad-2874726-2026-02-26",
      "headline": "SA vs WI, Super 8 Highlights: South Africa beat West Indies by 9 wicketsSouth Africa (SA) vs West Indies (WI), T20 World Cup Super 8 Highlights: South Africa have beaten West Indies by nine wickets at the Narendra Modi Stadium in Ahmedabad to strengthen their chances of qualifying for the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-sanju-samson-india-left-handers-off-spin-issue-2874715-2026-02-26",
      "headline": "Left, right, left? Why India should turn to Sanju Samson to get starts rightIndia vs Zimbabwe, T20 World Cup Super 8: With India's opening stands stalling and part-timers reaping rewards, their campaign needs an urgent fix at the top. Is reintroducing Sanju Samson the tactical recalibration needed to find the right balance?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-nz-t20-world-cup-kumar-sangakkara-demands-urgent-reforms-super-8-exit-2874669-2026-02-26",
      "headline": "SL vs NZ: Sangakkara demands urgent reforms after Sri Lanka's T20 World Cup exitT20 World Cup: Kumar Sangakkara called for urgent reform on all levels after Sri Lanka's early T20 World Cup exit. He warned that unless Sri Lanka adapt to the modern game quickly, the gap between them and leading teams will only continue to grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-dew-cure-chepauk-india-vs-zimbabwe-2874648-2026-02-26",
      "headline": "T20 World Cup: No dew drama in IND vs ZIM? US chemical to be used at ChepaukT20 World Cup: Dew may not play factor during the India vs Zimbabwe clash at Chepauk on Thursday, with the Tamil Nadu Cricket Association using a US-imported chemical to tackle with the moisture during the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-benfica-vincius-revenge-playoff-tchouameni-santiago-bernabeu-gianluca-prestianni-2874636-2026-02-26",
      "headline": "Vinicuis gets his revenge as Real Madrid knock Benfica out of Champions LeagueVinicius Jr sealed Real Madrid's 3-1 win with a decisive late goal against Benfica. Days after off-field controversy, the Brazilian shifted the focus back to football and guided Madrid into the Champions League Round of 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-paras-dogra-fined-jammu-and-kashmir-vs-karnataka-kv-aneesh-2874624-2026-02-26",
      "headline": "Jammu and Kashmir captain Paras Dogra fined for headbutt row in Ranji Trophy finalRanji Trophy Final: Paras Dogra is set to be fined after his on-field clash with KV Aneesh during the Ranji Trophy final. The flashpoint briefly sparked chaos but did little to stop Jammu and Kashmir's march to 584."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-zimbabwe-shivam-dube-bowling-mohammed-kaif-chennai-2874599-2026-02-26",
      "headline": "Dube's bowling questioned, called a batter and not an all-rounder by ex-IND starT20 World Cup: Mohammed Kaif isn't convinced with Shivam Dube's capabilities as a bowler, saying that he is a batter and not an all-rounder. Dube has been expensive with the ball this year for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-sri-lanka-vs-new-zealand-dasun-shanaka-press-conference-2874570-2026-02-26",
      "headline": "Dasun Shanaka apologises to fans as Sri Lanka crash out of T20 World CupT20 World Cup: After crashing out of the T20 World Cup 2026, Sri Lanka captain Dasun Shanaka issued an apology to fans, saying that they failed to provide a win to make them happy during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-t20-world-cup-abhishek-sharma-run-slum-how-can-he-fix-it-2874560-2026-02-26",
      "headline": "The Abhishek Sharma slump: What's gone wrong and how he can fix itT20 World Cup: Abhishek Sharma was in the form of his life going into the T20 World Cup. What's gone wrong? India Today delves into the left-hander's problems and how to fix those ahead of the team's do-or-die clash against Zimbabwe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-sri-lanka-vs-new-zealand-rachin-ravindra-press-confernece-colombo-2874541-2026-02-26",
      "headline": "Beating Sri Lanka at home is a big achievement for New Zealand: Rachin RavindraT20 World Cup: New Zealand all-rounder Rachin Ravindra said their win over Sri Lanka was a big achievement, especially on Sri Lankan soil. With the victory over the co-hosts, New Zealand are now in a strong position to secure a semi-final spot."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}