{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-over-12-percent-today-what-should-investors-do-2590857-2024-08-30",
      "headline": " Paytm shares rise over 12% today: What should investors do?This rise in shares comes amid important developments within the company, including the recent sale of its entertainment ticketing business to online food aggregator Zomato for Rs 2,048 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simplified-pension-application-form-launched-for-retiring-government-employees-2590843-2024-08-30",
      "headline": "Simplified pension form launched for retiring government staff. Check detailsThe new form consolidates nine separate forms into a single, unified Form 6A. It also offers the option to download the ePPO, ensuring a seamless transition from employment to retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-investors-q1-gdp-data-rvnl-share-price-2590815-2024-08-30",
      "headline": "Sensex, Nifty end higher as investors await Q1 GDP data; RVNL up 4%The S&P BSE Sensex rose 231.16 points to 82,365.77, while the NSE NIfty50 settled 83.95 higher at 25,235.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-growth-preview-data-what-to-watch-out-for-outlook-expectations-2590803-2024-08-30",
      "headline": "India Q1 GDP growth preview: What to watch out for Analysts predict growth in the range of 6%-7.1% for Q1 FY25, compared with 7.8% in the previous quarter (Q4 FY24). Rating agencies and financial institutions have varying expectations for Q1 GDP growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-shares-surge-5-cross-rs-600-whats-behind-the-rally-2590746-2024-08-30",
      "headline": "RVNL shares cross Rs 600 mark after jumping 5%. What's behind the rally?Shares of this multibagger railway PSU have sharply corrected over the past month but are still up over 230% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-shares-issue-what-is-it-and-how-does-it-benefit-investors-2590685-2024-08-30",
      "headline": "Reliance bonus issue: What is it and how will it benefit shareholders?A bonus issue, also known as a bonus share issue, occurs when a company distributes additional shares to its existing shareholders at no cost to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-global-fintech-fest-jan-dhan-yojana-pivotal-in-boosting-financial-inclusion-women-empowerment-2590680-2024-08-30",
      "headline": "'Jan Dhan Yojana pivotal in boosting financial inclusion': PM ModiSpeaking at the Global Fintech Fest (GFF), he mentioned how the scheme has been a game-changer in ensuring that banking services reach every corner of the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/uk-insurer-aviva-found-guilty-in-ud-26-million-fake-invoice-scandal-in-india-report-2590627-2024-08-30",
      "headline": "UK's Aviva found guilty in $26 million fake invoice scandal in India: ReportBritish insurer Aviva has been accused of violating regulations in India by using fake invoices and secret cash payments to bypass commission limits for sales agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-air-india-merger-check-impact-on-ticket-bookings-flight-operations-and-more-2590615-2024-08-30",
      "headline": "Vistara-Air India merger: Check impact on ticket bookings, flight operations and moreVistara-Air India merger: Travelers can expect expanded services and improved connectivity. Read on to see how this change will impact your bookings, flight operations, and travel experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-vistara-merger-likely-to-be-finalised-on-november-12-2590580-2024-08-30",
      "headline": "No Vistara flight bookings from September 3 ahead of merger with Air IndiaVistara-Air India merger: Starting from September 3, 2024, customers will no longer be able to book Vistara flights for travel on or after November 12, 2024. Bookings for these routes will be redirected to Air India's website."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-ipo-allotment-status-step-by-step-guide-gmp-today-2590555-2024-08-30",
      "headline": "Premier Energies IPO allotment: Step-by-step guide to check status Premier Energies IPO allotment: Investors can check their Premier Energies IPO allotment status online via the BSE website or Kfin Technologies Limited, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-at-record-highs-as-moodys-lifts-indias-gdp-forecast-to-72-percent-2590522-2024-08-30",
      "headline": "Sensex, Nifty open at record highs as Moody's lifts India's GDP forecast to 7.2%The S&P BSE Sensex added 502.42 points to 82,637.03, while the NSE Nifty50 gained 87.45 points to 25,239.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-agm-mukesh-ambani-bullish-on-reliances-growth-no-word-on-jio-retail-ipos-2590174-2024-08-29",
      "headline": "RIL AGM: Mukesh Ambani bullish on Reliance's growth; no word on Jio, Retail IPOsMukesh Ambani was bullish on the conglomerate's growth and said that Reliance was on track to more than double in size before the end of this decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shah-rukh-khan-debuts-on-hurun-india-rich-list-with-rs-7300-crore-net-worth-2590133-2024-08-29",
      "headline": "Shah Rukh Khan enters Hurun India Rich List with Rs 7,300 crore net worthKnown for his recent hits like 'Jawan' and 'Pathaan', Khan's wealth isn't just from his successful film career but also from his stakes in the IPL team, Kolkata Knight Riders, which have significantly increased in value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-sensex-nifty-end-higher-driven-record-high-gains-in-ril-stock-2590085-2024-08-29",
      "headline": "Sensex, Nifty end higher driven by gains in RIL stock The S&P BSE Sensex added 349.05 points to end at 82,134.61, while the NSE Nifty50 gained 99.60 points to close at 25,151.95. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-first-statement-on-hema-committee-report-quitting-amma-2591377-2024-08-31",
      "headline": "Mohanlal breaks silence on Hema panel report: 'Don't destroy Malayalam industry'Malayalam actor Mohanlal made his first public appearance on August 31 after resigning as president of the Association of Malayalam Movie Artists (AMMA). He spoke about the Hema Committee report and assured that those responsible would be punished."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/need-faster-verdicts-pm-modi-on-women-safety-amid-kolkata-rape-murder-2591283-2024-08-31",
      "headline": "Need faster verdicts: PM Modi on crimes against women amid Kolkata rape-murderAmid the outrage over the Kolkata rape-murder, Prime Minister Narendra Modi on Saturday said that the country needs faster verdicts in cases of crimes against women to ensure their safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-elderly-muslim-man-assaulted-nashik-train-carrying-beef-suspicion-2591419-2024-08-31",
      "headline": "Man assaulted in Nashik train on suspicion of carrying beef, AIMIM slams copsA video of the incident was shared by AIMIM MP Imtiaz Jaleel, who called out the government and police for turning a bling eye against 'these forces'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/how-subtitles-now-decide-fate-of-films-art-of-writing-subtitles-2590800-2024-08-31",
      "headline": "How subtitles now decide the fate of filmsSubtitles have played a significant role in breaking language barriers, expanding audience reach, and changing viewing habits across India's diverse linguistic landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/champai-soren-an-edge-or-headache-to-bjp-jmm-jharkhand-assembly-election-reasons-impacts-hemant-soren-tribal-vote-kolhan-2591374-2024-08-31",
      "headline": "Will Champai Soren give an edge or headache to BJP?Former JMM leader Champai Soren, a former aide of the Soren family, joined the BJP on Friday, ahead of the Assembly polls in Jharkhand. Champai Soren will give the BJP an edge in the tribal Assembly seats of Santhal and Kolhan regions, but might bring headaches to a party overloaded with leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/high-courts/story/baba-ramdev-patanjali-divya-manjan-vegetarian-product-non-veg-ingredient-petition-fish-extract-delhi-high-court-notice-2591274-2024-08-31",
      "headline": "Fish extract in Patanjali's 'vegetarian' product? Court notice to Ramdev, CentreThe petition alleges that the packaging of Patanjali's Divya Manjan features a green dot, a symbol indicating vegetarian products, yet the list of ingredients clearly shows that the tooth powder contains 'samudraphen', which is derived from fish extract."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-migrant-worker-beaten-to-death-haryana-cow-vigilante-group-beef-consumption-police-2591366-2024-08-31",
      "headline": "Migrant killed in Haryana on suspicion of eating beef, 2 minors among 7 arrestedHaryana lynching: Five people, including two minors, have been arrested for the incident that happened in Haryana's Charkhi Dadri district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-kolhapur-hit-and-run-man-injured-case-speeding-car-2591324-2024-08-31",
      "headline": "Caught on camera: Man flung into air after car rams him in MaharashtraA Maharashtra man suffered severe injuries in a hit-and-run incident when a speeding car struck him from behind, throwing him into the air. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-to-hold-massive-protest-at-shambhu-border-today-vinesh-phogat-to-join-2591253-2024-08-31",
      "headline": "Vinesh Phogat joins farmers' stir at Shambhu border: Your daughter is with youOlympian Vinesh Phogat was honoured with garlands as the wrestler joined the farmers' protest at Sambhu border today. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-rues-playing-worst-tennis-in-years-after-us-open-2024-exit-2591309-2024-08-31",
      "headline": "Novak Djokovic rues playing 'worst tennis in years' after US Open 2024 exitNovak Djokovic rued playing 'worst tennis in years' after his third round exit from US Open 2024. The 24-time Grand Slam winner felt 'out of gas' after his Olympic gold medal win in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/how-jahangir-fell-for-british-charm-and-paved-the-way-for-indias-colonisation-2591329-2024-08-31",
      "headline": "How Jahangir fell for British charm and paved the way for India's colonisationJahangir's reign, a tapestry of indulgence and leisure, allowed the British East India Company to weave its threads into India's fabric. Enchanted by England's curiosities and distracted by his own pleasures, the emperor's gaze faltered, paving the way for 200 years of British dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/haryana-polls-battle-for-dalit-vote-heats-up-as-mayawati-chandrasekhar-enter-fray-2591341-2024-08-31",
      "headline": "Haryana polls: Battle for Dalit vote heats up as Mayawati, Chandrasekhar enter frayAs the Haryana Assembly elections approach, the battle for the Dalit vote intensifies with both the Bahujan Samaj Party and the Azad Samaj Party entering the fray. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-final-mohun-bagan-northeast-united-fc-final-kolkata-salt-lake-stadium-2591429-2024-08-31",
      "headline": "Durand Cup 2024 Final Live: Mohun Bagan 1-0 NorthEast United in 1st halfDurand Cup 2024 Final Live, Mohun Bagan vs NorthEast United FC: Mohun Bagan have started well at the Salt Lake Stadium and have scored their first goal in the 12th minute of the match. Jason Cummings slots in a calm and cool penalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-pennsylvania-rally-security-breach-man-storms-media-gallery-2591334-2024-08-31",
      "headline": "Security breach at Trump's Pennsylvania rally again as man storms media galleryThe man, who tried to enter the media gallery during Trump's rally in Johnstown, was immediately surrounded by police and subdued with a taser."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russian-helicopter-with-22-on-board-goes-missing-in-far-east-report-2591323-2024-08-31",
      "headline": "Russian helicopter with 22 on board goes missing in far east: Report  The Mi-8T helicopter had departed from a base near the Vachkazhets volcano but failed to report in at the scheduled time of 04:00 GMT, news agency Reuters reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-donald-trump-mic-unmuted-presidential-debate-abc-news-september-10-why-she-wants-2589582-2024-08-31",
      "headline": "Why Kamala Harris wants Trump unmutedFor their first presidential debate on September 10, Democratic Presidential candidate Kamala Harris wants her Republican rival Donald Trump's mic unmuted. Trump is saying that the matter has been settled, but the Harris campaign is insisting on an unmuted mic for the candidates. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-sports-politics-419-30-08-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/dharmendra-kumar-delhi-new-chief-secretary-role-crucial-aap-party-lg-2591313-2024-08-31",
      "headline": "Why role of Dharmendra Kumar, Delhi's new Chief Secretary, will be crucialIAS officer Dharmendra Kumar has been appointed as Delhi's new Chief Secretary, succeeding Naresh Kumar, with his tenure beginning on September 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/mumbai-to-kolkata-goa-to-gurugram-home-chefs-are-changing-the-way-you-eat-out-2590161-2024-08-31",
      "headline": " Mumbai to Kolkata, Goa to Gurugram: Home chefs are changing the way you eat outThe post-pandemic boom has seen food enthusiasts yearning for more immersive and niche dining experiences than ever. This is where these home chefs are making a difference with their unique dining style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bahraich-indian-wolf-is-no-man-eater-2591221-2024-08-31",
      "headline": "Bahraich Bottomline: The Indian wolf is no man-eaterThe Indian wolf is the most ancient lineage of living wolves in the world. Having evolved in the Indian sub-continent, it has as much right as us to live and thrive in India. But it is not thriving."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-godhra-man-tied-to-car-bonnet-arrested-stealing-theft-kankuthambhala-2591215-2024-08-31",
      "headline": "Man tied to car bonnet, paraded around as punishment over suspicion of theftTwo people, including the shopkeeper who accused the man of stealing, have been arrested in connection with the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ins-arighaat-how-a-second-nuclear-submarine-boosts-indias-strategic-reach-2591300-2024-08-31",
      "headline": "INS Arighaat: How a second nuclear submarine boosts India's strategic reachThe presence of both INS Arihant and INS Arighaat will enhance India's capability to deter potential adversaries and safeguard its national interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-breaks-silence-on-hema-committee-report-spoke-against-harassment-was-left-alone-2591392-2024-08-31",
      "headline": "Kangana Ranaut on Hema Committee report: Spoke against harassment, was left aloneActor Kangana Ranaut commented on the Hema Committee report and mentioned that she spoke out against sexual harassment in Bollywood years back, and was labelled 'problematic'. She said the report should have been released earlier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-director-lokesh-kanagaraj-welcomes-sathyaraj-as-rajasekhar-in-new-poster-with-rajinikanth-shruti-haasan-nagarjuna-2591427-2024-08-31",
      "headline": "'Coolie' director Lokesh Kanagaraj welcomes Sathyaraj as Rajasekhar in new posterDirector Lokesh Kanagaraj shared the first character poster of actor Sathayaraj from 'Coolie'. The film is fronted by superstar Rajinikanth, and also stars Shruti Haasan and Nagarjuna in important roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-enjoys-holiday-with-bradley-cooper-his-daughter-in-sardinia-2591418-2024-08-31",
      "headline": "Gigi Hadid enjoys holiday with Bradley Cooper, his daughter in Sardinia Model Gigi Hadid was seen vacationing with her rumoured boyfriend, Hollywood actor Bradley Cooper, and his daughter in Sardinia. Several photos of the trio have gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-sexual-harassment-telugu-industry-hema-committee-report-2591408-2024-08-31",
      "headline": "Samantha urges Telangana government to publish report on sexual harassmentActor Samantha urged the Telangana government to publish the Hema Committee report on sexual harassment in the Telugu film industry, following Women in Cinema Collective's efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-breaks-silence-on-hema-committee-report-spoke-against-harassment-was-left-alone-2591392-2024-08-31",
      "headline": "Kangana Ranaut on Hema Committee report: Spoke against harassment, was left aloneActor Kangana Ranaut commented on the Hema Committee report and mentioned that she spoke out against sexual harassment in Bollywood years back, and was labelled 'problematic'. She said the report should have been released earlier. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-final-mohun-bagan-northeast-united-fc-final-kolkata-salt-lake-stadium-2591429-2024-08-31",
      "headline": "Durand Cup 2024 Final Live: Mohun Bagan 1-0 NorthEast United in 1st halfDurand Cup 2024 Final Live, Mohun Bagan vs NorthEast United FC: Mohun Bagan have started well at the Salt Lake Stadium and have scored their first goal in the 12th minute of the match. Jason Cummings slots in a calm and cool penalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/priyansh-arya-joins-yuvraj-singh-ravi-shastri-as-he-hits-6-sixes-in-an-over-in-dpl-2591421-2024-08-31",
      "headline": " Priyansh Arya joins Yuvraj Singh, Ravi Shastri as he hits 6 sixes in an overPriyansh Arya entered an elite list which included Yuvraj Singh and Ravi Shastri after he slammed 6 sixes in an over for South Delhi Superstarz in Delhi Premier League 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-badoni-priyansh-arya-delhi-premier-league-highest-total-partnership-sixes-delhi-premier-league-2591415-2024-08-31",
      "headline": "Stat Pack: 'Six hitting' Ayush Badoni, Priyansh Arya break mega record in T20sDPL 2024: South Delhi Superstarz batters Ayush Badoni and Priyansh Arya combined to slam a massive partnership of 286 runs. The duo scored individual centuries and set two major records in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-2nd-test-babar-azam-icc-ranking-2591401-2024-08-31",
      "headline": "Babar Azam's poor form continues after steep ICC ranking slipPAK vs BAN, 2nd Test: Pakistan batter Babar Azam's poor form continued in Test cricket just days later after his steep fall in the ICC rankings. Babar batted for 77 balls in the 1st innings of the second Test and got out after scoring 31 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-zverev-becomes-first-90s-born-man-to-win-100-grand-slam-matches-2591391-2024-08-31",
      "headline": "US Open 2024: Zverev becomes first '90s-born' man to win 100 Grand Slam matchesAlexander Zverev became the first man to be born in the 90s and beyond to win 100 Grand Slam matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-schedule-day-6-schedule-of-play-bopanna-sinner-swiatek-in-action-2591382-2024-08-31",
      "headline": "US Open Schedule, Day 6 Schedule of Play: Bopanna, Sinner, Swiatek in actionUS Open: After a day of mega upsets, US Open returns on Saturday with some exciting action. Top seed in both men's and women's singles competition Jannik Sinner and Iga Swiatek take stage in their Round 3 action on 31 August.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-10-years-ago-birth-of-kohli-root-smith-and-kane-as-fab-four-2591350-2024-08-31",
      "headline": "On This Day, 10 years ago: Birth of Kohli, Root, Smith and Kane as 'Fab Four' On 31st August in 2014, Martin Crowe introduced the term 'Fab Four' which included the star players like Virat Kohli, Joe Root, Steve Smith and Kane Williamson. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/watch-paralympian-sivarajan-solaimalai-flies-to-win-point-in-paris-games-2591336-2024-08-31",
      "headline": "Watch: Paralympian Sivarajan Solaimalai 'flies' to win point in ParisParalympics: India's para-badminton player Sivarajan Solaimalai went viral on social media on Saturday, 31 August after a video of his 'flying point' went viral on social media. The fans lauded Solaimalai's effort on the court in Paris Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-blames-poor-test-pitches-in-india-for-batters-struggles-with-spin-2591326-2024-08-31",
      "headline": "Harbhajan Singh blames poor Test pitches in India for batters' struggles with spinFormer India spinner Harbhajan Singh has criticised Indian Test pitches for ruining batters confidence while playing against spin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexei-popyrin-vs-novak-djokovic-us-open-2591320-2024-08-31",
      "headline": "Popyrin 'proves himself right' after beating Novak Djokovic in US OpenAustralia's Alexei Popyrin stunned Novak Djokovic in the third round of the US Open on Saturday, 31 August. Popyrin said that he had played Djokovic this season in the Australian Open and at the Wimbledon and knew that he could beat the defending champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-10-years-ago-birth-of-kohli-root-smith-and-kane-as-fab-four-2591350-2024-08-31",
      "headline": "On This Day, 10 years ago: Birth of Kohli, Root, Smith and Kane as 'Fab Four' On 31st August in 2014, Martin Crowe introduced the term 'Fab Four' which included the star players like Virat Kohli, Joe Root, Steve Smith and Kane Williamson. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/watch-paralympian-sivarajan-solaimalai-flies-to-win-point-in-paris-games-2591336-2024-08-31",
      "headline": "Watch: Paralympian Sivarajan Solaimalai 'flies' to win point in ParisParalympics: India's para-badminton player Sivarajan Solaimalai went viral on social media on Saturday, 31 August after a video of his 'flying point' went viral on social media. The fans lauded Solaimalai's effort on the court in Paris Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-blames-poor-test-pitches-in-india-for-batters-struggles-with-spin-2591326-2024-08-31",
      "headline": "Harbhajan Singh blames poor Test pitches in India for batters' struggles with spinFormer India spinner Harbhajan Singh has criticised Indian Test pitches for ruining batters confidence while playing against spin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexei-popyrin-vs-novak-djokovic-us-open-2591320-2024-08-31",
      "headline": "Popyrin 'proves himself right' after beating Novak Djokovic in US OpenAustralia's Alexei Popyrin stunned Novak Djokovic in the third round of the US Open on Saturday, 31 August. Popyrin said that he had played Djokovic this season in the Australian Open and at the Wimbledon and knew that he could beat the defending champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-rues-playing-worst-tennis-in-years-after-us-open-2024-exit-2591309-2024-08-31",
      "headline": "Novak Djokovic rues playing 'worst tennis in years' after US Open 2024 exitNovak Djokovic rued playing 'worst tennis in years' after his third round exit from US Open 2024. The 24-time Grand Slam winner felt 'out of gas' after his Olympic gold medal win in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-all-set-to-witness-supercars-vroom-in-f4-and-irl-night-street-racing-2591297-2024-08-31",
      "headline": "Chennai all set to witness supercars vroom in F4 and IRL night street racingChennai City is all set to witness the Night Street racing from 31st August to 1st September in F4 and Indian Racing League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/after-historic-midnight-win-aryna-sabalenka-thanks-crowd-for-staying-late-2591290-2024-08-31",
      "headline": "After historic midnight win, Aryna Sabalenka thanks crowd for staying lateAryna Sabalenka reached the round of 16 of the US Open with a historic midnight win over Ekaterina Alexandrova. She thanked the crowd for staying till late. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-games-paris-2024-day-3-live-updates-india-mandeep-kaur-swaroop-unhalkar-nitesh-kumar-2591284-2024-08-31",
      "headline": "Paralympics 2024 Day 3 Live: Rubina advances to Women's 10m Air Pistol finalParalympics 2024 Day 3 Live: Para shooter Rubina Francis qualified for the final of the Women's 10m Air Pistol final. Nitesh Kumar also began with a win, beating Thaliand's Mongkhon Bunsun in straight games. Sunkant Kadam is the latest to reach the semi-finals in the SL4 category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-azam-khan-falls-on-ground-after-being-hit-by-bouncer-on-neck-in-cpl-2024-2591278-2024-08-31",
      "headline": "Watch: Azam Khan falls on ground after being hit by bouncer on neck in CPL 2024Azam Khan collapsed on the ground after a bouncer hit his neck during Guyana Amazon Warriors' match against Antigua and Barbuda Falcons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-manuel-ugarte-from-paris-saint-germain-2591261-2024-08-31",
      "headline": "Manchester United sign Manuel Ugarte from Paris Saint GermainManchester United completed signed Paris Saint Germain and Uruguay mid fielder Manuel Ugarte for an initial fee of £42m. Ugarte made 37 appearances for PSG across all tournaments and also helped them to their 12th Ligue 1 title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravids-son-samit-dravid-earns-india-u19-call-up-for-australia-series-2591251-2024-08-31",
      "headline": "Rahul Dravid's son Samit earns India U19 call-up for Australia seriesLegendary India batter and former India head coach Rahul Dravid's son Samit earned maiden call-up in the Indian Under 19 team for the multi-format series against Australia Under 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-azam-khan-falls-on-ground-after-being-hit-by-bouncer-on-neck-in-cpl-2024-2591278-2024-08-31",
      "headline": "Watch: Azam Khan falls on ground after being hit by bouncer on neck in CPL 2024Azam Khan collapsed on the ground after a bouncer hit his neck during Guyana Amazon Warriors' match against Antigua and Barbuda Falcons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-manuel-ugarte-from-paris-saint-germain-2591261-2024-08-31",
      "headline": "Manchester United sign Manuel Ugarte from Paris Saint GermainManchester United completed signed Paris Saint Germain and Uruguay mid fielder Manuel Ugarte for an initial fee of £42m. Ugarte made 37 appearances for PSG across all tournaments and also helped them to their 12th Ligue 1 title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravids-son-samit-dravid-earns-india-u19-call-up-for-australia-series-2591251-2024-08-31",
      "headline": "Rahul Dravid's son Samit earns India U19 call-up for Australia seriesLegendary India batter and former India head coach Rahul Dravid's son Samit earned maiden call-up in the Indian Under 19 team for the multi-format series against Australia Under 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/who-is-alexie-popyrin-australian-who-pulled-off-upset-over-djokovic-in-us-open-2591245-2024-08-31",
      "headline": "Who is Alexei Popyrin? 25-year-old Australian dumps out Djokovic in US OpenAlexei Popyrin pulled off one of the greatest wins of his career as he beat the 24-time Grand Slam winner Novak Djokovic 6-4,6-4, 2-6, 6-4 in the round 3 of US Open 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-alexie-popyrin-beats-novak-djokovic-2591241-2024-08-31",
      "headline": "US Open: Alexie Popyrin elated to beat 'GOAT' Djokovic to progress to pre-quartersAustralia's Alexie Popyrin caused a major upset by beating Novak Djokovic in the third round of US Open and entering the round of 16 first time in his career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/watch-cristiano-ronaldo-kisses-best-friends-forever-champions-league-trophy-2591233-2024-08-31",
      "headline": "Watch: Cristiano Ronaldo kisses 'best friends forever' Champions League trophyCristiano Ronaldo shared a special video of him posing with the Champions League trophy. He was honoured by the UEFA President during the Champions League draw.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-stunned-alexei-popyrin-fails-fourth-round-18-years-2591231-2024-08-31",
      "headline": "Novak Djokovic stunned, fails to reach US Open 4th round for 1st time in 18 yearsUS Open 2024: Novak Djokovic lost to Alexei Popyrin in the third round on Friday in one of the biggest upsets in the tournament. He failed to reach the fourth round of the Grand Slam for the first time in 18 years. The defeat comes a day after 3rd seed Carlos Alcaraz was knocked out in the second round. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}