{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-surges-as-trump-hits-pause-on-tariffs-dow-jumps-over-2300-points-glbs-2706665-2025-04-09",
      "headline": "Wall Street surges as Trump hits pause on tariffs, Dow jumps over 2,300 pointsWall Street jumped after President Trump paused new tariffs for 90 days, easing trade worries. Big tech companies like Apple and Nvidia led the gains. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-over-350-points-nifty-below-22500-banking-stocks-down-2706416-2025-04-09",
      "headline": "Sensex falls over 350 points, Nifty below 22,500; banking stocks downThe S&P BSE Sensex was down 379.73 points to close at 73,847.15, while the NSE Nifty50 lost 136.70 points to end at 22,399.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-rajdhani-to-vande-bharat-investor-criticises-india-lag-in-train-tech-2706391-2025-04-09",
      "headline": "From Rajdhani to Vande Bharat: Investor criticises India's lag in train techWhen Rajdhani was launched in 1969, it placed India among Asia's fastest rail nations, second only to Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-governor-sanjay-malhotra-us-tariff-impact-worried-over-growth-than-inflation-2706354-2025-04-09",
      "headline": "RBI Governor says US tariff impact on growth bigger worry than inflationThe RBI's rate cut comes at a time when inflation appears to be under control, but economic growth faces risks from global uncertainty after US tariffs imposed by President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-impact-market-banking-stocks-down-reason-here-why-bank-margins-2706331-2025-04-09",
      "headline": "RBI rate cut brings relief for borrowers, but banking stocks tumble. Here's whyBanking stocks, especially public sector lenders, took a sharp hit after the rate cut announcement. The Nifty Bank index was down nearly 1%, with major losers including Bank of Baroda, Canara Bank, Punjab National Bank, and SBI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-6-key-takeaways-from-mpc-meeting-governor-sanjay-malhotra-announces-april-9-2025-2706322-2025-04-09",
      "headline": "RBI monetary policy: 6 key takeaways from MPC meetingWith the repo rate cut, borrowing costs for home and personal loans are likely to fall. This would provide a big relief to the homebuyers and could boost the housing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-5-key-development-reforms-you-must-know-2706284-2025-04-09",
      "headline": "RBI MPC meeting: 5 key development reforms you must knowCurrently, UPI payments are mostly capped at Rs 1 lakh for both P2P and P2M. The RBI has suggested that National Payments Corporation of India (NPCI) may now review and revise these limits based on evolving user needs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-cuts-repo-rate-by-25-bps-to-6-gdp-forecast-lowered-to-65-for-fy26-ytvd-2706254-2025-04-09",
      "headline": "RBI cuts Repo Rate by 25 points to 6% amid global trade warThe Reserve Bank of India has cut the repo rate by 25 basis points to 6%, potentially leading to lower EMIs for home loans. The RBI has also lowered the GDP forecast for FY26 to 6.5% from the earlier 6.7%. The Monetary Policy Committee unanimously decided to change the stance from neutral to accommodative, hinting at possible further easing. The RBI Governor expressed concerns over global trade uncertainties and their potential impact on inflation and growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-rate-cut-6-percent-25-bps-home-auto-loan-emis-likely-to-get-cheaper-2706246-2025-04-09",
      "headline": "Cheaper home, auto loan EMIs after RBI rate cut. What it means for youRBI reduces key lending rate to 6%. Lower interest rates are expected to make borrowing cheaper, which can help people buy homes or vehicles more easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-central-bank-moves-from-neutral-to-accommodative-stance-2706237-2025-04-09",
      "headline": "RBI changes stance from neutral to accommodative: What does it mean?The Reserve Bank of India (RBI) Governor Sanjay Malhotra has announced a cut in the repo rate by 25 basis points, bringing it down from 6.25% to 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-gdp-forecast-reduces-fiscal-2025-2026-65-per-cent-from-67-per-cent-donald-trump-us-tariff-war-2706227-2025-04-09",
      "headline": "RBI downgrades 2025-26 GDP forecast to 6.5% from 6.7% amid global tariff warWhile sharing the new projections, Governor Sanjay Malhotra said the downward revision of the GDP forecast was mainly due to growing risks in global trade and policy developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/donald-trumps-26-per-cent-reciprocal-tariffs-on-india-come-into-effect-2706214-2025-04-09",
      "headline": "Donald Trump's 26% reciprocal tariffs on India come into effectA 26% tariff on Indian exports to the USA has come into effect. Key sectors impacted include electronics, gems and jewellery, auto components, and agricultural products. The Union Cabinet is set to meet to discuss India's strategy and the impact on exporters. The Indian government is in touch with exporters to minimise the impact, while also working on a bilateral trade agreement with the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-mpc-meeting-cuts-key-rates-again-second-consecutive-time-25-bps-6-per-cent-2706220-2025-04-09",
      "headline": "Home loans to get cheaper as RBI cuts key lending rate by 25 basis points to 6%RBI MPC meeting: This is the second rate cut in a row, following a 25 basis point reduction in February. RBI also changed its earlier stance from neutral to 'accommodative'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-indian-exports-imports-26-per-cent-come-into-effect-government-meeting-narendra-modi-2706212-2025-04-09",
      "headline": "Trump's 26% tariffs on India come into effect, big Cabinet meet todayWith markets in a free fall since Donald Trump's reciprocal tariff announcement, the Union Cabinet will hold a crucial meeting today to strategise on ways to minimise the impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-down-300-points-nifty-below-22500-as-investors-await-rbi-mpc-announcements-2706203-2025-04-09",
      "headline": "Sensex, Nifty open lower as RBI policy and global cues weigh on investorsThe S&P BSE Sensex fell by 255.49 points to 73,971.59, while the NSE Nifty50 lost 86.70 points to 22,449.15 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-will-home-loans-get-cheaper-policy-announcement-today-rate-cut-25-bps-2706195-2025-04-09",
      "headline": "RBI MPC: Will home loans get cheaper after today's policy announcement?RBI MPC meeting: In its last meeting held in February, the RBI cut the repo rate by 25 basis points. This was the first rate cut under RBI Governor Sanjay Malhotra, and also the first cut in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-opening-april-9-rbi-mpc-decision-pause-dalal-street-rally-2706183-2025-04-09",
      "headline": "Stock market today: Will RBI MPC decision pause Sensex, Nifty rally?The Sensex and Nifty ended Tuesday's session with big gains, but a global sell-off and worries about trade tensions are expected to affect today's opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-9-shares-in-focus-today-ntpc-adani-wilmar-vodafone-idea-bpcl-trump-tariff-sensex-nifty-2706171-2025-04-09",
      "headline": "Stocks to watch on April 9: NTPC, Adani Wilmar, Vodafone Idea, BPCLIn today's trade, many shares will be in focus due to key news developments. These include NTPC, BPCL, Adani Wilmar, Vodafone Idea, Cyient, PNB Housing Finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-lowest-close-one-year-reciprocal-tariffs-donald-trump-hopes-fading-2706141-2025-04-09",
      "headline": "S&P 500 hits lowest level in one year as hopes for Trump tariff relief fadeThe S&P 500 reached its lowest level in nearly a year after it reversed a strong morning rally, as hopes faded for any concessions or delays on President Donald Trump's global tariffs on US's trading partners set to come into effect on April 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-dow-jones-nasdaq-sp-500-sensex-nifty-prediction-rally-to-continue-2706027-2025-04-08",
      "headline": "US markets gain sharply on hopes of tariff talks: Will Dalal Street continue rally?If Wall Street wraps up today's session on a strong note, it could deliver a big dose of confidence to investors worldwide, especially in Asian markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opening-us-markets-rally-as-dow-jones-jumps-1100-points-nasdaq-sp-surge-3-percent-2706016-2025-04-08",
      "headline": "US markets rally as Dow Jones jumps 1,100 points, Nasdaq, S&P surge 3%The surge in US stocks came as investors looked for any indication that the US might be open to easing some of its tougher tariffs through negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opting-for-new-tax-regime-know-about-this-rs-7000-post-office-savings-benefit-2705963-2025-04-08",
      "headline": "Opting for new tax regime? Know about this Rs 7,000 post office savings benefitAs per a government notification issued back in 2011, interest from post office savings accounts is exempt under Section 10(15) of the Income Tax Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-with-1000-points-gain-nifty-closes-above-22500-as-dalal-street-shrugs-off-tariff-threat-2705854-2025-04-08",
      "headline": "Sensex, Nifty end higher on global recovery and RBI rate cut expectationsThe S&P BSE Sensex added 1,089.18 points to close at 74,227.08, while the NSE Nifty5o gained 374.25 points to end at 22,535.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-rate-cut-announcement-april-9-sanjay-malhotra-what-to-expect-25-bps-2705847-2025-04-08",
      "headline": "RBI MPC to announce decision on April 9: Will there be a rate cut?Since the last MPC meeting, held in February 2025, a lot of things have changed, both positive and negative. While inflation has come down, and growth has started to pick up, there are fresh worries about the global economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-businessmen-slam-us-president-bill-ackman-jamie-dimon-good-import-2705835-2025-04-08",
      "headline": "'Economic nuclear war': Billionaire business titans slam Trump's tariff gambitDonald Trump's tariff agenda is fracturing elite support, with top businessmen — from Bill Ackman to Jamie Dimon — warning it risks recession, inflation, and global instability. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hotmail-co-founder-sabeer-bhatia-on-indian-engineers-99-percent-start-giving-gyaan-2705785-2025-04-08",
      "headline": "Hotmail co-founder Sabeer Bhatia on Indian engineers: '99% start giving gyaan'Sabeer Bhatia pointed out that in India, people respect those who talk business, not those who write code or build software. This mindset, he says, is stopping India from becoming a hub of innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-1600-points-nifty-rise-500-stocks-driving-rally-titan-zomato-infosys-sbi-hcltech-2705770-2025-04-08",
      "headline": "Sensex up 1,600 points: Which stocks are driving the rally on Dalal Street?Markets saw a huge rebound from yesterday's crash as they staged a robust recovery as no stocks on the Sensex of Nifty50 traded in red in the afternoon session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jpmorgan-jamie-dimon-ceo-donald-trump-tariff-war-us-recesion-slow-growth-economic-concern-stronger-india-ties-2705740-2025-04-08",
      "headline": "Trump's tariff war may backfire, says JPMorgan CEO, urges stronger India tiesJPMorgan CEO, Jamie Dimon, explained that higher costs of imported goods would affect consumers, while increased demand for local products could also drive prices up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-centre-studying-global-models-to-manage-ups-pool-corpus-2705732-2025-04-08",
      "headline": "Unified Pension Scheme: Centre studying global models to manage UPS pool corpusThe government aims to create proper rules for investing the extra contribution made by it in a separate pension fund called the pool corpus under the newly launched Unified Pension Scheme (UPS).     "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japan-nikkei-leads-asia-recovery-as-us-mulls-softer-tariff-approach-2705703-2025-04-08",
      "headline": "Japan's Nikkei leads Asia's recovery as hopes rise for softer tariff approachA 5.6% rebound in Japan's Nikkei far outpaced other regional markets, with Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer tasked with leading trade negotiations with Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/titan-share-price-jump-stock-rise-7-percent-q4-update-market-rally-sensex-nifty-2705705-2025-04-08",
      "headline": "Explained: Why Titan share price jumped 7% after hitting 52-week lowThe recovery in Titan share price came just a day after the stock touched its 52-week low of Rs 2,947.55. In the morning session, Titan shares climbed to a high of Rs 3,222, providing some relief to investors after a tough few months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-jump-stock-market-rising-today-why-reasons-trump-tariff-recovery-global-2705663-2025-04-08",
      "headline": "Sensex, Nifty in green: Why is stock market rising today? 3 things to knowSensex, Nifty today: Tracking global markets that showed signs of recovery, Sensex and Nifty surged more than 1.5% in early trade, shaking off fears that had weighed heavily just a day earlier, with early buying seen across most sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-over-1000-points-nifty-above-22500-as-d-street-recovers-mirroring-global-markets-2705644-2025-04-08",
      "headline": "Sensex, Nifty gain as global markets recover from Trump's tariff shockThe S&P BSE Sensex surged 1,217.78 points to 74,355.68, while the NSE Nifty50 gained 380.50 points to 22,542.10 as of 9:35 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-8-global-market-recovery-dalal-street-opening-2705630-2025-04-08",
      "headline": "Global markets show signs of recovery. Will Sensex and Nifty gain today?A slight improvement in global markets, especially in the US and Asia, has brought some hope after the recent sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-focus-april-8-mm-bel-adani-ports-tata-motors-sensex-nifty-2705615-2025-04-08",
      "headline": "Stocks to watch on April 8: M&M, BEL, Adani Ports, Tata Motors, TitanInvestors are likely to keep a close eye on Tuesday's market, looking for signs of a rebound. Asian markets opened higher, offering some relief after a choppy session in the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-markets-slip-volatile-day-donald-trump-reciprocal-tariffs-announcement-trade-war-china-2705585-2025-04-08",
      "headline": "Wall Street's fear gauge spikes, stocks sink as Trump stands firm on tariffsWall Street equities have been hammered since US President Donald Trump's sweeping tariffs, announced on April 2, on all imports into the US and much higher levies on some major trading partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-market-reacted-briefly-to-donald-trump-tariff-pause-rumour-glbs-2705576-2025-04-08",
      "headline": "How market reacted briefly to Donald Trump tariff pause rumourA misinterpreted comment about Trump pausing tariffs briefly sent markets soaring before crashing. Social media spread the false claim, prompting a quick White House denial that ended the short-lived rally.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-down-index-down-sp-500-dow-jones-what-it-means-for-sensex-nifty-dalal-street-2705521-2025-04-07",
      "headline": "Wall Street slides again on tariff fears; will Sensex, Nifty follow suit?Wall Street remained weak on Monday, with all three major indexes falling for a third straight session. The drop came after US President Donald Trump announced a new round of heavy tariffs on imports, which led to retaliation from major trade partners, including China."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stocks-wall-street-donald-trump-tariffs-sp-500-nasdaq-dow-all-down-2705444-2025-04-07",
      "headline": "S&P 500 rebounds after early trade fall in volatile US market sessionThe S&P 500 has dropped 20% from its peak closing level reached in February. If it finishes at this level or lower, it would officially mark the start of a bear market from February onward."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-cylinders-price-hike-by-rs-50-each-ujwala-non-ujwala-consumers-2705343-2025-04-07",
      "headline": "LPG cylinder prices hiked by Rs 50 for both subsidised, non-subsidised consumersThe government has hiked LPG prices to recover past losses, pushing up household cooking costs at a time of rising economic uncertainty and global trade tensions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/supermodel-gigi-hadid-reveals-how-she-met-her-current-boyfriend-bradley-cooper-glbs-2706693-2025-04-10",
      "headline": "Supermodel Gigi Hadid reveals how she met her current boyfriend Bradley CooperGigi Hadid opens up in Vogue about how she met Bradley Cooper at a backyard party, sharing insights into their low-key romance and the challenges of dating in the spotlight.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tracee-ellis-ross-wows-in-burnt-orange-leather-on-good-morning-america-glbs-2706692-2025-04-10",
      "headline": "Tracee Ellis Ross wows in burnt orange leather on Good Morning AmericaTracee Ellis Ross stunned on Good Morning America in a burnt orange leather ensemble and Bottega Veneta heels while promoting Black Mirror Season 7 with Rashida Jones, impressing fashion watchers once again.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/beyonce-fans-can-win-concert-tickets-in-cowboy-carter-fashion-sweepstakes-glbs-2706691-2025-04-10",
      "headline": "Beyoncé fans can win concert tickets in Cowboy Carter fashion sweepstakesBeyoncé's Cowboy Carter album has inspired a handmade fashion sweepstakes by MakerPlace. Fans can design outfits for a chance to win concert tickets and $3,000. Entries close this Friday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tahira-kashyap-shares-health-update-after-breast-cancer-relapse-2706663-2025-04-09",
      "headline": "Back home, recovering: Tahira Kashyap shares health update after cancer relapseFilmmaker Tahira Kashyap shared a post and updated fans about her health after her breast cancer relapse. She thanked her fans anf followers for their unconditional support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-grooves-to-dhol-at-son-sunny-deols-jaat-premiere-2706651-2025-04-09",
      "headline": "Dharmendra grooves to dhol beat at son Sunny Deol's Jaat premiere. WatchVeteran actor Dharmendra stole the limelight with his dance at son Sunny Deol's Jaat premiere in Mumbai. The film will release in theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-mari-selvaraj-reunite-after-four-years-for-d56-2706640-2025-04-09",
      "headline": "Dhanush, Mari Selvaraj reunite after four years for 'D56'Dhanush has teamed up with director Mari Selvaraj for his next film. Tentatively titled D56, the movie will be produced by Ishari Ganesh under Vels Films International. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-2-in-works-brad-pitt-production-plan-b-entertainment-in-talks-with-netflix-for-sequel-2706624-2025-04-09",
      "headline": "Adolescence 2 in works? Brad Pitt's production in talks with Netflix for sequelNetflix's popular series, Adolescence, is in talks for a second season. The producers are in discussions with the streaming giant for the second season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tabu-haider-reunion-with-shahid-kapoor-vishal-bhardwaj-2706579-2025-04-09",
      "headline": "Tabu's Haider reunion with 'Laqt-e-jigars' Shahid Kapoor, Vishal BhardwajThe versatile Tabu on Wednesday shared a reunion photo from her meeting with Haider cast, including former co-star Shahid Kapoor and director Vishal Bhardwaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-sidharth-malhotra-nail-veer-pahariya-viral-one-leg-dance-maddock-2706595-2025-04-09",
      "headline": "Varun Dhawan, Sidharth Malhotra nail Veer Pahariya's viral one-leg dance. WatchVarun Dhawan and Sidharth Malhotra's video from Maddock's success bash has gone viral. The two actors aced Veer Pahariya's viral one-leg dance step. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-prithviraj-sukumaran-starts-filming-for-nobody-mahurat-parvathy-thiruvothu-2706577-2025-04-09",
      "headline": "After Empuraan, Prithviraj Sukumaran starts filming for Nobody. See mahurat picsPrithviraj Sukumaran has finally begun for his next film, titled Nobody, after Empuraan. The actor shared pictures from the mahurat ceremony on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/black-warrant-actor-paramvir-singh-calls-border-2-co-star-sunny-deol-shy-2706560-2025-04-09",
      "headline": "Black Warrant actor Paramvir Singh calls Border 2 co-star Sunny Deol shy, humbleBlack Warrant actor Paramvir Singh Cheema is excited about making his big Bollywood debut with Varun Dhawan and Sunny Deol. The actor was last seen in Chamak 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-breaks-down-in-first-video-since-latent-row-says-she-felt-unsafe-2706562-2025-04-09",
      "headline": "Apoorva Mukhija breaks down in first video since Latent row, says she felt unsafeSocial media sensation Apoorva Mukhija broke down during her first Instagram video after the India's Got Latent controversy. The YouTuber spoke about how she felt unsafe after the row. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/crayon-shin-chan-our-dinosaur-diary-theatrical-release-india-first-time-2706551-2025-04-09",
      "headline": "Miss watching Shin-chan in summer vacation? Now you can with Our Dinosaur DiaryRelive your childhood memories with the new Shin-chan movie, now playing in Indian cinemas for the first time. After conquering the Japanese box office, Shin-chan: Our Dinosaur Diary was released today, May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mm-keeravani-privileged-to-meet-father-of-mp3-karlheinz-brandenburg-2706498-2025-04-09",
      "headline": "MM Keeravani 'privileged' to meet Father of MP3 Karlheinz BrandenburgOscar-winning music composer MM Keeravani recently met Karlheinz Brandenburg, the 'Father of MP3'. Sharing his heartfelt emotions about meeting the legend, he also posted a picture with him. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manoj-manchu-protests-outside-father-mohan-babus-home-says-i-have-no-place-to-go-2706490-2025-04-09",
      "headline": "Manoj Manchu protests outside father Mohan Babu's home: Have no place to goActor Manchu Manoj staged a protest outside his father Mohan Babu's residence in Jalpally, citing that he has nowhere to go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohan-babu-vishnu-manchu-kannappa-team-meet-cm-yogi-adityanath-reveal-new-release-date-2706495-2025-04-09",
      "headline": "Mohan Babu, Vishnu Manchu meet Yogi Adityanath, share Kannappa's release dateThe Kannappa team, including Mohan Babu and Vishnu Manchu, visited Uttar Pradesh chief minister Yogi Adityanath in Lucknow. They unveiled a poster and the new release date for their film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/rajinikanth-controversial-1995-baashha-event-speech-led-to-rift-with-late-tn-cm-jayalalithaa-2706489-2025-04-09",
      "headline": "30 years after fallout, Rajinikanth reveals why he spoke against JayalalithaaSuperstar Rajinikanth opened up about what influenced his stance against late Tamil Nadu chief minister Jayalalithaa. He described how his critical comment led to the sacking of a minister, which shaped his opposition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/it-ends-with-us-actor-responds-to-blake-livelys-lawsuit-i-was-surprised-2706428-2025-04-09",
      "headline": "It Ends With Us actor responds to Blake Lively's lawsuit: I was surprisedActor Adam Mondschein has publicly responded to Blake Lively's lawsuit allegations regarding an uncomfortable filming experience in It Ends With Us. Mondschein refuted Lively's claims, stating his perspective of the events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-last-of-us-primer-pedro-pascal-bella-ramsey-2706467-2025-04-09",
      "headline": "The Last of Us: A primer to Pedro Pascal series that took TV by stormHBO's The Last of Us, which released in 2023, is a remarkable and unlikely dystopian show that graced modern television. It makes a return next week. Ahead of The Last of Us Season 2 premiere, here is a quick recap of events that unfolded in the first season. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-china-us-tariff-war-pause-90-day-india-canada-2706648-2025-04-09",
      "headline": "Trump announces 90-day tariff pause, but hikes China levy to 125%US President Donald Trump paused his newly introduced reciprocal tariffs on most countries for 90 days, retaining a reduced 10% rate, while sharply raising tariffs on China to 125%, escalating tensions with Beijing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/2611-tahawwur-rana-extradition-tihar-jail-trial-delhi-nia-court-2706608-2025-04-09",
      "headline": "Tahawwur Rana, extradited to India from US, to be kept in Tihar jail: SourcesThe terror attack mastermind will undergo a trial at a special NIA court in Delhi. Since the case will now be heard in Delhi, he will not be sent to Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-to-revoke-visas-green-cards-over-pro-terror-antisemitic-social-media-posts-glbs-2706690-2025-04-10",
      "headline": "US to deny visas, green cards over pro-terror, antisemitic social media postsUSCIS will now deny or revoke visas based on social media posts supporting antisemitic terrorism. The immediate policy shift targets online speech and follows recent arrests of pro-Palestinian student activists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/10-years-of-beti-bachao-beti-padhao-vanishing-daughters-haryana-genocide-sex-verification-2706510-2025-04-09",
      "headline": "The vanishing daughters: 10 years of Beti Bachao Beti PadhaoFor ten years, a campaign to save the girl child has occupied walls, been heard in slogans, and spoken as a promise. But behind the posters and promises lies a brutal truth—girls are still being erased before they are born, and those who survive often live in fear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congresss-bid-to-reclaim-sardar-vallabhbhai-patel-be-asardar-or-is-it-too-little-too-late-bjp-narendra-modi-gujarat-2706504-2025-04-09",
      "headline": "Congress at Patel chowk, will it take the revival turn?With an AICC meeting in Gujarat after 64 years, the Congress is trying to make the state a laboratory for its revival. With symbolism and a resolution, the Congress is trying to reclaim the legacy of Sardar Patel, who has been co-opted by the BJP, and used against the Nehru-Gandhi family. Is the Congress's bid too little too late?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kash-patel-removed-as-acting-atf-director-replaced-by-daniel-driscoll-glbs-2706694-2025-04-10",
      "headline": "Kash Patel removed as acting chief of firearms, alcohol regulatory body: ReportFBI Director Kash Patel has been removed as acting ATF chief and replaced by Army Secretary Daniel Driscoll. The Justice Department says the move wasn't performance-related, but no reason was given.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heatwave-conditions-punjab-haryana-delhi-india-imd-rain-thunderstorm-forecast-2706706-2025-04-10",
      "headline": "Fresh heatwave likely in Punjab, Haryana next week; rain may lash Delhi todayDelhi, which has been sweltering under heatwave conditions for three days, is likely to witness rain on Thursday and Friday. Meanwhile, a fresh heatwave spell is expected in Punjab, Haryana and Rajasthan on April 14 and 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tiktok-us-deal-still-on-the-table-says-trump-amid-china-trade-war-glbs-2706700-2025-04-10",
      "headline": "TikTok US deal still on the table, says Trump amid China trade warTrump says the TikTok US deal remains possible despite delays. The divestment deadline is now June 19. Legal and political opposition grows as China signals resistance amid rising trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-beijing-isnt-blinking-in-trade-war-against-trump-2706355-2025-04-09",
      "headline": "Why Beijing isn't blinking in trade war against TrumpIn retaliation for Trump's additional 50 per cent tariff on China, which pushed the total to a staggering 104 per cent, Beijing has announced tariffs of up to 84 per cent on US goods, effective Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-bjd-battles-waqf-bill-fire-why-fingers-are-pointing-to-vk-pandian-2706277-2025-04-09",
      "headline": "As BJD battles Waqf bill fire, why fingers are pointing to VK PandianThe discord is ill-timed for a party trying to rebuild after losing power in Odisha, with a damaging perception of powers at work from behind the scenes\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/amid-tariff-hikes-amazon-cuts-some-inventory-orders-from-china-glbs-2706679-2025-04-10",
      "headline": "Amid tariff hikes, Amazon cuts some inventory orders from ChinaAmazon has abruptly cancelled product orders from China and other Asian countries, likely in response to new US tariffs. This has left sellers with extra products that they can't sell easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-donald-trump-explains-90-day-tariff-pause-says-people-were-getting-yippy-glbs-2706696-2025-04-10",
      "headline": "Watch: Donald Trump explains 90-day tariff pause, says people were getting 'yippy'President Trump hit pause on reciprocal tariffs for 90 days, saying it was a move to ease market nerves. China retaliated with higher tariffs, while the US signalled it would pursue one-on-one talks with its allies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-pre-marriage-counselling-needs-to-be-non-negotiable-in-india-2706545-2025-04-09",
      "headline": "Why pre-marriage counselling needs to be non-negotiable in IndiaNeither men nor women today want to be coerced into an incompatible marriage or, if things go south, simply accept it as their fate. Things are changing, evolving for the better, which is why, now more than ever, pre-marriage counselling should be non-negotiable in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/far-right-influencer-laura-loomer-urges-trump-to-ban-all-chinese-students-in-us-glbs-2706687-2025-04-10",
      "headline": "Far-right influencer close to Trump calls for ban on Chinese students in USFar-right commentator Laura Loomer urged Trump to ban all Chinese students in the US. Her remark came as Trump paused tariffs for 90 days but raised China's to 125%.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-tahawwur-rana-extradition-us-mumbai-terror-attacks-plotters-pakistan-terrorists-2706666-2025-04-10",
      "headline": "Illustration: India gets Tahawwur Rana. What about other 26/11 plotters?Tahawwur Rana's extradition to India by the US brings another question to the forefront: Where are the other accused? What are they up to now? Have they faced justice for the 26/11 carnage yet?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-stock-markets-dow-nasdaq-sp-500-green-benchmark-donald-trump-tariff-pause-2706689-2025-04-10",
      "headline": "After 4 days, US markets back in green after Trump's tariff U-turnUS stock markets ended green after a four-day drop following President Donald Trump's announcement to pause tariffs for 90 days on several countries, excepting those on China, which he raised further."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/mohanlal-empuraan-success-sikandar-failure-bollywood-crisis-2706385-2025-04-09",
      "headline": "How Empuraan's success, Sikandar's failure highlight Bollywood's content crisisMohanlal's 'Empuraan' and Salman Khan's 'Sikandar' clashed at the box office this March. The stark contrast in the films' results exposes serious issues in Bollywood at large."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-reservation-sc-st-obc-50-per-cent-cap-caste-census-ahmedabad-session-congress-2706632-2025-04-09",
      "headline": "Rahul Gandhi vows to 'demolish' wall limiting reservations to 50%Rahul Gandhi vowed to dismantle the 50 per cent cap on reservations for SCs, STs, and OBCs in education and government jobs, citing Telangana's model and calling for a nationwide caste census to ensure greater representation for marginalised communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-attacks-plotter-2611-delhi-tihar-jail-extradition-us-david-headley-2706682-2025-04-10",
      "headline": "From Pak Army doctor to 26/11 attacks plotter: Who is Tahawwur RanaTahawwur Rana, a former Pakistan Army doctor accused of plotting the 2008 Mumbai terror attacks, is set to land in Delhi on Thursday afternoon. He was arrested by the FBI in 2009 and was lodged in a prison in the US before his extradition to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/not-all-kidney-stones-dissolve-with-medicines-five-myths-undone-2706335-2025-04-09",
      "headline": "Not all kidney stones dissolve with medicines: Five myths undoneMisconceptions are as common as kidney stones themselves. Here are facts about how they form and should be diagnosed and treated\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/namita-thapar-reacts-to-hotmail-co-founder-indian-engineers-giving-gyaan-remark-2706396-2025-04-09",
      "headline": "Namita Thapar reacts to Hotmail co-founder's 'Indian engineers giving gyaan' remarkSabeer Bhatia said earlier this week that \"99% of Indians who graduate as engineers join management and start giving gyaan to everybody.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-crashes-out-of-monte-carlo-masters-after-loss-vs-alejandro-tabilo-2706673-2025-04-10",
      "headline": "Djokovic crashes out of Monte Carlo masters after 2nd straight loss to TabiloNovak Djokovic crashed out of the Monte Carlo Masters following a 3-6, 4-6 loss against unseeded Alejandro Tabilo in the second round on Wednesday. Following his win, Tabilo maintained a remarkable 100% win record over Djokovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-does-china-import-from-us-that-could-take-a-hit-in-tariff-war-glbs-2706703-2025-04-10",
      "headline": "What does China import from US that could take a hit in tariff war?US President Trump paused his 90-day reciprocal tariff just a day after launch, while hiking China tariffs to 125%. China hit back with 84% tariffs on US goods, escalating trade tensions and threatening jobs tied to $145B in US exports to China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/no-candidate-found-suitable-promotion-district-judge-rajasthan-high-court-competitive-exam-2706686-2025-04-10",
      "headline": "None found suitable for promotion as district judge in Rajasthan: Not 1st instanceThe Rajasthan High Court notified that the result of the written examination for promotion in the cadre of district judge by way of limited competitive examination, 2024, was declared as \"none found suitable\"."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/badminton-asia-championship-pv-sindhu-second-round-ester-wardoyo-2706674-2025-04-10",
      "headline": "Badminton Asia Championship: Sindhu reaches 2nd round with straight-sets winIndia's PV Sindhu made it to the second round of the Badminton Asia Championship on Wednesday, April 9. Sindhu defeated Ester Wardoyo of Indonesia in straight sets to make it to the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-crashes-out-of-monte-carlo-masters-after-loss-vs-alejandro-tabilo-2706673-2025-04-10",
      "headline": "Djokovic crashes out of Monte Carlo masters after 2nd straight loss to TabiloNovak Djokovic crashed out of the Monte Carlo Masters following a 3-6, 4-6 loss against unseeded Alejandro Tabilo in the second round on Wednesday. Following his win, Tabilo maintained a remarkable 100% win record over Djokovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-sanju-samson-chasing-ahmedabad-2706672-2025-04-10",
      "headline": "GT vs RR: Rajasthan skipper Samson defends decision to bowl first in AhmedabadRajasthan Royals skipper Sanju Samson defended the decision to bowl first in Ahmedabad after their loss to Gujarat Titans on Wednesday, April 9. RR lost their third game in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-prasidh-krishna-shimron-hetmyer-gt-vs-rr-2706654-2025-04-09",
      "headline": "IPL 2025 GT vs RR: All-round Gujarat Titans hammer Rajasthan Royals to top tableGujarat Titans (GT) continued their winning run in the Indian Premier League 2025 (IPL 2025), beating Rajasthan Royals (RR) by 58 runs at the Narendra Modi Stadium in Ahmedabad. Sai Sudharsan was the star of the show with his magnificent innings of 82 (53) while Prasidh Krishna emerged as the pick of the bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/los-angeles-olympics-2028-archery-compund-mixed-team-medal-added-2706659-2025-04-09",
      "headline": "Compound archery added to Olympics 2028: Why it's a big boost to India's hopesThe Los Angeles Olympics in 2028 will feature the mixed team compound archery event in addition to the five recurve events. For the first time since the reintroduction of archery in 1972 in the Olympics, a new bow style has been added to the Games. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-rr-riyan-parag-angry-dismissal-ahmedabad-2706652-2025-04-09",
      "headline": "GT vs RR: Riyan Parag smashes bat in anger following controversial dismissalRiyan Parag was left fuming and smashed his bat in anger after being dismissed in controversial fashion against Gujarat Titans on April 9. Riyan was dismissed for 26 runs during the tough run chase against GT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yashasvi-jaiswals-catch-ruins-rashid-khans-no-look-shot-2706639-2025-04-09",
      "headline": "Watch: Yashasvi Jaiswal's spectacular catch ruins Rashid Khan's 'no-look' shotRajastha Royals batter Yashasvi Jaiswal took a stunning diving catch to dismiss Rashid Khan during Match 23 of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-upper-hand-over-dc-theyre-only-relying-on-only-3-players-jitesh-sharma-2706625-2025-04-09",
      "headline": "We've upper hand over DC, they're only relying on 3 players: Jitesh SharmaRoyal Challengers Bengaluru (RCB) wicketkeeper batter feels his team has the upper hand over Delhi Capitals (DC) in their upcoming clash at the M. Chinnaswamy Stadium in Bengaluru as they're not dependent on only three players like DC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-on-dinesh-karthik-rcb-vs-dc-2706604-2025-04-09",
      "headline": "Jitesh Sharma aiming to become 360-degree player under Dinesh Karthik at RCBRoyal Challengers Bengaluru (RCB) wicketkeeper batter Jitesh Sharma has opened up on his training regime under batting coach and mentor Dinesh Karthik, who wants to make him a 360-degree player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-dc-kl-rahul-batting-spot-matthew-mott-press-conference-2706601-2025-04-09",
      "headline": "RCB vs DC: Class player KL Rahul has ability to bat anywhere, says Matthew MottDelhi Capitals assistant coach Matthew Mott feels that KL Rahul has the ability to bat anywhere in the lineup for the team ahead of their clash against RCB on April 10. Rahul has batted at No.4 and then opened the batting for DC in their win against CSK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-caratini-delivers-winning-hit-for-houston-astros-against-seattle-mariners-glbs-2706593-2025-04-09",
      "headline": "MLB: Caratini delivers winning hit for Houston Astros against Seattle MarinersThe Houston Astros defeated the Seattle Mariners on Tuesday, April 8 after Victor Caratini hit the winning RBI single in the top of the 12th innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yashasvi-jaiswals-catch-ruins-rashid-khans-no-look-shot-2706639-2025-04-09",
      "headline": "Watch: Yashasvi Jaiswal's spectacular catch ruins Rashid Khan's 'no-look' shotRajastha Royals batter Yashasvi Jaiswal took a stunning diving catch to dismiss Rashid Khan during Match 23 of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-upper-hand-over-dc-theyre-only-relying-on-only-3-players-jitesh-sharma-2706625-2025-04-09",
      "headline": "We've upper hand over DC, they're only relying on 3 players: Jitesh SharmaRoyal Challengers Bengaluru (RCB) wicketkeeper batter feels his team has the upper hand over Delhi Capitals (DC) in their upcoming clash at the M. Chinnaswamy Stadium in Bengaluru as they're not dependent on only three players like DC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-on-dinesh-karthik-rcb-vs-dc-2706604-2025-04-09",
      "headline": "Jitesh Sharma aiming to become 360-degree player under Dinesh Karthik at RCBRoyal Challengers Bengaluru (RCB) wicketkeeper batter Jitesh Sharma has opened up on his training regime under batting coach and mentor Dinesh Karthik, who wants to make him a 360-degree player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-dc-kl-rahul-batting-spot-matthew-mott-press-conference-2706601-2025-04-09",
      "headline": "RCB vs DC: Class player KL Rahul has ability to bat anywhere, says Matthew MottDelhi Capitals assistant coach Matthew Mott feels that KL Rahul has the ability to bat anywhere in the lineup for the team ahead of their clash against RCB on April 10. Rahul has batted at No.4 and then opened the batting for DC in their win against CSK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-caratini-delivers-winning-hit-for-houston-astros-against-seattle-mariners-glbs-2706593-2025-04-09",
      "headline": "MLB: Caratini delivers winning hit for Houston Astros against Seattle MarinersThe Houston Astros defeated the Seattle Mariners on Tuesday, April 8 after Victor Caratini hit the winning RBI single in the top of the 12th innings."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}