{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-288-points-lower-nifty-settles-below-25-500-tata-steel-down-4-percent-2749530-2025-07-02",
      "headline": "Sensex ends 288 points lower, Nifty settles below 25, 500; Tata Steel down 4%The S&P BSE Sensex was down 287.60 points to end at 83,409.69, while the NSE Nifty50 lost 88.40 points to end at 25,453.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-expert-explains-how-rs-7-lakh-profit-led-to-a-rs-74000-shock-for-investor-2749447-2025-07-02",
      "headline": "Investor earns Rs 7 lakh, faces Rs 74,000 tax despite Rs 12 lakh limit. Know whySujit Bangar, founder of TaxBuddy.com and a former IRS officer, shared the example on LinkedIn to warn investors against a common misconception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-finance-epfo-pf-account-balance-check-regularly-company-deposit-kyc-issue-money-savings-2749438-2025-07-02",
      "headline": "Don't ignore your EPF: Here's why checking it regularly mattersExperts warn that many salaried employees don't realise until it's too late that their employer hasn't been depositing funds, or that a simple KYC error has locked their money away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-holidays-july-2025-here-is-what-traders-should-know-nse-bse-holiday-list-2749379-2025-07-02",
      "headline": "Stock market holidays July 2025: Here's what traders should knowBefore you plan your next trade or check your stocks, it helps to know if the market is open. Here's a quick look at whether the NSE and BSE will have any holidays this July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Ghee, soap and snacks to get cheaper? Big GST cut likely, say sourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wanting-to-switch-between-old-and-new-tax-regime-here-is-how-to-do-it-while-filing-itr-2749351-2025-07-02",
      "headline": "Wanting to switch tax regime? Here's how to do it while filing ITRIf you're a salaried employee with no business or professional income, you have the flexibility to choose the tax regime every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-listing-premium-13-percent-rs-835-bse-nse-hold-sell-buy-expert-view-2749322-2025-07-02",
      "headline": "HDB Financial lists at 13% premium: Should you book profit or hold?HDB Financial share price: The stock opened at Rs 835 on both the NSE and BSE, compared to its IPO price of Rs 740 per share. This was better than what the grey market had expected, which had estimated a gain of around 8% to 10% on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-classifies-reliance-communications-loan-account-as-fraud-2749309-2025-07-02",
      "headline": "SBI classifies Reliance Communications loan account as 'fraud'In a stock exchange filing, Reliance Communications stated that SBI has decided in connection with credit facilities dating back to August 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-market-debut-13-percent-premium-nse-bse-emkay-global-rating-2749304-2025-07-02",
      "headline": "HDB Financial shares make strong debut with 13% premium on stock marketHDB Financial shares listed at a premium of 13%. The stock made its debut at Rs 835 on both the NSE and BSE, marking a 12.84% gain (Rs 95) over the issue price of Rs 740."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maniesh-paul-to-play-villain-in-karan-johar-next-his-new-look-leaves-fans-curious-2749553-2025-07-02",
      "headline": "Maniesh Paul to play villain in KJo's next? His new look leaves fans curiousActor Maniesh Paul hinted at his next film by sharing photos of his new look on Instagram. The photos left fans and celebrities curious whether Paul would be playing a villain in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-breaks-netflix-records-global-streaming-success-2749578-2025-07-02",
      "headline": "Squid Game 3 breaks Netflix records with 60.1 million views in 3 days'Squid Game Season 3' has shattered Netflix records with over 60 million views in just three days. The final season strengthens the franchise's global legacy while sparking talks of a US adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-basu-credits-irrfan-for-metro-in-dino-pays-tribute-to-him-and-kk-2749513-2025-07-02",
      "headline": "Anurag Basu credits Irrfan for Metro In Dino: This film is a tribute to him and KKDirector Anurag Basu, in an interview, credited Irrfan for 'Metro In Dino'. The upcoming film is a spiritual sequel to 'Life In A Metro.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-priyanka-chopra-on-missing-hindi-films-ssmb29-and-upcoming-projects-2749595-2025-07-02",
      "headline": "Exclusive: Priyanka Chopra on missing Hindi films, SSMB29, and upcoming projectsPriyanka Chopra's latest Hollywood action-comedy 'Heads of State', co-starring John Cena and Idris Elba, is now streaming on Prime Video. In an exclusive interview with India Today, the actor opened up about her excitement for her next Indian film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-cena-credits-indian-fans-for-his-global-reach-priyanka-chopra-heads-of-state-2749575-2025-07-02",
      "headline": "Exclusive: John Cena credits Indian fans for his global reach, says is fortunateHollywood stars Priyanka Chopra and John Cena expressed deep gratitude and personal connection to India as their film 'Heads of State' released on Prime Video on July 2. Both actors cherished the warmth of Indian fans and look forward to continuing their journey with strong ties to Indian audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-the-odyssey-trailer-leaked-tom-holland-matt-damon-2749425-2025-07-02",
      "headline": "Tom Holland, Matt Damon stun in leaked trailer of Christopher Nolan's The OdysseyThe trailer for 'The Odyssey', directed by Christopher Nolan, has leaked online. The upcoming film features Tom Holland, Matt Damon, and Jon Bernthal in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-trailer-gets-a-thumbs-up-from-pawan-kalyan-watch-2749469-2025-07-02",
      "headline": "Hari Hara Veera Mallu trailer gets a thumbs-up from Pawan Kalyan. WatchWith just weeks to go for its release, the makers of 'Hari Hara Veera Mallu – Part 1' have begun full-fledged promotions. A behind-the-scenes (BTS) video of Pawan Kalyan watching the trailer has added to the hype, especially as the actor's excited response signals strong expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/peddi-is-more-exciting-than-rrr-and-rangasthalam-says-ram-charan-2749536-2025-07-02",
      "headline": "Peddi is more exciting than RRR and Rangasthalam, says Ram Charan in viral videoWhile 'Game Changer' remains a talking point even months after its release, Ram Charan has shifted focus to 'Peddi', a film he calls even more exciting than 'RRR' and 'Rangasthalam'. A viral fan meet video, shot a few months ago, captured his confidence in the Buchi Babu-directorial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-on-paresh-rawal-return-hera-pheri-3-people-going-to-laugh-2749315-2025-07-02",
      "headline": "Suniel Shetty welcomes Paresh Rawal back to Hera Pheri 3, promises big laughsActor Suniel Shetty recently reacted to his 'Hera Pheri 3' co-star Paresh Rawal's comeback in the film. He also mentioned that the under-production film is a laugh riot meant for all generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-refuses-to-remove-mask-at-airport-says-shes-unwell-watch-2749465-2025-07-02",
      "headline": "Rasha Thadani refuses to remove mask at Airport, says she's unwell. WatchActor Rasha Thadani was clicked at the Mumbai airport wearing a mask and politely informed the paparazzi that she was unwell. Despite their requests, she kept her mask on but thanked them and posed for photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-heads-of-state-role-director-ilya-naishuller-idris-elba-john-cena-2749468-2025-07-02",
      "headline": "Priyanka Chopra says Heads of State team knows value of strong female leadPriyanka Chopra, who plays the role of MI6 agent Noel Bisset in 'Heads of State', shared her views on performing high-octane action stunts in the film. The actor even credited the director Ilya Naishuller for making her character strong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-seo-yi-dies-at-43-cause-of-death-unknown-south-korean-actor-2749473-2025-07-02",
      "headline": "The Divorce Insurance actor Lee Seo-yi dies at 43, cause of death unknownSouth Korean actor Lee Seo-yi died at the age of 43 with the cause of death still unknown. Her manager shared the news on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-defends-romancing-fatima-sana-shaikh-in-thugs-of-hindostan-after-playing-her-father-2749377-2025-07-02",
      "headline": "Aamir Khan defends romancing Fatima Sana Shaikh in Thugs after playing her fatherBollywood actor Aamir Khan defended the casting of 'Thugs of Hindostan' in a recent interview. The actor shared that the director wanted to remove the romantic angle between him and Fatima Sana Shaikh, but he had no issues romancing her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-fresh-post-about-truth-after-deleting-diljit-dosanjh-post-2749453-2025-07-02",
      "headline": "Naseeruddin Shah writes about truth after deleting Diljit Dosanjh postVeteran actor Naseeruddin Shah made a cryptic post about telling the truth a day after deleting his previous post backing Diljit Dosanjh for working with Hania Aamir in 'Sardaar Ji 3' and going ahead with the overseas release of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/all-you-need-to-know-about-txts-fourth-studio-album-the-name-chapter-together-2749474-2025-07-02",
      "headline": "All you need to know about TXT's fourth studio album The Name Chapter: TOGETHERK-pop sensation TOMORROW X TOGETHER is all set to drop their much-awaited fourth studio album, The Name Chapter: TOGETHER, marking the end of their popular Name Chapter series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-jr-ntr-to-promote-war-2-separately-heres-why-2749406-2025-07-02",
      "headline": "Hrithik Roshan-Jr NTR to promote War 2 separately. Here's whyActors Hrithik Roshan and Jr NTR would only be seen fighting with each other on the big screen in 'War 2'. The makers of the film decided that it would be better if the two actors promoted the film separately to build their on-screen rivalry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-cheers-for-shanaya-kapoor-aankhon-ki-trailer-welcomes-her-to-films-2749463-2025-07-02",
      "headline": "Abhishek Bachchan cheers for Shanaya Kapoor's debut in Aankhon Ki GustaakhiyanShanaya Kapoor is all set to make her Bollywood debut with 'Aankhon Ki Gustaakhiyan'. Ahead of that, Abhishek Bachchan gave her a warm welcome, cheering for the upcoming love drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sumit-vyas-says-theatre-feels-less-pressured-more-friends-2749449-2025-07-02",
      "headline": "Sumit Vyas says theatre feels less pressured: I have more friends thereActor Sumit Vyas, in an exclusive interview, shared the reason behind his love for theatre and what makes it his creative anchor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mawra-hocane-saba-qamar-instagram-handles-reappear-pak-artists-ban-in-india-2749330-2025-07-02",
      "headline": "Mawra Hocane, Saba Qamar's Instagram handles reappear amid Pak artists ban in IndiaThe Instagram handles of Mawra Hocane, Saba Qamar, and many other Pakistani actors reappeared for Indian social media users. Amid a ban on Pakistani artists, certain restricted YouTube channels are also now visible in India."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-gets-first-batch-of-apache-attack-helicopters-after-delay-to-deploy-along-pakistan-border-2749520-2025-07-02",
      "headline": "India gets first batch of Apache choppers after delay, to deploy along Pak borderThe delivery of Apache AH-64E attack helicopters from the United States has missed multiple deadlines. As part of a $600 million deal signed in 2020 with the US, the Indian Army expected delivery of six Apache helicopters by May-June 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/national-herald-money-laundering-case-sonia-gandhi-rahul-usurp-assets-ajl-young-indian-2749581-2025-07-02",
      "headline": "Gandhis aimed to usurp assets worth Rs 2,000 crore: ED in National Herald caseThe ED said a conspiracy was hatched to form Young Indian, in which Sonia and Rahul held majority shares, to siphon off the assets of AJL for a Rs 90 crore loan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-f35b-fighter-jet-refuses-to-leave-kerala-tourism-explains-why-thiruvananthapuram-trivandrum-2749545-2025-07-02",
      "headline": "UK's F-35 fighter jet refuses to leave, Kerala Tourism explains whyWhat was meant to be a brief pit stop for the British Navy F-35B in Kerala has turned into an extended layover. While the British fighter jet waits for a team of 40 from the UK, Kerala Tourism explained why it did not leave so far, of course, all in good humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-2nd-test-day-1-updates-birmingham-weather-2749459-2025-07-02",
      "headline": "2nd Test Day 1 Live: Jaiswal hits 50 but England pacers jolt India at lunchIndia vs England Live Score, 2nd Test Day 1: India find themselves in troubled waters at Edgbaston after losing KL Rahul early and Karun Nair just before lunch. Yashasvi Jaiswal has held firm so far, with skipper Shubman Gill yet to settle in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/delhi-car-ban-is-unindian-2749596-2025-07-02",
      "headline": "Delhi's Car Ban is Un-IndianDelhi's car ban targets vehicles over 10-15 years old to curb air pollution. This clashes with India's sustainable, repair-not-replace ethos, rendering the ban un-Indian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-up-government-nameplate-order-row-shopkeepers-harassed-cops-2749539-2025-07-02",
      "headline": "Shopkeepers being asked to remove their pants: Owaisi slams UP over nameplate rowAIMIM chief Asaduddin Owaisi alleged that shopkeepers in UP's Muzaffarnagar were being asked to remove their pants amid a row over the state government's directive asking eateries to display their owners' names on boards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-3-live-updates-london-carlos-alcaraz-aryna-sabalenka-2749531-2025-07-02",
      "headline": "Wimbledon, Day 3 Live: Keys, Norrie in action after rain delayWimbledon, Day 3 Live updates: All eyes on Carlos Alcaraz and Aryna Sabalenka as Wimbledon 2025 heads into a rain-disrupted Day 3 — with showers pushing back the start of play and adding early drama to a day packed with big-name second-round clashes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/infosys-employee-arrested-for-secretly-filming-women-in-bengaluru-campus-restroom-over-30-videos-found-2749549-2025-07-02",
      "headline": "Bengaluru Infosys employee arrested for filming videos of women in washroomAn Infosys employee was arrested for secretly recording female colleagues in a restroom at the Bengaluru campus. The incident surfaced when a woman caught him in action. Police arrested him following her complaint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/dubai-dark-secret-sexual-abuse-behind-porta-potty-parties-ultra-rich-influencers-social-media-racial-profile-2748912-2025-07-02",
      "headline": "Dubai's dark secret: Sexual extremities in Porta-Potty parties of the ultrarichDubai's ultrarich lure women into secret Porta-Potty parties with luxury gifts, only to exploit them through degrading sexual acts. The recent death of a Ukrainian model in Dubai has been linked to sexual extremities at a Porta-Potty party. Experts are now warning young female tourists against such private events that have legal risks too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasin-jahan-reaction-alimony-mohammed-shami-daughter-2749574-2025-07-02",
      "headline": "Shami made me quit job, must pay maintenance: Estranged wife on court orderHasin Jahan, the estranged wife of Mohammed Shami, welcomed the directive of the Calcutta High Court, which ordered the fast bowler to pay Rs 4 lakh monthly alimony. She said Shami made her quit her job and he needed to take responsibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-bjp-chief-minister-rekha-gupta-new-residence-renovation-delhi-war-of-words-2749590-2025-07-02",
      "headline": "AAP's 'Maya Mahal' dig at Rekha Gupta's house renovation gets BJP 'no luxury' replyAAP slammed the Delhi government's Rs 60 lakh renovation of Chief Minister Rekha Gupta's new official residence, alleging that she was building a \"Maya Mahal\" for herself. The BJP retorted, saying it was not a luxury indulgence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/women-on-mumbai-local-train-trade-punches-during-major-scuffle-video-shows-utter-chaos-2749607-2025-07-02",
      "headline": "Video: All hell breaks loose as women punch, bite each other on Mumbai localThe chaos followed a scuffle that broke out between two women after one of them alleged that the other woman hit her with her elbow in a bid to board the train first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-heads-of-state-role-director-ilya-naishuller-idris-elba-john-cena-2749468-2025-07-02",
      "headline": "Priyanka Chopra says Heads of State team knows value of strong female leadPriyanka Chopra, who plays the role of MI6 agent Noel Bisset in 'Heads of State', shared her views on performing high-octane action stunts in the film. The actor even credited the director Ilya Naishuller for making her character strong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-teacher-gave-anti-depressants-raped-student-for-a-year-in-5-star-hotels-2749424-2025-07-02",
      "headline": "Teacher at top Mumbai school raped her student for a year in 5-star hotelsThe teacher allegedly committed the acts at various locations, including five-star hotels, and is also accused of putting the survivor on antidepressants. After his Higher Secondary exams, the student finally informed his parents when the teacher sent her servant to his house, requesting a meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/cracking-down-on-cars-could-delhis-old-vehicle-fuel-ban-clean-its-air-2749538-2025-07-02",
      "headline": "Could Delhi's old vehicle fuel ban really solve its pollution puzzle?Delhi's air pollution is a complex, multi-source problem, with major contributors including construction dust, industrial emissions, crop burning in neighbouring states, waste-to-energy (WTE) incinerators, and seasonal weather patterns that trap pollutants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-indian-student-visa-f1-j1-duration-change-fix-2025-bill-department-of-homeland-security-2749380-2025-07-02",
      "headline": "US plans time limit on student visas; likely to hit plans of IndiansIn yet another crackdown on immigration in the US, the Donald Trump administration may cut the stay time of international students in the US. Enforcing a time limit on F-1 and J-1 visas will impact the plans of students from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cardiac-surgeon-ramakanta-panda-flags-rising-heart-issues-in-young-indians-in-karnataka-hassan-2749188-2025-07-02",
      "headline": "Top cardiac surgeon flags rising heart issues in young IndiansFour sudden heart attack deaths in Hassan district have alarmed the community. Dr. Ramakanta Panda talks about deadly lifestyle habits that have increased cardiovascular issues in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thailand-one-day-pm-acting-suriya-jungrungreangkit-paetongtarn-shinawatra-suspension-controversy-dynasty-nayak-2749417-2025-07-02",
      "headline": "Thailand follows Bollywood script, gets a one-day PM in SuriyaThailand's politics just delivered a Nayak-like hit. Veteran leader Suriya Jungrungreangkit stepped in as prime minister, but only for a day. Suriya's elevation was prompted by the Constitutional Court's decision to suspend PM Paetongtarn Shinawatra over alleged ethical violations. A Cabinet reshuffle on Thursday will give a new Thai PM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/japan-airlines-flight-pressure-drop-passengers-write-out-wills-boeing-plummets-sharply-china-tokya-plane-2749395-2025-07-02",
      "headline": "Japan Airlines Boeing 737 drops 26,000 feet, passengers write farewell notesThe aircraft encountered a mid-air mechanical issue that triggered a rapid descent from approximately 36,000 feet to just under 10,500 feet in under 10 minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-rape-love-bites-found-on-accused-monojit-mishra-neck-2749451-2025-07-02",
      "headline": "If it was rape, why did accused have love bites on neck? Kolkata lawyer's shockerThe lawyer's claim comes after a medico-legal examination revealed scratch marks on the body of the prime accused, pointing to signs of resistance by the rape survivor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-cena-credits-indian-fans-for-his-global-reach-priyanka-chopra-heads-of-state-2749575-2025-07-02",
      "headline": "Exclusive: John Cena credits Indian fans for his global reach, says is fortunateHollywood stars Priyanka Chopra and John Cena expressed deep gratitude and personal connection to India as their film 'Heads of State' released on Prime Video on July 2. Both actors cherished the warmth of Indian fans and look forward to continuing their journey with strong ties to Indian audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/zohran-mamdani-cutlery-shaming-and-america-finger-lickin-hypocrisy-eating-with-hands-viral-video-2749306-2025-07-02",
      "headline": "Zohran Mamdani, cutlery shaming, and America's Finger-Lickin' hypocrisyIndians love to eat with their hands and the West can never digest this fact. This age-old debate flared up when Zohran Mamdani was found eating with his bare hands and was told to go back to the \"Third World\" by a US politician. Slightly hypocritical for a country whose second-largest restaurant chain's slogan is \"Finger Lickin' Good\".  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/surge-hate-indian-south-asians-canada-slur-social-media-name-call-dirty-unskilled-racist-conspiracy-2748946-2025-07-02",
      "headline": "Surge in hate slurs against Indian-origin people in Canada, reveals reportIndian-origin people in Canada are facing a sharp rise in hate, with slurs against them surging by over 1,350% between 2019 and 2023. Hate posts often portray them as \"dirty\" or \"unskilled\" and echo racist biases."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sheikh-hasina-sentenced-to-6-months-in-prison-in-a-contempt-of-court-case-in-bangladesh-report-2749485-2025-07-02",
      "headline": "Bangladesh court sentences Sheikh Hasina to 6-month jail in contempt case: ReportFormer Bangladesh Prime Minister Sheikh Hasina was given her first conviction since exile, sentencing her to six months in prison for contempt over a leaked phone call threatening the judiciary."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-jasprit-bumrah-rested-ravi-shastri-edgbaston-2749627-2025-07-02",
      "headline": "Jasprit Bumrah sits out after 7 days' rest! Ravi Shastri slams selection callRavi Shastri has slammed the Indian team management's call to rest Jasprit Bumrah for the Edgbaston Test. Bumrah was one of the three changes that the Indian team made for the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexander-zverev-wimbledon-therapy-exit-2749626-2025-07-02",
      "headline": "Never felt this empty: Zverev contemplates therapy after shock exitWimbledon 2025: Alexander Zverev said that he hasn't been in a good mental place after crashing out in the first round following his defeat to Arthur Rinderknech.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-2nd-test-keshav-maharaj-2nd-test-ruled-out-groin-injury-wiaan-mulder-captain-2749619-2025-07-02",
      "headline": "ZIM vs SA: Maharaj ruled out of 2nd Test, Mulder to lead South AfricaSouth Africa's stand-in skipper, Keshav Maharaj, has been ruled out of the second Test against Zimbabwe due to a groin injury. Wiaan Mulder will lead the Proteas side in his absence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-steps-down-india-coach-aiff-2749601-2025-07-02",
      "headline": "Manolo Marquez steps down as India coach after mutual agreement with AIFFManolo Marquez and All India Football Federation (AIFF) have decided to part ways as the Spaniard steps down as the India men's team coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasin-jahan-reaction-alimony-mohammed-shami-daughter-2749574-2025-07-02",
      "headline": "Shami made me quit job, must pay maintenance: Estranged wife on court orderHasin Jahan, the estranged wife of Mohammed Shami, welcomed the directive of the Calcutta High Court, which ordered the fast bowler to pay Rs 4 lakh monthly alimony. She said Shami made her quit her job and he needed to take responsibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kuldeep-yadav-omission-sunil-gavaskar-baffled-birmingham-test-2749543-2025-07-02",
      "headline": "Baffling: Sunil Gavaskar tears into Kuldeep Yadav snub in 2nd Test vs EnglandENG vs IND: Sunil Gavaskar was left baffled after Shubman Gill revealed that they had decided to go with an extended batting unit instead of bringing in an attacking bowler like Kuldeep Yadav for the second Test at Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-ranking-rishabh-pant-shubman-gill-joe-root-batters-2749533-2025-07-02",
      "headline": "Rishabh Pant climbs to sixth in ICC Test rankings after twin centuriesIndia's wicketkeeper-batter Rishabh Pant continued his ascent in the ICC Test Rankings, climbing to sixth place in the latest list released on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-3-live-updates-london-carlos-alcaraz-aryna-sabalenka-2749531-2025-07-02",
      "headline": "Wimbledon, Day 3 Live: Keys, Norrie in action after rain delayWimbledon, Day 3 Live updates: All eyes on Carlos Alcaraz and Aryna Sabalenka as Wimbledon 2025 heads into a rain-disrupted Day 3 — with showers pushing back the start of play and adding early drama to a day packed with big-name second-round clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-jasprit-bumrah-playing-xi-kuldeep-yadav-2749515-2025-07-02",
      "headline": "India rest Jasprit Bumrah in 2nd Test, no Kuldeep Yadav in playing XIEngland vs India, 2nd Test: India rested Jasprit Bumrah for the big-ticket clash in Birmingham. Akash Deep returned to the XI while Washington Sundar and Nitish Reddy also got their chances in place of Shardul Thakur and Sai Sudharsan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-ranking-rishabh-pant-shubman-gill-joe-root-batters-2749533-2025-07-02",
      "headline": "Rishabh Pant climbs to sixth in ICC Test rankings after twin centuriesIndia's wicketkeeper-batter Rishabh Pant continued his ascent in the ICC Test Rankings, climbing to sixth place in the latest list released on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-3-live-updates-london-carlos-alcaraz-aryna-sabalenka-2749531-2025-07-02",
      "headline": "Wimbledon, Day 3 Live: Keys, Norrie in action after rain delayWimbledon, Day 3 Live updates: All eyes on Carlos Alcaraz and Aryna Sabalenka as Wimbledon 2025 heads into a rain-disrupted Day 3 — with showers pushing back the start of play and adding early drama to a day packed with big-name second-round clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-jasprit-bumrah-playing-xi-kuldeep-yadav-2749515-2025-07-02",
      "headline": "India rest Jasprit Bumrah in 2nd Test, no Kuldeep Yadav in playing XIEngland vs India, 2nd Test: India rested Jasprit Bumrah for the big-ticket clash in Birmingham. Akash Deep returned to the XI while Washington Sundar and Nitish Reddy also got their chances in place of Shardul Thakur and Sai Sudharsan. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}