{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/department-of-posts-launches-digipin-precise-digital-addressing-system-new-digital-address-system-in-india-2736018-2025-06-05",
      "headline": "What is DIGIPIN? India's new digital address system explainedThe Department of Posts has launched DIGIPIN, a geocoded digital address system aiming to improve location accuracy and service delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-rise-4-percent-morgan-stanley-maintains-rs-320-target-2735974-2025-06-05",
      "headline": "Eternal shares continue to rally, jumps over 4%. Should you buy?By approximately 10:06 am, the company's shares had risen 4.42% to Rs 256.35 on the Bombay Stock Exchange (BSE). This marks a 12% rise over the past five trading sessions and a 6% increase over the past month. However, year-to-date, the stock remains down by over 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-rally-400-points-nifty-up-ril-eternal-adani-ports-shares-gain-2735970-2025-06-05",
      "headline": "Sensex rallies over 400 points: Why is stock market rising today?As of 9:44 am, the S&P BSE Sensex had jumped 404.22 points to reach 81,402.47. The NSE Nifty50 was also up by 117.60 points at 24,749."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-111-points-higher-nifty-above-24600-eternal-shares-rise-over-1-percent-2735958-2025-06-05",
      "headline": "Sensex, Nifty rise as RBI rate cut hopes lift market; pharma stocks rallyThe S&P BSE Sensex was up 273 points to 81,271.25, while the NSE Nifty50 gained 86.55 points to 24,706.75 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-expectation-sensex-nifty-rally-trading-setup-nse-bse-2735939-2025-06-05",
      "headline": "Stock market opening: Sensex, Nifty to rally today? Check key levelsGift Nifty futures were trading at 24,733.5 as of 8:00 am, signalling a strong start above Nifty50's previous close of 24,620.2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-5-nse-bse-reliance-infra-yes-bank-bel-hal-rec-power-grid-2735933-2025-06-05",
      "headline": "Stocks to watch on June 5: Reliance Infra, Yes Bank, BEL, HAL, REC, Power GridAn overview of stock movements on Dalal Street today, including updates on Adani Airports, Reliance Infrastructure, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-to-trim-35000-jobs-in-germany-by-2030-german-carmakers-plans-layoffs-2735697-2025-06-04",
      "headline": "Volkswagen to trim 35,000 jobs in Germany by 2030Volkswagen is planning to cut 35,000 jobs in Germany by the year 2030. To make the transition easier, Volkswagen is preparing severance packages for affected employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-261-points-higher-nifty-above-24600-eternal-gains-over-3-percent-2735618-2025-06-04",
      "headline": "Sensex ends 261 points higher; Nifty above 24,600; Eternal gains over 3%The S&P BSE Sensex added 261 points to end at 80,998.25, while the NSE Nifty50 was up by 77.70 points to close at 24,620.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-green-steel-production-energy-costs-green-hydrogen-incentives-2735598-2025-06-04",
      "headline": "Government seeks lower energy costs for backing green steel incentives: ReportIndia's finance ministry calls for lower energy prices to facilitate incentives for green steel production, amidst concerns over high green hydrogen costs and inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-ay-2025-26-itr-1-and-itr-4-enabled-on-e-filing-portal-who-can-file-online-check-eligibility-2735586-2025-06-04",
      "headline": "ITR-1, ITR-4 filing begins for AY 2025–26: Are you eligible?The Income Tax Department has enabled online filing of ITR-1 and ITR-4 forms for the assessment year 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-mpc-rate-cut-sector-stock-market-news-trading-tips-expert-recommendation-buy-shares-2735591-2025-06-04",
      "headline": "RBI policy meet begins today: These stocks could rally if rate cut happensThe market is expecting a cut of 25 to 50 basis points (bps), mainly because inflation has been coming down and there are growing worries about slower economic growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-rare-earth-export-controls-disrupt-global-supply-chains-2735550-2025-06-04",
      "headline": "Why China's rare earth export curbs are shaking global supply chainsChina's recent restrictions on rare earth exports are causing global industry disruptions, prompting urgent diplomatic and economic responses."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-teams-up-with-atrangi-re-aanand-l-rai-for-next-film-2736015-2025-06-05",
      "headline": "Exclusive: Sara Ali Khan teams up with Aanand L Rai for next filmActor Sara Ali Khan has teamed up with director Aanand L Rai for her next film. The much-anticipated project is set to present her in a very different avatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-twitter-x-review-kamal-haasan-film-is-unconventional-gives-goosebumps-check-tweets-2735985-2025-06-05",
      "headline": "Thug Life X review: Kamal Haasan's film is unconventional, gives goosebumpsKamal Haasan's 'Thug Life' is receiving all kinds of reviews from fans on social media. While many feel that this Silambarasan TR has overshadowed Haasan in the film, others feel that the background music is not up to the mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/head-of-state-new-trailer-priyanka-chopra-john-cena-idris-elba-promise-explosive-action-2735984-2025-06-05",
      "headline": "Head of State new trailer: Priyanka, John Cena, Idris Elba promise explosive actionPriyanka Chopra, John Cena, and Idris Elba's upcoming film 'Heads of State ' is set to entertain fans on July 2. Ahead of the grand premiere on Prime Video, the makers released another powerful trailer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/the-better-sister-review-power-patriarchy-and-murder-in-a-brilliantly-layered-show-2735893-2025-06-05",
      "headline": "The Better Sister review: Power, patriarchy and murder in a brilliantly layered showReleased-Thu May 29, 2025'The Better Sister', co-created by Olivia Milch and Regina Corrado, is streaming on Prime Video. The show featuring Jessica Biel and Elizabeth Banks is an intriguing whodunnit with stellar performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-joju-george-shares-video-of-daughter-singing-thug-life-song-muthamazhai-2735797-2025-06-05",
      "headline": "Actor Joju George shares video of daughter singing Thug Life song MuthamazhaiA cute video of actor Joju George singing the 'Muthamazhai' song from 'Thug Life' alongside his daughter Sara has gone viral on social media, charming fans with its candid warmth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-prediction-day-1-detailed-report-kamal-haasan-film-to-roar-on-opening-day-solid-tamil-nadu-box-office-update-2735951-2025-06-05",
      "headline": "Thug Life box office prediction day 1: Kamal Haasan film to roar on opening dayKamal Haasan and Mani Ratnam's 'Thug Life' is out to set the cash registers ringing at the box office. The opening-day looks solid with a packed audience in theatres, and the advance booking numbers echo the same. Check the detailed report here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-accused-of-dangling-woman-off-17-story-balcony-in-ongoing-sex-trafficking-glbs-2735908-2025-06-05",
      "headline": "Diddy accused of dangling woman off 17-story balcony in ongoing sex traffickingHip-hop mogul Sean \"Diddy\" Combs is on trial for sex trafficking and racketeering. A witness testified he dangled her off a 17-story balcony in 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wicked-for-good-trailer-to-debut-in-arizona-theaters-on-june-4-glbs-2735890-2025-06-05",
      "headline": "'Wicked: For Good' trailer to debut in Arizona theaters on June 4The Wicked: For Good trailer premieres in theaters on June 4, 2025, during a special rerelease of Part 1 at select Arizona Harkins locations. Streaming options are also available.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-leg-injury-while-shooting-for-shah-rukh-khan-king-2735604-2025-06-04",
      "headline": "Raghav Juyal injures leg while shooting for Shah Rukh Khan's King: ReportRaghav Juyal got injured while shooting a tough stunt for Shah Rukh Khan's upcoming film 'King' but continued filming afterward. The movie, releasing in 2026, features a star-studded cast including SRK, Suhana Khan, Deepika Padukone, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-vikrant-massey-aankhon-ki-gustaakhiyan-first-look-out-2735766-2025-06-04",
      "headline": "Shanaya Kapoor-Vikrant Massey's Aankhon Ki Gustaakhiyan first look outShanaya Kapoor is set to make her Bollywood debut opposite Vikrant Massey in the romantic drama 'Aankhon Ki Gustaakhiyan'. The film's first look has been unveiled and is already generating buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-hindi-cinema-rooted-films-successes-south-cinema-kannappa-2735695-2025-06-04",
      "headline": "Actor Vishnu Manchu: Hindi films are rooted too, not just South cinemaVishnu Manchu emphasised that Hindi cinema has also produced deeply rooted films. He urged the media to recognise Hindi film successes alongside South Indian cinema's achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-in-icu-14-hour-cancer-surgery-shoaib-ibrahim-shares-update-2735746-2025-06-04",
      "headline": "Actor Dipika Kakar in ICU after 14-hour cancer surgery, Shoaib shares updateActor Shoaib Ibrahim gave an update about his wife Dipika Kakar's cancer surgery. Kakar underwent a 14-hour-long surgery for her stage two liver cancer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-joins-prashanth-neels-midnight-birthday-bash-writes-touching-note-2735621-2025-06-04",
      "headline": "Jr NTR joins Prashanth Neel's midnight birthday bash, writes touching noteJr NTR shared a special message for director Prashanth Neel on his birthday as fans speculate a behind-the-scenes glimpse from their upcoming film, reportedly titled 'Dragon'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-ustaad-bhagat-singh-shoot-to-resume-in-june-confirms-director-2735569-2025-06-04",
      "headline": "Pawan Kalyan's Ustaad Bhagat Singh shoot to resume in June, confirms directorPawan Kalyan is set to return to the sets of 'Ustaad Bhagat Singh' as the long-delayed cop drama gears up to resume shoot in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-hari-hara-veera-mallu-postponed-over-vfx-finance-issues-report-2735726-2025-06-04",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu postponed over VFX, finance issues: ReportAfter several postponements, reports now suggest that Pawan Kalyan's long-delayed period epic 'Hari Hara Veera Mallu' may also miss its June 11 release due to complex production issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-rocky-jaiswal-married-wedding-pictures-2735710-2025-06-04",
      "headline": "We are our home and light: Hina Khan and Rocky Jaiswal are married. PicsActor Hina Khan got married to her longtime boyfriend, Rocky Jaiswal. Khan shared pictures from the wedding on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/indian-rock-band-girish-and-the-chronicles-wins-hearts-on-americas-got-talent-2735701-2025-06-04",
      "headline": "Indian rock band Girish and the Chronicles wins hearts on America's Got TalentIndian rock band 'Girish and the Chronicles' wowed the judges on 'America's Got Talent' with a powerful rock version of Adele's 'Set Fire to the Rain'. The performance received a standing ovation and four 'yes' from the judges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-reach-bengaluru-after-rcb-ipl-win-pbks-fans-throng-streets-to-celebrate-2735671-2025-06-04",
      "headline": "Anushka-Virat receive grand welcome as they arrive in Bengaluru after RCB's IPL winAnushka Sharma and Virat Kohli reached Bengaluru, and fans thronged to their bus to catch a glimpse of the team after RCB won the IPL. The actor shared videos from their visit along with a beautiful note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-cheers-for-her-bangalore-girl-anushka-sharma-in-loving-post-after-ipl-win-2735668-2025-06-04",
      "headline": "Together all the way through: Virat dedicates IPL win to his Bangalore girl AnushkaVirat Kohli shared a loving post for his wife, Anushka Sharma, after the RCB ended its dry spell and lifted its first IPL trophy in 18 years. The cricketer referred to her as his 'Bangalore girl'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-stampede-rcb-wanted-event-karnataka-government-congress-siddaramaiah-2735983-2025-06-05",
      "headline": "We facilitated event as RCB, cricket body wanted it: Government on stampedeKarnataka Home Minister G Parameshwara said the event was permitted because RCB and state cricket association wanted the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-stampede-update-live-chinnaswamy-stadium-rcb-event-tragedy-reactions-updates-2736000-2025-06-05",
      "headline": "Bengaluru stampede update LIVE: Karnataka High Court takes case, hearing at 2.30 pmThe Karnataka High Court will hear a suo motu public interest litigation over the Chinnaswamy Stadium stampede at 2.30 pm today. The court has sought a government report on security lapses. As many as 11 people were killed and 47 others were injured in the stampede during a felicitation event for Royal Challengers Bengaluru (RCB) following their IPL victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-never-asked-donald-trump-shashi-tharoor-reacts-to-rahul-gandhi-surrender-jibe-2735963-2025-06-05",
      "headline": "India never asked anyone: Shashi Tharoor reacts to Rahul Gandhi's 'surrender' jibeWhen asked about his party leader Rahul Gandhi's 'Narender surrender' remark on Operation Sindoor, Congress MP Shashi Tharoor reiterated that there was no third-party intervention at any point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-bans-entry-from-12-countries-imposes-restrictions-on-7-others-glbs-2735918-2025-06-05",
      "headline": "We don't want them: Trump issues travel ban on 12 countries, restrictions on 7The countries facing the total ban were found to be 'deficient in screening and vetting' and were determined to pose a very high risk to the United States, according to a statement from the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-rcb-stampede-chinnaswamy-stadium-who-is-responsible-2735981-2025-06-05",
      "headline": "Mixed messages, mismanagement, mess: Who's responsible for stampede at RCB event?As the players were being felicitated inside, complete chaos unfolded on the road and 11 people lost their lives while another 47 were injured. Despite the tragedy just outside, the felicitation ceremony continued."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/we-dont-want-students-causing-trouble-trump-blocks-foreign-visas-at-harvard-glbs-2735916-2025-06-05",
      "headline": "Trump bans visas for new foreign students at Harvard: Threat to national securityPresident Trump signed a proclamation restricting foreign students from entering Harvard University, citing national security concerns. The order halts new F, M, and J visas for Harvard to the review of existing visas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/tejasvi-surya-blasts-bhutto-in-us-india-gives-tech-titans-pak-terrorists-glbs-2735921-2025-06-05",
      "headline": "Tejasvi Surya blasts Bhutto in US: India gives tech titans, Pak terroristsBJP MP Tejasvi Surya slammed Pakistan's image, contrasting Indian achievers with terrorists, mocked its Chinese arms dependency, and declared global support firmly behind India. He accused Pakistan of playing the victim abroad while arming itself with low-grade Chinese weaponry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-trump-discuss-india-pakistan-conflict-in-a-phone-call-kremlin-glbs-2735886-2025-06-05",
      "headline": "Putin, Trump discuss India-Pakistan conflict in phone call: KremlinRussian President Putin and US President Trump discussed the India-Pakistan conflict. Trump also shared details about talks on Ukraine, Iran's nuclear program, and global issues, warning Iran about the urgent need to decide on its nuclear future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-twitter-x-review-kamal-haasan-film-is-unconventional-gives-goosebumps-check-tweets-2735985-2025-06-05",
      "headline": "Thug Life X review: Kamal Haasan's film is unconventional, gives goosebumpsKamal Haasan's 'Thug Life' is receiving all kinds of reviews from fans on social media. While many feel that this Silambarasan TR has overshadowed Haasan in the film, others feel that the background music is not up to the mark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/many-stampedes-siddaramaiah-kumbh-reference-after-bengaluru-tragedy-2735801-2025-06-04",
      "headline": "Many stampedes...: Siddaramaiah's Kumbh reference after Bengaluru tragedyKarnataka Chief Minister Siddaramaiah addressed the media following the deadly stadium stampede in Bengaluru that killed at least 11 and left several injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-praises-operation-sindoor-in-cabinet-meet-says-world-saw-our-strength-2735955-2025-06-05",
      "headline": "PM Modi praises Op Sindoor in Cabinet meet: World saw our strengthIn a post-Operation Sindoor cabinet meeting, PM Modi outlines mission-mode governance, warns against delays and urges ministers to highlight 11 years of governance success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharmistha-panolis-father-prithviraj-panoli-claims-they-visited-lalbazar-anandapur-police-station-2735932-2025-06-05",
      "headline": "We were in touch with Kolkata Police: Sarmishtha's father on absconding chargeDismissing claims that Sharmistha Panoli was absconding, her father, Prithviraj, claimed that he and his daughter had visited Lalbazar, the headquarters of the Kolkata Police. Showing the visitor slips, Prithviraj pointed fingers at the Kolkata Police, arguing that if they were present at the police headquarters, how could his daughter be arrested on absconding charges?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-angry-d-gukesh-viswanathan-anand-2736006-2025-06-05",
      "headline": "Magnus Carlsen wanted to draw line in sand by beating D Gukesh: Viswanathan AnandViswanathan Anand feels that Magnus Carlsen wanted to draw a line in the sand by beating D Gukesh and that was the reason behind his outburst during the Norway Chess. Carlsen produced an angry reaction after he was beaten by Gukesh recently in the tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indore-honeymooners-case-family-puts-up-poster-seeks-cbi-probe-in-raja-and-sonam-raghuwanshi-murder-2735937-2025-06-05",
      "headline": "I was killed: Missing Indore couple's family puts up poster, seeks CBI probeA large striking poster outside Raja's Indore residence, featuring photos of the couple, has drawn public attention and intensified calls for a high-level investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-are-europeans-sitting-on-the-fence-indian-delegation-in-belgium-slams-west-silence-on-terror-glbs-2735900-2025-06-05",
      "headline": "Why are Europeans sitting on the fence? Indian delegation slams West on terrorAn all-party delegation of Indian MPs, currently on an official tour of Europe, has strongly criticized what they described as global double standards on terrorism. The delegation also highlighted Pakistan's continued support for cross-border terrorism.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-proposes-1000-fast-track-fee-for-us-tourist-visa-interviews-glbs-2735891-2025-06-05",
      "headline": "Trump proposes $1,000 fast-track fee for US tourist visa interviewsThe Trump administration may introduce a USD 1,000 fast-track fee for non-immigrant visa interviews, but legal experts warn the plan could violate US law and face court challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/the-poop-rule-is-internets-latest-decluttering-hack-but-does-it-work-2735681-2025-06-05",
      "headline": "The 'Poop Rule' is Internet's latest decluttering hack, but does it work?No, this is not a bathroom rule, but a way to clear your house of unwanted things. People claim that the 'Poop Rule' can help simplify living too. The question is, would you give it a go?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/kill-the-bill-elon-musk-ramps-up-attacks-on-trump-tax-and-spending-bill-glbs-2735902-2025-06-05",
      "headline": "KILL the BILL: Elon Musk ramps up attack on Trump tax and spending billElon Musk lashed out at Trump's new spending bill, calling it a \"disgusting abomination\" and urging Americans to pressure lawmakers to reject it. The Tesla CEO warned the bill could bankrupt the country and hurt his businesses. \"KILL the BILL,\" he posted, vowing to fire lawmakers who support it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/columbia-university-faces-loss-of-accreditation-over-campus-antisemitism-concerns-glbs-2735905-2025-06-05",
      "headline": "Columbia University faces loss of accreditation over campus antisemitism concernsColumbia University's ongoing turmoil has escalated into a full-blown institutional crisis, one that could cost the Ivy League school its accreditation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-elected-to-un-economic-and-social-council-for-2026-28-term-2735923-2025-06-05",
      "headline": "India secures seat at UN Economic and Social Council, pledges development pushThis will be at least the 18th term for India on the council, having last completed a four-term run from 2008 to 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-release-review-live-updates-kamal-haasan-silambarasan-mani-ratnam-2735927-2025-06-05",
      "headline": "Thug Life Movie Review and Release Live Updates: Bumper opening guaranteedThug Life Review and Release Live Updates: Director Mani Ratnam's film, starring Kamal Haasan and Silambarasan, hit theatres on June 5 amid controversies and massive anticipation. The film is expected to have a solid opening at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bangalore-stampede-fir-registered-aap-complaint-against-ksca-rcb-for-mismanagement-organisation-2735972-2025-06-05",
      "headline": "Bengaluru stampede: FIR filed, AAP leader seeks action against state cricket bodyAn FIR has been registered for the stampede outside Bengaluru's Chinnaswamy stadium which led to the death of 11 people. On the other hand, an AAP leader has filed a police complaint seeking action against the Karnataka State Cricket Association for negligence.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-orders-probe-into-bidens-use-of-autopen-claiming-white-house-cover-up-glbs-2735922-2025-06-05",
      "headline": "Trump orders probe into Biden's use of autopen, claiming White House cover-upDonald Trump has ordered an investigation into Joe Biden's use of an autopen for signing official documents, calling it a major scandal and alleging a cover-up of Biden's cognitive decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/over-20-mild-earthquakes-shake-karachi-in-48-hours-experts-warn-of-bigger-quake-glbs-2735888-2025-06-05",
      "headline": "Over 20 mild earthquakes shake Karachi in 48 hours, experts warn of bigger quakeKarachi experienced over 20 mild earthquakes in two days, sparking debate amongst experts. While officials urge calm, some geologists warn a major quake could strike soon, adding to public anxiety."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-angry-d-gukesh-viswanathan-anand-2736006-2025-06-05",
      "headline": "Magnus Carlsen wanted to draw line in sand by beating D Gukesh: Viswanathan AnandViswanathan Anand feels that Magnus Carlsen wanted to draw a line in the sand by beating D Gukesh and that was the reason behind his outburst during the Norway Chess. Carlsen produced an angry reaction after he was beaten by Gukesh recently in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/susan-polgar-praises-pm-modi-for-continuous-support-to-d-gukesh-and-chess-2735989-2025-06-05",
      "headline": "Susan Polgar praises PM Modi for continuous support to D GukeshLegendary chess player Susan Polgar praised Prime Minister Narendra Modi for his continuous support to Indian chess players and interest in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/simone-inzaghi-al-hilal-manager-fifa-club-world-cup-real-madrid-2735978-2025-06-05",
      "headline": "Simone Inzaghi appointed as Al-Hilal manager after leaving Inter MilanAl-Hilal has announced the appointment of Simone Inzaghi as their new manager after the Italian left Inter Milan after their Champions League final loss. Inzaghi's first assignment as coach will be the FIFA Club World Cup in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyers-shot-in-ipl-final-was-a-criminal-offence-in-my-book-yograj-singh-2735969-2025-06-05",
      "headline": "Shreyas Iyer's shot in IPL final was a criminal offence in my book: Yograj SinghFormer India cricketer Yograj Singh has lashed out at the Punjab Kings (PBKS) captain Shreyas Iyer for his poor shot selection in the Indian Premier League 2025 (IPL 2025) final against Royal Challengers Bengaluru (RCB)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-12-schedule-iga-swiatek-aryna-sabalenka-coco-gauff-lois-boisson-roland-garros-2735968-2025-06-05",
      "headline": "French Open Day 12 Order Of Play: Sabalenka vs Swiatek, Gauff faces in-form BoissonThe French Open 2025 has reached its business end as the women's singles semi-finals begins on Thursday, June 5. Iga Swiatek and Aryna Sabalenka will lock horns in a mega clash while Coco Gauff will be up against the wildcard Lois Boisson. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-ready-for-semi-final-challenge-against-perfect-jannik-sinner-2735948-2025-06-05",
      "headline": "Novak Djokovic ready for semi-final challenge against Perfect Jannik SinnerNovak Djokovic said that he's eagerly looking forward to taking on Jannik Sinner in the semi-final of the French Open 2025. Djokovic beat Alexander Zverev 4-6, 6-3, 6-2, 6-4  n the quarterfinals to enter the semi finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-semi-final-germany-vs-portugal-cristiano-ronaldo-2735942-2025-06-05",
      "headline": "Cristiano Ronaldo scores winner as Portugal beat Germany to enter Nations League finalCristiano Ronaldo bagged the winner as Portugal defeated Germany for the first time since 2000 to enter the Nations League final. Portugal came from a goal behind to win the match 2-1 on June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-expresses-condolences-to-chinnaswamy-stadium-stampede-victims-2735934-2025-06-05",
      "headline": "After Virat Kohli, AB de Villiers condoles Bengaluru stampede victimsFormer South Africa and Royal Challengers Bengaluru (RCB) batter AB de Villiers expressed his condolences to the victims of the stampede at the M. Chinnaswamy Stadium in Bengaluru. At least 11 people were dead, and nearly 50 were injured as a deadly stampede broke out outside the stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-alexander-zverev-semifinals-2735907-2025-06-05",
      "headline": "Djokovic outlasts Zverev, becomes oldest semifinalist in 57 yearsFrench Open 2025: Novak Djokovic went through to the semi-final of the Roland Garros after beating Alexander Zverev 4-6, 6-3, 6-2. 6-4 in three hours and 17 minutes on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/lois-boisson-roland-garros-semi-final-wildcard-tennis-upset-2735880-2025-06-05",
      "headline": "World No. 361 Lois Bosson lost for words as Paris fairytale continuesLois Boisson, 22, entered the Roland Garros as No. 369 in women's singles tennis. The Frenchwoman has taken out two top-10 players -- Jessica Pegula and Mirra Andreeva -- to script a fairytale run at home. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-victory-parade-stampede-sachin-tendulkar-yuvraj-singh-reaction-2735879-2025-06-04",
      "headline": "RCB victory parade stampede: Sachin Tendulkar, Yuvraj condole loss of livesRCB victory parade stampede: India's legendary batter Sachin Tendulkar and World Cup-winning all-rounder Yuvraj Singh expressed their condolences over the \"tragic\" stampede near Bengaluru's M Chinnaswamy Stadium on Wednesday, which claimed 11 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-semi-final-germany-vs-portugal-cristiano-ronaldo-2735942-2025-06-05",
      "headline": "Cristiano Ronaldo scores winner as Portugal beat Germany to enter Nations League finalCristiano Ronaldo bagged the winner as Portugal defeated Germany for the first time since 2000 to enter the Nations League final. Portugal came from a goal behind to win the match 2-1 on June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-expresses-condolences-to-chinnaswamy-stadium-stampede-victims-2735934-2025-06-05",
      "headline": "After Virat Kohli, AB de Villiers condoles Bengaluru stampede victimsFormer South Africa and Royal Challengers Bengaluru (RCB) batter AB de Villiers expressed his condolences to the victims of the stampede at the M. Chinnaswamy Stadium in Bengaluru. At least 11 people were dead, and nearly 50 were injured as a deadly stampede broke out outside the stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-alexander-zverev-semifinals-2735907-2025-06-05",
      "headline": "Djokovic outlasts Zverev, becomes oldest semifinalist in 57 yearsFrench Open 2025: Novak Djokovic went through to the semi-final of the Roland Garros after beating Alexander Zverev 4-6, 6-3, 6-2. 6-4 in three hours and 17 minutes on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/lois-boisson-roland-garros-semi-final-wildcard-tennis-upset-2735880-2025-06-05",
      "headline": "World No. 361 Lois Bosson lost for words as Paris fairytale continuesLois Boisson, 22, entered the Roland Garros as No. 369 in women's singles tennis. The Frenchwoman has taken out two top-10 players -- Jessica Pegula and Mirra Andreeva -- to script a fairytale run at home. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-victory-parade-stampede-sachin-tendulkar-yuvraj-singh-reaction-2735879-2025-06-04",
      "headline": "RCB victory parade stampede: Sachin Tendulkar, Yuvraj condole loss of livesRCB victory parade stampede: India's legendary batter Sachin Tendulkar and World Cup-winning all-rounder Yuvraj Singh expressed their condolences over the \"tragic\" stampede near Bengaluru's M Chinnaswamy Stadium on Wednesday, which claimed 11 lives."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}