{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-gifting-festive-season-ministry-of-finance-bans-notice-orders-all-departments-to-comply-2791723-2025-09-23",
      "headline": "Ministry of Finance bans spending on Diwali gifts, orders all to complyThe latest notice from the Ministry of Finance comes as part of the government's continuing efforts to enforce fiscal discipline and restrict non-essential spending."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nvidia-invest-100-billion-dollars-openai-next-gen-ai-growth-glbs-2791630-2025-09-22",
      "headline": "Nvidia to invest $100 billion in OpenAI for next-gen AI infrastructureThe companies unveiled a letter of intent for a landmark strategic partnership to deploy at least 10 gigawatts of Nvidia chips for OpenAI's AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-noida-is-emerging-as-indias-next-hotspot-for-branded-residences-2791571-2025-09-22",
      "headline": "Why Noida is emerging as India's next hotspot for branded residencesNoida is shedding its image as just a satellite city of Delhi. With luxury developers entering the market, it's fast becoming India's go-to destination for branded residences that promise prestige, comfort, and modern living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indusind-bank-ex-cfo-gobind-jain-records-statement-accounting-lapse-probe-2791491-2025-09-22",
      "headline": "IndusInd Bank's ex-CFO records statement in accounting lapse probeMumbai Police's Economic Offences Wing (EOW) has so far recorded statements of seven to eight employees of the bank. Ex-CFO Gobind Jain recorded his statement today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-claim-rejected-ca-explains-how-to-rectify-and-reapply-itr-refund-2025-2791446-2025-09-22",
      "headline": "Income tax refund claim rejected? CA explains how to rectify and reapplyGetting your income tax refund rejected can be unsettling, especially after filing on time. But in most cases, the issues are minor and fixable. Here's a look at why rejections occur and how to reapply successfully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/gold-silver-stock-market-where-should-you-invest-right-now-invest-2791440-2025-09-22",
      "headline": "Gold, silver or equity: Where should you invest right now?Gold prices touched a fresh record high on the 1st day of Navrartri, once again sparking the age-old debate among investors: where should money be parked during this time, gold, silver, or equity?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/union-minister-ashwini-vaishnaw-discusses-gst-msme-benefits-key-reforms-2791387-2025-09-22",
      "headline": "Union Minister Ashwini Vaishnaw discusses GST, MSME benefits, key reformsUnion Minister Ashwini Vaishnaw held a press conference, detailing the benefits of GST reform. The Minister explained how GST advantages extend to all states, estimating a saving of Rs 3,500 for a middle-class family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-it-shares-closing-bell-2791406-2025-09-22",
      "headline": "Sensex falls over 450 points, Nifty settles lower as IT stocks tumbleThe sell-off was led by information technology stocks, which tumbled nearly 2% after President Donald Trump announced a $100,000 fee for new H-1B visa applications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-500-points-why-is-the-stock-market-falling-today-2791392-2025-09-22",
      "headline": "Sensex tumbles 500 points: Why is the stock market falling todayThe S&P BSE Sensex was down 503.31 points at 82,122.92 by 2:55 pm, while the NSE Nifty50 slipped 143.80 points to 25,183.20. Volatility surged across broader market segments, with most indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/h1b-visa-fee-hike-indian-it-sector-demand-slowdown-investor-caution-2791384-2025-09-22",
      "headline": "IT sector faces H-1B visa jitters: Should you keep your money parked or sell?Recent changes to the H-1B visa programme have triggered new worries for Indian IT companies, already facing weaker client demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/turning-50-here-how-to-protect-your-retirement-savings-explains-financial-advisor-2791255-2025-09-22",
      "headline": "Turning 50? Here's how to protect your retirement savings, explains financial advisorHitting 50 can be a mix of pride and worry, especially when it comes to money. Even after years of saving and investing, many fear their retirement funds may not last as long as planned. Here are expert tips to safeguard your savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/errors-in-itr-filing-3-simple-ways-to-fix-it-revise-rectify-or-update-2791213-2025-09-22",
      "headline": "Errors in ITR filing? 3 simple ways to fix it: Revise, rectify or updateWorried about spotting a mistake in your ITR after filing? You're not alone. Errors happen to many taxpayers. Thankfully, the system gives you not one but three ways to fix them. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tip-still-bet-on-it-stocks-h-1b-visa-worries-information-technology-shares-2791227-2025-09-22",
      "headline": "Should you still bet on IT stocks as H-1B visa worries resurface?The US move on H-1B visa has stirred fears of rising costs and tighter restrictions on tech firms that rely on sending skilled workers to client locations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gst-20-rate-cut-groceries-electronic-items-get-cheaper-this-festive-season-2791141-2025-09-22",
      "headline": "GST 2.0 rate cut: Groceries, electronic items get cheaper this festive seasonThis report examines the impact of GST rate changes on household budgets, focusing on groceries and electronics. Items like chocolates and shampoos are now cheaper, with shampoos moving from an 18% to a 5% tax bracket. In contrast, aerated drinks are subject to a 'sin tax'. The report highlights significant savings, noting, \"an average saving of 10% will mean 5000 rupees per month saving\" for a consumer with a monthly income of one lakh rupees. The changes are presented as a \"festive gift from the Modi government,\" with major electronics also seeing price drops. Televisions over 32 inches, previously in a 28% slab, are now taxed at 18%, resulting in substantial savings for consumers looking to upgrade. Washing machines, refrigerators, and dishwashers also benefit from a 10% tax reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-goods-and-services-cheaper-live-updates-pm-modi-business-2791149-2025-09-22",
      "headline": "Live: GST 2.0 kicks off, BJP urges traders to pass on relief to consumersThe GST Council has approved major tax reforms effective today, September 22, introducing a simplified two-rate structure of 5% and 18% to ease compliance and lower costs. Essential items like soaps, shampoos, bicycles, and packaged foods will now attract 5% GST, while appliances such as ACs and large TVs will be taxed at 18%, down from 28%. Luxury and sin goods, including tobacco and high-end cars, will continue to face a 40% levy plus compensation cess. Follow Indiatoday.in for latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tech-mahindra-tcs-infosys-why-are-it-stocks-falling-today-h1b-visa-stricter-norms-fees-2791142-2025-09-22",
      "headline": "Tech Mahindra, TCS, Infosys: Why are IT stocks falling today?Tech Mahindra was the worst hit, sliding nearly 5% in early trade. Infosys, Tata Consultancy Services (TCS), HCLTech and Wipro also fell more than 2.5% each. The Nifty IT index shed almost 3%, making it one of the day's worst-performing sectoral indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-down-346-points-nifty-below-25300-tech-mahindra-tanks-6-percent-2791136-2025-09-22",
      "headline": "Sensex down 346 points, Nifty below 25,300; Tech Mahindra tanks 6%The S&P BSE Sensex was down by 267.56 points to 82,358.67, while the NSE Nifty50 lost 48.60 points to 25,278.45​​​​​​​ as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/h-1-b-visa-kunal-bahl-radhika-gupta-consoles-techies-return-to-india-work-here-trump-2791133-2025-09-22",
      "headline": "Kunal Bahl, rejected for H-1B, consoles techies: I did well in India, didn't I?While India has long been the biggest beneficiary of H-1B visas, accounting for 71% of all approvals last year, uncertainty has cast a shadow over careers, education plans and the information technology industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reforms-today-price-changes-everyday-goods-milk-dairy-sin-ultra-luxury-pm-modi-india-tax-2791115-2025-09-22",
      "headline": "GST 2.0 kicks in: What changes in your shopping bill from today Live UpdatesThe government expects GST 2.0 to reduce compliance challenges, cut disputes, and make goods and services cheaper for households. Read on to know which items get cheaper and which turn costlier from today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-gst-rates-from-september-22-cheaper-costlier-list-of-products-list-2790847-2025-09-21",
      "headline": "GST 2.0 comes into effect: What's cheaper and costlier from todayAs the new rates under GST 2.0 come into effect from Monday, Prime Minister Narendra Modi said the reforms will boost savings for households, farmers, shopkeepers, and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-delay-under-processin-how-to-check-status-and-what-to-do-next-2790817-2025-09-21",
      "headline": "ITR refund under processing? Here's how to check status and what to do nextIf your refund remains under processing, first ensure your ITR has been e-verified, as refunds cannot be processed without this step. You can also check Form 26AS to verify if the refund has already been credited to your account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-grocery-runs-to-gym-sessions-what-today-homebuyers-really-want-2790798-2025-09-21",
      "headline": "From grocery runs to gym sessions: What today's homebuyers really wantToday's urban buyers want more than a home, they seek a lifestyle where comfort, convenience, and community come together, and daily needs, work, and wellness coexist effortlessly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-leads-indian-delegation-us-trade-talks-september-22-2025-2790679-2025-09-20",
      "headline": "Piyush Goyal to visit US for trade talks on September 22 amid tariff, H-1B tensionsThe minister will visit New York and will be accompanied by special secretary in the ministry Rajesh Agrawal and other officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-h1b-visa-fee-hike-100000-panic-indian-professionals-travel-disruption-diwali-2790663-2025-09-20",
      "headline": "H-1B visa holders cancel trips to India for weddings, Diwali amid new fee hikeWhile many cancelled plans to travel at the last minute while waiting to board flights to India, several others already in India are scrambling to return amid lack of clarity after Trump on Friday signed a proclamation to raise the H-1B visa fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-prices-of-700-products-ghee-cheaper-by-rs-40-per-litre-from-september-22-mother-dairy-gst-rate-cuts-2790620-2025-09-20",
      "headline": "Amul cuts prices of 700 products, ghee cheaper by Rs 40 per litre from Sept 22Amul, marketed by the Gujarat Cooperative Milk Marketing Federation (GCMMF), on Saturday announced a price reduction for over 700 products, including ghee, butter, ice cream, cheese, and frozen snacks. The move comes after a GST rate cut, with the company passing the benefits to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-warns-us-100000-h1b-visa-fee-impact-indian-it-firms-2790579-2025-09-20",
      "headline": "H-1B visa fee hike will disrupt Indian tech ops, 1-day deadline concerning: NasscomNasscom cautioned that Indian nationals employed on H-1B visas will be directly impacted, while technology companies will face disruption in ongoing client projects requiring onshore deployment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-itr-refund-delayed-heres-why-the-process-is-taking-longer-this-year-2790516-2025-09-20",
      "headline": "ITR refund delayed? Here's why the process may take longer this yearTax refunds this year are taking longer than usual, leaving many taxpayers waiting and prompting questions about delays, processing times, and what to expect in the weeks ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-trap-india-mis-selling-policies-irdai-agent-rbm-commissions-bank-targets-financial-illiteracy-2790046-2025-09-20",
      "headline": "Why India's insurance market has become a breeding ground for mis-sellingFrom loans tied to unwanted policies to agents chasing fat commissions, insurance policies that were meant to shield families have instead become a trap for many. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-a-bigger-challenge-to-dollar-than-brics-currency-says-wef-president-2790312-2025-09-19",
      "headline": "Cryptocurrency a bigger challenge to dollar than BRICS currency, says WEF PresidentSpeaking in an exclusive conversation with India Today TV, Brende said de-dollarisation is unlikely in the near term. He added that cryptocurrency is a bigger challenge to the dollar than a potential BRICS currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-powers-18-percent-of-global-growth-wef-president-borge-brende-sees-tariff-row-with-us-easing-soon-2790284-2025-09-19",
      "headline": "India powers 18% of global growth, WEF chief sees tariff row with US easing soonIn an exclusive interaction with India Today TV, WEF President Borge Brende described India's rapid expansion as a source of \"exported prosperity\" to the world. \"Just imagine what it means for global prosperity. So, you are exporting prosperity by growing so fast,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-widow-wait-a-worker-fight-the-human-struggle-behind-pf-claims-2790021-2025-09-19",
      "headline": "A widow's wait, a worker's fight: The human struggle behind PF claimsIn Part 2 of our series on the PF claim crisis, we look at why, for so many Indians, withdrawing their own savings has turned into a struggle, forcing them to fight for money that is rightfully theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/market-optimism-rises-after-sebi-clears-adani-group-hindenburg-allegations-2790095-2025-09-19",
      "headline": "Will October bring a market breakout? Earnings, GST price cuts fuel hopeAdani stocks led the rally on Thursday following Sebi's dismissal of Hindenburg Research allegations. Experts say this could mark the start of renewed market optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-387-points-lower-nifty-below-25400-adani-enterprises-gains-5-2790077-2025-09-19",
      "headline": "Sensex, Nifty end lower amid profit booking; Adani Group shares gainThe S&P BSE Sensex slipped 387.73 points to close at 82,626.23, while the NSE Nifty50 lost 96.55 points to settle at 25,327.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-intel-shares-jumped-22-percent-after-nvidias-usd5-billion-investment-2789998-2025-09-19",
      "headline": "Explained: Why Intel shares jumped 22% after Nvidia's $5 billion investmentThe Nvidia-Intel deal not only fuels Intel's stock surge but strengthens its next-gen manufacturing and product integration, creating potential market shifts that could challenge competitors like AMD over the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-itr-refund-here-is-how-to-track-it-2789924-2025-09-19",
      "headline": "Waiting for your ITR refund? Here is how to track itAfter filing your ITR, the next big question is, when will the refund come? Instead of guessing, you can quickly check the progress on the official portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-down-why-is-the-stock-market-down-today-2789941-2025-09-19",
      "headline": "Sensex tumbles 500 points: Is the stock market rally over?Around midday, the S&P BSE Sensex was down 471.67 points, settling at 82,542.29, while the NSE Nifty50 declined 130.20 points to 25,293.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/does-the-income-tax-department-delay-refunds-above-rs-50000-2789891-2025-09-19",
      "headline": "Does the Income Tax Department delay refunds above Rs 50,000?With the ITR deadline now behind us, many taxpayers are anxiously waiting for their refunds. A common doubt is whether larger refunds, such as those above Rs 50,000, take longer to arrive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-from-september-22-why-you-should-double-check-product-mrps-2789858-2025-09-19",
      "headline": "New GST rates from September 22: Why you should double-check product MRPsConsumers must remain alert as new GST rates take effect September 22; checking MRPs carefully ensures savings are realised, avoiding overpayment due to old pricing or retailer confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/adani-power-in-focus-as-sebi-clean-chit-sparks-fresh-rally-in-adani-group-stocks-2789834-2025-09-19",
      "headline": "Adani Power in focus as Sebi clean chit sparks fresh rally in Adani Group stocksAdani Power's move stood out, as analysts see strong momentum beyond the short-term sentiment boost. Global brokerage Morgan Stanley has initiated coverage with an 'Overweight' rating and a target price of Rs 818 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-stocks-jump-after-sebi-clean-chit-in-hindenburg-case-check-details-2789807-2025-09-19",
      "headline": "Adani stocks jump up to 10 % after Sebi clean chit in Hindenburg caseThe gains were broad-based across the group's listed entities. Adani Total Gas led the rally, soaring 10% on the BSE. Adani Power climbed 7%, while flagship Adani Enterprises advanced nearly 5%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/kpop-demon-hunters-arden-cho-on-asian-american-bts-blackpink-jungkooks-reaction-2791733-2025-09-23",
      "headline": "KPop Demon Hunters' Arden Cho on Asian-American, BTS, BLACKPINK, JungKook's reactionKPop Demon Hunters' Arden Cho, who gave her voice to Rumi, spoke to India Today's Bhavna Agarwal about the Netflix's most watched film of all times and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/the-morning-show-s4-india-exclusive-is-ai-the-new-threat-the-cast-answers-india-today-2791730-2025-09-23",
      "headline": "The Morning Show S4 India Exclusive: Is AI the new threat? The cast answers | India TodayThe Morning Show Season 4 premiered on Apple TV+ on September 17. The cast spoke to India Today's Bhavna Agarwal over AI- one of the central themes for the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-funeral-2791728-2025-09-23",
      "headline": "Zubeen Garg funeral: Singer to be cremated today with full state honoursSinger Zubeen Garg died at the age of 52 during a sea outing in Singapore. He will be cremated with full state honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/jennifer-aniston-and-reese-witherspoon-discuss-ai-india-the-morning-show-s4-india-exclusive-2791727-2025-09-23",
      "headline": "Jennifer Aniston and Reese Witherspoon discuss AI, India, The Morning Show S4 | India ExclusiveJennifer Aniston and Reese Witherspoon spoke to India Today's Bhavna Agarwal on The Morning Show S4, dangers related to AI taking over the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-tributes-sridevi-iconic-saree-homebound-premiere-india-oscar-entry-2791703-2025-09-23",
      "headline": "Janhvi Kapoor wears Sridevi's gorgeous saree, pays tribute at Homebound premiereActor Janhvi Kapoor honoured her late mother Sridevi at the Mumbai premiere of 'Homebound', wearing a saree once worn by her. Meanwhile, the film is announced as India's official Oscar entry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-company-hybe-officially-launches-indian-subsidiary-hybe-india-2791696-2025-09-23",
      "headline": "BTS' company HYBE officially launches Indian subsidiary HYBE IndiaHYBE has inaugurated its Indian subsidiary, HYBE India Entertainment Private Limited, establishing Mumbai as its strategic hub to connect the Indian music market with the global ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-and-abhay-verma-give-bts-glimpses-from-laikey-laikaa-sets-2791559-2025-09-22",
      "headline": "Rasha Thadani and Abhay Verma give BTS glimpses from Laikey Laikaa sets. PicsRasha Thadani and Abhay Verma shared playful behind-the-scenes moments from their upcoming romantic-action film 'Laikey Laikaa', slated for a 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-shares-producers-once-asked-rang-de-basanti-cast-to-return-money-2791220-2025-09-22",
      "headline": "Soha Ali Khan shares producers once asked Rang De Basanti cast to return moneySoha Ali Khan shared that the producers of 'Rang De Basanti' once asked the cast to return part of their pay, unsure of the film's success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-remembers-shefali-jariwala-shares-details-of-her-final-moments-2791470-2025-09-22",
      "headline": "Parag Tyagi remembers Shefali, shares details of her final moments: It slipped awayParag Tyagi, husband of late actor Shefali Jariwala, has launched a YouTube channel in her memory, where he shared emotional details about her final moments and unfulfilled dreams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoor-set-to-make-bollywood-comeback-with-strong-roles-after-motherhood-2791521-2025-09-22",
      "headline": "Sonam Kapoor shares update on her disruptive Bollywood comeback after motherhoodSonam Kapoor is set to return to films after spending the past few years focusing on motherhood and family life following the birth of her son, Vayu. She plans to choose projects with strong, layered female roles that resonate with her vision and tell meaningful stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-over-free-speech-concern-says-i-no-longer-recognise-my-country-2791547-2025-09-22",
      "headline": "I no longer recognise my country: Angelina Jolie over free speech concernAngelina Jolie expressed deep concern over the erosion of free speech in the United States while presenting her latest film at Spain's San Sebastián festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-and-fall-kubbra-sait-new-ruler-aarush-bhola-exhilarating-stressful-2791425-2025-09-22",
      "headline": "Rise & Fall: Kubbra Sait picked over Aarush Bhola to become rulerActor Kubbra Sait became the latest contestant to transition from being a worker to a ruler in the latest episode of 'Rise & Fall.' The decision followed a key vote amongst the rulers, who were confused between Kubrra and Aarush Bhola. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/second-post-mortem-on-zubeen-garg-on-tuesday-after-demands-from-people-says-assam-cm-himanta-biswa-sarma-2791537-2025-09-22",
      "headline": "Zubeen Garg's second post-mortem on Tuesday after public demand: Assam CMAssam Chief Minister Himanta Biswa Sarma announced a fresh autopsy for singer Zubeen Garg amid ongoing investigations into his death, with the post-mortem scheduled at Guwahati Medical College. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/why-ranbir-kapoor-cameo-in-the-bads-of-bollywood-has-created-controversy-explained-2791530-2025-09-22",
      "headline": "Why Ranbir Kapoor's cameo in The Ba***s of Bollywood has created controversyActor Ranbir Kapoor's brief cameo in Aryan Khan's Netflix series 'The Ba***s of Bollywood' has drawn the attention of the Human Rights Commission over a vape scene. Here's what happens in the scene and if it matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/riddhima-kapoor-farah-khan-dilip-demanding-higher-salary-samara-sahni-2791483-2025-09-22",
      "headline": "Riddhima welcomes Dilip with garland, Farah says he's demanding higher salaryRiddhima Kapoor Sahni recently welcomed Farah Khan and her cook Dilip with garlands at her Delhi home. During their interaction, the filmmaker joked about Dilip demanding a higher salary after gaining widespread attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-when-and-where-to-watch-the-ceremony-live-shah-rukh-khan-vikrant-massey-rani-mukerji-mohanlal-2791505-2025-09-22",
      "headline": "71st National Film Awards: When and where to watch the ceremony liveThe 71st National Film Awards will take place on September 23 in New Delhi. The awardees will be honoured by President Droupadi Murmu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-voice-to-be-digitally-preserved-to-prevent-ai-misuse-2791500-2025-09-22",
      "headline": "Zubeen Garg's voice to be digitally preserved to prevent AI misuseZubeen Garg's voice will be digitally preserved to safeguard it from AI misuse and unauthorised tampering. His close associate, Manas Robin, said a unique 'digital signature' will be created to ensure the authenticity of his vocals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fatima-sana-shaikh-not-in-the-wives-madhur-bhandarkar-clears-the-air-2791450-2025-09-22",
      "headline": "Fatima Sana Shaikh not in The Wives, Madhur Bhandarkar clears the airMadhur Bhandarkar has completed filming 'The Wives', clarifying that Fatima Sana Shaikh was never part of the cast despite rumours. The film stars Regina Cassandra, Sonali Kulkarni and Mouni Roy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/court-summons-malayalam-actor-unni-mukundan-in-manager-assault-case-2791448-2025-09-22",
      "headline": "Court summons Malayalam actor Unni Mukundan in manager assault caseMalayalam actor Unni Mukundan has been summoned by the Kakkanad Magistrate's Court in an assault case filed by his former manager Vipin Kumar. The 'Marco' star earlier denied all allegations, calling them false and insisting Kumar was never his manager."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-is-critical-to-us-rubio-says-after-jaishankar-meet-amid-h-1b-visa-row-glbs-2791686-2025-09-23",
      "headline": "India is critical to US, Rubio says after Jaishankar meet amid H-1B visa rowUS Secretary of State Marco Rubio and External Affairs Minister S Jaishankar reaffirmed ties in New York after Trump's USD 100,000 H-1B visa fee rattled India's tech industry and reignited trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-may-exempt-doctors-from-100000-h-1b-visa-fee-glbs-2791652-2025-09-22",
      "headline": "US may exempt doctors from $100,000 H-1B visa fee: ReportThe H-1B visa programme is regarded as critical for hospitals that depend on foreign-trained doctors to work in remote regions. Several health systems rely on visas to bring in medical residents and specialists, often to serve areas that struggle to attract US-trained professionals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-second-autopsy-funeral-procession-cremation-today-guwahati-2791729-2025-09-23",
      "headline": "Zubeen Garg's second autopsy underway, funeral procession to begin shortlyThe autopsy, originally scheduled for 7.30 am, was preponed by four hours and started at 3 am. The second post-mortem came in the wake of public demands for clarity over the legendary singer's death during a scuba diving accident in Singapore on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/disney-says-jimmy-kimmel-live-returns-tuesday-after-suspension-over-comments-on-charlie-kirks-assassination-glbs-2791682-2025-09-23",
      "headline": "Jimmy Kimmel's show returns as Disney lifts suspension over Charlie Kirk remarksDisney says \"Jimmy Kimmel Live!\" will return on Tuesday after a brief pause. The network said last week's decision was meant to calm tensions, calling some comments ill-timed and insensitive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tdp-andhra-pradesh-nara-lokesh-chandrababu-naidu-son-technology-entrepreneurs-vizag-visakhapatnam-hyderabad-bengaluru-2791603-2025-09-23",
      "headline": "Is Nara Lokesh seeking baap ka badla via Vizag?Nara Lokesh, Andhra Pradesh minister and CM Chandrababu Naidu's son, recently invited a tech entrepreneur to set shop in Vizag. Nara Lokesh has been pitching Vizag as an alternative to Bengaluru and Hyderabad. It seems like the TDP leader is out to avenge his father's loss in the Hyderabad-Bangalore cybercity battle of the 1990s. Having lost to Bengaluru in the IT race and having lost Hyderabad to Telangana, Vizag is the port of call for the big daddy of all revenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-gifting-festive-season-ministry-of-finance-bans-notice-orders-all-departments-to-comply-2791723-2025-09-23",
      "headline": "Ministry of Finance bans spending on Diwali gifts, orders all to complyThe latest notice from the Ministry of Finance comes as part of the government's continuing efforts to enforce fiscal discipline and restrict non-essential spending."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pro-palestinian-protesters-clash-with-cops-in-italy-over-gaza-war-ports-blocked-2791713-2025-09-23",
      "headline": "Protests in Italy over Meloni's refusal to back Palestine state, 60 cops injuredPolice in riot gear used tear gas to disperse protesters at the central station in Milan while a group of demonstrators dressed in black and waving the Palestinian flag used a pole to smash a window at the station and threw a chair at police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/afghan-boy-hides-in-landing-gear-kabul-delhi-flight-caught-at-igi-airport-2791628-2025-09-22",
      "headline": "13-year-old Afghan boy hides in plane's landing gear for 2 hours, lands in DelhiThe boy was apprehended by the airline personnel and handed over to the Central Industrial Security Force personnel, who brought him to Terminal 3 of the airport for questioning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-i-love-muhammad-row-and-why-it-sparked-protests-across-india-barawafat-procession-kanpur-nagpur-hyderabad-owaisi-full-story-2791497-2025-09-22",
      "headline": "What is 'I Love Muhammad' row and why did it spark protests across India?The 'I Love Muhammad' slogan, first contested during a Barawafat procession in Kanpur, has triggered protests and processions by Muslims across several states. Clashes with police, FIRs, and social media debates have intensified the controversy, drawing attention from political leaders and religious organisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-adviser-sanjeev-sanyal-says-judicial-system-biggest-hurdle-to-viksit-bharat-aim-2791567-2025-09-22",
      "headline": "Sanjeev Sanyal says judicial system biggest hurdle to Viksit Bharat aimSanjeev Sanyal, member of the Prime Minister's Economic Advisory Council (EAC), warned that India's legal and judicial ecosystem is the principal obstacle to the country's ambition of becoming a \"Viksit Bharat.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-clow-courts-favour-carlos-alcaraz-jannik-sinner-grand-slam-finals-laver-cup-2791731-2025-09-23",
      "headline": "Tennis rigged? Roger Federer says courts slowed to favour Alcaraz, SinnerRoger Federer has criticised modern tennis for uniform, slower courts, saying they favour stars like Alcaraz and Sinner. He urges tournament directors to reintroduce surface variety to keep matches unpredictable and exciting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/navratri-fasting-mistakes-weight-gain-other-woes-how-to-avoid-them-2791718-2025-09-23",
      "headline": "The fault in your Navratri fasting (plus, how to fix it)With fried potatoes, kuttu pooris, sabudana tikkis, and sugary desserts on the menu, fasting often turns into a carb-heavy feast - but nutrition experts suggest smarter swaps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psgs-ousmane-dembele-ballon-dor-lamine-yamal-2791684-2025-09-23",
      "headline": "PSG's Ousmane Dembele beats Lamine Yamal to win his first Ballon d'Or trophyParis Saint-Germain's Ousmane Dembele lifted his first Ballon d'Or award on Monday, September 22 in Paris. The Champions League winner beat Barcelona's Lamine Yamal to finally deliver on the promise of his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/h1b-visa-row-the-end-of-the-american-dream-from-the-india-today-archives-2025-2791439-2025-09-22",
      "headline": "H1B visa row: The end of the American dream? | From the archives (2025)As India grapples with the Trump administration's H1B visa fee spike, we analyse another setback: barriers for foreign students seeking education in the US"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/france-recognizes-palestine-at-un-macron-calls-it-historic-step-for-peace-glbs-2791694-2025-09-23",
      "headline": "France recognises Palestinian statehood at UN, Macron calls it a historic step France formally recognised Palestine at the UN, with Macron declaring statehood a \"historic commitment to peace.\" The move, applauded by world leaders, comes as Israel's Gaza war and West Bank settlements continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/good-news-for-350cc-bike-buyers-the-brands-will-not-increase-prices-despite-gst-hike-2791618-2025-09-23",
      "headline": "Good news for 350cc bike buyers. The brands will not increase prices despite GST hikeTriumph, KTM, and Aprilia are shielding Indian riders from GST hikes on motorcycles above 350cc, absorbing the tax increase to keep prices unchanged and preserve value in the premium segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/israeli-exit-arab-troops-no-hamas-trump-to-present-gaza-peace-plan-glbs-2791691-2025-09-23",
      "headline": "Israeli exit, Arab troops, no Hamas: Trump to present Gaza peace planPresident Trump will present Arab leaders with a US proposal to end the Gaza war, pushing for Israeli withdrawal, post-war governance without Hamas, Arab peacekeepers, and regional funding for reconstruction. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/retired-delhi-banker-defrauded-23-crore-digital-arrest-scam-2791522-2025-09-22",
      "headline": "Ex-banker duped of Rs 23 crore, held in digital arrest for 47 days in his Delhi homeCybercriminals posed as officials and kept the retired banker under 'digital arrest' for over a month, warning him not to speak to anyone and claiming he was under 24/7 surveillance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/trump-says-taking-tylenol-during-pregnancy-is-not-good-links-it-to-autism-glbsus-2791690-2025-09-23",
      "headline": "Not good: Trump says Tylenol painkiller use in pregnancy linked to autismTrump claimed Tylenol use in pregnancy may cause autism, echoing theories promoted by Health Secretary Robert F. Kennedy Jr. Experts strongly dispute the claim, warning it ignores science and risks fueling misinformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/talent-stay-game-iits-see-h-1b-hike-as-an-opportunity-not-threat-2791577-2025-09-23",
      "headline": "Talent stay game: IITs see H-1B hike as an opportunity, not threatThe rise in H-1B visa fees could keep India's top students, including those from IITs, at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-dogs-quiet-tribute-guwahati-sarusajai-stadium-video-2791709-2025-09-23",
      "headline": "Watch: Zubeen Garg's dogs pay quiet tribute, gaze at singer for final timeA video showing Zubeen Garg's wife Garima and other family members carrying the couple's four dogs -- Iko, Diya, Rambo, Maya -- into the Sarusajai stadium has gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-funeral-2791728-2025-09-23",
      "headline": "Zubeen Garg funeral: Singer to be cremated today with full state honoursSinger Zubeen Garg died at the age of 52 during a sea outing in Singapore. He will be cremated with full state honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/jennifer-aniston-and-reese-witherspoon-discuss-ai-india-the-morning-show-s4-india-exclusive-2791727-2025-09-23",
      "headline": "Jennifer Aniston and Reese Witherspoon discuss AI, India, The Morning Show S4 | India ExclusiveJennifer Aniston and Reese Witherspoon spoke to India Today's Bhavna Agarwal on The Morning Show S4, dangers related to AI taking over the globe. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-slams-umpire-fakhar-zaman-dismissal-india-asia-cup-2025-2791740-2025-09-23",
      "headline": "Shahid Afridi slams umpire for Fakhar Zaman dismissal vs India: They need the IPL jobAsia Cup 2025: Former Pakistan captain, Shahid Afridi indicated that the umpires might be biased to favour India after his cheeky comment, reacting to Fakhar Zaman's dismissal in the recent IND vs PAK clash in the Super 4 stages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-clow-courts-favour-carlos-alcaraz-jannik-sinner-grand-slam-finals-laver-cup-2791731-2025-09-23",
      "headline": "Tennis rigged? Roger Federer says courts slowed to favour Alcaraz, SinnerRoger Federer has criticised modern tennis for uniform, slower courts, saying they favour stars like Alcaraz and Sinner. He urges tournament directors to reintroduce surface variety to keep matches unpredictable and exciting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-sri-lanka-asia-cup-super-4-match-abu-dhabi-spin-battle-preview-2791651-2025-09-23",
      "headline": "Pakistan, Sri Lanka desperate for redemption after poor Super 4 startsPakistan and Sri Lanka face a high-stakes Super 4 clash in the Asia Cup on September 23, where a win keeps their campaign alive and a loss could end it. Both teams need to address key issues after losses to India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-misses-india-a-vs-australia-a-second-unofficial-test-dhruv-jurel-captain-2791712-2025-09-23",
      "headline": "Shreyas Iyer ruled out of 2nd unofficial Test, Dhruv Jurel to lead India AShreyas Iyer has withdrawn from the second unofficial Test against Australia A in Lucknow. Wicketkeeper Dhruv Jurel will lead India A, stepping into the captaincy after his century in the opening game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-chahar-joins-surrey-county-championship-final-vs-hampshire-washington-sundar-2791704-2025-09-23",
      "headline": "Rahul Chahar joins Surrey for County Championship finale against HampshireIndian spinner Rahul Chahar has joined Surrey for their decisive County Championship clash against Hampshire. His late inclusion bolsters Surrey's depleted spin department as they chase a fourth successive domestic title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-d-or-full-list-of-winners-2791688-2025-09-23",
      "headline": "Ballon d'Or 2025: Full list of winners in ParisOusmane Dembele and Aitana Bonmati were named the best players at the 2025 Ballon d'Or ceremony in Paris. Here are the full list of winners from the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psgs-ousmane-dembele-ballon-dor-lamine-yamal-2791684-2025-09-23",
      "headline": "PSG's Ousmane Dembele beats Lamine Yamal to win his first Ballon d'Or trophyParis Saint-Germain's Ousmane Dembele lifted his first Ballon d'Or award on Monday, September 22 in Paris. The Champions League winner beat Barcelona's Lamine Yamal to finally deliver on the promise of his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-president-sourav-ganguly-2791671-2025-09-22",
      "headline": "Sourav Ganguly returns as CAB president after 6 years, replaces brotherFormer India captain Sourav Ganguly was re-elected as president of the Cricket Association of Bengal (CAB) on Monday, marking his return after a six-year gap. He replaced his brother Snehashish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-india-vs-pakistan-provocative-gestures-haris-rauf-farhan-2791654-2025-09-22",
      "headline": "Shall India continue playing against Pakistan after provocative gestures?Asia Cup 2025: Sahibzada Farhan's gunshot celebration and Haris Rauf's fighter jet gesture in the Super 4 clash on Sunday in Dubai have raised questions on whether India should continue playing against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-botswana-public-holiday-2791653-2025-09-22",
      "headline": "Country declares public holiday to celebrate World Athletics Championships goldBotswana has declared a public holiday to celebrate its men's 4x400m relay gold at the World Athletics Championships. The victory marks a historic first for Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-india-test-series-vs-west-indies-2791650-2025-09-22",
      "headline": "Pant out, selectors mull over Karun's spot in home series vs Windies: ReportRishabh Pant is likely to miss India's first home Test series of the season. Pant, who is still recovering from his foot fracture, is yet to receive a clearance from the BCCI medical board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psgs-ousmane-dembele-ballon-dor-lamine-yamal-2791684-2025-09-23",
      "headline": "PSG's Ousmane Dembele beats Lamine Yamal to win his first Ballon d'Or trophyParis Saint-Germain's Ousmane Dembele lifted his first Ballon d'Or award on Monday, September 22 in Paris. The Champions League winner beat Barcelona's Lamine Yamal to finally deliver on the promise of his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-president-sourav-ganguly-2791671-2025-09-22",
      "headline": "Sourav Ganguly returns as CAB president after 6 years, replaces brotherFormer India captain Sourav Ganguly was re-elected as president of the Cricket Association of Bengal (CAB) on Monday, marking his return after a six-year gap. He replaced his brother Snehashish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-india-vs-pakistan-provocative-gestures-haris-rauf-farhan-2791654-2025-09-22",
      "headline": "Shall India continue playing against Pakistan after provocative gestures?Asia Cup 2025: Sahibzada Farhan's gunshot celebration and Haris Rauf's fighter jet gesture in the Super 4 clash on Sunday in Dubai have raised questions on whether India should continue playing against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-botswana-public-holiday-2791653-2025-09-22",
      "headline": "Country declares public holiday to celebrate World Athletics Championships goldBotswana has declared a public holiday to celebrate its men's 4x400m relay gold at the World Athletics Championships. The victory marks a historic first for Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-india-test-series-vs-west-indies-2791650-2025-09-22",
      "headline": "Pant out, selectors mull over Karun's spot in home series vs Windies: ReportRishabh Pant is likely to miss India's first home Test series of the season. Pant, who is still recovering from his foot fracture, is yet to receive a clearance from the BCCI medical board."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}