{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sukanya-samriddhi-yojana-ssy-help-save-rs-20-lakh-in-15-years-for-your-daughter-education-2700387-2025-03-28",
      "headline": "How this scheme can help you save Rs 20 lakh in 15 years for daughterIf you are planning for your daughter's higher education expenses, the Sukanya Samriddhi Yojana (SSY) can be a great savings option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-youngest-billionaire-razorpay-founders-harshil-mathur-shashank-kumar-age-34-2700382-2025-03-28",
      "headline": "Razorpay's Shashank Kumar, Harshil Mathur become India's youngest billionairesHarshil Mathur and Shashank Kumar met at IIT Roorkee, where they shared an interest in technology and problem-solving. Their journey into fintech began in 2014 when they launched Razorpay to simplify digital payments in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-30-points-lower-nifty-flat-in-early-trade-infosys-mahindra-down-up-to-3-percent-2700328-2025-03-28",
      "headline": "Sensex, Nifty fall in early trade over Trump tariff threats; Infosys down 2%The S&P BSE Sensex lost 282.59 points to 77,323.84, while the NSE Nifty50 was down 84.70 points to 23,507.25 as of 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-services-unavailable-on-march-31-fund-transfer-cash-deposit-withdrawal-rtgs-neft-financial-year-end-2700325-2025-03-28",
      "headline": "Planning a bank transfer on March 31? Here's why it may not workWhile banks will remain open, transactions like fund transfers, cash deposits, and withdrawals may not go through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-28-infosys-tata-motors-bel-adani-power-hcltech-and-more-2700293-2025-03-28",
      "headline": "Stocks to watch today: Infosys, Tata Motors, BEL, Adani Power, HCLTech and moreMarkets are set for a strong start on March 6 as key stocks like Infosys, Tata Motors, and Adani Power grab attention. Trade talks, global deals, and company moves could shape today's trading session. Here's what investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-on-march-28-sensex-nifty-trends-expert-view-key-factors-2700290-2025-03-28",
      "headline": "Sensex, Nifty today: Will positive run continue on stock market?Stock market opening today: The Sensex and Nifty gained in the previous session amid reports of positive talks between Indian and US officials about a trade deal. Analysts have noted that the focus during today's trading session will be on upcoming tariff developments and the India-US trade deal outcome.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-suspends-wto-financial-contributions-report-glbs-2700200-2025-03-27",
      "headline": "US suspends WTO financial contributions: ReportThe Trump administration has reportedly suspended financial contributions to The World Trade Organisation amid efforts to cut back government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-as-auto-tariffs-hurt-gm-help-tesla-and-others-glbs-2700188-2025-03-27",
      "headline": "Wall Street drifts as auto tariffs hurt GM, help Tesla and othersDonald Trump's auto tariffs impacted Wall Street on Thursday morning, with autogiant General Motors falling by 6.8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-25-auto-tariff-which-indian-companies-will-pay-the-price-glbs-2700039-2025-03-27",
      "headline": "Trump's 25% auto tariff: Which Indian companies will pay the priceUS President Donald Trump's 25% tariff on car imports will affect a few Indian companies, including Tata Motors, Eicher Motors, and Samvardhana Motherson. These firms ship components to the US and Europe's markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-close-higher-top-gainers-and-losers-donald-trump-tariff-impact-and-more-2700007-2025-03-27",
      "headline": "Sensex, Nifty close higher: Top gainers and losers, tariff impact and key driversStock market today: Some of the top gainers during today's session were Bajaj Finserv, IndusInd Bank, NTPC, L&T, Ultratech Cement, Hero MotoCorp, Adani Enterprises and BPCL. On the other hand, some of the top losers were Tata Motors, Sun Pharma, Eicher Motors, Apollo Hospitals, Bharti Airtel, Kotak Mahindra Bank and HCLTech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-318-points-higher-nifty-just-below-23600-tata-motors-down-5-2699968-2025-03-27",
      "headline": "Sensex ends 318 points higher, Nifty just below 23,600; Tata Motors down 5%Stock market closing bell: The S&P BSE Sensex ended 317.93 points higher at 77,606.43, while the NSE Nifty50 rose 105.10 points to settle at 23,591.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-greater-noida-flats-to-get-costlier-registration-fees-increase-20-30-percent-2699948-2025-03-27",
      "headline": "Noida, Greater Noida flat registration fees may rise 20-30%According to a draft notification, circle rates in Noida could see a 20% hike, while in Greater Noida, the increase may go up to 30%. The move is expected to make property transactions more expensive in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-open-lower-amid-us-tariff-uncertainty-wipro-trent-gain-nearly-2-percent-2699764-2025-03-27",
      "headline": "Sensex, Nifty gain after opening lower in volatile trade; Wipro rises nearly 2%Stock market opening: While the Sensex opened 100 points lower, it was trading 64.27 points higher at 77,552.77 at around 9.26 am. The Nifty50 was trading 16.75 points higher at 23,503.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-27-wipro-bandhan-bank-infosys-vedanta-upl-and-more-2699760-2025-03-27",
      "headline": "Top stocks to watch today: Tata Motors, Wipro, JB Chemicals, Infosys, Vedanta, UPLWhile positive cues are likely to support the two leading indices on Dalal Street, US tariff uncertainty looms large. Here are some of the key stocks that will be in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-expectations-march-27-sensex-nifty-today-nse-bse-dalal-street-2699718-2025-03-27",
      "headline": "Stock market on March 27: What to expect from Sensex, Nifty today?Stock market prediction: Nifty and Sensex have gained nearly 2% in the past five sessions, but investors will now be watching to see if the market can recover from Wednesday's drop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-is-drifting-again-after-getting-whipsawed-for-weeks-glbs-2699577-2025-03-26",
      "headline": "Wall Street is drifting again after getting whipsawed for weeksThe New York Stock Exchange saw a steady opening on Wednesday with marginal drops for S&P 500 and the Nasdaq composite."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-losers-bse-nse-sensex-nifty-shares-2699443-2025-03-26",
      "headline": "Stock market closing: Top gainers and losers on Sensex, NiftyBenchmark indices snapped their seven-day winning streak, as investors turned cautious ahead of the monthly expiry. The S&P BSE Sensex dropped 728.69 points to close at 77,288.50, while the NSE Nifty50 fell 181.80 points, ending the session at 23,486.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-may-lower-duties-on-harley-davidson-bikes-bourbon-whiskey-sources-2699423-2025-03-26",
      "headline": "India may lower duties on Harley-Davidson bikes, bourbon whiskey: SourcesIndia may further reduce import duties on Harley-Davidson motorcycles, US wines, and bourbon whiskey as part of ongoing India-US trade talks, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-tumbles-over-700-points-nifty-settles-below-23500-indusind-bank-jumps-3-percent-2699400-2025-03-26",
      "headline": "Sensex tumbles over 700 points, Nifty settles below 23,500; IndusInd Bank up 3%Stock market closing bell: The S&P BSE Sensex ended 728.69 points lower to 77,288.50,  while the NSE Nifty50 declined 181.80 points to settle at 23,486.85."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-nigam-visits-lk-advani-and-his-daughter-calls-them-extended-family-2701100-2025-03-29",
      "headline": "Sonu Nigam visits LK Advani and his daughter, calls them his 'extended family'Singer Sonu Nigam recently visited the residence of veteran BJP leader LK Advani in New Delhi. The artiste shared a post highlighting the same on his social media handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bhootnii-trailer-sanjay-dutt-takes-on-palak-tiwari-and-mouni-roy-ghost-2701062-2025-03-29",
      "headline": "The Bhootnii trailer: Sanjay Dutt takes on Palak Tiwari and Mouni Roy's ghostsThe first full trailer of Sanjay Dutt's upcoming horror-comedy, Bhootnii, is here. Apart from Dutt, the film also features Sunny Singh, Palak Tiwari and Mouni Roy in pivotal roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreyas-talpade-denies-involvement-in-multi-crore-scam-releases-statement-2701051-2025-03-29",
      "headline": "Shreyas Talpade denies involvement in multi-crore scam, releases statementActor Shreyas Talpade has released a statement after it was alleged that he was involved in a multi-crore chit fund scam. Talpade has denied the allegations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-creators-finalise-dayaben-mock-shoots-underway-2701053-2025-03-29",
      "headline": "Taarak Mehta creators finalise Dayaben, mock shoots underway: ReportTaarak Mehta Ka Ooltah Chashmah makers have finally found their Dayaben, which was originally played by Disha Vakani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-ex-wife-sussannes-birthday-wish-for-son-hrehaan-on-19th-birthday-2701042-2025-03-29",
      "headline": "Hrithik Roshan, ex-wife Sussanne's birthday wish for son Hrehaan on 19th birthdayHrithik Roshan and Sussanne Khan extended their wishes to their elder son, Hrehaan, on his 19th birthday. The two shared adorable posts on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hollywood-stars-slam-academy-reaction-to-no-other-land-director-attack-2701032-2025-03-29",
      "headline": "Hollywood stars slam Academy's reaction to No Other Land director's attackHollywood stars such as Mark Ruffalo, Olivia Colman and Javier Bardem, among over 600 members of the Academy, have signed an open letter criticising its lack of response to Oscar-winning director Hamdan Ballal's attack by the Israeli military. The Academy has since apologised. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-gunn-superman-has-a-cameo-by-bradley-cooper-tom-cruise-2701022-2025-03-29",
      "headline": "James Gunn's Superman has a cameo by a big Hollywood star: ReportFilmmaker James Gunn's Superman will feature a surprise cameo by a major Hollywood star. Earlier, it was being speculated that Hollywood superstar Tom Cruise would star in it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-directed-to-make-changes-in-empuraan-after-claims-of-hurting-sentiments-2701008-2025-03-29",
      "headline": "Prithviraj directed to make changes to Empuraan after claims of hurting sentimentsL2: Empuraan producer Gokulam Gopalan has said that he has asked director-actor Prithviraj to make changes to the film after it was claimed that it hurt the sentiments of a certain section of the audience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-zahan-kapoor-aditya-rawal-not-nepo-kids-but-talented-actors-cinematic-saturday-2700994-2025-03-29",
      "headline": "Not all nepos: Rising above the 'nepo kid' tag with talentThe debate around 'nepo kids' in Bollywood continues, with new generations facing sharper scrutiny. Actors like Babil Khan, Zahan Kapoor, and Aditya Rawal are quietly sidestepping the hype by focusing on content-driven cinema, proving their talent beyond their familial connections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-citadel-season-2-postponed-2026-amazon-mgm-2700989-2025-03-29",
      "headline": "Priyanka Chopra's Citadel Season 2 postponed to 2026: ReportAll Citadel spinoff series have been put on hold until Season 2 premieres. The shooting for the second season wrapped in November 2024.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-praises-rashmika-mandanna-shot-for-sikandar-pushpa-2-together-2700972-2025-03-29",
      "headline": "Salman Khan praises Rashmika, shares how she shot for Sikandar, Pushpa 2 togetherBollywood superstar Salman Khan heaped praise on his Sikandar co-star Rashmika Mandanna and said that the actor's dedication to her craft was inspiring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-reveals-why-he-never-prays-for-a-film-success-2700968-2025-03-29",
      "headline": "Salman Khan reveals why he never prays for a film's successSalman Khan, in an exclusive interview, spoke about how he has never prayed for his films. The actor mentioned that his film's success lies in the hands of the audience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-reveals-salim-khan-reaction-debut-film-biwi-ho-toh-aisi-sikandar-2700941-2025-03-29",
      "headline": "Salman Khan reveals Salim Khan's reaction to his debut film Biwi Ho Toh AisiSalman Khan recalled how his father, veteran screenwriter Salim Khan, joined him for the Sikandar trailer launch. The actor even reminisced the time he showed his debut film, Biwi Ho Toh Aisi, to his father. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-2-gajraj-rao-renuka-shahane-sparsh-srivastava-prime-video-new-season-fun-video-2700932-2025-03-29",
      "headline": "Dupahiya 2: Gajraj Rao, Renuka Shahane and cast announce new season with fun videoAfter Dupahiya captivated audiences with its sharp humour and outstanding performances, Prime Video renewed the show for a second season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-being-late-to-shoots-work-ethics-rashmika-mandanna-sikandar-ar-murugadoss-2700925-2025-03-29",
      "headline": "I don't even sit on set: Salman Khan shuts down work ethic rumoursSalman Khan, in an interview with India Today, reflected on his work ethic and addressed rumours about him being late to shoots. The actor recalled his journey in cinema and said how disciplined he is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-mohanlal-prithviraj-sukumaran-film-earns-rs-33-crore-2700905-2025-03-29",
      "headline": "Empuraan box office Day 2: Mohanlal, Prithviraj Sukumaran's film earns Rs 33 croreDirected by Prithviraj Sukumaran, L2: Empuraan earned Rs 33 crore in two days. Starring Mohanlal in the lead, the action thriller released in theatres on March 27. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/will-smith-addresses-oscars-slap-in-new-album-chris-rock-2700877-2025-03-28",
      "headline": "Will Smith addresses Chris Rock Oscars slap in new albumWill Smith's latest album, Based on a True Story, dives into the controversy surrounding his Oscars slap incident. During Oscars 2022, Will slapped Chris Rock when the latter cracked a joke on Will's wife, Jada Pinkett-Smith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-brown-announces-2025-breezy-bowl-xx-tour-dates-tickets-more-glbs-2700854-2025-03-28",
      "headline": "Chris Brown announces 2025 Breezy Bowl XX tour: Dates, tickets & moreChris Brown announces his 2025 Breezy Bowl XX Stadium Tour, celebrating 20 years in music. The tour spans Europe and North America, with tickets expected to sell out fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/megan-fox-vs-machine-gun-kelly-who-has-the-higher-net-worth-glbs-2700853-2025-03-28",
      "headline": "Megan Fox vs. Machine Gun Kelly: Who has the higher net worth Megan Fox and Machine Gun Kelly welcomed a baby girl amid their turbulent relationship. With MGK's $25 million fortune exceeding Megan's $8 million net worth, his music and investments give him the financial edge.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/powerful-earthquake-kills-hundreds-myanmar-thailand-race-to-rescue-trapped-2700906-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 1,000 killed in Myanmar, Thailand quakes; India aids with Operation BrahmaThe death toll from the powerful quake surpassed 1,000, according to a Myanmar military leader, with a US agency warning that the toll could exceed 10,000. Strong tremors were also felt in parts of India, including Meghalaya and Manipur, as well as in Bangladesh, particularly in Dhaka and Chattogram, and in China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/university-of-houston-lived-hindu-religion-course-controversy-academic-freedom-complex-topics-response-student-hinduphobic-2700934-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US university responds after India Today report on row over 'Hinduphobic' courseA student and Hindu-American activist raised concerns about the University of Houston's Lived Hindu Religion course. Vasant Bhatt told India Today Digital that he complained to the university about the course being \"Hinduphobic\" and distorting \"India's political landscape\". The university, in a detailed response to India Today Digital, has defended the course."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cash-at-judges-door-case-cbi-court-acquits-nirmal-yadav-in-17-year-old-case-2701063-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cash-at-judge's door case: CBI court acquits Nirmal Yadav in 17-year-old-caseThree other accused, Ravinder Singh Bhasin, Rajiv Gupta and Nirmal Singh, were also acquitted in the 2008 cash-at-judge's door case. Another accused, Sanjeev Bansal, died during the trial of the case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-pauses-green-card-processing-will-it-hid-indians-uscis-trump-immigration-persecution-refugee-asylum-seekers-2700137-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US pauses some Green Card processing, Indians might be hitThe US has put on hold some Green Card processing amid rigorous vetting of permanent residency applications. The move is aimed at those who seek refuge in the US, claiming persecution in their home countries. Scores of Indians seeking to stay in the US make such claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-zahan-kapoor-aditya-rawal-not-nepo-kids-but-talented-actors-cinematic-saturday-2700994-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not all nepos: Rising above the 'nepo kid' tag with talentThe debate around 'nepo kids' in Bollywood continues, with new generations facing sharper scrutiny. Actors like Babil Khan, Zahan Kapoor, and Aditya Rawal are quietly sidestepping the hype by focusing on content-driven cinema, proving their talent beyond their familial connections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-man-finds-love-on-dating-app-ends-up-losing-rs-65-crore-cybercrime-2701009-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Noida man finds love on dating app, ends up losing Rs 6.5 croreAccording to Daljit's complaint, he met the woman, Anita Chauhan on a dating app back in December 2024. After persuading him to invest in the trading website, the man said that he had booked Rs 24,000 in profits on an initial investment of Rs 3.2 lakh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-warning-possible-terror-attacks-syria-eid-travel-advisory-citizens-2701117-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US warns of possible terror attacks in Syria during Eid, urges citizens to leaveThe US State Department has warned its citizens of increased attack risks in Syria during Eid al-Fitr, urging them to leave immediately. The advisory cites terrorism, civil unrest, and detention risks, maintaining a Level 4: Do Not Travel alert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-another-earthquake-naypyidaw-deadly-tremors-flatten-buildings-deaths-2701050-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5.1 magnitude earthquake strikes Myanmar's Naypyidaw a day after deadly tremorsA 5.1-magnitude tremor struck near Myanmar's capital Naypyidaw on Saturday, a day after powerful earthquakes killed over 1,000 people and caused widespread destruction in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-partial-solar-eclipse-dims-the-sun-as-parts-of-it-go-dark-2700111-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Partial Solar Eclipse dims the Sun as parts of it go darkSolar eclipses have fascinated humans for centuries, often linked to cultural and scientific interpretations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/elderly-karnataka-couple-dies-by-suicide-after-losing-lakh-to-cyber-fraud-2700939-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elderly Karnataka couple dies by suicide after losing Rs 50 lakh to cyber fraudThe couple, both retired and formerly employed at the Maharashtra Mantralaya, did not inform anyone about the threats and extortion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-reveals-why-he-never-prays-for-a-film-success-2700968-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan reveals why he never prays for a film's successSalman Khan, in an exclusive interview, spoke about how he has never prayed for his films. The actor mentioned that his film's success lies in the hands of the audience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/swati-sachdeva-faces-backlash-vulgar-joke-involving-sex-toy-mother-ranveer-allahbadia-controversy-2701075-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Ranveer Allahbadia, comedian Swati Sachdeva faces backlash for vulgar jokeAfter YouTuber Ranveer Allahbadia, stand-up comedian Swati Sachdeva is being slammed for a controversial joke she made during an episode of her YouTube show.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-fans-chepauk-cringefest-2700947-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CSK vs RCB: MS Dhoni mania at Chepauk turns CSK fandom into cringefestIPL 2025: CSK's passionate fandom has morphed into blind Dhoni worship, with fans prioritising his presence over the team's success. Cheering his late entry at No. 9 in a lost cause in the game against RCB at Chepauk on March 28 exposed a cringeworthy shift from cricketing sense to sheer idolisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/andrew-tate-misogynist-influencer-ex-girlfriend-brianna-stern-sexual-physical-assault-gender-violence-property-chats-lawsuit-2700966-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Never talk back': US model claims Andrew Tate thrashed, choked her during sexModel and influencer, Brianna Stern, detailed in her lawsuit that Andrew Tate sexually and physically assaulted her during a sexual encounter as he hit her in the face and head, and at one point the pressure on her neck was so strong that it made her lose consciousness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-directed-to-make-changes-in-empuraan-after-claims-of-hurting-sentiments-2701008-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prithviraj directed to make changes to Empuraan after claims of hurting sentimentsL2: Empuraan producer Gokulam Gopalan has said that he has asked director-actor Prithviraj to make changes to the film after it was claimed that it hurt the sentiments of a certain section of the audience. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangkok-building-collapse-myanmar-thailand-earthquake-workers-dead-survivors-recall-tragedy-2701029-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Destroyed in seconds: Survivors recall Bangkok skyscraper collapse due to quakeA 33-storey under-construction building was reduced to rubble in seconds after a powerful earthquake hit Bangkok, leaving eight workers dead.  For those working there, the ground trembled under their feet just moments before everything went dark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-is-brain-flossing-and-can-it-scientifically-reduce-stress-2700777-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is 'brain flossing', and can it scientifically reduce stress?Ever heard of brain flossing? If yes, great, if not, we need some talking to do as it is trending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-468-28-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-weather-today-hot-and-cold-decoding-7-degree-temperature-drop-in-2-days-2700979-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi blows hot and cold: Decoding 7-degree temperature drop in 2 daysThe Meteorological Department has forecasted that the temperature will remain below normal but is expected to rise again in the coming week. So, what caused this sudden drop in temperatures? Find out"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreyas-talpade-denies-involvement-in-multi-crore-scam-releases-statement-2701051-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Talpade denies involvement in multi-crore scam, releases statementActor Shreyas Talpade has released a statement after it was alleged that he was involved in a multi-crore chit fund scam. Talpade has denied the allegations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/baby-birth-thailand-street-earthquake-bangkok-2701000-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Baby born on Bangkok street minutes after huge earthquakeA woman gave birth outside a hospital in Bangkok amid earthquake tremors, as medical teams ensured the safety of both mother and child. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/how-global-education-helps-indian-students-build-future-ready-careers-2701040-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How global education helps Indian students build future-ready careersWith Indian students leading global education trends, studying abroad offers unmatched academic and career advantages. An international degree fosters global competence, making graduates highly employable in today's interconnected world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hollywood-stars-slam-academy-reaction-to-no-other-land-director-attack-2701032-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hollywood stars slam Academy's reaction to No Other Land director's attackHollywood stars such as Mark Ruffalo, Olivia Colman and Javier Bardem, among over 600 members of the Academy, have signed an open letter criticising its lack of response to Oscar-winning director Hamdan Ballal's attack by the Israeli military. The Academy has since apologised. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/air-forn-civil-engineer-shot-dead-at-prayagraj-home-accused-on-run-2700975-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Air Force engineer shot dead at Prayagraj home, accused on the runIAF civil engineer SN Mishra was shot dead early Saturday when an unknown assailant called out to him from the lawn of his bungalow."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-more-balanced-ab-de-villiers-mega-auction-business-2701123-2025-03-29",
      "headline": "RCB is 10 times more balanced than ever: AB de Villiers on strong startRCB's rejuvenated squad, marked by balanced team composition and strategic acquisitions, has impressed AB de Villiers. The legendary cricketer believes the team's revamped structure and strong performances signal a new era for the franchise in the IPL 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-vs-mumbai-indians-live-score-updates-ahmedabad-2701098-2025-03-29",
      "headline": "GT vs MI, Live: Toss coming up in 10 minutes(Gujarat) GT vs (Mumbai) MI, Live score IPL 2025: In what will potentially be Mumbai Indians' regular skipper Hardik Pandya's return from suspension, the side will be fighting for their first win of the season against the similar-fated side of Shubman Gill-led Gujarat Titans in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-kl-rahul-debut-vipraj-nigam-press-conference-2701071-2025-03-29",
      "headline": "KL Rahul's DC debut against SRH hinted by Vipraj Nigam: He will bring in balanceKL Rahul is in line to make his debut for Delhi Capitals against Sunrisers Hyderabad in Vizag on March 30, according to all-rounder Vipraj Nigam. Rahul missed the first game against LSG due to the birth of his daughter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-fans-emotional-viral-video-chepauk-2701067-2025-03-29",
      "headline": "How long can we be fools? Videos of emotional CSK fans go viral after RCB lossIPL 2025, CSK vs RCB: A section of fans did not hold back and expressed their disappointment following CSK's 50-run defeat. Passionate Chennai fans questioned the decision to send MS Dhoni at No. 9 in a high-pressure chase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-ms-dhoni-batting-position-shane-watson-2701058-2025-03-29",
      "headline": "If MS Dhoni came in early, CSK might have had stronger shot vs RCB: Shane WatsonShane Watson feels that CSK would have had a strong chance against RCB had MS Dhoni come up the order on Friday, March 28. Dhoni came in to bat at No.9 and CSK ended up losing the game. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-aakash-chopra-ms-dhoni-2701035-2025-03-29",
      "headline": "Aakash Chopra slams fan for spreading fake video on MS DhoniIPL 2025: Aakash Chopra wasn't happy after a fan spread a false video on MS Dhoni during the clash between Royal Challengers Bengaluru and Chennai Super Kings at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-postpones-central-contracts-meeting-guwahati-2701014-2025-03-29",
      "headline": "BCCI postpones central contracts, England tour preparations meetingThe BCCI has decided to postpone the meeting to decide on the central contracts for the upcoming season and the England tour preparations. The meeting was set to take place in Guwahati on Saturday, March 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-dance-moves-csk-vs-rcb-chepauk-win-2701003-2025-03-29",
      "headline": "Watch: Virat Kohli dances in joy after RCB take down CSK to end long waitIPL 2025, CSK vs RCB: Virat Kohli showed off his dance moves inside the dressing room after Royal Challengers Bengaluru beat Chennai Super Kings by 50 runs on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-jasprit-bumrah-return-mumbai-indians-mahela-jayawardene-2700997-2025-03-29",
      "headline": "Everthing ok with Bumrah, but no timelines given on MI return: JayawardeneMumbai Indians coach Mahela Jayawardene has said that everything is progressing well with Jasprit Bumrah at the moment, but no timeline has been given about the pacer's IPL return. Bumrah is recovering from the back injury he suffered during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-babar-azam-napier-1st-odi-highlights-2700988-2025-03-29",
      "headline": "Pakistan's horrible batting collapse gives New Zealand thumping winNZ vs PAK, 1st ODI: Mark Chapman scored a brilliant hundred and Nathan Smith picked up four wickets as New Zealand beat Pakistan by 73 runs at the McLean Park in Napier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-rajat-patidar-captaincy-andy-flower-2700983-2025-03-29",
      "headline": "Fire under Flower: Rajat Patidar's RCB live up to play bold tagline in IPL 2025Royal Challengers Bangalore hammered Chennai Super Kings away from home in IPL 2025. Andy Flower's new methods, combined with Rajat Patidar's guts, have already started paying dividends for RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-postpones-central-contracts-meeting-guwahati-2701014-2025-03-29",
      "headline": "BCCI postpones central contracts, England tour preparations meetingThe BCCI has decided to postpone the meeting to decide on the central contracts for the upcoming season and the England tour preparations. The meeting was set to take place in Guwahati on Saturday, March 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-dance-moves-csk-vs-rcb-chepauk-win-2701003-2025-03-29",
      "headline": "Watch: Virat Kohli dances in joy after RCB take down CSK to end long waitIPL 2025, CSK vs RCB: Virat Kohli showed off his dance moves inside the dressing room after Royal Challengers Bengaluru beat Chennai Super Kings by 50 runs on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-jasprit-bumrah-return-mumbai-indians-mahela-jayawardene-2700997-2025-03-29",
      "headline": "Everthing ok with Bumrah, but no timelines given on MI return: JayawardeneMumbai Indians coach Mahela Jayawardene has said that everything is progressing well with Jasprit Bumrah at the moment, but no timeline has been given about the pacer's IPL return. Bumrah is recovering from the back injury he suffered during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-babar-azam-napier-1st-odi-highlights-2700988-2025-03-29",
      "headline": "Pakistan's horrible batting collapse gives New Zealand thumping winNZ vs PAK, 1st ODI: Mark Chapman scored a brilliant hundred and Nathan Smith picked up four wickets as New Zealand beat Pakistan by 73 runs at the McLean Park in Napier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-rajat-patidar-captaincy-andy-flower-2700983-2025-03-29",
      "headline": "Fire under Flower: Rajat Patidar's RCB live up to play bold tagline in IPL 2025Royal Challengers Bangalore hammered Chennai Super Kings away from home in IPL 2025. Andy Flower's new methods, combined with Rajat Patidar's guts, have already started paying dividends for RCB."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}