{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-lower-as-markets-await-rbi-mpc-verdict-2645763-2024-12-06",
      "headline": "Sensex, Nifty open marginally lower as markets await RBI MPC verdictThe S&P BSE Sensex lost 67.62 points to 81,698.24, while the NSE Nifty50 was down 23.35 points to 24,685.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-listing-date-share-price-latest-gmp-suggest-strong-market-debut-2645753-2024-12-06",
      "headline": "Suraksha Diagnostic IPO listing: Does latest GMP suggest strong market debut?Suraksha Diagnostic IPO listing: The IPO received lukewarm interest, with an overall subscription of just 1.27 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-expectations-rbi-governor-shaktikanta-das-cut-repo-rate-december-6-2645748-2024-12-06",
      "headline": "RBI MPC announcement: Will RBI Governor Shaktikanta Das cut key lending rates?RBI MPC meeting: In the RBI MPC meet in October, the repo rate was unchanged at 6.5%, shifting the stance to 'neutral,' and holding other key rates steady."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-rbi-mpc-banking-sector-shares-in-focus-ola-electric-nykaa-dr-reddy-titan-2645747-2024-12-06",
      "headline": "Stocks to watch today: Banking sector shares in focus, Ola Electric, NykaaInvestors will be keenly watching developments, particularly in the banking and financial sectors, amid expectations of a rate cut or other monetary measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-economic-forum-chief-borge-brende-on-global-trade-ai-india-aspirations-2645670-2024-12-05",
      "headline": "World Economic Forum chief Borge Brende on global trade, AI, India's aspirationsWorld Economic Forum chief Borge Brende provided his in-depth analysis of critical global and economic and political dynamics and the impact of Donald Trump's return as US President will mean on trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nykaa-fashion-ceo-nihir-parikh-steps-down-with-immediate-effect-2645625-2024-12-05",
      "headline": "Nykaa Fashion CEO Nihir Parikh steps down with immediate effectThe resignation is effective from the close of business hours on December 5, 2024, as per the company's regulatory filing with the BSE and NSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rally-bull-run-dalal-street-technical-levels-explained-2645459-2024-12-05",
      "headline": "Sensex, Nifty rally for 5 straight sessions: Will bull run continue on D-Street?The rally comes amid anticipation of a dovish stance by the Reserve Bank of India (RBI), fuelling momentum in Banking and Financial Services stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-lifestyle-gautam-singhania-new-chairman-confirmed-agm-shareholders-approval-2645438-2024-12-05",
      "headline": "Gautam Singhania confirmed as Raymond Lifestyle executive chairman at AGMThe company debuted on the stock exchanges on September 5, 2024, and Gautam Singhania has played a leadership role in both Raymond Ltd and Raymond Lifestyle since then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-copy-sensex-nifty-end-strong-it-stocks-rbi-rate-cut-hopes-drive-market-rally-2645416-2024-12-05",
      "headline": "Sensex, Nifty end strong; IT stocks, RBI rate cut hopes drive market rallyThe S&P BSE Sensex added 809.53 points to end at 81,765.86, while the NSE Nifty50 gained 240.95 points to close at 24,708.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-ipo-rs-8000-crore-check-price-band-issue-size-opening-dates-key-details-2645406-2024-12-05",
      "headline": "Vishal Mega Mart to launch Rs 8,000 crore IPO: Check price band, other detailsVishal Mega Mart IPO: The IPO is entirely an Offer For Sale (OFS) by the promoter, Samayat Services LLP, which currently holds a 96.55% stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-pm-vidyalakshmi-scheme-how-to-apply-for-student-loan-check-all-key-details-2645357-2024-12-05",
      "headline": "What is PM-Vidyalakshmi Scheme: Check all key details The PM-Vidyalakshmi scheme offers financial support to students pursuing higher education in India, ensuring that deserving students have access to the education they need without financial barriers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-share-price-52-week-high-will-momentum-last-2645379-2024-12-05",
      "headline": "Swiggy share price hits 52-week high today. Will the positive momentum last?Swiggy share price: As the stock reaches new highs, analysts are raising concerns about whether this positive momentum will last. The sharp rally has prompted some to question the stock's sustainability at these elevated levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meet-crr-cut-in-focus-what-it-means-for-economy-governor-shaktikanta-das-december-6-2645373-2024-12-05",
      "headline": "CRR cut in focus at RBI MPC meet: What it means for the economyThe CRR is the percentage of a bank's total deposits that must be maintained as reserves with the RBI. At present, it is set at 4.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-500-points-nifty-jumps-key-factors-stock-market-rally-fii-us-markets-rbi-mpc-2645352-2024-12-05",
      "headline": "Sensex surges over 1,000 points: 3 factors behind bull run on stock marketStock market today: At 2:16 pm, the Sensex was up 977.80 to 81,937.20 points, while the NSE Nifty50 surged 274.55 to trade at 24,742."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-sharp-gains-what-next-for-one97-communications-stock-2645321-2024-12-05",
      "headline": "Paytm share price hits 52-week high, up 185% in 6 months: More gains ahead?Paytm share price: The rally comes even as benchmark indices experienced sharp declines, with Paytm gaining 27% in the past month alone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cibil-score-5-easy-tips-to-improve-facing-credit-issues-credit-cards-personal-finance-2645295-2024-12-05",
      "headline": "Stuck with a low CIBIL score? Fix it by following these 5 important stepsCIBIL (Credit Information Bureau India Limited) is a credit bureau in India that maintains credit records of individuals and businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-zomato-share-price-rally-today-will-they-deliver-more-returns-for-investors-2645286-2024-12-05",
      "headline": "Swiggy and Zomato shares hit all-time high today. Can they deliver more returns?Swiggy's focus on innovation and expansion, alongside Zomato's sustained growth, suggests that the quick commerce and food delivery sectors hold substantial long-term potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crosses-usd-100000-for-1st-time-all-time-high-will-the-rally-sustain-3-things-to-know-2645278-2024-12-05",
      "headline": "Bitcoin crosses $100,000 for 1st time: Will the rally sustain? 3 things to knowBitcoin has more than doubled in value since the start of 2024 and has risen by about 45% in the last four weeks following Donald Trump's US election victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-tumbles-today-after-recent-rally-profit-booking-explained-2645273-2024-12-05",
      "headline": "Explained: Why NTPC Green Energy share price tumbled 6% todayNTPC Green Energy share price: The stock hit an intraday low of Rs 139.25 before recovering slightly to Rs 141, down 4.5% on the Bombay Stock Exchange (BSE) by 10:52 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/bitcoin-crosses-100k-ytvd-2645255-2024-12-05",
      "headline": "Bitcoin reaches unprecedented $100,000 milestoneBitcoin surpasses the $100,000 mark, marking a significant moment in its financial journey."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-delhi-chalo-protest-march-demand-msp-law-justice-for-lakhimpur-victims-shambhu-border-delhi-parliament-traffic-jam-2645736-2024-12-06",
      "headline": "Farmers' 'Dilli Chalo' march to Parliament today, city braces for jams again Live UpdatesFarmers will resume their 'Dilli Chalo' march from the Punjab-Haryana Shambhu border, over a host of demands, including a legal guarantee for MSP. Tight security and heavy barricading are in place at the borders near Delhi in view of the protest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceo-brian-thompson-killer-suspect-identified-photo-flirting-evidence-search-what-we-know-so-far-2645771-2024-12-06",
      "headline": "CEO killer unmasked: Suspect snapped while flirting; bottle, phone offer cluesA key breakthrough came from a surveillance photo captured at the hostel the suspect had checked into before the murder, which briefly shows the man's face after he lowered his mask while flirting with a receptionist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-maratha-chanakya-maharashtra-cm-nana-fadnavis-maratha-state-william-dalrymple-2644919-2024-12-06",
      "headline": "The OG Fadnavis who came 250 years before Devendra FadnavisAlmost 250 years before Devendra Fadnavis came the first prominent Fadnavis, Nana Phadnavis or Phadnis. Nana Fadnavis united the Marathas and his strategy helped in pushing back the expansionist British East India Company. Nana Fadnavis is often referred to as the Maratha Machiavelli or Maratha Chanakya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-expectations-rbi-governor-shaktikanta-das-cut-repo-rate-december-6-2645748-2024-12-06",
      "headline": "RBI MPC announcement: Will RBI Governor Shaktikanta Das cut key lending rates?RBI MPC meeting: In the RBI MPC meet in October, the repo rate was unchanged at 6.5%, shifting the stance to 'neutral,' and holding other key rates steady."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/single-not-lonely-modern-indians-are-changing-the-way-people-look-at-singles-2645559-2024-12-06",
      "headline": "Single, not lonely! Modern Indians are changing the way people look at singlesUnlike how society views them – with pitiful eyes – modern Indian singles certainly don't need that 'saving' and 'help'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-pink-ball-test-live-cricket-score-rohit-sharma-pat-cummins-adelaide-oval-2645746-2024-12-06",
      "headline": "2nd Test LIVE: Starc removes Jaiswal with 1st-ball strikeIndia vs Australia 2nd Test Live Cricket Score: Mitchell Starc strikes the very first ball to remove India opener Yashasvi Jaiswal. Just the kind of injection Australia needed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nitin-gadkari-on-why-he-doesnt-like-to-visit-delhi-terrible-pollution-2645745-2024-12-06",
      "headline": "Nitin Gadkari on why he doesn't like to visit Delhi: Terrible pollutionUnion Minister Nitin Gadkari said he frequently has second thoughts about travelling to the national capital due to the poor air quality, which he claimed makes him sick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amruta-fadnavis-devendra-fadnavis-maharashtra-cm-wins-hearts-social-media-instagram-2645493-2024-12-05",
      "headline": "How Amruta Fadnavis steals the show, online and offlineAmruta Fadnavis, the wife of Maharashtra CM, Devendra Fadnavis, is winning the hearts of millions on social media by sharing glimpses of her personal and professional life. Ahead of Fadnavis being sworn in as the CM for a third time, Amruta, a banker and singer, spoke of the \"sense of responsibility\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-pink-ball-test-team-news-r-ashwin-shubman-gill-rohit-sharma-2645760-2024-12-06",
      "headline": "AUS vs IND: R Ashwin returns to pink-ball Test, fit-again Shubman Gill back Border-Gavaskar Trophy: Off-spinner R Ashwin returned to India's XI for the second Test in Adelaide. Fit-again Shubman Gill and Rohit Sharma also made it to the XI. Australia, as announced, made one change to the side that lost in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-dehradun-rajasthan-man-raju-posed-as-multiple-families-lost-son-2645713-2024-12-05",
      "headline": "Ghaziabad, Dehradun, now Rajasthan: Man who posed as multiple families' 'lost son'An emotional reunion of a long-lost son with his parents in Ghaziabad is turning into a nightmare for the family after reports emerged that the man had pulled the scam with several other families as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-narendra-modi-mallikarjun-kharge-share-light-moment-paying-tribute-to-br-ambedkar-parliament-2645767-2024-12-06",
      "headline": "Watch: PM, Mallikarjun Kharge share light moment paying tribute to BR AmbedkarPrime Minister Narendra Modi on Friday paid tributes to the main architect of the Constitution, B R Ambedkar, on his death anniversary in an event in Parliament. Along with PM Modi, several other leaders, including Congress chief Mallikarjun Kharge also paid is respects to the architect of the Indian Constitution. After the event, PM Modi and Kharge along with former President Ram Nath Kovind shared lighthearted moments. Ambedkar came from a Dalit family and rose to become one of the most important figures in Indian politics with his championing of the cause of the underprivileged. \"On Mahaparinirvan Diwas, we bow to Dr. Babasaheb Ambedkar, the architect of our Constitution and a beacon of social justice,\" Modi said on X. \"Dr. Ambedkar's tireless fight for equality and human dignity continues to inspire generations. Today, as we remember his contributions, we also reiterate our commitment to fulfilling his vision,\" Modi said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-naga-chaitanya-ring-game-at-wedding-on-december-4-2645768-2024-12-06",
      "headline": "Watch: Sobhita Dhulipala, Naga Chaitanya fight to find a ring in new wedding videoNaga Chaitanya and Sobhita Dhulipala got married in a grand wedding on December 4. A video of them playing a fun game of finding the ring at their wedding has emerged on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/unitedhealthcare-ceo-brian-thompson-assassination-nypd-new-york-police-bullet-2645691-2024-12-05",
      "headline": "Cryptic messages on bullets that killed UnitedHealthcare CEO outside hotel in USUnitedHealthcare CEO Brian Thompson was shot dead on Wednesday outside a midtown Manhattan hotel, just before a scheduled company investor conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/agni-movie-review-pratik-gandhi-excels-sincere-tribute-to-unsung-heroes-prime-video-2645738-2024-12-06",
      "headline": "Agni review: Pratik Gandhi excels in this sincere tribute to unsung heroesReleased-Fri Dec 06, 2024Prime Video's latest offering, Agni, explores the unheralded bravery of firefighters amidst a city plagued by mysterious fires. Directed by Rahul Dholakia, the film released on December 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-chief-minister-devendra-fadnavis-mahayuti-government-fdi-eknath-shinde-2645723-2024-12-05",
      "headline": "Direction of Mahayuti same, only roles changed: Chief Minister Devendra FadnavisMaharashtra Chief Minister Devendra Fadnavis on Thursday pledged to deliver a stable government focused on progress, dismissing allegations of industries moving out of the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-box-office-collection-day-1-detailed-report-allu-arjun-175-crore-in-india-jawan-200-crore-worldwide-2645744-2024-12-06",
      "headline": "Pushpa 2 box office Day 1: Rs 175 crore opening in India, beats Jawan in HindiPushpa 2 box office collection Day 1: Allu Arjun and director Sukumar's Pushpa 2: The Rule raked in Rs 175 crore (nett) at the domestic box office. The sequel dethroned Shah Rukh Khan's Jawan to become the biggest opener of all time in Hindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/kolkatas-popular-cab-app-to-power-bus-rides-why-commuters-will-be-pleased-2645440-2024-12-05",
      "headline": "Kolkata's popular cab app to power bus rides: Why commuters will be pleasedE-ticketing will solve small-cash problems for riders; the Yatri Sathi app will gradually be expanded to offer a range of citizen services across Bengal"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hybrid-model-icc-events-2645667-2024-12-05",
      "headline": "Champions Trophy in hybrid model finalised, same plan for ICC events until 2027: ReportThe Champions Trophy next year will take place in a hybrid model as reported by PTI. Other ICC events until 2027 will also follow the same model. The decision was made in an informal meeting at the ICC headquarters in Dubai on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/pushpa-2-screening-stampede-allu-arjun-case-filed-woman-dies-hyderabad-2645558-2024-12-05",
      "headline": "Case against Allu Arjun after woman dies in stampede during Pushpa 2 screeningA heavy crowd had rushed to the Hyderabad theatre to catch a glimpse of actor Allu Arjun, resulting in a stampede. A 35-year-old woman died during the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-pushpa-has-not-done-anything-for-me-after-sequel-release-2645752-2024-12-06",
      "headline": "Viral: Fahadh Faasil says 'Pushpa hasn't done anything for me' in old interviewAfter the release of Pushpa 2: The Rule, an old video of Fahadh Faasil has gone viral on social media. In the interview, he said that Pushpa hasn't done anything for him or his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shiromani-akali-dal-leader-sukhbir-singh-badal-hugs-2-cops-for-saving-his-life-2645734-2024-12-06",
      "headline": "Sukhbir Singh Badal hugs 2 cops for saving his lifeSukhbir Singh Badal thanked two police officers for saving his life during an assassination attempt at the Golden Temple in Amritsar. He praised their courage and loyalty in a heartfelt post on X.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-delegation-rajeev-chandrasekhar-anil-antony-k-suresh-monsignor-george-jacob-koovakad-kerala-priest-vatican-pope-francis-2645742-2024-12-06",
      "headline": "Central team to witness historic ordination of Kerala priest at Vatican tomorrowA seven-member delegation led by Union Minister George Kurian will attend the elevation of Monsignor George Jacob Koovakad, a priest from Kerala, to the rank of cardinal, at the Vatican City on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-economic-forum-chief-borge-brende-on-global-trade-ai-india-aspirations-2645670-2024-12-05",
      "headline": "World Economic Forum chief Borge Brende on global trade, AI, India's aspirationsWorld Economic Forum chief Borge Brende provided his in-depth analysis of critical global and economic and political dynamics and the impact of Donald Trump's return as US President will mean on trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-rare-appearance-together-at-party-in-mumbai-2645773-2024-12-06",
      "headline": "Aishwarya Rai, Abhishek Bachchan make rare appearance together at starry eventAishwarya Rai and Abhishek Bachchan made a rare public appearance at a star-studded party on Thursday, dazzling fans with their charm and style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-naga-chaitanya-ring-game-at-wedding-on-december-4-2645768-2024-12-06",
      "headline": "Watch: Sobhita Dhulipala, Naga Chaitanya fight to find a ring in new wedding videoNaga Chaitanya and Sobhita Dhulipala got married in a grand wedding on December 4. A video of them playing a fun game of finding the ring at their wedding has emerged on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-touch-shah-rukh-khan-feet-mahayuti-20-oath-ceremony-viral-video-devendra-fadnavis-eknath-shinde-2645759-2024-12-06",
      "headline": "Did Ranbir Kapoor touch SRK's feet at Mahayuti 2.0 oath ceremony? Watch videoA video of Ranbir Kapoor touching Shah Rukh Khan's feet at Mahayuti 2.0 oath ceremony has caught the attention of fans. Devendra Fadnavis took oath as Maharashtra Chief Minister, marking his third term, with Eknath Shinde as Deputy Chief Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-ranbir-kapoor-arjun-kapoor-fun-bromance-video-fadnavis-oath-ceremony-watch-2645756-2024-12-06",
      "headline": "Watch: Ranveer, Ranbir, Arjun's fun bromance moment at Mahayuti 2.0 oath ceremonyRanveer Singh and Ranbir Kapoor's playful moment with Arjun Kapoor at Devendra Fadnavis's swearing-in ceremony has gone viral. The star-studded event also featured Bollywood icons like Shah Rukh Khan and Salman Khan. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-pink-ball-test-team-news-r-ashwin-shubman-gill-rohit-sharma-2645760-2024-12-06",
      "headline": "AUS vs IND: R Ashwin returns to pink-ball Test, fit-again Shubman Gill back Border-Gavaskar Trophy: Off-spinner R Ashwin returned to India's XI for the second Test in Adelaide. Fit-again Shubman Gill and Rohit Sharma also made it to the XI. Australia, as announced, made one change to the side that lost in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nz-vs-eng-harry-brook-completes-1000-test-runs-in-2024-en-route-to-his-8th-hundred-2645761-2024-12-06",
      "headline": "Harry Brook completes 1,000 Test runs in 2024 en route to his 8th hundredNZ vs ENG: Harry Brook became the 3rd batter to complete 1,000 Test runs in 2024. He notched up his 8th Test hundred in the 2nd match vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-pink-ball-test-live-cricket-score-rohit-sharma-pat-cummins-adelaide-oval-2645746-2024-12-06",
      "headline": "2nd Test LIVE: Starc removes Jaiswal with 1st-ball strikeIndia vs Australia 2nd Test Live Cricket Score: Mitchell Starc strikes the very first ball to remove India opener Yashasvi Jaiswal. Just the kind of injection Australia needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-pink-ball-test-live-streaming-when-and-where-to-watch-india-timings-2645494-2024-12-06",
      "headline": "Pink-ball Test live streaming: When and where to watch, India timingsAUS vs IND, 2nd Test: India take on Australia in a pink-ball Test in Adelaide. With a 1-0 lead, the visitors will be looking to pile up pressure on Australia, who are a bit rattled after the humbling in Perth. Here's all you to know about the TV and live streaming guide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-wellington-test-joe-root-record-2645721-2024-12-05",
      "headline": "Joe Root eyes historic 31-year-old Test records against New Zealand  NZ vs ENG: Joe Root has a chance of breaking Javed Miandad's records when England and New Zealand lock horns in the second Test at the Basin Reserve in Wellington from Friday, December 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-controversies-rise-fall-lingering-question-sachin-tendulkar-2645716-2024-12-05",
      "headline": "Vinod Kambli: The Rise, the Fall, and the Lingering QuestionVinod Kambli's story, from prodigious talent to unfulfilled potential, highlights the harsh realities of cricket's demands and the importance of discipline, focus, and resilience in navigating fame and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-kl-rahul-advises-good-vibes-perth-test-debut-2645690-2024-12-05",
      "headline": "KL Rahul's suggestions worked for me in Perth Test: Nitish Kumar ReddyNitish Kumar Reddy credits KL Rahul's invaluable guidance for his impactful Test debut in Perth, highlighting the senior's calming presence and vital advice as key factors in India's strong performance against Australia in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hybrid-model-icc-events-2645667-2024-12-05",
      "headline": "Champions Trophy in hybrid model finalised, same plan for ICC events until 2027: ReportThe Champions Trophy next year will take place in a hybrid model as reported by PTI. Other ICC events until 2027 will also follow the same model. The decision was made in an informal meeting at the ICC headquarters in Dubai on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-lahiru-kumara-late-turnaround-ryan-rickleton-century-gqeberha-2645664-2024-12-05",
      "headline": "Lahiru Kumara gives late turnaround to Sri Lanka after Rickelton 100Lahiru Kumara's fiery spell disrupted South Africa's momentum after Ryan Rickelton's maiden Test ton, leaving the Gqeberha Test finely poised heading into Day 2 with Sri Lanka eyeing a stronger comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-wellington-test-joe-root-record-2645721-2024-12-05",
      "headline": "Joe Root eyes historic 31-year-old Test records against New Zealand  NZ vs ENG: Joe Root has a chance of breaking Javed Miandad's records when England and New Zealand lock horns in the second Test at the Basin Reserve in Wellington from Friday, December 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-controversies-rise-fall-lingering-question-sachin-tendulkar-2645716-2024-12-05",
      "headline": "Vinod Kambli: The Rise, the Fall, and the Lingering QuestionVinod Kambli's story, from prodigious talent to unfulfilled potential, highlights the harsh realities of cricket's demands and the importance of discipline, focus, and resilience in navigating fame and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-kl-rahul-advises-good-vibes-perth-test-debut-2645690-2024-12-05",
      "headline": "KL Rahul's suggestions worked for me in Perth Test: Nitish Kumar ReddyNitish Kumar Reddy credits KL Rahul's invaluable guidance for his impactful Test debut in Perth, highlighting the senior's calming presence and vital advice as key factors in India's strong performance against Australia in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hybrid-model-icc-events-2645667-2024-12-05",
      "headline": "Champions Trophy in hybrid model finalised, same plan for ICC events until 2027: ReportThe Champions Trophy next year will take place in a hybrid model as reported by PTI. Other ICC events until 2027 will also follow the same model. The decision was made in an informal meeting at the ICC headquarters in Dubai on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-lahiru-kumara-late-turnaround-ryan-rickleton-century-gqeberha-2645664-2024-12-05",
      "headline": "Lahiru Kumara gives late turnaround to Sri Lanka after Rickelton 100Lahiru Kumara's fiery spell disrupted South Africa's momentum after Ryan Rickelton's maiden Test ton, leaving the Gqeberha Test finely poised heading into Day 2 with Sri Lanka eyeing a stronger comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-clean-sweep-3rd-t20i-bulawayo-2645663-2024-12-05",
      "headline": "Zimbabwe deny Pakistan clean-sweep with victory in last-over thriller ZIM vs PAK: Zimbabwe beat Pakistan by two wickets in the deciding match on Thursday at the Queens Sports Club in Bulawayo. Zimbabwe chased down 133 with one ball to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-virat-kohli-fandom-test-series-2645632-2024-12-05",
      "headline": "Used to calculate my age: Reddy recalls childhood fandom for Virat KohliAUS vs IND: Nitish Kumar Reddy talked about his fandom for Virat Kohli. Reddy was at the non-striker's end when Kohli scored a century in the series opener at the Optus Stadium in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-adeliade-test-record-border-gavaskar-trophy-virat-kohli-36-all-out-2645561-2024-12-05",
      "headline": "India set to battle history in day-night Test against AustraliaIndia eyes brilliance in their upcoming day-night Test against Australia in Adelaide, aiming to overcome past scars and build on their momentum in Border-Gavaskar Trophy after their Perth Test win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-father-sacrifices-crying-test-debut-virat-kohli-2645626-2024-12-05",
      "headline": "Nitish Kumar Reddy recalls father's sacrifices for his career: Saw him cryingNitish Kumar Reddy's rise from humble beginnings to Indian cricket's spotlight highlights his resilience, fueled by family sacrifices. The 21-year-old all-rounder made an unforgettable debut in Perth, delivering with both bat and ball to impress the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-australia-border-gavaskar-trophy-test-series-2645584-2024-12-05",
      "headline": "Adulation for Jasprit Bumrah in Australia feels Un-AustralianAUS vs IND: Jasprit Bumrah breathed fire in the Perth Test and garnered praise from the Australian cricket fraternity. The Indian speedster won the Player of the Match award after India won by 295 runs to take a 1-0 series lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-game-9-score-d-gukesh-vs-ding-liren-explained-2645587-2024-12-05",
      "headline": "Stalemate continues as D Gukesh and Ding Liren play out 6th successive drawChess World Championship 2024: At the end of the 9th game, D Gukesh and Ding Liren are tied on 4.5 points each. Gukesh and Liren played out a draw in Game 9 after 54 moves on Thursday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-adelaide-test-pink-ball-preview-rohit-sharma-pat-cummins-2645527-2024-12-05",
      "headline": "36-all out a distant memory, India aim to challenge Australia's pink-ball supremacyIndia vs Australia, 2nd Test match preview: Rohit Sharma returns to the line-up as India take on Australia in the only day-night Test match of the series. India return to the venue where they were bundled out for 36 in 2020, but things could be different this time around. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-harmanpreet-kaur-1st-odi-partnerships-2645521-2024-12-05",
      "headline": "Work on partnerships: Harmanpreet's message to India after batting woesAUS-W vs IND-W: Skipper Harmanpreet Kaur said that India need to up their game after getting bowled out for 100 in the series opener on Thursday, December 5 at the Allan Border Field. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-australia-border-gavaskar-trophy-test-series-2645584-2024-12-05",
      "headline": "Adulation for Jasprit Bumrah in Australia feels Un-AustralianAUS vs IND: Jasprit Bumrah breathed fire in the Perth Test and garnered praise from the Australian cricket fraternity. The Indian speedster won the Player of the Match award after India won by 295 runs to take a 1-0 series lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-game-9-score-d-gukesh-vs-ding-liren-explained-2645587-2024-12-05",
      "headline": "Stalemate continues as D Gukesh and Ding Liren play out 6th successive drawChess World Championship 2024: At the end of the 9th game, D Gukesh and Ding Liren are tied on 4.5 points each. Gukesh and Liren played out a draw in Game 9 after 54 moves on Thursday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-adelaide-test-pink-ball-preview-rohit-sharma-pat-cummins-2645527-2024-12-05",
      "headline": "36-all out a distant memory, India aim to challenge Australia's pink-ball supremacyIndia vs Australia, 2nd Test match preview: Rohit Sharma returns to the line-up as India take on Australia in the only day-night Test match of the series. India return to the venue where they were bundled out for 36 in 2020, but things could be different this time around. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-women-vs-india-women-harmanpreet-kaur-1st-odi-partnerships-2645521-2024-12-05",
      "headline": "Work on partnerships: Harmanpreet's message to India after batting woesAUS-W vs IND-W: Skipper Harmanpreet Kaur said that India need to up their game after getting bowled out for 100 in the series opener on Thursday, December 5 at the Allan Border Field. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-scott-bolan-potential-threat-josh-hazlewood-replacement-adelaide-test-2645495-2024-12-05",
      "headline": "Will Scott Boland cause problems for India in Adelaide Test: Pacer's past tallyScott Boland stepped in for injured Josh Hazlewood in Australia's Day-Night Test against India, raising hopes of replicating his past success. The Adelaide Test marked a crucial juncture for Australia to counter India's in-form batting unit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-2nd-test-predicted-playing-11-team-news-pink-ball-rohit-sharma-2645497-2024-12-05",
      "headline": "Aus vs Ind, pink-ball Test predicted XI: Rohit in middle, Ashwin set to return AUS vs IND, 2nd Test Predicted Playing XI: India are set to make a couple of changes to their XI for the pink-ball Test, starting December 6 in Adelaide. Captain Rohit Sharma will bat in the middle-order for the first time since 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-97-off-48-syed-mushtaq-ali-trophy-maharashtra-vs-services-csk-captain-2645473-2024-12-05",
      "headline": "CSK captain Ruturaj hits a blazing 48 ball 97 in SMAT for MaharashtraRuturaj Gaikwad's explosive 97 off 48 balls against Services in the Syed Mushtaq Ali Trophy silenced critics and reaffirmed his credentials as a top batter. His knock propelled Maharashtra to a dominant 41-run victory, showcasing his leadership and form."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}