{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/bnw-developments-radisson-hotel-group-launch-radisson-blu-rak-central-ras-al-khaimah-hotel-branded-residences-uae-property-market-2871035-2026-02-19",
      "headline": "BNW Developments partners with Radisson Hotel Group for hotel and residencesThe development will include the Radisson Blu Hotel, RAK Central, with 361 rooms, and Radisson Blu Residences, RAK Central, with 222 branded homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-well-positioned-to-lead-in-ai-sam-altman-at-ai-impact-summit-2870977-2026-02-19",
      "headline": "India well-positioned to lead in AI: Sam Altman at AI Impact SummitOpenAI CEO Sam Altman hailed India's rapid progress in 'sovereign AI' and said it's well-positioned to lead in AI."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-closing-bell-sensex-closes-1236-points-lower-nifty-below-25500-indigo-down-3-percent-2870960-2026-02-19",
      "headline": "Sensex closes 1,236 points lower, Nifty below 25,500; IndiGo down 3%The S&P BSE Sensex tanked 1,236.11 points to close at 82,498.14, while the NSE Nifty50 lost 365 points to end at 25,454.35. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-700-points-nifty-tumbles-key-reasons-explained-2870850-2026-02-19",
      "headline": "Sensex down 1,200 points: 3 reasons why the stock market is falling todayAt the closing bell, the Sensex was down 1236.11 points at 82,498.14, while the Nifty50 had slipped 365 points to 25,454.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/investing-in-ipos-your-money-may-be-funding-promoter-not-company-ofs-vs-fresh-issue-analysis-2870834-2026-02-19",
      "headline": "Investing in IPOs? Your money may be funding the promoter, not the companyAccording to a detailed study by 1 Finance Magazine, which analysed more than 1,700 IPOs between 2015 and 2025, 63% of total IPO proceeds now come from Offer for Sale. Only 37% is fresh capital raised for business growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tcs-it-stocks-share-price-ai-impact-bigger-crash-on-cards-explained-2870819-2026-02-19",
      "headline": "Infosys down 18% in a month, TCS falls 14%: Is it an opportunity to buy IT stocks?IT stocks have corrected sharply, but is this panic justified? Before you decide to sell or buy the dip, here's what the AI shift and global slowdown really mean for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/spicejet-signs-mou-for-10-aircraft-targets-major-capacity-ramp-up-2870797-2026-02-19",
      "headline": "SpiceJet signs MoU for 10 aircraft, targets major capacity ramp-upThe development comes just days after the board approved a calibrated fleet ramp-up to 60 aircraft through a mix of wet and damp leases, along with the phased return of previously grounded planes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-volatile-but-still-remain-safe-bet-for-investors-vs-stocks-explained-2870790-2026-02-19",
      "headline": "Gold, silver prices drop sharply. Are they still a safe bet for investors?Gold and silver prices have dipped, but does that mean the rally is over? Experts explain what the recent correction really signals and why many investors still see strength ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-openai-raising-100-billion-funding-round-report-ai-infrastructure-spending-2870770-2026-02-19",
      "headline": "OpenAI eyeing $100 billion funding round, but why does it need so much money?The $100 billion funding is linked to three major areas: infrastructure spending, expanding artificial intelligence tools, and deeper partnerships for chips and cloud computing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tcs-hcltech-tech-mahindra-why-are-it-stocks-rising-today-after-recent-weakness-explained-2870756-2026-02-19",
      "headline": "Infosys, TCS, HCLTech: Why are major IT stocks rising today?The rebound follows a difficult few weeks for the sector. IT stocks had been under sustained pressure amid fears that rapid advances in artificial intelligence could disrupt traditional outsourcing and software services models."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-up-it-shares-rise-hcltech-infosys-tcs-up-to-2-percent-2870748-2026-02-19",
      "headline": "Sensex, Nifty open marginally higher as IT stocks rally; HCLTech up 2%The S&P BSE Sensex added 154.21 points to 83,888.46, while the NSE Nifty50 gained 47.45 points to 25,866.80 as of 9:22 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-and-silver-futures-trading-on-mcx-addiaional-charges-removed-explained-2870747-2026-02-19",
      "headline": "Thinking of trading gold or silver futures on MCX? It just got cheaperThe MCX and the National Stock Exchange, or NSE, have removed the additional margins that were recently imposed on gold and silver futures contracts. In simple language, traders now need to block less money to take the same position as before."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-february-2026-gaudium-ivf-clean-max-shree-ram-twistex-pngs-reva-gmp-price-band-2870736-2026-02-19",
      "headline": "IPO market buzz returns with 4 firms set to raise Rs 3,755 crore. Check detailsFour companies are set to open their public issues between February 20 and February 24, signalling a fresh round of fundraising in the mainboard segment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-bpcl-makes-first-ever-venezuelan-oil-purchase-hmel-returns-after-two-years-2870687-2026-02-19",
      "headline": "India's BPCL makes first ever Venezuelan oil purchase, HMEL returns after 2 yearsBharat Petroleum buys Venezuelan oil for the first time while HPCL Mittal Energy makes its first Venezuelan purchase in two years, signaling India's crude diversification amid reduced Russian imports, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-ai-summit-550-billion-to-indian-economy-2870605-2026-02-18",
      "headline": "Can AI really add $550 billion to India's economy? Experts debateIndia is poised for significant AI-driven economic growth, with projections estimating a USD 550 billion boost by 2035. Industry leaders discuss the need for balanced optimism, innovation, and supportive policies to realise AI's potential in the country fully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/can-india-turn-its-data-edge-into-global-ai-leadership-experts-debate-2870604-2026-02-18",
      "headline": "Can India turn its data edge into global AI leadership? Experts debateAt the India Today AI Summit, the conversation moved beyond algorithms and valuations to a more fundamental question: power. As panellists noted, artificial intelligence runs not just on data and chips but on massive, uninterrupted energy supply to fuel data centres and high-performance computing. With AI workloads rising globally, advanced economies such as the United States and parts of Europe are already grappling with grid stress and delays in expanding generation capacity. Against this backdrop, speakers argued that India's relative energy sufficiency and ongoing renewable expansion could offer a strategic edge. India has added significant power capacity in recent years and is pushing solar, wind and green hydrogen projects, positioning itself to meet rising digital infrastructure demand. If managed well, this energy readiness could help India scale domestic data centres, strengthen data sovereignty and even emerge as a competitive AI hub, turning power security into economic advantage in the global AI race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/how-infrastructure-and-innovation-are-driving-indias-ai-growth-2870557-2026-02-18",
      "headline": "How infrastructure and innovation are driving India's AI growthAt the India Today AI Summit 2026, industry leaders unpacked what truly powers AI, i.e., from advanced chips and data centres to voice tools and open-source platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indias-ai-opportunity-is-real-says-openais-chief-economist-2870554-2026-02-18",
      "headline": "India's AI opportunity is real, says OpenAI's chief economistArtificial intelligence is not hype and it is not a bubble. That was the clear message from Dr Aaron Ronnie Chatterji, Chief Economist at OpenAI, at the India Today AI Summit 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inside-indias-rapid-ai-rise-experts-talk-infrastructure-and-innovation-2870538-2026-02-18",
      "headline": "Inside India's rapid AI rise: Experts talk infrastructure and innovationExperts said that India is on the brink of a major AI expansion. If infrastructure, open technology and user-friendly applications grow together, AI could become part of everyday life for hundreds of millions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-ai-summit-2026-openai-chief-economist-dr-aaron-chatterji-opportunity-2870451-2026-02-18",
      "headline": "There's real value in AI and India has a big opportunity: OpenAI chief economistAt the India Today AI Summit, OpenAI's Chief Economist Dr Aaron Chatterji said AI is real and accelerating, and India's success will hinge on how fast it invests in skills, infrastructure and trust."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-tops-ifpi-global-artist-chart-2025-record-breaking-album-sales-2870976-2026-02-19",
      "headline": "Taylor Swift crowned world's best-selling artist again, after Spotify triumph Taylor Swift secures IFPI's Biggest-Selling Global Artist title for 2025, extending her remarkable winning streak, but what powered her latest triumph?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-dances-to-salman-khan-song-at-niece-pre-wedding-function-watch-2870983-2026-02-19",
      "headline": "Rajpal Yadav dances to Salman Khan's song at niece's pre-wedding function. Watch Actor Rajpal Yadav was seen dancing at his niece's pre-wedding celebrations after his release from Tihar Jail. In a statement earlier, the actor said he needs \"time more than sympathy\" to prove the truth about his case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vishal-bhardwaj-is-proud-of-oromeo-calls-it-the-most-successful-film-of-his-life-2870486-2026-02-19",
      "headline": "Vishal Bhardwaj is proud of O'Romeo, calls it the most successful film of his life Vishal Bhardwaj remained confident that his latest film O'Romeo, despite mixed reviews and box office debates, will become his most successful project. The romantic crime drama starring Shahid Kapoor and Triptii Dimri has sparked discussions with its bold blend of romance and violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/riteish-deshmukh-raja-shivaji-first-look-poster-release-date-sanjay-dutt-vidya-balan-abhishek-bachchan-2870959-2026-02-19",
      "headline": "Riteish Deshmukh's Raja Shivaji first look poster out. Check release date The first look poster of Riteish Deshmukh's upcoming directorial Raja Shivaji has been unveiled on the occasion of Shiv Jayanti. Check out the film's release date, complete cast and other details here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-gifts-sustainable-ed-a-mamma-hamper-to-katrina-kaif-vicky-kaushal-newborn-vihaan-2870946-2026-02-19",
      "headline": "Alia Bhatt sends 'adorable cuddlies' for Katrina and Vicky's son Vihaan. See pic Actor Alia Bhatt sent a sweet surprise for Katrina Kaif and Vicky Kaushal's baby boy Vihaan and the adorable gift has caught fans' attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-says-her-boyfriend-felt-insecure-about-co-stars-like-hrithik-roshan-2870948-2026-02-19",
      "headline": "Mrunal Thakur says her boyfriend felt insecure about co-stars like Hrithik Roshan Mrunal Thakur spoke about insecurity in relationships. She gave her own examples and discussed her then-partner who felt insecure of the leading men in her films, including Hrithik Roshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-exits-prasanth-varma-baka-mythological-film-delays-2870903-2026-02-19",
      "headline": "After Ranveer Singh, Prabhas exits Prasanth Varma's mythological film: Report Prabhas has reportedly stepped away from the mythological film titled Baka, directed by Prasanth Varma. This development adds to recent challenges faced by the filmmaker as his project lineup faces uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/margot-robbie-wuthering-heights-outfit-kareena-kapoor-iconic-jab-we-met-style-2870888-2026-02-19",
      "headline": "Margot Robbie twirls in red skirt: Internet screams Kareena Kapoor did it first A scene from Wuthering Heights featuring Margot Robbie in a red skirt and white shirt has gone viral. Several social media users have highlighted its resemblance to Kareena Kapoor's memorable outfit in the Bollywood film Jab We Met."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-2-director-is-thankful-to-censor-board-urges-youth-to-watch-the-film-2870909-2026-02-19",
      "headline": "The Kerala Story 2 director explains why U/A certificate was important for film The Kerala Story 2 director Kamakhya Narayan Singh recently reacted to the CBFC granting a U/A certificate to the film. In an exclusive interaction with India Today, Singh requested young sisters and daughters to watch the film in theatres with families. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-zee5-jiohotstar-tu-meri-main-tera-kennedy-the-bluff-and-more-2870904-2026-02-19",
      "headline": "Prime Video, Zee5, JioHotstar: Tu Meri Main Tera, Kennedy, The Bluff, and more This week's OTT releases across Prime Video, ZEE5, JioHotstar and Lionsgate Play bring a mix of romance, thrillers, sports drama and documentaries. From Tu Meri Main Tera and Kennedy to The Bluff and Paul McCartney: Man on the Run, there's something for every viewer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-turner-retches-after-kissing-kit-harington-during-the-dreadful-shoot-video-2870874-2026-02-19",
      "headline": "Sophie Turner retches after kissing Kit Harington during The Dreadful shoot. Video Actors Sophie Turner and Kit Harington were visibly awkward while sharing an on-screen kiss in their upcoming horror film The Dreadful. A behind-the-scenes clip capturing their discomfort has gone viral, underlining the unusual transition from playing siblings to romantic leads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/love-is-used-to-trap-girls-the-kerala-story-2-shows-truth-director-amid-row-2870886-2026-02-19",
      "headline": "Love is used to trap girls, The Kerala Story 2 shows truth: Director amid row Director Kamakhya Narayan Singh defended The Kerala Story 2 after criticism from Kerala CM Pinarayi Vijayan. He said the film is \"fact-based\" and aims to raise awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/daniel-radcliffe-says-dominic-mclaughlin-will-be-a-better-harry-potter-than-him-2870863-2026-02-19",
      "headline": "Daniel Radcliffe says Dominic McLaughlin will be a better Harry Potter than him Daniel Radcliffe supported Dominic McLaughlin taking over the role of Harry Potter for HBO's upcoming adaptation. He urged fans and media to embrace the new cast and let them define the beloved characters for a new generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-financial-troubles-denied-nephew-vinay-anand-social-media-rumours-2870784-2026-02-19",
      "headline": "Govinda's nephew slams bankruptcy rumours, defends actor's enduring stardom Govinda's cousin Vinay Anand has firmly rejected social media rumours suggesting that the actor is facing financial difficulties. He called such claims baseless and highlighted the star's enduring popularity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kerala-story-2-ua-certification-cbfc-wider-audience-2870832-2026-02-19",
      "headline": "The Kerala Story 2 gets U/A amid row, director thanks censor board for their faith The Central Board of Film Certification has granted a U/A rating to The Kerala Story 2, allowing viewers over the age of 14 to watch the film. This decision comes as the film's trailer continues to generate polarised responses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-this-week-the-night-agent-s3-chatha-pacha-firebreak-and-more-2870871-2026-02-19",
      "headline": "Netflix this week: The Night Agent S3, Chatha Pacha, Firebreak and more Netflix's latest weekly line-up features the return of The Night Agent Season 3 along with Malayalam action-comedy Chatha Pacha and several international titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-teaser-release-february-20-dark-action-drama-clash-dhurandhar-2-2870846-2026-02-19",
      "headline": "Toxic teaser release date out, Yash in self-destructive mode in new poster Yash's Toxic teaser will release on February 20, building anticipation for the film's March 19 premiere. The film faces a direct box office clash with Ranveer Singh's Dhurandhar 2, creating excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/subhash-ghai-prays-for-salim-khans-speedy-recovery-backs-industrys-love-for-him-2870840-2026-02-19",
      "headline": "Subhash Ghai prays for Salim Khan's speedy recovery, backs industry's love for him Filmmaker Subhash Ghai recently wished Salim Khan a speedy recovery in an interview. Khan has been hospitalised for three days after suffering a spike in blood pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thadayam-tamil-series-zee5-true-crime-psychological-drama-rural-tamil-nadu-2870829-2026-02-19",
      "headline": "Thadayam: Samuthirakani, Sshivada to headline gripping thriller based on true events The trailer for Thadayam, a crime thriller series starring Samuthirakani and Sshivada, introduces a tense investigation inspired by true events and is scheduled to stream on Zee5 from February 27."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/king-charles-brother-andrew-linked-to-epstein-arrested-on-suspicion-of-misconduct-in-public-office-bbc-2870969-2026-02-19",
      "headline": "Prince Andrew, tainted by Epstein scandal, arrested for misconductFormer Prince Andrew, younger brother of King Charles, was arrested on suspicion of misconduct in public office amid the Jeffrey Epstein scandal. This marks a significant legal challenge for the British royal family, drawing intense public and media attention.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-news-india-to-restore-all-visa-services-to-diplomat-dhaka-new-delhi-relations-2870972-2026-02-19",
      "headline": "Yunus out, India to restore all visa services in Bangladesh soonIndia would soon be resuming all visa services in Bangladesh, a senior Indian diplomat was quoted by Bangladeshi media as saying. Amid threats to its missions, India had stopped visa services, beginning December 17 last year. This is a big signal on the improving ties between New Delhi and Dhaka, with PM Tarique Rahman's government taking over from Muhammad Yunus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/andrew-mountbatten-windsor-arrested-over-epstein-file-links-royal-family-uk-police-2871040-2026-02-19",
      "headline": "Emails with Epstein, trafficking minor: Ex-Prince Andrew's fall from graceThe arrest marked the gravest legal crisis yet for Andrew Mountbatten-Windsor, whose long-standing association with child sex offender Jeffrey Epstein has already cost him royal titles and place within the monarchy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/development-will-be-hampered-supreme-court-raps-states-for-irresponsible-freebie-2870868-2026-02-19",
      "headline": "What kind of culture is this? Supreme Court slams states over pre-poll freebiesThe court specifically asked the Government of Tamil Nadu to explain why a free-electricity scheme was announced all of a sudden, leaving power distribution companies (DISCOMs) scrambling to adjust tariffs and budget calculations. The Supreme Court of India also observed that it was aware of instances in several states where welfare schemes were announced suddenly ahead of recent elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-muslin-quota-5-why-bjp-government-scrapped-congress-ordinance-law-explained-2870913-2026-02-19",
      "headline": "Maharashtra wraps up 5% Muslim quota. Why now and what changes?More than a decade after a 5% Muslim quota was introduced, which triggered a legal battle, the BJP-led Maharashtra government scrapped the framework. The Congress called the Mahayuti government's move \"anti-Muslim\". What does the scrapping of the quota really mean? Does it impact Muslims in Maharashtra?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ai-impact-summit-at-bharat-mandapam-sam-altman-dario-amodei-skip-unity-hand-raise-at-pm-modi-group-photo-2870833-2026-02-19",
      "headline": "Awkward. OpenAI's Sam Altman, Anthropic's Dario Amodei skip unity hand-raiseAs PM Modi looked on, the two rivals, standing next to each other, appeared uncomfortable. At the Prime Minister's request -- along with other prominent leaders on stage -- they seemed reluctant to join hands. Eventually, instead of making a show of unity, the two raised their fists, breaking the chain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/software-engineer-murder-vanasthalipuram-ex-husband-arrested-sunitha-mahesh-2870714-2026-02-19",
      "headline": "Ex-husband stabs 30-year-old techie to death, smashes head with flower potThe accused allegedly stabbed his 30-year-old techie wife multiple times and struck her on the head with a flower pot, killing her on the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-mocked-again-typo-us-visit-announcement-shehbaz-sharif-board-of-peace-meeting-2870986-2026-02-19",
      "headline": "Unites States of Americas: Pakistan mocked for typo in PM's US trip announcementThe Foreign Ministry's typo-ridden statement on Shehbaz Sharif's US visit drew online ridicule, reviving memories of past digital blunders as the Pakistani Prime Minister attended the Board of Peace meeting in Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/india-ai-impact-summit-2026-dinner-narendra-modi-bharat-mandapam-2870938-2026-02-19",
      "headline": "At the AI Summit dinner, world leaders sat down to Shishir Ritu-inspired spreadAs the India AI Impact Summit 2026 continues at Bharat Mandapam in New Delhi, the conversations extend beyond tech and policy to a gala dinner hosted by Prime Minister Narendra Modi — an evening where India served world leaders a seasonal, soulful taste of its culinary heritage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ai-impact-summit-live-updates-pm-to-at-around-9-40-meet-world-leaders-at-noon-2870698-2026-02-19",
      "headline": "Live: India's leadership in sovereign AI is great to watch, says Sam AltmanIndia AI Impact Summit LIVE Updates: The opening ceremony on the fourth day of the AI India Summit concluded. Prime Minister Narendra Modi, French President Emmanuel Macron, Google CEO Sundar Pichai and several tech leaders. The leaders will now mark their visit to the India AI Impact Expo 2026 along with several other leaders around 11 am. \r\n\r\nAt noon, a Leaders' Plenary will be held at the Bharat Mandapam. It will bring together several heads of states, ministers, and senior representatives from multilateral institutions to outline national and global priorities on AI, including governance, infrastructure, and international cooperation. PM Modi will attend the plenary along with several other leaders. \r\n\r\nModi will have a meeting with senior executives from global technology and industry firms at the CEO roundtable event, expected to kick off around 5.30 pm. The Prime Minister will discuss investment, research collaboration, supply chains, and deployment of AI systems. To catch all the live updates on Day 3, follow indiatoday.in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/ajinimoto-toilet-paper-toto-power-artifical-intelligence-ai-innovation-power-for-ai-ai-summit-technology-2870916-2026-02-19",
      "headline": "Did you know Ajinomoto and toilet maker Toto power the AI we use?While these firms do not design AI models or build data centres, their specialised materials and components form part of the invisible foundation that makes modern computing possible."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-700-points-nifty-tumbles-key-reasons-explained-2870850-2026-02-19",
      "headline": "Sensex down 1,200 points: 3 reasons why the stock market is falling todayAt the closing bell, the Sensex was down 1236.11 points at 82,498.14, while the Nifty50 had slipped 365 points to 25,454.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/chanel-model-bhavitha-mandava-from-hyderabad-gets-a-shout-out-from-french-president-emmanuel-macron-2870937-2026-02-19",
      "headline": "Chanel model Bhavitha Mandava from Hyderabad gets a shoutout from MacronIndia's fashion prowess stole the show at the India–France Innovation Forum in Mumbai as French President Emmanuel Macron mentioned Chanel CEO Leena Nair and model Bhavitha Mandava in his speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-india-cricket-bnp-government-youth-sports-minister-aminul-haque-bcb-bcci-cricket-ties-repair-2870758-2026-02-19",
      "headline": "Bangladesh seeks fast reset in India cricket ties after World Cup drama, Yunus exitBangladesh's new Youth and Sports Minister, Aminul Haque, hinted that Dhaka was moving to repair strained cricket ties with India after a fallout over the ICC Men's T20 World Cup 2026. Haque said he held talks with India's Deputy High Commissioner and emphasised a desire to resolve differences through \"friendly talks\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-nelamangala-woman-murder-robbery-debt-gold-theft-arrest-shobha-shivakumar-2870895-2026-02-19",
      "headline": "Elderly woman killed over debt in Bengaluru flat, paralysed husband witnesses horrorA video from the scene showed the 70-year-old Bengaluru woman lying in a pool of blood, with her paralysed husband beside her on the same bed, unable to intervene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-bnp-tarique-rahman-government-woos-shakib-al-hasan-mashrafe-mortaza-return-cricket-yunus-exit-2870512-2026-02-19",
      "headline": "Yunus out, Tarique in. Dhaka moves to woo Awami League-loyal cricketers backHours after the Tarique Rahman-led BNP government was sworn in, newly appointed state minister for sports, Aminul Haque, said he wanted cases against Awami League-loyalist cricketers, Shakib Al Hasan and Mashrafe Bin Mortaza, resolved so that they could return to cricket. The former Bangladesh captains served as Awami League MPs and face multiple charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-outlines-manav-vision-at-mega-summit-calls-for-democratisation-of-ai-2870788-2026-02-19",
      "headline": "PM Modi outlines MANAV vision at mega summit, calls for democratisation of AIAI must become a tool for inclusion and empowerment, particularly for the Global South, the PM said at the AI Impact Summit in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-cricket-legacy-world-cup-hero-pakistan-captain-2870446-2026-02-19",
      "headline": "The assassin, the King, the legend: The biography of Imran Khan, cricket's Greek GodHandcrafted ByOur Editors Fourteen cricket legends, including Sunil Gavaskar and Kapil Dev, made a united appeal to the Pakistani government for fair and humane treatment of a jailed Imran Khan. Notably, no Pakistani cricketer was among them. So, Gen Z and Gen Alpha, listen up: long before the politics and the prison cell, Imran Khan was the ultimate main character on the cricket field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-michele-morrone-deleted-scene-in-the-housemaid-defines-sequel-paul-feig-2870817-2026-02-19",
      "headline": "Sydney Sweeney, Michele Morrone's deleted scene in The Housemaid defines sequelPaul Feig explained why a major scene featuring Sydney Sweeney and Michele Morrone was cut from The Housemaid, hinting at its possible return in the Lionsgate sequel. The filming for the second part, The Housemaid's Secret, is set to begin this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/phf-president-resigns-australia-tour-controversy-ammad-shakeel-butt-2870984-2026-02-19",
      "headline": "Pakistan hockey chief resigns after banning captain for 2 years over Sydney fiascoThe Pakistan Hockey Federation president Tariq Bugti resigned from his role in the aftermath of the Australia tour fiasco. Bugti sent his resignation only after slapping a two-year ban on Pakistan captain Ammad Shakeel Butt, after he exposed PHF for their negligence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/passport-revoked-uk-ban-in-place-mallya-tells-bombay-high-court-he-has-no-return-timeline-2870686-2026-02-19",
      "headline": "Passport revoked, travel from UK barred: Mallya tells court he can't return to IndiaMallya, who left India in March 2016, is accused of defaulting on multiple loan repayments amounting to several thousand crores. He was declared a Fugitive Economic Offender in January 2019 by a special court hearing cases under the Prevention of Money Laundering Act (PMLA). Following the declaration, extradition proceedings against him were initiated.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-railways-general-coach-passenger-hangs-shoes-on-luggage-rack-charges-phone-via-exposed-wire-2870978-2026-02-19",
      "headline": "General coach passenger hangs shoes on luggage rack, charges phone via exposed wireA now-viral video from an Indian Railways general coach shows a passenger using an exposed wire to charge his phone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-throws-jibe-at-pm-modi-for-not-properly-addressing-saint-ramakrishna-2870845-2026-02-19",
      "headline": "Cultural insensitivity: Mamata Banerjee jabs PM over Swami prefix for RamakrishnaThrough her post on X, West Bengal Chief Minister fired her shots at Narendra Modi for not addressing Saint Ramakrishna properly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/drdo-isro-gaganyaan-drogue-parachute-test-chandigarh-recovery-system-2870958-2026-02-19",
      "headline": "DRDO tests Gaganyaan's parachute that will return astronauts to EarthDRDO has successfully completed qualification-level load tests for the Gaganyaan drogue parachute at the Rail Track Rocket Sled facility in Chandigarh, ensuring a safe return for Indian astronauts."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-most-capped-player-womens-cricket-india-record-australia-2870982-2026-02-19",
      "headline": "Watch: Proud Harmanpreet pats her own back after historic T20I vs Australia INDW vs AUSW: Harmanpreet Kaur became the most-capped player in women's international cricket with 356 matches. She reached the landmark in the second T20I against Australia on Thursday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/phf-president-resigns-australia-tour-controversy-ammad-shakeel-butt-2870984-2026-02-19",
      "headline": "Pakistan hockey chief resigns after banning captain for 2 years over Sydney fiasco The Pakistan Hockey Federation president Tariq Bugti resigned from his role in the aftermath of the Australia tour fiasco. Bugti sent his resignation only after slapping a two-year ban on Pakistan captain Ammad Shakeel Butt, after he exposed PHF for their negligence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-cricket-forensic-review-after-early-t20-world-cup-exit-2870900-2026-02-19",
      "headline": "After T20 World Cup 2026 debacle, Australia to conduct forensic review Australia will conduct a comprehensive review following its early group-stage exit at the T20 World Cup 2026. Losses to Sri Lanka and Zimbabwe and key injuries contributed to an early elimination, prompting selectors to examine all aspects of the campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-west-indies-vs-italy-match-report-unbeaten-shamar-joseph-matthew-forde-kolkata-2870928-2026-02-19",
      "headline": "West Indies make it 4 in 4, crush Italy's send-off hopes before Super 8s T20 World Cup: West Indies signed off the group stage in style, crushing Italy by 42 runs in Kolkata to make it four wins in four. Shai Hope's 75 set the tone before Shamar Joseph and Matthew Forde sealed the rout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-t20-world-cup-struggles-pakistan-selection-dilemma-2870896-2026-02-19",
      "headline": "Give Babar a break: Pakistan must give their star batter clarity amid poor form T20 World Cup, PAK vs NAM: Babar Azam has struggled at No.4 in the tournament and didn't even get a chance to bat when Pakistan lost three wickets against Namibia in their must-win clash on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-hardik-pandya-jasprit-bumrah-gift-signed-jerseys-netherlands-played-ind-vs-ned-2870887-2026-02-19",
      "headline": "T20 World Cup: Hardik Pandya, Bumrah share signed jerseys with Netherlands squad Hardik Pandya and Jasprit Bumrah won hearts after India's win over the Netherlands in Ahmedabad. The duo gifted signed jerseys to Dutch players as India completed a perfect group stage and moved into the Super 8s."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-glenn-maxwell-retirement-ricky-ponting-predicts-australia-vs-oman-last-match-2870872-2026-02-19",
      "headline": "End of the road for Glenn Maxwell? Ponting predicts retirement after T20 World Cup T20 World Cup: Ricky Ponting has hinted that Glenn Maxwell could be nearing retirement after Australia's early T20 World Cup exit. Ponting believes the February 20 match vs Oman may be Maxwell's final World Cup appearance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/delhi-rugby-stadium-maidan-garhi-turned-park-dda-controversy-2870849-2026-02-19",
      "headline": "Delhi's unfulfilled rugby promise: Stadium turns into park as players struggle The promise of India's first dedicated rugby stadium in Delhi fails as the land in Maidan Garhi becomes a public space, leaving players struggling without basic facilities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-jasprit-bumrah-t20-world-cup-2026-india-vs-netherlands-2870816-2026-02-19",
      "headline": "Is Varun Chakravarthy more lethal for India than Bumrah? Srikkanth reacts T20 World Cup: Kris Srikkanth called Varun Chakravarthy a modern-day T20I great and claimed that the spinner is more lethal for India than Jasprit Bumrah at the moment. Varun continues to spin his web around the batters in T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-navneet-dhaliwal-canada-retirement-punjab-born-exclusive-associate-teams-2870802-2026-02-19",
      "headline": "Navneet Dhaliwal: The Punjab boy who carried Canada's flag to two World CupsT20 World Cup: Retiring as Canada's highest run-scorer in T20Is, Navneet Dhaliwal, in an exclusive interview, reflects on his journey from Punjab's Under-19 grounds to leading Canada to two World Cups, while also speaking about his consistent push for greater exposure for Associate teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-india-cricket-bnp-government-youth-sports-minister-aminul-haque-bcb-bcci-cricket-ties-repair-2870758-2026-02-19",
      "headline": "Bangladesh seeks fast reset in India cricket ties after World Cup drama, Yunus exitBangladesh's new Youth and Sports Minister, Aminul Haque, hinted that Dhaka was moving to repair strained cricket ties with India after a fallout over the ICC Men's T20 World Cup 2026. Haque said he held talks with India's Deputy High Commissioner and emphasised a desire to resolve differences through \"friendly talks\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-bowling-concerns-super-8s-virender-sehwag-mohit-sharma-vs-netherlands-2870782-2026-02-19",
      "headline": "India's bowling troubles in T20 World Cup: Former stars flag Super 8s questions T20 World Cup: Former India cricketers Virender Sehwag and Mohit Sharma have flagged India's bowling lapses despite their unbeaten group-stage run in the T20 World Cup. With Super 8s looming, India's death-overs control remains under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-shivam-dube-all-round-brilliance-irfan-pathan-2870771-2026-02-19",
      "headline": "Is Shivam Dube the first name on India's T20I playing XI? Irfan Pathan reactsIrfan Pathan heaped praise on Shivam Dube, claiming that the all-rounder has made himself the first name on India's team sheet for T20Is with improvements in his batting and bowling. Dube was star of the show for India against the Netherlands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/benfica-gianluca-prestianni-possible-punishments-vinicius-jr-real-madrid-racial-abuse-ucl-2870757-2026-02-19",
      "headline": "Benfica, Prestianni in trouble? Possible punishments if Vinicius racism claim is trueUEFA have opened an investigation into allegations that Benfica's Gianluca Prestianni racially abused Real Madrid star Vinicius Jr in Lisbon. If proven guilty, both player and club could face heavy disciplinary sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-batting-struggles-t20-world-cup-2026-ind-vs-ned-nasser-hussain-2870741-2026-02-19",
      "headline": "Abhishek's slump more of a mental issue than a technical one: Nasser HussainFormer England captain Nasser Hussain believes Abhishek Sharma's recent slump may be due to a mental issue after he was dismissed for another duck against the Netherlands in the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-super-8s-complete-match-schedule-venues-dates-timings-2870685-2026-02-19",
      "headline": "T20 World Cup 2026: Your Super 8s cheat sheet as the race to the knockouts beginsThe T20 World Cup Super 8s are here. Eight teams remain in the hunt for four knockout spots. From India's dominance to Zimbabwe's fairytale, here's your complete guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-worst-catching-vs-netherlands-super-8s-concern-varun-aaron-2870724-2026-02-19",
      "headline": "India is by far the worst catching side: Varun Aaron raises Super 8s concernT20 World Cup: Former India pacer Varun Aaron raised concerns over India's catching woes ahead of the Super 8s. India have dropped nine catches so far, the second-most in the tournament despite their unbeaten group-stage run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-cricket-legacy-world-cup-hero-pakistan-captain-2870446-2026-02-19",
      "headline": "The assassin, the King, the legend: The biography of Imran Khan, cricket's Greek GodHandcrafted ByOur Editors Fourteen cricket legends, including Sunil Gavaskar and Kapil Dev, made a united appeal to the Pakistani government for fair and humane treatment of a jailed Imran Khan. Notably, no Pakistani cricketer was among them. So, Gen Z and Gen Alpha, listen up: long before the politics and the prison cell, Imran Khan was the ultimate main character on the cricket field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-wolves-draw-premier-league-title-race-mikel-arteta-deserved-points-lost-2870701-2026-02-19",
      "headline": "Premier League: Arsenal slip up in title race again with Wolves stalemateArsenal's title charge took another hit as they surrendered a two-goal lead to draw 2-2 with bottom-placed Wolves at Molineux. Mikel Arteta admitted all criticism was fair after the collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-bnp-tarique-rahman-government-woos-shakib-al-hasan-mashrafe-mortaza-return-cricket-yunus-exit-2870512-2026-02-19",
      "headline": "Yunus out, Tarique in. Dhaka moves to woo Awami League-loyal cricketers backHours after the Tarique Rahman-led BNP government was sworn in, newly appointed state minister for sports, Aminul Haque, said he wanted cases against Awami League-loyalist cricketers, Shakib Al Hasan and Mashrafe Bin Mortaza, resolved so that they could return to cricket. The former Bangladesh captains served as Awami League MPs and face multiple charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-shivam-dube-india-batting-concerns-pressure-off-spin-netherlands-2870679-2026-02-19",
      "headline": "Why India have not been batting in their fearless template? Shivam Dube answersT20 World Cup: Shivam Dube admits World Cup pressure has changed India's batting approach. The all-rounder addresses concerns over Abhishek Sharma's form and the team's struggles against off-spin.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-batting-problems-abhishek-sharma-t20-world-cup-2870680-2026-02-19",
      "headline": "No Dhurandhar show, India return to anchor role in T20 World CupAfter teasing the fans with a list of high totals over the last year and a half, India have gone back to the anchor role in the T20 World Cup 2026. Why?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-italy-sri-lanka-zimbabwe-t20-world-cup-day-12-preview-2870637-2026-02-19",
      "headline": "Matchday Preview: Zimbabwe aim to top table, Afghanistan look for prideT20 World Cup: Day 12 of the global tournament will feature three exciting clashes - West Indies take on Italy, followed by Sri Lanka facing Zimbabwe, and the day will conclude with Afghanistan facing Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-shivam-dube-ms-dhoni-advice-short-ball-india-netherlands-2870666-2026-02-19",
      "headline": "T20 World Cup: How Dhoni's advice helped Shivam Dube overcome his short-ball weaknessT20 World Cup 2026: Shivam Dube credits MS Dhoni's advice for helping him overcome his short-ball struggles. The all-rounder's 66 against the Netherlands proves how far he's come since those early IPL days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-supreme-court-notice-wife-hasin-jahan-case-transfer-kolkata-delhi-2870683-2026-02-19",
      "headline": "More trouble for Shami? SC notice issued after wife seeks case transfer to DelhiSupreme Court issues notice to Mohammed Shami on wife Hasin Jahan's petition to transfer domestic violence and alimony case from Kolkata to Delhi for daughter's education."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-netherlands-t20-world-cup-india-full-press-conference-2870676-2026-02-19",
      "headline": "Are India's struggles against off-spin a cause for concern? Shivam Dube answersT20 World Cup 2026: India all-rounder Shivam Dube has explained why India are not batting at their usual aggressive template. Here is his complete press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-batting-problems-gavaskar-ind-vs-ned-t20-world-cup-2870665-2026-02-19",
      "headline": "T20 World Cup: Is Abhishek Sharma being weighed down by expectations?T20 World Cup: Abhishek Sharma registered his third straight duck in the T20 World Cup. What has led to the batter's sudden loss of form?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-karnataka-vs-jammu-and-kashmir-hubballi-venue-2870655-2026-02-18",
      "headline": "Ranji Trophy final between Karnataka and J&K to be held in Hubballi: ReportThe Ranji Trophy final between Karnataka and Jammu and Kashmir will reportedly be held in Hubballi from February 24, as KSCA backs regional growth while Chinnaswamy undergoes security upgrades."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}