{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-convert-your-credit-card-bills-into-emis-check-here-2668646-2025-01-22",
      "headline": "Should you convert your credit card bills into EMIs? Check hereCredit card EMI conversion: Converting credit card bills into EMIs offers immediate relief by breaking big payments into smaller and manageable amounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-upi-circle-5-things-you-need-to-know-2668565-2025-01-22",
      "headline": "What is UPI Circle? 5 things you need to know UPI Circle is a solution where a primary user authorises a secondary user to make payments from their account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-it-stocks-rally-sensex-nifty-boost-wipro-infosys-top-gainers-2668525-2025-01-22",
      "headline": "IT rally saves the day on Dalal Steet; Wipro, Infosys among top gainersThe biggest gainers during the session were IT stocks, with the Nifty IT index rising 2.14%, the highest among all other sectoral indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-why-financial-services-sector-needs-better-digital-lending-ecosystem-2668488-2025-01-22",
      "headline": "Budget 2025: Why financial services sector needs a 'digital lending' boostBudget 2025 would play a key role in driving the country's economic growth through enhanced credit access to the rural and underserved sectors of the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-wipro-infosys-why-are-it-stocks-rose-today-despite-high-market-volatility-2668498-2025-01-22",
      "headline": "TCS, Wipro, Infosys: Why IT stocks rose today despite high market volatilityIT Stocks: TCS shares were up 3.04% to Rs 4,158.45 at 3:00 pm, Wipro gained 3.37% to trade at Rs 308.40, and Infosys jumped 3.11% to Rs 1,856.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q3-results-net-profit-rises-22-percent-to-rs-16736-crore-pat-nii-2668485-2025-01-22",
      "headline": "HDFC Bank Q3 results: Net profit rises 2.2% to Rs 16,736 croreThe private lender reported a 7.6% increase in interest earned, which came to Rs 76,007 crore compared to Rs 70,583 in the same quarter of the previous financial year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/union-budget-2025-government-can-provide-relief-to-taxpayers-personal-income-tax-expectations-2668438-2025-01-22",
      "headline": "Budget 2025: How government can provide relief to taxpayersBudget 2025 and income tax: The country's vast middle-class population is also calling for the inclusion of tax-saving provisions and deductions under the new income tax regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-threat-indian-stock-market-top-stock-picks-beml-lt-afcon-expert-view-2668410-2025-01-22",
      "headline": "Will Donald Trump's tariff suspense hurt Indian stocks? All you need to knowDonald Trump has also threatened BRICS nations with up to 100% tariffs against taking a decision that could lead to de-dollarisation of the global economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-3-things-government-can-do-to-tackle-climate-change-2668386-2025-01-22",
      "headline": "Budget 2025: 3 things government should focus on to tackle climate changeBudget 2025 expectations: Experts said climate action is the need of the hour and announcements related to clean energy will be crucial. There could be a push to boost green jobs as well."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/explained-why-icici-prudential-share-price-tumbled-10-percent-after-q3-results-2668387-2025-01-22",
      "headline": "Explained: Why ICICI Prudential shares tumbled 10% after Q3 resultsICICI Prudential share price: The company's share price decline came a day after Q3FY25 results, where it reported a 43% rise in net profit to Rs 326 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-down-23-percent-in-a-month-should-you-buy-or-avoid-expert-views-2668366-2025-01-22",
      "headline": "Zomato shares down over 23% in a month. Should you buy or avoid?Zomato share price: The food delivery giant's stock price has fallen over 14% in the previous two sessions and over 23% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/denta-water-ipo-open-today-for-bidding-subscribe-skip-review-latest-gmp-price-band-issue-size-details-2668344-2025-01-22",
      "headline": "Denta Water IPO opens for bidding: Should you subscribe? Check latest GMPDenta Water and Infra Solutions IPO: The price band for the IPO of Denta Water has been set at Rs 279-294 per share with retail investors required to invest a minimum of Rs 14,700. The minimum lot size for an application is 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-higher-driven-by-a-rally-in-it-sector-stocks-infosys-gains-2-percent-2668338-2025-01-22",
      "headline": "Sensex, Nifty open higher driven by a rally in IT sector stocks; Wipro gains 2%The S&P BSE Sensex was up 246.41 points to 76,084.77, while the NSE Nifty50 added 62.15 points to 23,086.80 as of 9:26 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-to-announce-q3-results-today-what-to-expect-net-profit-growth-share-price-2668331-2025-01-22",
      "headline": "HDFC Bank to announce Q3 results today: Here's what to expectHDFC Bank Q3 FY25 Results Expectations: Investors will be keeping a keen eye on the results as the stock of HDFC Bank has fallen 8.62% in the last month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-focus-on-effective-spending-not-income-tax-cuts-raghuram-rajan-davos-2668322-2025-01-22",
      "headline": "Budget 2025: Raghuram Rajan says tax cuts won't solve India's fiscal problemsFormer RBI Governor Raghuram Rajan said that he is not worried about the reduction in tax rates but instead about the need for more effective government spending, particularly in human capital development."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-hcltech-hdfc-bank-hul-tata-communication-zomato-sensex-nifty-2668316-2025-01-22",
      "headline": "Stocks to watch today: HCLTech, HDFC Bank, HUL, Tata Communication, ZomatoHDFC Bank, Hindustan Unilever (HUL), and Tata Communication will be announcing their Q3 FY25 results today, hence their stocks will likely see some action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ex-rbi-governor-raghuram-rajan-speaks-on-donald-trump-tariffs-job-creation-and-others-2668302-2025-01-22",
      "headline": "Ex-RBI Governor Raghuram Rajan speaks on Trump's tariffs, job creation and othersFormer RBI Governor Raghuram Rajan highlighted his views on issues like US President Donald Trump's plans to impose tariffs on some countries, including India, and how the economy and job creation is progressing under the Narendra Modi-led central government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-hike-raghuram-rajan-wef-davos-us-president-ex-rbi-governor-2668197-2025-01-21",
      "headline": "Concern for world, won't benefit US much: Raghuram Rajan on Trump tariff threatSpeaking to India Today TV, former RBI Governor Raghuram Rajan warned that US President Donald Trump's tariff plans could harm global economic stability, increase costs, and deter foreign investment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/diu/story/a-decade-of-budget-evolution-under-narendra-modi-2668150-2025-01-21",
      "headline": "A decade of budget evolution under ModiCoalition dynamics could influence future budgetary decisions, particularly in the welfare sector. Will the government maintain its current priorities?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/budget-2025-growth-taxes-fiscal-realities-in-numbers-2668140-2025-01-21",
      "headline": "What to expect from Budget 2025: Growth, taxes, and fiscal realities in numbersFY25's deficit is projected at 4.9 per cent of the GDP, or Rs 16.1 trillion. Despite slower economic growth, the government is expected to stick to its fiscal discipline plan."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/several-feared-dead-injured-after-train-passengers-run-over-by-karnataka-express-pushpak-express-in-maharashtra-jalgaon-2668605-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12 dead after passengers jump off train suspecting fire, run over by anotherPassengers of the Pushpak Express jumped off fearing a fire on the train, and were hit by the Karnataka Express, coming from the other side on an adjacent track in Jalgaon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-flags-visa-delays-with-us-counterpart-says-ties-not-served-well-if-it-takes-so-many-days-to-get-visa-2668823-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaishankar flags visa delays with US counterpart: 'Ties not served well if...'During his first bilateral meeting with the new US Secretary of State Marco Rubio, External Affairs Minister S Jaishankar raised concerns about the prolonged delays faced by Indian citizens in obtaining US visas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-score-abhishek-sharma-varun-chakravarthy-bazball-kolkata-2668753-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India vs England: Abhishek Sharma, spinners ruin Bazball's white-ball inductionIndia vs England, 1st T20I: Abhishek Sharma smashed a 34-ball 79 as India easily chased down a target of 133 in Kolkata. For England, the Brendon McCullum era in white-ball cricket got off to a shaky start, with their batters struggling against spin on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/turkey-ski-resort-fire-fire-alarm-didnt-go-off-until-i-ran-out-survivor-recounts-devastating-fire-that-killed-76-2668730-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fire alarm didn't go off until I ran out: Survivor recounts Turkey resort tragedyThe fire at the Grand Kartal Hotel, which claimed at least 76 lives early Monday, stands as one of the deadliest disasters in Turkish history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-stabbing-case-unanswered-questions-police-experts-2668712-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "6 days on since Saif Ali Khan stabbing, questions that remain unanswered   India Today TV spoke to Yashovardhan Azad, former IPS officer and former Special Director with the Intelligence Bureau, and PK Jain's, former additional DGP (Special Ops) over the inconsistencies in the Saif Ali Khan stabbing case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-vance-vice-president-first-ever-visit-to-oval-office-donald-trump-2668806-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "JD Vance's first time ever in Oval Office, Trump plays tour guideJD Vance visited the Oval Office for the first time ever after he took oath as the Vice President. His reaction to the President's office was captured in a video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-jdu-withdraws-support-to-bjp-in-manipur-says-lone-mla-will-be-in-opposition-2668527-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "JDU's damage control, sacks leader for 'no support to BJP in Manipur' letterThe JD(U) on Wednesday sacked its Manipur unit chief Kshetrimayum Biren Singh for writing a letter saying the party doesn't support the BJP in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attack-knife-third-part-found-bandra-lake-2668760-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Third part of knife used to attack Saif Ali Khan found near Bandra lakeThe first part of the 2.5-inch-long knife, which was lodged in Saif Ali Khan's body after the attack, was removed during emergency surgery and another part of the weapon was recovered later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/paatal-lok-season-2-prime-video-series-nagaland-depiction-naga-culture-society-jaideep-ahlawat-crime-drama-tv-2668372-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Paatal Lok is a stunner, and a rarity that gets Nagaland and Nagas rightPaatal Lok Season 2: By weaving Nagaland's cultural nuances and history into a gripping narrative, Prime Video series Pataal Lok Season 2, achieves a rare first. It shatters stereotypes and avoids the northeast exoticism trap. With breathtaking visuals and sensitive storytelling, Paatal Lok Season 2 has set a benchmark for mainstream portrayals of the northeast region of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/republic-day-will-change-how-you-marry-divorce-or-live-in-in-uttarakhand-2668577-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Republic Day will change how you marry, divorce or live-in in Uttarakhand A Uniform Civil Code in the state from January 26 will reform personal laws across religions, but the transformative exercise faces logistical, social and political challenges\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-narendra-modi-script-similarities-inaugration-january-20-golden-age-vishwaguru-similarities-america-great-unity-2668688-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump could have been reading from Modi's scriptDonald Trump's debut speech after being sworn in as the 47th President of the US echoed ideas that have been highlighted by Indian Prime Minister Narendra Modi. From striving to restore the glory of their respective countries to a belief of being the chosen one, here's how both leaders are on the same ideas page."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-pm-shahbaz-sharif-message-donald-trump-banned-x-elon-musk-vpn-hypocrisy-2668683-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Which VPN, people ask Shahbaz Sharif as he greets Trump on Pak-banned XPakistani PM Shahbaz Sharif took to X, banned in Pakistan, to congratulate Donald Trump. People called out his hypocrisy and asked which VPN he used to access the social media platform that ordinary Pakistanis can't access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/what-should-an-indian-teenager-skincare-actually-look-like-2668610-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What should an Indian teenager's skincare routine look like?Not giving a damn about skincare at all or overwhelming your skin with every possible viral skincare product - indulging in either route - is not ideal for teenagers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/vivek-ramaswamy-exit-doge-elon-musk-donald-trump-us-federal-bureaucracy-cleanup-2668601-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Behind-the-scenes 'account' of Vivek Ramaswamy's exit from now-Elon Musk-run DOGEVivek Ramaswamy's departure from DOGE has left Elon Musk as the sole leader of the department that is envisioned to clean up federal bureaucracy. But what went behind the scenes before Ramaswamy's unexpected exit?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-india-to-wear-pakistan-logo-on-jersey-2668563-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India jersey to feature Champions Trophy logo with Pakistan imprint: BCCIIndian team jersey will feature host Pakistan's names during the Champions Trophy, BCCI secretary Devajit Saikia said on Wednesday, 22 January. Saikia quashed the rumours that the BCCI wanted Pakistan's name to be removed from the Champions Trophy logo for their jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/how-can-bjp-neutralise-the-edge-aap-enjoys-in-delhi-polls-2668597-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How can BJP neutralise the edge AAP enjoys in Delhi polls?The BJP hopes that the Congress will dent the AAP's Muslim and Sikh votes, neutralising its 10 and two per cent leads respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/taimur-ali-khan-nanny-saif-ali-khan-residence-security-lapse-bravery-2668628-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shocked that Taimur took Saif to hospital, his mindset is strong: Former nannyTaimur's former nanny, Lalita D'Silva, spoke exclusively to India Today Digital and discussed potential security lapses in Saif Ali Khan's residence. She also praised Taimur for his strong mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-returns-la-home-meets-firefighters-food-evacuees-wildfire-neighbors-embarrassed-why-2668587-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kamala Harris returns to her LA home; embarrassment, say some, hero say othersFormer US vice president Kamala Harris is back home in Los Angeles. She is meeting LA wildfire firefighters and distributing food to evacuees. But her neighbours have mixed reactions. Some say they are embarrassed, while others hail her \"home town hero\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-pataudi-properties-considered-enemy-properties-2668551-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Pataudi properties are labelled as 'enemy property'Saif Ali Khan is embroiled in a legal battle over his family's ancestral properties, valued at Rs 15,000 crore, after the Madhya Pradesh High Court lifted a 2015 stay, potentially allowing the government to seize the assets under the Enemy Property Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/varun-chakravarthy-india-vs-england-cricket-t20i-series-2668695-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Varun Chakravarthy continues T20I resurgence, rattles England in KolkataVarun Chakaravrthy continued his sensational run in T20Is. Varun, on Wednesday, rattled the England middle-order. Varun dismissed Harry Brook and Liam Livingstone in the space of 3 balls in the first innings of the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mark-zuckerberg-like-lauren-sanchez-instagram-pic-x-users-share-screenshots-2668570-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Mark Zuckerberg like Lauren Sanchez's pic? Here's what X users thinkSeveral X users have flooded social media with screenshots suggesting that Mark Zuckerberg liked one of Lauren Sanchez's Instagram posts. Did he really do that? Read on to know more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-aaps-middle-class-manifesto-for-delhi-is-a-union-budget-bait-for-bjp-2668584-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why AAP's 'middle-class' manifesto for Delhi is a Union Budget bait for BJPThe charter of demands, which includes income-tax exemptions, a big hike in spending on education and zero-GST on health insurance, could be googlies for the Centre\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/farooq-abdullah-saif-ali-khan-stabbing-case-indians-in-us-analogy-bangladeshi-attacker-2668531-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Farooq Abdullah draws 'Indians in US' analogy over Saif's Bangladeshi attackerThe suspect arrested in the Saif Ali Khan stabbing case had entered India illegally from Bangladesh. Farooq Abdullah contended that an entire nation can't be blamed for one attack and went on to draw the analogy of Indians migrating to the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-trailer-vicky-kaushal-chhatrapati-sambhaji-maharaj-period-drama-rashmika-mandanna-laxman-utekar-2668599-2025-01-22?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava trailer: Vicky Kaushal roars as Chhatrapati Sambhaji Maharaj in period drama Vicky Kaushal's Chhaava trailer is finally out. Directed by Laxman Utekar, the film features Kaushal as Chhatrapati Sambhaji Maharaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-offers-rs-1-lakh-reward-to-auto-driver-bhajan-singh-rana-for-helping-saif-ali-khan-2668828-2025-01-22",
      "headline": "Mika Singh offers Rs 1 lakh reward to auto driver for helping Saif Ali KhanSinger Mika Singh promised a reward of Rs 1 lakh to the auto driver who saved Saif Ali Khan's life. The actor even met the driver at the hospital and personally thanked him for his help. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/paradha-teaser-anupama-parameswaran-darshana-rajendran-mystical-adventure-praveen-kandregula-2668667-2025-01-22",
      "headline": "Paradha teaser: Anupama Parameswaran, Darshana Rajendran team up for mystical dramaThe teaser of Paradha, directed by Praveen Kandregula of Cinema Bandi fame, hints at a story rooted in tradition, mystery, and the journey of three women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/photo/coldplay-chris-martin-dakota-johnson-leave-ahmedabad-rocking-mumbai-concert-2668801-2025-01-22",
      "headline": "Pics: Coldplay leaves for Ahmedabad after rocking Mumbai concert After treating fans to their beautiful concert in Mumbai, Coldplay headed to Ahmedabad for their second leg of the Music of the Spheres tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-panchayat-series-crossover-cyber-crime-awareness-campaign-2668758-2025-01-22",
      "headline": "Watch: Amitabh Bachchan x Panchayat crossover for Cyber Crime awareness campaignAmitabh Bachchan's video of spreading awareness against cybercrime has gone viral. The actor teamed up with Panchayat actors for the campaign. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hardik-pandya-suryakumar-yadav-india-vs-england-t20i-cricket-2668827-2025-01-22",
      "headline": "Hardik is key to India's 'different' approach post T20 World Cup: SuryakumarHardik Pandya is a key member of the Indian T20I side, said Suryakumar Yadav after winning the 1st T20I match vs England. India started their series with a dominant win, clinching the opener of the 5-match series by 7 wickets in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-arshdeep-singh-mohammed-shami-injury-concern-2668813-2025-01-22",
      "headline": "Shami is bowling like a 22-year-old: Arshdeep downplays fresh injury concernsIndia pacer Arshdeep Singh downplayed any fresh injury concerns for Mohammed Shami after the veteran bowler was not named in the playing XI for the first T20I against England in Kolkata."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-abhishek-sharma-yuvraj-singh-kolkata-cricket-2668761-2025-01-22",
      "headline": "Abhishek emulates 'guru' Yuvraj Singh, hits India's 2nd fastest fifty vs EnglandAbhishek Sharma destroyed the England bowling attack with a sensational fifty in the first T20I of the 5-match series. Abhishek hit his fifty in just 20 balls, which was second fastest by an Indian player in the format.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-jannik-sinner-wins-alex-de-minaur-reactions-2668755-2025-01-22",
      "headline": "Australian Open loss to Jannik Sinner feels like a slap, says Alex de MinaurAustralian tennis star Alex de Minaur was disappointed after losing the men's singles quarter-final to Jannik Sinner at the Australian Open 2025. Minaur said the loss to Sinner felt like a slap across the face. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-score-abhishek-sharma-varun-chakravarthy-bazball-kolkata-2668753-2025-01-22",
      "headline": "India vs England: Abhishek Sharma, spinners ruin Bazball's white-ball inductionIndia vs England, 1st T20I: Abhishek Sharma smashed a 34-ball 79 as India easily chased down a target of 133 in Kolkata. For England, the Brendon McCullum era in white-ball cricket got off to a shaky start, with their batters struggling against spin on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-nitish-reddy-stunning-catch-to-end-jos-buttler-68-run-knock-2668747-2025-01-22",
      "headline": "Watch: Nitish Reddy takes stunning catch to end Jos Buttler's 68-run knockIndia all-rounder Nitish Kumar Reddy pulled off a stunning catch in the deep to end Jos Buttler's 68-run knock during the first T20I in Kolkata on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hardik-pandya-jasprit-bumrah-india-vs-england-2668733-2025-01-22",
      "headline": "Hardik Pandya goes past Jasprit Bumrah in list of most T20I wickets for IndiaHardik Pandya went past Jasprit Bumrah in the list of most T20I wickets for India. Pandya registered the figures of 2/42 in the first T20I against England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hardik-pandya-shaheen-afridi-heist-video-teaser-2668714-2025-01-22",
      "headline": "Watch: Shaheen Afridi vs Hardik Pandya in viral Champions Trophy teaserChampions Trophy 2025: The International Cricket Council released a teaser for the eight-team tournament, which returns to the cricket calendar for the first time since 2017. Hardik Pandya and Shaheen Afridi prominently featured in the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-jos-buttler-fifty-mcculum-era-1st-t20i-kolkata-2668706-2025-01-22",
      "headline": "Jos Buttler kick starts McCullum era with brisk fifty in Kolkata T20I England captain Jos Buttler began the Brendon McCullum era with a solid and fighting fifty in the first T20I against India at the Eden Gardens in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/varun-chakravarthy-india-vs-england-cricket-t20i-series-2668695-2025-01-22",
      "headline": "Varun Chakravarthy continues T20I resurgence, rattles England in KolkataVarun Chakaravrthy continued his sensational run in T20Is. Varun, on Wednesday, rattled the England middle-order. Varun dismissed Harry Brook and Liam Livingstone in the space of 3 balls in the first innings of the game.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-to-deploy-17000-security-personnel-champions-trophy-2025-2668662-2025-01-22",
      "headline": "Pakistan to deploy at least 17,000 security personnel for Champions Trophy 2025Champions Trophy 2025: Pakistan will deploy at least 17,000 security personnel for the matches of the ICC tournament in Karachi, Lahore and Rawalpindi from February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hardik-pandya-jasprit-bumrah-india-vs-england-2668733-2025-01-22",
      "headline": "Hardik Pandya goes past Jasprit Bumrah in list of most T20I wickets for IndiaHardik Pandya went past Jasprit Bumrah in the list of most T20I wickets for India. Pandya registered the figures of 2/42 in the first T20I against England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hardik-pandya-shaheen-afridi-heist-video-teaser-2668714-2025-01-22",
      "headline": "Watch: Shaheen Afridi vs Hardik Pandya in viral Champions Trophy teaserChampions Trophy 2025: The International Cricket Council released a teaser for the eight-team tournament, which returns to the cricket calendar for the first time since 2017. Hardik Pandya and Shaheen Afridi prominently featured in the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-jos-buttler-fifty-mcculum-era-1st-t20i-kolkata-2668706-2025-01-22",
      "headline": "Jos Buttler kick starts McCullum era with brisk fifty in Kolkata T20I England captain Jos Buttler began the Brendon McCullum era with a solid and fighting fifty in the first T20I against India at the Eden Gardens in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/varun-chakravarthy-india-vs-england-cricket-t20i-series-2668695-2025-01-22",
      "headline": "Varun Chakravarthy continues T20I resurgence, rattles England in KolkataVarun Chakaravrthy continued his sensational run in T20Is. Varun, on Wednesday, rattled the England middle-order. Varun dismissed Harry Brook and Liam Livingstone in the space of 3 balls in the first innings of the game.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-to-deploy-17000-security-personnel-champions-trophy-2025-2668662-2025-01-22",
      "headline": "Pakistan to deploy at least 17,000 security personnel for Champions Trophy 2025Champions Trophy 2025: Pakistan will deploy at least 17,000 security personnel for the matches of the ICC tournament in Karachi, Lahore and Rawalpindi from February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-arshdeep-singh-india-record-yuzvendra-chahal-t20i-most-wickets-2668666-2025-01-22",
      "headline": "Arshdeep breaks Chahal's record, becomes India's leading T20I wicket-takerIndia vs England, 1st T20I: Arshdeep Singh struck twice in the powerplay in Kolkata to peg England back. With the double strike, he went past Yuzvendra Chahal's tally for the most wickets by an Indian in the shortest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-t20i-shami-absence-kolkata-aakash-chopra-2668638-2025-01-22",
      "headline": "Is Mohammed Shami not fit? Aakash Chopra questions after pacer left out of 1st T20IFormer India opener Aakash Chopra questioned Mohammed Shami's fitness after the veteran pacer was left out of India's playing XI for the first T20I against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/lewis-hamilton-ferraris-formula-1-car-first-drive-2668641-2025-01-22",
      "headline": "Watch: Lewis Hamilton's first drive in Ferrari's Formula 1 carLewis Hamilton drove a bright red Ferrari Formula 1 car for the first time ahead of the upcoming season. Ferrari posted the video of Hamilton taking the car for a spin in the team's test track in Italy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-mohammed-shami-return-not-playing-xi-kolkata-2668633-2025-01-22",
      "headline": "Mohammed Shami's return delayed, pacer left out of Kolkata T20IIndia vs England, 1st T20I: After adding him to the squad for the T20I series against England, the Indian team management decided not to pick Mohammed Shami in the playing XI for the series opener in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/exiled-afghanistan-women-cricketer-firooza-amiri-men-team-voice-of-girls-2668626-2025-01-22",
      "headline": "Afghanistan women cricketer urges men's team to be the 'voice of girls'Afghanistan cricketer Firooza Amiri said that the women's cricketers in Afghanistan could flourish if the men's team raise their voices. After the Taliban took charge in 2021, women in the country were disallowed from working or playing any sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/coldplay-chris-martin-halts-mumbai-concert-read-letter-jasprit-bumrah-lawyers-2668586-2025-01-22",
      "headline": "Coldplay's Chris Martin halts concert to joke about letter from Bumrah's lawyersColdplay lead singer Chris Martin paused his Mumbai concert to joke about a 'letter from Jasprit Bumrah's lawyers'. UK band Coldplay performed their final Mumbai show on January 21.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-jannik-sinner-alex-de-minaur-semi-final-2668575-2025-01-22",
      "headline": "Jannik Sinner demolishes Alex de Minaur to secure semi-final berthAustralian Open 2025: Jannik Sinner advanced to the semi-final of the men's singles at Melbourne Park after beating homw favourite Alex de Minaur 6-3, 6-2, 6-1 at the Rod Laver Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/exiled-afghanistan-women-cricketer-firooza-amiri-men-team-voice-of-girls-2668626-2025-01-22",
      "headline": "Afghanistan women cricketer urges men's team to be the 'voice of girls'Afghanistan cricketer Firooza Amiri said that the women's cricketers in Afghanistan could flourish if the men's team raise their voices. After the Taliban took charge in 2021, women in the country were disallowed from working or playing any sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/coldplay-chris-martin-halts-mumbai-concert-read-letter-jasprit-bumrah-lawyers-2668586-2025-01-22",
      "headline": "Coldplay's Chris Martin halts concert to joke about letter from Bumrah's lawyersColdplay lead singer Chris Martin paused his Mumbai concert to joke about a 'letter from Jasprit Bumrah's lawyers'. UK band Coldplay performed their final Mumbai show on January 21.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-jannik-sinner-alex-de-minaur-semi-final-2668575-2025-01-22",
      "headline": "Jannik Sinner demolishes Alex de Minaur to secure semi-final berthAustralian Open 2025: Jannik Sinner advanced to the semi-final of the men's singles at Melbourne Park after beating homw favourite Alex de Minaur 6-3, 6-2, 6-1 at the Rod Laver Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-india-to-wear-pakistan-logo-on-jersey-2668563-2025-01-22",
      "headline": "India jersey to feature Champions Trophy logo with Pakistan imprint: BCCIIndian team jersey will feature host Pakistan's names during the Champions Trophy, BCCI secretary Devajit Saikia said on Wednesday, 22 January. Saikia quashed the rumours that the BCCI wanted Pakistan's name to be removed from the Champions Trophy logo for their jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-vs-ravindra-jadeja-ranji-trophy-all-you-need-to-know-saurashtra-vs-delhi-2668561-2025-01-22",
      "headline": "Rishabh Pant vs Ravindra Jadeja in Ranji Trophy as Saurashtra host DelhiThe Delhi vs Saurashtra Ranji Trophy match will feature an interesting battle between wicketkeeper Rishabh Pant and all-rounder Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-ireland-vs-pakistan-super-sixes-rain-2668558-2025-01-22",
      "headline": "Ireland knock shoddy Pakistan out of U19 Women's T20 World CupU19 Women's T20 World Cup 2025: Niamh MacNulty's Ireland beat Komal Khan's Pakistan by 13 runs (DLS) and made their way through to the Super Sixes. Pakistan failed to win a single match in the group stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-ranji-trophy-mumbai-vs-jammu-kashmir-livestreaming-details-where-to-watch-2668555-2025-01-22",
      "headline": "Rohit Sharma's Ranji return: When and where to watch Mumbai vs Jammu and KashmirRohit Sharma returns to Ranji Trophy after nearly a decade. The India Test and ODI captain will be playing against Jammu and Kashmir with the match starting on January 23. Here's where you can watch Mumbai's Ranji Trophy game against J&K.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}