{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amfi-data-june-2025-mutual-fund-inflows-rise-24-percent-stock-market-news-2753021-2025-07-09",
      "headline": "Mutual fund inflows rise 24% in June to Rs 23,587 crore: AMFI dataAmong the 11 equity mutual fund categories, all except equity-linked savings schemes (ELSS) recorded positive inflows. Flexi cap funds emerged as the most preferred option for investors, bringing in Rs 5,733 crore in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/9-countries-where-indians-can-get-citizenship-for-less-than-rs-1-crore-2753019-2025-07-09",
      "headline": "9 countries where Indians can get citizenship for less than Rs 1 croreAcross many countries, it is now fully legal to buy citizenship. With a single payment or donation, Indians can get a fresh passport that offers visa-free access and minimal global taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-asset-management-files-for-ipo-check-details-2752973-2025-07-09",
      "headline": "ICICI Prudential Asset Management files for IPO. Check offer detailsThe IPO will be an offer for sale of up to 1.77 crore shares, representing 10% of the company's equity share capital. The shares will be sold by Prudential Corporation Holdings Limited (PCHL), a wholly-owned subsidiary of UK-based insurer Prudential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/crizac-share-price-ipo-listing-14-percent-premium-rs-280-bse-nse-dalal-street-2752968-2025-07-09",
      "headline": "Crizac IPO listing: Shares debut at 14% premium on Dalal StreetCrizac share price: The stock opened at Rs 280 on the Bombay Stock Exchange (BSE) showing a 14.29% premium on its Dalal Street debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-sip-rs-2000-per-month-investment-enough-to-make-you-rich-ca-explains-2752959-2025-07-09",
      "headline": "Will Rs 2,000 SIP make you rich? CA breaks it downMany young investors trust SIPs to secure their future but without clear goals, even long-term discipline might not be enough, warns CA and financial planning advisor Abhishek Walia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/studying-abroad-here-is-how-you-can-manage-your-finances-smartly-2752738-2025-07-09",
      "headline": "Studying abroad? Here's how you can manage your finances smartlyStudying abroad is a huge step, and an amazing opportunity. But a bit of smart financial planning can help you enjoy every moment without money worries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-130-points-lower-nifty-below-25500-hul-up-1-percent-2752940-2025-07-09",
      "headline": "Sensex opens 130 points lower, Nifty below 25,500; HUL up 1%The S&P BSE Sensex was down by 158.94 points to 83,553.57, while the NSE Nifty50 lost 41.70 points to 25,480.80 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wolfspeed-share-price-us-stock-market-wall-street-rise-248-percent-5-days-nasdaq-new-cfo-gregor-van-issum-2752924-2025-07-09",
      "headline": "Wolfspeed shares surge 248% in 5 days. What's powering this Nasdaq stock?Wolfspeed shares opened with a 43% jump on Tuesday over the previous day's close of $1.18 and reached an intraday high of $3.33. The stock ended the day at $2.52, up 9%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sabih-khan-apple-new-coo-work-experience-leadership-change-2752900-2025-07-09",
      "headline": "Who is Sabih Khan? Apple's new COO overtaking Jeff WilliamsThe announcement came on Tuesday, with the company confirming that Sabih Khan will step into the role later this month. He takes over from Jeff Williams, who has held the post since 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ipl-valuation-rcb-brand-value-more-csk-mumbai-indians-cricket-news-houlihan-lokey-report-2752899-2025-07-09",
      "headline": "RCB overtakes CSK as IPL's most valuable team, league now worth $18.5 billionA report released by investment bank Houlihan Lokey said the IPL's business value rose by 13% in 2025 to $18.5 billion. At the same time, the brand value of the league increased by 14% to nearly $4 billion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-hopeful-of-inking-trade-deal-but-new-delhi-firm-on-protecting-key-sectors-2752663-2025-07-08",
      "headline": "India, US hopeful of inking trade deal, but New Delhi firm on protecting key sectorsIndia and the United States are nearing a trade deal, with negotiations ongoing. India has taken a firm stance on protecting sensitive sectors, particularly wheat, maize, dairy, and genetically grown crops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-dearness-allowance-60-percent-central-government-employees-salary-rise-2752659-2025-07-08",
      "headline": "Will central government employees' dearness allowance reach 60%?The government revises the DA/DR rates twice a year, effective from January 1 and July 1. However, the official announcement generally comes a few months later."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-basu-backs-deepika-padukone-8-hour-shift-demand-dont-like-long-hours-myself-2752987-2025-07-09",
      "headline": "Don't like long hours myself: Anurag Basu backs Deepika's 8-hour shift demand'Metro... In Dino' director Anurag Basu supported Deepika Padukone's eight-hour work shift demand. He explained his own approach to filmmaking, and highlighted that he himself doesn't like working for long hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/melbourne-film-festival-honour-100-years-guru-dutt-pyaasa-kaagaz-ke-phool-screening-2753006-2025-07-09",
      "headline": "Melbourne Film Festival to honour Guru Dutt with Pyaasa, Kaagaz Ke Phool screeningGuru Dutt's timeless tales 'Pyaasa' and 'Kaagaz Ke Phool' find new light at the Indian Film Festival of Melbourne (IFFM), gearing up to relive the golden age of Indian cinema on the big screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/law-and-the-city-review-lee-jong-suks-legal-drama-has-more-heart-than-hype-2752997-2025-07-09",
      "headline": "Law and the City review: Lee Jong-suk's legal drama has more heart than hypeRelease Date:Sat Jul 05, 2025'Law and the City' is a nuanced legal drama that delves into the personal philosophies and everyday challenges of its characters beyond the courtroom. Featuring compelling performances by Lee Jong-suk and Moon Ka-young, the series explores themes of respect, growth, and friendship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-enjoys-movie-date-with-saba-azad-as-war-2-wraps-up-2752966-2025-07-09",
      "headline": "Hrithik Roshan enjoys movie date with Saba Azad as War 2 shoot comes to an endActor Hrithik Roshan and his girlfriend Saba Azad were seen exiting a cinema hall in Mumbai's Juhu on Tuesday. Their movie outing came after the wrap-up celebrations of Roshan's upcoming film 'War 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pedro-pascal-leads-fantastically-stylish-cast-at-fantastic-four-berlin-event-pics-2752982-2025-07-09",
      "headline": "Pedro Pascal leads fantastically stylish cast at Fantastic Four Berlin event. PicsPedro Pascal, Vanessa Kirby and the rest of the team of 'The Fantastic Four: First Steps' attended a glitzy fan event in Berlin on Tuesday. Pascal, of course, looked every bit like the internet's favourite daddy that he is. Check out the pictures inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-documentary-hit-with-rs-5-crore-notice-for-using-chandramukhi-footage-2752969-2025-07-09",
      "headline": "Nayanthara hit with Rs 5 crore notice for using Chandramukhi footage in documentaryThe controversy surrounding the Netflix documentary 'Nayanthara: Beyond The Fairytale' continues to escalate, with the latest development being a legal notice issued to the producers by the High Court.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-ex-personal-assistant-arrested-cheating-actor-rs-77-lakh-fraud-case-2752962-2025-07-09",
      "headline": "Fake signature, Rs 77 lakh gone: Alia Bhatt's ex-staffer arrested for duping herActor Alia Bhatt's ex-personal assistant, Vedika Prakash Shetty, has been arrested on charges of allegedly swindling Rs 77 lakh from Bhatt's production house and her personal accounts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-praises-son-abhishek-bachchan-performance-as-dus-celebrates-20-years-2752933-2025-07-09",
      "headline": "Fans vouch for Abhishek Bachchan's performance on Dus 20th anniversary, Big B agreesVeteran actor Amitabh Bachchan praised son Abhishek's performance in 'Dus' as the film celebrated 20 years of release on Tuesday. Directed by Anubhav Sinha, 'Dus' was released in 2005. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-yasser-desai-in-legal-trouble-for-shooting-song-on-sea-link-2752960-2025-07-09",
      "headline": "Singer Yasser Desai in legal trouble for shooting song on Worli sea linkSinger and composer Yasser Desai has found himself in legal trouble after a video of him shooting a song on the Bandra-Worli Sea Link went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-box-office-collection-day-5-detailed-report-anurag-basu-film-gets-monsoon-boost-on-weekdays-2752947-2025-07-09",
      "headline": "Metro In Dino box office Day 5: Anurag Basu's film gets monsoon boost on weekdays'Metro... In Dino' collected more on Tuesday than Monday, which speaks about the growing word-of-mouth around its content. The Anurag Basu-directorial is running successfully in the metros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bad-girl-film-release-varsha-bharath-vetri-maaran-anurag-kashyap-controversial-brahmin-portrayal-2752925-2025-07-09",
      "headline": "Bad Girl: Controversial Tamil film on Brahmin portrayal censored, release date outDirector Varsha Bharath's Tamil film 'Bad Girl' will release in theatres in India on September 5. The film's teaser was criticised for its Brahmin portrayal and promoting alcoholism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-wishes-brother-in-law-film-producer-atul-agnihotri-on-birthday-alvira-khan-agnihotri-2752919-2025-07-09",
      "headline": "I'll be the man you are: Salman Khan to Atul Agnihotri in birthday wish postActor Salman Khan extended birthday wishes to filmmaker and his brother-in-law Atul Agnihotri with an adorable post on Instagram. He appreciated Atul's role as a husband and father in the sweet post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-manushi-chillar-seek-blessings-at-bangla-sahib-before-maalik-release-2752927-2025-07-09",
      "headline": "Rajkummar Rao, Manushi Chillar seek blessings at Bangla Sahib before Maalik releaseRajkummar Rao and Manushi Chillar visited Bangla Sahib gurdwara ahead of the release of their upcoming film 'Maalik.' The film will release in theatres on July 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-raj-nidimoru-detroit-photo-dump-make-it-official-fans-2752898-2025-07-09",
      "headline": "Samantha's Detroit photo dump features Raj Nidimoru. Make it official, say fansSamantha Ruth Prabhu shared a carousel of photos from her recent Detroit getaway. In one of the photos, she can be seen holding director Raj Nidimoru, her rumoured boyfriend, close as they strolled the streets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wellness-romance-jennifer-aniston-and-jim-curtis-vacation-together-in-spain-glbs-2752881-2025-07-09",
      "headline": "Wellness and romance? Jennifer Aniston, Jim Curtis vacation together in SpainJennifer Aniston was spotted holidaying in Mallorca with hypnotist Jim Curtis, sparking dating rumours. Their shared interest in wellness and visible Instagram interactions hint at a deeper personal or romantic connection.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-diddy-combs-to-be-sentenced-october-3-after-federal-prostitution-conviction-glbs-2752873-2025-07-09",
      "headline": "Sean 'Diddy' Combs to be sentenced October 3 after federal prostitution convictionSean \"Diddy\" Combs was convicted on two federal charges of transporting individuals for prostitution. He remains in custody as prosecutors seek a harsher sentence, citing his violent history and abuse evidence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actress-humaira-asghar-found-dead-in-karachi-apartment-glbs-2752864-2025-07-09",
      "headline": "Pakistani actor, model Humaira Asghar found dead in Karachi apartmentPakistani actress Humaira Asghar was found dead in her Karachi apartment. Her decomposed body suggests she died weeks ago. Police await autopsy results and urge the public to avoid speculation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-and-jungkook-could-attend-sojang-defamation-case-hearing-2752759-2025-07-08",
      "headline": "BTS' V, Jungkook could attend Sojang defamation case hearing: ReportsBTS members V and Jungkook's defamation case against controversial YouTuber Sojang has taken a new turn, with the court now urging both sides to consider a possible settlement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jhonny-depp-breaks-silence-being-dropped-from-fantastic-beasts-2752709-2025-07-08",
      "headline": "Johnny Depp breaks silence on being fired from Fantastic BeastsFive years after being fired from the 'Fantastic Beasts' franchise, actor Johnny Depp spoke about the moment he was asked to step away, and what it meant to him."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-voter-revision-list-aadhaar-not-first-identity-says-uidai-chief-amid-voter-list-revision-row-2752756-2025-07-08",
      "headline": "Aadhaar is never the first identity: UIDAI chief amid Bihar voter revision rowSpeaking exclusively to India Today, Kumar highlighted UIDAI's ongoing efforts to check the fake Aadhaar card industry, stating that Aadhaar cards have a built-in security mechanism through a QR code."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-bridge-collapse-dead-injured-gujarat-vehicles-fall-mahisagar-river-gambhira-2753012-2025-07-09",
      "headline": "9 killed after several vehicles fall into river as bridge collapses in VadodaraGujarat Bridge Collapse: Preliminary information indicated at least five vehicles had fallen into the river after the bridge collapse.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sheikh-hasina-leaked-audio-shoot-order-student-protesters-bangladesh-2752999-2025-07-09",
      "headline": "Leaked audio hints Sheikh Hasina gave 'find-and-shoot' order on agitators: ReportAt least 1,400 people were killed in the crackdown in 2024 as Bangladesh was roiled by student protests over a controversial quota system in government jobs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shiv-sena-mla-sanjay-gaikwad-thrashes-maharashtra-canteen-contractor-viral-video-2752944-2025-07-09",
      "headline": "'Apne style se': Angry over dal, Sena MLA dishes out punches on canteen operatorThe incident happened at the Akashwani MLA residence. Sanjay Gaikwad claimed that the food - especially the dal - was of poor quality, and he felt unwell shortly after eating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-modi-in-namibia-final-stop-of-five-nation-tour-focuses-on-energy-and-defence-ties-2752993-2025-07-09",
      "headline": "PM Modi gets traditional welcome in Namibia, tries his hands on local drumsPrime Minister Narendra Modi has arrived in Windhoek, Namibia, marking the final stop of his five-nation tour aimed at promoting the Global South. This visit, the first by an Indian Prime Minister to Namibia in 27 years, aims to strengthen India-Namibia relations.\r\n\r\nKey focus areas include uranium exports to India, exploration of recent oil and gas discoveries in Namibia, and potential defence cooperation. The visit also highlights India's efforts to forge stronger ties with African nations. PM Modi's itinerary includes addressing a joint session of the Namibian parliament and receiving the country's highest civilian award.\r\n\r\nThe Prime Minister's five-nation tour, one of his longest foreign visits in recent years, began on July 2 and has included stops in Ghana, Trinidad and Tobago, Argentina, and Brazil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-tejashwi-yadav-chakka-jam-protest-election-commission-electoral-roll-revision-bihar-assembly-polls-bharat-bandh-news-2752915-2025-07-09",
      "headline": "Trains halted, roads blocked: INDIA bloc protests over Bihar voter roll revisionRahul Gandhi will join the protest march at 10 am in Patna against the Election Commission of India's Special Intensive Revision (SIR) of electoral rolls, marching from the Income Tax office at Golambar to the Election Commission office. Tejashwi Yadav will also take part in the march."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-bihar-special-intensive-revision-eci-non-citizens-vote-india-row-aadhaar-card-documents-form-6-2752797-2025-07-09",
      "headline": "How even non-citizens get to vote in India. The devil lies in Form 6The Election Commission is holding an intensive revision of voter rolls across India, beginning with Bihar, to update them and weed out non-citizens. But why did India allow non-citizens to get into the rolls in the first place? Form 6, which people fill to register as voters, doesn't demand proof of citizenship in the first place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-carlos-alacaraz-beats-cameron-norrie-taylor-fritz-beats-kachanov-2752848-2025-07-08",
      "headline": "Alcaraz dominates Norrie, Fritz knocks out Khachanov to advance to semisCarlos Alcaraz and Taylor Fritz sealed their berths in the semi-final of Wimbledon 2025 following their victories over Cameron Norrie and Karen Khachanov, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/googles-ai-mode-in-search-arrives-in-india-but-english-only-for-now-2752990-2025-07-09",
      "headline": "Google brings AI Mode in Search to India: Ask anything, ask any wayGoogle has started rolling out its AI Mode in Search to users in India. However, the feature will initially be available only in English. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tammy-bruce-donald-trump-us-president-india-pakistan-ceasefire-claims-operation-sindoor-2752980-2025-07-09",
      "headline": "Opinions can be wrong: US on India's objections to Pak truce claim by TrumpUS State Department spokesperson Tammy Bruce was firm on President Donald Trump's repeated claims about brokering a ceasefire between India and Pakistan, saying that in the modern world where every event plays out in real-time, it is for people to analyse and form their own opinion instead of relying only on comments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-ex-personal-assistant-arrested-cheating-actor-rs-77-lakh-fraud-case-2752962-2025-07-09",
      "headline": "Fake signature, Rs 77 lakh gone: Alia Bhatt's ex-staffer arrested for duping herActor Alia Bhatt's ex-personal assistant, Vedika Prakash Shetty, has been arrested on charges of allegedly swindling Rs 77 lakh from Bhatt's production house and her personal accounts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-strong-message-in-brazil-no-place-for-double-standards-on-terrorism-glbs-2752866-2025-07-09",
      "headline": "No place for double standards on terrorism: PM Modi's strong message in BrazilIndia and Brazil reaffirmed their united stance against terrorism, with PM Modi emphasizing zero tolerance and no double standards, indirectly calling out Pakistan and China for supporting terrorist activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-killer-whales-bring-food-to-humans-in-rare-moment-caught-on-camera-2753015-2025-07-09",
      "headline": "Killer whales bring food to humans in rare moment caught on videoThese events, recorded in four different oceans, involved orcas approaching people on boats, in the water, and even standing on the shore with gifts ranging from fish and mammals to birds, invertebrates, and even seaweed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/kanimozhi-says-vijay-doesnt-have-political-experience-dont-know-difference-between-state-and-central-govt-2753010-2025-07-09",
      "headline": "Some poor things don't have experience in politics: Kanimozhi takes dig at VijayDMK MP Kanimozhi took a veiled dig at actor-politician Vijay, calling him inexperienced and unaware of governance basics. Her remarks come amid growing friction between the ruling DMK and Vijay's party, Tamilaga Vettri Kazhagam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-367-brian-lara-400-test-record-indian-batter-do-same-2752914-2025-07-09",
      "headline": "Wiaan Mulder aborted Mission 400. Could any Indian batter do the same?South Africa's Wiaan Mulder was unbeaten on 367 when he declared the innings-despite having both the time and momentum to chase down Brian Lara's Test record. How many Indian cricketers would've done the same?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gorukhuti-dairy-project-assam-cow-mismanagement-bjp-leaders-controversy-2752923-2025-07-09",
      "headline": "Assam BJP chief accused of cow scam: Public funds used, no delivery madeAccording to an RTI reply, 90 cows were given to seven 'public representatives' who were supposed to distribute them to local farmers. One of the recipients, BJP state chief Dilip Saikia, allegedly neither paid the full amount nor provided documentation for the return of the cows to the farmers he claimed were 'bought.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/foreign-artist-sparks-outrage-after-calling-indian-jhoola-a-gothic-swing-2752984-2025-07-09",
      "headline": "Foreign artist sparks outrage after calling Indian jhoola a 'gothic swing'The foreign artist, who goes by the name Anne Chovy on X, was accused of cultural misrepresentation after posting an image of an elaborately carved wooden swing found in several Indian households. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/traumatized-damage-to-babys-head-indian-origin-doctor-gynaecologist-premila-thampi-suspended-in-uk-britain-2752764-2025-07-08",
      "headline": "Indian-origin doctor suspended in UK for forcefully using forceps to deliver babyAn Indian-origin consultant gynaecologist was suspended after being found guilty of serious professional misconduct. She pressured a first-time mother at a UK hospital to accept forceps delivery despite the patient's clear request for a C-section. The woman claimed she was left traumatised, and the forceps caused damage to her baby's head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/apoorva-mukhija-raj-kundra-ram-kapoor-bigg-boss-19-tentative-contestants-list-2752920-2025-07-09",
      "headline": "Apoorva Mukhija, Raj Kundra to Ram Kapoor: Tentative Bigg Boss 19 contestantsAs Bigg Boss 19 is fast approaching, a list featuring the probable contestants has been doing the rounds. Apoorva Mukhija, Raj Kundra, Ram Kapoor, Tanushree Dutta and several others are likely to be part of the Salman Khan-hosted show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/gaganyaan-mission/story/isro-tests-gaganyaan-engines-brings-india-closer-to-sending-humans-to-space-2752994-2025-07-09",
      "headline": "India takes big step toward Gaganyan mission with key engine testsThe tests were aimed at validating the configuration and performance of the propulsion system, a critical component of the Gaganyaan Orbital Module. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rohit-bal-manish-malhotra-fdci-india-couture-week-2025-what-to-expect-exclusive-2752625-2025-07-09",
      "headline": "India Couture Week is back with fashion favourites (& what to expect this season)The line-up for the 2025 edition includes Rohit Bal, JJ Valaya, Malhotra, Ritu Kumar, Tahiliani, Amit Aggarwal, Falguni Shane Peacock, Mishra, Shantnu & Nikhil, Suneet Verma, Rimzim Dadu, Jayanti Reddy, Rose Room by Isha Jajodia and Aisha Rao.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/meet-sabih-khan-the-moradabad-born-executive-set-to-become-apples-next-coo-2752943-2025-07-09",
      "headline": "Meet Sabih Khan, the Moradabad-born executive set to become Apple's next COOSabih Khan, a Moradabad-born Apple veteran, is set to become the company's next COO, bringing decades of experience in operations, sustainability, and supply chain leadership to the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-eng-vs-ind-edgbaston-test-motm-sholay-2752928-2025-07-09",
      "headline": "Akash Deep: India's silent sniper who deserved Edgbaston's crownEngland vs India: At Edgbaston's Ramgarh, Akash Deep and Siraj played Jai and Veeru to perfection, slaying England's Bazballing bandits with sheer grit and fire. While batters basked in the sunshine, it was India's unsung guns who turned history on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asias-oldest-elephant-vatsala-dies-in-madhya-pradesh-aged-over-100-2752850-2025-07-09",
      "headline": "Asia's oldest elephant, Vatsala, dies in Madhya Pradesh aged over 100Vatsala was considered to be Asia's oldest elephant. Her last rites were performed by officers and employees of the Panna Tiger Reserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-tu-meri-main-tera-main-tera-tu-meri-nawalgarh-photos-ananya-panday-2752998-2025-07-09",
      "headline": "Ancient roofs, sunset, royal homes in Kartik Aaryan's Nawalgarh photo-dumpActor Kartik Aaryan shared photos capturing Nawalgarh's charm on social media. He is shooting for his upcoming film 'Tu Meri Main Tera Main Tera Tu Meri', which also stars Ananya Panday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-meghnad-vikrant-massey-most-expensive-indian-film-budget-rs-1600-crore-nitesh-tiwari-movie-with-ranbir-kapoor-2752961-2025-07-09",
      "headline": "Actor who made his debut with television, now features in this Rs 1600 crore epicAn actor who was introduced to the performing arts at the age of seven, is now going to feature in India's most ambitious movie project. From working in popular Hindi television shows to acting alongside Priyanka Chopra and Deepika Padukone, he is not Shah Rukh Khan, Ranveer Singh or Shahid Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-basu-backs-deepika-padukone-8-hour-shift-demand-dont-like-long-hours-myself-2752987-2025-07-09",
      "headline": "Don't like long hours myself: Anurag Basu backs Deepika's 8-hour shift demand'Metro... In Dino' director Anurag Basu supported Deepika Padukone's eight-hour work shift demand. He explained his own approach to filmmaking, and highlighted that he himself doesn't like working for long hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/melbourne-film-festival-honour-100-years-guru-dutt-pyaasa-kaagaz-ke-phool-screening-2753006-2025-07-09",
      "headline": "Melbourne Film Festival to honour Guru Dutt with Pyaasa, Kaagaz Ke Phool screeningGuru Dutt's timeless tales 'Pyaasa' and 'Kaagaz Ke Phool' find new light at the Indian Film Festival of Melbourne (IFFM), gearing up to relive the golden age of Indian cinema on the big screen.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nasser-hussain-jofra-archer-return-england-bowling-india-test-lords-2753011-2025-07-09",
      "headline": "Fingers crossed for Archer's Test comeback at Lord's, says HussainFormer captain Nasser Hussain has voiced concerns over England's faltering bowling attack—and believes the return of Jofra Archer might be the spark they desperately need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-paint-my-beard-yuvraj-singh-bond-charity-event-2753009-2025-07-09",
      "headline": "Virat Kohli talks Test retirement, bond with Yuvraj Singh at charity eventVirat Kohli opened up for the first time about his Test retirement at a charity event in London, joking about age and reflecting emotionally on his bond with Yuvraj Singh and India's new Test chapter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-rishabh-pant-test-england-vs-india-2752989-2025-07-09",
      "headline": "Rishabh Pant should be compared with best Test batters, not Gilchrist: AshwinVeteran Indian spinner Ravichandran Ashwin has weighed in on Rishabh Pant's batting approach in Test cricket, urging a shift in how the dynamic wicketkeeper-batter is assessed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-nico-hulkenberg-british-grand-prix-hulk-podium-force-india-2752958-2025-07-09",
      "headline": "The Incredible Hulk: Nico's F1 Redemption is the life lesson we all needFifteen years. Two exits. Zero podiums — until Silverstone. Nico Hülkenberg's moment finally arrived, not with fireworks, but with rain, resilience, and redemption. A green car. A gritty drive. And the roar of destiny fulfilled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-day-10-schedule-sinner-djokovic-swiatek-quarter-final-2752950-2025-07-09",
      "headline": "Day 10 schedule: Sinner, Djokovic, and Swiatek eye semi-final spotWimbledon 2025 Schedule for July 9: Jannik Sinner, Novak Djokovic, and Iga Swiatek will be aiming to secure semifinal spots on Day 10 of The Championships at the All England Lawn Tennis and Croquet Club in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-vs-jofra-archer-stuart-broad-jos-buttler-lords-2752949-2025-07-09",
      "headline": "Shubamn Gill vs Jofra Archer at Lord's: England duo on ENG vs IND 3rd TestShubman Gill's dream run in the ongoing India vs England Test series could face a fresh challenge at Lord's, with Stuart Broad and Jos Buttler backing Jofra Archer to unsettle the in-form India captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-eng-vs-ind-edgbaston-test-motm-sholay-2752928-2025-07-09",
      "headline": "Akash Deep: India's silent sniper who deserved Edgbaston's crownEngland vs India: At Edgbaston's Ramgarh, Akash Deep and Siraj played Jai and Veeru to perfection, slaying England's Bazballing bandits with sheer grit and fire. While batters basked in the sunshine, it was India's unsung guns who turned history on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-captaincy-batting-questioned-ashes-2752918-2025-07-09",
      "headline": "Is it time to review Stokes' Bazball resume? England captain needs to feel heatBen Stokes in recent times has seen Bazball and England struggle, especially during the Edgbaston Test loss. With a poor run of form with the bat and questionable captaincy calls, Stokes needs to step up or face the heat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-367-brian-lara-400-test-record-indian-batter-do-same-2752914-2025-07-09",
      "headline": "Wiaan Mulder aborted Mission 400. Could any Indian batter do the same?South Africa's Wiaan Mulder was unbeaten on 367 when he declared the innings-despite having both the time and momentum to chase down Brian Lara's Test record. How many Indian cricketers would've done the same?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-speeding-car-crash-liverpool-forensic-report-2752875-2025-07-09",
      "headline": "Diogo Jota speeding in fatal crash, initial forensic analysis reveals: ReportInitial forensic analysis reportedly suggests that Diogo Jota was likely speeding, which resulted in the fatal car crash that took place in the northwest region of Spain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/joao-pedro-brace-chelsea-reach-club-world-cup-final-2752897-2025-07-09",
      "headline": "Joao Pedro heroics guide Chelsea past Fluminense into finalJoão Pedro delivered a dream performance against his former club, scoring twice to lead Chelsea to a 2-0 victory over Fluminense in the FIFA Club World Cup semi-final at MetLife Stadium on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-eng-vs-ind-edgbaston-test-motm-sholay-2752928-2025-07-09",
      "headline": "Akash Deep: India's silent sniper who deserved Edgbaston's crownEngland vs India: At Edgbaston's Ramgarh, Akash Deep and Siraj played Jai and Veeru to perfection, slaying England's Bazballing bandits with sheer grit and fire. While batters basked in the sunshine, it was India's unsung guns who turned history on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-captaincy-batting-questioned-ashes-2752918-2025-07-09",
      "headline": "Is it time to review Stokes' Bazball resume? England captain needs to feel heatBen Stokes in recent times has seen Bazball and England struggle, especially during the Edgbaston Test loss. With a poor run of form with the bat and questionable captaincy calls, Stokes needs to step up or face the heat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-367-brian-lara-400-test-record-indian-batter-do-same-2752914-2025-07-09",
      "headline": "Wiaan Mulder aborted Mission 400. Could any Indian batter do the same?South Africa's Wiaan Mulder was unbeaten on 367 when he declared the innings-despite having both the time and momentum to chase down Brian Lara's Test record. How many Indian cricketers would've done the same?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-speeding-car-crash-liverpool-forensic-report-2752875-2025-07-09",
      "headline": "Diogo Jota speeding in fatal crash, initial forensic analysis reveals: ReportInitial forensic analysis reportedly suggests that Diogo Jota was likely speeding, which resulted in the fatal car crash that took place in the northwest region of Spain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/joao-pedro-brace-chelsea-reach-club-world-cup-final-2752897-2025-07-09",
      "headline": "Joao Pedro heroics guide Chelsea past Fluminense into finalJoão Pedro delivered a dream performance against his former club, scoring twice to lead Chelsea to a 2-0 victory over Fluminense in the FIFA Club World Cup semi-final at MetLife Stadium on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-3rd-odi-kusal-mendis-charith-asalanka-asitha-fernando-2752865-2025-07-09",
      "headline": "Kusal Mendis' century deflates Bangladesh as Sri Lanka seal series with 99-run winSri Lanka completed a dominating 99-run win over Bangladesh in the third ODI and completed a 2-1 series win. Kusal Mendis was adjudged Player of the Match for his scintillating innings of 124 (114)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-carlos-alacaraz-beats-cameron-norrie-taylor-fritz-beats-kachanov-2752848-2025-07-08",
      "headline": "Alcaraz dominates Norrie, Fritz knocks out Khachanov to advance to semisCarlos Alcaraz and Taylor Fritz sealed their berths in the semi-final of Wimbledon 2025 following their victories over Cameron Norrie and Karen Khachanov, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-reward-flop-show-international-players-payrise-domestic-contract-reduced-2752826-2025-07-08",
      "headline": "PCB reward flop show? Internationals get more pay, domestic contracts reducedThe Pakistan cricket board have made a rather bizarre move where they decided to increase the pay of their international stars and not give better rewards for their domestic players. This comes after Pakistan's disastrous performances in ICC tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-3rd-test-lords-jasprit-bumrah-breathes-fire-in-net-session-2752821-2025-07-08",
      "headline": "Jasprit Bumrah breathes fire in net session ahead of Lord's Test returnIndia fast bowler Jasprit Bumrah was seen breathing fire in the nets session ahead of his return in the third Test against England at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-vs-laura-siegemund-reaction-2752805-2025-07-08",
      "headline": "Book my tickets: When Aryna Sabalenka nearly gave up against valiant Laura SiegemundAryna Sabalenka staged a thrilling comeback to defeat 37-year-old Laura Siegemund in a Wimbledon quarter-final. The intense match tested Sabalenka's resilience as she made her way into the semi-final of the grass-court Grand Slam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-picks-novak-djokovic-to-emulate-his-audacious-cricketing-shots-2752800-2025-07-08",
      "headline": "Rishabh Pant picks Novak Djokovic to emulate his audacious cricketing shotsIndia wicketkeeper batter Rishabh Pant picked Tennis legend Novak Djokovic as the best man to emulate his audacious cricketing shots. Pant was recently spotted watching Wimbledon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-2nd-test-corbin-bosch-wiaan-mulder-south-africa-beat-zimbabwe-2752780-2025-07-08",
      "headline": "Bosch, Muthuswamy annihilate Zimbabwe as South Africa complete 2-0 whitewashSouth Africa completed a commanding 2-0 whitewash over Zimbabwe, beating them by a massive margin of an innings and 236 runs in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-withdraws-the-hundred-2025-workload-management-no-indians-2752768-2025-07-08",
      "headline": "Deepti Sharma opts out of The Hundred 2025, no Indians in frayStar Indian all-rounder Deepti Sharma has withdrawn from The Hundred in 2025, citing workload management. This means that there won't be any Indian players in the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-vs-laura-siegemund-reaction-2752805-2025-07-08",
      "headline": "Book my tickets: When Aryna Sabalenka nearly gave up against valiant Laura SiegemundAryna Sabalenka staged a thrilling comeback to defeat 37-year-old Laura Siegemund in a Wimbledon quarter-final. The intense match tested Sabalenka's resilience as she made her way into the semi-final of the grass-court Grand Slam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-picks-novak-djokovic-to-emulate-his-audacious-cricketing-shots-2752800-2025-07-08",
      "headline": "Rishabh Pant picks Novak Djokovic to emulate his audacious cricketing shotsIndia wicketkeeper batter Rishabh Pant picked Tennis legend Novak Djokovic as the best man to emulate his audacious cricketing shots. Pant was recently spotted watching Wimbledon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-2nd-test-corbin-bosch-wiaan-mulder-south-africa-beat-zimbabwe-2752780-2025-07-08",
      "headline": "Bosch, Muthuswamy annihilate Zimbabwe as South Africa complete 2-0 whitewashSouth Africa completed a commanding 2-0 whitewash over Zimbabwe, beating them by a massive margin of an innings and 236 runs in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-withdraws-the-hundred-2025-workload-management-no-indians-2752768-2025-07-08",
      "headline": "Deepti Sharma opts out of The Hundred 2025, no Indians in frayStar Indian all-rounder Deepti Sharma has withdrawn from The Hundred in 2025, citing workload management. This means that there won't be any Indian players in the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-form-sitanshu-kotak-lords-2752763-2025-07-08",
      "headline": "Not just captaincy: Batting coach explains Shubman Gill's magical England formEngland vs India: Batting coach Sitanshu Kotak attributed Shubman Gill's exceptional form to a change in mindset and technical adjustments. The Indian captain has scored 585 runs in the first two Tests of the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sitanshu-kotak-on-lords-pitch-and-jofra-archer-threat-2752752-2025-07-08",
      "headline": "Indian batting coach unfazed by green Lord's pitch, admits Jofra Archer's threatIndian batting coach Sitanshu Kotak has revealed that India are unfazed by the green Lord's surface, England have prepared for the third Test but acknowledged Jofra Archer's threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-zimbabwe-pacer-fined-demerit-point-dangerous-throw-lhuan-dre-pretorious-2752711-2025-07-08",
      "headline": "Zimbabwe pacer fined, handed demerit point for dangerous play in 2nd TestZimbabwe pacer Kundai Matigimu was fined 15 per cent of his match fee and handed a demerit point after his dangerous throw at Lhuan dre Pretorious on Day 1 of the 2nd Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-geoffrey-boycott-on-chris-woakes-and-zak-crawley-2752698-2025-07-08",
      "headline": "Chris Woakes past his sell-date, Zak Crawley not doing enough: Geoffrey BoycottLegendary England batter Geoffrey Boycott tore into Chris Woakes and Zak Crawley following England's massive 336-run loss against India in the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-9-live-score-updates-carlos-alcaraz-aryna-sabalenka-taylor-fritz-2752674-2025-07-08",
      "headline": "Day 9 Highlights: Alcaraz beats Norrie, Sabalenka and Fritz into semisWimbledon 2025 Day 9 Highlights: Carlos Alcaraz has dominated his way through to take the first set. Aryna Sabalenka and Taylor Fritz have punched their tickets to the semifinal in their respective divisions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wimbledon-pressure-playing-at-lords-2752675-2025-07-08",
      "headline": "Virat Kohli compares playing at Wimbledon and Lord's: Centre court more intimidatingVirat Kohli finds playing at Wimbledon's Centre Court more intimidating than cricket stadiums. He praises tennis players' mental strength and says only India vs Pakistan games match such pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-drops-moral-harassment-case-psg-reconcilation-2752648-2025-07-08",
      "headline": "Mbappe drops moral harassment case against PSG and seeks reconciliationKylian Mbappe has dropped the moral harassment case against Paris Saint-Germain, and the Frenchman seeks reconciliation with his former club. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/virat-kohli-backs-novak-djokovic-eighth-wimbledon-25th-grand-slam-2752600-2025-07-08",
      "headline": "Virat Kohli makes Wimbledon 2025 prediction: I want Novak Djokovic to winVirat Kohli, speaking from the Center Court at Wimbledon, backed Novak Djokovic to play Carlos Alcaraz in the men's singles final and beat the Spaniard for his 25th Grand Slam title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-babar-azam-mohammad-rizwan-shaheen-afridi-dropped-2752572-2025-07-08",
      "headline": "No Babar, Rizwan, Shaheen as Pakistan announce squad for Bangladesh T20I seriesThere was no place for Babar Azam, Mohammad Rizwan and Shaheen Shah Afridi as Pakistan announced the squad for the upcoming T20I series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-reaction-roger-federer-attends-wimbledon-win-2752553-2025-07-08",
      "headline": "Watch: Andreeva starstruck as Roger Federer attends her Wimbledon winWimbledon 2025: Russian tennis star Mirra Andreeva fulfilled a lifelong dream when 20-time Grand Slam champion Roger Federer watched her match from the iconic Royal Box at SW19 on Monday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}