{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-bull-run-continues-dalal-street-ola-electric-hcltech-tcs-2698569-2025-03-25",
      "headline": "Sensex, Nifty open in green as FIIs return on Dalal Street; IT stocks gainStock market opening on March 25: The S&P BSE Sensex gained over 350 points higher to open over 78,000, while the NSE Nifty50 gained nearly 100 points to trade above 23,750. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-upward-rally-to-continue-sensex-nifty-key-levels-strategies-sectors-to-watch-risks-2698562-2025-03-25",
      "headline": "Sensex, Nifty set to extend rally: Key sectors to watch, strategies and risksStock market today: For those looking to invest, selective stock picking is key. With Nifty50 trading below its long-term valuation averages, investors may find value in largecap and midcap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-in-focus-insolvency-plea-dues-clear-rosmerta-group-nclt-2698555-2025-03-25",
      "headline": "Ola Electric shares to be in focus today. Here's whyIn an early morning exchange filing, Ola Electric Technologies announced that it has \"amicably settled all outstanding dues\" with Rosmerta Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-25-wipro-hcltech-rvnl-britannia-swiggy-and-more-2698553-2025-03-25",
      "headline": "Stocks to watch today: Ola Electric, Wipro, HCLTech, RVNL, Britannia and moreStocks to watch on March 25: With the stock market set to continue its positive run, here are the top stocks to watch out for during today's trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-what-to-expect-from-sensex-nifty-on-march-25-dalal-street-bse-nse-prediction-2698547-2025-03-25",
      "headline": "Market opening predictions on March 25: What to expect from Sensex, Nifty todayForeign portfolio investors bought shares worth Rs 3,056 corer on Monday, marking their third consecutive day of buying. This trend has helped boost market confidence after a period of significant selling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/han-jong-hee-dies-co-ceo-samsung-electronics-cardiac-arrest-tech-2698540-2025-03-25",
      "headline": "Samsung Electronics co-CEO Han Jong-hee dies of cardiac arrest at 63Samsung Electronics' co-CEO Han Jong-hee passed away at 63 due to cardiac arrest; he led the consumer electronics division and recently faced shareholder scrutiny over AI market struggles.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-gains-ground-after-shaking-off-four-week-losing-streak-glbs-2698435-2025-03-24",
      "headline": "Wall Street gains ground after shaking off four-week losing streakThe New York Stock Exchange showed positive signs on Monday after weeks of decline ahead of a potentially softening stance on tariffs by the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-jump-as-investors-eye-possible-tariff-leeway-lower-price-2698414-2025-03-24",
      "headline": "Tesla shares jump 10% as investors eye possible tariff leeway, lower priceTesla shares surged 10% on Monday amid reports of tariff exclusions under the Trump administration. Investors saw an opportunity after a steep decline this year. The rally lifted Wall Street, with tech stocks pushing indexes to two-week highs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-united-states-exclude-sector-specific-reciprocal-tariffs-scale-back-april-2-2698189-2025-03-24",
      "headline": "US planning to scale back April 2 reciprocal tariffs for specific sectors: ReportsUS President Donald Trump's administration may exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japanese-stock-market-zensho-holdings-co-share-fall-unexpected-rodent-incident-report-2698187-2025-03-24",
      "headline": "A rat did it: Japanese stock tanks after unexpected rodent incidentThe stock of the Japanese firm Zensho Holdings Co fell 7.1% in one of its biggest declines since February 13 due to an incident involving a rodent. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-kisses-nick-jonas-onstage-jonas-brothers-new-jersey-hall-of-fame-jonascon-2698577-2025-03-25",
      "headline": "Priyanka kisses Nick onstage after Jonas Brothers New Jersey Hall of Fame debutPriyanka Chopra joined husband-singer Nick Jonas as the Jonas Brothers were honoured as the youngest inductees into the New Jersey Hall of Fame. Several videos and pictures from the event have gone viral. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-pedro-pascal-dinner-date-relationship-2698578-2025-03-25",
      "headline": "Jennifer Aniston, Pedro Pascal's three-hour dinner date sparks relationship rumoursJennifer Aniston and Pedro Pascal were seen on a dinner date in West Hollywood. Their three-hour date has now fuelled speculations about a possible relationship or a collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-tws-announces-3rd-mini-album-try-with-us-to-release-in-april-2698563-2025-03-25",
      "headline": "K-pop group TWS announces 3rd mini album 'Try with us', to release in AprilTWS, the K-pop rising stars, are making a comeback with their third mini album, TRY WITH US. The album will be released on April 21. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-kakkar-cries-after-arriving-3-hours-late-to-melbourne-show-fans-yell-this-is-not-india-2698556-2025-03-25",
      "headline": "Singer Neha Kakkar cries after late arrival to show. Fan yells 'very good acting'Playback singer Neha Kakkar broke down on stage after arriving three hours late to her Melbourne show. She apologised to the fans. However, some frustrated fans called it 'acting' and 'drama'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-recalls-past-ordeal-defends-kunal-kamra-my-face-was-blackened-eknath-shinde-2698550-2025-03-25",
      "headline": "Hansal Mehta recalls own ordeal as he defends Kunal Kamra: My face was blackenedDirector Hansal Mehta extended his support to comedian Kunal Kamra. In a strong note on social media, Mehta recalled his past ordeal where he was assaulted and forced to apologise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/legends-of-shiva-with-amish-review-of-him-becoming-everything-abyss-to-absolute-2698499-2025-03-25",
      "headline": "Legends of Shiva with Amish review: Of Him becoming everything, abyss to absoluteReleased-Mon Mar 17, 2025'Legends of Shiva with Amish' is a docu-series on Discovery Plus that aims to disclose the connection between Lord Shiva, the celebrated Hindu deity, and the universe. It shows Him as the ultimate destroyer of the world, and also as someone who will always remain at the centre of humankind. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shihan-hussaini-dies-blood-cancer-battle-actor-karate-expert-archery-2698530-2025-03-25",
      "headline": "Actor, karate expert Shihan Hussaini dies in Chennai after battling blood cancerActor and Karate expert Shihan Hussaini died at a private hospital in Chennai on March 25. He was undergoing treatment for advanced blood cancer for the past few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-songwriter-lizzo-to-portray-sister-rosetta-tharpe-in-upcoming-mgm-biopic-rosetta-2698496-2025-03-25",
      "headline": "Singer Lizzo to portray Sister Rosetta Tharpe in upcoming biopicAmazon MGM Studios casts Lizzo as Sister Rosetta Tharpe in a biopic highlighting the musician's legacy. The film aims to showcase Tharpe's influence on rock music, often overlooked in history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-in-parliament-prime-minister-narendra-modi-attend-special-screening-of-vicky-kaushal-film-2698480-2025-03-24",
      "headline": "Chhaava in Parliament: PM Modi to attend special screening of Vicky Kaushal's filmChhaava, featuring Vicky Kaushal and based on the life of Chhatrapati Sambhaji Maharaj, will be screened in Parliament. Prime Minister Narendra Modi, Home Minister Amit Shah, and other key leaders are expected to attend this special event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-full-episode-schedule-streaming-details-glbs-2698475-2025-03-24",
      "headline": "'The White Lotus' Season 3: Full episode schedule & streaming detailsThe White Lotus Season 3 is wrapping up with two episodes left. Airing Sundays on HBO and Max, the Thailand-set drama reaches its finale on April 6.  \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/grimes-opens-up-about-adhd-autism-and-privacy-concerns-over-musks-kids-glbs-2698454-2025-03-24",
      "headline": "Grimes opens up about ADHD, autism, and privacy concerns over Musk's kidsGrimes revealed her ADHD and autism diagnosis, criticised online mental health discourse, and expressed concerns over her children's privacy, urging legal protections against public exposure. She also emphasised reading's impact on ADHD.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-on-planning-their-wedding-jay-shetty-podcast-2698437-2025-03-24",
      "headline": "Selena Gomez-Benny Blanco on planning their wedding: There's just so much going onSelena Gomez and Benny Blanco opened up about their wedding plans on Jay Shetty's podcast. The couple is taking a relaxed approach due to their hectic schedules."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-aasif-sheikh-collapsed-during-bhabiji-ghar-par-hain-shoot-heres-the-truth-exclusive-2698416-2025-03-24",
      "headline": "Actor Aasif Sheikh collapsed during Bhabiji shoot? Here's the truthActor Aasif Sheikh's health sparked concerns after rumours of hospitalisation emerged. However, sources clarify that the reports are exaggerated, and the actor is in good health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-ghar-par-hai-writer-manoj-santoshi-dies-at-49-due-to-liver-ailment-2698395-2025-03-24",
      "headline": "Bhabiji Ghar Par Hai writer Manoj Santoshi dies at 49 due to liver ailmentRenowned TV writer Manoj Santoshi, known for his work on popular sitcoms, died at 49 due to liver complications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dragon-director-ashwath-marimuthu-meets-thalapathy-vijay-calls-it-dream-come-true-2698370-2025-03-24",
      "headline": "Dragon director Ashwath Marimuthu meets Thalapathy Vijay, calls it a dream come trueDirector Ashwath Marimuthu met his idol, Tamil superstar Thalapathy Vijay, and shared the emotional significance of the encounter with fans. The meeting was a dream come true for Marimuthu, who was deeply moved by Vijay's praise for his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-dances-his-heart-out-to-devara-song-ahead-of-its-japan-release-2698351-2025-03-24",
      "headline": "Jr NTR dances his heart out to Devara song ahead of its Japan release. WatchTelugu star Jr NTR has been busy promoting his last release, Devara, in Japan. The movie, also starring Janhvi Kapoor and Saif Ali Khan, will soon release in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonas-brothers-announce-jonas20-living-the-dream-tour-see-full-dates-glbs-2698365-2025-03-24",
      "headline": "Jonas Brothers announce JONAS20: Living the Dream tour – See full datesThe Jonas Brothers announced their JONAS20: Living the Dream Tour, celebrating 20 years of music. The 43-date North American tour kicks off August 10, featuring Marshmello, The All-American Rejects, and Boys Like Girls.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-emme-shine-at-othello-broadway-premiere-in-matching-black-outfits-glbs-2698353-2025-03-24",
      "headline": "Jennifer Lopez & Emme shine at Othello Broadway premiere in matching black outfitsJennifer Lopez and Emme attended Broadway's Othello premiere in stylish black outfits. The event featured star guests, including Joe Biden. Lopez reflected on motherhood while celebrating Emme's 17th birthday.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-slams-pakistan-at-united-nations-for-repeated-reference-to-jammu-and-kashmir-2698542-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India slams Pakistan's repeated references at UN: Must vacate J&K territoryIndia firmly rejected Pakistan's claims at the United Nations, calling them \"unwarranted and illegal\", reiterating sovereignty over Jammu and Kashmir, and asking Islamabad to vacate occupied territories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-election-india-interference-meddle-china-mark-carney-intelligence-report-2698514-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China likely to, India has intent to interfere in elections: Canada spy agencyCanada is set to hold its general election on April 28 after newly appointed Prime Minister Mark Carney called for a snap poll. Ottawa has alleged that New Delhi may attempt to interfere in the elections, as relations between the two nations have hit an all-time low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/is-donald-trump-forcing-an-exodus-of-researchers-biggest-since-world-war-ii-trump-green-card-us-visa-2698186-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is Trump forcing an exodus of researchers, the biggest since World War II?The US might witness an exodus of researchers, if media reports and chatter on social media are anything to go by. The flight of scientists might be the biggest since scientists fled Nazi Germany. With President Donald Trump slashing research funding and increasing work visa scrutiny, European countries are planning to seize on the brain drain from the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-controversy-joke-row-eknath-shinde-mumbai-police-khar-issue-notice-summoned-2698573-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra summoned by Mumbai police in Eknath Shinde joke rowKunal Kamra, who referred to Eknath Shinde as a 'traitor' in a Bollywood parody song, has been asked to appear before the investigating officer at 11 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/mens-jewellery-elaborate-necklaces-shah-rukh-khan-2698548-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Men's jewellery is going beyond bracelets, brooches. Enter elaborate necklacesSuperstar Shah Rukh Khan is at the forefront of the trend. The actor has lately been flaunting a stunning collection of neckpieces, like a tennis necklace, a layered emerald haar, and polki jewels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-yemen-war-plan-journalist-the-atlantic-white-house-defence-secretary-leak-2698517-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I know nothing: Trump on US officials mistakenly sharing war plan with journalistThe Trump administration accidentally sent its war plans to a group chat that included a journalist, an incident that Democrats labelled a major national security concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-video-mamata-banerjee-london-diaries-jogging-in-saree-slippers-2698572-2025-03-25#?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Watch: Mamata Banerjee's London diaries ft jogging in saree, slippersThe West Bengal Chief Minister was seen jogging in a saree and slippers at London's Hyde Park early on Monday. The Chief Minister shared a video of the same on her official X account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-bull-run-continues-dalal-street-ola-electric-hcltech-tcs-2698569-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty open in green as FIIs return on Dalal Street; IT stocks gainStock market opening on March 25: The S&P BSE Sensex gained over 350 points higher to open over 78,000, while the NSE Nifty50 gained nearly 100 points to trade above 23,750. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-recalls-past-ordeal-defends-kunal-kamra-my-face-was-blackened-eknath-shinde-2698550-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hansal Mehta recalls own ordeal as he defends Kunal Kamra: My face was blackenedDirector Hansal Mehta extended his support to comedian Kunal Kamra. In a strong note on social media, Mehta recalled his past ordeal where he was assaulted and forced to apologise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariff-threat-venezuela-crude-oil-imports-india-impact-reciprocal-levies-2698464-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's fresh 25% tariff threat linked to Venezuelan oil. Trouble for India?US President Donald Trump's \"secondary tariff\" on countries buying Venezuelan oil will come into effect on April 2, the same day when reciprocal tariffs on US's trading partners, including India, will be imposed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/oscar-winning-palestinian-director-hamdan-ballal-attacked-by-jewish-settlers-detained-palestine-activists-2698512-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oscar-winning Palestinian director attacked by Jewish settlers, detained: ActivistsHamdan Ballal, co-director of the Oscar-winning documentary No Other Land, was assaulted by Israeli settlers in the occupied West Bank and later detained by the Israeli military while receiving medical treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kunal-kamra-to-abusive-eknath-shinde-supporter-in-viral-call-tamil-nadu-shinde-sena-mumbai-studio-2698361-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I'm in Tamil Nadu: Kunal Kamra to Shinde Sena supporter in viral phone callComedian Kunal Kamra was threatened in a purported call over his jokes mocking Deputy Chief Minister Eknath Shinde. India Today cannot verify the authenticity of the viral clip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-school-student-religious-remark-science-exhibition-probe-2698383-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Short clothes lead to…' Karnataka student's project at science fair sparks probeA video of a Karnataka school student making a controversial religious remark during a science exhibition has gone viral, sparking massive outrage. It has raised concerns over education and prompted a government investigation into the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-who-is-vipraj-nigam-uttar-pradesh-all-rounder-2698503-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Vipraj Nigam? Uttar Pradesh all-rounder new star for Delhi CapitalsDelhi Capitals' young all-rounder Vipraj Nigam made a stunning IPL debut, playing a crucial role in their thrilling 1-run win over Lucknow Super Giants, showcasing his batting and bowling prowess in a high-pressure match."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/notification/story/bihar-board-class-12-results-to-be-out-today-at-115-pm-here-is-how-to-check-2698546-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar board class 12 results today at 1:15 pm. Here is how to checkThe Bihar School Examination Board (BSEB) is all set to announce the class 12 exam result today, March 25, at 1:15 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/legends-of-shiva-with-amish-review-of-him-becoming-everything-abyss-to-absolute-2698499-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Legends of Shiva with Amish review: Of Him becoming everything, abyss to absoluteReleased-Mon Mar 17, 2025'Legends of Shiva with Amish' is a docu-series on Discovery Plus that aims to disclose the connection between Lord Shiva, the celebrated Hindu deity, and the universe. It shows Him as the ultimate destroyer of the world, and also as someone who will always remain at the centre of humankind. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-omar-abdullah-govt-faces-prohibition-pressure-2698240-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Omar Abdullah govt faces prohibition pressureDelhi-based designers' fashion show in the snow stirs a heated debate over alcohol in Kashmir\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/han-jong-hee-dies-co-ceo-samsung-electronics-cardiac-arrest-tech-2698540-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Samsung Electronics co-CEO Han Jong-hee dies of cardiac arrest at 63Samsung Electronics' co-CEO Han Jong-hee passed away at 63 due to cardiac arrest; he led the consumer electronics division and recently faced shareholder scrutiny over AI market struggles.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-habitat-kunal-kamra-khar-mumbai-studio-ransacking-eknath-shinde-row-2698459-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not against law to poke fun at leaders: Kunal Kamra amid Eknath Shinde joke rowComedian Kunal Kamra, responding to the controversy over his remarks on Eknath Shinde, asserted that no political party controls his comedy and what he has to say. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shihan-hussaini-dies-blood-cancer-battle-actor-karate-expert-archery-2698530-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor, karate expert Shihan Hussaini dies in Chennai after battling blood cancerActor and Karate expert Shihan Hussaini died at a private hospital in Chennai on March 25. He was undergoing treatment for advanced blood cancer for the past few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-accuses-columbia-student-mahmoud-khalil-of-hiding-unrwa-ties-on-visa-application-glbs-2698488-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US accuses Palestinian student of hiding UN aid agency work on visa applicationThe US government alleges that Mahmoud Khalil covered up his work for UNRWA, a United Nations body that provided food and healthcare to Palestinian refugees."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/happened-in-flow-of-show-i-realise-i-was-wrong-samay-raina-to-cops-on-latent-row-2698455-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Happened in flow of show, I realise I was wrong: Samay Raina to cops on Latent rowComedian Samay Raina appeared before Maharashtra Cyber Police over the India's Got Latent case, expressing regret for his remarks. He admitted his mistake, promised caution, and said the controversy affected his mental state.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/head-of-engineering-at-elon-musks-x-has-reportedly-quit-2698574-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Head of engineering at Elon Musk's X has reportedly quitX's head of engineering has apparently left the company. And according to a report, the move is after Elon Musk shifted his focus to DOGE and xAI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-kisses-nick-jonas-onstage-jonas-brothers-new-jersey-hall-of-fame-jonascon-2698577-2025-03-25",
      "headline": "Priyanka kisses Nick onstage after Jonas Brothers New Jersey Hall of Fame debutPriyanka Chopra joined husband-singer Nick Jonas as the Jonas Brothers were honoured as the youngest inductees into the New Jersey Hall of Fame. Several videos and pictures from the event have gone viral. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-pedro-pascal-dinner-date-relationship-2698578-2025-03-25",
      "headline": "Jennifer Aniston, Pedro Pascal's three-hour dinner date sparks relationship rumoursJennifer Aniston and Pedro Pascal were seen on a dinner date in West Hollywood. Their three-hour date has now fuelled speculations about a possible relationship or a collaboration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-kakkar-cries-after-arriving-3-hours-late-to-melbourne-show-fans-yell-this-is-not-india-2698556-2025-03-25",
      "headline": "Singer Neha Kakkar cries after late arrival to show. Fan yells 'very good acting'Playback singer Neha Kakkar broke down on stage after arriving three hours late to her Melbourne show. She apologised to the fans. However, some frustrated fans called it 'acting' and 'drama'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-recalls-past-ordeal-defends-kunal-kamra-my-face-was-blackened-eknath-shinde-2698550-2025-03-25",
      "headline": "Hansal Mehta recalls own ordeal as he defends Kunal Kamra: My face was blackenedDirector Hansal Mehta extended his support to comedian Kunal Kamra. In a strong note on social media, Mehta recalled his past ordeal where he was assaulted and forced to apologise. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-rishabh-pant-captaincy-bowling-weakness-2698570-2025-03-25",
      "headline": "First impression: LSG's bowling frailties, captain Pant's blunders raise red flagsIPL 2025, DC vs LSG: Lucknow's depleted bowling unit captain Rishabh Pant's tactical errors cost them a winnable game in Vizag on Monday. If unaddressed, these flaws could make for a long and difficult IPL 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-lsg-lance-klusener-press-conference-injury-crisis-vizag-2698557-2025-03-25",
      "headline": "LSG coach Lance Klusener on injury crisis: Have to mix and match till players returnLucknow Super Giants assistant coach Lance Klusener has said that the team will have to continue to 'mix and match' till the injury crisis subsides after their loss to Delhi Capitals on Monday, March 24. LSG are currently without their frontline pacers and have lost Mohsin Khan for the entire season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-lsg-ashutosh-sharma-press-conference-video-vizag-2698549-2025-03-25",
      "headline": "How Ashutosh Sharma became DC's new hero: Follow the process, believe in my abilityAshutosh Sharma said that he just wanted to follow the basics and back his ability after becoming Delhi Capitals' new hero during their thrilling win against Lucknow Super Giants on Monday, March 24. Ashutosh scored 66 off 31 balls to secure the win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-weather-forecast-pitch-report-ahmedabad-2698292-2025-03-25",
      "headline": "GT vs PBKS, pitch, weather report IPL 2025: Rain expected in Ahmedabad?Gujarat(GT) vs Punjab (PBKS) Match Pitch Report, Weather forecast: Ahmedabad is ready for a thrilling IPL 2025 opener as Gujarat Titans face a refreshed Punjab Kings, with both teams eager to make a statement in front of a packed Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-punjab-kings-opening-combination-brad-haddin-2698543-2025-03-25",
      "headline": "Punjab Kings secretive about opening combination ahead of opener vs GTIPL 2025: Punjab Kings remained secretive about their team combination ahead of their first match of the season against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-lance-klusener-press-conference-rishabh-pant-2698534-2025-03-25",
      "headline": "LSG coach Klusener disagrees with Rishabh Pant's take on DC loss: Didn't score enoughLucknow Super Giants assistant coach Lance Klusener didn't agree with Rishabh Pant's take on the loss to Delhi Capitals and felt they didn't score enough runs in Vizag on Monday, March 24. LSG's 209 wasn't enough on the day as DC won the match by 1 wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-ashutosh-sharma-press-conference-vizag-2698527-2025-03-25",
      "headline": "Will finish with a six: How Ashutosh Sharma held his nerves in DC vs LSG thrillerDelhi Capitals' new hero Ashutosh Sharma claimed that he knew he would finish the game against Lucknow Super Giants with a six on Monday, March 24. Ashutosh starred for DC as they beat LSG by 1 wicket in a final over thriller in Vizag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-call-mentor-shikhar-dhawan-delhi-vs-lucknow-thriller-2698525-2025-03-25",
      "headline": "Watch: Ashutosh gets call from 'mentor' Shikhar Dhawan after special gestureIPL 2025, DC vs LSG: Ashutosh Sharma dedicated his Player of the Match award to mentor Shikhar Dhawan on Monday. The 26-year-old was seen speaking to the former India opener after the heroic 31-ball 66 not out in Vizag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-who-is-vipraj-nigam-uttar-pradesh-all-rounder-2698503-2025-03-25",
      "headline": "Who is Vipraj Nigam? Uttar Pradesh all-rounder new star for Delhi CapitalsDelhi Capitals' young all-rounder Vipraj Nigam made a stunning IPL debut, playing a crucial role in their thrilling 1-run win over Lucknow Super Giants, showcasing his batting and bowling prowess in a high-pressure match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-pbks-shubman-gill-press-conference-2698498-2025-03-25",
      "headline": "Mohammed Siraj needs to be himself, don't need him to replace Shami: GillGujarat Titans Shubman Gill said that Mohammed Siraj is not here to replace Mohammed Shami in the line-up. The GT captain argued that Siraj needs to be true to his identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-vipraj-nigam-dc-vs-lsg-2698494-2025-03-24",
      "headline": "Watch: Pietesen jumps out in joy as Ashutosh hits winning six in Vizag thrillerDelhi Capitals coaches Hemang Badani and Kevin Pietersen jumped out of their chairs as Ashutosh Sharma pulled off an epic chase against Lucknow on Monday, March 24. Senior batter Faf du Plessis also had high praise reserved for the players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-ashutosh-sharma-press-conference-vizag-2698527-2025-03-25",
      "headline": "Will finish with a six: How Ashutosh Sharma held his nerves in DC vs LSG thrillerDelhi Capitals' new hero Ashutosh Sharma claimed that he knew he would finish the game against Lucknow Super Giants with a six on Monday, March 24. Ashutosh starred for DC as they beat LSG by 1 wicket in a final over thriller in Vizag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-call-mentor-shikhar-dhawan-delhi-vs-lucknow-thriller-2698525-2025-03-25",
      "headline": "Watch: Ashutosh gets call from 'mentor' Shikhar Dhawan after special gestureIPL 2025, DC vs LSG: Ashutosh Sharma dedicated his Player of the Match award to mentor Shikhar Dhawan on Monday. The 26-year-old was seen speaking to the former India opener after the heroic 31-ball 66 not out in Vizag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-who-is-vipraj-nigam-uttar-pradesh-all-rounder-2698503-2025-03-25",
      "headline": "Who is Vipraj Nigam? Uttar Pradesh all-rounder new star for Delhi CapitalsDelhi Capitals' young all-rounder Vipraj Nigam made a stunning IPL debut, playing a crucial role in their thrilling 1-run win over Lucknow Super Giants, showcasing his batting and bowling prowess in a high-pressure match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-pbks-shubman-gill-press-conference-2698498-2025-03-25",
      "headline": "Mohammed Siraj needs to be himself, don't need him to replace Shami: GillGujarat Titans Shubman Gill said that Mohammed Siraj is not here to replace Mohammed Shami in the line-up. The GT captain argued that Siraj needs to be true to his identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-vipraj-nigam-dc-vs-lsg-2698494-2025-03-24",
      "headline": "Watch: Pietesen jumps out in joy as Ashutosh hits winning six in Vizag thrillerDelhi Capitals coaches Hemang Badani and Kevin Pietersen jumped out of their chairs as Ashutosh Sharma pulled off an epic chase against Lucknow on Monday, March 24. Senior batter Faf du Plessis also had high praise reserved for the players."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}