{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-imposes-25-percent-trump-tariff-on-india-what-it-means-for-exports-and-key-sectors-2763759-2025-07-30",
      "headline": "US imposes 25% tariff on India: What it means for exports and key sectorsThe newly announced duties target several of India's top-performing export sectors. Automobiles, auto components, steel, aluminum, smartphones, solar modules, marine products, gems, jewellery, and select processed food and agricultural items are all on the 25% list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-the-subscription-lifestyle-is-fuelling-a-new-wave-of-debt-emi-bpnl-schemes-2763577-2025-07-30",
      "headline": "How the subscription lifestyle is fuelling a new wave of debtFrom entertainment and food to wellness and shopping, subscription models are everywhere. While they promise convenience, they're also leading many into silent debt traps, especially the younger, digital-savvy crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-highe-lt-shares-rise-4-percent-india-us-trade-deal-2763608-2025-07-30",
      "headline": "Sensex closes 144 points higher, Nifty above 24,800; L&T up 4%The S&P BSE Sensex gained 143.91 points to close at 81,481.86, while the NSE Nifty50 added 33.95 points to end at 24,855.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/mb-engineering-ipo-subscription-gmp-details-review-apply-or-not-listing-gains-2763566-2025-07-30",
      "headline": "M&B Engineering IPO: Should you subscribe? Check GMP, subscription on Day 1The IPO consists of a fresh equity issue worth Rs 275 crore and an offer-for-sale (OFS) worth Rs 375 crore by the company's promoters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-government-staff-opt-for-unified-pension-scheme-low-adoption-explained-2763603-2025-07-30",
      "headline": "Only 1.35% central government staff opt for Unified Pension Scheme. Here's whyAs of July 20, 2025, only 30,989 employees have chosen UPS out of approximately 23 lakh (2.3 million) employees enrolled in NPS, marking a participation rate of just 1.35%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sumit-kumar-health-insurance-rejection-star-health-manipal-hospital-2762528-2025-07-30",
      "headline": "How Pune man's insurance claim was denied thrice, then cleared after viral postWhile his wife was hospitalised, Sumit Kumar, a Pune-based business consultant, was battling paperwork, policy fine print, and silence from his insurer. This is his story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-review-price-band-good-bad-listing-latest-gmp-listing-gains-day-1-subscription-2763504-2025-07-30",
      "headline": "NSDL IPO fully booked: Should you subscribe or skip Rs 4,000 crore listing?National Securities Depository Ltd (NSDL) aims to raise Rs 4,011.60 crore through a complete offer for sale (OFS) of 5.01 crore equity shares by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-day-1-check-latest-subscription-status-gmp-and-more-2763484-2025-07-30",
      "headline": "NSDL IPO Day 1: Check latest subscription status, GMP and moreIn the grey market, NSDL's shares are commanding a premium of Rs 126, implying an estimated listing price of Rs 926—around 15.75 percent higher than the issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-ceos-salary-in-focus-amid-mass-layoff-plan-here-is-how-much-he-earns-2763478-2025-07-30",
      "headline": "TCS CEO's salary in focus amid mass layoff plan. Here's how much he earnsTCS recently confirmed it will let go of about 2% of its workforce in FY26, which translates to roughly 12,000 employees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-hiring-new-20000-jobs-freshers-it-sector-vacancy-ceo-salil-parekh-report-ai-tcs-layoff-2763457-2025-07-30",
      "headline": "Infosys to hire 20,000 freshers in 2025, focus on AI: ReportInfosys CEO said that the IT firm has made early investments in AI and training its staff. So far, the company has trained about 2.75 lakh employees at different levels in AI and related areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-3-online-filing-begins-are-you-eligible-and-what-is-new-2763419-2025-07-30",
      "headline": "ITR-3 online filing begins: Are you eligible and what's new?The Income Tax Department has kick-started online filing for ITR-3, bringing relief to taxpayers with more complex income sources. If you're wondering whether this applies to you and what's changed this year, here's everything in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-advice-newly-married-couple-five-tips-about-money-savings-2763406-2025-07-30",
      "headline": "Talk money like you talk love: Investment advisor's advice for newlywedsAn investment advisor's advice to young couples goes beyond numbers. Abhishek Kumar emphasises that financial clarity is just as essential as emotional honesty when building a strong, lasting marriage."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-trailer-nick-judy-attend-couple-counselling-giant-snake-chase-walt-disney-animation-2763844-2025-07-30",
      "headline": "Zootopia 2 trailer: Nick, Judy attend couple counselling amid giant snake chaseZootopia 2 trailer: Rookie cops Nick and Judy seek couple counselling while solving a mysterious case of a giant snake on the leash. The upcoming animation film is scheduled for a theatrical release on November 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jamie-lee-curtis-slams-ai-filters-plastic-surgery-genocide-of-natural-beauty-2763786-2025-07-30",
      "headline": "Jamie Lee Curtis says plastic surgery has led to genocide of women, slams AI filtersActor Jamie Lee Curtis called plastic surgery a 'genocide' of natural beauty. She also warned against AI filters as they worsen unrealistic beauty standards for women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-funeral-birmingham-wife-sharon-moved-to-tears-thousands-pay-tribute-black-sabbath-legend-2763753-2025-07-30",
      "headline": "Sharon Orbourne moved to tears at Ozzy Osbourne's funeral procession in BirminghamOzzy Osbourne was laid to rest in his hometown of Birmingham today. The funeral saw thousands of fans and family paying emotional tribute to the Black Sabbath frontman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/indira-krishnan-opens-up-on-casting-couch-says-she-lost-big-projects-for-saying-no-2763768-2025-07-30",
      "headline": "Ramayana actor Indira Krishnan on casting couch: Lost big projects for saying noActor Indira Krishnan opened up about facing casting couch experiences, especially in the South film industry, revealing she lost major roles for refusing inappropriate demands. She said these incidents led her to shift focus to television, where she found more respect and better opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anasuya-bharadwaj-shuts-down-trolls-questioning-fashion-choices-with-grace-and-grit-2763748-2025-07-30",
      "headline": "Pushpa actor Anasuya Bharadwaj shuts down trolls questioning her fashion choicesAnasuya Bharadwaj addressed social media criticism about her fashion choices as a mother, promoting acceptance and respect for individuality. She shared a lengthy note on social media, discussing choices and values. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanishk-bagchi-was-taking-depresssion-medication-while-composing-saiyaara-title-track-2763743-2025-07-30",
      "headline": "Tanishk Bagchi reveals he battled depression while composing Saiyaara songMusic composer Tanishk Bagchi was depressed while creating the title track of 'Saiyaara'. In an interview, he opened up about his struggle with mental health and being on medication during its composition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/s-line-kdrama-review-bold-premise-weak-execution-2763757-2025-07-30",
      "headline": "S Line review: Bold and riveting K-drama premise that trips over its own threadsRelease Date:Fri Jul 11, 2025S Line K-drama review: The series offers a bold and provocative premise with a unique visible red line concept. However, inconsistent storytelling and pacing undermine its potential impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-shares-story-of-ahaan-panday-shelved-debut-film-before-saiyaara-2763690-2025-07-30",
      "headline": "Mohit Suri shares story of Ahaan Panday's shelved debut film before SaiyaaraDirector Mohit Suri shared that Ahaan Panday was originally set to debut in a different film, which got shelved after the pandemic, leaving him heartbroken. Despite the setback, Ahaan remained hopeful and made a successful debut with YRF's 'Saiyaara'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mrunal-thakur-gets-a-pre-birthday-surprise-on-dacoit-sets-adivi-sesh-shares-video-2763713-2025-07-30",
      "headline": "Mrunal Thakur gets a pre-birthday surprise on Dacoit sets, Adivi Sesh shares videoActor Mrunal Thakur, who turns 33 on July 31, was surprised with an early birthday celebration by the cast and crew of her upcoming film 'Dacoit'. Co-star Adivi Sesh shared a glimpse of the celebration on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-takes-her-cook-dilip-to-maldives-begins-new-travel-vlog-series-2763723-2025-07-30",
      "headline": "Farah Khan takes her cook Dilip to Maldives, begins new travel vlog seriesFarah Khan has started a fun travel vlog with her cook Dilip. She took Dilip on his first international trip to the Maldives. In her latest vlog, they were seen enjoying local food. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ektaa-kapoor-recalls-smriti-irani-was-mother-shobha-pick-tulsi-virani-kyunki-saas-bhi-kabhi-bahu-thi-reboot-2763663-2025-07-30",
      "headline": "Ektaa Kapoor recalls Smriti Irani was mother Shobha's pick for TulsiActor Smriti Irani reprised her iconic role as Tulsi Virani in the reboot of 'Kyunki Saas Bhi Kabhi Bahu Thi'. In a live chat, producer Ektaa Kapoor wanted only Smriti as the lead character since she found her similar to actor Twinkle Khanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ai-meets-sci-fi-in-shekhar-kapur-new-series-warlord-teaser-out-2763377-2025-07-30",
      "headline": "AI meets sci-fi in Shekhar Kapur's new series Warlord. Teaser outFrom Bollywood legend to digital pioneer, Shekhar Kapur isn't just making a series; he's launching a new era of storytelling with 'Warlord'. The teaser of the film has been released, and it is AI-generated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhudeva-simran-meena-90s-south-indian-cinema-stars-reunite-goa-nostalgic-celebration-2763606-2025-07-30",
      "headline": "Prabhudeva, Simran, Meena, other 90s South Indian stars reunite in Goa. Viral picsA reunion in Goa brought together leading South Indian film personalities from the '90s for a celebration of cinema and friendship. From directors like KS Ravikumar and S Shankar, to actors like Simran, Meena, Prabhudeva and others, were present. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/happy-gilmore-2-adam-sandler-netflix-record-46-million-views-original-film-revival-2763712-2025-07-30",
      "headline": "Happy Gilmore 2 is Adam Sandler's biggest Netflix opener with 46.7 million viewsAdam Sandler's 'Happy Gilmore 2' has smashed records with 46.7 million views in three days, becoming the biggest opening weekend for any Netflix film in the US. The sequel has reignited nostalgia for the original, while blending humour and heart to captivate audiences worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-4-belly-jeremiah-conrad-2763647-2025-07-30",
      "headline": "The Summer I Turned Pretty just got its most twist-the-knife-in-your-heart episode'The Summer I Turned Pretty' Season 3, Episode 4: Belly and Jeremiah plan their wedding, but not without the emotional fallout from her strained relationship with her mother and Conrad's quiet heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-on-tanvi-vs-saiyaara-box-office-even-shah-rukh-khan-bounces-back-after-4-flops-2763707-2025-07-30",
      "headline": "Anupam Kher on Tanvi vs Saiyaara box office: Even SRK bounces back after 4 flopsVeteran actor Anupam Kher launched his book 'Different But No Less' on Wednesday. While talking to IndiaToday.in about the book, which is based on his film 'Tanvi: The Great', the actor shared how the box office performance doesn't matter so much because he believes in the film's wholesome journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elvish-yadav-acting-debut-web-series-bhopal-biggboss-ott2-winner-2763634-2025-07-30",
      "headline": "Elvish Yadav begins acting career with web series set in BhopalElvish Yadav has started shooting for his acting debut in a new web series in Bhopal. This move marks a significant shift from his digital comedy roots to mainstream acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-netflix-record-most-watched-animated-film-2763648-2025-07-30",
      "headline": "KPop Demon Hunters is Netflix's most-watched animated film with 26.3 million views'KPop Demon Hunters' has emerged as Netflix's most-watched original animated film, captivating audiences with its unique blend of K-pop culture and supernatural action. The film's popularity is further amplified by its chart-topping soundtrack and engaging storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-shoots-for-tu-meri-main-tera-main-tera-tu-meri-with-ananya-panday-jackie-shroff-at-taj-mahal-2763585-2025-07-30",
      "headline": "Kartik Aaryan shoots for Tu Meri Main Tera with Ananya, Jackie Shroff at Taj MahalActor Kartik Aaryan is shooting for his upcoming film 'Tu Meri Main Tera Main Tera Tu Meri' at the Taj Mahal in Agra. His co-stars Ananya Panday and Jackie Shroff were also clicked at the venue. Several videos of the actors have now surfaced on social media."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/were-negotiating-says-donald-trump-after-declaring-25-percent-tariff-plus-penalty-on-india-glbs-2763881-2025-07-31",
      "headline": "We're negotiating, says Trump after declaring 25% tariff plus penalty on IndiaThe US President announced the tariffs, stating they will come into effect on August 1. He cited India's ongoing energy partnerships with Russia, particularly at a time when the West continues to push for an end to the conflict in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-take-all-steps-necessary-to-secure-our-national-interest-governments-1st-reaction-on-trumps-25-tariff-2763787-2025-07-30",
      "headline": "Will secure national interest: India on Trump's 25% tariff announcementIndia said that while opening up its markets to foreign players, it remains sensitive to safeguarding the interests of domestic players, citing the recently concluded Free Trade Agreement signed with the UK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/maybe-theyll-sell-to-india-trump-finalise-trade-deal-with-pakistan-to-develop-massive-oil-reserves-glbs-2763875-2025-07-31",
      "headline": "Maybe they'll sell to India: Trump strikes trade deal, oil partnership with PakDonald Trump announced a new US-Pakistan oil trade deal, hinting it could pave the way for future exports to India. The move follows Trump's declaration of a 25% tariff and extra penalties on goods imported from India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-frustrated-with-india-trade-talks-sees-25-tariff-as-remedy-white-house-aide-glbs-2763865-2025-07-31",
      "headline": "Trump frustrated with India trade talks, sees 25% tariff as remedy: White House aideTrump imposed a 25 per cent tariff on India, frustrated by stalled trade talks, calling it a remedy for unfair market access and a tactic to push India toward a more favourable deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-5th-test-prediction-team-news-lords-pitch-playing-xi-2763845-2025-07-31",
      "headline": "ENG vs IND 5th Test: Can riled-up India land final punch to square series?Having secured a draw in Manchester, India have a great chance to level the series at the Oval against a depleted England side. Shubman Gill and his men have batted and bowled out of their skins time and again in the series so far, and now have a chance to punch above their weight in the finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/as-congress-mp-jairam-ramesh-mocks-pm-modi-mp-manish-tewari-says-trump-tariff-move-affirms-indias-autonomy-2763838-2025-07-30",
      "headline": "Congress's tariff tiff? Manish Tewari says Trump move affirms India's autonomyOutlining India's foreign policy from Jawaharlal Nehru's non-alignment stance during the Cold War era to Prime Minister Modi's present-day 'Atmanirbhar Bharat', Manish Tewari said that India has always forged its own path, keeping its national interests in focus ever since gaining independence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/malegaon-2008-blast-case-verdict-announcement-today-mumbai-court-2763891-2025-07-31",
      "headline": "2008 Malegaon blast case verdict today, court to decide fate of Pragya ThakurThe case pertains to the September 29, 2008 blast at Bhiku Chowk in Malegaon, a town with a sizeable Muslim population, which claimed six lives and left 101 injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jat-conundrum-jagdeep-dhankars-exit-bares-bjps-struggle-with-community-2763641-2025-07-30",
      "headline": "Jat conundrum: Jagdeep Dhankar's exit bares BJP's struggle with communityEngineering a Jat breakthrough for long, the BJP has instead built a fragile edifice of borrowed faces and paper alliances, just one defection or protest away from collapse"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-rahul-gandhi-armed-forces-operational-freedom-pakistan-war-narendra-modi-lok-sabha-debate-analysis-2763589-2025-07-30",
      "headline": "That's democracy, RahulThe issue of operational freedom to Indian forces came up during a debate on Operation Sindoor in Parliament. The Indian armed forces, unlike Pakistan's, work in a democratic country, where an elected civilian leadership is answerable to the people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-demand-for-pm-narendra-modi-address-parliament-amit-shah-says-i-can-handle-you-2763744-2025-07-30",
      "headline": "Mere se nipat lo: Amit Shah after Congress demands PM's address during his speechOpposition MPs staged a walkout from the Rajya Sabha after demanding Prime Minister Modi's presence in the House during the discussion on Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-imposes-25-percent-trump-tariff-on-india-what-it-means-for-exports-and-key-sectors-2763759-2025-07-30",
      "headline": "US imposes 25% tariff on India: What it means for exports and key sectorsThe newly announced duties target several of India's top-performing export sectors. Automobiles, auto components, steel, aluminum, smartphones, solar modules, marine products, gems, jewellery, and select processed food and agricultural items are all on the 25% list."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gurugram-woman-attacked-by-pet-husky-while-on-morning-walk-inside-society-badly-injured-2763827-2025-07-30",
      "headline": "Caught on CCTV: Leashed husky attacks Gurugram woman on walk, drags, bites herThe dog caught her hand in its jaws, dragging her to the ground. Despite her desperate attempts to free herself and the owner's repeated efforts to pull the dog back, the animal refused to let go."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-lee-fortis-the-oval-video-2763763-2025-07-30",
      "headline": "Did Gambhir cold-shoulder Oval pitch curator in second meet? Video goes viralENG vs IND, 5th Test: Another video has gone viral where Gautam Gambhir can visibly be seen ignoring Lee Fortis when the KIA Oval pitch curator came in for an interaction. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-thar-driver-who-hit-elderly-man-riding-scooter-twice-arrested-2763880-2025-07-31",
      "headline": "Jammu Thar driver, who hit elderly man riding scooter twice, arrested The incident that took place on July 27 caused critical injuries to the elderly man who was riding the scooter after he was hit twice by a Thar SUV."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/heavy-rain-hits-delhi-ncr-indian-meteorological-department-thunderstorm-prediction-showers-2763897-2025-07-31",
      "headline": "Heavy rain pounds Delhi-NCR, more showers, thunderstorms expected todayDelhi has been experiencing uneven rainfall over the past few days, leading to waterlogging in several areas and causing inconvenience to commuters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-signed-off-india-tariff-bomb-with-maga-message-to-pm-modi-indians-2763770-2025-07-30",
      "headline": "India got a MAGA sign-off in Trump's tariff and penalty bomb. Is there a message?Curiously, Trump signed off his tariff announcement to India by writing 'MAGA!' at the end. Is it because Trump is finally playing to the gallery—appearing to please his MAGA base, which was unhappy over his softer stance on immigration and H-1B policies that benefit India—just days before stepping into the Oval Office? Find out"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/huge-crowd-gathers-after-german-influencer-spotted-detained-for-unauthorised-shoot-2763868-2025-07-31",
      "headline": "Huge crowd gathers after German influencer spotted, arrested for unauthorised shootGerman influencer Younes Zarou was initially arrested by the police in Bengaluru but was let off with a warning later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-rejects-calls-to-surrender-weapons-says-its-will-not-submit-to-israel-glbs-2763866-2025-07-31",
      "headline": "We will not submit to Israel: Hezbollah rejects calls to surrender weaponsHezbollah's deputy leader Naim Qassem rejected US-backed calls for disarmament, calling it a ploy to benefit Israel. Lebanon faces rising pressure to act amid ongoing Israeli aggression in the region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/will-blast-india-from-pakistan-threat-on-wall-of-bengaluru-housing-society-causes-panic-bomb-squad-at-spot-2763764-2025-07-30",
      "headline": "Will blast India from Pakistan: Bomb threat found on wall of Bengaluru apartmentA message reading \"Will blast India from Pakistan\" was found scribbled on a Bengaluru apartment wall, triggering panic among residents. Police deployed bomb and dog squads, investigation is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-dog-babu-in-patna-dogesh-babu-applies-for-residence-in-bihar-nawada-probe-ordered-2763639-2025-07-30",
      "headline": "After 'Dog Babu', 'Dogesh Babu' applies for residence in Bihar; probe orderedThe application, dated July 29, has a picture of a furry dog, with parents called \"dogesh ke papa\" and \"dogesh ki mummy\". The incident—though somewhat humorous—has drawn the ire of Nawada's District Magistrate, who has ordered officials to probe the matter and identify those behind the application."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-tariff-threat-on-india-is-negotiating-tactic-says-former-us-diplomat-glbs-2763893-2025-07-31",
      "headline": "Trump's tariff threat on India is negotiating tactic, says former US diplomatFormer US official Nisha Biswal says Trump's 25% tariff imposition on India is a negotiating tactic, not a policy shift, urging continued dialogue to finalise a potentially historic trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-to-recognise-palestinian-state-in-september-pm-mark-carney-glbs-2763879-2025-07-31",
      "headline": "Canada to recognise Palestinian state in September: PM CarneyCanada said it will recognise a Palestinian state at the UN in September. The move follows similar decisions by France and the UK and drew criticism from Israel, which cited concerns over Hamas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/trump-weighs-pardon-for-sean-diddy-combs-ahead-of-sentencing-no-word-from-white-house-report-glbs-2763878-2025-07-31",
      "headline": "Trump weighs pardon for Sean 'Diddy' Combs ahead of sentencing: ReportDonald Trump is reportedly considering a presidential pardon for Sean \"Diddy\" Combs, who was convicted on prostitution-related charges. The move comes ahead of Combs' October sentencing and amid rising pressure from Trump's base over transparency in other high-profile cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/transfer-suspension-action-against-4-cops-recommended-for-army-colonel-assault-2763877-2025-07-31",
      "headline": "Transfer, suspension: Action against 6 cops recommended over Army Colonel assaultSenior Superintendent of Patiala Police has recommended stern departmental action against four police inspectors and two other police personnel accused of assaulting Army officer Colonel Pushpinder Singh Bath"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-trailer-nick-judy-attend-couple-counselling-giant-snake-chase-walt-disney-animation-2763844-2025-07-30",
      "headline": "Zootopia 2 trailer: Nick, Judy attend couple counselling amid giant snake chaseZootopia 2 trailer: Rookie cops Nick and Judy seek couple counselling while solving a mysterious case of a giant snake on the leash. The upcoming animation film is scheduled for a theatrical release on November 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jamie-lee-curtis-slams-ai-filters-plastic-surgery-genocide-of-natural-beauty-2763786-2025-07-30",
      "headline": "Jamie Lee Curtis says plastic surgery has led to genocide of women, slams AI filtersActor Jamie Lee Curtis called plastic surgery a 'genocide' of natural beauty. She also warned against AI filters as they worsen unrealistic beauty standards for women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-funeral-birmingham-wife-sharon-moved-to-tears-thousands-pay-tribute-black-sabbath-legend-2763753-2025-07-30",
      "headline": "Sharon Orbourne moved to tears at Ozzy Osbourne's funeral procession in BirminghamOzzy Osbourne was laid to rest in his hometown of Birmingham today. The funeral saw thousands of fans and family paying emotional tribute to the Black Sabbath frontman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/indira-krishnan-opens-up-on-casting-couch-says-she-lost-big-projects-for-saying-no-2763768-2025-07-30",
      "headline": "Ramayana actor Indira Krishnan on casting couch: Lost big projects for saying noActor Indira Krishnan opened up about facing casting couch experiences, especially in the South film industry, revealing she lost major roles for refusing inappropriate demands. She said these incidents led her to shift focus to television, where she found more respect and better opportunities."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-5th-test-prediction-team-news-lords-pitch-playing-xi-2763845-2025-07-31",
      "headline": "ENG vs IND 5th Test: Can riled-up India land final punch to square series?Having secured a draw in Manchester, India have a great chance to level the series at the Oval against a depleted England side. Shubman Gill and his men have batted and bowled out of their skins time and again in the series so far, and now have a chance to punch above their weight in the finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-dale-steyn-makes-bold-prediction-for-mohammed-siraj-in-oval-2763858-2025-07-30",
      "headline": "ENG vs IND: Dale Steyn makes bold prediction for Indian bowler for Oval TestLegendary South Africa speedster Dale Steyn has made a bold prediction for Mohammed Siraj for the fifth Test against England at the Oval set to begin from July 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-nz-1st-test-day-1-matt-henry-bulawayo-new-zealand-zimbabwe-2763842-2025-07-30",
      "headline": "ZIM vs NZ: Henry dominates as New Zealand blitz through Zimbabwe on Day 1Matt Henry ripped through Zimbabwe's batting with figures of 6 for 39, helping New Zealand bowl out the hosts for just 149 on Day 1. In addition, Conway's unbeaten fifty took the visitors to 92/0, putting them firmly in control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-teams-owner-the-hundred-england-2763824-2025-07-30",
      "headline": "Four IPL team owners confirmed as \"strategic partners\" for The Hundred teamsOn Wednesday, the England and Wales Cricket Board (ECB) announced that four Indian Premier League franchise owners have been confirmed as \"strategic partners\" for teams in 'The Hundred'. These owners will assume operational control by October 1 this year.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-england-vs-india-5th-test-debut-predicted-xi-2763811-2025-07-30",
      "headline": "5th Test Predicted XI: Will Arshdeep Singh make Test debut at The Oval?ENG vs IND, 5th Test: India might hand Arshdeep Singh his maiden Test cap at the Kennington Oval in London with Jasprit Bumrah uncertain for the game, starting July 31. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-benjamin-sesko-ollie-watkins-transfer-deal-2763799-2025-07-30",
      "headline": "Manchester United eye Sesko over Watkins as big striker signing: ReportManchester United have reportedly decided that they will go ahead and sign Benjamin Sesko should the club push to sign a striker in the ongoing transfer window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-5th-test-oval-shubman-gill-full-pre-match-press-conference-2763782-2025-07-30",
      "headline": "Levelling series will be a big achievement for our young side: Shubman GillIndia captain Shubman Gill has said that levelling the series in England will be a big achievement for their team, full of youngsters. India have a great chance to level the series 2-2 by winning the fifth Test at the oval set to begin from July 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-vince-mcmahon-reckless-driving-car-crash-connecticut-highway-2763772-2025-07-30",
      "headline": "Ex-WWE boss faces reckless driving charge after Connecticut crash: ReportVince McMahon has been cited for reckless driving after crashing his Bentley on a highway, damaging two other vehicles. The incident occurred hours before news broke of Hulk Hogan's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/parthiv-patel-to-mentor-youngsters-in-outer-delhi-warriors-dpl-season-2-2763769-2025-07-30",
      "headline": "Parthiv Patel ready for the challenge to mentor next-gen stars in DPL season 2Former India wicketkeeper batter Parthiv Patels is ready to challenge next-gen superstars for Outer Delhi Warriors in the Delhi Premier League (DPL) season 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-lee-fortis-the-oval-video-2763763-2025-07-30",
      "headline": "Did Gambhir cold-shoulder Oval pitch curator in second meet? Video goes viralENG vs IND, 5th Test: Another video has gone viral where Gautam Gambhir can visibly be seen ignoring Lee Fortis when the KIA Oval pitch curator came in for an interaction. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/priyansh-arya-on-influence-of-gautam-gambhir-and-ricky-ponting-2763761-2025-07-30",
      "headline": "Priyansh Arya opens up on influence of Gambhir and Ponting on his battingPriyansh Arya opened up on the influence of Gautam Gambhir and Ricky Ponting on his batting ahead of the 2nd season of the Delhi Premier League season 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-5th-test-oval-shubman-gill-full-pre-match-press-conference-2763782-2025-07-30",
      "headline": "Levelling series will be a big achievement for our young side: Shubman GillIndia captain Shubman Gill has said that levelling the series in England will be a big achievement for their team, full of youngsters. India have a great chance to level the series 2-2 by winning the fifth Test at the oval set to begin from July 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-vince-mcmahon-reckless-driving-car-crash-connecticut-highway-2763772-2025-07-30",
      "headline": "Ex-WWE boss faces reckless driving charge after Connecticut crash: ReportVince McMahon has been cited for reckless driving after crashing his Bentley on a highway, damaging two other vehicles. The incident occurred hours before news broke of Hulk Hogan's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/parthiv-patel-to-mentor-youngsters-in-outer-delhi-warriors-dpl-season-2-2763769-2025-07-30",
      "headline": "Parthiv Patel ready for the challenge to mentor next-gen stars in DPL season 2Former India wicketkeeper batter Parthiv Patels is ready to challenge next-gen superstars for Outer Delhi Warriors in the Delhi Premier League (DPL) season 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-lee-fortis-the-oval-video-2763763-2025-07-30",
      "headline": "Did Gambhir cold-shoulder Oval pitch curator in second meet? Video goes viralENG vs IND, 5th Test: Another video has gone viral where Gautam Gambhir can visibly be seen ignoring Lee Fortis when the KIA Oval pitch curator came in for an interaction. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/priyansh-arya-on-influence-of-gautam-gambhir-and-ricky-ponting-2763761-2025-07-30",
      "headline": "Priyansh Arya opens up on influence of Gambhir and Ponting on his battingPriyansh Arya opened up on the influence of Gautam Gambhir and Ricky Ponting on his batting ahead of the 2nd season of the Delhi Premier League season 2."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}