{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-announce-q4-results-today-what-to-expect-pat-revenue-profit-2723930-2025-05-13",
      "headline": "Tata Motors to announce Q4 results today. Here's what to expectTata Motors stock: The company's share price fell nearly 1% during morning trade on Tuesday. It opened at Rs 720.55 and dropped to a day's low of Rs 714.35 as investors showed caution ahead of the results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-counter-tariffs-on-us-goods-over-steel-and-aluminium-duties-2723916-2025-05-13",
      "headline": "India proposes retaliatory tariffs on select US goods over steel duties: ReportIndia is mulling retaliatory duties on select US goods exported to the country in response to Washington's tariffs on steel and aluminium products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-fall-after-ceasefire-rally-why-is-dalal-street-declining-today-2723897-2025-05-13",
      "headline": "Sensex sinks over 1,000 points: Why is the stock market falling today?At 10:32 am, the BSE Sensex had dropped 1037.34 points to 81,392.56, while the NSE Nifty50 slipped 276.95 points to 24,647.75. Most Nifty sectoral indices were mixed, reflecting broader uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-300-points-lower-nifty-above-24800-infosys-falls-1-percent-2723885-2025-05-13",
      "headline": "Sensex, Nifty in red after Monday's rally; IT stocks take biggest hitThe S&P BSE Sensex was down by 1,000.64 points to 81,429.26, while the NSE Nifty50 lost 261.75 points to 24,662.95 as of 10:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-pharma-shares-us-president-donald-trump-order-trading-dalal-street-today-2723881-2025-05-13",
      "headline": "Pharma stocks to be in focus today on Dalal Street. 3 things to knowThe sudden focus on pharmaceutical shares is due to a new executive order signed by US President Donald Trump on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-rally-dalal-street-may-13-trading-setup-2723872-2025-05-13",
      "headline": "Stock market opening: Will Sensex, Nifty continue their rally today?GIFT Nifty on the NSE International Exchange was trading 26 points lower, or 0.10%, at 24,922 as of 8:13 am. This signals a weaker start for domestic markets on Tuesday, following Monday's steep gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-13-nse-bse-trading-tata-steel-hero-motocorp-airtel-tata-motors-2723862-2025-05-13",
      "headline": "Stocks to watch on May 13: Tata Steel, Hero MotoCorp, Airtel, Tata MotorsA ceasefire agreement between India and Pakistan gave a boost to investor confidence on Monday, leading to a sharp rise on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-truce-sparks-wall-street-rally-sp-500-hits-two-month-high-glbs-2723824-2025-05-13",
      "headline": "US-China tariff truce sparks Wall Street rally, S&P 500 hits two-month highWall Street surged Monday as the S&P 500 hit a two-month high, fueled by a temporary US-China tariff truce that eased trade war fears and boosted investor confidence in global markets.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nissan-to-cut-20000-jobs-as-losses-mount-and-sales-drop-2723610-2025-05-12",
      "headline": "Nissan to cut 20,000 jobs as losses mount and sales drop: ReportNissan recently warned that it expects a record net loss of 700-750 billion yen ($4.74–$5.08 billion) for the last financial year, mainly due to impairment charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-6-must-know-tips-before-you-file-your-tax-return-2723569-2025-05-12",
      "headline": "ITR filing 2025: 6 Must-know tips before you file your tax returnBefore you even think about filing your tax return, make sure your Aadhaar is linked to your PAN. Also, choosing the correct ITR form is important. Filing the wrong one may lead to rejection of your return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-jumps-nearly-3000-points-nifty-above-24900-as-india-pakistan-ceasefire-fuels-relief-rally-2723556-2025-05-12",
      "headline": "Sensex jumps nearly 3,000 points as India-Pakistan ceasefire fuels relief rallyThe S&P BSE Sensex jumped 2,975.43 points to close at 82,429.90, while the NSE Nifty50 added 916.70 points to end at 24,924.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-hcltech-tech-mahindra-tcs-why-are-it-stocks-rising-today-2723539-2025-05-12",
      "headline": "Infosys, HCLTech, Tech Mahindra, TCS: Why are IT stocks rising today?The Nifty IT index surged over 6%, emerging as the top sectoral gainer on the NSE. Oracle Financial Services Software (OFSS) led the rally with a nearly 9% jump, followed by Coforge and Persistent Systems, which rose over 8% each. Blue-chip heavyweight Infosys gained close to 8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/interglobe-aviation-ltd-indigo-shares-rise-10-percent-reason-notam-notice-2723531-2025-05-12",
      "headline": "IndiGo takes off on D-Street with 10% jump: What's behind the rally?IndiGo's share price jumped as much as 9.78% to touch a high of Rs 5,599. By noon, the stock was trading 7.45% higher at Rs 5,479.85. With this rise, IndiGo's share price has gone up 19.35% so far in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loses-shine-as-us-china-trade-talks-ease-market-jitters-2723511-2025-05-12",
      "headline": "Gold loses shine as US-China trade talks ease market jittersThe US and China ended high-stakes trade talks on a positive note on Sunday, with US officials touting a \"deal\" to reduce the U.S. trade deficit, while Chinese officials said they had reached an \"important consensus\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-2600-points-to-cross-82000-mark-for-1st-time-in-7-months-2723495-2025-05-12",
      "headline": "Sensex surges over 3,000 points, best rally in a yearThe stock market rally was led by easing geopolitical tensions, supportive global cues, and renewed investor confidence after a sovereign credit upgrade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-fraud-auditors-ask-discrepancy-market-news-report-2723466-2025-05-12",
      "headline": "IndusInd Bank faces tough questions from auditors over possible fraud: ReportSo far, IndusInd Bank has described the issue as a 'discrepancy'. This is the term it has used in its stock exchange notices and in talks with analysts and credit rating firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-opting-for-old-tax-regime-here-is-why-form-10-iea-is-a-must-itr-3-itr-4-2723486-2025-05-12",
      "headline": "ITR Filing 2025: Opting for old tax regime? Here's why Form 10-IEA is a mustForm 10-IEA is a declaration form for those who do not want to follow the new tax regime. If you earn income from a business or profession, and you wish to continue with the old tax regime, this form is essential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/united-states-china-90-day-reciprocal-tariff-pause-slashing-levels-donald-trump-xi-jinping-agreement-deal-consensus-2723464-2025-05-12",
      "headline": "US and China pause tariff war for 90 days, to slash reciprocal duties by 115%Under the agreement, the US will reduce tariffs on Chinese goods from 145% to 30%, while China will slash its tariffs on American imports from 125% to 10%, according to a joint statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-expectations-what-next-for-dalal-street-investors-after-india-pakistan-ceasefire-rally-2723445-2025-05-12",
      "headline": "Dalal Street soars after ceasefire. Should you buy, hold or sell stocks?After today's euphoric rally driven by the ceasefire between India and Pakistan, investors are basking in green screens. But with uncertainty still looming, the big question remains—what should they do next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-rise-9-percent-why-sbmc-stake-sale-sbi-reason-japan-2723439-2025-05-12",
      "headline": "YES Bank share price rises 9%. Here's whyThe stake sale news led to a rise in Yes Bank's stock price, making it one of the top gainers of the day. The share price of Yes Bank went up by as much as 9% during the trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-services-simplified-now-check-your-pf-balance-with-just-a-call-or-sms-2723437-2025-05-12",
      "headline": "EPFO services simplified: Now check your PF balance with just a call or SMSBefore you use these services, make sure your Universal Account Number (UAN) is active and linked to at least one of these: your bank account, Aadhaar number or PAN. Also, your mobile number must be registered with your UAN on the EPFO portal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistans-stock-exchange-halts-trading-for-an-hour-heres-why-2723417-2025-05-12",
      "headline": "Pakistan's stock exchange halts trading for an hour. Here's whyAccording to a notification from the Pakistan Stock Exchange (PSX), all equity and equity-based markets were temporarily suspended after the KSE-30 index rose more than 5% from the previous session's close — the threshold for a market halt under PSX rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-bse-sensex-rises-2000-points-top-stocks-check-list-2723404-2025-05-12",
      "headline": "Eternal, Adani Ports, Infosys: Top stocks as Sensex jumps over 2,000 pointsEternal (Zomato) led the gains, surging nearly 5% to become the top performer on the 30-share BSE Sensex. Other major gainers included Adani Ports, NTPC and HCLTech, all trading up more than 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-india-trade-with-turkey-azerbaijan-suffer-amid-tensions-with-pakistan-2723400-2025-05-12",
      "headline": "Will India's trade with Turkey, Azerbaijan suffer amid tensions with Pakistan?Over the years, the trade between India and Azerbaijan has grown significantly, jumping from $50 million in 2005 to $1.435 billion in 2023. Further, India imported goods worth $1.235 billion and exported products worth $201 million to Azerbaijan, according to the official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-stock-market-rise-9-percent-india-dalal-street-rally-ceasefire-sensex-nifty-2723383-2025-05-12",
      "headline": "Pakistan stock market jumps over 9% as India ceasefire brings calmPakistan's benchmark index surged over 9% on Monday, while Dalal Street also saw gains with Sensex and Nifty jumping 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-strong-rally-investors-celebrate-india-pakistan-ceasefire-what-to-expect-next-on-dalal-street-2723380-2025-05-12",
      "headline": "Sensex, Nifty up 3% after India-Pakistan ceasefire. What should investors do?With tensions easing and markets surging, global cues and earnings looking strong, should investors ride the momentum or wait for clearer signals before taking fresh positions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-bull-run-sensex-nifty-up-3-percent-investor-wealth-rs-11-lakh-crore-stocks-driving-rally-2723370-2025-05-12",
      "headline": "Investors add Rs 11 lakh crore on D-Street: Which stocks are driving the rally?The Sensex jumped over 2,000 points, while the Nifty came close to the 24,700 mark. The overall mood on the street was upbeat, as investors welcomed signs of calm after days of concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-strong-opening-today-india-pakistan-ceasefire-strong-domestic-indicators-2723354-2025-05-12",
      "headline": "Sensex surges over 3,000 points. Why is the stock market rallying today?Stock market rally today: The BSE Sensex was up 2,975.93 points to 82,430.40 at around 3:26 pm, while the NSE Nifty50 climbed 920.50 points to trade at 24,928.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-rallies-1700-points-nifty-above-24500-ril-up-2-2723353-2025-05-12",
      "headline": "Sensex rallies 2,000 points; Nifty above 24,500; RIL up 3%The S&P BSE Sensex jumped 1,915.43 points to 81,369.90, while the NSE Nifty50 soared 572.80 points to 24,580.20 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-outlook-key-levels-to-watch-breakout-sectors-it-psu-banking-stock-market-2723351-2025-05-12",
      "headline": "Sensex, Nifty amid Indo-Pak tension: Key levels and sectors to watchForeign portfolio investors (FPIs), who had been buying stocks steadily for over two weeks, turned sellers on Friday. As per provisional exchange data, they sold shares worth Rs 3,798.71 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-what-to-expect-sensex-nifty-today-india-pakistan-war-nse-bse-trading-2723337-2025-05-12",
      "headline": "Stock market opening: What to expect from Sensex, Nifty today?Gift Nifty futures were trading at 24,552.5 as of 8:12 am, pointing to a likely 2% jump in the Nifty 50 index compared to Friday's close of 24,008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-12-swiggy-tata-steel-adani-power-ntpc-sbi-nse-bse-trading-2723329-2025-05-12",
      "headline": "Stocks to watch on May 12: Swiggy, Tata Steel, Adani Power, SBIA number of companies will be in focus today due to their quarterly results or key business updates, with investors hoping for  Sensex and Nifty to resume their winning run after having lost momentum last week amid rising Indo-Pak tensions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/imf-billion-dollar-loan-pakistan-criticims-india-abstains-from-voting-explained-2722671-2025-05-10",
      "headline": "Explained: Why the IMF is under fire for $1 billion loan to PakistanThe disbursement, approved on Friday under the Extended Fund Facility (EFF), raises total payouts under the programme to $2.1 billion. But the timing of the announcement has provoked a fierce backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tensions-what-it-means-for-dalal-street-investors-2722620-2025-05-10",
      "headline": "India–Pakistan tensions escalate. What's next for Dalal Street investors?While the Sensex and Nifty ended over 1% lower in the previous session, experts suggest that the decline was far less than what could have been expected in such a volatile environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharama-asks-banks-to-stay-on-alert-amid-rising-indo-pak-tensions-2722375-2025-05-09",
      "headline": "Nirmala Sitharama asks banks to stay on alert amid rising Indo-Pak tensionsThe directive comes a day after India successfully intercepted multiple missile and drone attacks launched from Pakistan late on May 8. While India reported no major damage, the government has since asked all critical institutions to bolster their cybersecurity infrastructure in anticipation of potential retaliatory attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/go-homestays-cuts-ties-with-turkish-airlines-over-anti-india-stand-2722299-2025-05-09",
      "headline": "'Unsupportive stance towards India': Go Homestays ends ties with Turkish AirlinesGo Homestays ends ties with Turkish Airlines after Turkey backs Pakistan following 'Operation Sindoor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/india-pak-tensions-oil-psus-assure-ample-fuel-stocks-urge-against-panic-buying-2722194-2025-05-09",
      "headline": "India-Pak tensions: Oil PSUs assure ample fuel stocks, urge against panic buyingIndian oil companies have issued statements assuring ample fuel stocks across the country. The Indian Oil Corporation and Bharat Petroleum Corporation Limited have emphasised that there is no shortage of petrol, diesel, CNG, or LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharti-airtel-in-talks-to-acquire-49-percent-stake-in-haier-india-report-2722238-2025-05-09",
      "headline": "Bharti Airtel in talks to acquire 49% stake in Haier India: ReportSunil Mittal, the billionaire-founder of Indian telecom operator Bharti Airtel, has partnered with private equity firm, Warburg Pincus to buy a substantial stake in Haier India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/telecom-regulator-trai-recommends-5-year-satellite-spectrum-allotment-report-2722224-2025-05-09",
      "headline": "Telecom regulator recommends 5-year satellite spectrum allotment: ReportThe move comes amid growing interest in satellite internet services from global players like Elon Musk's Starlink and domestic telecom giants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-880-points-lower-nifty-above-24000-titan-ends-4-percent-up-2722207-2025-05-09",
      "headline": "Sensex closes 880 points lower, Nifty above 24,000; Titan ends 4% upThe S&P BSE Sensex lost 880.34 points to end at 79,454.47, while the NSE Nifty50 was down by 265.80 points to close at 24,008.00. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shaheer-sheikh-sleepless-night-family-safety-jammu-amid-india-pakistan-tension-salutes-army-2723927-2025-05-13",
      "headline": "Shaheer Sheikh had 'sleepless nights' over family's safety in Jammu, thanks ArmyShaheer Sheikh expressed deep gratitude towards the Indian Armed Forces amid rising tensions following Pakistan's attacks on Jammu, sharing his personal worries for his family in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-salutes-indian-army-for-their-sacrifice-amid-india-pakistan-tension-2723926-2025-05-13",
      "headline": "Behind every uniform there's a mother who hasn't slept: Alia Bhatt's powerful noteAlia Bhatt responded to the growing tension between India and Pakistan by sharing a heartfelt note dedicated to the brave individuals standing tall at the borders. On the occasion of Mother's Day, she also paid tribute to their mothers, giving them a special shoutout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kunal-kapoor-backs-jewel-thief-amid-backlash-2723882-2025-05-13",
      "headline": "Kunal Kapoor backs Jewel Thief amid backlash: It wasn't supposed to be profoundKunal Kapoor responded to the backlash faced by Jewel Thief, emphasising the film's creative intent and strong performances. He stood firmly with co-stars Saif Ali Khan and Jaideep Ahlawat in the face of criticism.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-says-shah-rukh-khan-loved-bhool-bhulaiyaa-2-always-discusses-his-films-2723889-2025-05-13",
      "headline": "Kartik Aaryan says 'warm and kind' SRK complimented him for Bhool Bhulaiyaa 2Kartik Aaryan revealed that Shah Rukh Khan complimented him for Bhool Bhulaiyaa 2 and said he enjoyed it. The actor also shared that he is shy when it comes to complimenting colleagues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-daughter-klin-kaara-confuses-wax-figure-with-him-upasana-shares-adorable-moment-2723855-2025-05-13",
      "headline": "Ram Charan's daughter confuses wax figure with him, Upasana shares adorable momentRam Charan's daughter, Klin Kaara, adorably gatecrashed the unveiling of his wax statue, charming everyone in attendance. The heartwarming moment quickly went viral, capturing hearts across India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-trial-shocking-hotel-video-shows-alleged-assault-of-cassie-ventura-glbs-2723846-2025-05-13",
      "headline": "Diddy Trial: Shocking hotel video shows alleged assault of Cassie VenturaSean \"Diddy\" Combs is on trial for sex trafficking and assault, with surveillance footage showing him allegedly attacking ex-girlfriend Cassie Ventura. Prosecutors claim he abused women during coercive relationships.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cannes-film-festival-bans-nudity-and-oversized-outfits-on-red-carpet-glbs-2723843-2025-05-13",
      "headline": "Cannes Film Festival bans nudity and oversized outfits on red carpetCannes Film Festival updates red carpet dress code, banning nudity and oversized outfits. New rules aim to enhance safety and decorum, balancing glamour with comfort and legal compliance at high-profile events.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-to-vicky-kaushal-celebs-react-to-virat-kohlis-test-retirement-2723714-2025-05-12",
      "headline": "Ranveer Singh to Vicky Kaushal, celebs react to Virat Kohli's Test retirementVirat Kohli announced his retirement from Test cricket on Monday. Bollywood actors like Ranveer Singh, Vicky Kaushal, and Suniel Shetty shared heartfelt tributes to honour his remarkable journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahira-khan-mawra-hocane-pics-removed-from-raees-sanam-teri-kasam-albums-covers-amid-india-pakistan-clash-2723706-2025-05-12",
      "headline": "Mahira Khan, Mawra Hocane's pics removed from album covers amid India-Pak clashPakistani actors Mahira Khan and Mawra Hocane's images were removed from the album covers of 'Raees' and 'Sanam Teri Kasam' amid the India-Pakistan conflict. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fourth-generation-ntr-to-make-debut-in-yvs-chowdarys-new-film-2723701-2025-05-12",
      "headline": "Fourth-generation NTR to make debut in YVS Chowdary's new filmNTR, the great-grandson of Sr. NTR, is set to make his acting debut. A formal pooja ceremony was held at NTR Ghat in Hyderabad. Director YVS Chowdary is launching NTR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bhuvan-bam-shuts-down-pakistani-users-unfollow-remark-with-bold-reply-2723689-2025-05-12",
      "headline": "Bhuvan Bam shuts down Pakistani user's 'unfollow' remark with bold replyActor Bhuvan Bam reacted to a Pakistani user who wrote about unfollowing him on social media. This came amid India-Pakistan tensions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-opens-up-about-his-battle-with-speech-and-hearing-difficulties-2723682-2025-05-12",
      "headline": "Ibrahim Ali Khan opens up about his battle with speech and hearing difficultiesIbrahim Ali Khan recently revealed that a severe case of jaundice at birth impacted his brainstem and led to hearing and speech difficulties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-actor-upendra-joins-ram-pothineni-and-bhagyashree-borse-for-rapo-22-2723611-2025-05-12",
      "headline": "Kannada actor Upendra joins Ram Pothineni and Bhagyashree Borse for RAPO 22Makers of 'RAPO 22', Mythri Movie Makers, shared a poster revealing Kannada superstar Upendra, of 'UI' fame, as a part of their film. The film stars Ram Pothineni and Bhagyashree Borse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-recalls-saif-ali-khan-emotional-words-after-knife-attack-2723645-2025-05-12",
      "headline": "Ibrahim Ali Khan recalls Saif's emotional words after knife attack: Made me weepActor Ibrahim Ali Khan spoke about the tough time after his father Saif Ali Khan, was stabbed. He said that the incident brought them closer as a family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/divinesh-wins-sa-re-ga-ma-pa-tamil-lil-champs-season-4-takes-home-rs-10-lakh-2723644-2025-05-12",
      "headline": "Sa Re Ga Ma Pa Tamil Li'l Champs Season 4 winner is DivineshThe grand finale of the Tamil reality show Sa Re Ga Ma Pa Li'l Champs Season 4 concluded with 11-year-old contestant Divinesh from Chennai being declared the winner. Amaran actor Sivakarthikeyan presented the trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-says-hell-publicly-slap-kamaal-r-khan-after-his-diss-video-2723651-2025-05-12",
      "headline": "Mika Singh says he'll publicly slap KRK after his diss videoSinger Mika Singh has reacted to Kamaal R Khan's critical video, warning that he'll slap him the next time they meet. \r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-joins-jailer-2-shoot-in-kozhikode-welcomed-with-hukum-2723572-2025-05-12",
      "headline": "Rajinikanth joins Jailer 2 shoot in Kozhikode, welcomed with Hukum songSuperstar Rajinikanth begins shooting for Nelson Dilipkumar's 'Jailer 2' in Kerala. In a viral video, he is seen being welcomed with the iconic 'Hukum' track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-shoot-resumes-in-ap-pawan-kalyan-expected-to-join-soon-2723637-2025-05-12",
      "headline": "They Call Him OG shoot resumes in Andhra, Pawan Kalyan expected to join soonAfter months of uncertainty, 'They Call Him OG' is finally in works. Actor-turned-politician Pawan Kalyan is expected to join the shoot soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-on-naatu-naatu-ode-to-legends-chiranjeevi-and-balakrishna-2723601-2025-05-12",
      "headline": "Naatu Naatu is an ode to Chiranjeevi and Balakrishna, says Jr NTRAt a recent RRR concert at London's Royal Albert Hall, Jr NTR spoke about the emotional roots of the Oscar-winning track 'Naatu Naatu', calling it a tribute to dance legends Chiranjeevi and Balakrishna."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/terrorist-killed-in-gunfight-with-security-forces-in-jks-shopian-two-more-suspected-to-be-trapped-2723938-2025-05-13",
      "headline": "Lashkar terrorist killed in gunfight in J&K's Shopian, 2 more trappedAt least one Lashkar-e-Taiba terrorist has been killed in the Zinpather Keller area of Shopian on Tuesday after an encounter broke out between terrorists and security forces, sources told India Today TV. Two other Lashkar terrorists are believed to be trapped."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/satellite-images-pakistan-air-bases-nur-khan-india-operation-sindoor-2723934-2025-05-13",
      "headline": "Before and after: Satellite pics show extensive damage at Pakistan air basesThe strikes at the strategic military sites of Pakistan are believed to have pushed a rattled Shehbaz Sharif-led government to approach India for a ceasefire after three days of hostilities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/icar-ex-chief-padma-shri-scientist-dr-subbanna-ayyappan-found-in-cauvery-river-2723614-2025-05-12",
      "headline": "Missing Padma Shri scientist Subbanna Ayyappan found dead in River CauveryRenowned agricultural scientist Dr Subbanna Ayyappan, reported missing since May 7, was found dead in the River Cauvery in Karnataka. Police have launched an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-fall-after-ceasefire-rally-why-is-dalal-street-declining-today-2723897-2025-05-13",
      "headline": "Sensex sinks over 1,000 points: Why is the stock market falling today?At 10:32 am, the BSE Sensex had dropped 1037.34 points to 81,392.56, while the NSE Nifty50 slipped 276.95 points to 24,647.75. Most Nifty sectoral indices were mixed, reflecting broader uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-modi-speech-op-sindoor-pak-nuclear-blackmailing-islamabad-2723782-2025-05-12",
      "headline": "How PM Modi's Op Sindoor speech marks strategic shift in India's posturePM Modi has publicly signalled India's readiness to cross Pakistan's nuclear red lines, marking a decisive break from decades of strategic restraint on terror."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/people-dead-in-punjab-amritsar-after-drinking-spurious-liquor-2723856-2025-05-13",
      "headline": "15 dead, 6 critical in Amritsar after consuming spurious liquorAmritsar hooch tragedy: A total of 15 people died while six others are in critical condition after consuming spurious liquor in Majitha area of Punjab's Amritsar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flight-cancellations-india-pakistan-tensions-operation-sindoor-2723818-2025-05-13",
      "headline": "Air India, IndiGo cancel flights to multiple cities today amid security concernsIndiGo and Air India cancelled flights to several northern and western cities for the day over security concerns. Flights to and from Amritsar, Jammu and Chandigarh, among other cities, have been cancelled.\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/two-indian-students-killed-in-us-road-crash-indian-consulate-mourns-loss-glbs-2723844-2025-05-13",
      "headline": "2 Indian students of Cleveland State University killed in US car crashTwo Indian students, Manav Patel and Saurav Prabhakar, from Cleveland State University, died in a tragic road accident in Pennsylvania.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retiremen-career-leadership-nonchalance-2723853-2025-05-13",
      "headline": "The nonchalance of Rohit, the intensity of Virat: Oh, what a jodi!More than any other batters in the post-Tendulkar era, stories of triumph and failure of Rohit and Virat became pivotal sub-plots. These narratives shaped the larger story of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tension-live-updates-operation-sindoor-ceasefire-india-pak-conflict-news-drone-attack-2723850-2025-05-13",
      "headline": "Live: Government to conduct special briefing on Op Sindoor at 3.30 pmThree days after India and Pakistan reached an understanding to halt military action, the situation along the border remains largely calm, barring a few instances of drone sightings on Monday night. Prime Minister Narendra Modi, in a strong and assertive speech on Monday, stated that Operation Sindoor has established a \"new normal\" in relations with neighbouring Pakistan. He reiterated that \"blood and water cannot flow together\" and warned Islamabad of a strong response in the event of any specific provocations or operations. Flight operations, which were widely disrupted, have begun to resume. However, some flights and airports remain non-operational. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranveer-allahbadia-counters-pak-narrative-with-bin-laden-abdul-rauf-pic-on-piers-morgan-show-2723892-2025-05-13",
      "headline": "Ranveer Allahbadia counters Pak narrative with bin Laden pic on Piers Morgan showAllahbadia held up photos of terrorists Osama bin Laden and Abdul Rauf during a debate on Piers Morgan show and said, \"This is the narrative the world should know.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-operation-sindoor-speech-world-media-coverage-2723849-2025-05-13",
      "headline": "How global media covered PM's Op Sindoor speech: India's 'new normal' on terrorThe global media's coverage of PM Modi's speech on Operation Sindoor spotlighted India's assertive tone, especially the warnings against nuclear blackmail and declaration of a \"new normal\" in India's counter-terrorism approach.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/obsessed-with-probiotics-youre-missing-the-whole-prebiotic-plot-2723921-2025-05-13",
      "headline": "Obsessed with probiotics? You might be missing the whole prebiotic plotThe probiotic hype is so strong, it's become every brand's favourite sales pitch. But in all the noise about gut health, are we missing the real plot?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-sources-trump-remark-india-pak-ceasefire-trade-pm-modi-address-2723752-2025-05-12",
      "headline": "No reference to trade: Government sources deny Trump's remark on India-Pak ceasefireGovernment sources clarified that trade wasn't discussed between the Indian and US leadership amid a military standoff between India and Pakistan. Earlier, US President Donald Trump claimed he pressured India and Pakistan to agree to a ceasefire else the US won't trade with them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-whirlwind-week-india-pak-ceasefires-uk-trade-deals-surprise-gift-qatar-2723906-2025-05-13",
      "headline": "Trump's whirlwind week: Ceasefires, trade deals, and a surprise giftUS President Donald Trump had a whirlwind week marked by major foreign policy and trade developments. He announced a ceasefire with Yemen's Houthis, a limited trade deal with the UK, and a 90-day tariff pause with China. Trump also claimed the US averted a potential nuclear conflict between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-address-operation-sindoor-india-policy-against-terror-new-normal-pakistan-2723730-2025-05-12",
      "headline": "Operation Sindoor India's policy against terror, the new normal: PM ModiPM Modi address: In his first address to the nation after 'Operation Sindoor', India's response to the Pahalgam attack, PM Modi also underscored that the country would not succumb to nuclear blackmail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-doubts-virat-kohli-rohit-sharma-2027-odi-world-cup-chances-2723758-2025-05-12",
      "headline": "Virat Kohli and Rohit Sharma will not play 2027 ODI World Cup: GavaskarSunil Gavaskar has expressed doubts over Virat Kohli and Rohit Sharma's chances in India's 2027 ODI World Cup squad. Rohit and Virat will be 40 and 38 respectively by the time of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/google-changes-its-g-logo-for-the-first-time-in-10-years-2723910-2025-05-13",
      "headline": "Google changes its 'G' logo for the first time in 10 yearsGoogle has refreshed its iconic 'G' logo with a new gradient design, making it the first major visual update in almost 10 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/too-many-cars-too-few-roads-bengalurus-traffic-crisis-explained-by-commissioner-of-police-joint-commissioner-traffic-in-podcast-2723935-2025-05-13",
      "headline": "Bengaluru traffic not just a meme: Top cops explain city's troubles in podcastZerodha's Nikhil Kamath in his latest podcast sat down with Bengaluru's top cops to dissect the city's traffic chaos, stalled infrastructure and the long road to solutions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/kashmir-tourism-in-the-time-of-war-2723648-2025-05-12",
      "headline": "Kashmir: Tourism in the time of warThe traveller footfalls interrupted by the Pahalgam attack, the Valley now presents a microcosm of utter disruption caused to ordinary life at war-time\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-american-hostage-edan-alexander-reunites-with-family-gaza-video-2723852-2025-05-13",
      "headline": "Video: Tears, hugs as Israeli-American hostage reunites with family after 584 daysAlexander, who had been held by militants since late 2023, was transferred to an Israeli military facility shortly after his release. Waiting for him was the family he had been torn from—now overjoyed and overwhelmed to finally hold him again."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-congress-mp-shashi-tharoors-4-point-objection-to-trumps-stopped-india-pak-war-comment-2723866-2025-05-13",
      "headline": "Shashi Tharoor's 4-point objection to Trump's 'stopped India-Pak war' commentShashi Tharoor said that Donald Trump's remark on India-Pakistan tensions \"offers Islamabad a negotiating framework which it certainly has not earned\". \"India will never negotiate with a terrorist gun pointed at its head,\" he said. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/inside-kirana-hills-pakistan-site-india-denies-striking-2723639-2025-05-12",
      "headline": "Inside Kirana hills: The site India denies strikingSocial media footage posted on the day of strikes showed smoke billowing from the surrounding peaks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-congress-slams-pm-narendra-modi-silence-donald-trump-trade-deal-threat-2723873-2025-05-13",
      "headline": "Sindoor not for sale: Congress slams PM's silence on Trump's trade threatReferring to US President Donald Trump's remarks -- made minutes before PM Modi's public address -- senior Congress leader Pawan Khera said that he was taken aback by PM's silence on the matter throughout the speech. 'Sindoor ke saath sauda sambhav nahi,' Pawan Khera said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shaheer-sheikh-sleepless-night-family-safety-jammu-amid-india-pakistan-tension-salutes-army-2723927-2025-05-13",
      "headline": "Shaheer Sheikh had 'sleepless nights' over family's safety in Jammu, thanks ArmyShaheer Sheikh expressed deep gratitude towards the Indian Armed Forces amid rising tensions following Pakistan's attacks on Jammu, sharing his personal worries for his family in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-salutes-indian-army-for-their-sacrifice-amid-india-pakistan-tension-2723926-2025-05-13",
      "headline": "Behind every uniform there's a mother who hasn't slept: Alia Bhatt's powerful noteAlia Bhatt responded to the growing tension between India and Pakistan by sharing a heartfelt note dedicated to the brave individuals standing tall at the borders. On the occasion of Mother's Day, she also paid tribute to their mothers, giving them a special shoutout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kunal-kapoor-backs-jewel-thief-amid-backlash-2723882-2025-05-13",
      "headline": "Kunal Kapoor backs Jewel Thief amid backlash: It wasn't supposed to be profoundKunal Kapoor responded to the backlash faced by Jewel Thief, emphasising the film's creative intent and strong performances. He stood firmly with co-stars Saif Ali Khan and Jaideep Ahlawat in the face of criticism.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-says-shah-rukh-khan-loved-bhool-bhulaiyaa-2-always-discusses-his-films-2723889-2025-05-13",
      "headline": "Kartik Aaryan says 'warm and kind' SRK complimented him for Bhool Bhulaiyaa 2Kartik Aaryan revealed that Shah Rukh Khan complimented him for Bhool Bhulaiyaa 2 and said he enjoyed it. The actor also shared that he is shy when it comes to complimenting colleagues."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sairaj-pardeshi-weightlifting-gold-medal-khelo-india-youth-games-2723928-2025-05-13",
      "headline": "Sairaj breaks youth national records to win 81kg weightlifting goldSairaj Pardeshi stole the spotlight at the Khelo India Youth Games with three national records in weightlifting, while athletics saw multiple meet records shattered and Kerala surged up the medal tally with a kalarippayattu sweep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-world-test-championship-final-squad-cameron-green-returns-2723915-2025-05-13",
      "headline": "Cameron Green returns as Australia name squad for WTC finalCameron Green's return headlines Australia's strong squad for the World Test Championship Final against South Africa, as Pat Cummins leads a balanced mix of experience and youth into the high-stakes clash at the Lord's Stadium in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-captain-sunil-gavaskar-workload-management-2723884-2025-05-13",
      "headline": "Make Jasprit Bumrah Test captain: Sunil Gavaskar rubbishes workload concernsSunil Gavaskar believes Jasprit Bumrah was the ideal choice to lead India's Test team, dismissing concerns around his workload and backing the pacer's ability to manage his fitness and responsibilities as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-timing-england-tour-opinion-2723879-2025-05-13",
      "headline": "Did Virat Kohli time his Test retirement right?Virat Kohli's retirement from Test cricket, just 770 runs short of 10,000, marks the end of an era defined by passion, grit, and unmatched intensity. Despite calls to continue, Kohli chose to exit on his own terms—before the game could make the decision for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-shashi-tharoor-tribute-post-2723874-2025-05-13",
      "headline": "Shashi Tharoor pens special post for immortal Virat Kohli's Test retirementShashi Tharoor's emotional tribute to Virat Kohli captured the collective sentiment of fans, expressing admiration for the Test legend while lamenting the suddenness of his retirement without a farewell match on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-cricket-australia-players-return-support-individual-decision-2723861-2025-05-13",
      "headline": "Australia board to support players' individual decisions on IPL 2025 returnCricket Australia has confirmed it will support players' individual choices regarding their return to IPL 2025, allowing them to prioritize safety, recovery, and preparation for upcoming international commitments, especially the World Test Championship final against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retiremen-career-leadership-nonchalance-2723853-2025-05-13",
      "headline": "The nonchalance of Rohit, the intensity of Virat: Oh, what a jodi!More than any other batters in the post-Tendulkar era, stories of triumph and failure of Rohit and Virat became pivotal sub-plots. These narratives shaped the larger story of the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-interview-virat-kohli-rohit-sharma-india-test-team-2723796-2025-05-12",
      "headline": "India to go through a difficult transition phase, Sunil GavaskarIndia will go through a difficult phase of transition as they try to replace three senior players - R Ashwin, Rohit Sharma and Virat Kohli, feels Sunil Gavaskar. Gavaskar said that any team in the world would have found it tough to replace three players in one go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-revised-schedule-bcci-confirms-final-june-3-2723766-2025-05-12",
      "headline": "IPL 2025 to resume on May 17, 6 venues decided, final on June 3: BCCIIPL 2025: The BCCI confirmed that the Indian Premier League will restart on May 17 and the final will be played on June 3. The remainder of the season will be played across six venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-sunil-gavaskar-reaction-selection-2723762-2025-05-12",
      "headline": "Not surprised by Virat Kohli's Test retirement: Sunil GavaskarLegendary Sunil Gavaskar, speaking to India Today, said the selectors and the BCCI top brass would have discussed plans for the next cycle of the World Test Championship with both Rohit Sharma and Virat Kohli, influencing their decisions to retire before the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-doubts-virat-kohli-rohit-sharma-2027-odi-world-cup-chances-2723758-2025-05-12",
      "headline": "Virat Kohli and Rohit Sharma will not play 2027 ODI World Cup: GavaskarSunil Gavaskar has expressed doubts over Virat Kohli and Rohit Sharma's chances in India's 2027 ODI World Cup squad. Rohit and Virat will be 40 and 38 respectively by the time of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retiremen-career-leadership-nonchalance-2723853-2025-05-13",
      "headline": "The nonchalance of Rohit, the intensity of Virat: Oh, what a jodi!More than any other batters in the post-Tendulkar era, stories of triumph and failure of Rohit and Virat became pivotal sub-plots. These narratives shaped the larger story of the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-interview-virat-kohli-rohit-sharma-india-test-team-2723796-2025-05-12",
      "headline": "India to go through a difficult transition phase, Sunil GavaskarIndia will go through a difficult phase of transition as they try to replace three senior players - R Ashwin, Rohit Sharma and Virat Kohli, feels Sunil Gavaskar. Gavaskar said that any team in the world would have found it tough to replace three players in one go."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-revised-schedule-bcci-confirms-final-june-3-2723766-2025-05-12",
      "headline": "IPL 2025 to resume on May 17, 6 venues decided, final on June 3: BCCIIPL 2025: The BCCI confirmed that the Indian Premier League will restart on May 17 and the final will be played on June 3. The remainder of the season will be played across six venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-sunil-gavaskar-reaction-selection-2723762-2025-05-12",
      "headline": "Not surprised by Virat Kohli's Test retirement: Sunil GavaskarLegendary Sunil Gavaskar, speaking to India Today, said the selectors and the BCCI top brass would have discussed plans for the next cycle of the World Test Championship with both Rohit Sharma and Virat Kohli, influencing their decisions to retire before the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-doubts-virat-kohli-rohit-sharma-2027-odi-world-cup-chances-2723758-2025-05-12",
      "headline": "Virat Kohli and Rohit Sharma will not play 2027 ODI World Cup: GavaskarSunil Gavaskar has expressed doubts over Virat Kohli and Rohit Sharma's chances in India's 2027 ODI World Cup squad. Rohit and Virat will be 40 and 38 respectively by the time of the tournament."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}