{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-viksit-bharat-vision-2047-on-track-aditya-birla-group-kumar-mangalam-birla-2697500-2025-03-22",
      "headline": "India on track to become 'Viksit Bharat' by 2047, says Kumar Mangalam BirlaAditya Birla Group Chairman Kumar Mangalam Birla said India is on track for Viksit Bharat 2047, crediting policy stability, infrastructure growth, and economic momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-withdraws-20-duty-on-onion-export-to-be-effective-from-april-1-2697490-2025-03-22",
      "headline": "Government withdraws 20% duty on Onion export, to be effective from April 1The Centre has removed the 20 per cent export duty on onions, effective April 1. The duty, imposed to ensure domestic availability, had been in place since September 2024. Despite restrictions, onion exports saw significant growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-retail-investors-lose-money-in-fo-trading-stock-market-think-they-are-smart-sebi-chief-money-loss-2697477-2025-03-22",
      "headline": "Overconfidence leading to F&O losses for retail investors, says Sebi chiefTuhin Kanta Pandey said that studies conducted by the market regulator, Sebi, show that 90% of retail investors lose money in the futures and options (F&O) segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-should-stock-market-traders-be-worried-about-today-sebi-chief-tuhin-kanta-pandey-answers-2697461-2025-03-22",
      "headline": "What should market traders be worried about today? Sebi chief answersSebi chief Tuhin Kanta Pandey pointed to India's efforts to negotiate bilateral trade agreements with the United States and pursue free trade agreements with various other nations as examples of strategic responses to global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/marico-chairman-harsh-mariwala-hiring-good-talent-market-share-company-growth-bt-mindrush-2025-2697459-2025-03-22",
      "headline": "Marico Chairman Harsh Mariwala says war for talent as crucial as market shareMarico Chairman Harsh Mariwala urged entrepreneurs to focus on building strong teams, saying the competition for skilled professionals is intense.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/motilal-oswal-explains-why-retail-investors-fail-to-make-money-from-stock-market-2697433-2025-03-22",
      "headline": "Motilal Oswal explains why retail investors fail to make money from stock marketMotilal Oswal cautioned that most retail investors are engaging in speculative short-term trading or investing in unknown companies, which often leads to losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nse-ceo-ashish-chauhan-retail-investors-derivatives-trade-warning-bt-mindrush-2025-2697396-2025-03-22",
      "headline": "NSE CEO Ashish Chauhan warns retail investors against derivatives tradingNSE chief Ashish Chauhan also advised investors not to believe market tips and discussions on social media platforms.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-you-should-opt-in-2025-26-income-tax-filing-2697107-2025-03-22",
      "headline": "Old vs new tax regime: Which one should you opt for in 2025-26?While the old tax regime promotes savings through tax benefits, the new one is simpler, involves less paperwork and reduces the chances of tax fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-income-tax-regime-what-to-choose-if-you-earn-rs-50-lakh-per-year-2696980-2025-03-21",
      "headline": "Old vs new income tax regime: What to choose if you earn Rs 50 lakh per yearTaxpayers should consider a few key factors before making a choice. The old regime allows deductions, whereas the new regime offers lower tax rates but no major deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-over-500-points-nifty-above-23300-ntpc-gains-3-percent-2696931-2025-03-21",
      "headline": "Sensex closes over 500 points, Nifty above 23,300; NTPC gains 3%The S&P BSE Sensex added 557.45 points to end at 76,905.51, while the NSE Nifty50 gained 159.75 points to close at 23,350.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-likely-to-drop-usd-23-billion-plan-to-push-domestic-manufacturing-blow-to-make-in-india-2696891-2025-03-21",
      "headline": "Government to lapse $23 billion scheme to boost domestic manufacturing: ReportThe Production-Linked Incentive (PLI) scheme, introduced in 2020, aimed to increase manufacturing's share of India's economy to 25% by 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-card-flexipay-know-how-to-convert-credit-card-payments-into-emis-2696879-2025-03-21",
      "headline": "SBI Card Flexipay: Know how to convert credit card payments into EMIsOne can convert transactions of Rs 500 or more into EMIs under SBI Card's Flexipay option. It offers multiple repayment tenure options, such as three, six, nine, 12, 18 and 24 months."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/karan-aujla-tauba-tauba-ipl-2025-opening-ceremony-disha-patani-2697506-2025-03-22",
      "headline": "Karan Aujla goes Tauba Tauba, Disha Patani dazzles at IPL 2025 openingKaran Aujla and Disha Patani delivered electrifying performances at the IPL 2025 opening ceremony on Saturday. Hosted by Shah Rukh Khan, the event also featured a mesmerising act by Shreya Ghoshal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-virat-kohli-recreate-jhoome-jo-pathaan-rinku-singh-ipl-opening-ceremony-2697449-2025-03-22",
      "headline": "SRK, Virat Kohli steal the show with Pathaan steps at IPL 2025 openingShah Rukh Khan hosted the star-studded opening ceremony of IPL 2025 on March 22. The King of Bollywood set the stage on fire, dancing to Lutt Putt Gaya with Rinku Singh and Jhoome Jo Pathaan with Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreya-ghoshal-maa-tujhhe-salaam-ipl-opening-ceremony-2697458-2025-03-22",
      "headline": "Watch: Shreya Ghoshal and crowd go Maa Tujhhe Salaam at IPL opening ceremonyShreya Ghoshal delighted the audience at Kolkata's Eden Gardens at the IPL opening ceremony in 2025. She performed 'Maa Tujhhe Salaam' and several of her hits ahead of the KKR vs RCB ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-confirmed-for-march-2026-release-2697438-2025-03-22",
      "headline": "Yash's Toxic confirmed for March 2026 releaseKannada superstar Yash's highly anticipated film Toxic has officially set its release date. The film is scheduled to hit the silver screen in March 2026.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-ss-rajamouli-join-tree-plantation-drive-in-odisha-2697405-2025-03-22",
      "headline": "Mahesh Babu and Rajamouli join tree plantation drive in Odisha. PicsIn a bid to promote environmental awareness, actor Mahesh Babu and film-maker SS Rajamouli joined hands for a tree-planting initiative in Odisha. Unseen photos of the event have now taken the internet by storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-empuraan-not-rs-100-crore-film-where-rs-80-crore-goes-to-salaries-2697408-2025-03-22",
      "headline": "Prithviraj says Empuraan 'not Rs 100 crore film where Rs 80 crore goes to salaries'Prithviraj Sukumaran ensured L2: Empuraan's budget was spent on filmmaking, not salaries. Neither he nor Mohanlal charged a fee. He also revealed Akshay Kumar worked for free on Selfiee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jugal-hansraj-on-career-setbacks-typecasting-and-new-beginnings-2697386-2025-03-22",
      "headline": "No regrets: Jugal Hansraj on career setbacks, typecasting and new beginningsJugal Hansraj was praised for his performance in Nadaaniyan. In an exclusive interview with us, he shared insights on Bollywood's evolution, his career struggles, and overcoming typecasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-confirms-performing-at-csk-vs-mi-match-with-fun-cryptic-post-2697382-2025-03-22",
      "headline": "Anirudh Ravichander rehearses Leo's Badass ahead of CSK vs MI matchAnirudh Ravichander confirmed performing at the CSK vs MI match on Sunday in Chennai's Chepauk stadium. The music composer and singer was seen rehearsing Leo's Badass on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahira-sharma-on-dating-rumours-mohammed-siraj-2697365-2025-03-22",
      "headline": "Mahira Sharma shuts down dating rumours with cricketer Mohammed SirajMahira Sharma has addressed rumours of a romantic relationship with cricketer Mohammed Siraj. Both have issued statements debunking the claims, urging an end to such speculations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/avneet-kaur-once-beat-up-a-boy-with-bat-for-misbehaving-on-holi-2697352-2025-03-22",
      "headline": "Avneet Kaur once beat up a boy with bat for misbehaving on Holi: He deserved itAvneet Kaur recalled beating up a boy for misbehaving with her on Holi, being bullied at school, and facing misconceptions about her attitude. She is gearing up for the release of Love in Vietnam, India-Vietnam's first film collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamannaah-bhatia-odela-2-release-date-april-actor-announces-with-new-poster-2697351-2025-03-22",
      "headline": "Tamannaah Bhatia's Odela 2 locks April release, actors shares striking new posterTamannaah Bhatia's much-awaited film Odela 2 is set to release in April. The actor announced the release date with a new poster on March 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/randeep-hooda-filming-swatantrya-veer-savarkar-fractured-knee-2697335-2025-03-22",
      "headline": "Randeep Hooda shot Veer Savarkar with fractured knee, admits being 'hangry' on setActor Randeep Hooda revealed that he shot Swatantrya Veer Savarkar despite having a fractured knee. In a heartfelt post marking the film's first anniversary, he opened up about the intense physical pain he endured during the shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-product-of-nepotism-my-surname-got-me-my-first-film-2697311-2025-03-22",
      "headline": "Prithviraj Sukumaran admits nepotism advantage: My surname got me my first filmActor Prithviraj Sukumaran openly admitted that his entry into the film industry was facilitated by nepotism. The actor acknowledged that his first role was secured due to his surname's influence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-motivates-kkr-players-before-ipl-2025-opener-be-happy-2697317-2025-03-22",
      "headline": "SRK motivates KKR players before IPL 2025 opener: Be happy, be healthyShah Rukh Khan gave a pep talk to KKR ahead of their IPL 2025 opener, urging players to stay happy and healthy. He will open the grand ceremony at Eden Gardens before performances by Shreya Ghoshal, Karan Aujla, and Disha Patani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-randeep-hooda-jaat-trailer-release-postponed-2697306-2025-03-22",
      "headline": "Sunny Deol's Jaat trailer release postponed, makers to announce new date soonThe trailer of Sunny Deol's Jaat was initially scheduled for release on March 22. However, on Saturday, the makers announced that it has been postponed, with a new release date to be revealed soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ali-sethis-pasoori-is-a-global-hit-but-his-mother-doesnt-like-it-2697302-2025-03-22",
      "headline": "Ali Sethi's Pasoori is a global hit, but his mother doesn't like itPakistani singer Ali Sethi's Pasoori may be a global hit, but his mother, Jugnoo Mohsin, isn't a fan. She prefers his traditional Punjabi songs and told him so, despite the track's popularity among music lovers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-laal-singh-chaddha-failure-humourous-video-2697098-2025-03-22",
      "headline": "Aamir Khan on Laal Singh Chaddha failure: I ran a lot, the film didn'tAamir Khan humorously addresses the failure of his last film 'Laal Singh Chaddha' in a light-hearted video where he guesses badly described plots of his movies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-confirms-kesari-2-release-date-hints-at-a-story-of-revolution-2697286-2025-03-22",
      "headline": "Akshay Kumar confirms Kesari 2 release date, hints at a story of revolutionAkshay Kumar confirms Kesari 2. The film is set to release on April 18. The sequel may explore the Jallianwala Bagh massacre. It also stars R Madhavan and Ananya Panday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-brings-rocky-randhawas-energy-to-wedding-bash-flaunts-dhurandhar-look-watch-2697263-2025-03-22",
      "headline": "Ranveer Singh brings Rocky Randhawa's energy to wedding bash. WatchRanveer Singh's dance videos from a wedding went viral as he grooved to his hit songs. He was seen in his rugged Dhurandhar look as he enjoyed the celebrations."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-india-global-role-russia-ukraine-war-israel-iran-conflict-2697474-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India among few that can engage Russia and Ukraine, Israel and Iran: JaishankarS Jaishankar, speaking at Business Today Mindrush 2025, said the mantra of 'sabka saath, sabka vikaas' applies to foreign policy as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/three-judge-panel-probe-cash-at-home-charge-against-high-court-justice-yashwant-varma-2697507-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3-judge panel to probe 'cash at home' charge against Delhi judge Yashwant VarmaSanjiv Khanna has formed a three-member panel to probe Delhi High Court judge Justice Yashwant Varma over the 'cash at home' controversy. Meanwhile, the Delhi High Court Chief Justice has been directed not to assign him any judicial work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-rcb-live-score-updates-ipl-2025-kolkata-knight-riders-vs-royal-challengers-bengaluru-opening-ceremony-2697401-2025-03-22#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Live: RCB 75 for 0 in 5 overs, Kohli-Salt peppering KKRKolkata Knight Riders (KKR) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: Virat Kohli and Phil Salt are off to an aggressive start in their run chase. Both batters have cut loose and have hit every single bowler into the stands in the powerplay overs. Eden Gardens is chanting RCB, RCB!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sushant-singh-rajput-death-case-cbi-files-closure-report-2697524-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBI closes two cases linked to Sushant Singh Rajput's death: SourcesThe closure reports, submitted by the CBI to a Mumbai court, say that no evidence was found to suggest any foul play in Sushant Singh Rajput's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-stray-dog-menace-bite-cases-kerala-public-safety-india-today-gdb-survey-2697411-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala leads the way on public safety, but stray dog menace bites: GDB surveyKerala's public safety measures may be a howling success, but 96% of Kerala residents oppose the presence of stray dogs, shows India Today's Gross Domestic Behaviour (GDB) survey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-viksit-bharat-vision-2047-on-track-aditya-birla-group-kumar-mangalam-birla-2697500-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India on track to become 'Viksit Bharat' by 2047, says Kumar Mangalam BirlaAditya Birla Group Chairman Kumar Mangalam Birla said India is on track for Viksit Bharat 2047, crediting policy stability, infrastructure growth, and economic momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mk-stalin-delimitation-chennai-tamil-nadu-karnataka-deputy-chief-minister-resolution-modi-pinarayi-vijayan-2697374-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin-led panel passes resolution, seeks delimitation freeze for 25 more yearsThe Joint Action Committee (JAC) on delimitation, led by Tamil Nadu Chief Minister MK Stalin, adopted a resolution demanding transparency in the delimitation process. The JAC urged the Union Government to extend the freeze on parliamentary constituencies based on the 1971 Census for another 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/at-india-today-group-event-nitin-gadkari-says-new-toll-policy-before-april-1-2697499-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "At India Today Group event, Nitin Gadkari says new toll policy before April 1Union Minister Nitin Gadkari announced a new toll policy with concessions for consumers before April 1, aiming to balance toll charges and infrastructure funding. India's toll collection rose 35 per cent to Rs 64,809.86 crore in 2023-24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-virat-kohli-recreate-jhoome-jo-pathaan-rinku-singh-ipl-opening-ceremony-2697449-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRK, Virat Kohli steal the show with Pathaan steps at IPL 2025 openingShah Rukh Khan hosted the star-studded opening ceremony of IPL 2025 on March 22. The King of Bollywood set the stage on fire, dancing to Lutt Putt Gaya with Rinku Singh and Jhoome Jo Pathaan with Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-should-stock-market-traders-be-worried-about-today-sebi-chief-tuhin-kanta-pandey-answers-2697461-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What should market traders be worried about today? Sebi chief answersSebi chief Tuhin Kanta Pandey pointed to India's efforts to negotiate bilateral trade agreements with the United States and pursue free trade agreements with various other nations as examples of strategic responses to global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/samajwadi-mp-calls-rajput-king-rana-sanga-traitor-bjp-says-shame-on-you-2697403-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Samajwadi MP calls Rajput king Rana Sanga 'traitor', BJP says shame on youSamajwadi Party leader Ramji Lal Suman's remark in Parliament, calling Rajput king Rana Sanga a \"traitor\", ignited a political storm. BJP leaders denounced the statement as an insult to Rajputs and India's history, demanding an apology from the party.\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nse-ceo-ashish-chauhan-retail-investors-derivatives-trade-warning-bt-mindrush-2025-2697396-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "NSE CEO Ashish Chauhan warns retail investors against derivatives tradingNSE chief Ashish Chauhan also advised investors not to believe market tips and discussions on social media platforms.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/12-year-old-us-boy-builds-nuclear-fusion-reactor-gets-visit-from-fbi-2697413-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12-year-old builds nuclear fusion reactor, gets visit from FBIJackson Oswalt, a 12-year-old teen from Memphis, US, built a nuclear fusion reactor in his bedroom and made a Guinness World Record for the youngest person to achieve fusion. Later on, he got a visit from the FBI to make sure all was good. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/should-alcohol-be-banned-prohibition-india-today-gdb-survey-nfhs-liquor-vends-sale-dry-day-2697281-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Should alcohol be banned? This is what India has to saySome states in India have tried to ban the sale of alcohol and are seeing mixed results. Though a complete ban never succeeds, India Today's inaugural Gross Domestic Behaviour (GDB) survey found 82 per cent of the respondents supported prohibition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-world-order-western-myth-geopolitical-shift-2697510-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaishankar calls world order a western myth: Won't go around singing paeansS Jaishankar said even though the world order was on the threshold of change, India won't go around 'singing paeans' to the world if challenges arise.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meerut-murder-autopsy-reveals-saurabh-rajputs-head-was-cut-off-legs-bent-back-by-his-wife-her-lover-2697407-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stabbed in heart, limbs cut off to fit in drum: Autopsy of UP man killed by wifeSaurabh Rajput was allegedly drugged and murdered on March 4. His wife and her lover then hid his body in a cement-filled drum before they left for a vacation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-new-bollywood-films-lacks-iconic-dialogues-music-scenes-2696981-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Kitne aadmi the?' Not enough to remember today's films byBollywood's golden era gave us iconic dialogues, music, and moments. Today, films have become forgettable and do not have a lasting impact. Experts blame weak writing, fleeting music, and OTT overload for cinema's declining recall value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-461-21-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: India Today News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sunita-williams-butch-wilmore-overtime-pay-annual-salary-nasa-astronauts-donald-trump-2697312-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump told Sunita Williams will get just Rs 430 per day for overtime. He reactsSunita Williams and Butch Wilmore spent an additional 278 days in space after their week-long mission in June last year turned into a nine-month ordeal. Here is how much they will get in overtime pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-baijayant-panda-selfie-shashi-tharoor-cryptic-post-sparks-buzz-2697325-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP MP's 'mischievous' post on Shashi Tharoor: Travelling in same directionJay Panda, who is the BJP vice president, said they were 'finally travelling in the same direction', drawing a swift clarification from Shashi Tharoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/benjamin-netanyahu-gaza-ceasefire-israel-hamas-uncertain-endgame-2697267-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ceasefire up in flames: Netanyahu's Gaza strategy and its uncertain endgameUS President Donald Trump warned of \"all hell breaking out\" in the Middle East if hostages weren't freed before he took office. A brief ceasefire averted the crisis, but Israel resumed strikes on March 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-iftar-party-temple-visit-row-darbhanga-bjp-sanjay-saraogi-2697391-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tejashwi Yadav attends iftar after temple visit, BJP takes 'topi over tika' jabOn Friday, Tejashwi visited a temple before attending an Iftar event. Bihar minister Sanjay Saraogi alleged that Tejashwi Yadav 'hates Sanatan Dharma' and should convert his religion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/swami-gaur-gopal-das-on-the-70-hour-work-week-debate-balance-is-everything-2697385-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Swami Gaur Gopal Das on the 70-hour work-week debate: It's about balanceDuring his session at BT MindRush 2025, Swami Gaur Gopal Das weighed in on the 70-hour work-week debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lebanon-prime-minister-warns-of-new-war-after-israeli-strikes-in-response-to-cross-border-rocket-launch-2697349-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lebanon warns of 'new war' after Israel retaliates with heavy airstrikesThe fresh escalation, which has again brought the Middle East to a boil, came after rockets were launched from Lebanon towards northern Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/karan-aujla-tauba-tauba-ipl-2025-opening-ceremony-disha-patani-2697506-2025-03-22",
      "headline": "Karan Aujla goes Tauba Tauba, Disha Patani dazzles at IPL 2025 openingKaran Aujla and Disha Patani delivered electrifying performances at the IPL 2025 opening ceremony on Saturday. Hosted by Shah Rukh Khan, the event also featured a mesmerising act by Shreya Ghoshal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-virat-kohli-recreate-jhoome-jo-pathaan-rinku-singh-ipl-opening-ceremony-2697449-2025-03-22",
      "headline": "SRK, Virat Kohli steal the show with Pathaan steps at IPL 2025 openingShah Rukh Khan hosted the star-studded opening ceremony of IPL 2025 on March 22. The King of Bollywood set the stage on fire, dancing to Lutt Putt Gaya with Rinku Singh and Jhoome Jo Pathaan with Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreya-ghoshal-maa-tujhhe-salaam-ipl-opening-ceremony-2697458-2025-03-22",
      "headline": "Watch: Shreya Ghoshal and crowd go Maa Tujhhe Salaam at IPL opening ceremonyShreya Ghoshal delighted the audience at Kolkata's Eden Gardens at the IPL opening ceremony in 2025. She performed 'Maa Tujhhe Salaam' and several of her hits ahead of the KKR vs RCB ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-confirmed-for-march-2026-release-2697438-2025-03-22",
      "headline": "Yash's Toxic confirmed for March 2026 releaseKannada superstar Yash's highly anticipated film Toxic has officially set its release date. The film is scheduled to hit the silver screen in March 2026.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-guides-rajat-patidar-kkr-vs-rcb-2697496-2025-03-22",
      "headline": "IPL 2025: Leader Virat Kohli guides Rajat Patidar on captaincy debut vs KKRRoyal Challengers Bengaluru (RCB) batter Virat Kohli was seen guiding Rajat Patidar on his captaincy debut during the opening game of the Indian Premier League 2025 (IPL 2025) against Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ajinkya-rahane-kkr-vs-rcb-flying-start-silence-criticism-2697495-2025-03-22",
      "headline": "IPL 2025: Captain Rahane silences critics with flying start for KKR vs RCBAjinkya Rahane silenced critics in style, leading Kolkata Knight Riders with a blistering 25-ball fifty in their IPL 2025 opener against Royal Challengers Bengaluru. The new KKR captain took charge after an early setback, displaying aggressive strokeplay and proving why he is the right man for the job."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shah-rukh-khan-virat-kohli-ipl-2025-kkr-vs-rcb-opening-ceremony-2697476-2025-03-22",
      "headline": "Shah Rukh Khan, Virat Kohli share laughs, dance at opening ceremonyShah Rukh Khan and Virat Kohli matched steps in Kolkata at a glittering opening ceremony on Saturday. The KKR co-owner interacted with Virat in a short segment that had the crowd hotting at Eden.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-is-ready-to-do-something-special-piyush-chawla-2697456-2025-03-22",
      "headline": "Virat Kohli is ready to do something special: Piyush Chawla warns teams ahead of IPLFormer India spinner Piyush Chawla said that Royal Challengers Bengaluru (RCB) batter Virat Kohli is always ready to do something special for his team and brushed away all the criticism around his strike rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-vs-mumbai-indians-suryakumar-yadav-press-conference-2697455-2025-03-22",
      "headline": "Suryakumar jokes about lean patch ahead of CSK vs MI: IPL form has been goodSuryakumar Yadav joked about his own form heading into Mumbai Indians' IPL 2025 fixture against Chennai Super Kings on Sunday, March 23. Suryakumar endured a rough patch heading into the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-practicing-till-late-night-ahead-of-csk-vs-mi-2697416-2025-03-22",
      "headline": "MS Dhoni practicing till late night ahead of MI fixture, reveals Sam CurranChennai Super Kings and England all-rounder Sam Curran revealed that legendary wicketkeeper batter MS Dhoni has been practising till late night ahead of their opening game against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-rcb-live-score-updates-ipl-2025-kolkata-knight-riders-vs-royal-challengers-bengaluru-opening-ceremony-2697401-2025-03-22",
      "headline": "Live: Kohli, Salt off to aggressive start in 175-run chaseKolkata Knight Riders (KKR) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: Virat Kohli and Phil Salt are off to an aggressive start in their run chase. RCB need a modest 175 runs to win the match but have the threat of Sunil Narine and Varun Chakravarthy to deal with in the middle overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-knight-resigns-england-captain-ashes-debacle-2697400-2025-03-22",
      "headline": "Heather Knight resigns as England undergo big overhaul after Ashes debacleEngland captain Heather Knight has stepped down from his position a day after head coach Jon Lewis put down his papers as the head coach. England recently lost the Ashes 0-16 to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-phil-salt-excited-to-open-with-virat-kohli-kkr-vs-rcb-2697390-2025-03-22",
      "headline": "Phil Salt excited to open with 'super competitor' Virat Kohli in IPL 2025England and Royal Challengers Bengaluru batter Phil Salt opened up on his camaraderie with Virat Kohli ahead of their opening game of the Indian Premier League 2025 (IPL 2025) against Kolkata Knight Riders (KKR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-odi-world-cup-guwahati-test-match-india-men-2697389-2025-03-22",
      "headline": "Women's ODI World Cup likely in September, Guwahati set for historic Test matchIndia is set to host the Women's ODI World Cup tentatively in September. According to BCCI sources, the opening match and opening ceremony will be held in Vizag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-practicing-till-late-night-ahead-of-csk-vs-mi-2697416-2025-03-22",
      "headline": "MS Dhoni practicing till late night ahead of MI fixture, reveals Sam CurranChennai Super Kings and England all-rounder Sam Curran revealed that legendary wicketkeeper batter MS Dhoni has been practising till late night ahead of their opening game against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-rcb-live-score-updates-ipl-2025-kolkata-knight-riders-vs-royal-challengers-bengaluru-opening-ceremony-2697401-2025-03-22",
      "headline": "Live: Kohli, Salt off to aggressive start in 175-run chaseKolkata Knight Riders (KKR) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: Virat Kohli and Phil Salt are off to an aggressive start in their run chase. RCB need a modest 175 runs to win the match but have the threat of Sunil Narine and Varun Chakravarthy to deal with in the middle overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-knight-resigns-england-captain-ashes-debacle-2697400-2025-03-22",
      "headline": "Heather Knight resigns as England undergo big overhaul after Ashes debacleEngland captain Heather Knight has stepped down from his position a day after head coach Jon Lewis put down his papers as the head coach. England recently lost the Ashes 0-16 to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-phil-salt-excited-to-open-with-virat-kohli-kkr-vs-rcb-2697390-2025-03-22",
      "headline": "Phil Salt excited to open with 'super competitor' Virat Kohli in IPL 2025England and Royal Challengers Bengaluru batter Phil Salt opened up on his camaraderie with Virat Kohli ahead of their opening game of the Indian Premier League 2025 (IPL 2025) against Kolkata Knight Riders (KKR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-odi-world-cup-guwahati-test-match-india-men-2697389-2025-03-22",
      "headline": "Women's ODI World Cup likely in September, Guwahati set for historic Test matchIndia is set to host the Women's ODI World Cup tentatively in September. According to BCCI sources, the opening match and opening ceremony will be held in Vizag. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}