{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-entrepreneur-sells-startup-exits-sweden-xenophobic-system-2874313-2026-02-25",
      "headline": "Eviction, not exit: Indian CEO quits Sweden, blames 'xenophobic' systemWhat was meant to be a startup success story in Sweden has ended in an anguished exit for Indian entrepreneur Abhijith Nag Balasubramanyam. Ten months after founding a company, he has been forced to sell his business and return to India. What's behind the move? What challenges did he face? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-down-erase-early-gains-ril-sbi-down-2874206-2026-02-25",
      "headline": "Sensex, Nifty erase early gains to end marginally higher; RIL down 2%The S&P BSE Sensex added 50.15 points to close at 82,276.07, while the NSE Nifty50 gained 57.85 points to end at 25,482.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-rs-12-lakh-salary-still-feels-tight-even-with-just-rs-55000-emis-2874098-2026-02-25",
      "headline": "Why your Rs 1.2 lakh salary still feels tight even with just Rs 55,000 EMIsWith a Rs 1.2 lakh monthly income and Rs 55,000 in EMIs, you would expect to have enough left for savings and comfort. But many people still feel financially stretched. Are hidden fixed expenses quietly consuming your income?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ai-impact-on-it-stocks-should-you-buy-it-stocks-or-it-mutual-funds-now-2874124-2026-02-25",
      "headline": "With AI hurting IT sector, what's the smarter bet: Stocks or IT mutual funds?While AI fears have driven the sharp fall in IT stocks, the correction has also reset valuations, prompting some long-term investors to see a potential entry opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-more-hidden-charges-rbi-orders-banks-to-remove-misleading-app-tricks-2874107-2026-02-25",
      "headline": "No more hidden charges? RBI orders banks to remove misleading app tricksThe RBI's move aims to ensure customers are not misled into buying products or paying charges without proper awareness. Banks will also be barred from bundling financial products together without clear approval from the customer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-crosses-rs-161-lakh-silver-nears-rs-27-lakh-in-fresh-rally-should-you-buy-2874077-2026-02-25",
      "headline": "Gold crosses Rs 1.61 lakh, silver nears Rs 2.7 lakh in fresh rally: Should you buy?Precious metals are back in focus as gold climbs above Rs 1.61 lakh and silver approaches Rs 2.7 lakh. The steady rise has sparked fresh interest among investors, raising the key question, i.e., is this the right time to buy?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-global-economy-heading-towards-2008-like-crisis-due-to-ai-jpmorgan-ceo-jamie-dimon-warning-2874076-2026-02-25",
      "headline": "Global economy heading towards 2008-like crisis due to AI? Jamie Dimon answersJamie Dimon, JPMorgan CEO, said that some lenders and financial players are doing \"dumb things\" to make money in the current market environment, which he described as risky and uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-hcltech-tcs-other-it-stocks-rebound-after-crash-key-reasons-explained-2873961-2026-02-25",
      "headline": "Infosys, HCLTech, TCS rise up to 4%: Why are IT stocks rising today?IT stocks may still be under pressure, but today's rebound shows confidence returning. The clash between AI anxiety and long-term opportunity is reshaping the narrative, pulling investors back into one of India's most-watched sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/waaree-energies-shares-fall-15-percent-after-us-raises-solar-import-tariffs-solar-stock-down-2873955-2026-02-25",
      "headline": "Waaree Energies shares fall 15%: What triggered the sharp fall today?Waaree Energy share price: Over the past six months, the stock has declined by Rs 464.50, or 14.74%. However, on a one-year basis, it is still up by Rs 417.85, or 18.42%, according to the latest data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-why-stock-market-rising-today-after-it-crash-hcl-infosys-tcs-hul-up-2873940-2026-02-25",
      "headline": "Sensex gains 500 points: Why is stock market rising today?The S&P BSE Sensex rose 564.63 points to 82,790.45. The NSE Nifty50 gained 167.00 points to 25,591.65 as of 9:28 am. Both indices were up by over 0.5% in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-400-points-nifty-above-25500-hcltech-gains-it-stocks-up-2873925-2026-02-25",
      "headline": "Sensex, Nifty rally in early trade led by IT stocksThe S&P BSE Sensex was up 515.54 points to 82,741.46, while the NSE Nifty50 gained 181.95 points to 25,606.60 as of 11:19 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-trading-setup-will-stock-market-fall-again-today-ai-it-selloff-2873918-2026-02-25",
      "headline": "Sensex, Nifty trading setup: Will stock market fall again today?Gift Nifty futures were trading at 25,671.5 at 8:00 am. This suggests that the benchmark Nifty 50 may open above Tuesday's closing level of 25,424.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-israel-free-trade-agreement-fta-talks-piyush-goyal-pm-modi-visit-economic-partnership-2873872-2026-02-25",
      "headline": "India-Israel free trade talks kick off in Delhi ahead of PM Modi's visit to IsraelAhead of PM Modi's visit to Israel on Wednesday, India and Israel began the first round of negotiations for a proposed Free Trade Agreement in New Delhi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/venezuelas-oil-comeback-massive-super-tankers-headed-to-indian-refineries-2873859-2026-02-25",
      "headline": "Venezuela sends mega 2-million-barrel oil cargoes to India as exports surgeVenezuela has chartered its first supertankers since easing US sanctions, boosting crude exports to India as refiners seek discounted heavy oil and diversify away from Russian supplies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-board-decision-n-chandrasekaran-reappointment-third-term-noel-tata-conditions-2873769-2026-02-24",
      "headline": "Tata Sons defers N Chandrasekaran's 3rd term decision after Noel Tata's conditionsN Chandrasekaran's term ends in February 2027, and the board of Tata Sons was discussing extending the same when a set of conditions was put forth by Noel Tata."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kalyani-group-firms-settle-sebi-proceedings-over-fund-misuse-allegations-with-rs-412-crore-payment-2873766-2026-02-24",
      "headline": "Kalyani Group firms settle Sebi case for Rs 4.12 crore after NSE reportKalyani Group's two listed companies have settled Sebi proceedings over alleged fund diversion, paying over Rs 4.12 crore without admitting guilt. The regulator's probe revealed suspicious investments and multi-layered transactions involving related parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-save-tax-legally-here-are-5-ways-to-earn-income-tax-free-ppf-ssy-epf-2873710-2026-02-24",
      "headline": "Want to save tax legally? Here are 5 ways to earn income tax-freeYou don't always need complicated tricks to save on taxes. Certain incomes and investments in India are fully exempt, letting you save while staying within the law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-falls-over-rs-5000-gold-drops-rs-1000-is-this-a-buying-opportunity-2873665-2026-02-24",
      "headline": "Silver falls over Rs 5000, gold drops Rs 1,000: Is this a buying opportunity?Bullion prices came under pressure, with silver and gold both slipping on Tuesday. After the recent correction, investors are now watching closely to see if lower prices present a buying opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-transfers-rs-583-crore-to-haryana-following-fraud-incident-2873557-2026-02-24",
      "headline": "IDFC First Bank transfers Rs 583 crore to Haryana following fraud incidentAccording to a stock market filing, IDFC bank has paid out 100% of the principal and interest to the relevant departments of Haryana Government as claimed, which works out to a net amount of INR 583 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taken-a-home-loan-heres-what-happens-if-you-miss-3-emis-2873540-2026-02-24",
      "headline": "Taken a home loan? Here's what happens if you miss 3 EMIsA home loan EMI is a long-term responsibility that borrowers usually plan for carefully. But income disruptions or unexpected expenses can affect repayments. If EMIs are missed repeatedly, how do lenders react, and how serious can it become? Let's have a look."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hoppers-first-reactions-animation-sci-fi-film-praised-for-imaginative-storytelling-2874180-2026-02-25",
      "headline": "Hoppers first reactions: Animation sci-fi film praised for imaginative storytelling Daniel Chong's animated science-fiction film, Hoppers, has been praised for emotional depth and imaginative storytelling ahead of its India release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-carradine-remembered-jamie-lee-curtis-first-crush-laurel-canyon-family-2874182-2026-02-25",
      "headline": "Jamie Lee Curtis mourns 'first crush' Robert Carradine in moving tribute. See post Jamie Lee Curtis has paid tribute to Robert Carradine, recalling their relationship and shared memories in the 1970s, following Carradine's death at the age of 71. The actor died at 71 after a prolonged struggle with bipolar disorder."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jiohotstar-sonyliv-zee5-this-week-one-battle-after-another-bugonia-and-more-2874252-2026-02-25",
      "headline": "JioHotstar, SonyLiv, ZEE5 this week: One Battle After Another, Bugonia and more From Leonardo DiCaprio's intense thriller One Battle After Another to horror sequel Black Phone 2 and regional dramas like Thadayam, this week's OTT lineup is packed with variety. Here's a look at what's releasing on JioHotstar and ZEE5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kerala-story-2-hearing-release-date-no-relief-high-court-petitioner-malayali-community-2874234-2026-02-25",
      "headline": "High Court halts The Kerala Story 2: Don't release rights until court decides The Kerala High Court has directed the makers of The Kerala Story 2 to halt the release of the film's rights until it decides on petitions challenging its censor board certification. The court observed that the concerns raised by petitioners are \"probably genuine.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-is-out-of-danger-i-am-in-touch-with-salman-daisy-shah-2874212-2026-02-25",
      "headline": "Salim Khan is out of danger, I am in touch with Salman: Daisy Shah Daisy Shah shared an update on Salim Khan's health after he underwent a medical procedure at Mumbai's Lilavati Hospital. She confirmed that he was stable and out of danger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithya-menen-launches-keyuri-banner-for-honest-film-production-2874170-2026-02-25",
      "headline": "Nithya Menen on Keyuri, her Vision and setting the record straight on her name Actor Nithya Menen has launched Keyuri, her new film production banner emphasising honesty and creative integrity. In an interview, she explained the reason behind this move and the confusion surrounding her name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-prime-video-this-week-bridgerton-season-4-ikkis-accused-and-more-2874175-2026-02-25",
      "headline": "Netflix, Prime Video this week: Bridgerton S4, Ikkis, Accused and more From Bridgerton Season 4 Part 2 to war drama Ikkis and the gripping film Accused, this week's OTT lineup offers something for every viewer. Here's a quick look at what's releasing on Netflix and Prime Video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/assi-touches-both-your-heart-and-mind-javed-akhtar-reviews-anubhav-sinhas-film-2874162-2026-02-25",
      "headline": "Assi touches both your heart and mind: Javed Akhtar reviews Anubhav Sinha's film Veteran lyricist Javed Akhtar reviews Assi, calling Anubhav Sinha's film a rare story that touches both the heart and the mind while raising serious questions about justice.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/the-weeknd-sparks-buzz-of-ariana-grande-collab-with-cryptic-pos-2874132-2026-02-25",
      "headline": "The Weeknd sparks buzz of Ariana Grande collab with cryptic post Fans speculate on social media after The Weeknd shared a post suggesting a new project with Ariana Grande, following their history of successful collaborations. The singer-duo is yet to share an official announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-leela-bhansalis-team-denies-hospitalisation-reports-as-false-and-baseless-2874099-2026-02-25",
      "headline": "Sanjay Leela Bhansali's family, team deny hospitalisation reports as false Sanjay Leela Bhansali's team has denied reports about his hospitalisation, while urging everyone to refrain from carrying such stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-knight-of-the-seven-kingdoms-finale-proves-got-universe-struggles-with-endings-2874102-2026-02-25",
      "headline": "A Knight of the Seven Kingdoms finale proves GoT universe struggles with endings After Episode 5's powerful Trial of Seven, A Knight of the Seven Kingdoms looked ready to fix Westeros' long-standing finale problem. However, the Season 1 ending played it safe, and the GoT problem lingered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-stuns-fans-with-surprise-appearance-at-the-bluff-screening-pics-2874086-2026-02-25",
      "headline": "Priyanka Chopra stuns fans with surprise appearance at The Bluff screening. Pics Priyanka Chopra made a surprise appearance at a theatre, where she met fans ahead of the release of her new film The Bluff. The actor took time to interact with the audience, pose for photographs, and thank them for their support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-mantralayam-guru-vaibhavotsava-jai-hanuman-film-2874064-2026-02-25",
      "headline": "Rishab Shetty visits Karnataka's Mantralayam, shares insights on Jai Hanuman Actor-director Rishab Shetty visited Mantralayam in Karnataka's Raichur district to take part in the Guru Vaibhavotsava and sought blessings from Guru Raghavendra Swamy. He was accompanied by wife Pragathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/what-propaganda-film-shatrughan-sinha-calls-dhurandhar-a-masterpiece-2874034-2026-02-25",
      "headline": "What propaganda film? Shatrughan Sinha calls Dhurandhar a masterpiece Shatrughan Sinha praised Dhurandhar, calling it an absolute masterpiece. Apart from the cast, he also expressed admiration for the technical brilliance of the film.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-portrait-tattoo-tejasswi-prakash-viral-ramzan-event-mumbai-2874054-2026-02-25",
      "headline": "Karan Kundrra's portrait tattoo of Tejasswi Prakash sparks social media buzz Television actor Karan Kundrra was spotted flaunting a portrait tattoo of girlfriend Tejasswi Prakash at a Ramzan event in Mumbai. The tattoo sparked widespread fan excitement and debate over its authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-vanga-rahul-ravindran-arrive-udaipur-rashmika-mandanna-vijay-deverakonda-wedding-2874042-2026-02-25",
      "headline": "Rashmika-Vijay wedding: Directors Sandeep Vanga, Rahul Ravindran in Udaipur. Video Actors Vijay Deverakonda and Rashmika Mandanna are set to marry on February 26 in Udaipur, with their wedding celebrations already underway and receiving special wishes from Prime Minister Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-season-4-part-2-launch-yerin-ha-luke-thompson-bfi-southbank-red-carpet-2874009-2026-02-25",
      "headline": "Heavy metal diva: Yerin Ha is rockstar of style at Bridgerton 4 London premiere Yerin Ha dazzled in a metallic dress at a special Bridgerton screening in London as anticipation builds for the next episodes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pedro-pascal-rafael-olarra-outings-public-interest-relationship-careers-2874002-2026-02-25",
      "headline": "Pedro Pascal outing with director Rafael Olarra sparks online buzz. Viral video Photographs of Pedro Pascal and Rafael Olarra together in New York and Los Angeles have sparked renewed interest in their respective dating lives. In the photos, the duo could be seen walking hand-in-hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-wedding-prime-minister-modi-wishes-2026-2873990-2026-02-25",
      "headline": "PM Modi sends wedding wishes for Rashmika and Vijay: Divinely scripted chapter Prime Minister Narendra Modi has extended a heartfelt note of congratulations to actors Vijay Deverakonda and Rashmika Mandanna on the occasion of their wedding, scheduled to take place on February 26, 2026, in Udaipur."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/anil-ambanis-rs-3716-crore-mumbai-residence-attached-by-ed-in-pmla-case-2874302-2026-02-25",
      "headline": "Anil Ambani's Rs 3,716-crore Mumbai home attached in money laundering caseThe Enforcement Directorate has intensified its probe into alleged financial irregularities involving Reliance Communications and Anil Ambani's assets. A luxury Mumbai property worth over Rs 3,700 crore has been attached as part of this investigation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/bill-gates-apologises-to-foundation-staff-for-epstein-files-incident-says-mistakes-made-2874010-2026-02-25",
      "headline": "Epstein Files: Bill Gates apologises, admits affairs with Russian womenCaught in Epstein Files controversy, Bill Gates has apologised to Gates Foundation staff. Gates reportedly called his links with Epstein a huge mistake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/completely-bizarre-unacceptable-govt-on-bsnl-director-at-centre-of-protocol-row-seeks-response-in-7-days-2874070-2026-02-25",
      "headline": "BSNL director in trouble over lavish Prayagraj visit plan, government calls it unacceptableThe Centre has issued a showcause notice to a BSNL director after an elaborate protocol plan for his proposed Prayagraj visit, involving deployment of 50 staff for personal and religious tours, sparked widespread outrage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-entrepreneur-sells-startup-exits-sweden-xenophobic-system-2874313-2026-02-25",
      "headline": "Eviction, not exit: Indian CEO quits Sweden, blames 'xenophobic' systemWhat was meant to be a startup success story in Sweden has ended in an anguished exit for Indian entrepreneur Abhijith Nag Balasubramanyam. Ten months after founding a company, he has been forced to sell his business and return to India. What's behind the move? What challenges did he face? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/pm-narendra-modi-visit-israel-india-signalling-strategic-partners-netanyahu-middle-east-hexagon-alliance-2874145-2026-02-25",
      "headline": "Modi's visit to Israel is India's signalling to the worldPM Narendra Modi's visit to Israel gives a much-needed boost to his Israeli counterpart, Benjamin Netanyahu. The Middle East is on the edge with American military assets gathering near Iran. Modi's visit is a crucial signalling to the world, and, most importantly, to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-ex-wife-return-rs-57-crore-extortion-trickery-2874007-2026-02-25",
      "headline": "Court orders Dhawan's ex-wife to return Rs 5.7 cr, cites extortion and trickeryFormer India cricketer Shikhar Dhawan won a major legal battle as a Delhi family court ordered his ex-wife to return Rs 5.7 crore, declaring the property settlement null and void due to extortion and fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rangrez-no-halal-stance-fake-reviews-behind-london-restaurant-closure-indian-owner-fresh-claims-2874256-2026-02-25",
      "headline": "No-halal stance, fake reviews behind UK eatery closure? Indian owner's fresh claimsThe owner of Rangrez, an Indian restaurant in London, claimed that his refusal to serve halal meat led to a targeted campaign of fake reviews and backlash, contributing to the decision to shut shop after 16 years in business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-pm-wouldve-died-if-not-for-me-trumps-fresh-india-pak-ceasefire-claim-2873916-2026-02-25",
      "headline": "Trump's new India-Pak truce claim, says Sharif told him 35 million would've diedIn a bombshell revelation, US President Donald Trump claimed that Pakistan PM Shehbaz Sharif told him that 35 million people would have died in India's Operation Sindoor had he not intervened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/jobs/story/corporate-india-leadership-millennials-gen-z-ai-disruption-educ-2874051-2026-02-25",
      "headline": "Millennials are fired. Gen Z isn't interested. Who will lead corporate India?Corporate India faces a leadership crisis as millennials struggle with job insecurity and Gen Z redefines ambition. The future demands a new model blending AI fluency with collaborative and purpose-driven leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/started-5-years-ago-anthropic-now-more-valuable-than-infosys-wipro-tcs-hcl-combined-2873654-2026-02-25",
      "headline": "Started 5 years ago, Anthropic now worth more than Infosys, TCS, Wipro, HCLAnthropic is an AI giant and a boogeyman as far as Indian IT industry is concerned. Yet, the surprising fact is that this is a 5-year-old company. In these five years it has gone from being a safety-focused AI startup to a $380 billion behemoth, now worth more than Indian tech giants TCS, Infosys, Wipro and HCLTech combined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-israel-visit-live-prime-minister-benjamin-netanyahu-tel-aviv-defence-cooperation-trade-ties-tel-aviv-talks-gaza-2873868-2026-02-25",
      "headline": "Live: PM Modi received by Netanyahu in Tel Aviv, gets red carpet welcomePM Modi in Israel Live Updates: Prime Minister Narendra Modi begins a two-day visit to Israel on Wednesday, aimed at strengthening bilateral defence and trade ties against the backdrop of ongoing tensions in the Middle East, including the worsening relationship between the United States and Iran. PM Modi is scheduled to address Israel's Parliament, hold wide-ranging talks with his Israeli counterpart Benjamin Netanyahu, and meet President Isaac Herzog. Enhancing overall defence and security cooperation will be a key focus of the delegation-level discussions between the two prime ministers. Netanyahu is also set to host a private dinner for Modi on Wednesday evening. Stay tuned to India Today as we bring you the latest on PM Modi's Israel visit.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-wedding-prime-minister-modi-wishes-2026-2873990-2026-02-25",
      "headline": "PM Modi sends wedding wishes for Rashmika and Vijay: Divinely scripted chapterPrime Minister Narendra Modi has extended a heartfelt note of congratulations to actors Vijay Deverakonda and Rashmika Mandanna on the occasion of their wedding, scheduled to take place on February 26, 2026, in Udaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-sentae-condemns-israel-hexagon-alliance-threat-to-muslim-ummah-ahead-of-pm-modi-visit-2874013-2026-02-25",
      "headline": "Threat to Muslim Ummah: Israel's Hexagon plan with India spooks PakFollowing Israeli PM Benjamin Netanyahu's proposal to launch an anti-radical Hexagon alliance, including India, the Pakistani Parliament's Senate has rushed to unanimously pass a resolution. The resolution tabled by a PPP leader, which is part of PM Shehbaz Sharif's ruling coalition, described the alliance as a threat to the integrity and unity of the Muslim Ummah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/video-stuck-in-flight-for-4-hours-in-chennai-indigo-passengers-lash-out-at-crew-2874192-2026-02-25",
      "headline": "Video: Stuck in flight for 4 hours in Chennai, IndiGo passengers lash out at crewAn IndiGo flight from Chennai to Singapore was delayed by over four hours with passengers waiting inside the aircraft. The delay was attributed to technical issues and crew visa formalities, raising concerns about communication and operational challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-medical-negligence-artery-forceps-inside-woman-veena-george-cpim-government-health-ministry-2873169-2026-02-25",
      "headline": "Does Kerala's celebrated health system need urgent treatment?Kerala's public healthcare system – long regarded as one of the most robust in India – has come under intense scrutiny in recent months following a series of alleged medical negligence incidents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-10-science-board-exam-2026-live-exam-tips-paper-analysis-student-reaction-question-paper-2873928-2026-02-25",
      "headline": "Live: Was the paper tougher this year? Full analysis hereThe CBSE Class 10 Science exam 2026 was held on February 25, with students across the country describing it as easier than the recent Mathematics paper and largely similar in difficulty to last year, featuring balanced questions from Physics, Chemistry, and Biology based mainly on NCERT concepts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-10-minute-house-help-apps-replace-the-traditional-bai-2873765-2026-02-25",
      "headline": "India's 10-minute house help craze is growing, but the math is not math-ingUrban India has a new craze. No surprises here, this one too caters to its never-ending appetite for convenience. This time, it involves using apps to call a house help to your doorstep within 10 minutes. At the moment, workers enrolling on these apps are benefiting significantly. Customers are too, thanks to heavily discounted pricing. But for how long?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/goa-thar-accident-delhi-man-case-fir-rash-driving-accident-rented-car-2874072-2026-02-25",
      "headline": "Delhi teen named in Goa Thar crash case, claims of seat swap to save woman driverA speeding Mahindra Thar allegedly driven by a teenager crashed into a car in Goa, killing a 65-year-old man. Locals claimed that after the accident, he switched seats to shield a woman."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/venezuelas-oil-comeback-massive-super-tankers-headed-to-indian-refineries-2873859-2026-02-25",
      "headline": "Venezuela sends mega 2-million-barrel oil cargoes to India as exports surgeVenezuela has chartered its first supertankers since easing US sanctions, boosting crude exports to India as refiners seek discounted heavy oil and diversify away from Russian supplies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-undroppable-politics-insurance-policy-mike-hesson-t20-world-cup-2874062-2026-02-25",
      "headline": "Babar Azam 'undroppable' due to politics; Hesson using him as 'insurance': VaughanFormer England captain Michael Vaughan said Babar Azam remains undroppable in Pakistan's T20 World Cup 2026 campaign due to internal dynamics, but praised coach Mike Hesson for using him smartly as an \"insurance policy.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-team-make-big-solar-discovery-that-could-hit-earths-satellites-gps-aditya-l1-2874169-2026-02-25",
      "headline": "Indian team makes big solar discovery that could save satellites, GPSJust as a supersonic aircraft creates a sonic boom when it breaks the sound barrier, fast-moving CMEs from the Sun generate shock waves in space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/iits-cross-campus-ug-mobility-across-23-campuses-pros-and-cons-2874155-2026-02-25",
      "headline": "One IIT system, 23 campuses: Is India moving towards a national IIT university?The IITs are planning to allow undergraduate students to study across all 23 campuses with credit transfer. The move promises cross-campus mobility, academic flexibility, interdisciplinary exposure and reduced JEE pressure. But questions remain on implementation, seat balance, and whether the reform will go beyond a limited exchange model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/section-on-judicial-corruption-to-be-dropped-from-ncert-textbook-say-sources-after-supreme-court-rap-2874160-2026-02-25",
      "headline": "Judicial corruption section to be dropped from NCERT textbook, say sourcesThis came after the Supreme Court called it a \"deep-rooted\" attack on the judiciary, saying that it could not allow the integrity of the institution to be questioned."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/himachal-pradesh/story/shimla-hospital-shocker-dog-roams-with-severed-limb-in-mouth-probe-ordered-2874224-2026-02-25",
      "headline": "Shimla hospital shocker: Dog roams with severed limb in mouth; probe orderedA hospital meant for healing turned into a scene of horror as a stray dog padded across the campus, a severed human leg dangling from its jaws."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-keshav-maharaj-west-indies-t20-world-cup-super-8-ahmedabad-venue-adaptation-2874314-2026-02-25",
      "headline": "Adaptation is key: South Africa's Maharaj plays down Ahmedabad's familiarity advantage SA vs WI, T20 World Cup 2026 Super 8s: South Africa spinner Keshav Maharaj says adaptation, not venue familiarity, will be key when the Proteas face West Indies in a crucial T20 World Cup Super 8 clash in Ahmedabad on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-live-score-super-8s-t20-world-cup-colombo-2874290-2026-02-25",
      "headline": "NZ vs SL Super 8 Live Score: Sri Lanka bowl first, Asalanka replaces Mishara New Zealand (NZ) vs Sri Lanka (SL), T20 World Cup Super 8 Live Score: Sri Lanka have won the toss and opted to bowl in Colombo. Charith Asalanka has replaced Kamil Mishara for the co-hosts, while the Kiwis brought in Cole McConchie for James Neesham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-vs-karnataka-day-2-report-2874280-2026-02-25",
      "headline": "Ranji Trophy final: J&K tighten grip on bad light-hit Day 2 against Karnataka Jammu and Kashmir deepened Karnataka's troubles by piling up 527 for six, taking firm control of the Ranji Trophy final before bad light brought an early end to Day 2 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-zim-sanju-samson-rinku-singh-abhishek-sharma-t20-world-cup-2874202-2026-02-25",
      "headline": "Will Samson play vs Zimbabwe? Batting coach hints at change in batting order T20 World Cup: Will India change their batting line-up in their do-or-die clash? After India's disaster against South Africa. India batting coach Sitanshu Kotak hinted that there might be changes in the batting order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20i-rankings-abhishek-sharma-retains-no1-spot-ishan-kishan-top-five-2874196-2026-02-25",
      "headline": "Abhishek Sharma retains top rank despite poor form, Ishan Kishan breaks into top 5 Star opener Abhishek Sharma retained his No. 1 spot despite his horrible run in the ongoing T20 World Cup. At the same time, wicketkeeper-batter Ishan Kishan stormed into the top five of the latest International Cricket Council (ICC) Men's T20I Player Rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cheating-allegations-chess-world-champion-d-gukesh-denies-claims-addresses-ethics-2874131-2026-02-25",
      "headline": "Gukesh slams Kramnik over cheating allegations in chess: Not supportive of it World chess champion D Gukesh distances himself from Vladimir Kramnik's allegations of widespread cheating in chess, emphasising his opposition to unethical play but urging the chess community to avoid overreacting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-zimbabwe-rinku-singh-return-father-health-emergency-2874142-2026-02-25",
      "headline": "Rinku Singh to rejoin India squad ahead of ZIM clash after family emergency T20 World Cup: Rinku Singh is set to rejoin the India squad ahead of their crucial Super 8 clash against Zimbabwe on Thursday, February 26 after tending to a family emergency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-salman-agha-family-online-abuse-pakistan-loss-vs-england-2874104-2026-02-25",
      "headline": "Pakistani fans target Salman Agha's family after heartbreaking loss to England Pakistan captain Salman Ali Agha's wife, Sabba Manzer, has alleged that she and her son were subjected to online abuse by Pakistani cricket fans following the team's defeat to England in the ICC T20 World Cup 2026 on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-england-vs-pakistan-harry-brook-press-conference-ashes-2874100-2026-02-25",
      "headline": "Brook happy to reap rewards of hard work as England captain after tough winter T20 World Cup: Harry Brook said he is happy to put behind him a tough winter and reap the rewards of the hard work he has put in after guiding England to the semi-final of the T20 World Cup. Brook scored a fantastic hundred to help England reach the semi-final of the T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-loss-ravi-shastri-tactical-change-2874095-2026-02-25",
      "headline": "T20 World Cup: Ravi Shastri calls South Africa loss a timely shake-up for India Former India head coach Ravi Shastri feels India's 76-run hammering by South Africa in the Super Eights of the ICC Men's T20 World Cup could prove to be a timely wake-up call rather than a decisive setback to their semi-final chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-undroppable-politics-insurance-policy-mike-hesson-t20-world-cup-2874062-2026-02-25",
      "headline": "Babar Azam 'undroppable' due to politics; Hesson using him as 'insurance': Vaughan Former England captain Michael Vaughan said Babar Azam remains undroppable in Pakistan's T20 World Cup 2026 campaign due to internal dynamics, but praised coach Mike Hesson for using him smartly as an \"insurance policy.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-karnataka-vs-jammu-and-kashmir-paras-dogra-headbutt-kv-aneesh-2874069-2026-02-25",
      "headline": "Ranji Trophy final: Tempers flare as J&K skipper headbutts Karnataka's KV AneeshRanji trophy final: Tempers flared during the Ranji Trophy final as Jammu and Kashmir skipper Paras Dogra was involved in a heated altercation with Karnataka's KV Aneesh. Dogra headbutted Aneesh with players and officials stepping in to defuse the situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-sanjay-manjrekar-mocks-gambhir-sundar-2874036-2026-02-25",
      "headline": "Sanjay Manjrekar mocks Gautam Gambhir's tactics after South Africa thrashingFormer India cricketer Sanjay Manjrekar criticised head coach Gautam Gambhir for what he described as puzzling tactical decisions during the Super 8 clash against South Africa, where the defending champions crashed to a 76-run defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-india-t20-world-cup-2026-axar-patel-drop-strategy-criticism-2874025-2026-02-25",
      "headline": "Gambhir, no more experiments please: Can India coach solve the T20 World Cup woes?T20 World Cup: As India find themselves in a tricky spot in the T20 World Cup 2026, the spotlight and pressure once again fall on Gautam Gambhir. With the experience on his side, can the India coach turn the tide and salvage India's faltering campaign?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-ex-wife-return-rs-57-crore-extortion-trickery-2874007-2026-02-25",
      "headline": "Court orders Dhawan's ex-wife to return Rs 5.7 cr, cites extortion and trickeryFormer India cricketer Shikhar Dhawan won a major legal battle as a Delhi family court ordered his ex-wife to return Rs 5.7 crore, declaring the property settlement null and void due to extortion and fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/hope-new-zealand-lose-shaheen-admits-pakistans-semifinal-hopes-out-of-their-hands-2873988-2026-02-25",
      "headline": "Hope New Zealand lose: Shaheen admits Pakistan's semifinal hopes out of their handsHere's the full transcript of Shaheen Afridi's press conference after the Super 8 clash between Pakistan and England in Pallekele. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-promotion-india-batting-collapse-t20-world-cup-2026-anil-kumble-2873976-2026-02-25",
      "headline": "Trust Hardik Pandya: Kumble says promote India all-rounder in case of another collapseT20 World Cup: Anil Kumble said that India should trust Hardik Pandya and promote him up the order if they suffer another batting collapse during the T20 World Cup 2026. Hardik has a brilliant record coming in at No.4 and No.5 in T20Is for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-england-shaheen-afridi-harry-brook-t20-world-cup-super-8-pallekele-semifinal-2873973-2026-02-25",
      "headline": "PAK vs ENG, Super 8s: Shaheen Afridi in awe of Harry Brook's heroics in PallekelePAK vs ENG, T20 World Cup 2026: Pakistan pacer Shaheen Afridi praised Harry Brook's match-winning century as \"the best innings of his life\" after England secured a thrilling semifinal berth in Pallekele.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-axar-patel-washington-sundar-ravi-shastri-t20-world-cup-super-8-zimbabwe-team-selection-2873966-2026-02-25",
      "headline": "Axar or Sundar? Why not both says Shastri ahead of India's do-or-die Super 8s clashIND vs ZIM, T20 World Cup Super 8s: Former India coach Ravi Shastri advocates playing both Axar Patel and Washington Sundar against Zimbabwe, saying the team needs an extra bowling option after their loss to South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-spin-practice-chepauk-vs-zimbabwe-t20-world-cup-abhishek-samson-gambhir-2873929-2026-02-25",
      "headline": "Turning the tide in Chennai: Inside India's 4-hour grind against absence of paceT20 World Cup: With Rinku Singh absent and Zimbabwe looming, India spent four hours on Tuesday evening in Chennai against spin and pace-off. The focus was on Abhishek Sharma's poise against spin and Sanju Samson's struggle for rhythm as they prepared to face Zimbabwe on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-no-3-century-england-vs-pakistan-t20-world-cup-2026-semis-2873907-2026-02-25",
      "headline": "After Pakistan hundred, will Brook continue at No.3? England captain reactsT20 World Cup: Harry Brook remains coy on the chances of him continuing at the No.3 spot after his incredible knock against Pakistan. Brook's maiden T20I hundred helped England secure a fine win to make it to the semi-finals of the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-new-zealand-super-8-t20-world-cup-semis-mitchell-santner-2873846-2026-02-25",
      "headline": "NZ vs SL, Super 8 preview: Sri Lanka look for redemption after England horrorT20 World Cup, NZ vs SL: Mitchell Santner's New Zealand and Dasun Shanaka's Sri Lanka are set to lock horns in a crucial Super 8 clash on Wednesday, with only one semifinal spot remaining from Group 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ecb-the-hundred-player-selection-performance-availability-no-nationality-pakistan-2873873-2026-02-25",
      "headline": "Amid PAK snub buzz, ECB tells Hundred teams to pick players on meritThe England and Wales Cricket Board, along with all eight franchises of The Hundred, have declared that player selection will remain rooted in performance and availability, following concerns about the potential exclusion of Pakistan players during the upcoming auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-t20-world-cup-struggle-against-spin-2873801-2026-02-25",
      "headline": "India's perennial spin conundrum: Can't play spin, now can't bowl spin?India are facing a severe conundrum in the T20 World Cup. Neither have they been able to bat well against spin, nor are they bowling it well in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-on-brendon-mccullum-masterplan-t20-world-cup-2026-eng-vs-pak-2873830-2026-02-24",
      "headline": "How Brendon McCullum's masterplan downed Pakistan in Pallekele? Harry Brook revealsHarry Brook's century helped England chase down Pakistan's 165 in the T20 World Cup Super 8 fixture and qualify for the semi-final. Following their win, Brook revealed head coach Brendon McCullum's tactical masterstroke that helped them edge past Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-qualification-scenario-t20-world-cup-2873825-2026-02-24",
      "headline": "T20 World Cup: Can Pakistan still qualify for semi-final?Pakistan were beaten by England in the Super 8s of the T20 World Cup 2026. After their loss, Pakistan are on the brink of an exit from the tournament. But, can the Cornered Tigers still qualify?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-century-england-t20-world-cup-semifinal-win-pakistan-2873816-2026-02-24",
      "headline": "Harry Brook's historic century sinks Pakistan, fires England into T20 World Cup semisT20 World Cup, ENG vs PAK: Harry Brook smashed 100 off 51 balls as England defeated Pakistan by two wickets in Pallekele to seal their place in the semifinals. With this loss, Pakistan now find themselves in a must-win situation heading into their final Super 8 clash against Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/italian-cricket-sexual-assault-probe-senior-official-suspended-t20-world-cup-2873743-2026-02-24",
      "headline": "After historic T20 WC, Italy Cricket hit with sexual assault allegations: ReportItaly Cricket has suspended an unnamed official from their federation after allegations over inappropriately touching a member of Italy's women's national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-rinku-singh-leaves-indian-team-father-hospital-2873733-2026-02-24",
      "headline": "Rinku Singh leaves India camp, returns home due to family emergencyIndia batter Rinku Singh has left the national camp and returned home following a family emergency. India Today TV has learnt that his father, Khanchand Singh, is in a serious condition and has been admitted to a local hospital in Greater Noida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-appoint-richard-pybus-new-head-coach-sri-lanka-series-2873726-2026-02-24",
      "headline": "Afghanistan name ex-Pakistan coach as head coach after Jonathan Trott departsRichard Pybus has replaced Jonathan Trott as head coach and will join the team ahead of the ODI and T20I series against Sri Lanka in March. Trott stepped down after Afghanistan's campaign in the Men's T20 World Cup."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}