{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-636-points-lower-nifty-below-24600-adani-ports-down-2-percent-2735021-2025-06-03",
      "headline": "Sensex closes 636 points lower, Nifty below 24,600; Adani Ports down 2%The S&P BSE Sensex was down by 636.24 points to close at 80,737.51, while the NSE Nifty50 fell by 174.10 points to end at 24,542. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-investment-tips-smallcap-stocks-should-you-invest-expert-view-2734964-2025-06-03",
      "headline": "Smallcap stocks are back in action again. Should you ride the wave?Since the market's low in February 2025, the Nifty50 index has risen by 12%. But the real jump has been in the mid and smallcap space. The midcap index has gone up by 20%, and the smallcap index has climbed 22% during the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-bloodbath-dalal-street-key-reasons-explained-2734954-2025-06-03",
      "headline": "Sensex tumbles 700 points: What's behind today's stock market decline?The BSE Sensex was trading 740.82 points lower at 80,632.93 at around 1:13 pm, while the NSE Nifty50 fell 187.65 points to 24,528.95. All the other Nifty sectoral indices also fell as volatility rose during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/own-property-in-india-why-you-must-fix-any-paperwork-issues-now-registration-bill-2025-2734925-2025-06-03",
      "headline": "Own property in India? Why you must fix any paperwork issues nowIn fact, for years, the biggest property scam in India has been when someone who isn't the real owner sells a property. The buyer, after paying a huge amount, later finds out they were cheated, and the actual owner was someone else all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-made-easy-here-is-simple-step-by-step-guide-to-file-income-tax-return-2734897-2025-06-03",
      "headline": "ITR filing made easy: Here's a simple step-by-step guide to file income tax returnBefore starting your income tax return, ensure you have key documents in hand. These include Form 16 from your employer, Form 26AS, the Annual Information Statement (AIS) and Tax Information Statement (TIS) from the income tax portal, and your bank statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-fy26-slow-down-further-nomura-prediction-stock-market-2734854-2025-06-03",
      "headline": "India's GDP growth may decline to 6.2% in FY26, says NomuraThe assessment, published in a research note on Monday, comes amid what the brokerage describes as a growing \"divergence\" between headline indicators like GST collections and other key economic metrics such as automobile sales and bank credit growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/prostarm-info-systems-share-price-listing-strong-market-debut-19-percent-premium-bse-nse-2734852-2025-06-03",
      "headline": "Prostarm Info Systems shares make strong D-Street debut; list at 19% premiumProstarm Info Systems share price: The stock listed at Rs 125 on the BSE, which was 19.04% higher than its issue price of Rs 105. On the NSE, the stock opened at Rs 120, marking a 14.28% premium over its issue price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-falls-sharply-today-block-deal-buzz-hyundai-weak-q4-results-2734850-2025-06-03",
      "headline": "Ola Electric shares tumble over 6% today. Here's whyBy 10:15 am, the stock was trading at Rs 50.52, down 5.9%, after reports of a large equity transaction rattled investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-fall-today-8-percent-why-reason-sbmc-stake-sale-clarification-2734844-2025-06-03",
      "headline": "Yes Bank shares fall 8% after 3 sessions of gain. Here's whyYes Bank's shares fell 7.95% to touch a low of Rs 21.43. This was a huge change from the recent trend, as the stock had risen 8.4% in the previous session and was gaining for three days in a row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-cuts-over-300-jobs-in-fresh-round-of-layoffs-report-2734843-2025-06-03",
      "headline": "Microsoft cuts over 300 jobs in fresh round of layoffs: ReportThe layoffs come just weeks after the company executed its biggest workforce reduction in recent years, signalling a deeper shift across the industry as artificial intelligence takes center stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-adani-enterprises-why-adani-group-shares-are-in-focus-today-wall-street-journal-report-links-iran-lpg-shipments-2734835-2025-06-03",
      "headline": "Adani Ports, Adani Enterprises: Why are Adani Group shares in focus today?As of 9:41 am, both Adani Ports and Adani Enterprises were the top losers on the NSE Nifty50, down 1.5% each. Other companies in the Adani portfolio also saw marginal declines in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nse-shares-surge-in-unlisted-market-amid-ipo-buzz-heres-what-analysts-say-2734826-2025-06-03",
      "headline": "NSE shares surge in unlisted market amid IPO buzz. Here's what analysts sayWith over one lakh retail shareholders, a record for any unlisted Indian company, NSE has become a hotspot in the grey market. But analysts tracking the unlisted space suggest the rally may not be over just yet."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathi-denies-kamal-haasan-collaboration-language-concerns-2734970-2025-06-03",
      "headline": "Pankaj Tripathi denies being part of Kamal Haasan's Thug LifeActor Pankaj Tripathi has dismissed rumours of working with Kamal Haasan in 'Thug Life'. He stresses his preference for Hindi-speaking roles citing difficulty with other languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-close-to-taare-zameen-par-son-junaid-struggle-with-dyslexia-2734960-2025-06-03",
      "headline": "Aamir Khan on why Taare Zameen Par was personal: Junaid is dyslexicAamir Khan recently recalled his son Junaid's struggle with dyslexia. The actor spoke about how the story of 'Taare Zameen Par' (2007) resonated with him because of personal experiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-exit-no-entry-2-scheduling-issues-anees-bazmee-2734942-2025-06-03",
      "headline": "Anees Bazmee reacts to Diljit Dosanjh's exit from No Entry 2Anees Bazmee clarified that Diljit Dosanjh's exit from 'No Entry 2' was due to scheduling conflicts. The director remained hopeful the issue would be resolved and filming would begin soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-with-malti-marie-and-nick-jonas-2734974-2025-06-03",
      "headline": "Priyanka Chopra shares adorable family moments with Malti and Nick Jonas. See picsPriyanka Chopra shared heartwarming family moments with Nick Jonas and their daughter Malti Marie on Instagram. The adorable photos gave fans a peek into their quality time together during her break from work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-naidu-trailer-rana-daggubati-arjun-rampal-lock-horns-in-crime-action-thriller-2734944-2025-06-03",
      "headline": "Rana Naidu trailer: Rana Daggubati-Arjun Rampal lock horns in crime action-thrillerThe trailer of 'Rana Naidu' unveiled on June 3, brings back the world of crime, deceit, rivalry and human complexities. Arjun Rampal joins the sequel as Rana Daggubati's arch rival in the high-octane action-thriller series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-remembers-sushant-singh-rajput-16-years-of-pavitra-rishta-2734930-2025-06-03",
      "headline": "Ankita Lokhande recalls moments with Sushant Singh RajputAnkita Lokhande celebrated 16 years of 'Pavitra Rishta' with a special vlog, revisiting memories and honouring her late co-actor Sushant Singh Rajput. She shared how Sushant supported and taught her acting during their early days on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-kannada-born-out-of-tamil-remark-taken-out-of-context-2734934-2025-06-03",
      "headline": "Statement misunderstood: Kamal Haasan after court's rebuke on Kannada remarkActor Kamal Haasan has addressed a letter to the President of Karnataka Film Chamber of Commerce in the ongoing language row. In his statement, he stated that his words had been taken out of context."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vishal-jethwa-on-janhvi-kapoor-ingores-ishaan-khatter-at-cannes-2734882-2025-06-03",
      "headline": "Vishal Jethwa on Janhvi ignoring Ishaan at Cannes: She'd never be disrespectfulActor Vishal Jethwa has reacted to the viral Cannes Film Festival video which led to speculation about his co-stars Janhvi Kapoor and Ishaan Khatter's dynamics. He addressed claims about the alleged rift between the duo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/great-indian-kapil-show-kickstarts-shoot-with-metro-in-dino-cast-kapil-sharma-2734905-2025-06-03",
      "headline": "The Great Indian Kapil Show shoot kickstarts with Metro In Dino castKapil Sharma, along with his team, is all set to begin shooting for their first episode with the cast of the upcoming film, 'Metri In...Dino'. The film is set to release in theatres on July 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-to-drop-emotional-distress-claims-against-justin-baldoni-2734848-2025-06-03",
      "headline": "Blake Lively to drop emotional distress claims in Justin Baldoni lawsuitActor Blake Lively has requested to drop her emotional distress claims against Justin Baldoni amid their legal dispute. The move follows Baldoni's team seeking access to her medical records. The court will decide whether she must share mental health information or have the claims dismissed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-saki-saki-hook-step-american-singer-ciara-2734895-2025-06-03",
      "headline": "Nora Fatehi teaches Saki Saki hook step to American singer Ciara. WatchNora Fatehi's video where she is teaching American singer Ciara the iconic 'Saki Saki' hook step has gone viral. Sharing the clip, Nora asked fans if they should drop a dance video together.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-to-undergo-cancer-surgery-today-shoaib-ibrahim-asks-fans-to-pray-2734893-2025-06-03",
      "headline": "Dipika Kakar to undergo cancer surgery today, Shoaib Ibrahim asks fans to prayActor Dipika Kakar is set to undergo cancer surgery today, June 3. Her husband, actor Shaib Ibrahim, informed fans about the same with a post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-season-2-release-date-cast-plot-details-all-you-need-to-know-2734864-2025-06-03",
      "headline": "Nobody Wants This Season 2 release date, cast, plot details - all you need to knowIn 'Nobody Wants This Season 1', Adam Brody's Noah and Kristen Bell's Joanne fall in love and try to navigate through their independent identities and family dynamics together. In Season 2, they will face more challenges, and of course, new characters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-release-date-december-5-teaser-june-16-2734861-2025-06-03",
      "headline": "Prabhas's long-delayed film The Raja Saab's release date out, teaser on June 16The release date of Prabhas's much-anticipated film, 'The Raja Saab', directed by Maruthi, is out. The makers announced that the teaser will be out this month with the film's release scheduled for December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedang-raina-25th-birthday-celebrations-girlfriend-khushi-kapoor-aaliyah-kashyap-2734858-2025-06-03",
      "headline": "Vedang Raina's 25th birthday celebrations with girlfriend Khushi, friends. See picsActor Vedang Raina celebrated his 25th birthday with girlfriend Khushi Kapoor. A picture of the duo from the midnight celebrations has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tv-actor-vibhu-raghave-dies-of-cancer-addite-malik-saumya-tandon-share-details-2734830-2025-06-03",
      "headline": "TV actor Vibhu Raghave dies after battle with cancer, funeral to be held todayTV actor Vibhu Raghave died on June 2 in Mumbai after battling stage four colon cancer. Diagnosed in 2022, he shared his journey publicly. His funeral will be held on Tuesday in Jogeshwari West."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-sleep-and-fitness-routine-dinner-by-6-pm-morning-workouts-2734819-2025-06-03",
      "headline": "Kareena Kapoor, 44, lets in on fitness secrets: Dinner by 6 pm, early workoutsActor Kareena Kapoor Khan shared her sleep and fitness routine, which she follows at the age of 44. In a latest interview, she explained that she believes in early dinners and early morning workouts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-one-year-silent-break-newfound-goals-lost-weight-travel-healing-2734795-2025-06-03",
      "headline": "Pankaj Tripathi says he hasn't done any film in last 1 year. Here's whyActor Pankaj Tripathi took a quiet one-year break from films to focus on self-healing and fitness following his father's death. He also explained what prompted him to take this decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ed-sheeran-shah-rukh-khan-arijit-singh-sapphire-singer-visits-baahubali-sets-2734781-2025-06-03",
      "headline": "Ed Sheeran's Sapphire gets SRK touch, singer visits Arijit Singh, Baahubali setEd Sheeran and Shah Rukh Khan created one of the best moments on the Internet with a cute video of them singing the hookline of the singer's upcoming song, 'Sapphire'. Ed Sheeran also gave us a glimpse of his latest Indian tour."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/wont-release-thug-life-in-karnataka-for-now-kamal-haasan-to-court-after-being-rapped-over-kannada-remark-2734999-2025-06-03",
      "headline": "Kamal Haasan refuses to apologise, says won't release film in Karnataka for nowActor Kamal Haasan's counsel told the Karnataka High Court that Thug Life will not be released in the state for now, after the court questioned his lack of apology over remarks on Kannada's origins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-48-hour-strike-plan-collapsed-in-8-hours-sought-ceasefire-chief-of-defence-staff-general-anil-chauha-2735010-2025-06-03",
      "headline": "Pak's 48-hour strike plan collapsed in 8 hours, sought ceasefire: Top generalGeneral Chauhan detailed the events of May 10, stating that Pakistan had launched multiple coordinated attacks with the intent of bringing India to its knees within two days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-man-gaurav-kundi-australia-arrest-coma-police-assault-george-floyd-2734845-2025-06-03",
      "headline": "Indian-origin man in coma after Australian cop 'kneels on his neck' during arrestAn Indian-origin man in Australia is in coma with critical brain injuries after police allegedly knelt on his neck during his arrest, echoing the George Floyd case in the US.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-dossier-india-struck-more-places-operation-sindoor-propaganda-2734980-2025-06-03",
      "headline": "Pakistani dossier claims India hit more places. Propaganda?A dossier released by Pakistan, accessed by India Today, reveals India struck more places during Operation Sindoor that were not previously disclosed by Indian defence authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-punjab-kings-pbks-vs-rcb-feature-2734957-2025-06-03",
      "headline": "Can Punjab's uncapped superboys land the final blow?IPL 2025 Final, PBKS vs RCB: Prabhsimran Singh, Priyansh Arya, Nehal Wadhera, and Shashank Singh have chipped in with consistent performances, helping Punjab Kings qualify for the final for the first time in 11 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/paks-asim-munir-made-venomous-statement-about-kashmir-just-before-pahalgam-attack-chief-of-defence-staff-2734982-2025-06-03",
      "headline": "Losses not important, outcome is: Top General amid row over Op Sindoor setbacksChief of Defence Staff General Anil Chauhan, whose recent comments on setbacks during India's Operation Sindoor stirred a row, stressed on Tuesday that the outcome of the operation matters more than the losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/freedom-of-speech-doesnt-mean-you-can-hurt-religious-sentiments-high-court-to-influencer-sharmishta-panoli-2734961-2025-06-03",
      "headline": "Free speech doesn't mean hurting religious sentiments: Court to Sharmishta PanoliThe Calcutta High Court told Sharmista Panoli that freedom of speech is not absolute and her allegedly offensive video had hurt religious sentiments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-ipl-final-phil-salt-tim-david-injury-update-2734935-2025-06-03",
      "headline": "RCB vs PBKS: Will Bengaluru miss 2 key players in the IPL Final?Royal Challengers Bengaluru might miss key overseas players Phil Salt and Tim David in the IPL final. Their absence could impact RCB's strategy and chances against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/with-love-from-lucknow-meet-indian-astronaut-shubhanshu-shukla-headed-to-space-2734916-2025-06-03",
      "headline": "Meet Shuks: The IAF fighter pilot set to go to space on Ax-4 missionThe boy from Uttar Pradesh who once gazed at the skies will now live among the stars. A fighter pilot, a national pride, a space pioneer, Shubhanshu Shukla will become the first Indian astronaut to live and work on the Space Station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/canara-bank-robbery-in-karnataka-59-kg-gold-rs-52-lakh-looted-robbers-use-black-magic-doll-to-mislead-cops-2734977-2025-06-03",
      "headline": "Canara Bank heist: 59 kg gold, cash looted, black magic ruse used in KarnatakaUnidentified robbers looted 59 kg of pledged gold and Rs 5.2 lakh from a Canara Bank branch in Karnataka. The gang disabled the alarm system and used a fake key to access a specific locker. A black magic doll was left at the scene to divert the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bhagwant-mannone-nation-one-husband-jab-over-bjps-sindoor-politics-2734991-2025-06-03",
      "headline": "Bhagwant Mann's 'one nation, one husband' jab over BJP's sindoor politicsPunjab Chief Minister Bhagwant Mann took swipes at the BJP and PM Modi for what he described as attempts to solicit votes in the name of 'sindoor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarkhand-chief-minister-pushkar-singh-dhami-orders-suspension-district-magistrate-sdm-municipal-commissioner-12-officials-in-haridwar-land-scam-2734975-2025-06-03",
      "headline": "Haridwar District Magistrate among 12 suspended in Rs 54-crore land scamThe unprecedented administrative shake-up took place after a probe led by Uttarakhand administration's Sachin Ranveer submitted a comprehensive 100-page report to the government, implicating 12 officers, including two IAS officers and one state civil services officer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-thar-driver-rams-man-in-noida-after-fight-throws-him-into-drain-2734951-2025-06-03",
      "headline": "Video: Thar driver rams man in Noida after fight, throws him into drainA man was grievously injured after being hit by a Thar vehicle in Uttar Pradesh's Noida. The incident reportedly followed a prior fight, after which the accused allegedly attempted to run the victim over with the vehicle.\r\n\r\nThe victim was thrown off the road and fell into a nearby drain. A video capturing the incident has gone viral on social media, prompting police to take immediate notice.\r\n\r\nAuthorities have registered a case and formed a special team to apprehend the accused. Investigation is currently underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dmk-mp-kanimozhi-all-party-delegation-in-spain-replies-to-indias-national-language-question-2734735-2025-06-03",
      "headline": "What is India's national language, Kanimozhi was asked in Spain. She said...DMK MP Kanimozhi, who is currently in Spain, was asked about the national language of India. Her response carried a message to the world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/china-brahmaputra-water-flow-india-himanta-biswa-sarma-pakistan-threat-indus-waters-2734851-2025-06-03",
      "headline": "Even if China reduces...: Himanta Sarma shuts down Pak's Brahmaputra threatThe Assam Chief Minister's remarks come after a senior aide to the Pakistani Prime Minister cautioned that China might also weaponise the Brahmaputra's waters in support of its 'all-weather friend'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/agra-6-girls-drown-while-bathing-in-yamuna-river-4-die-two-are-in-critical-condition-2734976-2025-06-03",
      "headline": "4 girls of a family drown while bathing in Yamuna, 2 in critical conditionAt least four girls died while bathing in the Yamuna river in Agra and two are in critical condition. All six girls belong to the same extended family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/khan-sir-byah-kab-hua-conversation-with-tejashwi-yadav-goes-viral-video-2734911-2025-06-03",
      "headline": "Khan Sir's 'Byah kab hua' conversation with Tejashwi Yadav goes viral. Watch videoKhan Sir's wedding reception was held in Patna on June 2, where he formally introduced his wife to close friends and guests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/prisoners-escape-karachi-malir-jail-amid-earthquake-chaos-pakistan-jailbreak-earthquake-2734878-2025-06-03",
      "headline": "As earthquake rocks Pakistan, 200 prisoners break out of jail during evacuationOver 200 inmates of Karachi's Malir Jail took advantage of the panic during an earthquake and escaped. Videos showed absolute chaos with cops firing and inmates fleeing. One inmate died, and a probe has been launched into the massive jailbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/guv-rn-ravi-gives-assent-to-bill-allowing-nominating-persons-with-disabilities-to-local-state-municipalities-panchayats-2734908-2025-06-03",
      "headline": "Maybe he was afraid of court: Stalin's dig at Governor Ravi after assent to billsTamil Nadu Governor RN Ravi has given assent to bills allowing the nomination of persons with disabilities (PwDs) to local municipal corporations and panchayats. The assent is significant in light of the Supreme Court ruling and marks a step toward greater representation in local bodies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-magnus-carlsen-leaving-classical-chess-2734863-2025-06-03",
      "headline": "D Gukesh's classy reply to Magnus Carlsen potentially quitting classical chessLegendary Magnus Carlsen has said that he is contemplating his future in the classical chess format. Carlsen made his announcement after losing to D Gukesh in the Norway chess tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-sleep-and-fitness-routine-dinner-by-6-pm-morning-workouts-2734819-2025-06-03",
      "headline": "Kareena Kapoor, 44, lets in on fitness secrets: Dinner by 6 pm, early workoutsActor Kareena Kapoor Khan shared her sleep and fitness routine, which she follows at the age of 44. In a latest interview, she explained that she believes in early dinners and early morning workouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-air-chief-raps-delays-hal-to-hand-over-tejas-mk-1a-by-june-end-sources-2734929-2025-06-03",
      "headline": "After Air chief's rap on delays, HAL set to hand over Tejas Mk-1A this monthDelays in the supply of F404 engines from US-based GE Aerospace have pushed the Tejas Mk-1A programme over a year past its original timeline. Earlier this year too, IAF chief Air Chief Marshal AP Singh put HAL officials on blast over the delays. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-tiktoker-social-media-influencer-sana-yousuf-shot-dead-2734829-2025-06-03",
      "headline": "Teen Pakistani influencer shot dead at home, honour killing suspectedSana Yousuf, a well-known content creator from Upper Chitral who has over 4 lakh subscribers, was shot at close range by a relative who had come to visit her."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/teen-model-tijana-radonjic-plunges-to-death-parasailing-unbuckles-safety-harness-2734847-2025-06-03",
      "headline": "Model plunges 150 ft to her death after unbuckling herself while parasailingA chilling video that has gone viral shows the 19-year-old woman frantically unzipping her life jacket and unbuckling her safety harness before falling into the Adriatic Sea."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-psg-manchester-united-forbes-most-valueable-football-team-list-2735029-2025-06-03",
      "headline": "Real Madrid, United and Barcelona feature on Forbes' most valuable listAs PSG lift their first-ever Champions League trophy, Forbes reveals the world's most valuable football clubs in 2025, with Real Madrid and Manchester United still leading despite turbulent seasons on the pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-cricket-australia-bbl-2735028-2025-06-03",
      "headline": "Virat Kohli to play BBL? Cricket Australia CEO opens up on possibilitiesCricket Australia (CA) CEO Todd Greenberg stated that the presence of world-class players like Virat Kohli helps attract larger crowds and drives higher TRPs and viewership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-drake-rcb-vs-pbks-bet-2734990-2025-06-03",
      "headline": "Drake curse to hit RCB? Rapper bets on Bengaluru in IPL final vs PBKSCanadian rapper Drake has placed a massive Rs 76.4 crore bet on Royal Challengers Bengaluru ahead of the IPL final 2025. The superstition around the 'Drake Curse' adds intrigue to the high-stakes cricket showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-punjab-kings-pbks-vs-rcb-feature-2734957-2025-06-03",
      "headline": "Can Punjab's uncapped superboys land the final blow?IPL 2025 Final, PBKS vs RCB: Prabhsimran Singh, Priyansh Arya, Nehal Wadhera, and Shashank Singh have chipped in with consistent performances, helping Punjab Kings qualify for the final for the first time in 11 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-defeats-nozomi-okuhara-indonesia-open-super-1000-2734968-2025-06-03",
      "headline": "Indonesia Open: PV Sindhu enters R2, Lakshya Sen knocked outPV Sindhu triumphed over long-time rival Nozomi Okuhara to enter the second round of the Indonesia Open. Meanwhile, India's ace shuttler Lakshya Sen bowed out early."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-10-live-aryna-sabalenka-iga-swiatek-carlos-alcaraz-qinwen-zheng-2734972-2025-06-03",
      "headline": "French Open Day 10 LIVE: Aryna Sabalenka vs Qinwen Zheng underwayFrench Open Day 10 Live Updates: Aryna Sabalenka and Qinwen Zheng are up against each other in the first quarterfinal match on Tuesday. It will be followed by the match between four-time champion Iga Swiatek and Elina Svitolina, who is fresh from beating fourth seed Jasmine Paolini in the fourth round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-first-time-winners-psg-tottenham-champions-league-2734879-2025-06-03",
      "headline": "After PSG & Spurs, RCB vs PBKS could crown a season of stunning firstsThe IPL 2025 final between Royal Challengers Bengaluru and Punjab Kings could well become the latest chapter in a year defined by first-time champions — teams rewriting history after spending years on the wrong side of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-ipl-final-phil-salt-tim-david-injury-update-2734935-2025-06-03",
      "headline": "RCB vs PBKS: Will Bengaluru miss 2 key players in the IPL Final?Royal Challengers Bengaluru might miss key overseas players Phil Salt and Tim David in the IPL final. Their absence could impact RCB's strategy and chances against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-virat-kohli-final-performance-2734533-2025-06-03",
      "headline": "Can Virat Kohli improve his Knockout game as history beckons for RCB?Royal Challengers Bengaluru (RCB) star Virat Kohli is just one step away from achieving his long-standing dream of winning an IPL trophy. Over the years, he's given his sweat and blood in pursuit of his ultimate dream. However, nothing has been enough to change his destiny. As RCB march into another IPL final, Kohli has a great chance to take matters into his own hands and complete his fairy tale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pardeep-narwal-retirement-pkl-2025-unsold-auction-2734892-2025-06-03",
      "headline": "Pardeep Narwal retires after going unsold in Pro Kabaddi League auctionKabaddi star Pardeep Narwal confirmed his retirement after going unsold in the PKL 2025 auction. His next chapter focusses on coaching and nurturing future talent in kabaddi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-feature-2734866-2025-06-03",
      "headline": "The RCB remontada: How bowling, Kohli non-dependence have them on brink of IPL titleOnce considered to be two of their main weak points, RCB's bowling and non-dependence on big names have guided the franchise to their fourth IPL final. Can these two factors turn out to be the reasons for their first championship win?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-first-time-winners-psg-tottenham-champions-league-2734879-2025-06-03",
      "headline": "After PSG & Spurs, RCB vs PBKS could crown a season of stunning firstsThe IPL 2025 final between Royal Challengers Bengaluru and Punjab Kings could well become the latest chapter in a year defined by first-time champions — teams rewriting history after spending years on the wrong side of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-ipl-final-phil-salt-tim-david-injury-update-2734935-2025-06-03",
      "headline": "RCB vs PBKS: Will Bengaluru miss 2 key players in the IPL Final?Royal Challengers Bengaluru might miss key overseas players Phil Salt and Tim David in the IPL final. Their absence could impact RCB's strategy and chances against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-virat-kohli-final-performance-2734533-2025-06-03",
      "headline": "Can Virat Kohli improve his Knockout game as history beckons for RCB?Royal Challengers Bengaluru (RCB) star Virat Kohli is just one step away from achieving his long-standing dream of winning an IPL trophy. Over the years, he's given his sweat and blood in pursuit of his ultimate dream. However, nothing has been enough to change his destiny. As RCB march into another IPL final, Kohli has a great chance to take matters into his own hands and complete his fairy tale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pardeep-narwal-retirement-pkl-2025-unsold-auction-2734892-2025-06-03",
      "headline": "Pardeep Narwal retires after going unsold in Pro Kabaddi League auctionKabaddi star Pardeep Narwal confirmed his retirement after going unsold in the PKL 2025 auction. His next chapter focusses on coaching and nurturing future talent in kabaddi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-feature-2734866-2025-06-03",
      "headline": "The RCB remontada: How bowling, Kohli non-dependence have them on brink of IPL titleOnce considered to be two of their main weak points, RCB's bowling and non-dependence on big names have guided the franchise to their fourth IPL final. Can these two factors turn out to be the reasons for their first championship win?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}