{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-falls-further-as-easing-trade-tensions-dampen-appeal-2717229-2025-04-30",
      "headline": "Gold price falls further as easing trade tensions dampen appealSpot gold was down 0.2% at $3,308.32 an ounce, as of 0242 GMT. US gold futures GCcv1 lost 0.5% to $3,317.50. The dollar edged 0.1% higher against a basket of currencies, making bullion more expensive for overseas buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-falls-over-3-after-ceo-resigns-2717226-2025-04-30",
      "headline": "IndusInd Bank share price falls nearly 3% after CEO resignsSumant Kathpalia's resignation marks a dramatic turn in the bank's ongoing troubles related to internal derivatives trades that were improperly accounted for, raising questions about internal oversight and risk management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-198-points-lower-nifty-below-24300-indusind-bank-falls-2-percent-2717225-2025-04-30",
      "headline": "Sensex opens 198 points lower, Nifty below 24,300; IndusInd Bank falls 2%The S&P BSE Sensex was down 159.31 points to 80,129.07, while the NSE Nifty50 lost 43.10 points to 24,292.85 as of 9:28 am.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-stock-market-today-nse-bse-trading-what-to-expect-2717208-2025-04-30",
      "headline": "Sensex, Nifty opening: Stock markets to rise or fall today?Gift Nifty futures were trading at 24,323.5 at 8:10 am. This suggests that Nifty50 will likely start the day close to Tuesday's closing level of 24,335.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-30-trading-today-infosys-indusind-bank-adani-power-ola-electric-sbi-2717198-2025-04-30",
      "headline": "Stocks to watch on April 30: Infosys, IndusInd Bank, Adani Power, Ola ElectricThough there were worries about border tensions with Pakistan that weighed on investor sentiment, foreign investors continued to buy Indian shares, and global markets gave positive signals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mother-dairy-milk-price-hike-two-rs-litre-2717108-2025-04-29",
      "headline": "Mother Dairy raises milk prices by up to Rs 2 per litreThe price revision will be effective from April 30, 2025 across its market, a company official said on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-ceo-sumant-kathpalia-resigns-after-derivatives-accounting-lapse-2717031-2025-04-29",
      "headline": "IndusInd Bank CEO Sumant Kathpalia resigns after derivatives accounting lapseThe accounting lapse, which pertained to internal derivative trades, had a negative impact on the bank's profit and loss statement and its net worth. In his resignation letter, Kathpalia wrote, \"I undertake moral responsibility, given the various acts of commission/omission that have been brought to my notice.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-plant-starts-iphone-production-in-india-as-apple-races-to-dodge-china-tariffs-2717018-2025-04-29",
      "headline": "Tata plant begins iPhone production in India as Apple pivots from tariff-hit ChinaThe new Tata facility in Hosur, southern India, has begun rolling out older iPhone models on a single production line. Meanwhile, Foxconn's upcoming $2.6 billion factory in Karnataka's capital is expected to start trial production of the iPhone 16 series shortly, sources told the news agency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/osamu-suzuki-conferred-with-padma-vibhushan-for-his-contribution-to-auto-industry-2716895-2025-04-29",
      "headline": "Osamu Suzuki conferred with Padma Vibhushan for contribution to auto industryOsamu Suzuki, former Chairman of Suzuki Motor Corporation and ex-Director & Honorary Chairman of Maruti Suzuki India Limited, was posthumously honoured with the Padma Vibhushan, the country's second-highest civilian award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-70-points-higher-nifty-above-24300-ril-ends-2-percent-up-2716876-2025-04-29",
      "headline": "Sensex, Nifty close flat after volatile trade as border tensions weigh on marketThe S&P BSE Sensex added 70 points to close at 80,288.38, while the NSE Nifty50 just managed to end in green, adding 7.45 points to close at 24,335.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-probe-ola-electric-sales-data-february-2025-report-2716860-2025-04-29",
      "headline": "Sebi probes Ola Electric's sales data disclosures: ReportThe matter came into focus after a big gap was seen between the vehicle registration data on the government's VAHAN portal and the sales numbers shared by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-pak-tension-pakistan-economic-crisis-impact-trade-cancellation-india-pahalgam-attack-2716763-2025-04-29",
      "headline": "Terror's price tag: How the Pahalgam attack could hit Pakistan's economyAlready struggling with a weak economy, Pakistan now faces even tougher times ahead as India's retaliatory steps threaten to break crucial economic links."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-melbourne-concert-delay-700-people-wont-perform-2717235-2025-04-30",
      "headline": "Neha Kakkar refused to perform for just '700 people': Event planner calls out singerSinger Neha Kakkar allegedly refused to perform at the Melbourne concert. One of the event organisers claimed that she wasn't satisfied with the turnout of 700 people and wanted to wait till the stadium filled up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-12-detailed-report-akshay-kumar-film-rs-70-crore-strong-rs-100-crore-possible-2717218-2025-04-30",
      "headline": "Kesari 2 box office Day 12: Akshay's film Rs 70 crore strong; Rs 100 crore possible?'Kesari Chapter 2' is doing well during the weekdays, and while it is already Rs 70 crore strong, it will be interesting to see if it manages to surpass the benchmark of Rs 100 crore by the end of this weekend or next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thunderbolts-review-marvel-fun-filler-avenger-2717201-2025-04-30",
      "headline": "Thunderbolts review: Marvel's fun filler till the next Avenger dropsReleased-Thu May 01, 2025Florence Pugh simply stole the show with her performance in 'Thunderbolts*'.  The film offers a mix of entertainment and depth, making it a worthwhile addition to the franchise. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-on-wife-shalini-success-i-took-wrong-decisions-2717190-2025-04-30",
      "headline": "Ajith credits wife Shalini for his success: There were times I took wrong decisionsActor Ajith Kumar, in an exclusive interview with India Today, credited his wife Shalini for his success. He stated that she stood by him even when he took wrong decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tiktoks-delaney-rowe-sparks-romance-buzz-with-actor-bj-novak-glbs-2717180-2025-04-30",
      "headline": "TikTok's Delaney Rowe sparks romance buzz with actor B.J. NovakB.J. Novak and TikTok star Delaney Rowe are rumoured to be dating after multiple public sightings, though reps haven't confirmed. Fans on social media continue speculating about their relationship status.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/first-look-dwayne-johnson-unrecognizable-as-mark-kerr-in-the-smashing-machine-glbs-2717178-2025-04-30",
      "headline": "First Look: Dwayne Johnson unrecognizable as Mark Kerr in The Smashing MachineDwayne Johnson transforms to play MMA legend Mark Kerr in The Smashing Machine, a gritty A24 sports drama exploring fame, addiction, and resilience. The film hits theaters October 3, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ken-carson-announces-2025-arena-tour-after-more-chaos-tops-billboard-200-glbs-2717166-2025-04-30",
      "headline": "Ken Carson announces 2025 Arena tour after 'More Chaos' tops Billboard 200Following his chart-topping album More Chaos, Ken Carson announces a 30-city North American arena tour starting July 2025, marking a milestone moment in his rapidly rising hip-hop career.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sam-asghari-debuts-romance-with-brooke-irvine-at-lgbtq-hotel-opening-glbs-2717159-2025-04-30",
      "headline": "Sam Asghari debuts romance with Brooke Irvine at LGBTQ+ Hotel OpeningSam Asghari debuted his relationship with Brooke Irvine at a Puerto Vallarta LGBTQ+ hotel launch, expressing allyship, joining stars like Demi Lovato, and reflecting on life post-Britney Spears.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-fan-builds-temple-on-her-38th-birthday-in-andhra-pradesh-2717040-2025-04-29",
      "headline": "Fan builds temple for Samantha on her 38th birthday in Andhra Pradesh. WatchA temple in the name of actor Samantha has been constructed by a fan in Bapatla, Andhra Pradesh. The fan marked the actor's 38th birthday by organising a meal for orphans.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-calls-hera-pheri-deshbhakti-film-it-keeps-the-country-happy-2717016-2025-04-29",
      "headline": "Suniel Shetty calls Hera Pheri 'Deshbhakti' film: It keeps the country happyAt the trailer launch of 'Kesari Veer', Suniel Shetty shared his thoughts on 'Hera Pheri', describing it as a patriotic film. The actor stated that the movie promotes joy and mental well-being, which, in his view, embodies true 'deshbhakti'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-3-confirmed-producer-bhushan-kumar-kumar-mangat-ajay-devgn-2716965-2025-04-29",
      "headline": "Producers Bhushan Kumar and Kumar Mangat confirm Raid 3Ajay Devgn returns as the righteous officer Amey Patnaik in Raid 2, set to release on May 1, as producers confirm a third instalment is already in the works. The sequel brings a fresh cast with Riteish Deshmukh as the antagonist and Vaani Kapoor replacing Ileana D'Cruz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-on-being-honoured-with-padma-bhushan-still-plain-middle-class-at-heart-2716983-2025-04-29",
      "headline": "Ajith Kumar on Padma Bhushan honour: Still plain middle class at heartTamil actor Ajith Kumar was honoured with the Padma Bhushan on Monday. In an exclusive conversation with India Today, the 'Vidaamuyarchi' actor described the recognition as \"surreal and overwhelming\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-in-talks-with-marvel-studios-mcu-for-hollywood-debut-viral-post-sparks-buzz-2716997-2025-04-29",
      "headline": "SRK in talks with Marvel Studios for Hollywood debut? Viral post sparks buzzShah Rukh Khan is set to make his Hollywood debut. The superstar is in talks with Marvel Studios for a potential role in the MCU. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/weak-hero-class-2-sequel-park-ji-hoon-popular-drama-more-punch-less-emotion-2715917-2025-04-29",
      "headline": "Weak Hero Class 2 review: K-drama packs solid punch despite weak character arcsReleased-Fri Apr 25, 2025Weak Hero Class 2 review: Park Ji-hoon is back with a bang in the sequel to the popular K-drama adapted from manhwa, but the series compromises on character arcs to reach a hurried end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-veer-trailer-sooraj-pancholi-is-rajput-warrior-hamirji-gohil-in-period-drama-2716926-2025-04-29",
      "headline": "Kesari Veer trailer: Sooraj Pancholi is Rajput warrior Hamirji Gohil in period dramaThe trailer of 'Kesari Veer', an upcoming period drama based on the life of Hamirji Gohil, is out. The titular character is played by actor Sooraj Pancholi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-condemns-terrorism-says-some-cant-see-kashmir-progressing-post-370-2716912-2025-04-29",
      "headline": "Suniel Shetty condemns terrorism, says 'some can't see Kashmir progressing post-370'Actor Suniel Shetty talked about terrorism in Kashmir in the wake of the Pahalgam terror attack. He appreciated the government's efforts to bring normalcy and progress in the Valley, but also slammed those who don't want Kashmir to grow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-strong-reaction-to-pahalgam-terror-attack-2716910-2025-04-29",
      "headline": "Actor Nani reacts strongly to Pahalgam attack: Just take the terrorists outTelugu actor Nani, in an exclusive conversation with India Today, opened up about the Pahalgam terror attack. He said that there's only one way to combat terrorism and that is to wipe them out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-ssmb-29-look-leaked-pics-fans-reactions-2716892-2025-04-29",
      "headline": "Mahesh Babu flaunts curly long hair look for SSMB 29 in new pics, fans reactMahesh Babu's latest photos have taken over the internet. Fans were excited to see him in a never-seen-before look for his upcoming film, 'SSMB 29', with director SS Rajamouli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shoojit-sircar-squeezes-his-heart-into-tearful-note-to-irrfan-miss-jhal-muri-session-2716852-2025-04-29",
      "headline": "Miss our jhal muri: Shoojit Sircar squeezes his heart into tearful note to IrrfanOn Irrfan's fifth death anniversary, filmmaker Shoojit Sircar posted an emotional letter recalling their cherished memories and the lasting love for the late actor."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-army-ceasefire-violation-jammu-and-kashmir-pahalgam-terrorist-attack-tensions-2717182-2025-04-30",
      "headline": "Pak continues unprovoked firing along LoC for 6th straight day, Army respondsThe Pakistan Army on Tuesday night opened unprovoked fire from across the Naushera, Sunderbani, and Akhnoor sectors along the LoC in Jammu and Kashmir, marking the sixth straight day of cross-border violations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pm-modi-to-chair-super-cabinet-ccpa-ccs-meet-today-first-since-pulwama-attack-2717228-2025-04-30",
      "headline": "PM Modi to chair 'super cabinet' meet today, first since Pulwama attackPrime Minister Narendra Modi will chair key meetings of the CCPA and CCS today, following a recent terror attack in Pulwama that killed 26 people. CCPA is considered the most powerful amongst cabinet committees.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-may-launch-military-strike-within-next-24-to-36-hours-claims-pak-minister-glbs-2717168-2025-04-30",
      "headline": "Within 36 hours: Another Pak minister fears Indian retaliation over J&K attackPakistan's Information Minister Attaullah Tarar warned of a possible Indian military strike within 24 to 36 hours, citing credible intelligence. This comes amid tensions between both countries in the aftermath of the Pahalgam terror attack, which claimed 26 lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/central-kolkata-hotel-fire-killed-injured-firefighting-operations-2717183-2025-04-30",
      "headline": "14 killed in fire at Kolkata hotel, special team formed to probe causeA fire broke out at a hotel in central Kolkata, claiming 14 lives, with an official suspecting a short circuit to be the cause of the blaze. Police said the fire was brought under control and a probe was underway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-3/???#google_vignette",
      "headline": "When Kashmir turned crimson with blood of PanditsIn part 3 of our series on the history of terror in Kashmir, we revisit the winter of 1989, when the blood of Kashmiris flowed through the Valley, leading to the biggest exodus in Independent India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-urges-india-pakistan-to-not-escalate-the-situation-over-pahalgam-terror-attack-glbs-2717164-2025-04-30",
      "headline": "US sidesteps question after Pakistan Minister's 'dirty work' admissionAmid rising tensions after the Pahalgam terror attack, the US is urging India and Pakistan to avoid escalation. Secretary of State Marco Rubio plans to speak with both nations' foreign ministers as Washington pushes for peace through diplomatic channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-fresh-meet-residence-pahalgam-terror-attack-defence-minister-nsa-ajit-doval-chief-of-defence-staff-2716956-2025-04-29",
      "headline": "PM gives full operational freedom to forces for Pahalgam attack response: SourcesPrime Minister Narendra Modi's high-level meeting with the top defence establishment came as India considers options to punish those behind the April 22 Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/visakhapatnam-simhachalam-temple-wall-collapse-devotees-dead-during-chandanotsavam-andhra-pradesh-2717202-2025-04-30",
      "headline": "8 killed in wall collapse at temple in Andhra Pradesh's SimhachalamEight devotees died and several were injured after a cement wall collapsed on them while they were standing in a queue at Andhra Pradesh's Simhachalam temple. Rescue efforts are ongoing, and an enquiry has been ordered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/fake-sangeet-wedding-parties-delhi-gen-z-2717038-2025-04-30",
      "headline": "Shaadi without a couple? Welcome to Delhi's fake wedding party sceneDelhi's party scene has a new trend: fake weddings. Guests dress in ethnic wear, dance to dhol beats, and celebrate. No couple or vows needed, just the vibe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-slap-video-rinku-singh-dc-vs-kkr-2717216-2025-04-30",
      "headline": "Watch: Kuldeep Yadav slaps Rinku Singh, leaves KKR star shockedDelhi Capitals' spinner Kuldeep Yadav slapped Rinku Singh on live TV after the DC vs KKR match on Tuesday, April 29. Rinku was taken aback by the playful slap from Kuldeep and stared at him with a look of bewilderment in his eyes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/headless-poster-for-pm-congress-deletes-pahalgam-meeting-supriya-shrinate-2717095-2025-04-29",
      "headline": "Congress deletes headless poster of PM on X, 'internal row' within partyThe Congress party has deleted a headless poster of Prime Minister Narendra Modi from its official X handle, following an \"internal row\" within the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/id-like-to-be-pope-donald-trump-jokes-on-papal-succession-glbs-2717167-2025-04-30",
      "headline": "I'd like to be next Pope: Trump jokes about papal succession in viral videoUS President Donald Trump joked about wanting to be the next Pope with reporters as he left for Michigan to mark 100 days in office. The video featuring his spontaneous answer soon went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thunderbolts-review-marvel-fun-filler-avenger-2717201-2025-04-30",
      "headline": "Thunderbolts review: Marvel's fun filler till the next Avenger dropsReleased-Thu May 01, 2025Florence Pugh simply stole the show with her performance in 'Thunderbolts*'.  The film offers a mix of entertainment and depth, making it a worthwhile addition to the franchise. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashok-khemka-ias-officer-haryana-retires-robert-vadra-land-deal-57-transfers-2717215-2025-04-30",
      "headline": "57 transfers in 34 years, senior IAS officer Ashok Khemka retires todaySenior IAS officer Ashok Khemka, known for his integrity and a career spanning 34 years marked by 57 transfers, including his bold stand in the Robert Vadra land deal, is retiring today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/video/donald-trump-iconic-ymca-dance-michigan-rally-supporters-white-house-office-2717191-2025-04-30",
      "headline": "Video: Trump shows off iconic YMCA dance moves to celebrate 100 days in officeAt a rally held in Michigan to celebrate his 100 days in office, US President Donald Trump grooved to the popular YMCA song as his supporters cheered on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-china-sends-defiant-never-kneel-down-message-to-donald-trump-over-tariffs-glbs-2717171-2025-04-30",
      "headline": "China's stern 'never kneel down' video message as Trump completes 100 daysChina has released a powerful video titled 'Never Kneel Down', sending a bold message to Donald Trump that it won't bow to trade pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-techie-kills-wife-son-in-us-seattle-washington-dies-by-suicide-mysuru-entrepreneur-2717099-2025-04-29",
      "headline": "Mysuru entrepreneur, wife and son found dead at US home, murder-suicide suspectedHarshavardhana Kikkeri, a Microsoft alumnus from Mysuru, died by suicide and his wife and son were found shot dead inside their townhouse near Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-tariff-talks-going-great-think-well-have-a-deal-donald-trump-glbs-2717151-2025-04-30",
      "headline": "India tariff talks going great, think we'll have a deal: Donald TrumpUS President Donald Trump expressed optimism about ongoing US-India trade talks, citing significant progress. US Treasury Secretary Bessent also suggested that India could be among the first countries to finalise a deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/aadhaar-pan-ration-card-not-enough-government-lists-valid-citizenship-documents-2716924-2025-04-29",
      "headline": "Aadhaar, PAN, Ration Card not enough: Government lists valid citizenship documentsIndian authorities have stated that Aadhaar, PAN, and ration cards are not definitive proof of citizenship. Instead, only birth and domicile certificates are recognised as conclusive evidence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-indias-dam-build-up-powers-indus-water-pushback-to-pakistan-2716883-2025-04-29",
      "headline": "How India's dam build-up powers Indus water pushback to PakistanWith the Indus Waters Treaty suspended, New Delhi stands to leverage past decade's infra boost in the river network, with potentially grave economic consequences for Islamabad"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/nothing-cmf-phone-2-pro-quick-review-promising-upgrade-over-cmf-phone-1-2717213-2025-04-30",
      "headline": "Nothing CMF Phone 2 Pro quick review: Promising upgrade over CMF Phone 1Nothing has launched the CMF Phone 2 Pro in India. The smartphone comes with some significant upgrades over its predecessor, at least on paper. Here is India Today Tech's quick review to give you an inside look at what's in store with the new Nothing CMF Phone 2 Pro."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/harvard-university-top-pakistan-officials-after-pahalgam-terror-attack-glbs-2717160-2025-04-30",
      "headline": "Harvard faces backlash for hosting Pak officials after Pahalgam terror attackA recent Pakistan conference at Harvard's South Asia Institute drew backlash from Indian students after top Pakistani officials attended just days after the Pahalgam terror attack. Harvard later removed event details online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-airport-igi-flight-arrivals-departures-delayed-shifting-wind-patterns-runway-works-2717172-2025-04-30",
      "headline": "Flight chaos at Delhi airport as over 400 arrivals delayed for 2 days. Here's whyOn Tuesday, Delhi International Airport Ltd (DIAL) issued an advisory, stating that due to a shifting wind pattern in the vicinity of the airport, certain airline operations may experience delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/hanuman-garhi-chief-priest-mahant-das-create-history-ayodhya-ram-mandir-akshay-tritiya-2717051-2025-04-29",
      "headline": "How Hanuman Garhi priest's Ayodhya Ram Mandir visit will create historyThe chief priest of Ayodhya's Hanuman Garhi Temple, Mahant Prem Das, will break a centuries-old \"constitutional\" rule on Wednesday by leaving the temple premises to visit the newly built Ram Mandir in Ayodhya. The Mahant isn't supposed to venture out of the shrine. Here's why Das is making the historic visit and what it means."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-slap-video-rinku-singh-dc-vs-kkr-2717216-2025-04-30",
      "headline": "Watch: Kuldeep Yadav slaps Rinku Singh, leaves KKR star shockedDelhi Capitals' spinner Kuldeep Yadav slapped Rinku Singh on live TV after the DC vs KKR match on Tuesday, April 29. Rinku was taken aback by the playful slap from Kuldeep and stared at him with a look of bewilderment in his eyes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-kkr-vipraj-nigam-press-conference-axar-patel-2717214-2025-04-30",
      "headline": "IPL 2025: DC will try to make comeback and finish in top two, says Vipraj NigamDelhi Capitals all-rounder Vipraj Nigam has said that the team will try to make a comeback in their remaining matches and aim to finish in the top two after their latest loss to Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-ajinkya-rahane-injury-anukul-roy-press-conference-2717205-2025-04-30",
      "headline": "Ajinkya Rahane injury: Anukul Roy provides update on KKR skipper after DC winAnukul Roy has provided an update on KKR skipper Ajinkya Rahane, who suffered an injury during the win over DC in Delhi on Tuesday, April 29. KKR beat DC by 14 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-andre-russell-birthday-delhi-2717195-2025-04-30",
      "headline": "Andre Russell grateful to KKR for birthday special DC win: Only gift that mattersAndre Russell couldn't have asked for a better birthday as Kolkata Knight Riders sealed a high-stakes 14-run win over Delhi Capitals. The win on Tuesday, April 29, was sealed thanks to standout performances from Sunil Narine, Varun Chakravarthy, and Russell himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-vipraj-nigam-press-conference-axar-patel-2717192-2025-04-30",
      "headline": "IPL 2025: Did DC make wrong call at the toss against KKR? Vipraj Nigam reactsDC all-rounder Vipraj Nigam commented on the team's decision to bowl first at the Arun Jaitley stadium against KKR on Tuesday, April 29. Kolkata beat Delhi to remain in the hunt for a spot in the play-offs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-arsenal-vs-psg-ousmane-dembele-mikel-arteta-2717185-2025-04-30",
      "headline": "Ousmane Dembele hands PSG advantage in Champions League semi-final vs ArsenalOusmane Dembele's early goal proved to be the difference as PSG beat Arsenal 1-0 at the Emirates to take the advantage in their UEFA Champions League semi-final tie on Tuesday, April 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-withdraws-italian-open-concern-rolland-garros-2717142-2025-04-30",
      "headline": "Struggling Novak Djokovic pulls out of Rome ahead of French Open 2025Novak Djokovic's absence from the Italian Open only deepens concerns over his form and fitness ahead of the French Open, as his recent slump raises questions about what lies ahead for the tennis icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-wary-of-nothing-to-lose-csk-james-hopes-2717121-2025-04-30",
      "headline": "PBKS's James Hope wary of CSK threat: Teams with nothing to lose are dangerousIPL 2025: Despite CSK's poor form, PBKS pace coach James Hopes believes their 'nothing to lose' attitude makes them especially dangerous, as Punjab gear up for a high-stakes clash with the five-time champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-kkr-axar-patel-rues-giving-away-extra-runs-in-powerplay-2717138-2025-04-30",
      "headline": "DC vs KKR: Axar Patel provides update on injury, hopes to get fit for SRH clashDelhi Capitals captain Axar Patel regretted giving away extra runs in the powerplay after his team's 14-run loss against Kolkata Knight Riders (KKR) in Match 48 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-tri-series-india-fined-for-slow-over-rate-vs-sri-lanka-2717132-2025-04-29",
      "headline": "Women's tri series: India fined for slow over rate in opening game vs Sri LankaIndian women's cricket team has been fined for maintaining slow over rate during their opening game of the tri-series against Sri Lanka at R.Premadasa Stadium, Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-stand-in-captain-sunil-narine-playoff-hopes-alive-2717130-2025-04-29",
      "headline": "IPL 2025: KKR keep playoff hopes alive as stand-in captain Narine stuns DCStand-in skipper Sunil Narine stepped up in a must-win game, guiding KKR to a vital win over DC and keeping their playoff hopes alive in a high-pressure IPL 2025 clash in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-withdraws-italian-open-concern-rolland-garros-2717142-2025-04-30",
      "headline": "Struggling Novak Djokovic pulls out of Rome ahead of French Open 2025Novak Djokovic's absence from the Italian Open only deepens concerns over his form and fitness ahead of the French Open, as his recent slump raises questions about what lies ahead for the tennis icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-wary-of-nothing-to-lose-csk-james-hopes-2717121-2025-04-30",
      "headline": "PBKS's James Hope wary of CSK threat: Teams with nothing to lose are dangerousIPL 2025: Despite CSK's poor form, PBKS pace coach James Hopes believes their 'nothing to lose' attitude makes them especially dangerous, as Punjab gear up for a high-stakes clash with the five-time champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-kkr-axar-patel-rues-giving-away-extra-runs-in-powerplay-2717138-2025-04-30",
      "headline": "DC vs KKR: Axar Patel provides update on injury, hopes to get fit for SRH clashDelhi Capitals captain Axar Patel regretted giving away extra runs in the powerplay after his team's 14-run loss against Kolkata Knight Riders (KKR) in Match 48 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-tri-series-india-fined-for-slow-over-rate-vs-sri-lanka-2717132-2025-04-29",
      "headline": "Women's tri series: India fined for slow over rate in opening game vs Sri LankaIndian women's cricket team has been fined for maintaining slow over rate during their opening game of the tri-series against Sri Lanka at R.Premadasa Stadium, Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-stand-in-captain-sunil-narine-playoff-hopes-alive-2717130-2025-04-29",
      "headline": "IPL 2025: KKR keep playoff hopes alive as stand-in captain Narine stuns DCStand-in skipper Sunil Narine stepped up in a must-win game, guiding KKR to a vital win over DC and keeping their playoff hopes alive in a high-pressure IPL 2025 clash in Delhi."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}