{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-factors-behind-strong-rallt-2645945-2024-12-06",
      "headline": "Paytm share price hits 52-week high today. What's driving the rally?Paytm share price: The stock jumped 3.60% to hit a 52-week high of Rs 990.90 on Friday. At the closing bell, the stock settled 1.89% higher at Rs 974.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-rbi-mpc-sensex-nifty-end-flat-as-rbi-maintains-status-quo-on-interest-rates-2645938-2024-12-06",
      "headline": "Sensex, Nifty end flat as RBI maintains status quo on interest ratesThe S&P BSE Sensex lost 56.74 points to end at 81,709.12, while the NSE Nifty50 was down 30.60 points to close at 24,677.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claims-denied-zerodha-ceo-nithin-kamath-explains-why-and-what-you-can-do-2645903-2024-12-06",
      "headline": "Insurance claims denied? Nithin Kamath explains why and what you can doNithin Kamath warns that having insurance doesn't guarantee full claims and lists common rejection reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mcx-share-price-hits-rs-7000-milestone-as-stock-rallies-over-8-percent-high-volume-2645915-2024-12-06",
      "headline": " MCX share price hits Rs 7,000 milestone as stock rallies over 8%The stock has delivered an impressive growth trajectory, with gains of over 100% in the past year, over 300% in the last three years, and more than 500% over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-today-jumps-over-6-percent-explained-2645894-2024-12-06",
      "headline": "Explained: Why Vedanta share price jumped over 6% todayThe surge in stock price follows an announcement from Vedanta Resources Finance II PLC, a subsidiary of VRL, that it had redeemed the full amount of $1.2 billion in bonds due in 2025 but extended to 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcements-repo-rate-unchanged-homebuyers-may-have-to-wait-till-2025-for-emi-relief-2645893-2024-12-06",
      "headline": "RBI MPC: Homebuyers may have to wait till 2025 for EMI reliefThe RBI has kept key lending rates unchanged with Governor Shaktikanta Das explaining the Monetary Policy Committee's (MPC) focus on economic stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-crr-to-4-how-this-liquidity-boost-will-benefit-the-economy-2645873-2024-12-06",
      "headline": "RBI cuts CRR to 4%: How this liquidity boost will benefit economyThe decision to cut CRR is expected to benefit the banking sector, particularly public sector banks, by lowering the cost of funds and increasing lending capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-to-activate-uan-for-employment-linked-incentive-eli-scheme-to-december-15-2645519-2024-12-06",
      "headline": "EPFO extends deadline to activate UAN for ELI scheme. Check final dateThe EPFO has extended the deadline to link UAN and Aadhaar under the ELI scheme to mid-December, aiming to boost job creation with incentives for employees and employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-increases-upi-lite-transaction-limit-how-will-customers-benefit-upi-rule-changes-upi-lite-app-2645455-2024-12-06",
      "headline": "RBI increases UPI Lite transaction limit: How will you benefit?The RBI has increased transaction limits for UPI Lite, making digital payments more convenient, flexible, and accessible for customers, especially for low-value and offline transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-policy-repo-rate-action-crticisim-piyush-goyal-nirmala-sitharaman-2645843-2024-12-06",
      "headline": "'Our job is…': RBI Governor defends policy amid criticism over lending ratesShaktikanta Das explained that the decision to hold rates stems from a dual focus on managing inflation and supporting growth. He acknowledged the recent rise in inflation, primarily due to food prices, and the moderation in economic growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-cash-reserve-ratio-crr-understanding-rbi-liquidity-management-tool-how-will-crr-impact-economy-2645799-2024-12-06",
      "headline": "What is Cash Reserve Ratio? Understanding RBI's liquidity management toolThe RBI cut the Cash Reserve Ratio (CRR) to 4% on December 6, injecting Rs 1.16 lakh crore into the banking system to boost liquidity, credit flow, and economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-rates-unchanged-cuts-crr-to-4-what-it-means-for-stock-market-2645804-2024-12-06",
      "headline": "RBI keeps key rates unchanged, cuts CRR to 4%: What it means for stock marketAt 11:23 am, the Sensex was down 13.04 points at 81,752.82, while the Nifty50 declined 12.05 points to trade at 24,695.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-key-takeaways-lower-gdp-forecast-crr-boost-inflation-projection-new-podcast-ai-2645801-2024-12-06",
      "headline": "Lower GDP forecast to CRR boost: 6 key takeaways from RBI MPCThe MPC decided by a 4-2 majority to maintain the policy repo rate at 6.5%. Governor Shaktikanta Das explained that this decision was based on an assessment of the economy and financial conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-crr-cash-reserve-ration-reduced-to-4-percent-2645782-2024-12-06",
      "headline": "RBI reduces CRR to 4% for liquidity boost. 3 things to know The RBI MPC has kept the key lending rates unchanged to 6.5% as its focus remains on bringing inflation under control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-repo-rate-unchanged-tackling-inflation-focus-growth-2645778-2024-12-06",
      "headline": "RBI keeps key lending rate unchanged at 6.5%, focus remains on tackling inflationRBI MPC: Governor Shaktikanta Das said the Monetary Policy Committee has decided to keep the repo rate unchanged and continue with its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nisus-finance-services-ipo-check-latest-gmp-price-lot-size-last-day-to-apply-key-details-2645775-2024-12-06",
      "headline": "Nisus Finance Services IPO: Latest GMP, price, lot size, last day to applyNisus Finance Services IPO: The Nisus Finance Services IPO has been subscribed 20.30 times overall by December 5, 2024, the second day of bidding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-lower-as-markets-await-rbi-mpc-verdict-2645763-2024-12-06",
      "headline": "Sensex, Nifty open marginally lower as markets await RBI MPC verdictThe S&P BSE Sensex lost 67.62 points to 81,698.24, while the NSE Nifty50 was down 23.35 points to 24,685.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-listing-date-share-price-latest-gmp-suggest-strong-market-debut-2645753-2024-12-06",
      "headline": "Suraksha Diagnostic IPO listing: Does latest GMP suggest strong market debut?Suraksha Diagnostic IPO listing: The IPO received lukewarm interest, with an overall subscription of just 1.27 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-expectations-rbi-governor-shaktikanta-das-cut-repo-rate-december-6-2645748-2024-12-06",
      "headline": "RBI MPC announcement: Will RBI Governor Shaktikanta Das cut key lending rates?RBI MPC meeting: In the RBI MPC meet in October, the repo rate was unchanged at 6.5%, shifting the stance to 'neutral,' and holding other key rates steady."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-maharashtra-chief-minister-eknath-shidne-deputy-meeting-him-rejects-talk-of-sulk-exclusive-2645838-2024-12-06",
      "headline": "Who persuaded Eknath Shinde? What Chief Minister Devendra Fadnavis saidDevendra Fadnavis, who was sworn in as the Chief Minister for a third term, spoke on a range of topics, from how Eknath Shinde was won over and factors behind Mahayuti's massive mandate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-killed-injured-after-bus-carrying-40-passengers-collides-with-truck-on-agra-lucknow-expressway-2645936-2024-12-06",
      "headline": "8 killed, 19 injured after bus carrying 40 passengers collides with truck in UPThe bus, carrying 40 passengers, rammed into the truck in the early hours of Friday. Police and emergency teams rushed to the site and transported the injured to Saifai Medical College for treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-delhi-chalo-protest-march-demand-msp-law-justice-for-lakhimpur-victims-shambhu-border-delhi-parliament-traffic-jam-2645736-2024-12-06",
      "headline": "Marching farmers tear-gassed as they try to break barricades at Haryana border  Live UpdatesFarmers resumed their 'Dilli Chalo' march from the Punjab-Haryana Shambhu border after more than nine months and toppled barricades amid heavy security. One farmer was detained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-pink-ball-test-live-cricket-score-rohit-sharma-pat-cummins-adelaide-oval-2645746-2024-12-06",
      "headline": "2nd Test LIVE: McSweeney, Labuschagne frustrate India after Bumrah's early strikeIndia vs Australia 2nd Test Live Cricket Score: Marnus Labuschagne and Nathan McSweeney are looking comfortable at the crease having added over 50 runs for the second wicket. The duo have taken Australia's score past 50 as the Indian fast bowling unit looks heavily dependent on Bumrah to script his magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/cricket-india-pakistan-pitch-invader-attack-captain-krishnamachari-srikkanth-ripped-shirt-karachi-2645815-2024-12-06",
      "headline": "When Pakistani pitch invader ripped Indian captain's shirt, exchanged blowsAmid security concerns, the BCCI had decided against sending the Indian cricket team to Pakistan for the Champions Trophy. During the first Test in Karachi in 1989, a man shouting anti-India slogans invaded the pitch and attacked Indian captain Krishnamachari Srikkanth, ripping his shirt. Another match of the Pakistan tour had to be aborted because of unruly Pakistani fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-gurasis-singh-international-business-student-lambton-college-stabbed-death-canada-2645813-2024-12-06",
      "headline": "Indian student stabbed to death in Canada by flatmate during fight in kitchenA 22-year-old Indian student, Gurasis Singh, studying at Lambton College in Sarnia, Canada, was stabbed to death during a fight with his flatmate. The accused, 36-year-old Crossley Hunter, was arrested from the scene and charged with second-degree murder. Singh was from Punjab."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/currency-notes-found-congress-mp-abhishek-manu-singhvi-seat-routine-check-rajya-sabha-chairman-jagdeep-dhankhar-probe-2645800-2024-12-06",
      "headline": "Rs 50,000 found under Abhishek Manu Singhvi's Parliament seat, probe orderedThe claim by Jagdeep Dhankhar on the floor of the Rajya Sabha led to vociferous protests by Congress MPs. Abhishek Manu Singhvi has denied the charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-sarita-mother-maharashtra-cm-oath-ceremony-mahayuti-bjp-rss-shakhas-2645846-2024-12-06",
      "headline": "The Sarita in Devendra Sarita Gangadharrao FadnavisSarita Fadnavis used to take her teenaged son to an RSS sakha in Nagpur every day in the late 80s and early 90s. Sarita, herself a politician, set her son on a course that would give Maharashtra its Chief Minister in Devendra Sarita Gangadharrao Fadnavis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/babri-masjid-demolition-32-years-anniversary-photo-essay-2645790-2024-12-06",
      "headline": "Photo Essay: The Babri Masjid demolition, 32 years agoA moment that shook India's foundation — when religion, politics, and identity collided at Ayodhya. The Babri Masjid demolition remains a haunting echo of unresolved tensions and enduring divides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-adelaide-floodlights-turn-off-pink-ball-test-harshit-rana-reaction-2645953-2024-12-06",
      "headline": "Adelaide floodlights go off during pink-ball Test, leave India bowlers frustratedAustralia vs India, 2nd Test: The floodlights at the Adelaide Oval went off twice in an over bowled by Harshit Rana. The young pacer was frustrated at the interruption in play in the evening session on Day 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-rare-appearance-together-at-party-in-mumbai-2645773-2024-12-06",
      "headline": "Abhishek Bachchan, Aishwarya Rai pose together in rare public appearanceAishwarya Rai and Abhishek Bachchan made a rare public appearance at a star-studded party on Thursday, dazzling fans with their charm and style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-and-sobhita-dhulipalas-first-public-appearance-as-newlyweds-2645878-2024-12-06",
      "headline": "Watch: Naga Chaitanya and Sobhita Dhulipala's first public appearance as newlywedsNaga Chaitanya and Sobhita Dhulipala made their first public appearance as a married couple on Friday. They got married on December 4. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceo-brian-thompson-killer-suspect-identified-photo-flirting-evidence-search-what-we-know-so-far-2645771-2024-12-06",
      "headline": "CEO killer unmasked: Suspect snapped while flirting; bottle, phone offer cluesA key breakthrough came from a surveillance photo captured at the hostel the suspect had checked into before the murder, which briefly shows the man's face after he lowered his mask while flirting with a receptionist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-evm-hack-charge-devendra-fadnavis-latur-results-deshmukh-brothers-2645901-2024-12-06",
      "headline": "On Congress's EVM hack charge, Devendra Fadnavis cites Latur conundrumDevendra Fadnavis cited the example of the Congress's Deshmukh brothers, who contested in the twin constituencies of Latur Rural and Latur City. While one brother won, the other lost on the same day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/milk-chocolate-or-dark-chocolate-which-one-can-reduce-diabetes-2645906-2024-12-06",
      "headline": "Milk chocolate or dark chocolate: Which one can reduce diabetes risk?A Harvard study reveals that consuming one type of chocolate could help reduce the risk of type 2 diabetes by 21%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/decoding-the-gritty-and-genre-bending-korean-horror-parasite-the-wailing-2645922-2024-12-06",
      "headline": "Decoding the gritty and genre-bending Korean horrorKorean horror films often blend psychological terror with supernatural elements, creating a deeply unsettling atmosphere. With their focus on societal fears, family trauma, and ghostly spirits, these films evoke a unique blend of dread and emotional intensity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-bjps-new-poll-playbook-2024-assembly-election-results-2645503-2024-12-05",
      "headline": "The BJP's new poll playbookA more pro-active RSS, greater play to local leaders and issues, and the politics of doles help the saffron party post back-to-back wins"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-judges-breaking-bad-reference-in-denying-bail-to-drug-case-accused-2645907-2024-12-06",
      "headline": "Supreme Court judges cite Breaking Bad, Narcos to deny bail to drug case accusedA two-judge Supreme Court bench refused to grant bail to a drug case accused and drew parallels from popular web series 'Narcos' and 'Breaking Bad' to highlight the severity of the drug menace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-deploys-turkish-bayraktar-drones-india-bengal-border-terror-groups-2645741-2024-12-06",
      "headline": "Bangladesh deploys Turkish drones near border, India on high alert: SourcesSources said the Army was verifying reports on the deployment of Bayraktar TB2 unmanned aerial vehicles (UAVs) close to the border with India. These drones were recently acquired by Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/single-not-lonely-modern-indians-are-changing-the-way-people-look-at-singles-2645559-2024-12-06",
      "headline": "Single, not lonely! Modern Indians are changing the way people look at singlesUnlike how society views them – with pitiful eyes – modern Indian singles certainly don't need that 'saving' and 'help'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kavya-mehra-india-first-ai-mom-influencer-viral-instagram-posts-2645952-2024-12-06",
      "headline": "Kavya Mehra, India's first AI mom influencer, is viral. See posts Kavya Mehra, whose Instagram bio reads \"India's first AI mom, powered by real moms,\" currently has over 600 followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-banter-with-vikas-khanna-at-his-us-restaurant-is-too-cute-video-2645911-2024-12-06",
      "headline": "Indian woman's banter with Vikas Khanna at his US restaurant is too cute. VideoAkanksha and her husband, Kunal Singh, had gone to Bungalow for an authentic Indian dining experience but were pleasantly surprised when Chef Vikas Khanna himself stopped by their table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/girl-clings-from-iron-angle-after-falling-from-swing-in-up-lakhimpur-kheri-escapes-unhurt-viral-video-2645823-2024-12-06",
      "headline": "Video: UP girl dangles from 150-foot high Ferris wheel, rescuedA 14-year-old girl escaped unhurt in Uttar Pradesh's Lakhimpur Kheri after she lost her balance and dangled from a Ferris wheel approximately 150 feet high before being rescued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-ott-release-when-and-where-to-watch-suriya-bobby-deol-film-2645968-2024-12-06",
      "headline": "Kanguva OTT release: When and where to watch Suriya, Bobby Deol filmKanguva, starring Suriya and Bobby Deol, is set to premiere on Prime Video on December 8. Despite a high budget and major marketing efforts, the film struggled at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telangana-minister-bans-special-shows-after-pushpa-2-stampede-tragedy-2645939-2024-12-06",
      "headline": "Telangana government bans special shows after Pushpa 2 stampede tragedyTelangana Cinematography Minister Komatireddy Venkat Reddy announced that the government will not give permission for special shows in the state. The decision comes after a 39-year-old woman died in a stampede-like situation during Pushpa 2 premiere in Hyderabad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-pushpa-2-breaks-box-office-records-across-north-india-surpasses-hindi-hits-stree-2-animal-2645943-2024-12-06",
      "headline": "Pushpa 2 breaks box office records across North India, surpasses Hindi hitsPushpa 2 has taken the box office by storm in northern India, outperforming major Hindi releases. The film has set new records in key circuits, including Mumbai and Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/queen-of-tears-a-bloody-lucky-day-win-big-at-aaca-ata-2024-2645937-2024-12-06",
      "headline": "Queen of Tears wins big at Asian Academy Creative Awards, Asian Television AwardsQueen of Tears emerged as a major winner at the 2024 Asian Academy Creative Awards and Asian Television Awards. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-harry-brook-hundred-wellington-test-2645958-2024-12-06",
      "headline": "NZ vs ENG: Harry Brook labels Wellington hundred his 'favourite' knock so farHarry Brook claimed that his counter-attacking hundred in the Wellington Test is his favourite knock so far in his career. Brook scored 123 runs off 115 deliveries to put England in control of proceedings in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-adelaide-floodlights-turn-off-pink-ball-test-harshit-rana-reaction-2645953-2024-12-06",
      "headline": "Adelaide floodlights go off during pink-ball Test, leave India bowlers frustratedAustralia vs India, 2nd Test: The floodlights at the Adelaide Oval went off twice in an over bowled by Harshit Rana. The young pacer was frustrated at the interruption in play in the evening session on Day 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-kyle-verreynne-ab-de-villiers-record-2645955-2024-12-06",
      "headline": "Kyle Verreynne joins AB de Villiers in rare club with 3rd Test century SA vs SL: Kyle Verreynne scored an unbeaten 105 off 133 balls as South Africa made 358 in 103.4 overs in their second Test against Sri Lanka at St George's Park in Gqeberha. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-daryl-mitchell-nz-vs-eng-new-zealand-vs-england-joe-root-wellington-2645949-2024-12-06",
      "headline": "Watch: Daryl Mitchell takes one-handed stunner to dismiss Joe Root in WellingtonNew Zealand cricketer Daryl Mitchell took a stunning one-handed catch diving to his right during Day 1 of the second Test against England in Wellington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-aisa-cup-final-vaibhav-suryavanshi-stars-hammer-sri-lanka-sharjah-2645951-2024-12-06",
      "headline": "U19 Asia Cup: Suryavanshi stars as India hammer Sri Lanka to enter finalIndia powered into the U-19 Asia Cup Final, crushing Sri Lanka by seven wickets in the semi-final, with 13-year-old sensation Vaibhav Suryavanshi delivering a match-winning 67 off 36 balls to set up an emphatic chase in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-50-wickets-in-a-test-year-joins-kapil-dev-elite-list-2645940-2024-12-06",
      "headline": "Bumrah joins Kapil Dev in elite list with 50 Test wickets this yearJasprit Bumrah's stellar 2024 Test season continues to shine as he becomes the first pacer to claim 50 wickets this year, underlining his mastery and vital role in India's ongoing Border-Gavaskar Trophy campaign against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-nitish-kumar-reddy-reverse-scoop-sunil-gavaskar-adelaide-2645933-2024-12-06",
      "headline": "Nitish Reddy's reverse scoop in pink-ball Test: Gavaskar in awe of fearless starSunil Gavaskar heaped praise on Nitish Kumar Reddy after his aggressive innings on Day 1 of the pink-ball Test on Friday, December 6. Nitish's innings helped India post 180 runs in the first innings of the 2nd Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mitchell-starc-delhi-capitals-dc-ipl-2025-mega-auction-border-gavaskar-trophy-aus-vs-ind-2645913-2024-12-06",
      "headline": "Mitchell Starc engages in 'IPL banter' with Indian fans during menacing spell in AdelaideStar Australia fast bowler Mitchell Starc was seen engaging in banter with Indian fans on Day 1 of the second Test against India in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-scott-boland-australia-vs-india-border-gavaskar-trophy-2024-25-2645904-2024-12-06",
      "headline": "Watch: Nitish Reddy leaves Scott Boland dumbstruck with audacious reverse scoop sixIndia all-rounder Nitish Kumar Reddy played a magnificent reverse scoop shot against Scott Boland for a six during Day 1 of the second Test between India and Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mitchell-starc-six-wicket-haul-adelaide-pink-ball-test-2645902-2024-12-06",
      "headline": "Five-star Mitchell Starc runs riot with pink-ball, joins elite 350 clubAustralia vs India, 2nd Test: Mitchell Starc became the fourth Australian bowler to take 350 wickets across formats at home. He enjoyed bowling with the pink ball, picking up a six-wicket haul on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pat-cummins-football-save-pink-ball-test-adelaide-2645898-2024-12-06",
      "headline": "Watch: Cummins shows off football skills for acrobatic save in pink-ball TestAustralia captain Pat Cummins showed off his football skills when he pulled off an acrobatic save to stop a certain boundary during Day 1 of the pink-ball Test on Friday, December 6. Cummins got 2 wickets on Day 1 of the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-nitish-kumar-reddy-reverse-scoop-sunil-gavaskar-adelaide-2645933-2024-12-06",
      "headline": "Nitish Reddy's reverse scoop in pink-ball Test: Gavaskar in awe of fearless starSunil Gavaskar heaped praise on Nitish Kumar Reddy after his aggressive innings on Day 1 of the pink-ball Test on Friday, December 6. Nitish's innings helped India post 180 runs in the first innings of the 2nd Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mitchell-starc-delhi-capitals-dc-ipl-2025-mega-auction-border-gavaskar-trophy-aus-vs-ind-2645913-2024-12-06",
      "headline": "Mitchell Starc engages in 'IPL banter' with Indian fans during menacing spell in AdelaideStar Australia fast bowler Mitchell Starc was seen engaging in banter with Indian fans on Day 1 of the second Test against India in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-scott-boland-australia-vs-india-border-gavaskar-trophy-2024-25-2645904-2024-12-06",
      "headline": "Watch: Nitish Reddy leaves Scott Boland dumbstruck with audacious reverse scoop sixIndia all-rounder Nitish Kumar Reddy played a magnificent reverse scoop shot against Scott Boland for a six during Day 1 of the second Test between India and Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mitchell-starc-six-wicket-haul-adelaide-pink-ball-test-2645902-2024-12-06",
      "headline": "Five-star Mitchell Starc runs riot with pink-ball, joins elite 350 clubAustralia vs India, 2nd Test: Mitchell Starc became the fourth Australian bowler to take 350 wickets across formats at home. He enjoyed bowling with the pink ball, picking up a six-wicket haul on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pat-cummins-football-save-pink-ball-test-adelaide-2645898-2024-12-06",
      "headline": "Watch: Cummins shows off football skills for acrobatic save in pink-ball TestAustralia captain Pat Cummins showed off his football skills when he pulled off an acrobatic save to stop a certain boundary during Day 1 of the pink-ball Test on Friday, December 6. Cummins got 2 wickets on Day 1 of the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-jofra-archer-rajasthan-royals-rob-key-2645881-2024-12-06",
      "headline": "Why was Jofra Archer allowed to enter IPL 2025 auction? Rob Key explainsEngland managing director Rob Key has explained why they allowed Jofra Archer to enter the IPL 2025 mega auction after initially thinking about making him play in the County Championship. England wanted Archer ready for the upcoming Test schedule in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rishabh-pant-justin-langer-lsg-head-coach-ipl-2025-border-gavaskar-trophy-2645863-2024-12-06",
      "headline": "Rishabh Pant haunted me in last 2 series but now he's my mate: Justin LangerFormer Australia cricketer and Lucknow Super Giants head coach Justin Langer recalled Rishabh Pant's heroics from the last series in 2020-21 and said that he's no more his nemesis after being bought by LSG at IPL auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-rohit-sharma-number-six-return-adelaide-2645851-2024-12-06",
      "headline": "Pink-ball Test: Rohit Sharma flops on return to No.6, falls for 3 off 23 ballsRohit Sharma's return to the No.6 spot during the pink-ball Test in Adelaide ended on a sour note as he was dismissed for just 3 runs off 23 balls on Friday, December 6. Rohit was dismissed by Scott Boland as Australia continued to dominate on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pink-ball-test-virat-kohli-kl-rahul-mitchell-starc-adelaide-2645840-2024-12-06",
      "headline": "Virat Kohli flops, luck runs out for KL Rahul in chaotic 1st sessionAustralia vs India, 2nd Test: Virat Kohli failed to get going in the first innings of the pink-ball Test in Adelaide on Friday. Shubman Gill and KL Rahul were not able to convert their starts as India lost four wickets in the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-2nd-test-nz-vs-eng-harry-brook-ollie-pope-brydon-carse-nathan-smith-2645835-2024-12-06",
      "headline": "NZ vs ENG 2nd Test: Harry Brook, bowlers put England on top on Day 1 in WellingtonEngland finished Day 1 of the second Test against New Zealand on top after NZ were left reeling at 86/5 in the first innings. Earlier, Harry Brook scored his second century of the series to guide England to 280 in first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-adamant-sanjay-manjrekar-highlights-flaw-after-pink-ball-test-dismissal-2645822-2024-12-06",
      "headline": "Virat Kohli adamant? Sanjay Manjrekar highlights flaw after pink-ball Test dismissalAUS vs IND, 2nd Test: Virat Kohli departed for 7 runs in the 2nd Test. Sanjay Manjrekar called out Virat Kohli's weakness against deliveries bowled outside the off-stump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-how-is-pink-ball-different-from-red-ball-border-gavaskar-trophy-2024-25-australia-vs-india-2645793-2024-12-06",
      "headline": "Pink Ball Vs Red Ball in Test Cricket: How pink ball is different? The second Test between Australia and India is being played with a pink ball being a day/night match. Here's what makes it different from the red ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pink-ball-test-virat-kohli-kl-rahul-mitchell-starc-adelaide-2645840-2024-12-06",
      "headline": "Virat Kohli flops, luck runs out for KL Rahul in chaotic 1st sessionAustralia vs India, 2nd Test: Virat Kohli failed to get going in the first innings of the pink-ball Test in Adelaide on Friday. Shubman Gill and KL Rahul were not able to convert their starts as India lost four wickets in the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-2nd-test-nz-vs-eng-harry-brook-ollie-pope-brydon-carse-nathan-smith-2645835-2024-12-06",
      "headline": "NZ vs ENG 2nd Test: Harry Brook, bowlers put England on top on Day 1 in WellingtonEngland finished Day 1 of the second Test against New Zealand on top after NZ were left reeling at 86/5 in the first innings. Earlier, Harry Brook scored his second century of the series to guide England to 280 in first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-adamant-sanjay-manjrekar-highlights-flaw-after-pink-ball-test-dismissal-2645822-2024-12-06",
      "headline": "Virat Kohli adamant? Sanjay Manjrekar highlights flaw after pink-ball Test dismissalAUS vs IND, 2nd Test: Virat Kohli departed for 7 runs in the 2nd Test. Sanjay Manjrekar called out Virat Kohli's weakness against deliveries bowled outside the off-stump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-how-is-pink-ball-different-from-red-ball-border-gavaskar-trophy-2024-25-australia-vs-india-2645793-2024-12-06",
      "headline": "Pink Ball Vs Red Ball in Test Cricket: How pink ball is different? The second Test between Australia and India is being played with a pink ball being a day/night match. Here's what makes it different from the red ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/world-chess-championships-d-gukesh-vs-ding-liren-danger-signs-contest-draws-2645720-2024-12-06",
      "headline": "Why D Gukesh is facing danger signs in an attritional battle vs Ding LirenChess World Championship 2024: D Gukesh and Ding Liren are tied on 4.5 points each after nine games in the match. Ding Liren will play three of the remaining five games in white and the defending champion will be hoping to capitalise on the advantage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pink-ball-test-mitchell-starc-yashasvi-jaiswal-duck-sledging-2645774-2024-12-06",
      "headline": "Too slow? Mitchell Starc responds to Jaiswal sledge in style in pink-ball TestBorder-Gavaskar Trophy 2024, IND vs AUS 2nd Test: After being on the receiving end of a sledging battle in Perth, Mitchell Starc returned the punch in Adelaide, dismissing Yashasvi Jaiswal for a golden duck. Jaiswal fell for 0 in the first ball of the pink-ball Test on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-pink-ball-test-team-news-r-ashwin-shubman-gill-rohit-sharma-2645760-2024-12-06",
      "headline": "AUS vs IND: R Ashwin returns to pink-ball Test, fit-again Shubman Gill back Border-Gavaskar Trophy: Off-spinner R Ashwin returned to India's XI for the second Test in Adelaide. Fit-again Shubman Gill and Rohit Sharma also made it to the XI. Australia, as announced, made one change to the side that lost in Perth. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}