{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-airlifts-600-tons-of-iphones-from-india-to-dodge-trumps-china-tariffs-report-2706960-2025-04-10",
      "headline": "Apple airlifts 600 tons of iPhones from India to dodge Trump's China tariffsThe devices were flown out of the Chennai airport in the southern state of Tamil Nadu, where Apple has been building up production through its manufacturing partners like Foxconn and Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q4-results-dividend-announcement-today-april-9-what-to-expect-growth-us-tariff-2706944-2025-04-10",
      "headline": "TCS Q4 results to be announced today: What to expect from the IT firm?Investors and market watchers are expecting a mixed performance from the IT major. Key focus areas include operating margins, revenue growth, deal wins, employee attrition, and management commentary on guidance for the year ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-jokes-about-trump-tariffs-bring-paracetamol-and-iphone-2706925-2025-04-10",
      "headline": "Sanjeev Sanyal says tariff-hit NRI relatives calling to ask for paracetamol, iPhonesDonald Trump has hinted at imposing new tariffs on pharmaceuticals, a move that could raise costs for Indian pharmaceutical companies. This would make Indian-made generic drugs more expensive for both Americans and Indian consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-donald-trump-tariff-90-day-pause-usd-500-billion-opportunity-2706882-2025-04-10",
      "headline": "90 days, $500 billion, one big shot: India's trade gamble in Trump's tariff pauseThe pause in tariffs is seen in New Delhi as more than just goodwill; it's strategic. By sparing countries like India, the US appears to be isolating China in what is shaping up to be the most aggressive round of trade hostilities since the Covid-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-trade-war-tariff-125-percent-what-it-means-for-india-and-world-global-market-2706864-2025-04-10",
      "headline": "Explained: What US-China trade war means for India and the worldWith tariffs flying thick and fast, supply chains unravelling, and geopolitical tensions rising, India, like much of the world, finds itself watching, waiting, and bracing for impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-jumps-over-6-percent-after-donald-trump-90-day-tariff-break-ethereum-xrp-cardano-solana-dogecoin-shiba-inu-witness-price-rally-2706858-2025-04-10",
      "headline": "Bitcoin jumps over 6% after Trump's 90-day tariff break; Ethereum, XRP rallyBitcoin, along with other major cryptos like Ethereum, XRP, Cardano, Solana, and Dogecoin, etc., are witnessing a surge in their prices post US President Donald Trump's announcement of a 90-day pause on new tariff hikes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-potential-market-crash-investors-may-stay-away-for-years-2706820-2025-04-10",
      "headline": "Zerodha CEO Nithin Kamath on market crash: 'Investors may stay away for years'In 2008, the global market took a major hit with the collapse of Lehman Brothers, a global financial services firm and one of the largest investment banks in the US, causing a ripple effect around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tweet-great-time-to-buy-stock-market-advice-global-market-rally-90-day-pause-tariff-2706794-2025-04-10",
      "headline": "Should stock market investors take Donald Trump's 'buy' tip seriously?From aggressive tariffs on China to sudden pauses and vague reassurances, the whiplash is real and investors are feeling it. Markets bleed one day and bounce back the next, all thanks to a tweet or a policy pivot from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-market-wall-street-nikkei-jump-donald-trump-hits-pause-90-days-on-reciprocal-tariffs-2706732-2025-04-10",
      "headline": "Global markets jump as Donald Trump hits pause on tariffsGlobal markets rise: The S&P 500 and the Nasdaq saw their biggest daily percentage rises in over 10 years, adding over $1.5 trillion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-stock-market-close-holiday-mahavir-jayanti-sensex-nifty-no-trading-nse-bse-global-market-2706727-2025-04-10",
      "headline": "Mahavir Jayanti holiday: Are Sensex and Nifty open for trading today?Stock market holiday: According to the official stock market holiday list, Mahavir Jayanti is one of three holidays in April. The other two are on April 14 for Dr Baba Saheb Ambedkar Jayanti and April 18 for Good Friday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-to-make-his-met-gala-debut-this-year-sources-exclusive-2706954-2025-04-10",
      "headline": "Diljit Dosanjh to make his Met Gala debut this year: SourcesPunjabi superstar Diljit Dosanjh is set to make his debut at the Met Gala, marking another milestone in his illustrious career. As an ambassador for Google Pixel, he is expected to bring his unique blend of tradition and contemporary style to the iconic fashion event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bazooka-film-review-malayalam-film-for-mammookka-fans-only-swag-mammootty-2706953-2025-04-10",
      "headline": "Mammootty's Bazooka hits the mark, only if you make it to last 30 minutesReleased-Thu Apr 10, 2025Bazooka review: Mammootty delivers charisma in this digital-age thriller, blending forensic mystery, heists and gaming elements, though it struggles with pacing after a strong start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-art-of-reinventing-the-same-angry-man-in-jaat-2706440-2025-04-10",
      "headline": "Sunny Deol and the art of reinventing the angry man stereotypeSunny Deol is all set to bring back his signature same-same-but-somehow-different angry man energy in Gopichand Mallineni's Jaat. But seriously—how does he pull this off every single time? Why do audiences still root for him, cheer for him, and turn up in droves for characters that, on paper, feel almost identical? What is it about Sunny that keeps him so relevant, even when he's playing yet another rage-fuelled desi hero?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-x-reviews-fans-praise-sunny-deols-film-call-him-a-total-beast-2706946-2025-04-10",
      "headline": "Jaat X reviews: Fans praise Sunny Deol's film, call him 'a total beast'Sunny Deol's latest film Jaat has captivated audiences with its thrilling action and strong performances. The film, featuring Randeep Hooda and directed by Gopichand Malineni, is already making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/randeep-hooda-on-growing-up-watching-sunny-deol-jaat-2706920-2025-04-10",
      "headline": "From fanboy to co-star, Randeep Hooda on growing up watching Sunny DeolActor Randeep Hooda opened up about sharing screen space with Sunny Deol in the upcoming Jaat. Hooda said he grew up watching Deol's movies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-weight-loss-lean-look-mumbai-airport-fans-not-impressed-ozempic-2706918-2025-04-10",
      "headline": "Kapil Sharma flaunts weight loss, fans ask if it is because of OzempicComedian Kapil Sharma shocked fans with his significant weight loss, drawing comparisons to Karan Johar's recent transformation. Several people also speculated that he might be using Ozempic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/upcoming-ott-releases-to-watch-this-weekend-chhaava-chhorii-2-doctor-who-hacks-kingston-2706915-2025-04-10",
      "headline": "Chhaava to Chhorii 2: Upcoming OTT releases to watch this weekendThis weekend, OTT platforms are buzzing with new releases. From Chhaava to Doctor Who, there's something for every viewer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-announces-second-pregnancy-with-husband-zaid-darbar-2706912-2025-04-10",
      "headline": "Gauahar Khan announces second pregnancy with husband Zaid DarbarPopular TV actor Gauahar Khan announced her second pregnancy with husband Zaid Darbar. The couple shared a joint post on Thursday to share the good news. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/good-bad-ugly-review-ajith-film-struggles-to-balance-homage-and-storytelling-2706883-2025-04-10",
      "headline": "Good Bad Ugly review: Ajith's film struggles to balance homage and storytellingReleased-Thu Apr 10, 2025Good Bad Ugly movie review: Director Adhik Ravichandran's 'Good Bad Ugly', starring Ajith Kumar, Arjun Das and Trisha, is an action drama. The film is indeed a fan service to Ajith from the filmmaker, but where is the story?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-hiddleston-teases-about-loki-return-to-avengers-doomsday-2706888-2025-04-10",
      "headline": "Tom Hiddleston teases about Loki's return to Avengers DoomsdayBritish actor Tom Hiddleston is excited about Avengers: Doomsday. In a recent media interaction, the actor spoke about his return to the Marvel Cinematic Universe (MCU). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/om-puri-first-wife-seema-kapoor-actor-affair-with-nandita-when-she-was-pregnant-2706880-2025-04-10",
      "headline": "Om Puri's first wife recalls actor's affair when she was pregnant: I was shatteredSeema Kapoor opens up about her tumultuous marriage with late actor Om Puri, highlighting his infidelity during her pregnancy and the subsequent breakdown of their relationship. Despite her attempts to save the marriage, the emotional strain and betrayal led to a separation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bazooka-x-twitter-reviews-mammottys-film-has-nothing-impressive-fans-call-it-average-2706866-2025-04-10",
      "headline": "Bazooka X reviews: Mammotty's film has 'nothing impressive', fans call it averageMalayalam superstar Mammootty is back on the silver screen with Deeno Dennis's thriller Bazooka. The film received neutral response from fans, with some calling it an average watch, while others engaging. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/oscar-nominated-actor-mickey-rourke-says-his-career-is-in-the-toilet-2706857-2025-04-10",
      "headline": "Oscar-nominated actor Mickey Rourke says his 'career is in the toilet'Oscar-nominated actor Mickey Rourke, who is currently seen on the reality show Celebrity Big Brother, opened up about how he has not been getting any decent roles of late. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karisma-kapoor-calls-alia-bhatt-biwi-no-1-ranveer-singh-hero-no-1-after-watching-their-new-ad-2706828-2025-04-10",
      "headline": "Karisma Kapoor calls Alia Biwi No 1, Ranveer Hero No 1 after watching their new adAlia Bhatt and Ranveer Singh channelled their '90s energy in a new ad. After fans praised the duo, actor Karisma Kapoor joined in, calling them Biwi No. 1 and Hero No. 1, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-amateur-review-rami-malek-film-watchable-but-rarely-thrilling-2706799-2025-04-10",
      "headline": "The Amateur review: Rami Malek's film is watchable, but rarely thrillingReleased-Thu Apr 10, 2025The Amateur movie review: Rami Malek stars in The Amateur, a film about a CIA codebreaker turned avenger after his wife's death, navigating a world of espionage with unconventional methods. Despite a strong cast and intriguing premise, the movie struggles to deliver sustained excitement, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-on-his-friendship-with-taylor-swift-we-have-six-hour-catchups-2706786-2025-04-10",
      "headline": "Ed Sheeran on his friendship with Taylor Swift: We have six-hour catchupsEd Sheeran shared insights into his enduring friendship with Taylor Swift, recalling their time during her Red Tour. Despite busy schedules, the two remain close, cherishing their rare meet-ups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-x-twitter-reviews-ajith-kumar-trisha-krishnan-adhik-ravichandran-fans-praise-dialgues-action-sequences-2706782-2025-04-10",
      "headline": "Good Bad Ugly X reviews: Fans hail dialogues, Ajith's mass entry, call it 'peak vibe'Internet declared Ajith Kumar's Good Bad Ugly a winner. While some raved about the dialogues between him and Simran Bagga, others highlighted the mass entry scene and peppy songs. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-day-11-box-office-salman-khans-film-struggles-to-keep-up-2706760-2025-04-10",
      "headline": "Sikandar Day 11 box office: Salman Khan's film struggles to keep upSalman Khan's much-anticipated film Sikandar has seen a decline in box office earnings on its 11th day. The film now faces stiff competition from new releases - Jaat and Good Bad Ugly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-wishes-george-clooney-ajith-kumar-good-bad-ugly-release-2706754-2025-04-10",
      "headline": "Khushbhoo Sundar sends wishes to Ajith for Good Bad Ugly: My George Clooney is backKhushboo Sundar gave a shout-out to her 'George Clooney' Ajith Kumar ahead of Good Bad Ugly release. The high-octane action comedy, directed by Adhik Ravichandran, released in theatres on April 10. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-donald-trump-tariff-war-china-bad-actors-india-trade-negotiations-2706923-2025-04-10",
      "headline": "US's 'bad actors' jibe at China, says India in front on trade negotiationsSingling out China, which has been hit with a 125% tariff, the US treasury secretary said such countries were contributing to imbalances in the global economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbais-jal-vayu-vihar-kumbh-pushkar-mela-were-also-in-tahawwur-ranas-crosshairs-2706933-2025-04-10",
      "headline": "Mumbai's Jal Vayu Vihar, Kumbh Mela were also in Tahawwur Rana's crosshairsSpeaking to India Today TV, Loknath Behera, former Inspector General of the National Investigation Agency (NIA), revealed that Rana had plans to target the Kumbh Mela in Haridwar and had carried out reconnaissance at the Pushkar Mela in Rajasthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-indian-students-self-deport-what-to-do-if-visa-revoked-trump-immigration-green-card-harvard-columbia-university-2706446-2025-04-10",
      "headline": "US asking Indian students to self-deport. Here's what they can doMany Indians are among the scores of international students in American colleges and universities who have received an email stating that their visas have been revoked. Experts suggest self-deportation should be the last option. Amid fear of deportation, here's the legal recourse that students can take."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trump-tariff-tantrums-and-aapada-mein-avsar-2706872-2025-04-10",
      "headline": "Trump's Tariff Tantrums and Aapada Mein AvsarMeet Donald Trump, Agent Orange Hair. He's carpet-bombing global trade with tariffs and scorching supply chains. But for India, the global calamity brings an opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/phule-film-release-postponed-censor-board-calls-cuts-edits-after-brahmin-community-concerns-2706733-2025-04-10",
      "headline": "Pratik Gandhi's 'Phule' release postponed amid row over caste representationThe release of Ananth Mahadevan's film Phule has been delayed due to concerns from the Brahmin community about their representation in the movie. The CBFC has requested several edits, including the removal of caste-related references, before approving the film for release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-distances-itself-from-2611-mumbai-terror-attack-plotter-tahawwur-rana-after-extradition-to-india-2706879-2025-04-10",
      "headline": "He's Canadian: Pak distances itself from Tahawwur Rana after extradition to IndiaIn its first response following the extradition of 26/11 Mumbai terror attacks plotter Tahawwur Rana from the US to India, Pakistan has hastily distanced itself from the terror accused, saying that he is no longer a Pakistani citizen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-united-states-tariffs-donald-trump-pressure-blackmail-threats-will-not-work-125-per-cent-reaction-doors-open-talks-2706896-2025-04-10",
      "headline": "Doors open for talks, but blackmail won't work: China after Trump's 125% tariffsAmid an escalating tariff war, Beijing said that \"pressure, threats, and blackmail are not the right way to deal with China\", and warned that if Washington \"insists on its own way, China will follow through to the end\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-india-long-battle-nia-26-11-mumbai-terror-attacks-2706881-2025-04-10",
      "headline": "Why it took 14 years to get 26/11 plotter Tahawwur Rana to IndiaIt took nearly 14 years to get 26/11 attacks plotter Tahawwur Rana on a 17-hour flight to India from the US to face trial. Behind the scenes, India's deft diplomatic manoeuvring ensured no hiccups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/good-bad-ugly-review-ajith-film-struggles-to-balance-homage-and-storytelling-2706883-2025-04-10",
      "headline": "Good Bad Ugly review: Ajith's film struggles to balance homage and storytellingReleased-Thu Apr 10, 2025Good Bad Ugly movie review: Director Adhik Ravichandran's 'Good Bad Ugly', starring Ajith Kumar, Arjun Das and Trisha, is an action drama. The film is indeed a fan service to Ajith from the filmmaker, but where is the story?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-piyush-goyal-takes-a-jab-at-congress-says-party-fed-biryani-to-ajmal-kasab-2706863-2025-04-10",
      "headline": "Congress fed biryani to Kasab: Piyush Goyal's jibe after Tahawwur Rana extraditionRana, a Pakistani-origin Canadian national, is scheduled to land in Delhi later today after the US Supreme Court rejected his plea against extradition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-trade-war-tariff-125-percent-what-it-means-for-india-and-world-global-market-2706864-2025-04-10",
      "headline": "Explained: What US-China trade war means for India and the worldWith tariffs flying thick and fast, supply chains unravelling, and geopolitical tensions rising, India, like much of the world, finds itself watching, waiting, and bracing for impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-calls-xi-jinping-smartest-man-in-the-world-amid-ongoing-tariff-war-with-china-2706817-2025-04-10",
      "headline": "Love letter in a trade war: Trump calls Xi Jinping smartest man in the worldThe tensions flared further between the US and China when Donald Trump executed a stunning volte-face - suspending tariffs on over 75 countries in a conciliatory gesture, while simultaneously hammering Beijing with a punishing escalation, jacking up tariffs on Chinese imports to a staggering 125 per cent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/is-trump-son-running-white-house-x-account-viral-let-him-cook-post-sparks-curiosity-2706850-2025-04-10",
      "headline": "Is Trump's son running White House X account? 'Let him cook' post sparks curiosityThe post went viral with close to 7 million views as Trump made a dramatic policy reversal on Wednesday, announcing a 90-day pause on his reciprocal tariff, just 24 hours after it came into effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-intense-rivalry-rcb-vs-csk-bengaluru-2706831-2025-04-10",
      "headline": "Virat Kohli on IPL's most buzzing rivalry: Nothing Like CSK vs RCB in BengaluruIPL 2025: Virat Kohli said the buzz during Chennai Super Kings' visit to Bengaluru at the M Chinnaswamy Stadium is unmatched and adds to the theatre around the contest. RCB hammered CSK by 50 runs earlier in the season in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharbat-jihad-baba-ramdev-claims-juice-funds-used-to-build-mosques-madrasas-2706876-2025-04-10",
      "headline": "Sharbat jihad: Baba Ramdev claims juice funds used to build mosques, madrasas Ramdev claimed that a certain company sells sharbat (a traditional sweet drink), but the money earned from it is used to build madrasas and mosques. He said this while promoting Patanjali's rose sharbat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariff-pause-strategy-isolate-china-countries-dialogue-negotiation-trade-deficit-art-of-the-deal-2706725-2025-04-10",
      "headline": "Tariff trap? Trump rewards allies, punishes China in 'art of the deal' strategyWhile the decision to impose across-the-board tariffs triggered panic in financial markets, the Trump administration is now suggesting it was part of a deliberate strategy aimed squarely at isolating China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-magic-of-having-a-yellow-person-in-your-life-2706796-2025-04-10",
      "headline": "The magic of having a 'yellow person' in your lifeA 'yellow person' is someone who embodies the qualities symbolically linked to the colour yellow - brightness, warmth, and optimism. They feel like sunshine breaking through a cloudy day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-security-cell-that-held-ajmal-kasab-may-house-tahawwur-rana-next-sources-2706818-2025-04-10",
      "headline": "High-security cell that held Ajmal Kasab may house Tahawwur Rana next: SourcesAccording to sources, Tahawwur Rana may be lodged in Barrack No 12 of the Arthur Road prison — the same high-security wing where terrorist Ajmal Kasab was kept during the 26/11 trial before his execution in 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/michelle-obama-barack-obama-divorce-rumours-chose-to-do-whats-best-for-me-2706773-2025-04-10",
      "headline": "Michelle Obama opens up about divorce rumours: Chose to do what's best for meAddressing divorce rumours, Michelle Obama explained that she's simply taking more control over her schedule and prioritising personal well-being over societal expectations of women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/om-puri-first-wife-seema-kapoor-actor-affair-with-nandita-when-she-was-pregnant-2706880-2025-04-10",
      "headline": "Om Puri's first wife recalls actor's affair when she was pregnant: I was shatteredSeema Kapoor opens up about her tumultuous marriage with late actor Om Puri, highlighting his infidelity during her pregnancy and the subsequent breakdown of their relationship. Despite her attempts to save the marriage, the emotional strain and betrayal led to a separation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trumps-buy-stocks-tip-before-tariffs-pause-raises-calls-for-insider-trading-probe-2706713-2025-04-10",
      "headline": "Trump's 'good time to buy' tweet minutes before tariff pause sparks calls for probeShortly after markets opened, President Trump took to his Truth Social platform with a pair of upbeat posts. \"BE COOL! Everything is going to work out well. The USA will be bigger and better than ever before!\" he wrote, followed closely by a more direct appeal to investors: \"THIS IS A GREAT TIME TO BUY!!! DJT.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-mumbai-attacks-plotter-2611-delhi-tihar-jail-extradition-us-david-headley-2706682-2025-04-10",
      "headline": "From Pak Army doctor to 26/11 attacks plotter: Who is Tahawwur RanaTahawwur Rana, a former Pakistan Army doctor accused of plotting the 2008 Mumbai terror attacks, is set to land in Delhi on Thursday afternoon. He was arrested by the FBI in 2009 and was lodged in a prison in the US before his extradition to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/tahawwur-rana-india-us-extradition-treaty-limits-prosecution-scope-trial-conditions-2706873-2025-04-10",
      "headline": "Tahawwur Rana faces trial in India, but US treaty limits prosecution scopeAs part of the extradition treaty with US, India must ensure that Tahawwur Rana will not be tortured, will be provided adequate protection in prison, and will only be tried for the offences for which he has been extradited."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-priyansh-arya-preity-zinta-message-2706957-2025-04-10",
      "headline": "PBKS owner Preity Zinta sends heartfelt message to Priyansh Arya: His talent spokePunjab Kings owner Preity Zinta sent a heartfelt message to Priyansh Arya after his impressive knock of 103 off 42 balls against Chennai Super Kings. Priyansh broke many records as Punjab secured their third win of the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-badminton-asia-championships-2025-early-exit-2706949-2025-04-10",
      "headline": "PV Sindhu continues to struggle, crashes out in 2nd round of Asian ChampionshipsBadminton Asia Championships 2025: PV Sindhu, ranked 17, lost to third seed Akane Yamaguchi of Japan in the second round on Thursday. The two-time Olympics medallist has endured a poor run in the 2025 season.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-rcb-vs-dc-today-match-bengaluru-reactions-2706926-2025-04-10",
      "headline": "RCB vs DC LIVE: KL Rahul vs Virat Kohli in Bengaluru battleIPL 2025, Royal Challengers Bengaluru vs Delhi Capitals live score and updates from Bengaluru: An unbeaten Delhi side will look to make it four in four when they take on Bengaluru. RCB have won three in four games, but their only loss came at home. Can they find a formula to overcome their familiar problems at the M Chinnaswamy Stadium? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/portugal-joanna-child-second-oldest-t20i-debut-norway-series-2706916-2025-04-10",
      "headline": "Portugal's 64-year-old Joanna Child becomes second oldest T20I debutantJoanna Child, at 64, became the second-oldest cricketer to debut in a T20I. Despite limited impact on the scoresheet, her selection and spirit stood out in Portugal's series win, earning admiration across the cricketing world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-ms-dhoni-thala-fan-trolls-2706887-2025-04-10",
      "headline": "I will always be a Thala fan: Ambati Rayudu slams trolls over MS Dhoni commentsIPL 2025: Ambati Rayudu lashed out at criticism of his comments about MS Dhoni. In a strongly-worded post on social media, the former CSK batter hit out at trolls, saying he will continue to be a fan of 'Thala'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-r-ashwin-trolling-rcb-fans-youtube-show-2706868-2025-04-10",
      "headline": "R Ashwin on CSK criticism: Not bothered by trolls, real fans stand by playersIPL 2025: Senior off-spinner R Ashwin said he is open to constructive criticism following intense scrutiny over his slow start to the new season. AShwin has taken 5 wickets in five matches and conceded at over 9 runs per over on his return to CSK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-prince-william-fan-disects-performance-viral-video-2706842-2025-04-10",
      "headline": "Prince William channels inner Villa fan with punditry before PSG defeatPrince William's detailed analysis of Aston Villa ahead of their defeat to PSG has gone viral, with football fans praising his tactical breakdown and deep knowledge of the game. The royal was in attendance at the Parc des Princes for the Champions League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-intense-rivalry-rcb-vs-csk-bengaluru-2706831-2025-04-10",
      "headline": "Virat Kohli on IPL's most buzzing rivalry: Nothing Like CSK vs RCB in BengaluruIPL 2025: Virat Kohli said the buzz during Chennai Super Kings' visit to Bengaluru at the M Chinnaswamy Stadium is unmatched and adds to the theatre around the contest. RCB hammered CSK by 50 runs earlier in the season in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-khvicha-kvaratskhelia-project-luis-enrique-champions-league-2706816-2025-04-10",
      "headline": "Luis Enrique hails Kvaratskhelia key to PSG project after Villa heroicsLuis Enrique praised Khvicha Kvaratskhelia's match-winning display against Aston Villa, calling him a vital piece of PSG's future. The Georgian winger's impact has already been felt since his January move, helping the Parisians take a strong lead into the second leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-preview-pitch-conditions-prediction-team-news-2706788-2025-04-10",
      "headline": "IPL preview: Unbeaten Delhi Captails visit Bengaluru as RCB seek home comfortUnbeaten Delhi Capitals will be aiming to make it four wins in a row when they face Royal Challengers Bengaluru at the M. Chinnaswamy Stadium on Thursday. Two explosive sides are set for a cracking contest—one that could well be decided by the finest of margin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-borussia-dormund-not-qualified-yet-hansi-flick-champions-league-2706781-2025-04-10",
      "headline": "Barcelona have not qualified yet: Flick urges caution despite Dortmund winBarcelona head coach Hansi Flick urged caution after his side's 4-0 win over Borussia Dortmund, warning that the Champions League quarter-final tie isn't over yet. Flick stressed the need for complete focus ahead of the return leg in Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-prince-william-fan-disects-performance-viral-video-2706842-2025-04-10",
      "headline": "Prince William channels inner Villa fan with punditry before PSG defeatPrince William's detailed analysis of Aston Villa ahead of their defeat to PSG has gone viral, with football fans praising his tactical breakdown and deep knowledge of the game. The royal was in attendance at the Parc des Princes for the Champions League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-intense-rivalry-rcb-vs-csk-bengaluru-2706831-2025-04-10",
      "headline": "Virat Kohli on IPL's most buzzing rivalry: Nothing Like CSK vs RCB in BengaluruIPL 2025: Virat Kohli said the buzz during Chennai Super Kings' visit to Bengaluru at the M Chinnaswamy Stadium is unmatched and adds to the theatre around the contest. RCB hammered CSK by 50 runs earlier in the season in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-aston-villa-khvicha-kvaratskhelia-project-luis-enrique-champions-league-2706816-2025-04-10",
      "headline": "Luis Enrique hails Kvaratskhelia key to PSG project after Villa heroicsLuis Enrique praised Khvicha Kvaratskhelia's match-winning display against Aston Villa, calling him a vital piece of PSG's future. The Georgian winger's impact has already been felt since his January move, helping the Parisians take a strong lead into the second leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-dc-preview-pitch-conditions-prediction-team-news-2706788-2025-04-10",
      "headline": "IPL preview: Unbeaten Delhi Captails visit Bengaluru as RCB seek home comfortUnbeaten Delhi Capitals will be aiming to make it four wins in a row when they face Royal Challengers Bengaluru at the M. Chinnaswamy Stadium on Thursday. Two explosive sides are set for a cracking contest—one that could well be decided by the finest of margin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-vs-borussia-dormund-not-qualified-yet-hansi-flick-champions-league-2706781-2025-04-10",
      "headline": "Barcelona have not qualified yet: Flick urges caution despite Dortmund winBarcelona head coach Hansi Flick urged caution after his side's 4-0 win over Borussia Dortmund, warning that the Champions League quarter-final tie isn't over yet. Flick stressed the need for complete focus ahead of the return leg in Germany."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}