{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhojpuri-actor-pawan-singh-apologises-to-anjali-raghav-for-touching-her-inappropriately-2779493-2025-08-31",
      "headline": "Actor Pawan Singh apologises to Anjali Raghav for touching her inappropriatelyBhojpuri actor Pawan Singh has apologised to his co-star Anjali Raghav after she accused him of inappropriately touching her without consent. Singh's reaction came after Raghav shared her decision to quit the Bhojpuri industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-salman-schools-contestants-tanya-mittal-in-tears-2779491-2025-08-31",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Salman schools contestants, Tanya Mittal in tearsActor Salman Khan warned Tanya Mittal about being a soft target of Pranit More on the 'Weekend Ka Vaar' episode of 'Bigg Boss 19' on Saturday. This led Tanya to break down in tears. The episode also featured romantic moments between Mridul Tiwari and Natalia Janoszek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/mahesh-babu-takes-trip-down-memory-lane-on-son-gautam-19th-birthday-2779485-2025-08-31",
      "headline": "Mahesh Babu takes trip down memory lane on son Gautam's 19th birthday. See picActor Mahesh Babu shared an adorable throwback photo on the occasion of his son Gautam's 19th birthday. He also expressed his regret at missing his birthday this year, saying it was the only one he has ever missed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pavitra-rishta-actor-priya-marathe-dies-at-38-after-battling-cancer-2779460-2025-08-31",
      "headline": "Pavitra Rishta actor Priya Marathe dies at 38 after battling cancerActor Priya Marathe, known for her work in 'Pavitra Rishta', died in Mumbai on August 31, 2025, after her prolonged battle with cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-fulfils-late-mother-in-law-kanakaratnam-wish-of-donating-her-eyes-2779382-2025-08-31",
      "headline": "Chiranjeevi fulfils late mother-in-law Kanakaratnam's wish of donating her eyesActor Chiranjeevi fulfilled his late mother-in-law Allu Kanararatnam's last wish by donating her eyes following her death on Saturday. Allu Kanararatnam was legendary Telugu actor, Padma Shri Allu Ramalingaiah's wife and Allu Arjun, Ram Charan's grandmother. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-denies-subpoenaing-journalist-megyn-kelly-justin-baldoni-case-2779417-2025-08-31",
      "headline": "Blake Lively denies subpoenaing journalist Megyn Kelly in Justin Baldoni caseActor Blake Lively has denied subpoenaing journalist Megyn Kelly. Kelly had accused Lively of a subpoena in connection to the Justin Baldoni case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranvir-shorey-recalls-rejecting-tiger-zinda-hai-returning-for-tiger-3-out-of-anger-2779238-2025-08-30",
      "headline": "Ranvir Shorey recalls rejecting Tiger Zinda Hai, returning for Tiger 3 out of angerActor Ranvir Shorey shared that he skipped 'Tiger Zinda Hai' because of payment issues. He also recalled that despite not liking his character's portrayal in 'Tiger 3', he agreed to be part of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exclusive-kunickaa-sadanand-shuts-down-age-shaming-bigg-boss-19-calls-irrelevant-2779020-2025-08-30",
      "headline": "Kunickaa Sadanand shuts-down age-shaming on Bigg Boss 19, calls it irrelevantActor Kunickaa Sadanand recently reflected on her decision to participate in 'Bigg Boss 19', in an exclusive interview with India Today. She also shared her views on host Salman Khan's work-ethic and charisma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-do-patti-song-raanjhan-sachet-parampara-kmkz-plagiarism-claims-2779310-2025-08-30",
      "headline": "Music duo Sachet-Parampara to sue KMKZ over plagiarism claims on Raanjhan songMusic composer duo Sachet-Parampara rubbished claims of plagiarism over the 'Do Patti' song 'Raanjhan' on Sunday. They plan to sue KMKZ for defamation. They also said in a recent interview that their authorship of 'Raanjhan' has been verified by major streaming platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-comforts-son-ayaan-at-his-grandmother-allu-kanakaratnam-funeral-in-hyderabad-2779288-2025-08-30",
      "headline": "Allu Arjun comforts son Ayaan at his grandmother's funeral in HyderabadActor Allu Arjun was seen consoling his son Ayaan during the emotional farewell to his grandmother, Allu Kanakaratnam. In another video, the duo could be seen turning pallbearers along with Chiranjeevi, Ram Charan and other members of the family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariya-ganesh-chaturthi-celebration-photos-2779265-2025-08-30",
      "headline": "Tara Sutaria celebrates Ganesh Chaturthi with Veer Pahariya. See photosActor Tara Sutaria made her relationship with 'Sky Force' actor Veer Pahariya Instagram official on Sunday. The actor shared photos from the Ganesh Chaturthi celebrations on her social media account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-anjali-raghav-quits-bhojpuri-industry-after-pawan-singh-video-controversy-2779269-2025-08-30",
      "headline": "Actor Anjali Raghav quits Bhojpuri industry after Pawan Singh video controversyActor Anjali Raghav has accused Bhojpuri actor Pawan Singh of touching her inappropriately without consent. She also spoke about her decision to quit the Bhojpuri industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rajiv-adatia-defends-gaurav-khanna-cooking-bigg-boss-19-2779232-2025-08-30",
      "headline": "Rajiv Adatia defends Gaurav Khanna's decision to not cook on Bigg Boss 19Reality TV personality Rajiv Adatia defended actor Gaurav Khanna's choice to refrain from cooking on 'Bigg Boss 19'. In a recent video, he cited significant differences between cooking in 'Bigg Boss' and 'Celebrity MasterChef.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-ex-husband-bharat-takhtani-dating-meghna-lakhani-viral-pics-spark-buzz-2779203-2025-08-30",
      "headline": "Esha Deol's ex-husband Bharat Takhtani dating Meghna Lakhani? Viral pics spark buzzActor Esha Deol's ex-husband Bharat Takhtani sparked dating rumours by sharing photos with Meghna Lakhani on Instagram. The photos quickly went viral, leading to speculations of dating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-confronts-pranit-more-over-below-the-belt-jokes-on-him-2779200-2025-08-30",
      "headline": "Bigg Boss 19: Salman Khan confronts Pranit More over below-the-belt jokes on himActor Salman Khan confronted comedian Pranit More about his viral jokes on 'Bigg Boss 19'. The exchange sparked surprise among housemates and highlighted boundaries in comedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-admits-being-wronged-by-people-before-saiyaara-mohit-suri-film-2779190-2025-08-30",
      "headline": "Ahaan Panday admits being wronged by people before SaiyaaraActor Ahaan Panday opened up about dealing with multiple rejections and being wronged by people before landing a role in 'Saiyaara'. The 27-year-old expressed in a recent interview that he remained optimistic and grateful for the opportunity to assist on film sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-hugs-cousin-allu-arjun-pays-last-respect-to-grandmother-in-hyderabad-2779191-2025-08-30",
      "headline": "Ram Charan hugs cousin Allu Arjun, pays last respect to grandmother in HyderabadActor Ram Charan arrived in Hyderabad from Mysore to pay his last respects to grandmother Allu Kanakaratnam. The 94-year-old died in the early hours of Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-cook-dilip-tries-to-sell-her-iphone-aunty-kisko-bola-sunita-ahuja-sajid-khan-2779133-2025-08-30",
      "headline": "Farah Khan's cook Dilip tries to sell her iPhone for Rs 5-6K. WatchFarah Khan's cook Dilip stole the show on 'Aunty Kisko Bola' with his trademark humour. He made a brief yet impactful appearance by trying to sell an iPhone, unaware of its cost. He later ran away when an audience member reminded him of the phone's actual value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/julia-roberts-defends-metoo-themed-after-the-hunt-venice-film-festival-2779076-2025-08-30",
      "headline": "Julia Roberts defends MeToo-themed film After The Hunt at Venice Film FestivalActors Julia Roberts and Luca Guadagnino addressed questions on feminism and complicity at the Venice Film Festival. Their film 'After The Hunt' sparks debate on MeToo and challenges traditional narratives around misconduct."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-xi-jinping-as-india-china-reset-ties-amid-trumps-tariff-barrage-2779433-2025-08-31",
      "headline": "Elephant and Dragon unite, PM Modi-Xi send message to Trump amid tariff stormPrime Minister Narendra Modi met Chinese President Xi Jinping for bilateral talks on the sidelines of the SCO summit in Tianjin, seeking to recalibrate ties amid the tariff barrage unleashed by Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/committed-to-advancing-our-ties-on-mutual-trust-respect-pm-modis-message-to-xi-2779536-2025-08-31",
      "headline": "Committed to advancing our ties on mutual trust, respect: PM Modi's message to XiIn his televised opening remarks, Modi emphasised that cooperation between India and China is vital not only for the two nations but also for the welfare of 2.8 billion people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vital-to-be-friends-good-neighbours-and-dragon-and-elephant-to-come-together-xi-tells-pm-modi-2779465-2025-08-31",
      "headline": "Vital to be friends, good neighbours: Xi to PM Modi in TianjinChinese President Xi Jinping, while welcoming PM Modi to the SCO Summit in China, emphasised the importance of China-India cooperation amid a rapidly changing global landscape. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/urgent-action-bold-innovation-the-race-to-rescue-indias-disappearing-glaciers-2778902-2025-08-31",
      "headline": "The race to rescue India's disappearing glaciersGlaciers across the world are witnessing unprecedented change as the planet becomes warmer and temperatures continue to climb under the influence of human-induced climate change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/nikki-bhati-dowry-case-greater-noida-news-viral-reel-making-family-society-instagram-reels-women-violence-patriarchy-2778950-2025-08-31",
      "headline": "How women with risqué content have India reelingSocial media shorts and Instagram Reels are creating dangerous friction in Indian society. The technology of the 21st century is clashing with the mores of a society still in the 19th century. While men opt for risky, women are getting into risque and vulgar content in an economy where eyeballs convert to hard cash. The Nikki Bhati case is just the tip of the iceberg. Here's how Indian society is reeling from the reel-making tornado."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/thankful-to-stray-dogs-supreme-court-judge-on-global-fame-after-key-order-2779428-2025-08-31",
      "headline": "Got messages saying dogs gave me blessings too: Top court judge on stray orderJustice Vikram Nath, who is in line to be the next Chief Justice of India in 2027, thanked street dogs for giving him global recognition after his August 22 order that served as a middle ground between those concerned with the menace and the animal lovers. \"I felt very elated...well, people outside India also know me,\" he added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/xi-jinping-preferred-made-in-china-hongqi-car-for-official-visits-given-to-pm-modi-for-sco-summit-2779521-2025-08-31",
      "headline": "Xi's preferred 'Made in China' car for official visits given to PM for SCO summitAlso known as the Red Flag, the Hongqi L5 car was used by Chinese President Xi Jinping when he visited PM Modi in Mahabalipuram in 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pavitra-rishta-actor-priya-marathe-dies-at-38-after-battling-cancer-2779460-2025-08-31",
      "headline": "Pavitra Rishta actor Priya Marathe dies at 38 after battling cancerActor Priya Marathe, known for her work in 'Pavitra Rishta', died in Mumbai on August 31, 2025, after her prolonged battle with cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/minerva-academy-gothia-cup-european-treble-ranjit-bajaj-exclusive-indian-football-2779438-2025-08-31",
      "headline": "Minerva Academy U-14: How a team from Punjab conquered EuropeMinerva Academy U-14 has rewritten Indian football history, conquering Europe's biggest youth tournaments in a single year. From Gothia Cup to Dana Cup to Norway Cup, these Mohali boys proved preparation, grit, and belief can put India on the global football map."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-criticises-modi-handshake-xi-china-hostility-border-tensions-2779530-2025-08-31",
      "headline": "Strict action: Congress jibes at Modi-Xi handshake, all-smiles meetingCongress criticised PM Modi for his warm handshake with Xi Jinping during their bilateral meet. The party alleges Modi is weak against China and prioritising economic ties over national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/trust-respect-sensitivity-pm-modis-opening-remarks-to-xi-at-china-bilateral-2779452-2025-08-31",
      "headline": "Trust, respect, sensitivities: PM's opening remarks to Xi at hour-long China meetDuring his talks with Chinese President Xi Jinping, Prime Minister Narendra Modi lauded China's successful SCO chairmanship, thanked Xi for hosting him, and stressed that trust, respect, and sensitivity are vital to India-China relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/makhana-farmers-getting-their-due-bihar-assembly-election-ground-report-katihar-darbhanga-2779359-2025-08-30",
      "headline": "Bihar's makhana turns poll plank: Are farmers getting their due?Rahul Gandhi's meeting with makhana farmers in Katihar has brought focus back on those cultivating, harvesting, and processing this superfood. But, who is actually benefiting from the skyrocketing prices of fox nuts?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/how-soon-is-too-soon-to-commit-after-a-first-date-2776410-2025-08-31",
      "headline": "How soon is too soon to commit after a first date?Going out with someone new is always exciting; you feel the spark and want to take the next step. But the real question is, how long should you wait before making that move?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-cancels-india-quad-visit-as-tensions-grow-with-modi-report-glbs-2779390-2025-08-31",
      "headline": "Trump has dropped India visit plan for Quad amid tension with PM Modi: ReportPresident Trump has reportedly dropped plans to attend the Quad Summit in India, as relations with Prime Minister Modi soured over trade tensions, Pakistan mediation claims, and Trump's Nobel ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dr-gradlin-roy-chennai-cardiac-surgeon-collapsed-in-hospital-during-ward-rounds-and-passed-away-despite-all-efforts-to-revive-2779342-2025-08-30",
      "headline": "Cardiac surgeon, 39, dies of heart attack during rounds at Chennai hospitalDr Gradlin Roy was a cardiac surgeon who collapsed during ward rounds on Wednesday and passed away despite desperate efforts to save him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jelena-ostapenko-taylor-townsend-controversy-2779431-2025-08-31",
      "headline": "Ostapenko apologises for Townsend remark amid racism storm in US OpenLatvian tennis star Jelena Ostapenko has apologised for her remark against Taylor Townsend. Amid racism row, Ostapenko has stated that English is not her first language, and she did not mean what she said.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-professor-muqabala-dance-video-goes-viral-wrong-profession-says-internet-2779469-2025-08-31",
      "headline": "Bengaluru professor's Muqabala dance video goes viral. Wrong profession, says InternetIn the video, Professor Pushpa Raj grooves to Prabhu Deva's hit track, 'Muqabala', leaving students cheering him on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/white-house-has-asked-europe-to-tariff-india-like-us-over-russian-oil-imports-say-sources-2779372-2025-08-30",
      "headline": "US nudging Europe to follow its lead, impose punitive tariffs on IndiaTrump tariffs on India and Russia's war in Ukraine are likely to constitute a significant portion of the SCO summit discussions in Tianjin over the next two days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-mp-afzal-ansari-praises-rss-chief-mohan-bhagwat-slams-pm-modi-yogi-adityanath-2779416-2025-08-31",
      "headline": "Others should learn: Samajwadi MP Afzal Ansari praises RSS chief's call for unitySamajwadi Party MP Afzal Ansari praised RSS chief Mohan Bhagwat's call for unity and harmony while taking digs at PM Narendra Modi and UP Chief Minister Yogi Adityanath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-raids-odisha-1396-crore-bank-fraud-luxury-cars-seized-bmw-porsche-jewellery-bhubaneswarindi-2779444-2025-08-31",
      "headline": "ED seizes Porsche, BMW, jewellery in Rs 1,396-crore bank fraud case in OdishaThe Enforcement Directorate (ED) seized luxury cars, jewellery, and cash during raids in Bhubaneswar linked to the ₹1,396 crore Indian Technomac bank fraud case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/bone-burnout-young-adults-joint-damage-overtraining-arthritis-treatment-2778860-2025-08-31",
      "headline": "When fitness backfires: Understanding bone burnout in young adultsOvertraining your joints can lead to premature arthritis, or what some doctors call \"bone burnout\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-airstrike-killed-prime-minister-of-houthi-controlled-government-in-yemens-sanaa-rebels-confirm-2779327-2025-08-30",
      "headline": "Houthi Prime Minister killed in Israeli airstrikes in Sanaa, rebel group confirmsAhmed al-Rahawi had been serving as prime minister of the Houthi-led government since August 2024. He was killed in recent Israeli airstrikes in Sanaa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-issues-urgent-alert-25-billion-gmail-users-told-to-change-passwords-immediately-2779475-2025-08-31",
      "headline": "Google issues urgent alert, 2.5 billion Gmail users told to change passwordsGoogle is urging Gmail users to enable two-step verification to boost cybersecurity. The warning comes amid a rise in successful account break-ins, with many traced back to the hacking collective ShinyHunters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/meet-chaya-nayak-indian-origin-ai-expert-behind-llama-poached-by-openai-after-9-years-at-meta-2779528-2025-08-31",
      "headline": "Meet Chaya Nayak, Indian-origin AI expert behind Llama poached by OpenAIAfter a Meta-poaching spree, OpenAI is now on the move. Recently, an Indian-origin techie was hired by OpenAI. Chaya Nayak worked at Meta for almost a decade and has now finally decided to depart. This is what we know about her. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-hits-shoaib-akhtar-for-multiple-boundaries-2779539-2025-08-31",
      "headline": "Watch: Babar takes on Shoaib Akhtar, hits Rawalpindi Express for multiple foursPakistan batter Babar Azam took on Shoaib Akhtar in an exhibition match between Peshawar Zalmi and Legends XI and smashed him for multiple boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suresh-raina-top-3-t20-batters-klaasen-suryakumar-2779512-2025-08-31",
      "headline": "Suresh Raina names top T20 batter in the world, puts 2 Indians in top 3Former India cricketer Suresh Raina has named his top three T20 batters. Raina has named two Indians - Abhishek Sharma and Suryakumar Yadav in the second and third positions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-gets-hit-wicket-on-wide-balll-in-caribbean-premier-league-2779509-2025-08-31",
      "headline": "Watch: Shai Hope bizarrely gets hit-wicket on wide ball in CPL 2025Shai Hope got out in the most unfortunate manner possible in the Caribbean Premier League as he got dismissed hit wicket on a hit wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-match-2779494-2025-08-31",
      "headline": "I am not a machine: Jannik Sinner after surviving Shapovalov scare in US OpenWorld No.1 Jannik Sinner came back from one set down against Denis Shapovalov to advance to the 4th round of the US Open. The win highlighted Sinner's mental strength ahead of his clash against Alexander Bublik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/minerva-academy-gothia-cup-european-treble-ranjit-bajaj-exclusive-indian-football-2779438-2025-08-31",
      "headline": "Minerva Academy U-14: How a team from Punjab conquered EuropeMinerva Academy U-14 has rewritten Indian football history, conquering Europe's biggest youth tournaments in a single year. From Gothia Cup to Dana Cup to Norway Cup, these Mohali boys proved preparation, grit, and belief can put India on the global football map."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/video/minerva-punjab-academy-fc-inside-exclusive-u14-gothia-cup-champions-2779476-2025-08-31",
      "headline": "Inside Minerva FC's football talent factory: Home of the boys conquered EuropeFrom Chandigarh to Europe, Minerva FC's U-14 boys conquered the continent. Gothia, Dana, and Norway Cups fell to relentless 3 a.m. training, tactical brilliance, and unshakable belief. Indian football has a new story — and these boys wrote it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-on-joe-root-virat-kohli-ashes-2025-2779434-2025-08-31",
      "headline": "Root could face Kohli's fate with another poor Ashes in Australia: Monty PanesarFormer England spinner Monty Panesar feels Joe Root could face a similar fate as Virat Kohli in Tests, if he fails to score runs in the upcoming Ashes series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-felix-auger-aliassime-alexander-zverev-yuki-bhambri-2779432-2025-08-31",
      "headline": "US Open: Stunned by forehand barrage, Alexander Zverev crashes out in Round 3Canada's Felix Auger-Aliassime came from behind to defeat Alexander Zverev at the US Open. In men's doubles, Yuki Bhambri progressed to Round 2 with his partner Michael Venus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jelena-ostapenko-taylor-townsend-controversy-2779431-2025-08-31",
      "headline": "Ostapenko apologises for Townsend remark amid racism storm in US OpenLatvian tennis star Jelena Ostapenko has apologised for her remark against Taylor Townsend. Amid racism row, Ostapenko has stated that English is not her first language, and she did not mean what she said.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-nitish-rana-on-heated-exchange-with-digvesh-rathi-2779425-2025-08-31",
      "headline": "Nitish Rana on heated exchange with Digvesh Rathi: I didn't start itNitish Rana has opened up on his on-field altercation with Digvesh Rathi in the Delhi Premier League 2025 (DPL 2025) and revealed that Digvesh had started it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-test-cricket-workload-bumrah-2779403-2025-08-31",
      "headline": "Akash Deep stays away from workload debate ahead of home Test seriesIndia fast bowler Akash Deep was felicitated by the Cricket Association of Bengal for his brilliant outing in England. Speaking at the event, Akash Deep steered clear of the workload management debate ahead of India's home Test season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-on-joe-root-virat-kohli-ashes-2025-2779434-2025-08-31",
      "headline": "Root could face Kohli's fate with another poor Ashes in Australia: Monty PanesarFormer England spinner Monty Panesar feels Joe Root could face a similar fate as Virat Kohli in Tests, if he fails to score runs in the upcoming Ashes series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-felix-auger-aliassime-alexander-zverev-yuki-bhambri-2779432-2025-08-31",
      "headline": "US Open: Stunned by forehand barrage, Alexander Zverev crashes out in Round 3Canada's Felix Auger-Aliassime came from behind to defeat Alexander Zverev at the US Open. In men's doubles, Yuki Bhambri progressed to Round 2 with his partner Michael Venus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jelena-ostapenko-taylor-townsend-controversy-2779431-2025-08-31",
      "headline": "Ostapenko apologises for Townsend remark amid racism storm in US OpenLatvian tennis star Jelena Ostapenko has apologised for her remark against Taylor Townsend. Amid racism row, Ostapenko has stated that English is not her first language, and she did not mean what she said.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-nitish-rana-on-heated-exchange-with-digvesh-rathi-2779425-2025-08-31",
      "headline": "Nitish Rana on heated exchange with Digvesh Rathi: I didn't start itNitish Rana has opened up on his on-field altercation with Digvesh Rathi in the Delhi Premier League 2025 (DPL 2025) and revealed that Digvesh had started it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-test-cricket-workload-bumrah-2779403-2025-08-31",
      "headline": "Akash Deep stays away from workload debate ahead of home Test seriesIndia fast bowler Akash Deep was felicitated by the Cricket Association of Bengal for his brilliant outing in England. Speaking at the event, Akash Deep steered clear of the workload management debate ahead of India's home Test season.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}