{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-sensex-nifty-fall-nearly-1-percent-as-it-financial-banking-pharma-stocks-tumble-in-volatile-day-2659277-2025-01-03",
      "headline": "Sensex, Nifty fall nearly 1% as IT, banking stocks tumble in volatile day The S&P BSE Sensex plunged 720.60 points to end at 79,223.11, while the NSE Nifty50 lost 199.60 points to end at 23,989.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-taxpayers-5-reforms-that-could-make-new-tax-regime-a-better-deal-for-you-2659264-2025-01-03",
      "headline": "Budget 2025: 5 reforms that could make new tax regime a better deal for youThe government is expected to focus on boosting consumption, given the low GDP for the second quarter, which could lead to tax relief measures aimed at increasing disposable income for salaried taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-date-time-and-what-to-expect-fm-nirmala-sitharaman-to-present-key-policies-and-reforms-income-tax-2659224-2025-01-03",
      "headline": "Budget 2025: Date, time, and what to expectThe countdown to India's Union Budget 2025 has begun, with Nirmala Sitharaman set to present key policies and reforms on February 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-kpi-green-energy-share-price-is-showing-36-decline-on-some-trading-apps-bonus-issue-stmp-2659186-2025-01-03",
      "headline": "Explained: Why KPI Green Energy shares are down 36% on some trading appsKPI Green Energy stock price: The stock declined 4.44% to trade at Rs 547 on the Bombay Stock Exchange (BSE) at Rs 1:40 pm after hitting an intraday low of Rs 548."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-rises-4-percent-should-you-buy-brokerage-review-clsa-nomura-stmp-2659167-2025-01-03",
      "headline": "Tata Motors share price rises 4%. Is it a good time to invest?Tata Motors stock: Over the past five trading sessions, Tata Motors has gained more than 6%. However, the stock has seen a decline of 18.36% in the last six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-five-key-announcements-india-is-waiting-for-income-tax-relief-reduction-in-excise-duty-on-fuel-focus-on-job-creation-2659149-2025-01-03",
      "headline": "Budget 2025: 5 key announcements India is waiting forBudget 2025 holds the potential to bring much-needed relief to the economy, addressing both long-term growth and immediate concerns like inflation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-gains-over-12-percent-hits-all-time-high-know-why-stmp-2659153-2025-01-03",
      "headline": "ITI share price soars over 12%, hits all-time high. Know whyITI stock price: Earlier, some analysts had advised investors to book profits as it was approaching a critical resistance zone. However, it has now surpassed the resistance zone and is likely to continue its upward momentum. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oil-india-ongc-share-price-jump-5-percent-today-what-is-fuelling-the-rally-stmp-2659131-2025-01-03",
      "headline": "Oil India, ONGC shares jump 5% today. What's fuelling the rally?The rally can be attributed to global policy measures aimed at economic revival, which investors believe could boost fuel demand and enhance earnings for upstream oil companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jai-corp-stock-price-52-week-low-today-check-key-details-capital-reduction-proposal-stmp-2659116-2025-01-03",
      "headline": "Explained: Why Jai Corp share price hit 52-week low todayThe steep decline in Jai Corp's share price over two sessions stems from a significant capital reduction proposal involving Urban Infrastructure Holdings Private Limited (UIHPL), where Jai Corp holds a 32% equity stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-tax-saving-tips-for-young-professionals-in-2025-investment-planning-health-insurance-2659101-2025-01-03",
      "headline": "5 tax-saving tips for young professionals in 2025Proactive financial planning helps young professionals save taxes, build wealth, and reach goals with strategies like early planning, goal-based investing, and health insurance, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-600-points-3-reasons-behind-stock-market-volatility-2659096-2025-01-03",
      "headline": "Sensex tumbles 600 points: 3 reasons behind stock market volatilityThe downturn highlights the persistent volatility on Dalal Street, with investors uncertain about the short-term market trajectory. While auto and IT stocks had propelled a rally just a day ago, profit booking amid prevailing uncertainty appears to have weighed heavily on sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/leo-dry-fruits-and-spices-ipo-last-day-check-price-band-gmp-today-stmp-2659089-2025-01-03",
      "headline": "Leo Dry Fruits and Spices IPO: Check price band, GMP today  Leo Dry Fruits and Spices IPO last day: The initial public offering (IPO) of Leo Dry Fruits and Spices will close for bidding on Friday after having opened for subscription on January 1, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-5-top-expectations-of-senior-citizens-enhanced-savings-better-deductions-for-medical-costs-2659086-2025-01-03",
      "headline": "Budget 2025: 5 top expectations of senior citizens Budget 2025 can ease senior citizens' burdens with higher tax exemptions, simpler processes, and targeted benefits for financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dmart-share-price-avenue-supermarts-stock-jumps-13-percent-in-early-trade-should-you-buy-stmp-2659058-2025-01-03",
      "headline": "DMart share price jumps 14% in early trade: Should you buy?DMart share price: The stock, which closed at Rs 3,617.75 in the previous session, rose to a high of Rs 4,165.00 during intraday trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-drops-over-400-points-nifty-slips-below-24100-in-early-trade-2659048-2025-01-03",
      "headline": "Sensex drops 400 points; Nifty slips below 24,100 in early tradeThe S&P BSE Sensex lost 452.52 points to 79,491.29, while the NSE Nifty50 was down by 93.25 points to 24,095.40 as of 9:42 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kabeer-biswas-founder-dunzo-exit-quick-commerce-startup-reliance-retail-battles-cash-crisis-report-2659043-2025-01-03",
      "headline": " Kabeer Biswas may call it quits as Dunzo battles cash crisis: Report The Bengaluru-based quick commerce platform has faced a challenging period over the last 12–18 months, marked by cash flow issues and difficulties in raising fresh funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-allotment-status-online-step-by-step-guide-latest-gmp-listing-date-2659030-2025-01-03",
      "headline": "Indo Farm Equipment IPO: Check allotment status, GMP and listing dateIndo Farm IPO allotment status:: Investors who wish to check Indo Farm Equipment IPO allotment can do so by visiting the Bombay Stock Exchange (BSE) website and the registrar's online portal, which is Mas Services Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-evasion-can-unregistered-small-businesses-b2c-receive-gst-notices-2658821-2025-01-03",
      "headline": "Can unregistered small businesses receive GST notices?The annual turnover threshold for GST registration is Rs 40 lakh for businesses supplying goods and Rs 20 lakh for service providers. Businesses below these limits are exempt, but exceeding them triggers registration and compliance requirements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-zee-dmart-irfc-itc-bharti-airtel-hero-motocorp-sensex-nifty-stock-market-2659018-2025-01-03",
      "headline": "Stocks to watch today: Zee, DMart, IRFC, ITC, Bharti Airtel, Hero MotoCorpAs markets open today, several companies such as Zee, DMart, IRFC, ITC, Bharti Airtel, Hero MotoCorp are expected to grab attention due to key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-will-fm-nirmala-sitharaman-address-tds-tcs-challenges-to-provide-relief-to-businesses-and-taxpayers-2658737-2025-01-02",
      "headline": "Budget 2025: Will Nirmala Sitharaman address TDS-TCS challenges? As Budget 2025-26 approaches, FICCI and industry bodies advocate simplifying TDS-TCS rates and tax processes to reduce complexity, boost compliance, and enhance taxpayer confidence."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-counters-pm-modi-aapda-jibe-delhi-government-bjp-2659298-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal's 3-point counter to PM's 'AAPda' attack on Delhi governmentWhile reacting to Prime Minister Narendra Modi's remark, Arvind Kejriwal said that the BJP wouldn't need to \"insult\" and \"abuse\" AAP if they had done any work for the national capital in the last 10 years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-dismisses-us-media-report-failed-maldivian-opposition-plot-to-oust-muizzu-2659303-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No credibility: India rejects report linking it to plot to oust Maldives's MuizzuNo credibility: India dismisses US media report linking it to failed Maldivian opposition plot to oust Muizzu"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/joe-biden-wife-jill-biden-costly-diamond-pm-modi-luxurious-gifts-world-leaders-2659251-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Biden's wife got costliest gift from PM Modi, but she won't be able to use itThe diamond, worth $20,000 and produced in Surat, has become the most expensive gift received by the US first family in 2023. It was given by PM Modi during his visit to the US in June 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sydney-test-bumrah-konstas-heated-khawaja-out-day-1-2659135-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "You were saying? Jasprit Bumrah ends Day 1 in style after spat with Sam KonstasAustralia vs India, Sydney Test: Jasprit Bumrah and Sam Konstas were engaged in a fiery exchange at the end of Day 1 in Sydney after the Indian pacer dismissed Usman Khawaja on the last ball.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/manmohan-singh-us-india-civil-nuclear-deal-2008-agreement-2005-george-w-bush-white-house-tissue-paper-note-2659124-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How a timely tissue paper note helped India clinch nuclear deal with USThe 2005 agreement between PM Manmohan Singh and US President George W Bush, which paved the way for the landmark 2008 India-US Civil Nuclear Deal, hit a deadlock just hours before it was to be signed. At this critical juncture, a two-sentence note from Anil Kakodkar, Chairman of the AEC, to PM Manmohan Singh proved instrumental in breaking the impasse and sealing the historic pact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-raut-praise-devendra-fadnavis-maharashtra-gadchiroli-naxals-surrender-2659102-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sanjay Raut's rare praise for Devendra Fadnavis amid 'Pawars reunion' chatterSanjay Raut, speaking to reporters, said he had previously worked with Devendra Fadnavis and his initiatives for Naxal-infested Gadchiroli should be appreciated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/hmpv-china-facing-new-viral-outbreak-after-covid-19-all-you-need-to-know-2659111-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China in grip of viral HMPV outbreak? What we know so farChina is currently experiencing a surge in respiratory diseases, with human metapneumovirus (HMPV) being a significant cause for concern."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-narendra-modi-arvind-kejriwal-sheeshmahal-build-homes-slum-dwellers-housing-projects-dig-chief-minister-residence-row-2659220-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No 'sheeshmahal' for me, built homes for people: PM Modi jabs Arvind KejriwalThe Prime Minister tore into the Aam Aadmi Party, saying it had turned into an AAP-ada (disaster) for Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/vizag-beach-updates-narrow-escape-for-navy-officers-parachutes-entangle-2659232-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Navy skydivers' narrow escape after parachutes entangle midair A video of the incident showed one officer descending with the national flag while the other's parachute got entangled, causing both to lose altitude rapidly and fall into the water near the shore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-pradesh-tadepalligudem-man-murdered-in-goa-mla-ensures-body-repatriation-2659154-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andhra man killed in Goa after beach shack brawl on New Year's EveA New Year celebration in Goa ended tragically for a Tadepalligudem group of friends, as a restaurant altercation led to one of the individuals, Ravi Teja's murder. His body was returned home with MLA's help.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mahakumbh-2025-pryagraj-not-just-mythology-there-is-ancient-science-behind-it-2659114-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mahakumbh 2025: Not just mythology, there is science behind it Beyond its spiritual essence, the festival's timing is deeply rooted in celestial phenomena, particularly involving the planet Jupiter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-washington-sundar-catch-drs-joel-wilson-third-umpire-controveresy-2659112-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Awful decision: Washington Sundar shocked after controversial DRS call in SydneyAustralia vs India, 5th Test: Washington Sundar was not able to believe his luck when third umpire Joel Wilson ruled him caught behind after he appeared to glove a bouncer from Pat Cummins. Wilson made two debatable calls on Day 1 of the Test in Syndey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/photo/northern-lights-alaska-2659248-2025-01-03?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "A world awash in Aurora: Northern lights' dazzling global displayThe northern lights put on a dazzling show across the world, lighting up the skies over Anchorage, the valleys of Germany, the shores of Lake Washington, and even the remote suburbs of Siberia. Each image captures the magic of this natural phenomenon, where solar particles meet Earth's atmosphere to create a breathtaking display of colour and light."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/wi-fi-on-air-india-flights-now-5-things-you-might-miss-doing-on-plane-2658781-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wi-Fi on Air India flights now: 5 things you might miss doing on planeOn January 1, Air India introduced complimentary internet access for passengers on select aircraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-entrepreneur-4-insights-blinkit-10-minutes-ambulance-service-2659174-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru entrepreneur's 4 insights on Blinkit's ambulance in 10 minutes serviceWhile acknowledging the importance of Blinkit's 10-minute ambulance service, Dilip Kumar shared four insights from his experience with emergency care startups. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-syros-launch-date-expected-price-booking-details-all-other-information-stmp-2659103-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kia Syros launch date, expected price, booking details, all other informationThe Syros is Kia's new sub-4 metre compact. With its bookings open now, here are some important details you need to know about the vehicle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rajasthani-girl-viral-video-jyoti-internet-sensation-traditional-beauty-2659280-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "This Rajasthani girl is the new Internet sensation. Watch viral video to know whyDressed in a traditional outfit sans makeup, the Rajasthani girl couldn't stop giggling while conversing with the vlogger. Her video has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-evasion-can-unregistered-small-businesses-b2c-receive-gst-notices-2658821-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can unregistered small businesses receive GST notices?The annual turnover threshold for GST registration is Rs 40 lakh for businesses supplying goods and Rs 20 lakh for service providers. Businesses below these limits are exempt, but exceeding them triggers registration and compliance requirements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-veer-savarkar-college-inauguration-row-manmohan-singh-delhi-elections-2659062-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Name it after Manmohan Singh': Congress vs BJP on Savarkar college inaugurationPrime Minister Narendra Modi laid the foundation of a college in Delhi named after Hindutva icon Veer Savarkar. The issue has sparked a war of words between the BJP and Congress ahead of the Delhi elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-day-1-jasprit-bumrah-bowling-batting-sydney-pitch-scott-boland-pat-cummins-2659137-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All-round Bumrah sparks India's hopes after batters fail in grassy SydneyIND vs AUS, SCG Test: Jasprit Bumrah kept India in the hunt once again despite a team facing a torrid time for the larger part of Day 1 at the SCG Test on Friday. Despite resting Rohit Sharma, India batters were a no-show once again in the ongoing series and were bowled out for just 185 runs on a spicy Sydney pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-alleges-ryan-reynolds-berated-him-for-fat-shaming-blake-lively-2658916-2025-01-02?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Justin Baldoni alleges Ryan Reynolds 'berated' him for 'fat-shaming' Blake LivelyJustin Baldoni has filed a libel lawsuit against The New York Times, accusing Ryan Reynolds of berating him over comments made about Blake Lively's weight. Baldoni claimed his comments were related to safety concerns and not intended as fat-shaming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/czech-psychologist-drinks-beer-breastfeeding-toddler-beach-viral-pic-linkedin-2659127-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Czech psychologist drinks beer while breastfeeding, shares pic on LinkedIn. Viral Olga Vlachynska posted the image on LinkedIn, revealing that it was taken a decade ago during a vacation in Thailand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/wife-not-wearing-parda-viel-not-cruelty-no-ground-for-divorce-allahabad-high-court-2659076-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wife not wearing 'purdah' is not cruelty, can't be ground for divorce: High CourtThe Allahabad High Court ruled that a woman's choice to not wear a 'purdah' (veil) does not amount to cruelty and cannot justify divorce. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musks-spacex-to-launch-thuraya-4-mission-to-begin-2025-with-a-thunderous-roar-2659279-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SpaceX to launch Thuraya-4 mission to begin 2025 with a roarThe Thuraya 4 satellite, built by Airbus, is designed to enhance mobile satellite services across regions including Africa, Central Asia, Europe, and the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/82nd-golden-globes-2025-host-presenters-lionsgate-play-all-you-need-to-know-2659307-2025-01-03",
      "headline": "Golden Globes 2025: Host, presenters, streaming details and all you need to knowThe 82nd Annual Golden Globes will dazzle Hollywood on January 6, 2025, hosted by Nikki Glaser. Streaming live in India on Lionsgate Play, the event promises unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/nepali-child-singer-sachin-pariyar-known-for-otha-kholera-dies-at-15-stmp-2659306-2025-01-03",
      "headline": "Nepali child singer Sachin Pariyar, known for Otha Kholera, dies at 15Child singer Sachin Pariyar, known for his famous song Otha Kholera, died on January 2. He was 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saurabh-sachdeva-comeback-in-animal-park-exclusive-2659285-2025-01-03",
      "headline": "Saurabh Sachdeva on his potential comeback in Animal Park: Should be thereActor Saurabh Sachdeva hints at a possible return in Animal Park, the sequel to the hit film Animal. While talks are yet to happen, fans eagerly await his potential role in the Ranbir Kapoor-starrer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/siddhant-chaturvedi-vedang-raina-ishaan-khatter-enjoy-boys-day-out-in-goa-2659284-2025-01-03",
      "headline": "Siddhant Chaturvedi, Vedang Raina, Ishaan Khatter enjoy boys' day out in GoaActors Siddhant Chaturvedi, Ishaan Khatter, and Vedang Raina recently featured in a mobile phone advertisement, which included a shoot in Goa. On Friday, Siddhant shared a series of lively pictures capturing their Goan adventures."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-world-record-list-a-runs-without-getting-dismissed-vidarbha-vijay-hazare-2659311-2025-01-03",
      "headline": "Karun Nair breaks world record with third consecutive century in Vijaya HazareKarun Nair scripted history with three consecutive centuries in the Vijay Hazare Trophy, becoming the first Indian batter to score 500 unbeaten List A runs across innings, breaking New Zealand's James Franklin's 13-year-old world record of 527 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-saim-ayub-leaves-on-stretcher-nasty-twisted-ankle-2nd-test-2659283-2025-01-03",
      "headline": "Saim Ayub leaves field on stretcher after twisting ankle in 2nd TestPakistan suffered an injury setback in the first hour of the second Test against South Africa after opening batter Saim Ayub was stretchered off the field at Newlands in Cape Town on Friday, January 3.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-challenge-sydney-pitch-beau-webster-scg-test-2659276-2025-01-03",
      "headline": "Beau Webster anticipates big Jasprit Bumrah 'challenge' on grassy SCG pitchJasprit Bumrah's fiery spell on Day 1 of the SCG Test worried Australia, with Beau Webster admitting the pacer's ability to exploit the grassy pitch could challenge their batting order in the crucial Border-Gavaskar Trophy finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-sydney-test-rishabh-pant-press-conference-day-1-2659267-2025-01-03",
      "headline": "We see Rohit Sharma as the leader: Rishabh Pant on Sydney Test bombshellAustralia vs India, 5th Test: Speaking to the press in Sydney after Day 1, Rishabh Pant said Rohit Sharma's decision to drop himself was an emotional one. Pant also explained why he played more cautiously on a green pitch at the SCG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-deserved-more-respect-navjot-singh-sidhu-sydney-test-2659253-2025-01-03",
      "headline": "Rohit Sharma deserved more respect, captain should never be dropped: SidhuNavjot Sidhu lambasted Team India for sidelining Rohit Sharma in the crucial SCG Test, asserting the decision disrespected the skipper's stature. Amid ongoing criticism, India struggled with the bat, further fuelling debates over Rohit's exclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-on-bumrah-konstas-heated-exchange-sydney-test-2659244-2025-01-03",
      "headline": "Pant reflects on Bumrah-Konstas heated exchange: Australia wanted to waste timeIndian wicketkeeper Rishabh Pant weighed in on the fiery exchange between Jasprit Bumrah and Australian youngster Sam Konstas during the final moments of Day 1 of the Pink Test in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-melbourne-crowd-racist-chants-viral-video-sydney-test-2659221-2025-01-03",
      "headline": "Viral video shows Australian crowd singing racist chants during MCG TestA viral video from the MCG Test showed Australian fans taunting Indian supporters with racist chants, reigniting concerns about crowd behaviour and echoing past controversies. The incident has sparked outrage during the ongoing Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-celebrations-perth-win-india-credit-card-coach-2659230-2025-01-03",
      "headline": "India didn't celebrate Perth win together despite coach offering credit card: ReportAustralia vs India: Rumours of discord in the Indian cricket team during the Australia tour have intensified, with reports of players opting for individual celebrations after the Perth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-dropped-rishabh-pant-reaction-sydney-test-2659216-2025-01-03",
      "headline": "Rohit Sharma dropping himself was emotional, can't explain more: Rishabh PantBorder-Gavaskar Trophy: India wicketkeeper Rishabh Pant said that captain Rohit Sharma dropping himself for the fifth and final Test against Australia was an emotional decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-jasprit-bumrah-memes-fire-up-sydney-day-1-2659161-2025-01-03",
      "headline": "Don't fire up Bumrah: Meme-fest after India captain gives it back to Sam KonstasAustralia vs India, 5th Test: Jasprit Bumrah was fired up by Sam Konstas after the two were involved in a heated verbal exchange. The India captain dismissed Usman Khawaja in the final over of the day's play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-melbourne-crowd-racist-chants-viral-video-sydney-test-2659221-2025-01-03",
      "headline": "Viral video shows Australian crowd singing racist chants during MCG TestA viral video from the MCG Test showed Australian fans taunting Indian supporters with racist chants, reigniting concerns about crowd behaviour and echoing past controversies. The incident has sparked outrage during the ongoing Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-celebrations-perth-win-india-credit-card-coach-2659230-2025-01-03",
      "headline": "India didn't celebrate Perth win together despite coach offering credit card: ReportAustralia vs India: Rumours of discord in the Indian cricket team during the Australia tour have intensified, with reports of players opting for individual celebrations after the Perth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-dropped-rishabh-pant-reaction-sydney-test-2659216-2025-01-03",
      "headline": "Rohit Sharma dropping himself was emotional, can't explain more: Rishabh PantBorder-Gavaskar Trophy: India wicketkeeper Rishabh Pant said that captain Rohit Sharma dropping himself for the fifth and final Test against Australia was an emotional decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-jasprit-bumrah-memes-fire-up-sydney-day-1-2659161-2025-01-03",
      "headline": "Don't fire up Bumrah: Meme-fest after India captain gives it back to Sam KonstasAustralia vs India, 5th Test: Jasprit Bumrah was fired up by Sam Konstas after the two were involved in a heated verbal exchange. The India captain dismissed Usman Khawaja in the final over of the day's play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-day-1-jasprit-bumrah-bowling-batting-sydney-pitch-scott-boland-pat-cummins-2659137-2025-01-03",
      "headline": "All-round Bumrah sparks India's hopes after batters fail in grassy SydneyIND vs AUS, SCG Test: Jasprit Bumrah kept India in the hunt once again despite a team facing a torrid time for the larger part of Day 1 at the SCG Test on Friday. Despite resting Rohit Sharma, India batters were a no-show once again in the ongoing series and were bowled out for just 185 runs on a spicy Sydney pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sydney-test-bumrah-konstas-heated-khawaja-out-day-1-2659135-2025-01-03",
      "headline": "You were saying? Jasprit Bumrah ends Day 1 in style after spat with Sam KonstasAustralia vs India, Sydney Test: Jasprit Bumrah and Sam Konstas were engaged in a fiery exchange at the end of Day 1 in Sydney after the Indian pacer dismissed Usman Khawaja on the last ball.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-2024-lower-1st-innings-test-average-bumrah-2659121-2025-01-03",
      "headline": "Virat Kohli has lower first innings Test average than Jasprit Bumrah since 2024Australia vs India: Virat Kohli, who fell after scoring 17 runs in the Sydney Test, has a lower first-innings Test average than Jasprit Bumrah since 2024. Kohli's woeful form continued after the batter once again edged the ball to the slip cordon. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-washington-sundar-catch-drs-joel-wilson-third-umpire-controveresy-2659112-2025-01-03",
      "headline": "Awful decision: Washington Sundar shocked after controversial DRS call in SydneyAustralia vs India, 5th Test: Washington Sundar was not able to believe his luck when third umpire Joel Wilson ruled him caught behind after he appeared to glove a bouncer from Pat Cummins. Wilson made two debatable calls on Day 1 of the Test in Syndey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-sydney-grass-pitch-5th-test-2659077-2025-01-03",
      "headline": "SCG pitch has excessive grass, but no former Indian player is complaining: GavaskarFormer India captain Sunil Gavaskar slammed the unusually grassy pitch at the Sydney Cricket Ground, adding that former Indian players have refrained from criticising the challenging surfaces in Australia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-rishabh-pant-takes-body-blows-replies-with-six-2659054-2025-01-03",
      "headline": "Watch: Rishabh Pant takes body-blows, replies with massive six at SCGIndia batter Rishabh Pant battled it out like a gladiator at the SCG on Friday. In testing conditions, Pant took blows to the hand and head and then replied with a stunning six on Day 1 of the final Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-sydney-test-match-virat-kohli-outside-off-edge-2659040-2025-01-03",
      "headline": "Edged and gone, again: Virat Kohli booed at SCG, dismissed for 17Senior India batter Virat Kohli once again edged the ball to the slips in the Border-Gavaskar Trophy. This was the 6th time out of 7 innings that Kohli got out edging the ball outside off stump.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-shane-watson-on-sam-konstas-debut-2659029-2025-01-03",
      "headline": "Sam Konstas built for this stage: Watson praises Australia opener's showmanshipFormer Australian all-rounder Shane Watson, who has mentored Sam Konstas, was pleasantly surprised by the 19-year-old's blockbuster debut in the fourth Test against India at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-sydney-grass-pitch-5th-test-2659077-2025-01-03",
      "headline": "SCG pitch has excessive grass, but no former Indian player is complaining: GavaskarFormer India captain Sunil Gavaskar slammed the unusually grassy pitch at the Sydney Cricket Ground, adding that former Indian players have refrained from criticising the challenging surfaces in Australia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-rishabh-pant-takes-body-blows-replies-with-six-2659054-2025-01-03",
      "headline": "Watch: Rishabh Pant takes body-blows, replies with massive six at SCGIndia batter Rishabh Pant battled it out like a gladiator at the SCG on Friday. In testing conditions, Pant took blows to the hand and head and then replied with a stunning six on Day 1 of the final Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-sydney-test-match-virat-kohli-outside-off-edge-2659040-2025-01-03",
      "headline": "Edged and gone, again: Virat Kohli booed at SCG, dismissed for 17Senior India batter Virat Kohli once again edged the ball to the slips in the Border-Gavaskar Trophy. This was the 6th time out of 7 innings that Kohli got out edging the ball outside off stump.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-shane-watson-on-sam-konstas-debut-2659029-2025-01-03",
      "headline": "Sam Konstas built for this stage: Watson praises Australia opener's showmanshipFormer Australian all-rounder Shane Watson, who has mentored Sam Konstas, was pleasantly surprised by the 19-year-old's blockbuster debut in the fourth Test against India at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-bgt-rohit-sharma-retirement-rested-dropped-gavaskar-2659020-2025-01-03",
      "headline": "Rohit Sharma has played his last Test for India: Sunil GavaskarIndia captain Rohit Sharma has played his last Test match in Melbourne, said Sunil Gavaskar on Friday - Day 1 of the final Test match of the Border-Gavaskar Trophy. Sharma skipped the SCG Test after opting to rest himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-steve-smith-reaction-virat-kohli-catch-sydney-test-2659017-2025-01-03",
      "headline": "Steve Smith '100 percent' certain he got his hand under Virat Kohli's catchSteven Smith is 100 percent certain he got his hand under the ball while attempting to catch Virat Kohli at slip on the first day of the SCG Test. The decision was referred to the TV umpire and was eventually ruled not out.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-dropped-mark-taylor-ind-vs-aus-scg-test-2659007-2025-01-03",
      "headline": "He's been dropped: Mark Taylor slams Team India over Rohit Sharma 'resting'Former Australia cricketer Mark Taylor has slammed Team India's line of Rohit Sharma 'resting himself'. Speaking on Triple M Cricket, Taylor said that Rohit has been dropped, and the team should just simply say so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-sydney-test-virat-kohli-catch-not-out-joel-wilson-steve-smith-2659006-2025-01-03",
      "headline": "Virat Kohli out or not? Smith upset over third umpire's call in Sydney TestAustralia vs India, 5th Test: Virat Kohli was handed a lifeline when he was batting on 0 in the first innings of the final Test in Sydney. Steve Smith's effort in the slip cordon was deemed not out by third umpire Joel Wilson, leading to mixed reactions. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}