{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/what-to-expect-from-the-national-stock-exchange-in-the-next-5-years-india-today-conclave-2794051-2025-09-26",
      "headline": "What to expect from the National Stock Exchange in the next 5 years?Ashish Chauhan, CEO of NSE Chauhan, said the rise in investors and market size over the last decade gives a clear idea of the potential ahead. In 2014, India had just 1.67 crore unique investors. Today, there are about 12 crore investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/50-tariffs-and-growth-why-india-must-focus-on-reform-not-retaliation-2794039-2025-09-26",
      "headline": "50% tariffs and growth: Why India must focus on reform, not retaliationAt the India Today Conclave Mumbai 2025, experts called for reforms, investment-led growth, and targeted support for vulnerable sectors to navigate challenges from steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-advantage-vs-global-india-today-conclave-mumbai-ashish-chauhan-nse-ceo-2794031-2025-09-26",
      "headline": "Explained: Why Dalal Street has an edge over global stock marketsAt the India Today Conclave in Mumbai, Ashish Chauhan, CEO of the National Stock Exchange of India (NSE), explained why India's markets and economy hold a stronger position for the future compared to others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-50-tariffs-to-growth-why-india-needs-reforms-not-retaliation-2794011-2025-09-26",
      "headline": "From 50% tariffs to growth: Why India needs reforms, not retaliationAs the US slaps steep tariffs on Indian goods, the debate is shifting from retaliation to reform. Experts at the India Today Conclave Mumbai 2025 say India should use this moment to push for deeper reforms that fuel investment and boost domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-to-invest-in-pharma-and-it-stocks-during-current-slowdown-2793962-2025-09-26",
      "headline": "How to invest in pharma and IT stocks during current slowdownWith the US announcing fresh tariffs on branded drugs and uncertainty around H-1B visa rules, both sectors are experiencing headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-advance-amid-tariff-and-energy-discussions-2793911-2025-09-26",
      "headline": "India-US trade talks advance amid tariff and energy discussionsIndia-US trade discussions are gaining momentum, with both nations exploring ways to enhance economic cooperation, address tariffs, and boost energy trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-733-points-nifty-below-24700-pharma-it-stocks-hit-hard-2793901-2025-09-26",
      "headline": "Sensex tumbles 733 points as pharma, IT stocks hitThe sell-off came after the United States announced a steep 100% tariff on imports of branded and patented pharmaceutical products, effective October 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-air-passengers-rise-to-1317-lakh-in-august-2025-amid-rising-costs-icra-report-2793857-2025-09-26",
      "headline": "Indian air passengers rise to 131.7 lakh in August 2025 amid rising costs: ReportIndia's aviation sector is bouncing back, but the journey isn't without turbulence. Rising fuel costs, operational challenges, and financial pressures are testing airlines, even as passenger traffic shows steady growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-800-points-nifty-fall-pharma-it-auto-fmcg-shares-trump-announcement-2793865-2025-09-26",
      "headline": "Sensex tanks 800 points: Why is stock market falling today?By 2:37 pm, the S&P BSE Sensex had lost 782.71 points to trade at 80,376.97, while the NSE Nifty50 slipped 247.10 points to 24,643.75. Both indices were on track to end the week in negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/18-upcoming-ipos-next-week-glottis-fabtech-om-freight-advance-agrolife-sme-public-listings-2793844-2025-09-26",
      "headline": "Investors brace for IPO wave as 18 public listings hit Dalal Street next weekThe four mainboard IPOs opening next week together aim to raise over Rs 850 crore. Apart from them, 14 SME IPOs will also open for bidding next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-policy-private-grievance-platforms-claim-denied-2793797-2025-09-26",
      "headline": "Why more insurance policyholders are turning to private grievance platformsAs claim rejections soar and official channels frustrate, policyholders turn to private grievance platforms. Experts warn regulatory reform and competent brokers could restore trust in India's struggling insurance system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-emis-to-assets-how-home-loans-are-creating-india-new-wealth-generation-2793794-2025-09-26",
      "headline": "From EMIs to assets: How home loans are creating India's new wealth generationIn India, home loans are doing more than financing houses—they are quietly shaping the country's next generation of wealth. Every EMI paid is becoming a step toward financial growth and stability."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-and-jyotika-daughter-diya-suriya-makes-directorial-debut-with-leading-light-2794067-2025-09-26",
      "headline": "Suriya and Jyotika's daughter makes directorial debut with Leading Light Diya Suriya, daughter of Tamil actors Suriya and Jyotika, has made her directorial debut with the docu-drama short 'Leading Light'. The film has gained recognition with an Oscar Qualifying Run at Los Angeles' Regency Theatre. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/min-yoongi-treatment-center-by-bts-suga-moves-fans-with-personal-touch-2794034-2025-09-26",
      "headline": "Min Yoongi Treatment Center by BTS' Suga moves fans with personal touch BTS' SUGA launches Min Yoongi Treatment Center in Seoul in partnership with Severance Hospital. Facility adopts MIND programme to help children and young adults on the autism spectrum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-says-his-family-feared-him-during-his-alcoholism-been-sober-over-a-year-2794029-2025-09-26",
      "headline": "Bobby Deol says his family feared him during his alcoholism, been sober over a year Actor Bobby Deol spoke about his struggle with alcoholism during a difficult phase of his career, expressing regret over the fear his family experienced during the time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-the-bads-of-bollywood-season-2-in-the-works-confirms-rajat-bedi-2794043-2025-09-26",
      "headline": "Aryan Khan's The Ba***ds of Bollywood season 2 in the works, confirms Rajat Bedi Actor Rajat Bedi has confirmed that 'The Ba***ds of Bollywood' will return for a second season. The show marked Aryan Khan's directorial debut and received positive reviews from critics and audiences alike. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-recalls-near-fatal-knife-attack-walking-away-unscathed-is-miraculous-2793999-2025-09-26",
      "headline": "Saif Ali Khan recalls near-fatal knife attack: Walking away unscathed is miraculous Bollywood actor Saif Ali Khan survived a terrifying knife attack at his Mumbai home earlier this year. Describing his escape as miraculous, he talks of how he fought off the intruder despite a severe injury. He is now recovering while preparing for upcoming film projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-trailer-review-ayushmann-khurrana-struggles-with-love-legend-rajma-chawal-rashmika-mandanna-helps-2794055-2025-09-26",
      "headline": "Thamma trailer: Ayushmann struggles with love, legend, rajma-chawal, Rashmika helps Ayushmann Khurrana plays a vampire of sorts in 'Thamma', produced by Dinesh Vijan's Maddock Films. The film is a part of the Indian horror-comedy universe, and also features Rashmika Mandanna and Nawazuddin Siddiqui in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cinema-and-the-big-ai-question-can-machines-make-movies-with-heart-2793927-2025-09-26",
      "headline": "Cinema and the big AI question: Can machines make movies with heart? As Sunny Leone's AI-driven film 'Kaur or Kore' leads the way in AI storytelling, we discuss whether Artificial Intelligence revolutionises filmmaking or kills creativity. IndiaToday.in speaks to the industry experts on the future, fears and legal battles of AI in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-debut-series-exposes-bollywood-nepotism-chaos-2793970-2025-09-26",
      "headline": "The Ba***ds of Bollywood feels like one big party with no plot to go home to Aryan Khan's debut series attempts to reveal Bollywood's underbelly including nepotism and scandals. The show's chaotic narrative and overplayed themes sparked mixed reactions among viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-says-ex-wife-mona-shourie-bought-sridevi-wedding-rings-2793961-2025-09-26",
      "headline": "Boney Kapoor says ex-wife Mona Shourie bought his and Sridevi's wedding rings Boney Kapoor discusses the challenges of balancing two families and the effect on his children. Kapoor reveals his first wife Mona Shourie Kapoor bought the wedding rings for both him and Sridevi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/12th-fail-is-the-plot-twist-no-one-anticipated-for-vikrant-massey-and-bollywood-2793930-2025-09-26",
      "headline": "12th Fail is the plot twist no one anticipated for Vikrant Massey and Bollywood '12th Fail', which was a sleeper hit at the time of its release, won big at the 71st National Awards. The film not only won an award in the Best Feature Film category, but also got Vikrant Massey recognition for his acting performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dinesh-yadav-recalls-when-jaya-bachchan-beat-him-with-stick-on-bhojpuri-film-set-2793945-2025-09-26",
      "headline": "Dinesh Yadav recalls when Jaya Bachchan beat him with stick on Bhojpuri film set Actor Dinesh Lal Yadav revealed how Jaya Bachchan actually hit him with a stick during a film shoot. The incident happened on the set of Bhojpuri film 'Ganga Devi' (2012)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sohum-shah-to-start-shooting-for-tumbbad-2-next-year-pen-studios-jayantilal-gada-2793941-2025-09-26",
      "headline": "Sohum Shah's Tumbbad 2 to go on floors next year Sohum Shah Films has partnered with Pen Studios to produce 'Tumbbad 2', the sequel to the acclaimed 2018 film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chocolate-boy-to-chameleon-choi-woo-shik-evolving-screen-journey-2793931-2025-09-26",
      "headline": "Chocolate boy to chameleon: Choi Woo-shik's evolving screen journey In this week's K-fix, we discover how Choi Woo-shik, South Korea's Chocolate Boy, redefined versatility with standout roles in 'Parasite', 'Our Beloved Summer', 'The Witch' and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-says-he-talks-about-gardening-books-music-with-daughter-in-law-sobhita-dhulipala-2793944-2025-09-26",
      "headline": "It's like having a daughter: Nagarjuna on his bond with daughter-in-law Sobhita Actor Nagarjuna expressed heartfelt admiration for his daughter-in-law Sobhita Dhulipala, highlighting their warm bond and shared interests since her marriage to Naga Chaitanya. The couple's intimate wedding took place in Hyderabad last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-one-of-one-india-tour-2025-premium-vvip-tickets-mumbai-2793939-2025-09-26",
      "headline": "AP Dhillon announces third India tour, Mumbai VVIP tickets priced at Rs 6.25 lakh Singer AP Dhillon to begin third India tour in December, covering eight major cities, including a Mumbai show that features a record-breaking VVIP ticket price at Rs 6.25 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shilpa-shetty-denies-rs-15-crore-payment-from-raj-kundra-threatens-legal-action-2793922-2025-09-26",
      "headline": "Fake and mischievous: Shilpa Shetty denies Rs 15-crore payment from Raj Kundra Shilpa Shetty has refuted claims that she received Rs 15 crore from her husband, Raj Kundra, almost a decade ago. This comes as EOW is investigating a Rs 60-crore cheating case linked to Kundra and Shetty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ashneer-grover-falls-prey-fake-bigg-boss-19-casting-call-2793917-2025-09-26",
      "headline": "Ashneer Grover falls prey to fake Bigg Boss 19 casting call Ashneer Grover shared a screenshot on social media and alerted fans about a fake casting invitation for 'Bigg Boss 19'. A source close to the development said that the entrepreneur cannot be a part of the Salman Khan-hosted reality show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/balti-review-crime-drama-kabaddi-action-shane-nigam-cliches-2793891-2025-09-26",
      "headline": "Balti review: Shane Nigam, Shanthanu's promising crime drama drowns in clichesRelease Date:Fri Sep 26, 2025 Balti movie review: Directed by Unni Sivalingam, 'Balti' is an action drama starring Shane Nigam and Shanthanu Bhagyaraj. While its dynamic characters are intriguing, the film ultimately suffers from overused cliches and a predictable storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-mahesh-bhatt-breaks-silence-on-pooja-bhatt-kiss-controversy-2793875-2025-09-26",
      "headline": "Exclusive: Mahesh Bhatt breaks silence on Pooja Bhatt kiss controversy Mahesh Bhatt shared his thoughts on the infamous kiss controversy with daughter Pooja Bhatt. He reflected on how hardships strengthened their bond and shaped their lives."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-icc-suryakumar-yadav-fine-ind-vs-pak-comments-bcci-challenges-2794065-2025-09-26",
      "headline": "Suryakumar Yadav fined over comments in India vs Pak game. BCCI appeals decisionAsia Cup 2025: India captain Suryakumar Yadav was fined 30 percent of his match fee for his comments that alluded to the cross-border hostilities between the two countries during India's group-stage match against Pakistan. Suryakumar had dedicated India's win over Pakistan on September 14 to the victims of the Pahalgam terror attack and the Indian armed forces.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/careless-india-rejects-nato-chiefs-pm-called-putin-for-ukraine-plan-claim-says-no-such-talk-took-place-2793921-2025-09-26",
      "headline": "Careless, unacceptable: India blasts Nato chief over 'Modi called Putin' remarkIndia slammed Nato chief Mark Rutte for claiming that Prime Minister Narendra Modi had spoken directly with Russian President Vladimir Putin on the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ladakh-activist-sonam-wangchuk-arrested-under-national-security-act-days-after-violent-statehood-protests-2793906-2025-09-26",
      "headline": "Sonam Wangchuk arrested days after violent statehood protests in LadakhThe government blamed Wangchuk for the unrest, alleging his \"provocative statements\" and the actions of \"politically motivated\" groups unhappy with ongoing negotiations between officials and Ladakhi representatives had incited protesters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-mumbai-2025/story/ajay-bisaria-jawed-ashraf-warns-trump-pakistan-us-ties-china-influence-india-today-conclave-2793826-2025-09-26",
      "headline": "Pak set to disappoint US, angry Trump post coming soon, ex-Indian diplomat predictsSeconding Ajay Bisaria, another senior Indian diplomat, Jawed Ashraf, said that every new US administration is initially seduced by Pakistan, only to end in disappointment – a pattern seen with Bush, Obama, and now likely to repeat with Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-karnataka-cm-guilt-trip-request-wipro-campus-access-bengaluru-orr-congestion-azim-premji-denies-2794047-2025-09-26",
      "headline": "Is Siddu trying to guilt-trip Azim Premji with a sleight of hand?Wipro founder Azim Premji courteously refused Karnataka Chief Minister Siddaramaiah's request to open a road on the company's campus for public vehicles to ease traffic congestion. Is Siddaramiah trying to transfer guilt on Bengaluru's traffic nightmare? Is Premji right in rejecting the request?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/steel-plant-structure-collapses-in-chhattisgarh-five-dead-more-feared-trapped-2794045-2025-09-26",
      "headline": "6 killed, more feared trapped as steel plant structure collapses in ChhattisgarhSix workers were killed and six injured after a structure collapsed at Godavari Ispat steel plant in Raipur, Chhattisgarh. Rescue operations are underway as more workers may be trapped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/how-16-year-old-ai-prodigy-is-shaping-the-future-of-technology-2794048-2025-09-26",
      "headline": "How a 16-year-old AI prodigy is shaping the future of technologyAt just 16, Raul John Aju has already made a mark as an AI prodigy, founder, and educator. From building robots at the age of 12 to teaching thousands globally, he is shaping the future of artificial intelligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywoods-incest-ridden-ending-aryan-khan-dares-a-taboo-2793861-2025-09-26",
      "headline": "The Ba***ds of Bollywood's incest-ridden ending: Aryan Khan dares a taboo'The Ba***ds of Bollywood' ends with a shocking incest twist that departs from mainstream storytelling norms. Aryan Khan's bold climax dares a Bollywood taboo, pushing screen entertainment into forbidden, uncharted territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/ladakh-protest-leh-how-became-part-of-india-zorawar-singh-kahluria-jammu-kashmir-dogra-king-china-tibet-history-2793647-2025-09-26",
      "headline": "Blood and snow: How Ladakh became a part of IndiaIt was the bravery and military campaign of Zorawar Singh Kahluria, a General of Jammu king Gulab Singh, that first brought Ladakh into the Dogra fold in 1834. The sale of Jammu and Kashmir by the British to Gulab Singh in 1846, and his great-grandson Hari Singh's signing of the treaty of accession in 1947, made Ladakh an integral part of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hardik-singh-mocks-pakistan-hockey-jet-gesture-india-dominance-2793994-2025-09-26",
      "headline": "Hardik Singh mocks Pakistan hockey team with fighter jet gestureIndia vice-captain Hardik Singh claimed that the rivalry between India and Pakistan doesn't exist in hockey any more. Hardik mocked the Pakistan team using the fighter jet gesture while talking at the India Today Conclave Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-deportation-sikh-grandmother-harjit-kaur-given-ice-instead-of-water-for-medicines-2793909-2025-09-26",
      "headline": "Given ice instead of water for meds: Harrowing tale of grandmother deported by USA 73-year-old Sikh grandmother, who had lived in the US for over three decades, was denied food and medicine during detention and handed only a plate of ice when she asked for water to take her medicine. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-baba-swami-chaitanyananda-saraswati-accused-of-sex-assault-denied-pre-arrest-bail-in-fraud-case-2793987-2025-09-26",
      "headline": "Delhi baba, accused of sex assault, denied pre-arrest bail in fraud caseSwami Chaitanyananda Saraswati has been accused of committing forgery and diverting money belonging to a trust. His plea seeking anticipatory bail in the case was rejected by a Delhi court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/zubeen-garg-songs-sorry-zubeen-da-i-misunderstood-you-2793735-2025-09-26",
      "headline": "Sorry Zubeen da, I misunderstood youI am sorry, I did not know any better, because social media, which can make people go viral overnight for the most trivial things, never brought forth the side of Zubeen, who was charitable, outspoken, and one who deeply loved his people, his Assam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-mohammad-kaif-criticism-fan-reactions-2794023-2025-09-26",
      "headline": "Stop crying: Jasprit Bumrah's response to Kaif's Asia Cup take divides opinionsAsia Cup 2025: Fast bowler Jasprit Bumrah has come under fire for calling out Mohammad Kaif's assessment of his performances in the continental tournament. While some have backed the Mumbai Indians star, many have questioned the need for him to respond to an opinion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-putin-su-57s-replace-khrushchev-mig-21s-iaf-fleet-2793948-2025-09-26",
      "headline": "Will Putin's Su-57s replace Khrushchev's MiG-21s in India?The MiG-21's retirement from the Indian Air Force brings the focus back to HAL's Soviet-built Nasik aircraft assembly line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-17-pro-bhagwa-rocking-in-india-as-orange-is-new-black-market-dealers-say-pay-extra-2793788-2025-09-26",
      "headline": "iPhone 17 Pro 'bhagwa' rocking in India as orange is new black marketThere were signs that the iPhone 17 Pro in Cosmic Orange — some Indian users are calling it \"bhagwa\" colour — would prove to be popular in India. After launch this has been confirmed, and so high is the demand for it that dealers are now selling it by charging extra for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-trailer-review-ayushmann-khurrana-struggles-with-love-legend-rajma-chawal-rashmika-mandanna-helps-2794055-2025-09-26",
      "headline": "Thamma trailer: Ayushmann, Rashmika promise folklore, fear and fun this DiwaliAyushmann Khurrana plays a vampire of sorts in 'Thamma', produced by Dinesh Vijan's Maddock Films. The film is a part of the Indian horror-comedy universe, and also features Rashmika Mandanna and Nawazuddin Siddiqui in lead roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-rjd-lalu-yadav-family-rift-rohini-acharya-kidney-donation-row-tejashwi-tej-pratap-sanjay-yadav-assembly-election-2025-2793525-2025-09-26",
      "headline": "Lalu's kidney spills RJD beansJust ahead of the Bihar Assembly election, a rift within the RJD's first family is out in the open. In 2022, Lalu Prasad Yadav's daughter, Rohini Acharya, donated her kidney to him in a transplant done in Singapore. Now, questions are being asked if Rohini was actually the donor. While she hints the doubts were being created at the behest of Tejashwi Yadav's trusted aide, Sanjay Yadav, her eldest brother, Tej Pratap Yadav, has sided with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-branded-pharma-drug-imports-impact-on-india-generic-medicines-explained-2793646-2025-09-26",
      "headline": "Trump slaps 100% tariff on branded pharma drug imports: Should India worry?For now, experts say that India's generic drug exports remain largely safe, though any future extension of US tariffs to generics could disrupt the sector and investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mercedes-benz-g-class-can-it-be-destroyed-we-tried-2793864-2025-09-26",
      "headline": "Can you destroy a Mercedes-Benz G-Class? We triedSUVs are born tough—or at least, that's how they should be. They're expected to take on every kind of terrain without hesitation. But can they really? Take the G-Class, for instance. With its high-end features and luxury touches, does it still have the grit and durability it was originally known for? Is it still the tough-as-nails SUV it was born to be? We set out to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/the-gucci-glow-up-alia-bhatts-boldest-fashion-era-yet-2793174-2025-09-26",
      "headline": "The Gucci glow-up: Alia Bhatt's boldest fashion era yetWith over a decade in the film industry, Alia's style has always been a source of inspiration - especially with her ethnic looks and effortlessly relatable choices. But ever since her Gucci contract, she's been pushing the envelope like never before, radiating a true global fashion appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-russia-sign-mega-nuclear-deal-will-build-25-billion-worth-of-4-nuclear-power-plants-2793947-2025-09-26",
      "headline": "Iran, Russia sign mega nuclear deal, will build 4 power plants worth $25 billionIran and Russia have signed a $25 billion nuclear deal to build four new power plants. The agreement boosts Tehran-Moscow energy ties amid global sanctions pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mig21-fighter-jet-iaf-indian-air-force-trainer-aircraft-turned-war-machine-into-flying-coffin-kargil-war-operation-sindoor-2793467-2025-09-26",
      "headline": "The MiG-21 truth: Pilots reveal the deadly power of F-16 killerFor over six decades, the MiG-21 defended India's skies and helped train generations of pilots. Yet, despite its reputation as a workhorse, upgrade and spares woes marred its legacy. As the Indian Air Force (IAF) restores its fleet of MiG-21, pilots who flew it defend the trusted war bird."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/shashi-tharoor-witty-comeback-to-suhel-seth-oxford-sole-mate-remark-goes-viral-2793669-2025-09-26",
      "headline": "Shashi Tharoor's witty comeback to Suhel Seth's Oxford 'sole mate' remark goes viralOn X, Suhel Seth shared a picture from Oxford University, the site where the Oxford English Dictionary was created, and joked that the dictionary was Shashi Tharoor's \"sole mate.\""
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-vs-pakistan-asia-cup-controversy-2794076-2025-09-26",
      "headline": "Harmanpreet Kaur on Asia Cup controversy vs Pakistan: We don't discuss those things India skipper Harmanpreet Kaur has made it clear that her side will not be distracted by the noise surrounding their Women's World Cup showdown with Pakistan, stressing that the team is only concentrating on matters within the boundary lines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-icc-suryakumar-yadav-fine-ind-vs-pak-comments-bcci-challenges-2794065-2025-09-26",
      "headline": "Suryakumar Yadav fined over comments in India vs Pak game. BCCI appeals decision Asia Cup 2025: India captain Suryakumar Yadav was fined 30 percent of his match fee for his comments that alluded to the cross-border hostilities between the two countries during India's group-stage match against Pakistan. Suryakumar had dedicated India's win over Pakistan on September 14 to the victims of the Pahalgam terror attack and the Indian armed forces.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-super-4-ind-vs-sl-live-score-suryakumar-yadav-charith-asalanka-2794046-2025-09-26",
      "headline": "Live Score: Sri Lanka opt to bowl, India make 2 changes India (IND) vs Sri Lanka (SL) Live Updates, Asia Cup Super 4: Sri Lanka have won the toss and opted to bowl first against India. Suryakumar Yadav makes two changes to the side. Bumrah and Dube make way for Arshdeep and Harshit Rana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-mohammad-kaif-criticism-fan-reactions-2794023-2025-09-26",
      "headline": "Stop crying: Jasprit Bumrah's response to Kaif's Asia Cup take divides opinions Asia Cup 2025: Fast bowler Jasprit Bumrah has come under fire for calling out Mohammad Kaif's assessment of his performances in the continental tournament. While some have backed the Mumbai Indians star, many have questioned the need for him to respond to an opinion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-haris-rauf-fined-match-fee-provocative-gesture-india-vs-pakistan-game-2794002-2025-09-26",
      "headline": "ICC fines Haris for provocative gesture in Ind vs Pak, Farhan let off with warning Pakistan fast bowler Haris Rauf has been fined 30 percent of his match fees for a provocative gesture during the high-voltage Asia Cup Super Four game against India in Dubai on September 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hardik-singh-mocks-pakistan-hockey-jet-gesture-india-dominance-2793994-2025-09-26",
      "headline": "Hardik Singh mocks Pakistan hockey team with fighter jet gesture India vice-captain Hardik Singh claimed that the rivalry between India and Pakistan doesn't exist in hockey any more. Hardik mocked the Pakistan team using the fighter jet gesture while talking at the India Today Conclave Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/harmanpreet-kaur-womens-world-cup-captain-meet-bengaluru-2793975-2025-09-26",
      "headline": "Harmanpreet Kaur excited to lead in special home Women's World Cup: Lot of expectations Women's World Cup 2025: In the captain's meet in Bengaluru, Harmanpreet Kaur said that she's excited to lead the Indian team in the upcoming mega event, starting September 30. Nat Sciver-Brunt, Alyssa Healy and Sophie Devine were also present at the meet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-kaif-clarifies-jasprit-bumrah-comments-asia-cup-2025-2793940-2025-09-26",
      "headline": "After Bumrah lashes out, Kaif tries to defuse tension with pacer Former cricketer Mohammed Kaif clarified his comments on Jasprit Bumrah after the Indian pacer slammed him. Bumrah called Kaif's analysis on him as inaccurate and the former cricketer decided to quickly defuse the situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-haris-rauf-fighter-jet-gesture-pakistan-women-odi-controversy-video-2793926-2025-09-26",
      "headline": "Pakistan women's captain imitates Haris Rauf's fighter jet gesture, video goes viral Pakistan women's captain Fatima Sana went viral after a video showed her imitating Haris Rauf's controversial fighter-jet gesture during the third ODI against South Africa in Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-haris-rauf-icc-hearing-gestures-not-guilty-2793918-2025-09-26",
      "headline": "Haris Rauf pleads not guilty, tells ICC 6-0 gesture not aimed at India: Sources Pakistan pacer Haris Rauf pleaded not guilty infront of the ICC panel after his gestures during the India vs Pakistan Asia Cup Super 4s clash courted controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-pakistan-vs-india-asia-cup-2025-final-message-2793904-2025-09-26",
      "headline": "Break India's aura, take them on: Shoaib Akhtar tells Pakistan before Asia Cup final Legendary pacer Shoaib Akhtar told Pakistan to go into the Asia Cup final with the aim of breaking India's aura. Pakistan defeated Bangladesh by 11 runs to progress to the summit clash of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/harmanpreet-kaur-womens-world-cup-captain-meet-bengaluru-2793975-2025-09-26",
      "headline": "Harmanpreet Kaur excited to lead in special home Women's World Cup: Lot of expectations Women's World Cup 2025: In the captain's meet in Bengaluru, Harmanpreet Kaur said that she's excited to lead the Indian team in the upcoming mega event, starting September 30. Nat Sciver-Brunt, Alyssa Healy and Sophie Devine were also present at the meet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-kaif-clarifies-jasprit-bumrah-comments-asia-cup-2025-2793940-2025-09-26",
      "headline": "After Bumrah lashes out, Kaif tries to defuse tension with pacer Former cricketer Mohammed Kaif clarified his comments on Jasprit Bumrah after the Indian pacer slammed him. Bumrah called Kaif's analysis on him as inaccurate and the former cricketer decided to quickly defuse the situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-haris-rauf-fighter-jet-gesture-pakistan-women-odi-controversy-video-2793926-2025-09-26",
      "headline": "Pakistan women's captain imitates Haris Rauf's fighter jet gesture, video goes viral Pakistan women's captain Fatima Sana went viral after a video showed her imitating Haris Rauf's controversial fighter-jet gesture during the third ODI against South Africa in Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-haris-rauf-icc-hearing-gestures-not-guilty-2793918-2025-09-26",
      "headline": "Haris Rauf pleads not guilty, tells ICC 6-0 gesture not aimed at India: Sources Pakistan pacer Haris Rauf pleaded not guilty infront of the ICC panel after his gestures during the India vs Pakistan Asia Cup Super 4s clash courted controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-pakistan-vs-india-asia-cup-2025-final-message-2793904-2025-09-26",
      "headline": "Break India's aura, take them on: Shoaib Akhtar tells Pakistan before Asia Cup final Legendary pacer Shoaib Akhtar told Pakistan to go into the Asia Cup final with the aim of breaking India's aura. Pakistan defeated Bangladesh by 11 runs to progress to the summit clash of the tournament. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}