{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-airlines-may-face-turbulence-as-pakistan-closes-its-skies-pahalgam-terror-attack-2715193-2025-04-25",
      "headline": "Indian airlines may face turbulence as Pakistan closes its skiesPakistan has announced shutting its airspace to Indian carriers as tensions rise between the two neighbours following a deadly militant attack in Indian Kashmir earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-to-invest-rs-1000-crore-in-tamil-nadu-plant-report-2715130-2025-04-25",
      "headline": "Samsung to invest Rs 1,000 crore in Tamil Nadu plant: ReportSamsung's Tamil Nadu factory currently employs over 2,000 people. In 2022–23, the plant contributed one-fifth of Samsung's Rs 1 lakh crore sales in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-589-points-lower-nifty-sustains-24000-level-adani-ports-ends-4-percent-lower-2715111-2025-04-25",
      "headline": "Sensex, Nifty close lower as rising India-Pakistan tension spooks investorsThe S&P BSE Sensex lost 588.80 points to end at 79,212.53, while the NSE Nifty50 was down 207.35 points to end at 24,039.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kashmir-economy-impact-tourism-sector-slowdown-pahalgam-terror-attack-india-pakistan-tension-2715110-2025-04-25",
      "headline": "Pahalgam terror attack casts big shadow on Kashmir's booming tourism economyKashmir was slowly rebuilding its image as a peaceful tourist destination after years of conflict, especially after the abrogation of Article 370 in August 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-revises-cut-off-timings-for-overnight-mutual-fund-redemptions-details-here-2715063-2025-04-25",
      "headline": "Sebi revises cut-off timings for overnight mutual fund redemptions. Details hereSebi aims to make sure stock brokers and clearing members use client funds wisely by investing in secure overnight mutual fund schemes (MFOS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-may-buy-10-boeing-planes-turned-down-by-china-report-trump-tariff-announcement-us-china-trade-war-2715010-2025-04-25",
      "headline": "Air India may buy 10 Boeing planes turned down by China: ReportThe ongoing trade tensions between the US and China, marked by steep duties above 100%, have impacted various sectors, even the aviation industry has taken a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-website-portal-crash-psx-down-india-tension-kashmir-attack-2714960-2025-04-25",
      "headline": "Pakistan Stock Exchange portal crashes amid rising geopolitical heatThe online portal of PSX showed a message saying \"We'll be back soon,\" indicating that the website was temporarily unavailable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-resident-shares-costly-homebuying-mistake-dont-fall-for-fomo-reddit-post-high-property-prices-2714958-2025-04-25",
      "headline": "Bengaluru resident shares costly homebuying mistake: 'Don't fall for FOMO'A social media user from Bengaluru shared that he has been living in Bengaluru for the past six years. Like many others, he moved to the city for better career opportunities. Despite being financially stable, he chose to rent rather than buy a flat. But the trouble started soon after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-crash-top-losers-sensex-nifty-india-pakistan-tension-kashmir-terror-attack-nse-bse-2714926-2025-04-25",
      "headline": "Sensex, Nifty tank: Indo-Pak tensions trigger market crash. Check top losersSensex plunged over 1,000 points, while Nifty tanked over 300 points, falling below 24,000 as uncertainty prevailed over geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-plans-to-make-all-us-iphones-in-india-by-2026-report-trump-tariff-announcement-reduce-china-dependency-2714911-2025-04-25",
      "headline": "Apple plans to make all US iPhones in India by 2026: ReportThe said move is part of Apple's long-term plan to reduce its dependence on China, especially after the recent tariff rules announced by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-latest-gmp-details-rs-3000-crore-public-listing-important-dates-grey-market-premium-2714896-2025-04-25",
      "headline": "Ather Energy IPO: Check latest GMP as Rs 3,000 crore public listing to open soonThe Ather Energy IPO will be a book-built issue. It consists of a fresh issue of 8.18 crore equity shares worth Rs 2,626 crore and an offer for sale (OFS) of 1.11 crore shares worth Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-nifty-falls-market-crash-kashmir-terror-attack-pakistan-nse-bse-dalal-street-red-2714878-2025-04-25",
      "headline": "Sensex falls 1,000 points: Why is stock market falling today despite early gains?Sensex and Nifty plunged more than 1% reacting to uncertainty over geopolitical tensions. The S&P BSE Sensex tanked 1,026.28 points to 78,775.15, while the NSE Nifty50 fell 330.40 points to 23,916.30 as of 11:41 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/whats-coming-and-going-on-cbs-2025-26-renewals-cancellations-and-new-shows-glbs-2715382-2025-04-26",
      "headline": "What's coming and going on CBS: 2025–26 renewals, cancellations, and new showsCBS's 2025–26 schedule features renewed hits like NCIS and Ghosts, the end of Blue Bloods and FBI spin-offs, and exciting new entries like Boston Blue and CIA.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sirens-trailer-new-thriller-explores-power-and-sisterhood-glbs-2715355-2025-04-26",
      "headline": "Sirens' trailer: New thriller explores power and sisterhoodNetflix's Sirens, starring Julianne Moore, Milly Alcock, and Meghann Fahy, explores power, class, and sisterhood in a gripping thriller set at a beach estate. It premieres May 22.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-with-family-at-chepauk-stadium-watch-csk-vs-srh-match-live-2715276-2025-04-25",
      "headline": "Ajith Kumar, with son on lap, watches CSK vs SRH match in Chepauk stadiumActor Ajith Kumar attended a cricket match at Chennai's Chepauk Stadium to watch MS Dhoni in action as CSK clashes with SRH. He was present with his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kull-trailer-out-nimrat-kaur-amol-parashar-riddhi-dogra-ekta-kapoors-upcoming-show-jiohotstar-2715272-2025-04-25",
      "headline": "Kull trailer: Raisingh siblings at war in Ekta Kapoor's upcoming showJioHotstar has released the trailer for 'Kull - The Legacy Of The Raisingghs'. The series, produced by Balaji Digital, will stream exclusively on the platform from May 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exploring-park-bo-gums-versatility-a-star-who-shines-across-time-and-genre-2715232-2025-04-25",
      "headline": "Exploring Park Bo-gum's versatility: A star who shines across time and genreSouth Korean actor Park Bo-gum captivated audiences once more with his latest K-drama 'When Life Gives You Tangerines'. His journey from 'Reply 1988' to this latest role showcased his immense talent and versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-shares-pics-from-hospital-reveals-reason-behind-social-media-absence-2715262-2025-04-25",
      "headline": "Zeenat Aman shares pics from hospital, reveals reason behind social media absenceVeteran actor Zeenat Aman has shared a heartfelt update post-hospitalisation, revealing her thoughts on life and social media. She reflects on her journey and the lessons learned during her recovery."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-solidarity-towards-pahalgam-attack-bohot-gussa-hai-exclusive-2715253-2025-04-25",
      "headline": "Nawazuddin Siddiqui reacts to Pahalgam attack: There's a lot of anger in usNawazuddin Siddiqui, during a film promotion event, expressed his solidarity with the victims of the Pahalgam attack by wearing a black band, highlighting his deep sense of anger and pain over the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nakuul-mehta-jankee-parekh-discuss-dal-chawal-parenting-their-t-shirts-steal-the-show-2715203-2025-04-25",
      "headline": "Nakuul-Jankee discuss dal-chawal parenting but their T-shirts steal the showActor Nakuul Mehta and his wife Jankee Parekh discussed their unique 'Dal-Chawal Parenting' approach on their podcast, while their T-shirts featuring characters from 'Sufi and Joker Bhaiya' become the highlight on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahira-khan-condemns-pahalgam-attack-deletes-post-later-2715230-2025-04-25",
      "headline": "Pakistani actor Mahira Khan condemns Pahalgam attack, deletes post laterPakistani actor Mahira Khan expressed her grief over the Pahalgam terror attack on Instagram. However, she deleted the post later. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-says-nana-patekar-made-a-producer-wash-dishes-after-serving-him-mutton-2715161-2025-04-25",
      "headline": "When Nana Patekar made a producer wash dishes after serving him muttonIn a candid revelation, Paresh Rawal shared an amusing incident involving Nana Patekar and a producer. The story highlighted how Nana made the producer wash dishes after treating him to mutton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-the-third-case-a-certificate-may-1-release-sailesh-kolanu-2715149-2025-04-25",
      "headline": "Nani's HIT 3 gets A certificate, film all set for May 1 releaseTelugu star Nani's 'HIT: The Third Case' has cleared censorship with an 'A' certificate. The film is gearing up for a grand release in theatres on May 1. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vir-das-wraps-record-breaking-mind-fool-world-tour-thanks-fans-2715084-2025-04-25",
      "headline": "Vir Das wraps record-breaking Mind Fool world tour, thanks fansVir Das has wrapped up his historic Mind Fool world tour, acclaimed as the largest by an Indian comedian. The tour not only showcased his wit to a global audience but also set the stage for his upcoming projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thudarum-movie-review-mohanlal-crime-drama-is-good-mix-of-thrills-and-punches-2715107-2025-04-25",
      "headline": "Thudarum review: Mohanlal's crime drama is good mix of thrills and punchesReleased-Fri Apr 25, 2025Thudarum film review: This crime drama, starring Mohanlal and Shobana, has been directed by Tharun Moorthy of Saudi Vellaka fame. Thudarum is an engaging film with a suspenseful storyline and some classic Mohanlal action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tahira-kashyap-returns-to-work-after-cancer-relapse-picture-abhi-baaki-hai-2715118-2025-04-25",
      "headline": "Tahira Kashyap returns to work after cancer relapse: Picture abhi baaki haiTahira Kashyap, filmmaker and author, has returned to work after facing a breast cancer relapse. She shared this 'life update' on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-review-emraan-hashmi-elevates-relevant-story-of-kashmir-silence-fury-2715080-2025-04-25",
      "headline": "Ground Zero review: Emraan Hashmi elevates relevant story of Kashmir's silence, furyReleased-Fri Apr 25, 2025Ground Zero movie review: The film is about a soldier's spirit, his idea of patriotism, and his search for peace in the 'highly sensitive' area. Emraan Hashmi brings a relevant film that comments on Kashmir's shifting skies wounded by terrorism. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kapkapiii-teaser-shreyas-talpade-tusshar-kapoor-lead-the-hindi-remake-of-romancham-2715070-2025-04-25",
      "headline": "Kapkapiii teaser: Shreyas Talpade leads the Hindi remake of RomanchamTusshar Kapoor and Shreyas Talpade star in 'Kapkapiii', a Hindi remake of the Malayalam horror-comedy Romancham. Directed by late Sangeeth Sivan, the film releases on May 23, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/superboys-of-malegaon-ott-release-when-and-where-to-watch-reema-kagtis-film-2715044-2025-04-25",
      "headline": "Superboys of Malegaon OTT release: When and where to watch Reema Kagti's filmReema Kagti and Varun Grover's 'Superboys of Malegaon' began streaming on Prime Video. It stars Adarsh Gourav, Vineet Kumar Singh, Shashank Arora, and Anuj Singh Duhan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sarkeet-trailer-out-asif-ali-divya-prabha-friendship-heartbreak-may-9-release-2715036-2025-04-25",
      "headline": "Sarkeet trailer: Asif Ali headlines powerful tale of friendship and heartbreakAsif Ali, Divya Prabha and Deepak Parambol have come together for the heartwarming story of 'Sarkeet'. The trailer of the film was released on Thursday."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-indus-waters-treaty-suspension-government-3-step-plan-stop-water-increase-dam-capacity-pahalgam-attack-2715229-2025-04-25",
      "headline": "India forms 3-step plan on Indus water to stop flow to PakistanIn response to the Pahalgam terror attack by Pak-based terrorists, India has suspended the 1960 Indus Waters Treaty and halted the flow of Indus River water to Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-spy-chief-tulsi-gabbard-condemns-islamist-terrorist-attack-jammu-kashmir-pahalgam-2715241-2025-04-25",
      "headline": "US will support India as it hunts down Pahalgam attackers: Tulsi GabbardThree days after terrorists killed 26 people in J&K's Pahalgam, US Director of National Intelligence Tulsi Gabbard condemned the Islamist terror attack and said that the US will support India as it hunts down the perpetrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-suspect-pony-ride-operator-detained-jammu-kashmir-2715208-2025-04-25",
      "headline": "Pony ride operator, who tourist claimed 'asked about religion', detained in J&KPahalgam terror attack: Police on Friday identified and detained a suspect after a video went viral on social media. Ekta Tiwari from Uttar Pradesh's Jaunpur claimed that the suspect asked her about her religion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bad-one-trump-condemns-pahalgam-attack-hopes-india-pak-will-settle-issues-glbs-2715372-2025-04-26",
      "headline": "'Bad one': Trump condemns Pahalgam attack, hopes India, Pak will settle issuesUS President Donald Trump called the Kashmir terror attack a \"bad one\" and expressed confidence that India and Pakistan will resolve the tensions. \"They'll get it figured out one way or the other,\" he said, adding that the region has seen conflict for centuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-air-force-aakraman-military-exercise-meaning-pakistan-pahalgam-terror-attack-2715095-2025-04-25",
      "headline": "Amid tensions with Pakistan, what does India's 'Aakraman' exercise indicate?India's frontline fighter jets and IAF's top pilots took part in a large-scale military exercise amid heightened tensions with Pakistan. History has ample proof to show that such exercises have preceded conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-pakistan-conflict-possible-military-scenarios-pahalgam-terror-attack-2715201-2025-04-25",
      "headline": "War Game: Forward-looking India-Pakistan conflict scenarioThere are numerous escalatory steps available to both India and Pakistan that have never been taken, offering room to innovate militarily while still avoiding nuclear red lines. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indus-waters-treaty-suspended-what-will-pakistan-consequences-droughts-floods-2715279-2025-04-25",
      "headline": "Floods or drought? Pak won't know what's coming now that Indus Treaty is shelvedUnder the Indus Waters Treaty, India was granted exclusive control over the eastern rivers - Ravi, Beas, and Sutlej - while Pakistan was given rights over the western rivers - Indus, Jhelum and Chenab - despite their origins in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pak-brotherly-neighbours-of-iran-tehran-offers-to-play-mediator-ties-nosedive-pahalgam-attack-2715266-2025-04-25",
      "headline": "Iran offers to play mediator between India, Pak as ties nosedive after J&K attackIran offered to mediate between India and Pakistan amid escalating tensions following a deadly terrorist attack in Jammu and Kashmir, with both countries taking retaliatory actions and the UN urging restraint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pakistan-airspace-shut-closed-international-trip-indian-airlines-long-flight-expensive-fare-seats-baggage-2715138-2025-04-25",
      "headline": "How Pakistan's airspace ban will affect your international travelAs political tensions escalate between India and Pakistan following the Pahalgam terror attack, Islamabad has closed its airspace to Indian carriers. Indian travellers planning an international trip should brace for turbulence - not just in the sky, but in their wallets and travel plans as well."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/fbi-arrests-wisconsin-judge-for-obstructing-anti-immigration-operation-2715294-2025-04-25",
      "headline": "FBI arrests judge for obstructing anti-immigration opThe FBI said a Wisconsin judge was arrested for obstructing an anti-immigration operation, agency director Kash Patel said. However, Patel's X post on the arrest was later deleted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-tests-scramjet-engine-for-over-1000-seconds-hypersonic-technology-leap-drdo-2715275-2025-04-25",
      "headline": "India tests scramjet engine for over 1,000 seconds in hypersonic technology leapDefence Research & Development Laboratory (DRDL), a Hyderabad-based laboratory of Defence Research and Development Organisation (DRDO), successfully carried out a ground test of the Scramjet engine for more than 1,000 seconds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorirst-attacks-jammu-and-kashmir-tourists-sisters-save-offer-shelter-2715333-2025-04-25",
      "headline": "Heroes amid horror: Teenagers chose not to flee but to save tourists in PahalgamDuring the terror attack in Pahalgam that claimed 26 lives, teenage sisters Rubeena and Mumtaza from the Gujjar-Bakerwal community emerged as unlikely heroes, rescuing panicked tourists and offering shelter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/all-the-outfits-jd-vance-usha-vance-kids-wore-india-trip-2715197-2025-04-25",
      "headline": "How the Vance family wore a bit of India during their 4-day trip hereFrom Usha Vance's red dress by a UK-based Indian designer to the Vance kids in lehengas and kurta sets, here's how the Vance family brought a touch of Indianness to their sartorial choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/pahalgam-terror-attack-operation-brasstacks-india-5-lakh-indian-army-troops-tanks-border-pakistan-war-scare-2714927-2025-04-25",
      "headline": "When India gave Pakistan war scare with 5 lakh troops on borderIn the winter of 1986-1987, India rolled out tanks and troops on a scale not seen in peacetime since World War II. India's Operation Brasstacks stunned Pakistan and made it scramble its military resources and reveal it had nuclear capability. As tensions soar after the Pahalgam massacre, here's a look at the India-Pakistan war that never was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/expel-pakistanis-amit-shah-directs-states-after-india-revoke-visas-2715048-2025-04-25",
      "headline": "Expel Pakistanis, Amit Shah directs states after India moves to cancel visasFollowing a high-level meeting with top officials, Union Home Minister Amit Shah instructed Chief Ministers of all states to take immediate steps to deport them, a day after India cancelled all existing visas for Pakistani nationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/international-law-india-suspend-indus-waters-treaty-pakistan-experts-pahalgam-terror-attack-2715313-2025-04-25",
      "headline": "International law allows India to suspend Indus Treaty with Pak: ExpertsIndia had previously also warned of suspending the Indus Waters Treaty with Pakistan as a retaliatory measure for continued cross-border terrorism. Now, following the Pahalgam terror attack, India has notified Pakistan of the suspension of the pact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-citizens-humour-troll-themselves-india-actions-pahalgam-terror-attack-2715154-2025-04-25",
      "headline": "As Pak sweats over India action, its citizens have a field day mocking themselvesAs India announced a raft of punitive measures against Pakistan, it seems that instead of losing sleep over the outcome, Pakistani citizens have taken to trolling themselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-minister-khawaja-asif-admits-backing-terrorists-united-states-pahalgam-attack-2714938-2025-04-25",
      "headline": "Been doing US's dirty work…: On live TV, Pak minister's big admission on terrorThe remark, a vindication of India's long-held stand, comes at a time when India has held Pakistan indirectly responsible for the terror attack in Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-force-jet-inadvertently-drops-non-explosive-air-store-on-madhya-pradesh-home-2715231-2025-04-25",
      "headline": "Air Force jet 'inadvertently drops non-explosive air store' on Madhya Pradesh homeThe Indian Air Force regretted the damage caused to a house in Madhya Pradesh's Shivpuri after one of its fighter jets inadvertently dropped a drop tank, which the force called a 'non-explosive aerial store' on the property."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/stop-wagah-attari-border-beating-retreat-not-military-parade-flag-lowering-ceremony-pahalgam-terror-attacks-2714974-2025-04-25",
      "headline": "Stop Wagah ceremony, it's not military parade but clownery, say some IndiansThe Border Security Force (BSF) has \"scaled down\" the Retreat Ceremony, popularly referred to as Beating Retreat, at the Attari-Wagah border after the Pahalgam terror attack. Some Indians are now demanding that the ceremony be stopped altogether, calling it \"cringe showmanship\" and \"clownery\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-review-emraan-hashmi-elevates-relevant-story-of-kashmir-silence-fury-2715080-2025-04-25",
      "headline": "Ground Zero review: Emraan Hashmi elevates relevant story of Kashmir's silence, furyReleased-Fri Apr 25, 2025Ground Zero movie review: The film is about a soldier's spirit, his idea of patriotism, and his search for peace in the 'highly sensitive' area. Emraan Hashmi brings a relevant film that comments on Kashmir's shifting skies wounded by terrorism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-centre-affidavit-waqf-amendments-law-concept-user-word-of-mouth-reply-petitions-challenge-2715075-2025-04-25",
      "headline": "Misleading narrative built on 'waqf by user': Centre defends law in Supreme CourtThe Centre argued that even if all waqfs, including 'waqf by user', had to be mandatorily registered under the original act of 1923, several private and government lands were claimed under 'waqf by user', leading to deprivation of valuable property rights of individuals and unauthorised claims over public properties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2016-how-to-punish-pakistan-2714044-2025-04-24",
      "headline": "From the India Today archives (2016) | How to punish PakistanAs calls for retribution continue to rise in response to the deadly terrorist attack on civilians in Pahalgam, we take a look back at an assessment of India's options in the aftermath of the Uri attack"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-man-stranded-in-bahrain-job-returns-home-kerala-in-thiruvanthapuram-passport-lost-manama-2715247-2025-04-25",
      "headline": "Passport lost, Indian stranded in Bahrain for 4 decades finally returns homeAn Indian, stranded in Bahrain for 42 years after losing his passport and travel documents, was reunited with his family in Kerala this week. Chandran Gopalan was reunited with his 95-year-old mother, but his father died in his absence. A Delhi-based NGO, Pravasi Legal Cell, helped in Gopalan's return home."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shreyas-iyer-ipl-2025-kkr-vs-pbks-sunil-joshi-2715359-2025-04-26",
      "headline": "Shreyas has shown hunger, ready to accept every challenge: Sunil JoshiIPL 2025, KKR vs PBKS: In the pre-match press conference, Punjab Kings' bowling coach Sunil Joshi was impressed with how Shreyas Iyer has upped his game over the last 8-10 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-harshal-patel-csk-vs-srh-chennai-2715357-2025-04-26",
      "headline": "How Harshal Patel plotted MS Dhoni's downfall in CSK vs SRH clashIPL 2025, CSK vs SRH: Harshal Patel said how he managed to dismiss MS Dhoni in the match on Friday, April 25, at the MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-ms-dhoni-reaction-defeat-playoffs-chances-2715353-2025-04-26",
      "headline": "Too many holes to plug: MS Dhoni reacts to CSK's torrid IPL 2025 campaignIPL 2025, CSK vs SRH: Captain MS Dhoni conceded that CSK have not been able to find answers to their problems despite giving opportunities to as many as 21 players in nine matches. CSK were outclassed by the SunRisers in Chennai on Friday, April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-pat-cummins-playoffs-chennai-chepauk-2715351-2025-04-26",
      "headline": "SRH to give a crack at making it to IPL 2025 playoffs: Pat Cummins after CSK winPat Cummins said that SRH will give a good crack at trying to reach the playoffs of the IPL 2025 season. SRH ended their jinx at the Chepauk and beat CSK on Friday, April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-csk-vs-srh-ipl-2025-playoffs-qualification-2715337-2025-04-25",
      "headline": "Chennai Super Kings can still qualify for playoffs. Here's howIPL 2025, CSK vs SRH: Chennai Super Kings can still enter the playoffs through the backdoor despite their five-wicket loss to the Sunrisers Hyderabad on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-chennai-out-playoffs-race-sunrisers-ms-dhoni-2715330-2025-04-25",
      "headline": "IPL 2025: Insipid CSK all but out of playoff race as SRH notch first away winIPL 2025, CSK vs SRH: Chennai Super Kings were comfortably outclassed by SunRisers Hyderabad, who collected two crucial points despite not being at their best. MS Dhoni's men are unlikely to make the playoffs after losing seven out of their first nine games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-gujarat-titans-steffan-jones-2715328-2025-04-25",
      "headline": "How Ishant Sharma found his mojo under coach and ally Steffan JonesIPL 2025: After losing his place in the Indian Test team in 2022, Ishant Sharma worked with Steffan Jones to get his rhythm back and make a strong comeback in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-sunil-narine-ipl-2025-kkr-vs-pbks-2715323-2025-04-25",
      "headline": "Chahal doesn't need to be reminded of his capabilities: Sunil JoshiIPL 2025: PBKS spin bowling coach Sunil Joshi heaped praise on Yuzvendra Chahal before the clash against the Kolkata Knight Riders on April 25 at the Eden Gardens in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-2025-korea-india-squad-no-neeraj-chopra-2715321-2025-04-25",
      "headline": "Neeraj Chopra to skip Asian Athletics Championships as India name 59-member squadIndia has revealed its squad for the Asian Athletics Championship, scheduled to be held from May 27 to 31 in South Korea. Neeraj Chopra will skip the event to focus on other major competitions, including the NC Classic in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-kavya-maran-celebrates-ms-dhoni-wicket-video-2715298-2025-04-25",
      "headline": "Watch: MS Dhoni wicket sparks contrasting emotions as Kavya Maran celebrates in ChepaukIPL 2025: While the rest of the Chennai crowd was silenced, SunRisers Hyderabad owner Kavya Maran celebrated MS Dhoni's wicket from the stands. CSK were bowled out for 154 in 19.5 overs on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-kkr-vs-pbks-moeen-ali-press-conference-kolkata-2715297-2025-04-25",
      "headline": "KKR still affected by record PBKS loss in Mullanpur? Moeen Ali reactsKKR all-rounder Moeen Ali has admitted that their record loss to PBKS in Mullanpur still lingers in their mind, but the defending champions will be looking to bounce back in the reverse fixture on April 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-gujarat-titans-steffan-jones-2715328-2025-04-25",
      "headline": "How Ishant Sharma found his mojo under coach and ally Steffan JonesIPL 2025: After losing his place in the Indian Test team in 2022, Ishant Sharma worked with Steffan Jones to get his rhythm back and make a strong comeback in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-sunil-narine-ipl-2025-kkr-vs-pbks-2715323-2025-04-25",
      "headline": "Chahal doesn't need to be reminded of his capabilities: Sunil JoshiIPL 2025: PBKS spin bowling coach Sunil Joshi heaped praise on Yuzvendra Chahal before the clash against the Kolkata Knight Riders on April 25 at the Eden Gardens in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-2025-korea-india-squad-no-neeraj-chopra-2715321-2025-04-25",
      "headline": "Neeraj Chopra to skip Asian Athletics Championships as India name 59-member squadIndia has revealed its squad for the Asian Athletics Championship, scheduled to be held from May 27 to 31 in South Korea. Neeraj Chopra will skip the event to focus on other major competitions, including the NC Classic in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-srh-kavya-maran-celebrates-ms-dhoni-wicket-video-2715298-2025-04-25",
      "headline": "Watch: MS Dhoni wicket sparks contrasting emotions as Kavya Maran celebrates in ChepaukIPL 2025: While the rest of the Chennai crowd was silenced, SunRisers Hyderabad owner Kavya Maran celebrated MS Dhoni's wicket from the stands. CSK were bowled out for 154 in 19.5 overs on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-kkr-vs-pbks-moeen-ali-press-conference-kolkata-2715297-2025-04-25",
      "headline": "KKR still affected by record PBKS loss in Mullanpur? Moeen Ali reactsKKR all-rounder Moeen Ali has admitted that their record loss to PBKS in Mullanpur still lingers in their mind, but the defending champions will be looking to bounce back in the reverse fixture on April 26. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}