{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-dismisses-195-trainees-after-failing-to-clear-internal-assessment-2716764-2025-04-29",
      "headline": "Infosys sacks 195 trainees over failed internal tests: ReportThe move marks the fourth such round of trainee terminations at India's second-largest IT services company, which is grappling with weak demand and flat revenue projections for the current fiscal year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-volatility-sensex-nifty-steady-explained-2716722-2025-04-29",
      "headline": "Dalal Street faces high volatility, but there is good news for investorsBy mid-morning, the Sensex was up around 100 points and holding above 80,302, while the Nifty50 traded above 24,300. That resilience marks a big shift from just a few weeks ago when even a whisper of bad news could send stocks crashing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-price-india-falling-why-reason-easing-trade-low-demand-safe-haven-expert-view-outlook-2716688-2025-04-29",
      "headline": "Explained: Why are gold prices not rising any moreGlobally, gold prices also dropped nearly 1%. Spot gold was down 0.8% at $3,314.99 an ounce, while US gold futures lost 0.7% to $3,325.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-day-2-check-latest-subscription-details-gmp-and-key-dates-2716683-2025-04-29",
      "headline": "Ather Energy IPO Day 2: Check latest subscription details, GMP and key datesAther Energy IPO Day 2: The IPO will remain open till April 30, giving investors a couple more days to weigh their options. Ather's offering is a combination of fresh shares and an offer-for-sale from existing investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gensol-engineering-ed-raid-shares-hit-52-week-low-lower-circuit-after-ed-raids-gurgaon-ahmedabad-offices-2716678-2025-04-29",
      "headline": "Gensol Engineering shares hit 52-week low after ED raids officesGensol ED raid: The company's stock continued to face heavy selling pressure, falling to Rs 81.36, which is its 52-week low. Gensol shares have now lost over 50% of their value in the last one month and nearly 90% over the past six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-tata-motors-sona-blw-samvardhana-motherson-and-other-auto-stocks-are-rising-today-2716674-2025-04-29",
      "headline": "Explained: Why Tata Motors, Samvardhana Motherson and other auto stocks are risingBy 9:50 am, Tata Motors shares were up 1.2% at Rs 676.45, while Samvardhana Motherson gained 1.4% to Rs 136.85 on the Bombay Stock Exchange. Although some of the early gains were trimmed by profit booking, the auto sector stood out in an otherwise cautious market. Sona BLW shares were trading 3.2% higher at Rs 478.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-share-price-extends-stock-market-rally-buy-hold-sell-brokerage-views-what-next-2716668-2025-04-29",
      "headline": "Reliance shares are gaining momentum after strong Q4. Can the rally last?Following the Q4 result announcement, RIL stock jumped nearly 5%. Even today, the stock has jumped 1.5% in early trade. Now the question is: is this just a relief rally — or the start of something bigger?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-300-points-higher-nifty-above-24400-indusind-bank-up-2-percent-bse-nse-2716658-2025-04-29",
      "headline": "Sensex, Nifty extend winning run boosted by FII buying; Tata Motors gains 2%The S&P BSE Sensex jumped 419.40 points to 80,637.41, while the NSE Nifty50 gained 122.45 points to 24,450.95 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-listing-gains-investment-gmp-today-rs-1-subscribe-skip-good-bad-2716653-2025-04-29",
      "headline": "Ather Energy IPO: Looking to invest? Check latest subscription and GMPThe price band for the IPO has been set between Rs 304 and Rs 321 per share. Retail investors need to apply for a minimum of one lot, which consists of 46 shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-stock-market-today-nse-bse-trading-fii-buying-trade-tensions-ease-2716638-2025-04-29",
      "headline": "Stock market opening: Sensex, Nifty likely to continue their rally. Here's whyGift Nifty futures were trading at 24,484.5 as of 7:16 am, showing that the Nifty50 is likely to start the day higher than Monday's closing level of 24,328.5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-april-29-shares-in-focus-today-bajaj-finance-indusind-wipro-adani-green-gensol-nse-bse-sensex-nifty-2716634-2025-04-29",
      "headline": "Stocks to watch today: Bajaj Finance, IndusInd Bank, Wipro, Adani Green, GensolSeveral companies, including Bajaj Finance, Bajaj Finserv, Bharat Petroleum Corporation, Ambuja Cements, etc are set to announce their fourth-quarter (Q4) results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-bribes-no-queues-founder-praises-dubai-smooth-business-setup-vs-india-struggles-2716395-2025-04-28",
      "headline": "No bribes, no queues: Founder compares business setup in Dubai vs IndiaSharing his story on Reddit, the founder said he recently set up a business in one of Dubai's free zones and was amazed at how smooth the whole process was. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-higher-fd-returns-rbl-and-union-bank-offer-up-to-85-percent-to-select-customers-2716348-2025-04-28",
      "headline": "Want higher FD returns? RBL and Union Bank offer up to 8.5% to select customersAfter the latest revision, Union Bank of India now offers FD interest rates ranging from 3% to 7.15% for regular customers, depending on the deposit tenure (7 days to 10 years).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zoho-ceo-sridhar-vembu-calls-ai-impact-on-jobs-small-2716280-2025-04-28",
      "headline": "Zoho CEO Sridhar Vembu calls AI's impact on jobs 'small'Vembu pointed out that while AI vendors are promising big changes, real-world studies, including one titled 'Large Language Models, Small Labor Market Effects', show a different picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-1000-points-higher-nifty-above-24300-ril-up-5-percent-2716276-2025-04-28",
      "headline": "Sensex, Nifty surge over 1% as Reliance rally and FII buying lift marketsThe S&P BSE Sensex jumped over 1,000 points to close at 80,218.37, while the NSE Nifty50 gained 289.15 points to end at 24,328.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-trade-war-recession-fears-impact-threat-economists-2716271-2025-04-28",
      "headline": "Trump's tariffs are raising recession fears. How bad could it get?Just three months ago, economists covering nearly 50 economies had forecast a steady, healthy pace of global growth. But Trump's decision to slap sweeping tariffs, including a 10% blanket duty on all US imports and a 145% tariff on goods from China, has upset those expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-falling-why-reasons-us-dollar-strong-trade-relation-china-what-to-expect-2716269-2025-04-28",
      "headline": "Gold prices continue falling: What is driving the prices low?Gold is often seen as a safe place to store value during times of political and financial uncertainty. It touched an all-time high of $3,500.05 per ounce last week because of trade tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-regime-why-it-is-more-beneficial-for-salaried-employees-itr-filing-2025-standard-deduction-rs-75000-2716216-2025-04-28",
      "headline": "New Income tax regime: Why is it more beneficial for salaried employeesThe new tax regime also offers a higher standard deduction. Last year, it was raised from Rs 50,000 to Rs 75,000 for salaried employees. In the old regime, the standard deduction remains at Rs 50,000. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-rally-10-percent-indo-pak-tensions-rise-which-shares-should-you-buy-grse-hal-bel-paras-2716212-2025-04-28",
      "headline": "Defence stocks rally up to 10% as Indo-Pak tensions rise. Should you buy?The Nifty Defence index rose by 4.5%, marking its biggest intraday gain since April 15, 2025. Out of the eighteen companies that form the index, seventeen were trading higher. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-simplifies-pf-transfer-process-updates-form-15-check-how-it-impacts-employees-2716166-2025-04-28",
      "headline": "EPFO simplifies PF transfer process. Check how it impacts employeesThe new revision is expected to benefit over 1.25 crore members and will speed up the transfer of Rs 90,000 crore of PF funds annually, ensuring that employees can access and manage their retirement savings without any trouble after changing jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-ticks-up-volatility-expectations-climb-to-two-year-peak-2716133-2025-04-28",
      "headline": "Rupee ticks up, volatility expectations climb to two-year peakThe rupee was at 85.26 against the US dollar as of 11:00 am, up from its close at 85.45 in the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-form-16-getting-a-makeover-heres-all-you-need-to-know-2716130-2025-04-28",
      "headline": "ITR Filing 2025: What's new in your Form 16? Here's all you need to knowForm 16 is a certificate that an employer gives to an employee, which shows how much salary he earned and how much tax they deducted from it on the employee's behalf. It's proof that your taxes have been properly paid to the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-airspace-close-india-flights-huge-loss-millions-overflight-fees-reroute-pahalgam-attack-2716107-2025-04-28",
      "headline": "Explained: How Pakistan could lose millions after closing airspace for IndiaPakistan's decision to close its airspace to Indian airlines, after India's diplomatic move against Pakistan over the Pahalgam terror attack, is likely to cause disruptions on several key international routes, particularly flights departing from North India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-subcribe-or-not-latest-gmp-brokerage-views-price-band-allotment-date-2716104-2025-04-28",
      "headline": "Ather Energy IPO: Should you subscribe or not?Ather Energy IPO: The IPO is a book-built offer worth Rs 2,980.76 crore, comprising a fresh issue of 8.18 crore equity shares valued at Rs 2,626.30 crore and an offer for sale (OFS) of 1.11 crore shares aggregating Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-sensex-nifty-rising-today-check-top-factors-dalal-street-rally-2716082-2025-04-28",
      "headline": "Sensex jumps over 1,000 points. 3 reasons behind today's stock market rallyStock market today: At around 12:20 pm, the S&P BSE Sensex was trading 1008.25 points higher at 80,220.78, while the NSE Nifty50 rose 239.90 points to 24,279.05., while the NSE Nifty50 rose 237.10 points to 24,276.45. All broader market indices were also firmly in positive territory, signalling the potential for a strong session ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-jumps-after-q4-results-buy-hold-sell-2716075-2025-04-28",
      "headline": "Reliane shares jump over 4% after strong Q4 results. Buy, hold or sell?The Mukesh Ambani-led conglomerate reported a 2% rise in consolidated net profit to Rs 19,407 crore, beating analysts' expectations of around Rs 18,471 crore. Revenue from operations for the quarter grew 10% year-on-year to Rs 2.64 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-jumps-350-points-nifty-above-24100-ril-gains-2-percent-mahindra-shares-rise-2716061-2025-04-28",
      "headline": "Sensex, Nifty rally driven by Reliance boost and positive Asian market trendsThe S&P BSE Sensex added 558.35 points to 79,770.88, while the NSE Nifty50 gained 155.75 points to 24,195.10as of 9:47 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-open-subscribe-skip-latest-gmp-expert-view-details-important-dates-price-band-allotment-2716060-2025-04-28",
      "headline": "Ather Energy IPO opens for bidding: Should you subscribe? Check latest GMPAther Energy IPO is a book-built issue worth Rs 2,980.76 crore. It includes a fresh issue of 8.18 crore shares aggregating to Rs 2,626.30 crore, and an offer for sale (OFS) of 1.11 crore shares worth Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-stock-market-opening-april-28-trading-nse-bse-dalal-street-2716040-2025-04-28",
      "headline": "Sensex, Nifty opening: Will stock market rise or fall today?The situation between India and Pakistan remains tense after the recent attack in Kashmir. This tension pulled down both the Sensex and Nifty on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-28-ril-idfc-first-bank-mahindra-axis-bank-2716027-2025-04-28",
      "headline": "Stocks to watch on April 28: RIL, IDFC First Bank, Mahindra, Axis BankVarious stocks are likely to see big movements today, April 28, as several companies are set to announce their quarterly earnings and other key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-lifted-171-million-people-extreme-poverty-2012-to-2022-world-bank-data-2715692-2025-04-27",
      "headline": "India lifted 171 million people from extreme poverty from 2012 to 2022: World BankRural extreme poverty dropped from 18.4 per cent to 2.8 per cent, and urban from 10.7 per cent to 1.1 per cent, narrowing the rural-urban gap from 7.7 to 1.7 percentage points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-online-pf-transfers-form-13-job-change-uan-2715484-2025-04-26",
      "headline": "Changing jobs? Check this EPFO update on PF transfersEffective January 2025, the requirement for employer approval in most transfer cases has been eliminated. Previously, PF balance transfers required coordination between source and destination EPFO offices, often causing delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/e-commerce-crops-data-storage-top-india-us-trade-deal-negotiations-report-2715475-2025-04-26",
      "headline": "E-commerce, crops, data storage top India-US trade deal negotiations: ReportDiscussions will now begin on issues such as market access for US farm goods, India's data localisation rules, and the role of big tech in e-commerce—areas that have previously proved politically sensitive in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-airlines-may-face-turbulence-as-pakistan-closes-its-skies-pahalgam-terror-attack-2715193-2025-04-25",
      "headline": "Indian airlines may face turbulence as Pakistan closes its skiesPakistan has announced shutting its airspace to Indian carriers as tensions rise between the two neighbours following a deadly militant attack in Indian Kashmir earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-to-invest-rs-1000-crore-in-tamil-nadu-plant-report-2715130-2025-04-25",
      "headline": "Samsung to invest Rs 1,000 crore in Tamil Nadu plant: ReportSamsung's Tamil Nadu factory currently employs over 2,000 people. In 2022–23, the plant contributed one-fifth of Samsung's Rs 1 lakh crore sales in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-589-points-lower-nifty-sustains-24000-level-adani-ports-ends-4-percent-lower-2715111-2025-04-25",
      "headline": "Sensex, Nifty close lower as rising India-Pakistan tension spooks investorsThe S&P BSE Sensex lost 588.80 points to end at 79,212.53, while the NSE Nifty50 was down 207.35 points to end at 24,039.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kashmir-economy-impact-tourism-sector-slowdown-pahalgam-terror-attack-india-pakistan-tension-2715110-2025-04-25",
      "headline": "Pahalgam terror attack casts big shadow on Kashmir's booming tourism economyKashmir was slowly rebuilding its image as a peaceful tourist destination after years of conflict, especially after the abrogation of Article 370 in August 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-revises-cut-off-timings-for-overnight-mutual-fund-redemptions-details-here-2715063-2025-04-25",
      "headline": "Sebi revises cut-off timings for overnight mutual fund redemptions. Details hereSebi aims to make sure stock brokers and clearing members use client funds wisely by investing in secure overnight mutual fund schemes (MFOS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-may-buy-10-boeing-planes-turned-down-by-china-report-trump-tariff-announcement-us-china-trade-war-2715010-2025-04-25",
      "headline": "Air India may buy 10 Boeing planes turned down by China: ReportThe ongoing trade tensions between the US and China, marked by steep duties above 100%, have impacted various sectors, even the aviation industry has taken a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-website-portal-crash-psx-down-india-tension-kashmir-attack-2714960-2025-04-25",
      "headline": "Pakistan Stock Exchange portal crashes amid rising geopolitical heatThe online portal of PSX showed a message saying \"We'll be back soon,\" indicating that the website was temporarily unavailable."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-hated-himself-on-first-day-of-jewel-thief-shoot-says-he-was-lost-2716732-2025-04-29",
      "headline": "Saif Ali Khan 'hated' himself on first day of Jewel Thief shoot, says he was 'lost'Actor Saif Ali Khan admitted that he didn't know what he was doing on the first day of shooting for 'Jewel Thief'. 'Jewel Thief' premiered on Netflix on April 25 and also stars Jaideep Ahlawat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/criminal-justice-4-teaser-pankaj-tripathi-returns-with-another-intriguing-case-2716728-2025-04-29",
      "headline": "Criminal Justice 4 teaser: Pankaj Tripathi returns with another intriguing caseThe teaser for Pankaj Tripathi's 'Criminal Justice-A Family Matter' is out. The new season marks Tripathi's return along with an ensemble star cast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-on-entering-politics-visiting-temples-doesnt-mean-i-am-joining-bjp-2716690-2025-04-29",
      "headline": "Preity Zinta on entering politics: Visiting temples doesn't mean I am joining BJPActor Preity Zinta addressed the rumours of her joining politics. In a chat on X, she responded to a question, also expressing how living abroad deepened her love for India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-11-detailed-report-akshay-kumar-film-on-impressive-run-in-second-week-2716684-2025-04-29",
      "headline": "Kesari 2 box office Day 11: Akshay Kumar's film on impressive run in second weekAkshay Kumar's 'Kesari Chapter 2' has entered its second week and is performing decently well at the box office. The film is surprisingly making good numbers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-3-actor-rohit-basfore-found-dead-in-guwahati-waterfall-2716676-2025-04-29",
      "headline": "The Family Man 3 actor Rohit Basfore found dead near Guwahati waterfallActor Rohit Basfore was found dead in the Garbhanga Waterfalls near Guwahati on Sunday. He also reportedly shot for 'The Family Man 3' recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-mother-biggest-cheerleader-comeback-video-till-i-say-it-is-hits-10-million-views-2716672-2025-04-29",
      "headline": "Apoorva Mukhija's shout out to her mother as comeback video hits 10 million viewsActor and YouTuber Apoorva Mukhija's comeback video, after India's Got Latent row, clocked in 10 million views on YouTube. She shared a screenshot of her conversation with her mother and called her the biggest cheerleader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-on-pahalgam-attack-kashmiris-are-angry-nation-stands-united-2716662-2025-04-29",
      "headline": "Kashmiris are angry, nation stands united: Nawazuddin Siddiqui on Pahalgam attackActor Nawazuddin Siddiqui spoke about the Pahalgam terror attack, and highlighted the deep sense of hurt and anguish that Kashmiris feel after 26 tourists were killed on their land in Pahalgam in an open-fire by terrorists last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ranveer-allahbadia-flies-abroad-after-indias-got-latent-row-passport-mil-gaya-2716651-2025-04-29",
      "headline": "Ranveer Allahbadia flies abroad after India's Got Latent row: Passport mil gayaYouTuber and podcaster Ranveer Allahbadia is off on his first international trip after his passport was returned amid India's Got Latent row. He shared photos of him from the airport and inside the aeroplane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/andaz-apna-apna-59-year-old-salman-khan-looks-drop-dead-dashing-in-pool-pics-2716643-2025-04-29",
      "headline": "Andaz Apna Apna! 59-year-old Salman Khan looks drop-dead dashing in pool picsActor Salman Khan shared a few shirtless photos on social media. He also teased the fans about the re-release of his 'Andaz Apna Apna', which is now running in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/halle-berry-payal-kapadia-jeremy-strong-cannes-2025-jury-members-2716639-2025-04-29",
      "headline": "India's Payal Kapadia, Halle Berry, and others join Cannes 2025 as jury membersIndian filmmaker Payal Kapadia, who won the historic Grand Prix for 'All We Imagine As Light' last year, has joined Cannes 2025 as a jury member. Halle Berry, Jeremy Strong and several others are part of the jury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-pahalgam-attack-reaction-no-fighting-let-us-respect-every-religion-caste-2716628-2025-04-29",
      "headline": "Ajith Kumar calls for peace after Pahalgam attack: Let's not fight among ourselvesActor Ajith Kumar reacted to Pahalgam attack after receiving Padma Bhushan award in New Delhi. He called for peace and said that everyone should learn to respect each other, every religion and caste and end the fights within ourselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/binge-worthy-alert-7-must-see-netflix-series-glbs-2716604-2025-04-29",
      "headline": "Binge-worthy alert: 7 must-see Netflix seriesNetflix's latest lineup offers thrilling dramas, heartfelt journeys, culinary masterpieces, and dark twists. From Love on the Spectrum to You's final season, there's something exciting for every viewer.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/autopsy-reveals-heart-disease-and-alzheimers-led-to-gene-hackmans-death-glbs-2716591-2025-04-29",
      "headline": "Autopsy reveals heart disease and Alzheimer's led to Gene Hackman's deathGene Hackman died from heart disease and advanced Alzheimer's, an autopsy confirms. His wife, Betsy Arakawa, likely died days earlier from hantavirus. Investigations continue into the couple's tragic deaths.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/video/shraddha-arya-returns-to-kumkum-bhagya-set-after-maternity-break-2716445-2025-04-28",
      "headline": "Watch: Actor Shraddha Arya returns to Kumkum Bhagya set after maternity breakActor Shraddha Arya has returned to work after a maternity break. The actor will reprise her role as Preeta on the show. She welcomed twins, a baby boy and a baby girl, on November 29, 2024, with her husband Rahul Nagal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-clarifies-ai-generated-poster-as-guru-nanak-dev-goes-viral-2716442-2025-04-28",
      "headline": "Aamir Khan clarifies after his AI-generated poster as Guru Nanak goes viralAamir Khan's team recently clarified the AI-generated poster that falsely depicted the actor as Guru Nanak Dev. A fake YouTube channel circulated the content, sparking outrage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ajith-kumar-nandamuri-balakrishna-shekhar-kapur-honourd-at-padma-awards-2716382-2025-04-28",
      "headline": "Ajith Kumar, Shekhar Kapur honoured with Padma BhushanAjith Kumar, Nandamuri Balakrishna and Shekhar Kapur bagged Padma Awards in New Delhi on April 28. The actors received the prestigious award from President Droupadi Murmu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/veteran-malayalam-director-shaji-karun-dies-of-cancer-at-73-2716383-2025-04-28",
      "headline": "Veteran Malayalam director Shaji Karun dies of cancer at 73Renowned filmmaker Shaji N Karun, who made significant contributions to Malayalam cinema and earned accolades like the Padma Shri, has died at 73 after a prolonged battle with cancer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/you-season-5-review-a-disappointing-predictable-goodbye-to-joe-goldberg-2715693-2025-04-28",
      "headline": "You Season 5 review: A disappointing, predictable goodbye to Joe GoldbergReleased-Thu Apr 24, 2025The psychological thriller 'You', starring Penn Badgley as the show-runner, premiered its season finale on April 24. The show concludes its journey with Joe Goldberg facing the consequences of his dark past while navigating personal turmoil. As the final season unfolds, familiar faces and new challenges emerge, questioning whether redemption or downfall awaits him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-to-re-release-in-theatres-october-2025-films-eighth-anniversary-2716328-2025-04-28",
      "headline": "Baahubali returns to theatres in 2025, confirms producer on 8th anniversary'Baahubali' is all set to re-release in theatres this October. On the film's eighth anniversary, producer Shobu Yarlagadda announced that the film will be back in theatres with new surprises. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-plot-baisaran-valley-kashmir-firing-exit-gate-tourists-2716756-2025-04-29",
      "headline": "Firing at exit gate, tourists ran toward entry and then…: Pahalgam terror plotFiring at exit gate, tourists ran toward entry and then…: Pahalgam terror plot"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-closes-tourist-destinations-after-intel-warning-more-terror-attacks-security-agencies-government-2716661-2025-04-29",
      "headline": "48 tourist destinations in Kashmir closed after intel on more terror attacks  Live UpdatesIntelligence reports suggest that terrorists are planning targeted killings and a larger attack in retaliation for the destruction of terrorists' houses following last week's Pahalgam strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-election-results-mark-carney-liberals-win-what-it-means-for-india-khalistan-issue-2716734-2025-04-29",
      "headline": "As Canada's Mark Carney wins election, what it means for IndiaWith Mark Carney set to be back as Canadian Prime Minister, scripting a dramatic reversal in fortunes for the Liberals in the polls, ties with India seem to be in for a reset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-story-coach-manish-ojha-exclusive-2716715-2025-04-29",
      "headline": "'At 10, Vaibhav Suryavanshi hit 90m sixes': The making of IPL's 14-year-old phenomIPL 2025: Speaking to IndiaToday.in, Vaibhav Suryavanshi's childhood coach, Manish Ojha, lifted the lid on the 14-year-old's scarcely believable six-hitting prowess. A Brian Lara fan, the Rajasthan Royals opener smashed 11 sixes on his way to scoring the fastest century by an Indian in IPL history in Jaipur on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-2/",
      "headline": "Terrorism in Kashmir: Nine years of calm before icy stormIn part 2 of our series on the history of terrorism in Kashmir, we revisit the calm before the storm that prevailed from 1980 to the summer of 1989."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-government-pegasus-spyware-what-is-wrong-terrorists-anti-national-elements-hearing-petitions-2716760-2025-04-29",
      "headline": "What's wrong in using spyware on anti-nationals? Supreme Court on Pegasus rowWhat's wrong if government uses spyware against anti-national elements: Supreme Court on Pegasus row"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/forget-indus-waters-treaty-india-pakistan-protests-blockade-sindh-army-backed-canal-crisis-punjab-2716716-2025-04-29",
      "headline": "Forget Indus waters, Pakistan has huge canal crisis at homeMassive protests in Sindh have forced the Pakistani government to shelve an Indus canals project that was reportedly intended to serve the interests of the army. Despite the government's announcement, people haven't lifted a blockade of the highways in Sindh, cutting off Punjab and transport to and from the Karachi Port. A lakh truckers and helpers are stranded, and fresh woe grips Pakistan's tattered economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-considering-shutting-airspace-pakistani-airlines-ports-ships-discussed-days-after-pahalgam-terror-attack-tourists-2716736-2025-04-29",
      "headline": "India considering shutting airspace to Pak airlines, banning ships: SourcesIndia is considering closing airspace to Pakistani airlines and imposing a ban on Pakistani ships at Indian ports in retaliation for the Pahalgam terrorist attack. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/monsoon-changes-threaten-bay-of-bengal-your-favourite-fish-curry-is-at-risk-2716733-2025-04-29",
      "headline": "Bay of Bengal under threat: Fish may soon vanish from your mealsThe Bay of Bengal, covering less than 1% of the global ocean, supplies nearly 8% of the world's fishery production, including critical species like hilsa, a dietary staple for coastal communities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-pakistan-army-alert-loc-tension-india-response-2716655-2025-04-29",
      "headline": "Live:  PM to chair 2nd key meeting on J&K attack tomorrow, says sourcesPahalgam Attack Live Updates: Tensions between India and Pakistan escalated after a terror attack in Jammu and Kashmir's Pahalgam claimed 26 lives. India took strong diplomatic measures against the neighbouring country after The Resistance Front, an offshoot of a Pakistan-based terror group Laskar-e-Taiba, claimed the attack. The Pak side violated ceasefire along the LoC for fifth straight night on April 29, prompting strong retaliation from the Indian Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-radar-systems-line-of-control-fearing-india-airstrikes-pahalgam-terror-attack-2716665-2025-04-29",
      "headline": "Fearing air strikes by India, Pakistan moves radar systems along borderThe Pakistani army is moving its radar systems to forward locations in the Sialkot sector to detect possible Indian airstrikes, according to exclusive information received by India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-student-in-canada-vanshika-missing-for-two-days-found-dead-embassy-2716632-2025-04-29",
      "headline": "AAP leader's 21-year-old daughter, missing for 3 days, found dead at Canada beachA missing Indian student in Canada, Vanshika, was found dead and local authorities are investigating the cause of death, the Indian Embassy in Canada said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncert-rhinos-not-okay-mathematics-class-four-wrong-two-horn-indian-one-assam-kaziranga-park-himanta-2716761-2025-04-29",
      "headline": "NCERT on rhinos: Not okay, horn pleaseThe NCERT class 4 maths textbook has a section filled with errors and people are pointing it out. A small box on rhinoceroses in the textbook has a problematic statement, and the Indian rhino's image has been wrongly depicted with two horns. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-ex-gujarat-top-cop-plea-custodial-death-case-2716699-2025-04-29",
      "headline": "Supreme Court denies bail to ex-IPS officer Sanjiv Bhatt in custodial death caseThe Supreme Court dismissed former IPS officer Sanjiv Bhatt's bail plea in the 1990 custodial death case but agreed to expedite the hearing of his appeal against his life sentence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-what-happened-uri-2016-pulwama-2020-balakot-counter-strikes-india-pakistan-2716154-2025-04-29",
      "headline": "Pahalgam attack: What happened in the run-up to India's Uri, Pulwama counter-strikesIndia has begun its offensive against Pakistan over the Pahalgam massacre with diplomatic initiatives and briefing key countries. What did the run-up to India's cross-border strikes after the Uri (2016) and Pulwama (2019) terror attacks look like? Is there any similarity in the developments?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-election-sikh-leader-jagmeet-singh-loses-resigned-ndp-leader-british-columbia-2716685-2025-04-29",
      "headline": "Jagmeet Singh loses Canada polls, resigns as NDP leader: Disappointed but hopefulJagmeet Singh, a pro-Khalistani leader and the first ethnic minority to lead a major Canadian federal party, resigned as NDP chief following a devastating election loss that cost him his seat and left the party on the verge of losing its national status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-to-test-bacteria-gaganyaan-life-support-system-2716721-2025-04-29",
      "headline": "Indian astronaut to test rare bacteria in space to boost GaganyaanResults could resolve key challenges in maintaining microbial-based systems during long-duration missions, such as those planned for Gaganyaan, India's first crewed orbital mission slated for 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-price-india-falling-why-reason-easing-trade-low-demand-safe-haven-expert-view-outlook-2716688-2025-04-29",
      "headline": "Explained: Why are gold prices not rising any moreGlobally, gold prices also dropped nearly 1%. Spot gold was down 0.8% at $3,314.99 an ounce, while US gold futures lost 0.7% to $3,325.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-united-nations-pahalgam-attack-khwaja-asif-sponsoring-terror-rogue-state-2716630-2025-04-29",
      "headline": "Your Minister admitted to...: India shreds 'rogue state' Pakistan at UNCalling India a \"victim of cross-border terrorism,\" the Deputy Ambassador pointed to Pakistan Defence Minister Khwaja Asif's \"open confession\" regarding Pakistan's history of supporting terrorist groups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kozhikode-police-notice-pakistani-nationals-leave-india-withdrawn-pahalgam-attack-2716602-2025-04-29",
      "headline": "Notices asking three Pakistanis to leave Kerala withdrawn. Here's whyAmid heightened tensions between India and Pakistan following the Pahalgam terror attack, police have withdrawn notices issued to three Pakistani nationals living in Kerala's Kozhikode after they were found to have long-term visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-hugs-fans-signs-autographs-clicks-selfies-on-germany-trip-2716766-2025-04-29",
      "headline": "SRK hugs emotional fans, signs autographs, clicks selfies on Germany tripShah Rukh Khan recently delighted his fans by signing autographs, posing for photos, and sharing warm hugs during his recent trip to Germany. Several videos of the actor with his fans have gone viral. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-army-provokes-firing-line-of-control-jammu-kashmir-again-fifth-straight-day-indian-army-retaliates-pahalgam-terror-2716622-2025-04-29",
      "headline": "Pak Army continues cross-border firing for 5th day, Indian troops retaliateThe Pakistan Army resorted to unprovoked small arms firing across multiple locations along the Line of Control, prompting a measured Indian Army response, amid escalating tensions following the Pahalgam terror attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhopal-gang-rape-case-women-raped-blackmailed-drugged-ajmer-sex-scandal-similarity-2716624-2025-04-29",
      "headline": "College students drugged, raped, filmed in Bhopal; case echoes Ajmer sex scandalSeveral women in Bhopal were lured by a group of men, who drugged and allegedly raped them, and threatened to make the videos of the acts viral. Police arrested three accused in connection with the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-dismisses-195-trainees-after-failing-to-clear-internal-assessment-2716764-2025-04-29",
      "headline": "Infosys sacks 195 trainees over failed internal tests: ReportThe move marks the fourth such round of trainee terminations at India's second-largest IT services company, which is grappling with weak demand and flat revenue projections for the current fiscal year."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-ravi-shastri-on-vaibhav-suryavanshi-hundred-2716755-2025-04-29",
      "headline": "Let Vaibhav play: Ravi Shastri predicts next challenge for RR youngsterFormer India head coach Ravi Shastri has called for patience with Rajasthan Royals' teenage sensation Vaibhav Suryavanshi, even as the cricket world continues to marvel at his record-breaking hundred in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-arsenal-vs-psg-mikel-arteta-press-conference-2716747-2025-04-29",
      "headline": "Arsenal want more than just UEFA Champions League semi-finals spot: Mikel ArtetaArsenal boss Mikel Arteta has claimed that his side's ambitions in the Champions League extend beyond making an appearance in the semi-finals of the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-greatest-performance-shaun-pollock-rr-vs-gt-2716590-2025-04-29",
      "headline": "Greatest IPL performance: Vaibhav Suryavanshi's historic 100 amazes Shaun PollockShaun Pollock hailed 14-year-old Vaibhav Suryavanshi's century as the greatest individual performance in IPL history, praising the youngster's fearless domination against senior players as a once-in-a-lifetime show of cricketing brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-story-coach-manish-ojha-exclusive-2716715-2025-04-29",
      "headline": "'At 10, Vaibhav Suryavanshi hit 90m sixes': The making of IPL's 14-year-old phenomIPL 2025: Speaking to IndiaToday.in, Vaibhav Suryavanshi's childhood coach, Manish Ojha, lifted the lid on the 14-year-old's scarcely believable six-hitting prowess. A Brian Lara fan, the Rajasthan Royals opener smashed 11 sixes on his way to scoring the fastest century by an Indian in IPL history in Jaipur on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-preview-predicted-xis-team-news-pitch-weather-report-delhi-2716689-2025-04-29",
      "headline": "DC vs KKR: Delhi looks to solve mysterious home form against desperate KolkataDelhi Capitals will be aiming to bounce back quickly and solve their mysterious form at home as they face a Kolkata Knight Riders team, who are desperate to return to winning ways. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/vaibhavs-suryavanshi-father-reaction-rr-management-son-record-breaking-ipl-century-2716681-2025-04-29",
      "headline": "Vaibhav's father thanks RR management after son's record-breaking IPL centuryVaibhav Suryavanshi's father, Sanjiv Suryavanshi, was emotional after his 14-year-old son's historic century in the IPL. He thanked the Rajasthan Royals management and coaching staff, including Rahul Dravid, Vikram Rathour, Zubin Bharucha, Sairaj Bahutule, and Ruby, for honing Vaibhav's skills over the past few months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-india-debut-parents-2716679-2025-04-29",
      "headline": "Vaibhav Suryavanshi has eyes set on India debut after IPL hundred in RR vs GTSpeaking after his sensational hundred against GT, RR's batting sensation Vaibhav Suryavanshi opened up about his dream of debuting for India in international cricket. Suryavanshi created history on Monday, April 28 with his hundred against Gujarat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-team-manager-rahul-dravid-reaction-vaibhav-suryavanshi-hundred-vs-gt-2716663-2025-04-29",
      "headline": "Rahul Dravid hugged Vaibhav: RR manager reveals post-match interactionRajasthan Royals team manager Romi Bhinder explained how head coach Rahul Dravid hugged 14-year-old Vaibhav Suryavanshi after his stunning century against Gujarat Titans and shared a few words with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-sai-sudharasan-2716654-2025-04-29",
      "headline": "Vaibhav Suryavanshi's batting was tremendous to watch: GT's Sai SudharsanGujarat Titans batter Sai Sudharsan tipped his hat to Vaibhav Suryavanshi after the 14-year-old's blazing knock for Rajasthan Royals during the match against them on Monday, April 28. Sudharsan admitted that the Titans should have been more disciplined with their bowling approach against the youngster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-india-debut-parents-2716679-2025-04-29",
      "headline": "Vaibhav Suryavanshi has eyes set on India debut after IPL hundred in RR vs GTSpeaking after his sensational hundred against GT, RR's batting sensation Vaibhav Suryavanshi opened up about his dream of debuting for India in international cricket. Suryavanshi created history on Monday, April 28 with his hundred against Gujarat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-team-manager-rahul-dravid-reaction-vaibhav-suryavanshi-hundred-vs-gt-2716663-2025-04-29",
      "headline": "Rahul Dravid hugged Vaibhav: RR manager reveals post-match interactionRajasthan Royals team manager Romi Bhinder explained how head coach Rahul Dravid hugged 14-year-old Vaibhav Suryavanshi after his stunning century against Gujarat Titans and shared a few words with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-sai-sudharasan-2716654-2025-04-29",
      "headline": "Vaibhav Suryavanshi's batting was tremendous to watch: GT's Sai SudharsanGujarat Titans batter Sai Sudharsan tipped his hat to Vaibhav Suryavanshi after the 14-year-old's blazing knock for Rajasthan Royals during the match against them on Monday, April 28. Sudharsan admitted that the Titans should have been more disciplined with their bowling approach against the youngster."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}