{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-ipos-initial-public-offerings-in-2024-big-ticket-listings-that-failed-to-impress-2654147-2024-12-23",
      "headline": "IPOs in 2024: Big ticket listings that failed to impressRecord-breaking IPOs in India coexist with the struggles of billion-dollar listings, reflecting both market resilience and investor caution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-higher-bullish-trends-emerge-as-key-sectors-shine-2654084-2024-12-23",
      "headline": "Sensex ends 400 points higher, Nifty jumps as heavyweight stocks rallyThe S&P BSE Sensex added 498.58 points to end at 78,540.17, while the NSE Nifty50 gained 165.95 points to close at 23,753.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nse-bse-to-keep-markets-open-on-february-1-for-union-budget-2025-2654065-2024-12-23",
      "headline": "NSE, BSE to keep markets open on February 1 for Union Budget 2025The practice of keeping markets open during Budget Day is not new. In the past, trading was also allowed on non-working days to facilitate real-time market reactions to Budget announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senores-pharmaceuticals-ipo-should-you-subscribe-check-latest-gmp-subscription-status-allotment-date-2654056-2024-12-23",
      "headline": "Senores Pharmaceuticals IPO: Should you subscribe? Check GMP, subscription Senores Pharmaceuticals IPO comprises a fresh issue of shares worth Rs 500 crore and an offer-for-sale (OFS) of up to 21,00,000 equity shares by promoters and existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bernard-arnault-ceo-of-lvmh-from-the-worlds-richest-to-fifth-the-ups-and-downs-of-the-luxury-mogul-2654041-2024-12-23",
      "headline": "From the world's richest to fifth: The ups and downs of Bernard Arnault Once the world's richest, Bernard Arnault lost $32 billion in 2024 but remains a luxury titan with LVMH's 75 iconic brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/popcorn-gst-salted-prepackaged-caramalised-faces-crticism-experts-heres-why-2654025-2024-12-23",
      "headline": "Salted, pre-packed or caramelised? Popcorn gets stuck in GST mazeThe GST Council's decision to impose different tax rates on salted, pre-packaged, and caramelised popcorn has faced criticism, with economists, industry experts, and former government officials arguing that the new tax structure adds complexity for consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-ipo-last-day-bid-alert-latest-gmp-expected-share-price-allotment-date-stmp-2654019-2024-12-23",
      "headline": "Mamata Machinery IPO: Check latest GMP, share price, allotment date Mamata Machinery IPO: The price band for the IPO is set between Rs 230 and Rs 243 per share. Investors can apply for a minimum lot size of 61 shares, which requires a retail investment of Rs 14,823."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-pradhan-mantri-jan-arogya-yojana-ab-pm-jay-for-senior-citizens-how-to-register-for-free-health-insurance-up-to-rs-5-lakh-every-year-2654017-2024-12-23",
      "headline": "PM-JAY for senior citizens: How to register for free health insuranceAyushman Bharat Pradhan Mantri Jan Arogya Yojana ensures senior citizens over 70 get free health insurance of Rs 5 lakh annually, with a simple enrolment process to make healthcare more accessible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-reasons-why-options-trading-is-a-losing-game-for-retail-traders-2653990-2024-12-23",
      "headline": "F&O gamble: 5 reasons why options trading is a losing game for retail tradersOne of the biggest challenges retail traders face in India is the prohibitively high transaction costs. Unlike in the US, where brokerage fees are negligible and there are no transaction taxes, Indian traders face multiple layers of charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gstr-9-simplified-what-is-it-check-filing-features-deadlines-types-and-other-details-2653986-2024-12-23",
      "headline": "GSTR-9 simplified: Filing, features, deadlines and other details GSTR-9 consolidates GST data for taxpayers exceeding Rs 2 crore turnover, ensuring accurate reconciliation and compliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-cements-share-price-surged-11-percent-today-why-reason-ultratech-cement-accquisition-2653974-2024-12-23",
      "headline": "Explained: Why India Cements share price surged 11% today Shares of India Cements rose after UltraTech Cement received a crucial approval from the Competition Commission of India (CCI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/direct-tax-vivad-se-vishwas-scheme-2024-what-is-it-how-to-avail-it-eligibility-application-process-why-to-choose-it-2653945-2024-12-23",
      "headline": "Vivad Se Vishwas Scheme 2024: What is it and how to avail it?Settle tax disputes easily under the Vivad Se Vishwas Scheme 2024 by paying the disputed tax and avoiding penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-jumps-800-points-key-factors-behind-bull-run-2653942-2024-12-23",
      "headline": "Sensex jumps 800 points: 3 factors behind today's stock market rallyStock Market Today: The S&P BSE Sensex climbed 802.66 points to 78,844.25 by 11:06 am, while the NSE Nifty50 advanced 243 points to trade at 23,828.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/concord-enviro-ipo-closes-for-bidding-check-latest-subscription-gmp-stmp-2653936-2024-12-23",
      "headline": "Concord Enviro IPO closes for bidding: Check latest subscription, GMP The Concord Enviro IPO is a book-built issue worth Rs 500.33 crore. It consists of a fresh issue of 25 lakh shares, which will raise Rs 175 crore, and an offer for sale (OFS) of 46 lakh shares valued at Rs 325.33 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-zomato-ril-tcs-vedanta-ntpc-green-ultratech-cement-bse-nse-sensex-nifty-2653866-2024-12-23",
      "headline": " Stocks to watch today: Zomato, RIL, TCS, Vedanta, NTPC Green, Ultratech CementBoth the BSE Sensex and NSE Nifty50 witnessed massive losses last week, with the Sensex dropping over 4,000 points across five consecutive sessions and the Nifty falling by nearly 1,200 points, marking a 5% weekly loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-details-check-opening-date-gmp-price-band-lot-size-allotment-stmp-2653911-2024-12-23",
      "headline": "Unimech Aerospace IPO opens: Check opening date, gmp, price band, lot size Unimech Aerospace IPO: The price band for the IPO has been set at Rs 745 to Rs 785 per share. The minimum lot size for investors is 19 shares, which requires a minimum investment of Rs 14,915."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-check-latest-gmp-subscription-last-day-for-bidding-allotment-date-listing-2653892-2024-12-23",
      "headline": "Dam Capital Advisors IPO: Check GMP as listing enters last day for bidding Dam Capital Advisors IPO is a book-built issue worth Rs 840.25 crore. The entire issue is an Offer for Sale (OFS) of 2.97 crore shares by the selling shareholders, meaning the company will not receive any funds from this offering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-snap-losing-streak-with-it-metal-stocks-surge-ril-shares-up-over-1-percent-2653884-2024-12-23",
      "headline": "Sensex, Nifty snap losing streak with IT, metal surge; RIL shares up over 1%The S&P BSE Sensex was up 577.72 points to 78,619.31, while the NSE Nifty50 gained 185.80 points to 23,773.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-in-focus-entry-bse-sensex-replaces-jsw-steel-stocks-to-watch-2653878-2024-12-23",
      "headline": "Zomato shares to be in focus today. Here's why Zomato's stock has surged nearly 43% over the last six months and approximately 126% over the past year, far outpacing the Sensex's one-year return of 10.7%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rohan-mirchandani-death-yogurt-brand-epigamia-co-founder-dies-at-42-due-to-cardiac-arrest-2653723-2024-12-22",
      "headline": "Epigamia co-founder Rohan Mirchandani dies at 42 due to cardiac arrestRohan Mirchandani, co-founder of Epigamia, died due to cardiac arrest. Known for transforming India's food market, he led Epigamia's growth to over 20,000 retail outlets in 30 cities."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/filmmaker-shyam-benegal-dies-was-unwell-2654274-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Renowned filmmaker Shyam Benegal dies at 90, was unwell for several daysVeteran director and screenwriter Shyam Benegal died on December 23 at 6:30 pm, his daughter Pia Benegal confirmed to India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/pushpa-2-screening-stampede-actor-allu-arjun-summoned-hyderabad-cops-2654301-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun summoned by police tomorrow over Pushpa 2 screening stampede: SourcesThe Hyderabad Police issued a fresh notice to actor Allu Arjun on Monday, summoning him for questioning in connection with a deadly stampede during the premiere of 'Pushpa 2: The Rise'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bangladesh-diplomatic-note-sheikh-hasina-extradition-2654255-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'No comment': India on Bangladesh's extradition request for Sheikh HasinaThe Ministry of External Affairs (MEA) said it has received a note verbale from Bangladesh interim government seeking extradition of ousted Prime Minister Sheikh Hasina who took refuge in India in August. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/ex-donald-trumps-attorney-general-pick-matt-gaetz-paid-thousands-for-drugs-sex-with-minor-report-2654371-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Trump's attorney general pick paid thousands for drugs, sex with minor: ReportThe House Ethics Committee accused ex-Representative Matt Gaetz of paying for sex, violating Florida's statutory rape law, and using illicit drugs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-free-imran-khan-calls-release-talks-with-government-amid-international-pressure-un-amnesty-2654281-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What has forced Pakistan govt to discuss Imran Khan's release?The Pakistani government is in talks with the party of jailed former Prime Minister Imran Khan. Internal pressure and growing calls for Khan's release globally by influential people have made the government discuss Khan's release, among other issues with PTI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vinod-kambli-hospitalized-has-clots-in-brain-reveals-doctor-after-medical-examinations-2654400-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vinod Kambli has clots in brain, reveals doctor after medical examinationsFormer India cricketer Vinod Kambli has been hospitalised in Thane after his health deteriorated and the medical examinations have revealed that the cricketer has clots in his brain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shyam-benegal-dies-at-90-pioneer-of-parallel-cinema-brains-behind-bharat-ek-khoj-2654293-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shyam Benegal: Pioneer of parallel cinema, creator of 'Bharat Ek Khoj'Indian cinema mourns the loss of Shyam Benegal, a pioneer of parallel cinema, who died at 90. Known for socially reflective films like Ankur and Manthan, his legacy spans six decades of storytelling.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-dalit-boy-suicide-basti-birthday-party-assaulted-stripped-urinated-upon-police-2654355-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Invited to birthday, stripped, urinated upon: UP boy dies by suicideThe victim's family alleged that the boy was invited to a birthday party where he was brutally assaulted, stripped and urinated upon by four people who even filmed the heinous act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shyam-benegal-last-photo-90th-birthday-shabana-azmi-viral-death-2654295-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shyam Benegal's 90th birthday picture with Shabana Azmi goes viral after deathLegendary filmmaker Shyam Benegal, 90, died in Mumbai. Known for classics like Manthan and Nishant, he redefined Indian cinema. His last film was Mujib: The Making of a Nation (2023)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/political-leaders-remember-shyam-benegal-visionary-indian-cinema-rahul-gandhi-mamata-banerjee-2654367-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Profound impact on Indian cinema': PM, other leaders mourn Shyam BenegalPoliticians from across party lines expressed sorrow on Shyam Benegal's death and remembered his works and the art of filmmaking in emotional social media posts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parliament-scuffle-bjp-mps-injured-cisf-denies-lapses-rahul-gandhi-fir-congress-2654266-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No lapse on our part: Paramilitary force on MPs' scuffle in Parliament premisesAddressing a presser, a Central Industrial Security Force (CISF) officer clarified that no inquiry into the MPs' scuffle that broke out in Parliament House was going on from their side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceo-murder-suspect-luigi-mangione-pleads-not-guilty-in-new-york-court-2654299-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Unitedhealthcare CEO murder suspect Luigi Mangione pleads not guilty Luigi Mangione, 26, was escorted into Judge Gregory Carro's 13th-floor courtroom in the New York state criminal courthouse in lower Manhattan with a court officer on each arm, and a procession of a half dozen officers following him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pv-sindhu-wedding-photo-venkatta-datta-sai-udaipur-gajendra-singh-shekhawat-2653980-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "First pic: PV Sindhu marries Venkata Datta Sai in UdaipurBadminton icon PV Sindhu married Venkata Datta Sai in a grand Telugu ceremony in Udaipur, surrounded by loved ones. The couple tied the knot following traditional rituals, ahead of their Hyderabad reception on December 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-haryana-minister-anil-vij-suspends-cop-for-negligence-during-public-hearing-2654213-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Are rules different for you?' Haryana Minister suspends cop for not filing FIRHaryana Minister Anil Vij suspended a Station House Officer for negligence and allegations that he did not register an FIR despite being directed to do so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shyam-benegal-dies-at-90-shekhar-kapur-chiranjeevi-manoj-bajpayee-karan-johar-celebs-pay-tribute-to-2654300-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shekhar Kapur, Chiranjeevi to Manoj Bajpayee: Celebs pay tribute to Shyam BenegalLegendary filmmaker Shyam Benegal, 90, died on December 23. Celebrities such as Shekhar Kapur, Chiranjeevi, and Manoj Bajpayee paid tribute to the visionary director on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-viral-russian-chaiwali-papia-ghosal-forced-to-shut-store-after-moral-policing-2654157-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kolkata's viral 'Russian Chaiwali' forced to shut store after moral policingViral Kolkata entrepreneur Papia Ghosal, known as the 'Russian Chaiwali,' was forced to shut her tea shop in Andul due to alleged moral policing and gender discrimination.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/video-aishwarya-rai-leaves-for-christmas-vacation-with-daughter-aaradhya-2654015-2024-12-23?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Aishwarya Rai leaves for Christmas vacation with daughter AaradhyaActor Aishwarya Rai was clicked at the Mumbai airport this morning with daughter Aaradhya Bachchan as they left for vacation. Aishwarya wished the paparazzi 'Merry Christmas and Happy New Year'. The mother-daughter duo were recently seen at Dhirubhai Ambani International School's annual day event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-supreme-court-judge-v-ramasubramanian-appointed-as-national-human-rights-panel-chief-2654228-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Retired Supreme Court judge V Ramasubramanian appointed human rights panel chiefThis appointment comes months after former Supreme Court Justice (retd) Arun Kumar Mishra concluded his tenure as NHRC chairperson on June 1. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/fire-at-singer-shaans-residential-building-1-woman-injured-kurla-scrap-market-2654419-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fire breaks out at singer Shaan's residential building, 1 woman injuredTwo separate fires erupted in Mumbai on Monday, injuring an elderly woman in Bandra and destroying warehouses in Kurla Scrap Market. Authorities suspect a short circuit in one case and are probing both incidents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-aap-mlas-asim-ahmad-khan-devendra-sehrawat-congress-delhi-polls-2654417-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-AAP MLAs Asim Ahmad Khan, Devendra Sehrawat join Congress ahead of Delhi pollsFormer AAP leaders Asim Ahmad Khan and Colonel Devendra Sehrawat shifted to Congress ahead of the Delhi Assembly elections. AAP finalised its candidates while fielding new faces and welcoming BJP defectors.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/maharashtra-police-amend-chargesheet-clear-victim-4-years-fatal-accident-2654415-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maharashtra Police amend chargesheet, clear victim 4 years after fatal accidentMaharashtra Police made changes to the chargesheet in a 2020 fatal road accident, clearing the victim of false allegations and holding the negligent truck driver accountable after a High Court-ordered reinvestigation exposed initial investigative flaws."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-dawood-ibrahim-brother-iqbal-kaskar-thane-flat-money-laundering-case-2654414-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED seizes Dawood Ibrahim brother's Thane flat in money laundering caseThe ED seizes a Thane flat linked to Dawood Ibrahim's brother, Iqbal Kaskar, in a money laundering case. The property, allegedly acquired through extortion, highlights ongoing investigations into the underworld's operations and financial schemes in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eat-popcorn-and-sleep-shashi-tharoor-gst-councils-tax-formula-for-snack-2654411-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Eat popcorn and sleep: Shashi Tharoor on GST council's tax formula for snackCongress MP Shashi Tharoor mocked the GST Council's decision to impose varied popcorn tax slabs, sparking criticism of the system's complexity. Congress leaders called the move absurd, highlighting widespread GST evasion, tax fraud, and loopholes in compliance processes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parbhani-violence-dalit-man-killed-police-custody-rahul-gandhi-visits-family-bjp-hits-back-2654394-2024-12-24?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi says Maharashtra man killed due to Dalit identity, BJP hits backRahul Gandhi's visit to a Dalit man's family, who died after Parbhani violence, has sparked a political row, with the BJP accusing him of \"politicising the issue\" and \"creating hatred\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/rashmika-mandanna-vijay-deverakonda-clicked-at-the-airport-2654373-2024-12-23",
      "headline": "Watch: Rashmika Mandanna, Vijay Deverakonda clicked at the airportRashmika Mandanna and Vijay Deverakonda were clicked at the Mumbai airport today. It looked like the rumoured lovebirds were leaving for Christmas vacation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shyam-benegal-dies-at-90-shekhar-kapur-chiranjeevi-manoj-bajpayee-karan-johar-celebs-pay-tribute-to-2654300-2024-12-23",
      "headline": "Shekhar Kapur, Chiranjeevi to Manoj Bajpayee: Celebs pay tribute to Shyam BenegalLegendary filmmaker Shyam Benegal, 90, died on December 23. Celebrities such as Shekhar Kapur, Chiranjeevi, and Manoj Bajpayee paid tribute to the visionary director on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shyam-benegal-last-photo-90th-birthday-shabana-azmi-viral-death-2654295-2024-12-23",
      "headline": "Shyam Benegal's 90th birthday picture with Shabana Azmi goes viral after deathLegendary filmmaker Shyam Benegal, 90, died in Mumbai. Known for classics like Manthan and Nishant, he redefined Indian cinema. His last film was Mujib: The Making of a Nation (2023)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shyam-benegal-dies-at-90-pioneer-of-parallel-cinema-brains-behind-bharat-ek-khoj-2654293-2024-12-23",
      "headline": "Shyam Benegal: Pioneer of parallel cinema, creator of 'Bharat Ek Khoj'Indian cinema mourns the loss of Shyam Benegal, a pioneer of parallel cinema, who died at 90. Known for socially reflective films like Ankur and Manthan, his legacy spans six decades of storytelling.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vinod-kambli-hospitalized-has-clots-in-brain-reveals-doctor-after-medical-examinations-2654400-2024-12-23",
      "headline": "Vinod Kambli has clots in brain, reveals doctor after medical examinationsFormer India cricketer Vinod Kambli has been hospitalised in Thane after his health deteriorated and the medical examinations have revealed that the cricketer has clots in his brain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-simon-katich-mitchell-marsh-beau-webster-aus-vs-ind-border-gavaskar-trophy-2024-25-2654392-2024-12-23",
      "headline": "AUS vs IND: Simon Katich questions Mitchell Marsh's place for Melbourne TestFormer Australia cricketer Simon Katich has questioned Mitchell Marsh's place in the team ahead of the fourth Test against India in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-york-here-i-come-arjun-erigaisi-gets-us-visa-clearance-ahead-of-championship-2654384-2024-12-23",
      "headline": "New York here I come: Arjun Erigaisi gets US visa clearance ahead of championshipArjun Erigaisi secures US visa clearance just in time for the World Rapid and Blitz Championship in New York. The chess prodigy's determination and community support spotlight his journey to represent India on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/r-ashwin-reveals-the-thought-process-behind-sudden-retirement-2654374-2024-12-23",
      "headline": "R Ashwin reveals the thought process behind sudden retirementRavichandran Ashwin reflected on his sudden retirement, emphasising his focus on the game over personal celebration. He revealed how his love for experimentation and creativity led him to step away, seeking new avenues to explore his passion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/what-is-the-story-behind-contest-after-christmas-being-called-boxing-day-test-2654315-2024-12-23",
      "headline": "What is the story behind contest after Christmas being called 'Boxing Day Test' Curious about the origins of the name Boxing Day Test? Let us uncover the story behind it! India is all set to play the 4th Test vs Australia at the iconic MCG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-odi-squad-for-new-zealand-tour-wanindu-hasaranga-eshan-malinga-2654297-2024-12-23",
      "headline": "Wanindu Hasaranga returns to Sri Lanka ODI squad for New Zealand tourSri Lanka Cricket (SLC) announced a 17-member squad for the upcoming three-match ODI series against New Zealand. Wanindu Hasaranga marks his return after recovering from hamstring injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/r-ashwin-reflects-on-india-career-after-retirement-dont-cry-because-its-over-2654291-2024-12-23",
      "headline": "R Ashwin reflects on India career after retirement: Don't cry because it's overRavichandran Ashwin shared a special message on Instagram after announcing his retirement from international cricket. Checkout what the Indian legend has to say as the cricketing world still overcomes the shocking announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shamis-injury-timeline-from-taking-injections-in-world-cup-to-getting-ruled-out-of-bgt-2654280-2024-12-23",
      "headline": "Shami's injury timeline: From injections in WC to getting ruled out of BGTLet us have a look at the injury timeline of India fast bowler Mohammed Shami who has been out of international action since November 19, 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-pakistan-boxing-day-test-2654279-2024-12-23",
      "headline": "How have Pakistan performed in Boxing Day Tests in South Africa? SA vs PAK: Pakistan have their task cut out as they are set to lock horns with South Africa in a two-match Test series, starting December 26 at the SuperSport Park in Centurion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rapahel-varane-disguise-attends-rc-lens-vs-paris-saint-germain-french-cup-2654261-2024-12-23",
      "headline": "Raphael Varane attends Lens vs PSG in disguise, spotted among fansRaphaël Varane, former Real Madrid and Manchester United defender, returned to his roots, watching RC Lens' French Cup clash against PSG disguised amongst fans. His heartfelt gesture highlighted his enduring connection to the club where his illustrious journey began."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-pakistan-champions-trophy-title-defence-series-win-2654225-2024-12-23",
      "headline": "Are Pakistan primed for Champions Trophy title defence amid dream run? SA vs PAK: After Mohammad Rizwan took charge as their captain, Pakistan have won seven out of nine ODIs. On Sunday, Pakistan beat South Africa in the Johannesburg ODI to win the series 3-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/r-ashwin-reflects-on-india-career-after-retirement-dont-cry-because-its-over-2654291-2024-12-23",
      "headline": "R Ashwin reflects on India career after retirement: Don't cry because it's overRavichandran Ashwin shared a special message on Instagram after announcing his retirement from international cricket. Checkout what the Indian legend has to say as the cricketing world still overcomes the shocking announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shamis-injury-timeline-from-taking-injections-in-world-cup-to-getting-ruled-out-of-bgt-2654280-2024-12-23",
      "headline": "Shami's injury timeline: From injections in WC to getting ruled out of BGTLet us have a look at the injury timeline of India fast bowler Mohammed Shami who has been out of international action since November 19, 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-pakistan-boxing-day-test-2654279-2024-12-23",
      "headline": "How have Pakistan performed in Boxing Day Tests in South Africa? SA vs PAK: Pakistan have their task cut out as they are set to lock horns with South Africa in a two-match Test series, starting December 26 at the SuperSport Park in Centurion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rapahel-varane-disguise-attends-rc-lens-vs-paris-saint-germain-french-cup-2654261-2024-12-23",
      "headline": "Raphael Varane attends Lens vs PSG in disguise, spotted among fansRaphaël Varane, former Real Madrid and Manchester United defender, returned to his roots, watching RC Lens' French Cup clash against PSG disguised amongst fans. His heartfelt gesture highlighted his enduring connection to the club where his illustrious journey began."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-pakistan-champions-trophy-title-defence-series-win-2654225-2024-12-23",
      "headline": "Are Pakistan primed for Champions Trophy title defence amid dream run? SA vs PAK: After Mohammad Rizwan took charge as their captain, Pakistan have won seven out of nine ODIs. On Sunday, Pakistan beat South Africa in the Johannesburg ODI to win the series 3-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-housing-board-allegations-commercial-activity-ranchi-house-2654248-2024-12-23",
      "headline": "Housing board to probe allegations of commercial activity at Dhoni's Ranchi houseThe Jharkhand State Housing Board has taken action against former Indian cricket captain Mahendra Singh Dhoni for reportedly using a residential plot at his Harmu Road residence for commercial activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/who-is-tanush-kotian-mumbai-off-spinner-named-as-retired-r-ashwins-replacement-2654172-2024-12-23",
      "headline": "Who is Tanush Kotian? Mumbai off-spinner to be named as R Ashwin's replacementTanush Kotian is set to be added to the Indian squad ahead of the Boxing Day Test. The Mumbai all-rounder is being seen as a replacement for Ravichandran Ashwin, who retired from international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/dhruv-jurel-wins-cash-prize-during-team-indias-fielding-drill-before-mcg-test-2654220-2024-12-23",
      "headline": "Dhruv Jurel wins cash prize during Team India's fielding drill before MCG Test Dhruv Jurel's impressive performance in the fielding drill earned him a 300 dollar cash prize, as Team India ramped up preparations for the Boxing Day Test at the MCG. The drill, filled with energy and competition, boosted the team's spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-should-learn-from-virender-sehwag-feels-cheteshwar-pujara-aus-vs-ind-2654183-2024-12-23",
      "headline": "Yashasvi Jaiswal in a hurry to score, should learn from Sehwag: Cheteshwar PujaraIndia cricketer Cheteshwar Pujara feels young India opener Yashasvi Jaiswal seems in a hurry to score runs and should learn from Virender Sehwag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-senior-womens-one-day-trophy-bengal-history-haryana-list-a-2654184-2024-12-23",
      "headline": "Bengal script history in Women's One-Dayers with 390 chase vs Haryana Bengal scripted history after recording the highest successful run-chase in Women's List A cricket. They chased down 390 against Haryana at the Niranjan Shah Stadium Ground C in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-decline-manchester-united-exit-transfer-ruben-amorim-2654168-2024-12-23",
      "headline": "Rashford's Decline: 'Generational talent' nears Manchester United exitMarcus Rashford's journey at Manchester United appears to be near its end, as his form and off-field issues under Ruben Amorim's management has seen him fall out of favour, leaving fans and pundits questioning the trajectory of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-fitness-update-border-gavaskar-trophy-melbourne-sydney-2654161-2024-12-23",
      "headline": "Mohammed Shami deemed not fit for Melbourne, Sydney Tests vs Australia: BCCIThe Indian cricket board on Monday, December 23 confirmed that Mohammed Shami will not travel to Australia for the last two Tests of the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-tanush-kotian-spinner-border-gavaskar-trophy-squad-2654151-2024-12-23",
      "headline": "All-rounder Tanush Kotian added to India's squad for Melbourne, Sydney TestsBorder-Gavaskar Trophy: 26-year-old all-rounder Tanush Kotian received his maiden Test call-up on Monday, December 23. The Mumbai cricketer will leave for Australia on Tuesday, December 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-senior-womens-one-day-trophy-bengal-history-haryana-list-a-2654184-2024-12-23",
      "headline": "Bengal script history in Women's One-Dayers with 390 chase vs Haryana Bengal scripted history after recording the highest successful run-chase in Women's List A cricket. They chased down 390 against Haryana at the Niranjan Shah Stadium Ground C in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-decline-manchester-united-exit-transfer-ruben-amorim-2654168-2024-12-23",
      "headline": "Rashford's Decline: 'Generational talent' nears Manchester United exitMarcus Rashford's journey at Manchester United appears to be near its end, as his form and off-field issues under Ruben Amorim's management has seen him fall out of favour, leaving fans and pundits questioning the trajectory of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-fitness-update-border-gavaskar-trophy-melbourne-sydney-2654161-2024-12-23",
      "headline": "Mohammed Shami deemed not fit for Melbourne, Sydney Tests vs Australia: BCCIThe Indian cricket board on Monday, December 23 confirmed that Mohammed Shami will not travel to Australia for the last two Tests of the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-tanush-kotian-spinner-border-gavaskar-trophy-squad-2654151-2024-12-23",
      "headline": "All-rounder Tanush Kotian added to India's squad for Melbourne, Sydney TestsBorder-Gavaskar Trophy: 26-year-old all-rounder Tanush Kotian received his maiden Test call-up on Monday, December 23. The Mumbai cricketer will leave for Australia on Tuesday, December 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rishabh-pant-adorable-moment-with-young-fan-in-melbourne-2654144-2024-12-23",
      "headline": "Watch: Rishabh Pant's adorable moment with young fan in Melbourne netsIndia wicketkeeper batter Rishabh Pant had an adorable moment with a young fan while practising in the nets ahead of the fourth Test against Australia in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sanjay-manjrekar-wants-rohit-to-rediscover-his-england-2021-series-like-batting-2654140-2024-12-23",
      "headline": "Sanjay Manjrekar wants Rohit to rediscover his England 2021 series-like battingSanjay Manjrekar has expressed concern over Rohit Sharma's form in the Border-Gavaskar Trophy, citing a shaky defence and low confidence. He urged Rohit to rediscover the grit and patience he displayed during the 2021 England series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vinod-kambli-health-hosptalised-thane-stable-2654114-2024-12-23",
      "headline": "Vinod Kambli hospitalised in Thane after health deterioratesFormer India cricketer and Sachin Tendulkar's childhood friend, Vinod Kambli, was admitted to a hospital in Thane on Saturday night after his health condition worsened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-simon-katich-aus-vs-ind-border-gavaskar-trophy-2024-25-2654101-2024-12-23",
      "headline": "How can Australia crack the Jasprit Bumrah code? Simon Katich revealsFormer Australia batter Simon Katich has shared his advice to counter India fast bowler Jasprit Bumrah for Australian batters  in the last two Test matches."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}