{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-3000-for-first-time-trade-tensions-and-fed-bets-drive-rally-glbs-2693649-2025-03-14",
      "headline": "Gold hits $3,000 for first time: Trade tensions and Fed bets drive rallyGold surged past $3,000 an ounce for the first time, driven by trade tensions, recession fears, and Fed rate cut bets. Analysts expect further gains, with prices potentially reaching $3,050 in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-mutual-fund-inflows-10-month-low-amfi-data-3-alternate-investment-options-2693634-2025-03-14",
      "headline": "Mutual fund inflows at 10-month low: Here are 3 alternate investment optionsThe total assets under management (AUM) of the mutual fund industry fell 4%, from Rs 66.98 lakh crore in January to Rs 64.26 lakh crore in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-tesla-unsigned-letter-donald-trump-administration-tariff-threats-trade-war-risks-retaliation-cost-ev-industry-2693577-2025-03-14",
      "headline": "Elon Musk's Tesla warns of tariff risks in letter to Trump administrationIn an unsigned letter to the Donald Trump-led administration, his ally Elon Musk's Tesla has cautioned that the US President's trade war could expose the automaker to retaliatory tariffs and increase the cost of making electric vehicles in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-production-low-cost-model-y-shanghai-china-price-war-sale-drop-india-entry-2693558-2025-03-14",
      "headline": "Tesla planning low-cost Model Y in China. Will India get it too?Production will take place at Tesla's Shanghai factory, its largest production hub, and mass production is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-share-price-jump-15-percent-wall-street-investors-welcome-new-ceo-lip-bu-tan-2693524-2025-03-14",
      "headline": "Intel shares jump 15% as investors welcome new CEO Lip-Bu TanIntel shares closed at $23.70, jumping 14.60% as investors placed their bet on the newly announced CEO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/holi-2025-stock-ideas-these-2-shares-piramal-pharma-ptc-india-could-deliver-up-to-16-percent-gains-2693471-2025-03-14",
      "headline": "Holi 2025 stock ideas: These 2 shares could deliver up to 16% gainsFor Holi 2025, Bajaj Broking has recommended two stocks that could see a 16% upside in the next 12 months amid a market correction that has seen Sensex and Nifty on a downward trend.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-indices-slip-as-trump-eu-tariff-threat-sparks-concerns-2693356-2025-03-13",
      "headline": "Wall Street indices slip as Trump's EU tariff threat raises concernsAt the opening bell, the S&P 500 dipped 0.9 points, or 0.09%, at the open to 5,594.45​, the Dow Jones Industrial Average dropped 70.9 points, or 0.17%, at the open to 41,280.05 and Nasdaq Composite fell 49.9 points, or 0.28%, to 17,598.565."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/found-old-share-certificates-at-home-chandigarh-man-here-is-how-you-can-encash-them-2693296-2025-03-13",
      "headline": "Old share certificates in your drawer? Here's how you can encash themThe stock value of old shares can be calculated by multiplying the number of stocks held by the current market price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/check-sbi-latest-lending-rates-for-march-2025-mclr-and-base-rate-2693293-2025-03-13",
      "headline": "Check SBI's latest lending rates for March 2025: MCLR and base rateThe updated MCLR rates will directly influence interest rates on various financial products, including home loans, personal loans, and other credit facilities offered by the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-close-for-holi-march-14-nse-bse-holiday-trading-equity-2693243-2025-03-13",
      "headline": "BSE, NSE holiday: Is stock market closed for Holi on March 14, 2025?Since there is some uncertainty over whether Holi 2025 falls on Friday or Saturday, it is important to check the official list of stock market holidays for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/policies-are-a-nightmare-zerodha-ceo-nithin-kamath-on-why-life-insurance-is-getting-tougher-2693227-2025-03-13",
      "headline": "Policies are a nightmare: Nithin Kamath on why life insurance is getting tougherSince the onset of COVID-19, insurance companies have faced an increase in claims, which has led them to reassess their underwriting policies and tighten their approval process."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-hosts-hasan-minhaj-indore-treat-2693783-2025-03-15",
      "headline": "Stand-up comic Zakir Khan treats Hasan Minhaj with delicious Indore foodZakir Khan hosted Hasan Minhaj in Indore, introducing him to the city's street food culture and hinting at a future collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-removed-prada-brand-ambassador-kim-sae-ron-death-2693694-2025-03-14",
      "headline": "Kim Soo-hyun removed as Prada's brand ambassador amid Kim Sae-ron scandal: ReportK-drama star Kim Soo-hyun has reportedly been removed as luxury brand Prada's brand ambassador following his alleged involvement in actor Kim Sae-ron's death scandal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-potato-lab-review-kang-taeoh-lee-sunbin-lead-netflix-quirky-comedy-2693681-2025-03-14",
      "headline": "The Potato Lab review: Kang Tae-oh, Lee Sun-bin lead this quirky comedyReleased-Sat Mar 01, 2025The Potato Lab is a fun K-drama set in a picturesque mountain valley. While it offers laughs and visual appeal, it sometimes lacks depth and originality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exploring-age-gaps-in-k-dramas-my-dearest-nemesis-moon-gayoung-choi-hyunwook-2686740-2025-03-14",
      "headline": "Exploring age gaps in K-dramas: Why do they cause so much buzz?K-dramas often feature age differences between lead actors, sparking debate among fans. While such gaps are common in real life, they draw more attention on screen. In this K-Fix, we will find out why do they matter so much."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-returns-with-podcast-about-successful-women-days-after-cooking-show-2693652-2025-03-14",
      "headline": "Meghan Markle returns with podcast about successful women days after cooking showMeghan Markle, Duchess of Sussex, has announced her new stint. She will now be launching a podcast, narrating the stories of successful women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-celebrates-holi-apoorva-mukhija-returns-instagram-india-got-latent-2693645-2025-03-14",
      "headline": "Ashish Chanchlani celebrates Holi with director Abhishek KapoorAmid the India's Got Latent controversy, social media influencers Ashish Chanchlani and Apoorva Mukhija seemed to be moving forward in their respective journeys. Chanchlani stepped out to celebrate Holi, while Mukhija made her Instagram comeback, expressing gratitude to her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hema-malini-seen-with-a-script-for-reality-show-on-indian-idol-fans-react-2693602-2025-03-14",
      "headline": "Hema Malini seen with a 'script for reality show' on Indian Idol, fans reactA Reddit post suggested the scripted nature of Indian Idol as actor Hema Malini was seen holding a detailed script during a recent episode. The revelation has sparked reactions online, questioning the authenticity of reality shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/k-drama-star-lomon-on-family-matters-taj-mahal-speaks-in-hindi-india-all-of-us-are-dead-exclusive-2693616-2025-03-14",
      "headline": "K-drama star Lomon on Family Matters, Taj Mahal, India, All of Us are Dead | ExclusiveK-drama star Lomon sits down with India Today's Bhavna Agarwal to talk about his latest release, Family Matters, now streaming on Channel K. He has a special message for Indian fans as well. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-agency-confirms-he-dated-kim-sae-ron-denies-his-role-in-her-death-official-statement-2693538-2025-03-14",
      "headline": "Kim Soo-hyun's agency confirms he dated Kim Sae-ron, denies his role in her deathSouth Korean actor Kim Soo-hyun has been facing a lot of backlash for his alleged involvement in pushing his former girlfriend Kim Sae-ron to the brink of death. His agency has now clarified that the two were indeed dating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-confirms-his-kaun-banega-crorepati-return-amid-retirement-rumours-2693526-2025-03-14",
      "headline": "Amitabh Bachchan confirms his KBC return amid retirement rumoursAmid speculation of Shah Rukh Khan or Aishwarya Rai hosting the next season of Kaun Banega Crorepati, Amitabh Bachchan has confirmed his return as the host. The veteran actor expressed gratitude for the love and support he received over the past 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-embraces-holi-spirit-sends-wishes-to-fans-2693516-2025-03-14",
      "headline": "Singer Shawn Mendes embraces Holi spirit in India, sends wishes to fansSinger Shawn Mendes is in India for Holi. The artiste, who recently performed at Lollapalooza India, extended his Holi wishes on Friday with a vibrant selfie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-admits-feeling-unqualified-unequipped-in-self-critical-post-2693506-2025-03-14",
      "headline": "Justin Bieber admits feeling 'unqualified, unequipped' in self-critical postSinger Justin Bieber opened up about his inner struggles and feelings of inadequacy amid ongoing health concerns, admitting to often feeling like a fraud despite his success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arjit-singh-martin-garrix-new-single-angles-for-each-other-full-song-out-2693494-2025-03-14",
      "headline": "Home studio to stardom: Arijit Singh, Martin Garrix unveil new singleSinger Arijit Singh and Dutch DJ and record producer, Martin Garrix, collaborated for a new single, 'Angels For Each Other'. The duo unveiled the song ahead of Holi. Garrix lent his vocals for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-its-okay-to-not-be-okay-costar-seo-yeji-dating-rumours-2693389-2025-03-13",
      "headline": "Kim Soo-hyun's co-star Seo Ye-ji on rumours of dating him: Please stopA recent controversy involving K-drama actor Kim Soo-hyun has dragged his former co-star Seo Ye-ji into the limelight. She addressed rumours linking her to the actor and expressed her frustration on her fancafe, clarifying that she has no personal ties with Kim Soo-hyun."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ratna-pathak-shah-karwa-chauth-comment-roshesh-rajesh-kumar-2693342-2025-03-13",
      "headline": "Liberal women like Ratna Pathak Shah often question sanskriti: Actor Rajesh KumarActor Ratna Pathak Shah's remarks on Karva Chauth in 2022 sparked a debate, leading to a response from her co-star Rajesh Kumar, who defended traditional customs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/siddharth-test-character-promo-cricketer-arjun-look-unveiled-by-r-ashwin-2693260-2025-03-13",
      "headline": "It's do or die for Siddharth as cricketer Arjun in Test promo. WatchCricketer R Ashwin unveiled the character promo of Siddharth as Arjun in Netflix's upcoming project, Test. The film will stream on Netflix from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-kardashian-received-22kg-wedding-invite-from-ambanis-i-dont-know-them-2693247-2025-03-13",
      "headline": "Kim, Khloe Kardashian didn't know Ambanis, yet attended the weddingKim Kardashian and Khloe recall their time in India from last year when they flew down to attend the grand wedding of Anant Ambani and Radhika Merchant. Kim reveals that she didn't know the Ambani family and still decided to participate in the festivities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-making-socially-responsible-songs-we-are-artistes-not-scholars-2693059-2025-03-13",
      "headline": "Honey Singh on making socially responsible songs: We are artistes, not scholarsSinger and rapper Yo Yo Honey Singh, in an interview with India Today Digital, got candid about crafting socially responsible songs for the youth. The singer added how his attempts to craft such songs failed to resonate with the audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-faces-backlash-amid-kim-sae-ron-controversy-loses-brand-deals-report-2693077-2025-03-13",
      "headline": "Kim Soo-hyun faces backlash amid Kim Sae-ron controversy, loses brand deals: ReportKim Soo-hyun is embroiled in controversy over his alleged past relationship with the late Kim Sae-ron. The actor faces backlash, losing followers and brand deals."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-response-trump-ukrainian-troops-surrender-war-ceasefire-proposal-2693739-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will save Ukrainian troops' lives if they surrender: Putin on Trump's appealRussian President Vladimir Putin has said Ukrainian troops will be spared if they surrender. His comments followed Donald Trump's claim that he urged Putin to ensure their safety. Trump described talks with Putin as \"productive,\" raising hopes for a ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-rantagiri-mosque-temple-procession-tension-rajapur-shimga-festival-2693690-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mosque gate struck with tree trunk in Maharashtra? Police say no forced entryA video from Maharashtra's Ratnagiri showing a mob attempting to ram a mosque gate with a timber log has gone viral, sparking controversy. However, police said that there was no forced entry to the mosque, and the situation remains peaceful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/mark-carney-canada-24th-prime-minister-2693719-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mark Carney sworn in as Canada's 24th PM, vows country will never be part of USMark Carney was sworn in as Canada's prime minister on Friday, succeeding Justin Trudeau. Carney faces challenges, including strained US relations and upcoming elections. A former central banker, he plans to maintain tariffs until trade tensions ease."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-vadodara-drunk-driver-kills-woman-injures-others-ram-car-screams-another-round-viral-video-cctv-2693530-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drunk driver's rampage caught on camera, kills woman, screams 'another round'The driver, a student from Varanasi, came out of the car that was severely damaged following the accident, and screamed \"another round\" multiple times by throwing his arms in the air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-ranjani-srinivasan-indian-columbia-student-self-deports-after-visa-revocation-glbs-2693778-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Ranjani Srinivasan? Indian Columbia student self-deports after visa revocationThe DHS confirmed that an Indian Columbia University student self-deported after her visa was revoked for Hamas support, while a Palestinian student was arrested for overstaying her expired visa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-spacex-crew-10-launch-nasa-sunita-williams-space-station-2693129-2025-03-15#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LIVE: SpaceX eyes Crew-10 launch, relieve Sunita Williams aboard ISSOnce the Crew-10 astronauts arrive at the ISS, they will replace the existing crew, including Sunita Williams, Nick Hague, Butch Wilmore, and Roscosmos cosmonaut Aleksandr Gorbunov. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/blue-ghost-sees-solar-eclipse-from-the-moon-first-pictures-inside-2693702-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blue Ghost sees solar eclipse from Moon. First pictures insideThe solar eclipse was particularly notable as it provided a rare opportunity to witness the Earth's shadow cast over the Sun from the Moon's Mare Crisium landing site. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-green-card-citizenship-deportation-jd-vance-columbia-university-mahmoud-khalil-donald-trump-2693666-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Green card holders have no indefinite right to stay, can be deported: JD VanceIf the US administration determines that a Green Card holder should not remain in the country and that their presence is not in America's best interest, they have no legal right to stay, US Vice President JD Vance said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-vacation-wife-ritika-daughter-maldives-2693718-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma enjoys vacation with family in Maldives before IPL 2025: See picsAfter leading India to Champions Trophy glory, Rohit Sharma took a short holiday in the Maldives with his family. The India captain is expected to join the Mumbai Indians camp next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-golden-temple-amritsar-man-attack-iron-rod-police-2693729-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man goes on rampage with iron rod inside Golden Temple, 5 injuredA migrant labourer from Haryana, Zulfan, climbed to the second floor of a building inside the premises of the Golden Temple, and when people tried to stop him, he targeted them with an iron rod."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-brigadier-sexual-harassment-intimidation-junior-officer-wife-shillong-police-complaint-2693692-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Senior Army officer accused of sexual harassment, intimidation by junior's wife A junior officer's wife in Shillong has accused an Army Brigadier of harassment, alleging inappropriate remarks, physical intimidation, and threats during a dining function at the Officers' Mess."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/eight-schoolgirls-hospitalised-after-attack-with-chemical-laced-holi-colours-in-karnataka-2693721-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "8 schoolgirls hospitalised after unknown men throw chemical-laced Holi coloursA group of unidentified men on motorcycles targeted eight schoolgirls in Karnataka's Gadag district, throwing chemical-laced colours on them during Holi celebrations, causing severe breathing issues and hospitalisation.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/how-the-maratha-deccan-became-the-ulcer-of-aurangzeb-empire-sambhaji-chhava-shivaji-2692362-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How the Maratha Deccan became the ulcer of Aurangzeb's empireAurangzeb inherited one of the largest empires in history — but his tallest ambition of annexing the Deccan region was among the reasons for the ruin of the Mughal empire. His \"obsession\" with the Deccan drained resources, alienated allies, and left him battling the Marathas, who were relentless in their struggle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/ranya-raos-bail-plea-rejected-in-gold-smuggling-case-over-seriousness-of-charges-2693672-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No bail to Ranya Rao in gold smuggling case, court cites 'seriousness of charges'The Special Court for Economic Offences denied bail to Kannada actor Ranya Rao in the gold smuggling case, citing the seriousness of charges. Her lawyers now plan to move the Sessions Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-champions-trophy-t20-world-cup-2021-threats-2693683-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I received threats, told not to return to India in 2021: Varun ChakravarthyIndia's latest spin-bowling sensation, Varun Chakravarthy, recalled how he dealt with the lows of the T20 World Cup 2021. The Kolkata Knight Riders star played a crucial role in India's Champions Trophy 2025 triumph. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengals-nadia-road-accident-car-rams-e-rickshaw-death-injured-toll-2693712-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Six killed, 8 injured as speeding car rams e-rickshaws in Bengal's NadiaSix people, including three women and a child, died after a speeding SUV hit three e-rickshaws in West Bengal's Nadia district on Friday. Eight others were injured, with two in serious condition. Police are investigating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-removed-prada-brand-ambassador-kim-sae-ron-death-2693694-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kim Soo-hyun removed as Prada's brand ambassador amid Kim Sae-ron scandal: ReportK-drama star Kim Soo-hyun has reportedly been removed as luxury brand Prada's brand ambassador following his alleged involvement in actor Kim Sae-ron's death scandal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-congress-mla-bambar-thakur-shot-at-by-unidentified-men-at-residence-in-chhattisgarh-2693669-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Congress MLA shot at by unidentified men at residence in Himachal PradeshCongress leader and former MLA Bambar Thakur was injured on Friday after four unidentified assailants shot at him and his security member in front of his residence in Himachal Pradesh's Bilaspur district, said police sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/all-england-2025-lakshya-sen-loses-quarterfinals-li-shi-feng-2693646-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lakshya Sen bows out in quarters, India's singles campaign ends in All EnglandAll England Open 2025: India's Lakshya Sen missed out on a second straight semi-final spot at the prestigious Super 1000 tournament in Birmingham, falling to sixth seed Li Shi Feng of China in straight games on Friday, March 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-records-hottest-day-of-year-at-362degc-on-holi-some-parts-witness-rain-2693677-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi records hottest day of year at 36.2°C on Holi, some parts witness rainDelhi recorded its hottest day of the year on Friday, with temperatures reaching 36.2°C at Safdarjung, seven degrees above normal. Palam recorded 34°C. Despite the heat, parts of the city experienced light rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/spicejet-cabin-crew-holi-dance-to-balam-pichkari-on-flight-goes-viral-watch-video-2693595-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SpiceJet cabin crew's Holi dance to Balam Pichkari on flight goes viral. Watch videoIn the viral video, the SpiceJet cabin crew, dressed in white outfits, can be seen dancing in the aisle to Balam Pichkari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/private-aircraft-crashes-near-pitt-greenville-airport-glbs-2693684-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Private aircraft crashes near airport in US's North CarolinaA Beechcraft Bonanza private plane crashed near Pitt-Greenville Airport in North Carolina on Friday morning. The FAA confirmed two people were on board, but their condition remains unknown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bomb-explosion-mosque-targeting-local-leader-pakistan-south-waziristan-jui-f-party-2693638-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blast at Pakistan mosque, local Islamist leader among 4 injuredA blast at a mosque in Pakistan's Waziristan region injured a local JUI-F leader, Abdullah Nadeem, and three others, including two children on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-ordnance-factory-worker-leaks-secrets-to-pakistans-isi-after-facebook-honeytrap-2693579-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP ordnance factory worker lured by Pak agent on Facebook, leaks secrets to ISIAn ordnance factory charge man was arrested for allegedly spying for ISI after falling into a honey trap. The Uttar Pradesh Anti-Terrorism Squad (ATS)detained Ravindra Kumar and his associate in Agra for leaking military secrets to Pakistan-based handlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-naughty-kid-abhishek-bachchan-be-happy-promotion-2693782-2025-03-15",
      "headline": "Farah Khan recalls chasing 'naughty kid' Abhishek Bachchan a Happy New Year setsFarah Khan reminisced about working with Abhishek Bachchan on Happy New Year, sharing anecdotes from their time on set. Abhishek, promoting his new film Be Happy, also recalled his career highlights and upcoming projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/doechii-honoured-as-billboards-2025-woman-of-the-year-a-historic-win-glbs-2693740-2025-03-14",
      "headline": "Doechii honoured as Billboard's 2025 Woman of the Year – A historic winBillboard Women in Music will air live on March 29 at 7 p.m. Pacific on VIZIO WatchFree+."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ted-lassos-journey-isnt-over-season-4-set-to-bring-more-humour-glbs-2693731-2025-03-14",
      "headline": "Ted Lasso's journey isn't over—Season 4 set to bring more humourTed Lasso the character was first introduced by Sudeikis in 2013 to promote NBC Sports' coverage of the England Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-glimpse-working-holi-ssmb-29-set-ss-rajamouli-mahesh-babu-2693722-2025-03-14",
      "headline": "Priyanka Chopra's Holi celebration from sets of SS Rajamouli's next with Mahesh BabuPriyanka Chopra celebrated a 'working Holi' on the sets of her upcoming film SSMB 29 with her team in Odisha, sharing joyful moments on Instagram. The film, co-starring Mahesh Babu and Prithviraj Sukumaran, marks her return to Indian cinema after The Sky Is Pink."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cole-palmer-reveals-he-didnt-want-to-join-chelsea-glbs-2693785-2025-03-15",
      "headline": "Cole Palmer reveals he didn't want to join ChelseaCole Palmer admitted he initially resisted joining Chelsea, but his move from Manchester City has turned into a success, earning him major awards and establishing him as a key player.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-on-jasprit-bumrah-injury-ipl-2025-2693771-2025-03-14",
      "headline": "Jasprit Bumrah needs to be smarter, he's not young like before: Glenn McGrathLegendary Australia seamer Glenn McGrath feels India speedster Jasprit Bumrah needs to be smarter about his game going forward to avoid injuries as he's not getting any younger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/meg-lanning-not-fussed-about-past-delhi-capitals-vs-mumbai-indians-wpl-2025-2693764-2025-03-14",
      "headline": "Meg Lanning not fussed about past, confident of putting pressure on Mumbai in finalDelhi Capitals captain Meg Lanning said that she isn't thinking too much about the past matches ahead of the Women's Premier League 2025 (WPL 2025) final against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-womens-premier-league-2025-final-delhi-capitals-vs-mumbai-indians-2693724-2025-03-14",
      "headline": "WPL 2025: When and where to watch final between Mumbai Indians and Delhi Capitals?The final of the Women's Premier League 2025 (WPL 2025) will be played between Delhi Capitals and Mumbai Indians on Sunday, March 15 at Brabourne Stadium, Mumbai. Here's the complete broadcast and streaming details of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-vacation-wife-ritika-daughter-maldives-2693718-2025-03-14",
      "headline": "Rohit Sharma enjoys vacation with family in Maldives before IPL 2025: See picsAfter leading India to Champions Trophy glory, Rohit Sharma took a short holiday in the Maldives with his family. The India captain is expected to join the Mumbai Indians camp next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-leads-ipl-teams-holi-celebration-rajasthan-royals-2693711-2025-03-14",
      "headline": "Watch: Injured Rahul Dravid leads IPL teams' Holi celebration ahead of 18th seasonRajasthan Royals head coach Rahul Dravid was seen celebrating Holi in a wheelchair after getting injured while playing cricket in Bengaluru. Dravid was appointed as Rajasthan's head coach after his contract with the Indian cricket team came to an end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-2025-draft-pakistan-players-snub-ipl-ownership-2693705-2025-03-14",
      "headline": "The Hundred draft: Why no team picked any of the 50 Pakistan cricketersPakistan players were completely overlooked in The Hundred 2025 draft on March 13. While fingers have been pointed towards changes in franchise ownership, including IPL-affiliated investors, there could more than one reason for the teams not picking Pakistan talents for the 2025 season, starting August 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-on-bazball-ashes-the-hundred-2025-26-2693696-2025-03-14",
      "headline": "Warner unsure of Bazball's effectiveness in Australia during Ashes 2025-26Australian opener David Warner said that he's unsure of England's Bazball effectiveness in Australia during the Ashes 2025-26. England will tour Australia for a five-match Test series beginning from November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-champions-trophy-t20-world-cup-2021-threats-2693683-2025-03-14",
      "headline": "I received threats, told not to return to India in 2021: Varun ChakravarthyIndia's latest spin-bowling sensation, Varun Chakravarthy, recalled how he dealt with the lows of the T20 World Cup 2021. The Kolkata Knight Riders star played a crucial role in India's Champions Trophy 2025 triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matthew-kuhnemann-opens-up-on-bowling-action-controversy-2693682-2025-03-14",
      "headline": "Matthew Kuhnemann on action controversy: Played 100 games and never got questionedAustralia spinner Matthew Kuhnemann recently opened up on his bowling action controversy after being reported by match officials during the second Test against Sri Lanka in February earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iml-2025-sachin-tendulkar-holi-celebration-yuvraj-singh-water-gun-prank-2693665-2025-03-14",
      "headline": "Watch: Sachin Tendulkar turns prankster on Holi, soaks Yuvraj Singh with water gunSachin Tendulkar and his teammates celebrated Holi at their team hotel in Raipur, with the batting legend leading a playful water gun attack on Yuvraj Singh. Yuvraj had slept in after his match-winning knock in the semi-final of the International Masters League against Australia on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-2025-draft-pakistan-players-snub-ipl-ownership-2693705-2025-03-14",
      "headline": "The Hundred draft: Why no team picked any of the 50 Pakistan cricketersPakistan players were completely overlooked in The Hundred 2025 draft on March 13. While fingers have been pointed towards changes in franchise ownership, including IPL-affiliated investors, there could more than one reason for the teams not picking Pakistan talents for the 2025 season, starting August 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-on-bazball-ashes-the-hundred-2025-26-2693696-2025-03-14",
      "headline": "Warner unsure of Bazball's effectiveness in Australia during Ashes 2025-26Australian opener David Warner said that he's unsure of England's Bazball effectiveness in Australia during the Ashes 2025-26. England will tour Australia for a five-match Test series beginning from November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-champions-trophy-t20-world-cup-2021-threats-2693683-2025-03-14",
      "headline": "I received threats, told not to return to India in 2021: Varun ChakravarthyIndia's latest spin-bowling sensation, Varun Chakravarthy, recalled how he dealt with the lows of the T20 World Cup 2021. The Kolkata Knight Riders star played a crucial role in India's Champions Trophy 2025 triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matthew-kuhnemann-opens-up-on-bowling-action-controversy-2693682-2025-03-14",
      "headline": "Matthew Kuhnemann on action controversy: Played 100 games and never got questionedAustralia spinner Matthew Kuhnemann recently opened up on his bowling action controversy after being reported by match officials during the second Test against Sri Lanka in February earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iml-2025-sachin-tendulkar-holi-celebration-yuvraj-singh-water-gun-prank-2693665-2025-03-14",
      "headline": "Watch: Sachin Tendulkar turns prankster on Holi, soaks Yuvraj Singh with water gunSachin Tendulkar and his teammates celebrated Holi at their team hotel in Raipur, with the batting legend leading a playful water gun attack on Yuvraj Singh. Yuvraj had slept in after his match-winning knock in the semi-final of the International Masters League against Australia on Thursday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}