{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/elon-musks-starlink-gets-licence-from-telecom-ministry-2736847-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence from telecom ministryElon Musk's Starlink has received a crucial licence from India's telecom ministry, paving the way for its satellite internet services in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in India: ReportStarlink had applied for the licence back in 2022, but the process was delayed due to various concerns, including national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-over-700-points-nifty-goes-past-25000-rbi-mpc-rate-cut-bajaj-finance-gains-5-percent-2736785-2025-06-06",
      "headline": "Sensex jumps over 700 points, Nifty goes past 25,000; Bajaj Finance gains 5%The S&P BSE Sensex jumped 746.95 points to end at 82,188.99, while the NSE Nifty50 gained 252.15 points to close at 25,003.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-donald-trump-double-tariff-steel-aluminium-india-trade-export-impact-expert-view-2736782-2025-06-06",
      "headline": "US doubles steel, aluminium tariff: Is it a big worry for India?The tariff hike does not apply to all countries. The United Kingdom has been excluded because of a trade agreement already in place with the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-rate-cut-may-hurt-fds-interest-rate-heres-what-investors-should-do-now-mpc-meeting-repo-rate-reduction-crr-phased-cut-2736729-2025-06-06",
      "headline": "RBI rate cut may hurt FDs. Here's what investors should do nowBanks have already begun adjusting their FD rates downward following the RBI's earlier moves since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/hina-khan-rocky-emotional-wedding-vows-have-promise-of-universe-amid-uncertainties-2736989-2025-06-06",
      "headline": "Hina-Rocky's emotional wedding vows have promise of universe amid uncertaintiesHina Khan shared a heartwarming video of her wedding vows with husband Rocky Jaiswal. The couple got married on June 4, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/shweta-tripathi-on-turning-producer-with-theatre-play-cock-2736942-2025-06-06",
      "headline": "Shweta Tripathi on turning producer with Cock: I am hungry to act, not greedyActor Shweta Tripathi has turned producer with her banner, AllMyTea Productions. In an interview with India Today, she speaks about backing the queer-themed play 'Cock' and portrayal of LGBTQI+ community in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-reveals-91-year-old-mother-zeenat-to-make-debut-sitaare-zameen-par-2736961-2025-06-06",
      "headline": "Aamir Khan reveals his mother will make her debut in Sitaare Zameen ParBollywood superstar Aamir Khan recently broke the news about his mother Zeenat Khan's guest appearance in RS Prasanna's 'Sitaare Zameen Par'. This is the first time Zeenat will be seen in his film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shweta-basu-prasad-reinvention-acting-pankaj-tripathi-criminal-justice-season-4-2736795-2025-06-06",
      "headline": "Shweta Basu Prasad says she is scared of repeating herself as an actorActor Shweta Basu Prasad opens up about her evolving acting choices and experience with Pankaj Tripathi in 'Criminal Justice'. She highlights the importance of reinvention and chemistry to keep storytelling fresh and engaging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-sanjay-dutt-star-power-arabic-thriller-7-dogs-teaser-2736924-2025-06-06",
      "headline": "7 Dogs teaser: Salman Khan, Sanjay Dutt's powerful cameos light up Arabic thrillerSalman Khan and Sanjay Dutt featured in the power-packed teaser of the Arabic film '7 Dogs.' The video has sparked major excitement among Indian fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dhanush-to-play-an-iaf-officer-in-tere-ishk-mein-pics-from-sets-spark-buzz-2736775-2025-06-06",
      "headline": "Dhanush to play an IAF officer in Tere Ishk Mein? Pics from sets spark buzzA new look of actor Dhanush has been shared from his upcoming film 'Tere Ishk Mein'. He will be sharing screen space with Kriti Sanon in the Aanand L Rai film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/preity-zinta-emotional-note-after-pbks-ipl-loss-says-will-come-back-to-finish-the-job-2736857-2025-06-06",
      "headline": "Will come back to finish the job: Preity Zinta's emotional note after PBKS IPL lossPreity Zinta has written an emotional note after her team PBKS lost the IPL final against RCB. The actor thanked fans for their support and said this year was unique."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-uncomfortable-urination-scene-shaitaan-had-to-be-authentic-2736791-2025-06-06",
      "headline": "R Madhavan recalls uncomfortable scene from Shaitaan: Had to be authenticActor R Madhavan recently recalled feeling uncomfortable while shooting the urination scene in 'Shaitaan'. The actor admitted that he tried to remain authentic despite the discomfort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/lafangey-ott-show-review-emotionally-enriching-series-about-career-family-and-society-2736665-2025-06-06",
      "headline": "Lafangey review: Emotionally enriching show about career, family and societyReleased-Fri Jun 06, 2025'Lafangey', co-directed by Prem Mistry and Abhishek Yadav, is streaming on MX Player. The slice-of-life drama about youth aspirations delves into family bonding, the Indian education system and the job crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/housefull-2-shazahn-padamsee-marries-businessman-ashish-kanakia-2736845-2025-06-06",
      "headline": "Actor Shazahn Padamsee marries Ashish Kanakia in intimate wedding ceremony. PicsActor Shazahn Padamsee got married to businessman Ashish Kanakia in an intimate wedding ceremony on June 5, 2025. The dreamy celebrations were attended by close friends and family, with a post-wedding party scheduled for June 7.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tender-is-the-new-tough-for-leading-men-in-k-dramas-2736055-2025-06-06",
      "headline": "Tender is the new tough for leading men in K-dramasK-dramas' male leads have evolved from toxic and controlling to being kind, respectful, and emotionally mature. This shift reflects the ever-so-changing viewer's expectations and a growing focus on healthy, realistic relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddharth-anand-responds-to-akshay-kumar-collab-rumours-2736668-2025-06-06",
      "headline": "Siddharth Anand responds to Akshay Kumar collab rumours, fans left disappointedDirector Siddharth Anand denied rumours of a film with Akshay Kumar, sparking disappointment and debate among fans online. Despite reports of a potential horror collaboration, Siddharth's cryptic 'False' post only fuelled confusion and speculation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyuns-global-rise-amid-scandal-as-anti-garosero-petition-grows-2735538-2025-06-06",
      "headline": "Kim Soo Hyun's global rise amid scandal as anti-GaroSero petition growsKim Soo Hyun is regaining global popularity as his hit drama 'My Love from the Star' debuts in Brazil on SBT, despite ongoing controversy in South Korea involving allegations related to the late Kim Sae Ron. The show's international success marks a key moment in his image revival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-j-hope-impress-in-classic-suits-ahead-of-bts-festa-2025-2736615-2025-06-06",
      "headline": "BTS Jin, J-Hope impress in classic suits ahead of BTS Festa 2025BTS members Jin and J-Hope shared new photos for Festa 2025, marking BTS's 12th anniversary and upcoming reunion after military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-farhan-akhtar-sivakarthikeyan-almost-signed-for-sitare-zameen-par-2736821-2025-06-06",
      "headline": "Aamir Khan reveals Sitaare Zameen Par almost starred Farhan Akhtar, SivakarthikeyanAamir Khan, in a recent round-table interaction, revealed that he had initially backed out of 'Sitare Zameen Par'. The actor recalled that Farhan Akhtar and Sivakarthikeyan were signed in for the film's Hindi and "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-receives-dostoevsky-star-award-shabana-azmi-reacts-2736753-2025-06-06",
      "headline": "Javed Akhtar receives Dostoevsky Star Award, Shabana Azmi shares glimpsesVeteran poet and lyricist Javed Akhtar has been honoured with the prestigious Dostoevsky Star Award by the Russian House for his global literary impact. This adds to his long list of accolades, including the Padma Bhushan and Sahitya Akademi Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-hari-hara-veera-mallu-postponed-again-will-be-worth-the-wait-2736787-2025-06-06",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu postponed again: Will be worth the waitAfter months of speculation, the release of Pawan Kalyan's long-delayed period action drama, 'Hari Hara Veera Mallu', has officially been postponed once again. It was slated for a grand release on June 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-loses-cool-at-mumbai-airport-after-fan-persistent-request-for-selfie-2736532-2025-06-06",
      "headline": "AP Dhillon loses cool at Mumbai airport after fan's persistent request for selfieAP Dhillon was visibly uncomfortable at Mumbai airport after a fan repeatedly asked for selfies and invaded his personal space. Annoyed at the fan's request, AP Dhillon asked,\"Kitni photos lega yaar? (How many photos will you take)\". The singer firmly said \"enough\" before walking away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/housefull-5-movie-review-cringe-and-chaos-in-this-mystery-of-who-killed-comedy-2736724-2025-06-06",
      "headline": "Housefull 5 review: Cringe and chaos in this mystery of who killed comedyReleased-Fri Jun 06, 2025Housefull 5 movie review: In the Akshay Kumar-starrer, the real comedian, Johnny Lever, takes a backseat while the cruise sails full speed ahead in a tide of obscene jokes and crass humour. If this is what Bollywood thinks comedy is, we might need a national sense of humour check. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/activist-files-complaint-against-virat-kohli-over-bengaluru-stadium-stampede-during-rcb-win-celebration-2737010-2025-06-06",
      "headline": "Complaint against Virat Kohli over Bengaluru stadium stampedeBengaluru stampede: RCB batter Virat Kohli, whose franchise won their first IPL title in 18 years, faces a complaint filed by a Karnataka-based activist over Wednesday's stampede, which claimed 11 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/eliminate-the-vile-us-lawmaker-tells-pakistan-to-act-against-jaish-e-mohammed-glbs-2737085-2025-06-07",
      "headline": "Eliminate the vile, act against Jaish-e-Mohammed: US lawmaker to PakistanUS Congressman Brad Sherman urged Pakistan to act decisively against Jaish-e-Mohammed, citing its role in terrorism and journalist Daniel Pearl's murder, and raised concerns over minority rights and Dr Afridi's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-election-muhammad-yunus-april-2026-controversy-bnp-awami-league-political-pressure-explained-2736984-2025-06-06",
      "headline": "Bangladesh election: Is Yunus just buying time amid political pressure? Muhammad Yunus, head of the Bangladesh interim government, has announced elections in the first half of April 2026. This improves the situation of prevailing uncertainty even if just marginally. Parties are pitted in a reform-vs-election fight, and the announcement seems to be an attempt by Yunus to buy time amid pressure from parties and the Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-jannik-sinner-carlos-alcaraz-semifinal-2737088-2025-06-07",
      "headline": "Flawless Sinner ousts Novak Djokovic to set up final vs Carlos AlcarazFrench Open 2025: World No.1 Jannik Sinner knocked out Novak Djokovic with a straight-set win in the second semi-final, thereby setting up a blockbuster final against defending champion Carlos Alcaraz on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/peace-talks-asylum-russia-mocks-trump-elon-musk-feud-dmitry-medvedev-2737127-2025-06-07",
      "headline": "From peace talks to asylum, Russia has a laugh as Trump and Elon Musk feudAs tensions escalated between Trump and Musk, Russian official Dmitry Medvedev jokingly offered to mediate peace in exchange for Starlink shares, while another suggested asylum for the Tesla CEO. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-7-bengaluru-stampede-fallout-bangladeshs-political-meltdown-2737111-2025-06-07",
      "headline": "News Menu, June 7: Bengaluru stampede fallout; Bangladesh's poll meltdownIn today's sizzling News Menu, fallout from the Bengaluru stampede intensifies with arrests and FIRs targeting RCB and event organisers. Meanwhile, Bangladesh announces April 2026 elections, raising doubts about the sincerity of its democratic roadmap. Plus, Eid celebrations and Kashmir's Vande Bharat launch round off the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-snubs-musk-after-meltdown-says-not-particularly-interested-in-call-with-man-who-lost-his-mind-report-2736900-2025-06-06",
      "headline": "Man who lost his mind: Trump not interested in talking to Elon Musk amid fall outUS President Donald Trump snubbed his former ally Elon Musk amid a public spat between both of them, telling ABC News in a phone interview that he was \"not interested in a call with a man who lost his mind\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/raipur-several-boys-drag-beat-bite-off-finger-group-of-girls-assault-viral-video-2737047-2025-06-06",
      "headline": "Group of boys assault 4 girls, drag them, bite off one's finger in RaipurThe girls were returning from a birthday party late at night when they were attacked and assaulted by unidentified miscreants in Raipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-french-open-farewell-retirement-hint-jannik-sinner-2737101-2025-06-07",
      "headline": "Novak Djokovic hints at French Open farewell, unsure of future beyond 2025Novak Djokovic hinted that this year's French Open may have been his last after losing the men's singles semi-final to Jannik Sinner on Friday. The 24-time Grand Slam champion remains uncertain about his future beyond the 2025 season, with Wimbledon and the US Open still in his plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-x-poll-says-yes-to-new-us-party-glbs-2737096-2025-06-07",
      "headline": "The America Party: Musk pushes for new US party after X poll shows 80% supportElon Musk called for a new political party to represent the \"80% in the middle\" following an X poll, hinting at the name \"The America Party.\" This comes amid a feud with Trump, who threatened to revoke federal contracts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/spy-youtuber-jasbir-singh-interrogation-reveals-role-of-ex-pak-cop-espionage-racket-2736890-2025-06-06",
      "headline": "'Spy' YouTuber reveals role of ex-Pak cop in espionage racket during grillingDuring interrogation, 'spy' YouTuber Jasbir Singh, arrested on charges of spying for Pakistan, revealed the involvement of a former Pakistani police officer in an ongoing espionage racket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-blunder-vs-fabiano-caruana-magnus-carlsen-norway-chess-champion-2737087-2025-06-07",
      "headline": "Gukesh blunders against Caruana as Carlsen wins Norway Chess for 7th timeMagnus Carlsen sealed his seventh Norway Chess title after a dramatic final round, aided by Fabiano Caruana's victory over India's D Gukesh, while Anna Muzychuk claimed the women's crown despite a final-day Armageddon loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-man-x-post-parle-g-treat-daughter-viral-israel-hamas-war-food-scarcity-2737029-2025-06-07",
      "headline": "Her favourite treat: Gaza father pays Rs 2,300 for Parle-G pack for toddlerAmid the Israel-Hamas war, a man from Gaza has revealed in a viral X post that he purchased a Parle-G packet for her daughter for 24 euros (approximately Rs 2,342) as he could not deny the toddler her favourite treat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/rcb-felicitation-at-vidhana-soudha-came-with-stringent-guidelines-shows-karnataka-government-letter-stampede-2736885-2025-06-06",
      "headline": "Karnataka okayed RCB's Vidhana Soudha event, letter surfaces amid stampede rowThe Karnataka government approved RCB's felicitation at Vidhana Soudha under 19 strict conditions, including a Rs 15 lakh deposit for tents, as per the official approval letter, accessed exclusively by India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-police-gets-bride-married-wedding-expenses-gonda-robbery-2737099-2025-06-07",
      "headline": "UP Police helps girl get married after brother's murder, bear wedding expensesVineet Jaiswal, Superintendent of Police, and his wife Tanvi Jaiswal played an important role in the wedding as the groom's family had cancelled the wedding out of fear, after the bride, Uday Kumari's brother Shivdin, was killed on April 24, just two days before the wedding. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/from-el-salvadors-mega-prison-to-us-court-the-bizarre-case-of-kilmar-abrego-glbs-2737092-2025-06-07",
      "headline": "Man, wrongly deported from US, brought back to face human smuggling chargesDeported by mistaker to a Salvadoran mega prison, Kilmar Abrego Garcia returns to the US, not to freedom, but to face controversial federal charges amid legal and political backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/kolkata-eid-al-dha-namaaz-red-road-raf-fighter-planes-took-off-calcutta-world-war-ii-history-2736811-2025-06-06",
      "headline": "When Red Road, in heart of Kolkata, turned into an airstrip during World War IIWhile the landing of fighter jets on highways might seem like a recent phenomenon, planes of the Royal Air Force (RAF) landed and took off from the Red Road in Calcutta almost 80 years ago, during the peak of World War II. This is the same road in Kolkata next to the Army's Eastern Command HQ that was in the news over Eid namaaz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vrindavan-thakur-banke-bihari-temple-monkey-snatches-jewellery-2737091-2025-06-07",
      "headline": "Monkey snatches devotee's purse with Rs 20 lakh jewellery in VrindavanAbhishek Agarwal, a resident of Aligarh in Uttar Pradesh had come to Vrindavan with his family and was on his way back from the temple when a monkey snatched the purse from his wife.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/permanently-closed-label-jaish-e-mohammed-markaz-subhan-allah-jamia-masjid-headquarters-2736902-2025-06-06",
      "headline": "Permanently closed label on Jaish headquarters in Pak after India's strikeWhile India has produced video evidence showing that its strike on Jaish-e-Mohammed's terror headquarters, Markaz Subhan Allah, in Pakistan's Bahawalpur, has been reduced to rubble, the terror headquarters founded by Masood Azhar is now also marked as \"permanently closed\" on Google Maps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-xi-jinping-agrees-to-resume-rare-earth-exports-to-us-amid-trade-talks-glbs-2737100-2025-06-07",
      "headline": "Trump says Xi Jinping agrees to resume rare earth exports to US amid trade talksPresident Trump said China agreed to allow rare earth exports to the US, signaling easing trade tensions. Temporary licenses were granted, and both sides plan further talks in London on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/hina-khan-rocky-emotional-wedding-vows-have-promise-of-universe-amid-uncertainties-2736989-2025-06-06",
      "headline": "Hina-Rocky's emotional wedding vows have promise of universe amid uncertaintiesHina Khan shared a heartwarming video of her wedding vows with husband Rocky Jaiswal. The couple got married on June 4, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-confirms-g7-summit-invite-from-canadian-counterpart-says-looking-forward-to-meeting-2736921-2025-06-06",
      "headline": "PM gets G7 Summit invite from Canadian counterpart, says looking forward to meetPrime Minister Narendra Modi received an invitation from his Canadian counterpart Mark Carney on Friday to attend the upcoming G7 summit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-lions-vs-india-a-kl-rahul-century-dhruv-jurel-karun-nair-northampton-2737081-2025-06-07",
      "headline": "KL Rahul century powers India A to strong start vs England LionsKL Rahul's composed century at Northampton steered India A to a strong position against England Lions, bolstering his comeback credentials ahead of the senior team's upcoming Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-supreme-court-grants-doge-access-to-social-security-data-amid-legal-battle-glbs-2737104-2025-06-07",
      "headline": "US Supreme Court grants DOGE access to social security data amid legal battleThe US Supreme Court allowed DOGE access to sensitive Social Security data, overriding privacy concerns while litigation continues, prompting sharp dissent from liberal justices and privacy advocates."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-aryna-sabalenka-vs-coco-gauff-womens-singles-final-head-to-head-roland-garros-2737125-2025-06-07",
      "headline": "Aryna Sabalenka vs Coco Gauff: All you need to know about French Open finalFrench Open 2025: World No.1 Aryna Sabalenka will square off against Coco Gauff as both women aim to break their duck at the French Open and secure their first title at Roland Garros on Saturday, June 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-1st-t20i-report-jos-buttler-liam-dawson-chester-le-street-2737116-2025-06-07",
      "headline": "ENG vs WI 1st T20I: Buttler, Dawson star as England start new era with winEngland started life in T20Is under Harry Brook with a fine win over West Indies in the first match of the series on Friday, June 6. Jos Buttler and Liam Dawson were the stars of the show as West Indies stumbled in their chase at Chester-le-Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-french-open-farewell-retirement-hint-jannik-sinner-2737101-2025-06-07",
      "headline": "Novak Djokovic hints at French Open farewell, unsure of future beyond 2025Novak Djokovic hinted that this year's French Open may have been his last after losing the men's singles semi-final to Jannik Sinner on Friday. The 24-time Grand Slam champion remains uncertain about his future beyond the 2025 season, with Wimbledon and the US Open still in his plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-jannik-sinner-carlos-alcaraz-semifinal-2737088-2025-06-07",
      "headline": "Flawless Sinner ousts Novak Djokovic to set up final vs Carlos AlcarazFrench Open 2025: World No.1 Jannik Sinner knocked out Novak Djokovic with a straight-set win in the second semi-final, thereby setting up a blockbuster final against defending champion Carlos Alcaraz on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-blunder-vs-fabiano-caruana-magnus-carlsen-norway-chess-champion-2737087-2025-06-07",
      "headline": "Gukesh blunders against Caruana as Carlsen wins Norway Chess for 7th timeMagnus Carlsen sealed his seventh Norway Chess title after a dramatic final round, aided by Fabiano Caruana's victory over India's D Gukesh, while Anna Muzychuk claimed the women's crown despite a final-day Armageddon loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-rafael-nadal-plague-photo-vs-lorenzo-musetti-semifinal-2737084-2025-06-07",
      "headline": "Carlos Alcaraz captures Nadal's Roland Garros footprint: Explains gestureCarlos Alcaraz captured a powerful moment ahead of his semi-final, paying tribute to Rafael Nadal's iconic Roland Garros legacy — a quiet gesture that spoke volumes before he marched into yet another French Open final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-lions-vs-india-a-kl-rahul-century-dhruv-jurel-karun-nair-northampton-2737081-2025-06-07",
      "headline": "KL Rahul century powers India A to strong start vs England LionsKL Rahul's composed century at Northampton steered India A to a strong position against England Lions, bolstering his comeback credentials ahead of the senior team's upcoming Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/tottenham-hotspur-ange-postecoglou-sacked-europa-league-win-premier-league-2737050-2025-06-06",
      "headline": "Tottenham Hotspur sack coach Ange Postecoglou days after Europa triumphTottenham Hotspur stunned fans by sacking Ange Postecoglou just days after winning the Europa League. Despite ending a 17-year trophy drought and securing Champions League football, Spurs opted for a new direction following a dismal domestic campaign under the Australian coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-a-vs-england-lions-hundred-2737006-2025-06-06",
      "headline": "KL Rahul begins tour of England with scintillating hundred vs England LionsKL Rahul started India's England tour with a classy century against England Lions. His innings applied great pressure on the bowlers and highlighted his enduring resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-virat-kohli-retirement-michael-clarke-2737003-2025-06-06",
      "headline": "Virat Kohli will come out of Test retirement if India lose to England: ClarkeMichael Clarke says Virat Kohli could come out of Test retirement if India face heavy defeat in their Test series against England. The decision may depend on selectors, captain, and fan support amid team struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-lions-vs-india-a-kl-rahul-century-dhruv-jurel-karun-nair-northampton-2737081-2025-06-07",
      "headline": "KL Rahul century powers India A to strong start vs England LionsKL Rahul's composed century at Northampton steered India A to a strong position against England Lions, bolstering his comeback credentials ahead of the senior team's upcoming Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/tottenham-hotspur-ange-postecoglou-sacked-europa-league-win-premier-league-2737050-2025-06-06",
      "headline": "Tottenham Hotspur sack coach Ange Postecoglou days after Europa triumphTottenham Hotspur stunned fans by sacking Ange Postecoglou just days after winning the Europa League. Despite ending a 17-year trophy drought and securing Champions League football, Spurs opted for a new direction following a dismal domestic campaign under the Australian coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-a-vs-england-lions-hundred-2737006-2025-06-06",
      "headline": "KL Rahul begins tour of England with scintillating hundred vs England LionsKL Rahul started India's England tour with a classy century against England Lions. His innings applied great pressure on the bowlers and highlighted his enduring resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-virat-kohli-retirement-michael-clarke-2737003-2025-06-06",
      "headline": "Virat Kohli will come out of Test retirement if India lose to England: ClarkeMichael Clarke says Virat Kohli could come out of Test retirement if India face heavy defeat in their Test series against England. The decision may depend on selectors, captain, and fan support amid team struggles."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}