{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-stock-price-down-40-percent-in-a-week-why-is-it-falling-2691393-2025-03-10",
      "headline": "Gensol Engineering shares crash 40% in a week. Why is it falling today?Gensol Engineering stock price: The shares of the company were down 3.99% to Rs 309.05 on the Bombay Stock Exchange (BSE) at 10:24 am. In early trade, the company's shares were trading even lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-today-sharp-decline-ceo-tenure-2691381-2025-03-10",
      "headline": "Explained: Why IndusInd Bank shares fell over 5% in early tradeIndusInd Bank share price: The sell-off came after the Reserve Bank of India (RBI) gave CEO Sumant Kathpalia a one-year extension instead of the three-year term the board had wanted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-400-points-3-reasons-why-stock-market-is-rising-today-dalal-street-rally-2691375-2025-03-10",
      "headline": "Sensex gains 400 points: 3 reasons why stock market is rising todaySensex opened at 74,474.98, slightly higher than its previous close of 74,332.58. The index quickly gained over 350 points, reaching the day's high of 74,713.17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-start-the-week-higher-as-us-fed-comments-ease-worries-indusind-bank-shares-2691364-2025-03-10",
      "headline": "Sensex, Nifty open higher as US Fed comments ease worries; IndusInd down 5%The S&P BSE Sensex gained 114.62 points to 74,447.20, while the NSE Nifty50 added 42.25 points to 22,597.75 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-what-to-expect-from-sensex-nifty-in-trade-on-march-10-nse-bse-2691343-2025-03-10",
      "headline": "Stock market today: What to expect from Sensex and Nifty? The Nifty ended at 22,552.50, while the Sensex closed at 74,332.58 in the last session, both gaining nearly 2% for the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-ongc-hcltech-indusind-bank-tata-power-bhel-2691332-2025-03-10",
      "headline": "Stocks to watch today: ONGC, HCLTech, IndusInd Bank, Tata PowerInvestors are expected to remain cautious due to uncertainty over US tariff threats and global market reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/why-family-offices-are-crucial-to-indias-viksit-bharat-by-2047-dream-2690899-2025-03-08",
      "headline": "Why family offices are crucial to India's 'Viksit Bharat by 2047' dream?At the India Today Conclave 2025, Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, discussed the growing role of family offices in India's journey towards becoming a developed economy by 2047. In a session titled \"A Case for Tomorrow\", moderated by Siddharth Zarabi, Shroff explained why family offices are vital for India's economic expansion and how they can contribute to achieving a Rs 30 trillion GDP target in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-gold-card-visas-not-worth-it-for-wealthy-indian-investors-rishabh-shroff-partner-law-firm-cyril-amarchand-mangaldas-2690874-2025-03-08",
      "headline": "US Gold Card visa expensive, not worth it for Indians: Top law firm bossRishabh Shroff, partner at Cyril Amarchand Mangaldas, said Donald Trump's $5 million US Gold Card visa does not make sense for Indians as cheaper alternatives are available. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indias-ultra-rich-top-1-percent-seeking-new-homes-abroad-rishabh-shroff-explains-2690872-2025-03-08",
      "headline": "Why are the richest 1% leaving India? Law firm boss Rishabh Shroff explains Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, shared insights into the rising trend of high-net-worth individuals (HNWIs) acquiring foreign passports and moving their wealth abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pay-is-based-on-capability-not-gender-avarna-jain-on-pay-gap-in-music-industry-2690861-2025-03-08",
      "headline": "Pay is based on capability, not gender: Avarna Jain on pay gap in music industryAt the India Today Conclave 2025, Avarna Jain, Vice Chairperson of Saregama, spoke about the role of women in the workforce and addressed the long-debated issue of pay parity in the music and entertainment industry. She stated that in creative fields, women are leading the way, and pay is determined by ability and capability, not gender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/place-of-tv-will-never-be-taken-away-anu-ranjan-on-otts-replacing-tv-2690829-2025-03-08",
      "headline": "Place of TV will never be taken away: Anu Ranjan on OTTs replacing TVAnu Ranjan, President of The Indian Television Academy, said that television will remain relevant despite the rise of OTT platforms at the India Today Conclave 2025. She explained that while digital streaming services are growing, they cannot replace television, mainly due to affordability and accessibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-today-conclave-2025-women-leaders-on-breaking-barriers-challenges-and-leadership-2690741-2025-03-08",
      "headline": "Conclave 2025: Women leaders on breaking barriers, challenges and leadershipAt the India Today Conclave 2025, Namita Thapar, Executive Director of Emcure Pharmaceuticals, stated that businesses should be evaluated based on numbers, not gender. Speaking at the session \"Breaking Barriers and Building Legacies,\" Thapar stressed that success in business depends on financial results, not whether a man or woman runs it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-see-best-week-of-2025-after-massive-correction-what-dalal-street-investors-can-expect-next-2690794-2025-03-08",
      "headline": "Dalal Street logs best week of 2025. Will positive momentum continue?After a long spell of selling, investors on Dalal Street have finally got some relief. But does this mean the worst is over? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/businesses-should-be-judged-on-numbers-not-genders-namita-thapar-2690743-2025-03-08",
      "headline": "Businesses should be judged by numbers, not gender: Namita Thapar International Women's Day: Namita Thapar, Executive Director of Emcure Pharmaceuticals, highlighted how financial results remain the key factor in business success, regardless of whether a man or a woman runs the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/women-investors-are-putting-in-more-money-in-mutual-funds-than-men-phonepe-wealth-report-2690737-2025-03-08",
      "headline": "Women investors outpacing men in mutual fund investments: ReportThere's a common belief that women prefer safer investments, but the data challenges that view. More women are actively investing in mutual funds and surpassing men in key areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-money-deadlines-you-can-not-miss-in-march-2025-2690529-2025-03-07",
      "headline": "These 3 money deadlines you can't miss in March 2025If you want to secure better returns, deposit in these special fixed deposits, which are available only for a limited period. The last date for investing in these schemes is March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rents-are-increasing-faster-than-salary-in-bengaluru-details-here-2690496-2025-03-07",
      "headline": "Bengaluru's housing rent crisis triggers online debate. Details hereA recent social media post has ignited debate over Bengaluru's soaring rents, with users sharing how housing costs are outpacing salaries and making city living unaffordable.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adtech-new-delhi-unveils-adtechhonours-to-recognise-marketing-tech-innovation-2690472-2025-03-07",
      "headline": "ad:tech New Delhi unveils ad:techHonours to recognise marketing tech innovationHeld on March 6 at Yashobhoomi, in collaboration with the International Advertising Association (IAA) India Chapter, this event brought together industry leaders to honour the innovators shaping the future of tech-driven marketing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/women-day-why-women-investors-outshine-men-in-long-term-wealth-building-stock-market-2690419-2025-03-07",
      "headline": "How women investors are winning the race on Dalal StreetWomen are proving to be more disciplined investors, staying invested for longer periods and making better financial decisions. Their patience and careful approach often lead to higher returns compared to men. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sebi-issues-warning-to-nestle-over-breach-of-insider-trading-regulations-2690402-2025-03-07",
      "headline": "Sebi warns Nestle over breach of insider trading regulations: ReportThe Indian arm of Swiss food giant Nestle said its compliance officer received an administrative warning letter from the Securities and Exchange Board of India (Sebi) on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multiple-pans-can-attract-rs-10000-fine-here-is-how-to-avoid-2690378-2025-03-07",
      "headline": "Multiple PANs can attract Rs 10,000 fine. Here's how to avoid  Holding multiple PANs can complicate tax filings and financial transactions as different transactions are recorded under different PANs, resulting in errors, incorrect tax calculations, and possible scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-end-flat-as-us-tariff-uncertainty-keeps-markets-on-edge-ril-shares-2690377-2025-03-07",
      "headline": "Sensex, Nifty end flat as US tariff uncertainty keeps market on edgeThe S&P BSE Sensex was down 7.51 points to end at 74,332.58, while the NSE Nifty50 added 7.80 points to close at 22,552.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-establishes-us-strategic-bitcoin-reserve-all-you-need-to-know-2690295-2025-03-07",
      "headline": "Donald Trump's US Strategic Bitcoin Reserve. All you need to know With this executive order, President Trump reinforces his commitment to make the US the 'crypto capital of the world.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-incorporating-in-india-is-the-best-decision-for-startups-in-2025-kunal-bahl-snapdeal-2690291-2025-03-07",
      "headline": "Explained: Why incorporating in India is the best decision for startups in 2025 Kunal Bahl, co-founder and former CEO of Snapdeal, believes that incorporating in India offers multiple advantages, including better funding opportunities, tax benefits, and easier compliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-tax-benefits-under-section-80c-check-these-5-options-ppf-ssy-nsc-2690227-2025-03-07",
      "headline": "Looking for tax benefits under Section 80C? Check these 5 optionsThe contributions made to the Public Provident Fund qualify for tax deductions under Section 80C and the interest earned, along with the maturity amount, is tax-free."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-shares-gain-after-prolonged-correction-check-brokerage-views-and-target-price-2690225-2025-03-07",
      "headline": "Reliance share price jumps 3% today. Good time to buy stock?Reliance stock price: The company's stock was up 3.41% to Rs 1,251.80 on the Bombay Stock Exchange (BSE) at 11:56 am. However, it is still down over 20% compared to its 52-week high of Rs 1,608.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-epfo-3-0-all-you-need-to-know-2690187-2025-03-07",
      "headline": "What is EPFO 3.0? 5 key things you can expect While inaugurating EPFO's Telangana zonal office and regional office in Hyderabad, Union Labour Minister Mansukh Mandaviya mentioned that the upgraded system will bring EPFO's services closer to a banking experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/race-against-time-whats-india-doing-to-deal-with-us-reciprocal-tariffs-2690185-2025-03-07",
      "headline": "Race against time: What's India doing to deal with US reciprocal tariffs?With US reciprocal tariffs kicking in on April 2, the government is reportedly considering tariff cuts on key imports while companies across sectors engage with American partners to safeguard their businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-zepto-to-raise-commissions-as-quick-commerce-battle-intensifies-report-2690173-2025-03-07",
      "headline": "Blinkit, Zepto to raise commissions as quick commerce battle intensifies: ReportZepto has been steadily hiking commissions for both users and brands, focusing on unit economics, while Blinkit is rolling out a variable commission model. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/veteran-investor-shankar-sharma-cautions-investors-for-bull-run-end-2025-2689953-2025-03-07",
      "headline": "Is the bull market dead? Ace investor Shankar Sharma cautions investors for 2025When questioned if small investors can bear losses like experienced traders, Sharma said that all successful investors once started small but grew by overcoming challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-news-from-gccs-hiring-set-to-outpace-it-firms-for-second-year-in-a-row-india-jobs-2690154-2025-03-07",
      "headline": "Good news from GCCs: Hiring set to outpace IT firms for second year in a rowWith global businesses continuing to expand their operations in India, GCCs (Global capability centres) are expected to play a bigger role in the job market, as per experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-lower-as-it-stocks-drag-market-in-early-trade-infosys-down-2-percent-2690138-2025-03-07",
      "headline": "Sensex, Nifty open lower as IT stocks drag market in early trade; Infosys down 2%The S&P BSE Sensex fell 206.29 points to 74,133.80, while the NSE Nifty50 lost 63.30 points to 22,481.40 as of 9:17 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-tumble-tariff-uncertainty-clobbers-markets-nasdaq-crashes-2690127-2025-03-07",
      "headline": "Tariff uncertainty clobbers US markets, Nasdaq crashes 10%, S&P slidesStocks fell even though President Trump offered a one-month reprieve from his 25% tariffs on many goods imported from Mexico and Canada. That's unlike the bounce stocks got the prior day from his giving a one-month exemption specifically for automakers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-to-monitor-negotiations-before-taking-a-call-on-us-tariffs-finance-minister-nirmala-sitharaman-2690125-2025-03-07",
      "headline": "India to monitor negotiations before taking a call on US tariffs: Finance MinisterFinance Minister Nirmala Sitharaman said that Commerce Minister Piyush Goyal is currently in the United States for discussions, and India will wait for the outcome before taking a stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lt-introduces-new-policy-one-day-paid-menstrual-leave-for-women-employees-chairman-s-n-subrahmanyan-2690119-2025-03-07",
      "headline": "L&T introduces one-day paid menstrual leave for women employeesThe announcement was made by Chairman and Managing Director S N Subrahmanyan during an event held to mark International Women's Day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-prices-fall-5-percent-crypto-after-donald-trump-orders-us-strategic-reserve-2690108-2025-03-07",
      "headline": "Bitcoin prices fall 5% after Donald Trump orders US strategic reserveBitcoin prices dropped over 5% a day before Donald Trump is set to meet with top executives from the cryptocurrency industry at the White House. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loans-under-under-scanner-as-rbi-plans-stricter-norms-for-banks-lenders-report-2689913-2025-03-06",
      "headline": "Gold loans under scanner as RBI plans stricter norms for lenders: ReportThe RBI wants banks and non-banking financial companies (NBFCs) to conduct deeper background checks on borrowers and verify the ownership of the gold being pledged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-will-central-government-employees-receive-good-news-before-holi-2689886-2025-03-06",
      "headline": "DA hike? Will central government employees receive good news before Holi?The government reviews DA twice a year; the January hike is announced around Holi, while July revision is around Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-special-fixed-deposits-offering-up-to-805-percent-interest-check-details-2689853-2025-03-06",
      "headline": "5 special fixed deposits offering up to 8.05% interest. Check details  These fixed deposits are available only for a limited period, with the last date for investing in these schemes being March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-rises-600-points-nifty-nears-22550-as-auto-and-metal-stocks-rally-2689848-2025-03-06",
      "headline": "Sensex rises 600 points, Nifty nears 22,550 as auto and metal stocks rallyThe S&P BSE Sensex gained 609.86 points to close at 74,340.09, while the NSE Nifty50 added 207.40 points to end at 22,544.70. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-recalls-psychosis-diagnosis-and-how-she-felt-ashamed-to-talk-about-it-2691361-2025-03-10",
      "headline": "Lady Gaga recalls psychosis diagnosis and how she felt 'ashamed' to talk about itIn an interview, singer Lady Gaga discussed her personal struggles that kept her away from music. She shared insights into her mental health journey, being diagnosed with psychosis and the support from her partner, Michael Polansky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-2-trailer-pedro-pascal-and-bella-ramsey-thrilling-return-2691194-2025-03-09",
      "headline": "The Last of Us 2 trailer: Pedro Pascal and Bella Ramsey promise thrilling returnThe first full trailer of The Last of Us Season 2 is here. Starring Pedro Pascal and Bella Ramsey in lead roles, the HBO Max series promises a bigger and better season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-india-shawn-mendes-wows-jonita-gandhi-divine-set-stage-ablaze-2691075-2025-03-09",
      "headline": "Lollapalooza India Day 1: Shawn Mendes must return for a solo concert in IndiaThe first day of Lollapalooza India 2025 kicked off on a grand note with Canadian singer Shawn Mendes' electrifying performance. The show also witnessed performances by several Indian artists, like Jonita Gandhi and Divine among others. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-honours-virat-kohli-wears-team-india-jersey-mumbai-show-lollapalooza-2025-2691066-2025-03-09",
      "headline": "Shawn Mendes honours Virat Kohli, wears Team India jersey at Mumbai show. WatchSinger Shawn Mendes impressed fans with his debut India performance on March 8 at the Lollapalooza Mumbai show. During the concert, the singer delighted fans by wearing Virat Kohli's Team India jersey.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-sings-senorita-on-mumbai-street-ahead-of-lollapalooza-india-2025-2690957-2025-03-08",
      "headline": "Viral: Shawn Mendes sings Senorita on Mumbai street ahead of concertCanadian singer Shawn Mendes, who is currently in India, performed his hit song Senorita on a Mumbai street on Saturday, much to the delight of his fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/zahan-kapoor-on-legacy-black-warrant-and-carving-his-own-path-watch-video-india-today-conclave-2025-2690902-2025-03-08",
      "headline": "Zahan Kapoor on legacy, Black Warrant, and carving his own path. Watch"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zahan-kapoor-black-warrant-kapoor-family-ranbir-kapoor-india-today-conclave-2690795-2025-03-08",
      "headline": "Zahan Kapoor reflects on celebrityhood, Kapoor legacy and Black Warrant's successActor Zahan Kapoor opened up about his career, his latest Netflix show, Black Warrant, his famous cousins, and more, at the India Today Conclave 2025 held in New Delhi on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mindy-kaling-reacts-to-criticism-of-meghan-markle-with-love-meghan-2690838-2025-03-08",
      "headline": "Mindy Kaling reacts to criticism of Meghan Markle's With Love, MeghanActor and creator Mindy Kaling has finally reacted to the criticism of Meghan Markle's lifestyle series, With Love, Meghan. The show premiered on Netflix on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-electric-state-review-russo-brothers-dystopian-film-sparks-and-fizzles-out-2690796-2025-03-08",
      "headline": "The Electric State review: Russo Brothers' dystopian film sparks and fizzles outReleased-Fri Mar 14, 2025The Netflix film, 'The Electric State' falls short of entertainment. The chemistry between Millie Bobbie Brown and Chris Pratt looks awkward, while the bots don't do enough to keep the excitement alive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-x-reviews-internet-shreds-ibrahim-ali-khan-khushi-kapoor-film-calls-it-trashy-2690816-2025-03-08",
      "headline": "Nadaaniyan X reviews: Internet shreds Ibrahim-Khushi's film, calls it trashyNadaaniyan, starring Ibrahim Ali Khan and Khushi Kapoor, debuts on Netflix to widespread criticism, with viewers and critics alike branding it 'unbearable' and 'trashy'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ruby-review-a-debut-album-thats-ambitious-polished-and-unapologetically-jennie-2690749-2025-03-08",
      "headline": "Ruby review: A debut album that's ambitious, polished, and unapologetically Jennie Blackpink's Jennie's debut solo album, Ruby, is a bold exploration of her musical identity, featuring 15 tracks that delve into themes of empowerment and self-discovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-with-love-meghan-renewed-for-season-2-amid-criticism-2690736-2025-03-08",
      "headline": "Meghan Markle's With Love, Meghan renewed for season 2 amid criticismThe Duchess of Sussex, Meghan Markle, has announced a second season of her Netflix series, With Love, Meghan. The show premiered on the OTT giant on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/armaan-malik-kritika-malik-son-zaid-diagnosed-with-rickets-dont-curse-children-payal-malik-2690728-2025-03-08",
      "headline": "BB OTT 3 fame Kritika-Armaan Malik's son Zaid diagnosed with ricketsBigg Boss OTT 3 fame Kritika Malik and husband Armaan Malik's son, Zaid has been diagnosed with rickets. The news was shared by Armaan's first wife, Payal Malik, in her latest vlog. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/neena-gupta-tvf-phulera-ka-panchayati-raj-exposes-proxy-politics-in-rural-india-2690697-2025-03-08",
      "headline": "Neena Gupta's 'Phulera Ka Panchayati Raj' exposes proxy politics in rural IndiaTVF's new series 'Phulera Ka Panchayati Raj' exposed the problem of proxy politics in rural India. In collaboration with the popular series, Panchayat, the series starring Neena Gupta, Faisal Malik, and others is currently trending at No 1 on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pritam-defends-blackpink-jennie-plagiarism-controversy-minor-similarities-statement-rocky-aur-rani-kii-prem-kahaani-alia-bhatt-2690676-2025-03-08",
      "headline": "Pritam defends Blackpink's Jennie amid plagiarism row: Minor similarities happenMusic composer Pritam recently shared a statement and defended Blackpink's Jennie amid plagiarism claims after her recently released teaser looked similar to Alia Bhatt's theme song from Rocky Aur Rani Kii Prem Kahaani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mobland-trailer-out-tom-hardy-pierce-brosnan-helen-mirren-guy-ritchie-jiohotstar-2690587-2025-03-07",
      "headline": "Mobland trailer: Tom Hardy, Pierce Brosnan headline Guy Ritchie's new crime showMobland, the much-awaited crime series by Guy Ritchie, is all set for its grand premiere on JioHotstar this March. Featuring stars like Tom Hardy and Helen Mirren, the show explores the dark world of international crime syndicates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/rishab-sharma-on-starting-his-own-clothing-brand-popularising-sitar-2690428-2025-03-07",
      "headline": "Rishab Sharma on popularising Sitar, starting his own clothing brandRenowned 26-year-old sitar player Rishab Rikhiram Sharma blends classical and modern music. Trained under Ravi Shankar, he performs globally, including at the White House. Known for his mehendi-adorned hands, he also creates music for mental health. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-rick-hoffman-entry-as-louis-litt-means-for-suits-la-2690452-2025-03-07",
      "headline": "What Rick Hoffman's entry as Louis Litt means for Suits LAActor Rick Hoffman will be reprising his iconic character, Louis Litt, from 'Suits', in one of the upcoming episodes of 'Suits LA'. The news comes days after the show received bad reviews for lacking excitement like the original one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/why-sitrarist-rishab-sharma-wears-mehndi-for-every-performance-india-today-conclave-2025-2690388-2025-03-07",
      "headline": "Why sitarist Rishab Sharma wears mehndi for every performanceSitarist Rishab Sharma embraces mehndi as part of his stage presence, blending tradition with innovation. The young sitarist shares how he enhances performance aesthetics while breaking stereotypes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sitarist-rishab-sharma-india-today-conclave-2025-mehendi-viral-white-house-performance-2690355-2025-03-07",
      "headline": "Sitarist Rishab Sharma: Said no to performing at White House initiallyRenowned sitarist and internet sensation Rishab Sharma opened up about performing at the White House, choosing the sitar over guitar, and more, during his appearance at India Today Conclave 2025 in New Delhi on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-shibani-akhtar-pulled-her-by-the-ear-dabba-cartel-india-today-conclave-2025-2690249-2025-03-07",
      "headline": "Shabana Azmi says Shibani Akhtar 'pulled her by the ear' to join Dabba CartelShabana Azmi revealed at the India Today Conclave 2025 that Shibani Akhtar \"pulled her by the ear\" to make her join Dabba Cartel. Shibani always envisioned her as part of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/shabana-azmi-on-dabba-cartel-rise-of-ott-and-feminism-in-cinema-watch-video-india-today-conclave-2025-2690292-2025-03-07",
      "headline": "Shabana Azmi on Dabba Cartel, rise of OTT, and feminism in cinema. VideoAt the India Today Conclave 2025, Shabana Azmi spoke about her role in Dabba Cartel, emphasising that 'power can be quiet'. Co-creator Shibani Akhtar revealed that the concept was built around the idea of a \"Shabana Azmi drug cartel\" from the outset. The series presents a compelling narrative of women coming together in solidarity within a crime drama, with Azmi's nuanced and quiet yet powerful performance serving as its anchor. Her portrayal marks a significant thematic shift in Indian storytelling. Jyotika also shared her experience and connection to her character, highlighting how the roles reflect real-life struggles faced by women, as well as themes of feminism and women's emancipation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jyotika-dabba-cartel-working-with-shabana-azmi-at-india-today-conclave-2025-2690319-2025-03-07",
      "headline": "Jyotika on working with Shabana Azmi in Dabba Cartel: She was a friend to usActor Jyotika was recently seen in the newly-released show Dabba Cartel. At India Today Conclave 2025, she spoke about her character in the crime drama, her camaraderie with Shabana Azmi and what drew her to Dabba Cartel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/shabana-azmi-jyotika-shibani-dandekar-open-up-about-making-dabba-cartel-2690307-2025-03-07",
      "headline": "Shabana Azmi, Jyotika and Shibani Dandekar open up about making Dabba Cartel. PicsDabba Cartel actors Shabana Azmi, Jyotika and creator Shibani Dandekar graced the India Today Conclave 2025 on Friday, where they shared their experience of creating the Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-sweet-dreams-sensuous-song-miguel-watch-video-2690277-2025-03-07",
      "headline": "BTS J-hope's Sweet Dreams is a sensuous song brought alive by Miguel's vocalsBTS member J-hope has released a new song called Sweet Dreams, which also features the American artiste Miguel. Check out the music video inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-review-gajraj-rao-renuka-shahane-prime-video-2690232-2025-03-07",
      "headline": "Dupahiya review: A wholesome watch for your next relaxed weekendReleased-Fri Mar 07, 2025Dupahiya review: This Prime Video series is a charming small-town comedy with endearing performances, witty dialogues, and social themes. While it drags at times, its humour and heart make it a delightful, easy watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/my-view/story/k-drama-star-lee-min-ho-overrated-when-the-stars-gossip-2690224-2025-03-07",
      "headline": "Unpopular opinion: Korean star Lee Min-ho is overratedSouth Korean star Lee Min-ho is a beloved actor. But he is certainly not the most talented or versatile artiste out there. Min-ho is currently seen in the show, When the Stars Gossip, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-review-ram-madhvani-jallianwala-bagh-massacre-sonyliv-2690223-2025-03-07",
      "headline": "The Waking of a Nation review: Ram Madhvani's sincere attempt leaves little impactReleased-Thu Mar 06, 2025The Waking of a Nation review: Director Ram Madhvani's show explores the Jallianwala Bagh Massacre over six episodes. The show is streaming on SonyLIV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-goes-shopping-in-mumbai-colaba-ahead-of-lollapalooza-2690168-2025-03-07",
      "headline": "Singer Shawn Mendes shops in Mumbai's Colaba, goes unnoticed by fansSinger Shawn Mendes has arrived in Mumbai to perform at the Lollapalooza. His casual shopping spree in a vest and flip-flops has caught fans' attention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/friends-actor-stephen-park-on-toxic-environment-on-friends-set-became-race-conscious-2689896-2025-03-06",
      "headline": "Friends actor recalls 'toxic environment' on set: I had become so race-consciousActor Stephen Park shared his negative experiences on the set of Friends, highlighting racial insensitivity. He recalled an incident involving an assistant director's offensive remarks towards fellow actor James Hong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ayesha-khan-bigg-boss-17-faints-shooting-video-goes-viral-2689854-2025-03-06",
      "headline": "BB 17's Ayesha Khan faints while shooting, video goes viralBigg Boss 17 fae Ayesha Khan fainted on the sets of her upcoming project. Reportedly, the incident took place on Kapil Sharma's Kis Kisko Pyaar Karun set. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/nora-fatehi-jason-durelo-teache-kelly-clarkson-snake-hook-step-watch-2689838-2025-03-06",
      "headline": "Nora Fatehi, Jason Durelo teach Kelly Clarkson Snake hook step. WatchKelly Clarkson welcomed Nora Fatehi and Jason Derulo on her talk show, where they showcased their latest hit, Snake, and even taught Kelly the hook step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lisa-kudrow-no-good-deed-netflix-ray-romano-2689833-2025-03-06",
      "headline": "Lisa Kudrow's No Good Deed: This dark comedy could have been darker and funnierLisa Kudrow and Ray Romano are beloved comedic actors. And they deserved better treatment than Netflix's No Good Deed, which is fine at best. The series is currently streaming on the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-review-you-are-neither-fancy-nor-rich-enough-for-markles-show-2689801-2025-03-06",
      "headline": "With Love, Meghan review: You are neither fancy nor rich enough for Markle's show Released-Wed Mar 05, 2025With Love, Meghan could have been a lovely show about cooking and lifestyle, but it becomes a window into Markle's pretentiousness. It can't do away with its elitism, the one thing that Markle stood against during her stint at the royal palace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-cancels-noah-centineo-led-the-recruit-after-2-seasons-2689740-2025-03-06",
      "headline": "Netflix cancels Noah Centineo-led The Recruit after 2 seasonsStreaming giant Netflix has cancelled actor Noah Centineo-starrer The Recruit after only two seasons. The news was recently confirmed by the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-review-charlie-cox-vincent-donofrio-jon-bernthal-jiohotstar-2689718-2025-03-06",
      "headline": "Daredevil Born Again review: An uneven but triumphant return of Hell's Kitchen's devilReleased-Wed Mar 05, 2025Matt Murdock is back as Hell's Kitchen's favourite vigilante in Marvel Studios' Daredevil Born Again. The show had its two-episode premiere on March 5 and can be streamed on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ali-fazal-rakht-brahmand-physical-training-learns-ancient-martial-arts-2689730-2025-03-06",
      "headline": "Ali Fazal trains 7 hours a day for Rakht Brahmand, learns ancient martial artsAli Fazal undergoes 7-hour daily training, learning martial arts and perfecting diction for Rakht Brahmand. He calls the process \"demanding but rewarding.\" The series also stars Samantha Ruth Prabhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/bigg-boss-17s-anurag-dobhal-gets-engaged-to-girlfriend-ritika-2689700-2025-03-06",
      "headline": "Bigg Boss 17's Anurag Dobhal gets engaged to girlfriend RitikaBigg Boss 17's Anurag Dobhal got engaged to his girlfriend Ritika Chauhan. The vlogger shared pictures on Instagram on March 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhavan-nayanthara-siddharth-netflix-film-test-to-premiere-on-april-4-2689695-2025-03-06",
      "headline": "Madhavan, Nayanthara, Siddharth's Netflix film Test to premiere on April 4Madhavan, Nayanthara, and Siddharth star in Test, a Tamil Netflix film exploring life's biggest challenges beyond cricket. Directed by S. Sashikanth, it will stream from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-breaks-down-remembering-singer-says-cannnot-fully-accept-2689598-2025-03-06",
      "headline": "Liam Payne's girlfriend breaks down remembering singer, says 'can't fully accept'One Direction singer Liam Payne's untimely demise has left his girlfriend Kate Cassidy grappling with grief. In a heartfelt interview, she talked about her struggles and healing journey. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vanuatu-prime-minister-orders-cancellation-ex-ipl-boss-fugitive-lalit-modi-passport-interpol-india-alert-2691357-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vanuatu moves to cancel fugitive Lalit Modi's passport: Bid to avoid extraditionVanuatu Prime Minister Jotham Napat accused the fugitive businessman and ex-IPL chief Lalit Modi of using the island nation's citizenship to evade extradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-vs-new-zealand-final-feature-2691329-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Foretold, feared, fulfilled; but final should have been played in LahoreIndia's Champions Trophy win was like a war never fought but already won. With a team as relentless as Sparta's 300 and a batting lineup that rose like demons from every fallen wicket, this victory was never in doubt -- only a story waiting to be told."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-congress-bhupesh-baghel-son-chaitanya-baghel-ed-raids-liquor-scam-2691372-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED raids Bhupesh Baghel's son in Chhattisgarh liquor scamChaitanya Baghel's name came up during the Enforcement Directorate's ongoing investigation into a money laundering case connected to the alleged liquor scam. Raids are currently underway at 14 locations across Chhattisgarh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/clash-mhow-stones-thrown-vehicles-set-on-fire-india-champion-trophy-win-rally-2691321-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Clashes at rally in Mhow after India's win; vehicles set on fire, stones thrownA rally celebrating India's win was passing through the Jama Masjid area in Mhow when some individuals from the vicinity started throwing stones at them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/mark-carney-new-canada-prime-minister-liberal-party-leader-replaces-justin-trudeau-2691324-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet Trudeau's successor Mark Carney, who once likened Trump to VoldemortOn Sunday, Mark Carney was elected as Justin Trudeau's successor after Liberal Party members voted in a nominating contest. Trudeau resigned in January, months after facing a stiff internal revolt with demands for him to step down. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/shows/story/the-buzz-if-you-are-chasing-jd-vance-blasts-protesters-for-following-his-daughter-glbs-2691255-2025-03-09#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "You're a s*** person: JD Vance blasts protesters following his 3-year-old daughterJD Vance's daughter was left anxious after pro-Ukraine protesters followed them. The vice president confronted them, calling out those who stalked a toddler as part of a political protest.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/ranya-rao-firm-ksiroda-allotted-land-by-kiadb-in-tumkur-during-bjp-rule-in-karnataka-says-mb-patil-2691386-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao's firm allotted land during BJP reign: Karnataka industrial bodyCongress government and the Karnataka Industrial Area Development Board admitted that a firm associated with Ranya Rao was allotted land in Tumakuru district. However, the KIADB clarified that it was done during the previous BJP government. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-origin-student-sudiksha-konanki-university-of-pittsburgh-missing-dominican-republic-beach-trip-with-friends-2691330-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-origin student in US vanishes on trip to Dominican Republic, search onSudiksha Konanki, a 20-year-old student from the University of Pittsburgh, was last seen on March 6 on the beach of the Riu Republica Hotel in Punta Cana, according to authorities in the Dominican Republic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/iifa-awards-2025-laapataa-ladies-kartik-aaryan-nitanshi-goel-kill-2691369-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIFA Awards 2025: Laapataa Ladies, Kill and Kartik Aaryan bag top honoursDirector Kiran Rao's Laapataa Ladies, Kill, Kartik Aaryan and several others won big at the IIFA 2025. The award ceremony took place in Jaipur on March 9."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-saharanpur-cop-holds-upside-down-tricolour-disperse-crowd-clashes-erupt-2691363-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: UP cop holds upside-down Indian flag to disperse crowd, clashes eruptPolice were called to disperse the crowd as traffic came to a standstill on the busy road due to the massive crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-pm-mark-carney-message-to-trump-canada-will-never-be-america-51st-state-2691335-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mark Carney wins big, slams Trump: Canada will never be America's 51st stateMark Carney secured the Liberal leadership with 86 per cent support, vowing to defend Canada's sovereignty against US ambitions. His remarks follow Donald Trump's repeated calls for Canada to become America's 51st state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-ct-25-crown-golden-era-ms-dhoni-legacy-2691318-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Undisputed again? Rohit Sharma restores India's golden era in white-ball cricketRohit Sharma has spearheaded India's resurgence in white-ball cricket, leading them to back-to-back ICC titles and restoring their golden era. With no plans to retire soon, Rohit has now sets his sights on eclipsing MS Dhoni's legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-hug-india-win-champions-trophy-2691325-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Viral: Anushka Sharma-Virat Kohli's cute moments after India's winIn a viral video, Virat Kohli can be seen running towards Anushka Sharma and hugging her after India won Champions Trophy 2025. The two were seen spending time with Team India after the historic win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-session-centre-vs-opposition-budget-session-manipur-delimitation-waqf-congress-2691358-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Budget Session 2.0 from today, showdown over delimitation, Trump tariffs expected Live UpdatesGovernment and Opposition are set for a heated clash as Parliament's Budget session is set to resume today, with key battles over electoral roll irregularities, Manipur violence, the Waqf Bill, delimitation and Donald Trump's tariff threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-400-points-3-reasons-why-stock-market-is-rising-today-dalal-street-rally-2691375-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex gains 400 points: 3 reasons why stock market is rising todaySensex opened at 74,474.98, slightly higher than its previous close of 74,332.58. The index quickly gained over 350 points, reaching the day's high of 74,713.17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-trophy-presentation-shoaib-akhtar-pakistan-representative-2691303-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No Pakistan representative at trophy ceremony upsets Shoaib AkhtarChampions Trophy 2025: Legendary fast bowler Shoaib Akhtar expressed surprise over the absence of Pakistani representatives at the trophy presentation ceremony, despite Pakistan being the host nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-dil-to-pagal-hai-moment-madhuri-dixit-iifa-2025-2691351-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shah Rukh Khan recreates Dil To Pagal Hai moment with Madhuri at IIFA 2025Shah Rukh Khan wowed fans at IIFA 2025 with an electrifying performance, dancing to his latest hits and recreating Dil To Pagal Hai moment with Madhuri Dixit, leaving the audience nostalgic and thrilled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/iim-graduate-quits-rs-21-lpa-job-in-just-10-days-after-realising-role-involves-sales-2691378-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIM graduate quits Rs 21 LPA job in just 10 days after realising role involves salesIn a post titled \"Funny incident of an IIM grad\", a Reddit user narrated the particular incident involving the IIM graduate, which has triggered a debate on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/vizianagaram-mp-to-give-rs-50000-for-third-girl-child-cow-for-boy-2691315-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andhra MP promises Rs 50,000 for women who have third girl child, cow for boyVizianagaram MP Kalisetty Appalanaidu announced incentives for women having a third child, aligning with CM Chandrababu Naidu's expanded maternity leave policy. The move, gaining traction online, follows government efforts to encourage population growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-korea-unveils-its-first-nuclear-powered-submarine-with-help-from-russia-2691350-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "North Korea unveils its first nuclear-powered submarine, with 'help' from RussiaMoon, the submarine expert, said that North Korea may have received Russian technological assistance to build a nuclear reactor to be used in the submarine in return for supplying conventional weapons and troops to support Russia's war efforts against Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-recalls-psychosis-diagnosis-and-how-she-felt-ashamed-to-talk-about-it-2691361-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lady Gaga recalls psychosis diagnosis and how she felt 'ashamed' to talk about itIn an interview, singer Lady Gaga discussed her personal struggles that kept her away from music. She shared insights into her mental health journey, being diagnosed with psychosis and the support from her partner, Michael Polansky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-exclusive-interview-sunil-gavaskar-india-planet-2691326-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cribbers might crib: Gavaskar says India the best white-ball team on the planetChampions Trophy 2025: The legendary Sunil Gavaskar said that India is the best white-ball team on the planet, having played in the finals of the last three ICC limited-overs events. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gulmarg-fashion-show-jammu-and-kashmir-ramzan-contoversy-omar-abdullah-inquiry-2691260-2025-03-09#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fashion show in Gulmarg during Ramzan sparks row, Omar Abdullah vows actionJammu and Kashmir Chief Minister Omar Abdullah ordered an inquiry after a controversy arose over an outdoor fashion show being held in Gulmarg, a popular tourist attraction, during the holy month of Ramzan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-the-iphone-16e-and-ipad-air-apple-shifts-focus-to-airpods-with-camera-2691342-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After the iPhone 16e and iPad Air, Apple shifts focus to AirPods with cameraApple is actively working on AirPods with camera, which may take another year or two to hit the market. That said, iOS 19 may not bring major upgrades, according to Bloomberg's Mark Gurman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-hugs-shreya-ghoshal-share-beautiful-moment-at-iifa-2025-2691385-2025-03-10",
      "headline": "Shah Rukh Khan-Shreya Ghoshal's hug is the warmest moment from IIFA 2025In a delightful moment at IIFA 2025, Shah Rukh Khan was seen posing with singer Shreya Ghoshal. The video captures SRK hugging and blessing her, creating a buzz among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-dismisses-sridevi-biopic-rumours-teases-mom-sequel-with-khushi-kapoor-2691389-2025-03-10",
      "headline": "Boney Kapoor dismisses Sridevi biopic rumours, teases MOM sequel with Khushi KapoorBoney Kapoor confirmed MOM 2 and hinted at Khushi Kapoor being a part of it. He dismissed Sridevi biopic rumours, shared updates on No Entry 2, and spoke about his children's careers at IIFA 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-recalls-psychosis-diagnosis-and-how-she-felt-ashamed-to-talk-about-it-2691361-2025-03-10",
      "headline": "Lady Gaga recalls psychosis diagnosis and how she felt 'ashamed' to talk about itIn an interview, singer Lady Gaga discussed her personal struggles that kept her away from music. She shared insights into her mental health journey, being diagnosed with psychosis and the support from her partner, Michael Polansky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/iifa-awards-2025-laapataa-ladies-kartik-aaryan-nitanshi-goel-kill-2691369-2025-03-10",
      "headline": "IIFA Awards 2025: Laapataa Ladies, Kill and Kartik Aaryan bag top honoursDirector Kiran Rao's Laapataa Ladies, Kill, Kartik Aaryan and several others won big at the IIFA 2025. The award ceremony took place in Jaipur on March 9."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-gautam-gambhir-poem-navjot-singh-sidhu-2691376-2025-03-10",
      "headline": "Learn art of overcoming obstacles: Gautam Gambhir stuns Sidhu with poemThe usually serious Gautam Gambhir decided to stun Navjot Singh Sidhu with a few lines from a poem after India's Champions Trophy win on Sunday, March 9. India defeated New Zealand to win the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-final-mitchell-santner-press-conference-matt-henry-injury-2691366-2025-03-10",
      "headline": "New Zealand wanted to win Champions Trophy final for Matt Henry: Mitchell SantnerNew Zealand skipper Mitchell Santner said that the team was looking to win the Champions Trophy final against India for the injured Matt Henry. The pacer missed the summit clash due to an injury and was left in tears ahead of the game on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-gautam-gambhir-india-vs-new-zealand-final-2691359-2025-03-10",
      "headline": "Champions Trophy victory proves why Gambhir is right man for white-ball jobGautam Gambhir secured his first ICC title as the India head coach on Sunday, March 9. After his title win, Gambhir stayed away from the limelight, making sure that he did not take the focus away from the players who had played near flawless cricket to secure the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-approach-mitchell-santner-2691355-2025-03-10",
      "headline": "IND vs NZ: Rohit Sharma's approach puts fear in bowlers, says Mitchell SantnerNew Zealand captain Mitchell Santner praised Rohit Sharma for his performance in the final of the Champions Trophy 2025. Rohit's 76 set up the thrilling chase for India on Sunday, March 9 in Dubai against the Blackcaps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-rohit-sharma-presser-india-vs-new-zealand-final-2691352-2025-03-10",
      "headline": "New Zealand is a very clinical team, satisfying to beat them: Rohit Sharma Champions Trophy 2025: Indian captain Rohit Sharma said that New Zealand is a very clinical team, and it was satisfying to beat them in the final on Sunday at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shreyas-iyer-brilliant-silent-hero-2691345-2025-03-10",
      "headline": "'Silent hero' Shreyas Iyer was brilliant: Rohit Sharma credits India batterChampions Trophy 2025: Rohit Sharma praised Shreyas Iyer for showing consistency and helping India win the title with a four-wicket win over New Zealand in the final in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-virat-kohli-title-win-2691340-2025-03-10",
      "headline": "Rohit Sharma, Virat Kohli surpass MS Dhoni: Champions Trophy triumph in numbersChampions Trophy final: India defeated New Zealand on Sunday in the final to become the most-successful team in the tournament's history. Rohit Sharma and Virat Kohli won their fourth ICC title, eclipsing MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-vs-new-zealand-final-feature-2691329-2025-03-10",
      "headline": "Foretold, feared, fulfilled; but final should have been played in LahoreIndia's Champions Trophy win was like a war never fought but already won. With a team as relentless as Sparta's 300 and a batting lineup that rose like demons from every fallen wicket, this victory was never in doubt -- only a story waiting to be told."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-exclusive-sunil-gavaskar-rohit-sharma-final-india-2691328-2025-03-10",
      "headline": "Caution with aggression: Gavaskar praises Rohit Sharma after 76 in final Champions Trophy 2025: In an interview with India Today, Sunil Gavaskar heaped praise on Rohit Sharma for mixing caution with aggression and helping India beat New Zealand in the final on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-exclusive-interview-sunil-gavaskar-india-planet-2691326-2025-03-10",
      "headline": "Cribbers might crib: Gavaskar says India the best white-ball team on the planetChampions Trophy 2025: The legendary Sunil Gavaskar said that India is the best white-ball team on the planet, having played in the finals of the last three ICC limited-overs events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-hardik-pandya-on-2017-final-ind-vs-nz-2691306-2025-03-10",
      "headline": "Hardik Pandya delighted to bury the ghosts of 2017 after triumphIndia all-rounder Hardik Pandya said that he was delighted to bury the ghosts of the 2017 Champions Trophy final following India's win in the 2025 edition. India beat New Zealand by four wickets to win the Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-virat-kohli-title-win-2691340-2025-03-10",
      "headline": "Rohit Sharma, Virat Kohli surpass MS Dhoni: Champions Trophy triumph in numbersChampions Trophy final: India defeated New Zealand on Sunday in the final to become the most-successful team in the tournament's history. Rohit Sharma and Virat Kohli won their fourth ICC title, eclipsing MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-vs-new-zealand-final-feature-2691329-2025-03-10",
      "headline": "Foretold, feared, fulfilled; but final should have been played in LahoreIndia's Champions Trophy win was like a war never fought but already won. With a team as relentless as Sparta's 300 and a batting lineup that rose like demons from every fallen wicket, this victory was never in doubt -- only a story waiting to be told."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-exclusive-sunil-gavaskar-rohit-sharma-final-india-2691328-2025-03-10",
      "headline": "Caution with aggression: Gavaskar praises Rohit Sharma after 76 in final Champions Trophy 2025: In an interview with India Today, Sunil Gavaskar heaped praise on Rohit Sharma for mixing caution with aggression and helping India beat New Zealand in the final on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-exclusive-interview-sunil-gavaskar-india-planet-2691326-2025-03-10",
      "headline": "Cribbers might crib: Gavaskar says India the best white-ball team on the planetChampions Trophy 2025: The legendary Sunil Gavaskar said that India is the best white-ball team on the planet, having played in the finals of the last three ICC limited-overs events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-hardik-pandya-on-2017-final-ind-vs-nz-2691306-2025-03-10",
      "headline": "Hardik Pandya delighted to bury the ghosts of 2017 after triumphIndia all-rounder Hardik Pandya said that he was delighted to bury the ghosts of the 2017 Champions Trophy final following India's win in the 2025 edition. India beat New Zealand by four wickets to win the Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-shami-mother-feet-2691319-2025-03-10",
      "headline": "Watch: Virat Kohli touches Shami's mother's feet after Champions Trophy winChampions Trophy 2025: Virat Kohli met Mohammed Shami's family and touched the pacer's mother's feet after India won the tournament with a four-wicket win over New Zealand on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-ct-25-crown-golden-era-ms-dhoni-legacy-2691318-2025-03-10",
      "headline": "Undisputed again? Rohit Sharma restores India's golden era in white-ball cricketRohit Sharma has spearheaded India's resurgence in white-ball cricket, leading them to back-to-back ICC titles and restoring their golden era. With no plans to retire soon, Rohit has now sets his sights on eclipsing MS Dhoni's legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-harry-brook-withdraws-2025-season-rules-two-year-ban-2691308-2025-03-10",
      "headline": "Harry Brook pulls out of IPL 2025, could face two-year ban from leagueEngland batting star Harry Brook announced his decision to withdraw from IPL 2025 on Sunday, March 9. Brook was bought by Delhi Capitals for Rs 6.25 crore in the mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-anushka-sharma-celebrates-with-rohits-family-after-india-win-champions-trophy-2691307-2025-03-10",
      "headline": "Watch: Anushka celebrates with Rohit's family after India win Champions TrophyBollywood actor and Virat Kohli's wife, Anushka Sharma, was seen celebrating with Rohit Sharma's family after India won the ICC Champions Trophy 2025, beating New Zealand by four wickets in the final in Dubai on Sunday, March 09. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-kapil-dev-on-rohit-sharma-indias-champions-trophy-win-2691304-2025-03-10",
      "headline": "Wish Rohit Sharma scored a century but extremely proud of the team: Kapil DevLegendary India captain Kapil Dev said he wanted to see a century from Rohit Sharma in the Champions Trophy 2025 final against New Zealand. India captain got out for 76 (83) in the summit clash as the Men in Blue won the final by four wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-sunil-gavaskar-kapil-dev-dance-live-tv-india-champions-trophy-2691305-2025-03-10",
      "headline": "Watch: Gavaskar, Kapil Dev dance on live TV after India win Champions TrophyLegends Sunil Gavaskar and Kapil Dev danced on live television to celebrate India's Champions Trophy triumph. The former captains did not hold back and let their emotions flow while speaking to India Today after Rohit Sharma's men defeated New Zealand in Dubai on Sunday, March 09."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-trophy-presentation-shoaib-akhtar-pakistan-representative-2691303-2025-03-10",
      "headline": "No Pakistan representative at trophy ceremony upsets Shoaib AkhtarChampions Trophy 2025: Legendary fast bowler Shoaib Akhtar expressed surprise over the absence of Pakistani representatives at the trophy presentation ceremony, despite Pakistan being the host nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-winner-prize-money-runners-up-2691297-2025-03-09",
      "headline": "Champions Trophy 2025 prize money: How much do India, New Zealand receive?India secured a massive $2.24 million after their Champions Trophy triumph, while ICC's prize pool distribution sees New Zealand, semi-finalists, and group-stage teams rewarded with significant earnings in the tournament's increased $6.9 million total prize fund."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-kapil-dev-on-rohit-sharma-indias-champions-trophy-win-2691304-2025-03-10",
      "headline": "Wish Rohit Sharma scored a century but extremely proud of the team: Kapil DevLegendary India captain Kapil Dev said he wanted to see a century from Rohit Sharma in the Champions Trophy 2025 final against New Zealand. India captain got out for 76 (83) in the summit clash as the Men in Blue won the final by four wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-sunil-gavaskar-kapil-dev-dance-live-tv-india-champions-trophy-2691305-2025-03-10",
      "headline": "Watch: Gavaskar, Kapil Dev dance on live TV after India win Champions TrophyLegends Sunil Gavaskar and Kapil Dev danced on live television to celebrate India's Champions Trophy triumph. The former captains did not hold back and let their emotions flow while speaking to India Today after Rohit Sharma's men defeated New Zealand in Dubai on Sunday, March 09."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-trophy-presentation-shoaib-akhtar-pakistan-representative-2691303-2025-03-10",
      "headline": "No Pakistan representative at trophy ceremony upsets Shoaib AkhtarChampions Trophy 2025: Legendary fast bowler Shoaib Akhtar expressed surprise over the absence of Pakistani representatives at the trophy presentation ceremony, despite Pakistan being the host nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-winner-prize-money-runners-up-2691297-2025-03-09",
      "headline": "Champions Trophy 2025 prize money: How much do India, New Zealand receive?India secured a massive $2.24 million after their Champions Trophy triumph, while ICC's prize pool distribution sees New Zealand, semi-finalists, and group-stage teams rewarded with significant earnings in the tournament's increased $6.9 million total prize fund."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-rohit-sharma-retirement-ind-vs-nz-champions-trophy-2691293-2025-03-09",
      "headline": "I am not going to retire from ODIs: Rohit Sharma puts rumours to bedStar India batter Rohit Sharma was questioned about his future plans following India's Champions Trophy 2025 triumph. The India skipper said that no rumours should be spread on his retirement as he has no such plans as of now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-on-champions-trophy-win-retirement-next-generation-2691286-2025-03-09",
      "headline": "India will dominate world cricket even after 'we are done': Virat KohliChampions Trophy 2025: Virat Kohli reflected on India's team effort in Dubai. The former captain said he sees a bright future for the team after seniors, including him and Rohit Sharma, retire from the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-player-of-the-match-rohit-sharma-2691283-2025-03-09",
      "headline": "Rohit Sharma explains why he did not change template despite criticismIndia captain Rohit Sharma won the player of the match award in the final of the Champions Trophy. Speaking after the match, Rohit explained why he did not change his template despite huge criticism ahead of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-virat-kohli-rohit-sharma-dandiya-dance-watch-2691273-2025-03-09",
      "headline": "Watch: Kohli and Rohit celebrate triumph with 'Dandiya' danceVirat Kohli and Rohit Sharma celebrated India's Champions Trophy triumph in style, breaking into a special dandiya dance with the match stumps after a thrilling four-wicket win over New Zealand in the final on March 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-wins-champions-trophy-emulates-ms-dhoni-ind-vs-nz-2691270-2025-03-09",
      "headline": "Rohit emulates Dhoni, surpasses Kapil with Champions Trophy winIndia captain Rohit Sharma emulated MS Dhoni and Sourav Ganguly as he became the third India captain to win the ICC Champions Trophy for the country. India beat New Zealand by four wickets in the final to secure their third triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-crowned-champion-dubai-spinners-2691266-2025-03-09",
      "headline": "Rohit Sharma's India crowned Champion of Champions after thrilling final Champions Trophy final: India rode on Rohit Sharma's captain's knock on the big day and an all-round effort from their spinners to beat New Zealand by four wickets. India were crowned the Champions of Champions for the third time in history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-glenn-phillps-takes-one-handed-stunner-to-dismiss-shubman-gill-2691254-2025-03-09",
      "headline": "Watch: Glenn Phillps takes one-handed stunner to dismiss Shubman Gill in finalNew Zealand batter Glenn Phillips took a sensational catch at short cover to dismiss Shubman Gill in the final of the ICC Champions Trophy 2025 against India in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yuzvendra-chahal-rj-mahvash-champions-trophy-final-india-vs-new-zealand-dubai-2691245-2025-03-09",
      "headline": "Yuzvendra Chahal seen with RJ Mahvash at Champions Trophy finalChampions Trophy final: Yuzvendra Chahal was seen enjoying the India vs New Zealand final from the stands in Dubai on Sunday, seated beside popular RJ Mahvash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-fifty-ind-vs-nz-final-india-vs-new-zealand-2691240-2025-03-09",
      "headline": "IND vs NZ: Rohit repays Gambhir's faith with fiery knock India captain Rohit Sharma scored a quick-fire fifty in the final of the ICC Champions Trophy against New Zealand in Dubai. Rohit registered his fifty-plus score of an ICC final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravindra-jadeja-retirement-rumours-virat-kohli-hug-india-vs-new-zealand-final-2691209-2025-03-09",
      "headline": "Ravindra Jadeja retiring? Hug with Virat Kohli sparks speculationChampions Trophy Final: Virat Kohli shared a warm embrace with Ravindra Jadeja after the all-rounder completed his quota of 10 overs in the final against New Zealand in Dubai. Speculation is rife that India's Big Three -- Rohit Sharma, Kohli, and Jadeja-may not play another one-day international together."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-gets-angry-at-shubman-gill-ind-vs-nz-final-2691206-2025-03-09",
      "headline": "Watch: Rohit Sharma gets angry at Shubman Gill for joining team huddle lateIndia captain Rohit Sharma got angry at Shubman Gill during the final of the ICC Champions Trophy 2025 against New Zealand for joining the team huddle late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-kuldeep-yadav-form-barcelona-match-jokes-2691193-2025-03-09",
      "headline": "No Barcelona match? Fans joke about Kuldeep Yadav's spin showChampions Trophy final: Kuldeep Yadav returned to peak form, getting two crucial wickets in his first spell in the final. He dismissed in-form Rachin Ravindra and Kane Williamson Indian spinners choked the run flow in the big final in Dubai on Sunday, March 09. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}