{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-revising-salaries-central-government-employees-approved-2665693-2025-01-16",
      "headline": "8th Pay Commission for central government employees approved. Check details 8th Pay Commission for revising salaries of central government employees approved"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-economy-weaken-2025-world-economic-forum-report-india-us-bright-europe-slowdown-2665655-2025-01-16",
      "headline": "Global economy to weaken over next year, Europe braces for slowdown: WEF report While the global economy braces for subdued growth in 2025, the United States and South Asia, particularly India, emerge as bright spots in an otherwise gloomy outlook. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/3-common-upi-myths-busted-what-is-true-and-what-is-not-2665638-2025-01-16",
      "headline": "3 common UPI myths busted: What's true and what's notThe NPCI has cleared up common UPI myths to help users make secure and informed digital transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/israel-hamas-ceasefire-what-does-it-mean-for-global-indian-stock-markets-us-inflation-datat-donald-trump-2665616-2025-01-16",
      "headline": "Israel-Hamas ceasefire: What does it mean for global and Indian stock markets?The impact of the ceasefire agreement in Gaza between Israel and Hamas could be huge on financial markets, particularly for sectors tied to global trade and energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-drain-bank-accounts-in-minutes-zerodha-nithin-kamath-warns-of-new-scam-2665599-2025-01-16",
      "headline": "Can drain bank accounts in minutes: Zerodha's Nithin Kamath warns of new scamZerodha co-founder Nithin Kamath shared a video on social media warning people about a new phone scam. Read on to check all the details. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-rise-as-hindenburg-research-shuts-down-check-details-2665584-2025-01-16",
      "headline": "Adani Group shares rise as Hindenburg Research shuts down. Details hereIn January 2023, Hindenburg Research published a report alleging financial irregularities within the Adani Group, leading to a massive decline in the conglomerate's market valuation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/7-last-minute-investment-strategies-to-save-taxes-before-fy-2024-25-ends-2665542-2025-01-16",
      "headline": "7 last-minute investment strategies to save taxes before FY 2024-25 endsTax-saving investments help you save on taxes while securing your financial future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-multibagger-railway-stock-jump-key-reason-behind-todays-gain-explained-stmp-2665533-2025-01-16",
      "headline": "RVNL share price up 9% today. Why did multibagger railway stock gain? RVNL stock price: Shares of the company opened higher at Rs 388 and surged to an intraday high of Rs 406.10 in early trade. At around 11 am, RVNL shares were still trading 7.76% higher at Rs 400.75."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-based-short-seller-hindenburg-shuts-down-2665524-2025-01-16",
      "headline": "US-based short-seller Hindenburg shuts downNate Anderson, the founder of the US-based short-seller Hindenburg Research, announced on Thursday his decision to shut down firm, Hindenburg.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-streak-3-reasons-why-stock-market-gained-today-us-inflation-gaza-ceasefire-2665519-2025-01-16",
      "headline": "Sensex, Nifty continue winning streak: 3 reasons why stock market gained todayThe S&P BSE Sensex was up 308.61 points to 77,032.69, while the NSE Nifty50 added 105.75 points to 23,318.95 as of 10:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-share-price-climbs-over-10-percent-q3-results-2665515-2025-01-16",
      "headline": "Explained: Why HDFC Life shares climbed nearly 11% after Q3 resultsHDFC Life shares were up 10.28% to Rs 655.35 at around 10:17 am. Earlier, the stock had reached a day's high of Rs 657.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-today-sensex-nifty-open-higher-for-third-consecutive-session-adani-stocks-gain-up-to-6-percent-2665494-2025-01-16",
      "headline": "Sensex, Nifty open higher for 3rd consecutive session; Adani stocks up 6%Share market today: The S&P BSE Sensex surged 419.86 points to 77,143.94, while the NSE Nifty50 gained 127.65 points to 23,340.85 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-nate-anderson-to-close-reason-here-why-adani-nikola-2665486-2025-01-16",
      "headline": "Nate Anderson's Hindenburg Research to shut shop. Here's whyNate Anderson, the man behind Hindenburg Research, announced the decision in a detailed post, explaining that the firm's work is complete, and it is time to move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/laxmi-dental-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-listing-date-2665472-2025-01-16",
      "headline": "Laxmi Dental IPO allotment: Step-by-step guide to check status. Check latest GMPLaxmi Dental IPO allotment status: Investors who have bid for the IPO can check their allotment through the websites of Bombay Stock Exchange (BSE) and Link Intime India Private Ltd, the registrar for the issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-ril-lt-tech-hdfc-life-hero-motocorp-ltimindtree-q3-results-2665466-2025-01-16",
      "headline": "Stocks to watch today: RIL, L&T Tech, HDFC Life, Hero MotoCorp, SwiggyInvestors will closely watch RIL, Infosys, Axis Bank, and LTIMindtree as these companies are scheduled to announce their third-quarter earnings today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharechat-to-cut-5-percent-of-its-workforce-amid-performance-reviews-report-2665254-2025-01-15",
      "headline": "ShareChat to cut 5% of its workforce amid performance reviews: ReportShareChat has announced slashing 5% of its headcount to enhance operational efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/3-must-know-sections-under-old-tax-regime-to-save-money-2665199-2025-01-15",
      "headline": "3 must-know sections under old tax regime to save moneyThe old regime offers several tax-saving opportunities under several sections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-to-prevent-and-report-credit-card-fraud-a-complete-guide-2665174-2025-01-15",
      "headline": "How to prevent and report credit card fraud: A complete guideCustomers must know how to handle unauthorised credit card transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-climb-as-it-stocks-shine-ahead-of-us-inflation-data-2665153-2025-01-15",
      "headline": "Sensex, Nifty climb as IT stocks shine ahead of US inflation dataThe S&P BSE Sensex gained 224.45 points to close at 76,724.08, while the NSE Nifty50 added 37.15 points to end at 23,213.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-bond-sell-off-whats-going-on-and-will-it-impact-india-2665147-2025-01-15",
      "headline": "Global bond sell-off: What's going on, and will it have any impact on India?As the global bond sell-off continues to accelerate, here's how rising yields and higher borrowing costs may impact the Indian economy and stock markets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-stabbing-mumbai-safe-devendra-fadnavis-maharashtra-chief-minister-2665701-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai safest: Devendra Fadnavis after Kejriwal jabs BJP on Saif Ali Khan attackWrong to call Mumbai unsafe based on one incident: Maharashtra Chief Minister on Saif Ali Khan's stabbing"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attacked-knife-cctv-shows-no-one-going-inside-suspect-insider-job-mumbai-police-statement-2665520-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan's attacker identified, entered actor's home hours before attackAccording to the Mumbai Police, the attack on Saif Ali Khan happened at around 2.30 am. The police suspect that the attacker entered the actor's home through fire escape stairs in a burglary bid, and fled from the spot after the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-knife-attack-multiple-times-inside-house-hospitalised-2665468-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan stabbed at Bandra home, knife removed to stop leaking spinal fluid  Live UpdatesBollywood actor Saif Ali Khan was injured after an unidentified attacker stabbed him multiple times inside his Bandra home during a robbery bid. The actor is reportedly out of danger after undergoing surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadian-pm-justin-trudeau-might-leave-politics-not-contest-next-federal-elections-october-2025-2665688-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Battered, Justin Trudeau won't contest next election, might quit politicsCanadian Prime Minister Justin Trudeau has declared that he won't be contesting Canada's general election this year, and might leave politics. Trudeau has become increasingly unpopular at home and Canada's international ties have soured under him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/bmi-not-accurate-for-obesity-diagnosis-here-are-the-new-guidelines-2665579-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BMI not accurate for obesity diagnosis: Here are the new guidelinesIndian doctors have revised obesity guidelines for the first time in 15 years, moving beyond the traditional BMI tool to include metrics like Waist Circumference and Waist-to-Height Ratio."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-stabbed-knife-attack-bandra-home-2665487-2025-01-16?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Saif Ali Khan shifted to ICU after surgery; cops identify intruderBollywood actor Saif Ali Khan was attacked at his Bandra home in a burglary attempt. He is currently undergoing surgery at Mumbai's Lilavati Hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-rushed-father-saif-ali-khan-to-hospital-in-autorickshaw-after-attack-2665685-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Son Ibrahim rushed Saif Ali Khan to hospital in autorickshaw after attack: SourcesAfter being attacked by an intruder, Saif Ali Khan was rushed to Lilavati Hospital by his son Ibrahim Ali Khan in an autorickshaw. No driver was available at their Mumbai residence at the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-revising-salaries-central-government-employees-approved-2665693-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "8th Pay Commission for central government employees approved. Check details Union Minister Ashwini Vaishnaw announced the decision. While the Cabinet has given its approval, the date for setting up the commission has not been disclosed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/brahmos-missile-export-demand-sale-philippines-indonesia-deal-malaysia-vietnam-south-china-sea-military-2665574-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How China is driving up demand for India-made BrahMosIndonesia is set to ink a deal for the India-made BrahMos missile. The Philippines has already inducted the naval variant of BrahMos, and Vietnam and Malaysia are showing interest in the medium-range missile. This is how the posturing and actions of an assertive China is boosting demand for BrahMos missiles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-spadex-satellites-docking-successful-creates-history-spacecraft-2665500-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro docks satellites in space, India becomes 4th country to achieve featIsro Spadex Mission: The docking experiment, which took place in the wee hours of January 16, 2025, was a meticulous dance between two satellites as the chaser aligned with the target."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-actor-saif-ali-khan-knife-attack-salman-khan-home-shots-fired-bandra-safety-concerns-2665513-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai's Bandra jolted: Saif Ali Khan stabbed, firing outside Salman Khan's homeBesides Saif Ali Khan and Salman Khan, other prominent actors who live in Bandra are Shah Rukh Khan, Aamir Khan, Ranbir Kapoor, Sanjay Dutt, Rekha, Zeenat Aman, Ananya Panday, Farhan Akhtar and Saira Bano."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-knife-attack-arvind-kejriwal-bjp-slam-lawrence-bishnoi-dig-salman-khan-gujarat-jail-2665631-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After attack on Saif Ali Khan, Arvind Kejriwal's 'Lawrence Bishnoi' barb at BJPWhile attacking the BJP for failing to protect the citizens of the country, Arvind Kejriwal said that \"a gangster sitting in a Gujarat jail is acting fearlessly\", in reference to Lawrence Bishnoi lodged in the Sabarmati jail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-live-sinner-swiatek-medvedev-fritz-rybakina-2665433-2025-01-15?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 5 Live Updates: Sinner bounces back, Rune outlasts BerrettiniAustralian Open 2025 Day 5 Live Updates: Jannik Sinner has bounced back after losing the opening set to Australian wildcard Tristan Schoolkate. It's 1-1 after two sets at the Rod Laver Arena. Meanwhile, Holger Rune outlasted Matteo Berrittini in a five-setter. 18-year-old Joao Forseca's dream run ended as the Brazilian teen lost to Lorenzo Sonego. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-bcci-meeting-india-indiscipline-rohit-sharma-match-fees-2665567-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BCCI limits family time on tours after coach Gautam Gambhir's frustrationIndia Today has learnt that the suggestion to curb family time for players on tours came from India men's team head coach Gautam Gambhir. Sources suggest that Gambhir is trying to discipline the Indian team, after two woeful Test series against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-video-after-attack-on-saif-ali-khan-emerges-2665535-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kareena Kapoor seen pacing outside Bandra home after attack on Saif Ali KhanSaif Ali Khan was attacked at his Bandra home during a burglary attempt in which he sustained six stab wounds. In the moments after the attack, Kareena Kapoor was seen pacing outside their home talking to staff members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kevin-pietersen-india-batting-coach-bcci-new-role-speculation-2665635-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kevin Pietersen open to India batting coach job amid new role speculationAmid speculation that the BCCI is considering hiring a batting coach, legendary England batter Kevin Pietersen expressed his interest in the role. The Gautam Gambhir-led coaching staff came under review during the BCCI's post-mortem of the Border-Gavaskar Trophy debacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-attacked-kareena-kapoor-team-statement-rest-of-the-family-is-fine-2665490-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan injured his arm, family fine: Kareena Kapoor issues statementAfter the attack on Saif Ali Khan, actor's wife Kareena Kapoor's team released an official statement. The team said that the rest of the family is fine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-delhi-assembly-elections-promises-lpg-cylinders-free-electricity-free-ration-kits-2665612-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPG cylinders at Rs 500, 300 free electricity units: Congress's Delhi poll sopsIntroducing 'Mehngai Mukt' Yojana to appeal to voters amid inflation, Congress promised to provide 300 units of free electricity, LPG cylinders at Rs 500 and free ration kits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-ceo-writes-about-husband-zero-achievements-in-2024-his-response-is-viral-2665576-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US CEO writes about husband's 'zero' achievements in 2024, his response is viralAs Stacey Champagne's post went viral with mixed reactions, her husband Jesse Sciuto offered a clarification to explain the intention behind her post.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-drain-bank-accounts-in-minutes-zerodha-nithin-kamath-warns-of-new-scam-2665599-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can drain bank accounts in minutes: Zerodha's Nithin Kamath warns of new scamZerodha co-founder Nithin Kamath shared a video on social media warning people about a new phone scam. Read on to check all the details. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-knife-attack-fought-intruder-kareena-kapoor-sons-taimur-jeh-at-home-sources-2665480-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan fought intruder, Kareena, sons were at home during attack: SourcesActor Saif Ali Khan was attacked with a knife at his Bandra home and is currently hospitalised. Kareena Kapoor Khan and the children, Taimur and Jeh, were at home during the attack. Saif faced the intruder head-on to protect the family."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/24-akbar-road-congress-headquarters-change-bjp-national-office-deen-dayal-upadhayay-marg-2665182-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not in IQ or EQ, real story of Congress and BJP is in HQThe evolution of the headquarters of the Congress and BJP tells the story of their organisational journey and priorities. While the BJP swiftly built a modern, tech-savvy central office in less than two years, the Congress clung to an outdated set-up at 24, Akbar Road for five decades. This is what the two HQs reveal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-neighbour-karishma-tanna-calls-stabbing-incident-a-wake-up-call-2665618-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan's neighbour Karishma Tanna calls stabbing incident a 'wake-up call'Saif Ali Khan's neighbour Karishma Tanna said the stabbing incident was a wake-up call for all. Saif was attacked in his Mumbai home during a burglary attempt and is currently in stable condition after undergoing surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/israel-hamas-ceasefire-what-does-it-mean-for-global-indian-stock-markets-us-inflation-datat-donald-trump-2665616-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel-Hamas ceasefire: What does it mean for global and Indian stock markets?The impact of the ceasefire agreement in Gaza between Israel and Hamas could be huge on financial markets, particularly for sectors tied to global trade and energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-rushed-father-saif-ali-khan-to-hospital-in-autorickshaw-after-attack-2665685-2025-01-16",
      "headline": "Son Ibrahim rushed Saif Ali Khan to hospital in autorickshaw after attack: SourcesAfter being attacked by an intruder, Saif Ali Khan was rushed to Lilavati Hospital by his son Ibrahim Ali Khan in an autorickshaw. No driver was available at their Mumbai residence at the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/kangana-ranaut-hosts-special-screening-of-emergency-for-devendra-fadnavis-in-mumbai-2665673-2025-01-16",
      "headline": "Kangana Ranaut hosts special screening of Emergency for Devendra Fadnavis in MumbaiMaharashtra Chief Minister Devendra Fadnavis arrived at PVR Bandra in Mumbai to attend the special screening of Kangana Ranaut's film Emergency. The screening was organised by the actor who is also a BJP MP. She was seen at greeting the Chief Minister as he arrived at the theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-upcoming-films-list-2025-8-projects-that-could-be-affected-by-the-attack-2665660-2025-01-16",
      "headline": "Saif Ali Khan's upcoming films: 8 projects that could be affected by the attackActor Saif Ali Khan is currently shooting for Siddharth Anand's film titled Jewel Thief. He has got as many as eight films in the pipeline. While not all are scheduled to begin this year, it is believed that the shooting schedules will have to be redesigned to fit Saif's recovery time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ek-hasina-thi-is-21-saif-ali-khan-and-urmila-matondkar-classic-sriram-raghavan-2665658-2025-01-16",
      "headline": "Ek Hasina Thi is 21: The twisted Saif-Urmila classic which gave us Sriram RaghavanThe Sriram Raghav thriller, Ek Hasina Thi, has turned 21. The film, which featured Saif Ali Khan and Urmila Matondkar in lead roles, showed off two A-list stars at their peak who were not afraid to go dark. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-kuldeep-yadav-team-selection-2665684-2025-01-16",
      "headline": "Kuldeep Yadav for Champions Trophy? Spinner begins drills after injury-returnIndia wrist spinner Kuldeep Yadav has returned to training after his injury lay-off. Kuldeep, who sat out of the Australia tour due to a long-term groin injury, took to Instagram to post some snippets of his training."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-charlie-dean-replacement-player-sophie-molineux-injured-2665657-2025-01-16",
      "headline": "WPL 2025: RCB announce Charlie Dean as Sophie Molineux replacement for season 3Defending champions Royal Challengers Bengaluru have announced that all-rounder Sophie Molineux would be missing the upcoming season of the WPL 2025 due to a knee injury. Charlie Dean has been roped in as the replacement for Molineux. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-boss-ruben-amorim-welcomes-pressure-to-perform-2665652-2025-01-16",
      "headline": "Premier League: Manchester United boss Amorim welcomes 'pressure to perform'Manchester United boss Ruben Amorim has welcomed the pressure to perform and feels it could be the factor which would help them turnaround their form in the Premier League. United are currently 14th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-barcelona-vs-real-betis-coach-hansi-flick-gives-key-update-on-ronald-araujo-transfer-2665632-2025-01-16",
      "headline": "Barcelona coach Hansi Flick gives key update on Ronald Araujo transferHansi Flick responds to transfer rumours of Ronaldo Araujo after Barcelona's 5-1 win over Real Betis in the Copa Del Rey. According to reports Araujo is expected to join Juventus this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kevin-pietersen-india-batting-coach-bcci-new-role-speculation-2665635-2025-01-16",
      "headline": "Kevin Pietersen open to India batting coach job amid new role speculationAmid speculation that the BCCI is considering hiring a batting coach, legendary England batter Kevin Pietersen expressed his interest in the role. The Gautam Gambhir-led coaching staff came under review during the BCCI's post-mortem of the Border-Gavaskar Trophy debacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-emma-raducanu-iga-swiatek-match-round-3-melbourne-2665630-2025-01-16",
      "headline": "Emma Raducanu unfazed by Iga Swiatek challenge in Round 3: Just going to swingEmma Raducanu has claimed that she will have no pressure heading into the clash against Iga Swiatek in Round 3 of the Australian Open 2025. Raducanu defeated Amanda Aminis"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-coffee-melbourne-vs-sydney-iga-swiatek-alex-de-minaur-2665614-2025-01-16",
      "headline": "Coffee war at Australian Open! De Minaur plays it smart after boos for SwiatekAustralian Open 2025: Iga Swiatek, in a jovial on-court interview after her second-round win, ruffled the local crowd by saying coffee in Sydney tastes better than Melbourne. The Polish superstar was booed by a section of fans after her comments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-australian-open-sriram-balaji-into-round-2-during-mixed-day-for-india-in-doubles-2665607-2025-01-16",
      "headline": "Australian Open: Sriram Balaji into Round 2 during mixed day for India in doublesIt was a mixed day for India in men's doubles as N. Sriram Balaji and his Mexican partner Miguel Angel Reyes-Varela made it to the second round of the Australian Open with a straight sets win over Robin Hasse and Aleksandr Nedovyesov. Ritvik Bollipalli and Anirudh Chandrasekar's journey at the competition came to an end on Thursday, January 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-james-vince-leaves-england-first-class-after-repeated-attacks-at-home-2665597-2025-01-16",
      "headline": "'Stunned' James Vince leaves England after repeated attacks at homeEngland batter James Vince quit first class cricket and moved out of the country. Vince revealed the harrowing reasons behind his decision.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-firmly-in-premier-league-title-race-after-north-london-derby-win-arteta-2665570-2025-01-16",
      "headline": "Arsenal firmly in Premier League title race after North London derby win: ArtetaArsenal boss Mikel Arteta feels that his side is firmly in the title race after their win in the North London derby against Tottenham Hotspur on Wednesday, January 15. Arsenal secured a 2-1 win over their neighbours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-bcci-meeting-india-indiscipline-rohit-sharma-match-fees-2665567-2025-01-16",
      "headline": "BCCI limits family time on tours after coach Gautam Gambhir's frustrationIndia Today has learnt that the suggestion to curb family time for players on tours came from India men's team head coach Gautam Gambhir. Sources suggest that Gambhir is trying to discipline the Indian team, after two woeful Test series against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-coffee-melbourne-vs-sydney-iga-swiatek-alex-de-minaur-2665614-2025-01-16",
      "headline": "Coffee war at Australian Open! De Minaur plays it smart after boos for SwiatekAustralian Open 2025: Iga Swiatek, in a jovial on-court interview after her second-round win, ruffled the local crowd by saying coffee in Sydney tastes better than Melbourne. The Polish superstar was booed by a section of fans after her comments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-australian-open-sriram-balaji-into-round-2-during-mixed-day-for-india-in-doubles-2665607-2025-01-16",
      "headline": "Australian Open: Sriram Balaji into Round 2 during mixed day for India in doublesIt was a mixed day for India in men's doubles as N. Sriram Balaji and his Mexican partner Miguel Angel Reyes-Varela made it to the second round of the Australian Open with a straight sets win over Robin Hasse and Aleksandr Nedovyesov. Ritvik Bollipalli and Anirudh Chandrasekar's journey at the competition came to an end on Thursday, January 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-james-vince-leaves-england-first-class-after-repeated-attacks-at-home-2665597-2025-01-16",
      "headline": "'Stunned' James Vince leaves England after repeated attacks at homeEngland batter James Vince quit first class cricket and moved out of the country. Vince revealed the harrowing reasons behind his decision.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-firmly-in-premier-league-title-race-after-north-london-derby-win-arteta-2665570-2025-01-16",
      "headline": "Arsenal firmly in Premier League title race after North London derby win: ArtetaArsenal boss Mikel Arteta feels that his side is firmly in the title race after their win in the North London derby against Tottenham Hotspur on Wednesday, January 15. Arsenal secured a 2-1 win over their neighbours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-bcci-meeting-india-indiscipline-rohit-sharma-match-fees-2665567-2025-01-16",
      "headline": "BCCI limits family time on tours after coach Gautam Gambhir's frustrationIndia Today has learnt that the suggestion to curb family time for players on tours came from India men's team head coach Gautam Gambhir. Sources suggest that Gambhir is trying to discipline the Indian team, after two woeful Test series against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-india-women-team-highest-odi-score-2665538-2025-01-16",
      "headline": "India's record-shattering onslaught on Ireland was planned: Smriti MandhanaThe Indian women's team slammed their way to a 435-run total against Ireland. India captain Smriti Mandhana revealed that the onslaught was pre-planned and India wanted to play their shots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-results-alex-de-minaur-taylor-fritz-elena-rybakina-melbourne-2665532-2025-01-16",
      "headline": "Australian Open: De Minaur, Fritz into Round 3, Rybakina thrashes Iva JovicAlex De Minaur, Taylor Fritz and Elena Rybakina reached the 3rd round of the Australian Open 2025 with straight set wins on Thursday, January 16. De Minaur saw off Tristan Boyer to make it to the next round in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-chess-pongal-celebration-breakfast-dance-video-2665498-2025-01-16",
      "headline": "Watch: Chess community gathers at Vishy Anand's house for special breakfastViswanathan Anand hosted a hearty breakfast at his home on the day of Pongal. Anand posted a video of the special day out which also celebrated the engagement of Vidit Gujrathi and Nidhi Katia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-gabba-test-akash-deep-virat-kohli-bat-2665497-2025-01-16",
      "headline": "How Virat Kohli gifted Akash Deep his bat that saved Gabba Test for IndiaAkash Deep has revealed the circumstances which led to him getting Virat Kohli's bat. Akash Deep used the bat from Kohli to play a valiant knock that helped India save the Gabba Test during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-reviews-virat-kohlis-border-gavaskar-trophy-delivers-verdict-2665495-2025-01-16",
      "headline": "Brett Lee reviews Virat Kohli's tour of Australia, delivers verdict on battingFormer Australia fast bowler Brett Lee has reviewed Virat Kohli's woeful tour of Australia. Speaking on his batting, Lee said that it was very un-Kohli-like for the batter to edge the ball eight times in his nine innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-dinesh-karthik-pulls-off-one-handed-stunner-for-paarl-royals-vs-mi-cape-town-video-2665489-2025-01-16",
      "headline": "Watch: Dinesh Karthik pulls off one-handed stunner for Paarl Royals in SA20Dinesh Karthik showed why he is still one of the best in the business as the Indian wicketkeeper pulled off a stunning one-handed catch during Paarl Royals' clash against MI Cape Town on Wednesday, January 16. Karthik's catch helped dismiss Azmatullah Omarzai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-betis-copa-del-rey-result-lamine-yamal-2665482-2025-01-16",
      "headline": "Barcelona thrash Real Betis 5-1 to reach Copa Del Ray quarter-finalsFC Barcelona continued their rediscovered form to storm into the quarter-finals of the Copa Del Rey. Youngster Lamine Yamal starred as Barcelona beat Real Betis 5-1 on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-results-iga-swiatek-emma-raducanu-ons-jabeur-melbourne-2665469-2025-01-16",
      "headline": "Australian Open: Iga Swiatek continues streak, Emma Raducanu beats AnisimovaIga Swiatek thrashed Rebecca Sramkova to continue her unique grand slam streak, while Emma Raducanu secured a hard-fought win over Amanda Anisimova to make it to the 3rd round of the Australian Open for the first time. Both women will now face each other in the next round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-reviews-virat-kohlis-border-gavaskar-trophy-delivers-verdict-2665495-2025-01-16",
      "headline": "Brett Lee reviews Virat Kohli's tour of Australia, delivers verdict on battingFormer Australia fast bowler Brett Lee has reviewed Virat Kohli's woeful tour of Australia. Speaking on his batting, Lee said that it was very un-Kohli-like for the batter to edge the ball eight times in his nine innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-dinesh-karthik-pulls-off-one-handed-stunner-for-paarl-royals-vs-mi-cape-town-video-2665489-2025-01-16",
      "headline": "Watch: Dinesh Karthik pulls off one-handed stunner for Paarl Royals in SA20Dinesh Karthik showed why he is still one of the best in the business as the Indian wicketkeeper pulled off a stunning one-handed catch during Paarl Royals' clash against MI Cape Town on Wednesday, January 16. Karthik's catch helped dismiss Azmatullah Omarzai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-betis-copa-del-rey-result-lamine-yamal-2665482-2025-01-16",
      "headline": "Barcelona thrash Real Betis 5-1 to reach Copa Del Ray quarter-finalsFC Barcelona continued their rediscovered form to storm into the quarter-finals of the Copa Del Rey. Youngster Lamine Yamal starred as Barcelona beat Real Betis 5-1 on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-results-iga-swiatek-emma-raducanu-ons-jabeur-melbourne-2665469-2025-01-16",
      "headline": "Australian Open: Iga Swiatek continues streak, Emma Raducanu beats AnisimovaIga Swiatek thrashed Rebecca Sramkova to continue her unique grand slam streak, while Emma Raducanu secured a hard-fought win over Amanda Anisimova to make it to the 3rd round of the Australian Open for the first time. Both women will now face each other in the next round. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-fan-crashes-his-car-while-trying-to-click-a-selfie-with-sam-konstas-2665437-2025-01-16",
      "headline": "Watch: Fan crashes his car while trying to click a selfie with Sam KonstasA fan crashed his car while trying to click a selfie with rising young Australian cricketer Sam Konstas, who recently made his debut during the Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-results-arsenal-vs-tottenham-leandro-trossard-winner-north-london-derby-2665461-2025-01-16",
      "headline": "Trossard the hero as Arsenal win North London derby, Newcastle thrash WolvesLeandro Trossard was the match winner for Arsenal as they got back to winning ways by defeating Tottenham Hotspur 2-1 at the Emirates on Wednesday, January 15. Newcastle United continued their brilliant form, while Crystal Palace and Aston Villa also secured wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-live-sinner-swiatek-medvedev-fritz-rybakina-2665433-2025-01-15",
      "headline": "Day 5 Live Updates: Sinner bounces back, Rune outlasts BerrettiniAustralian Open 2025 Day 5 Live Updates: Jannik Sinner has bounced back after losing the opening set to Australian wildcard Tristan Schoolkate. It's 1-1 after two sets at the Rod Laver Arena. Meanwhile, Holger Rune outlasted Matteo Berrittini in a five-setter. 18-year-old Joao Forseca's dream run ended as the Brazilian teen lost to Lorenzo Sonego. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kho-kho-world-cup-india-men-women-teams-book-quarterfinal-spot-2665429-2025-01-15",
      "headline": "India men and women teams book quarterfinal spots with commanding winsThe Indian men's and women's teams secured quarterfinal berths in the Kho Kho World Cup in New Delhi on Wednesday. While the men's team secured a 70-38 victory over Peru, the women's team registered a 100-16 win against Iran. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Courtto recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination afterdiscrepancies in the declared results."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}