{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/data-can-be-misleading-zerodha-founder-and-ceo-nithin-kamath-on-rise-of-tier-2-and-3-city-investors-2729307-2025-05-23",
      "headline": "'Data can be misleading': Nithin Kamath on rise of Tier 2 and 3 city investorsZerodha's Nithin Kamath explained that if you look at the addresses provided by users during their KYC process, it appears many traders are from Tier 2 and Tier 3 towns. However, this can be misleading because most people don't update their address when they move to a new city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-rises-rising-today-today-check-brokerage-views-should-you-buy-sell-hold-2729293-2025-05-23",
      "headline": "ITC share price rises 3% today. Check brokerage views and what should investors do?The stock was trading 2.78% higher at Rs 437.95, recovering from Thursday's close of Rs 426.10, as investors appeared to focus on the company's long-term fundamentals rather than short-term headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/some-individuals-do-not-need-to-file-an-itr-are-you-one-of-them-2729270-2025-05-23",
      "headline": "Some individuals don't need to file an ITR. Are you one of them?As the 2025–26 financial year begins, the Income Tax Department has released all the seven ITR forms along with the ITR-U form.  But did you know not everyone is required to file a return?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-loan-bailout-package-pakistan-usd-1-billion-why-reason-india-objection-terror-11-conditions-2729243-2025-05-23",
      "headline": "Explained: Why IMF gave Pakistan $1 billion despite India's objectionsThe IMF agreed to support Pakistan with a total of $7 billion under the EFF programme. So far, it has given $2.1 billion in two separate instalments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-appear-65-percent-lower-trading-apps-has-multibagger-stock-crashed-2729212-2025-05-23",
      "headline": "Have BSE shares really crashed? Here's why some apps show a 66% fallThe apparent crash was just a technical adjustment following the company's 2:1 bonus issue, which turned the stock ex-bonus today. Some trading platforms may not have accounted for this corporate action in their price charts, leading to misleading visuals of a steep 65% drop. In reality, the share price simply adjusted to reflect the bonus allotment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-key-reasons-behind-sensex-nifty-rebound-explained-2729199-2025-05-23",
      "headline": "Sensex jumps 900 points: Why stock market is rising today and what next?Market watchers suggest the current bounce is likely driven by a 'buy-on-dips' strategy that many investors have adopted amid recent volatility. Despite concerns about the global macro environment, the strength in domestic fundamentals seems to be offering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-share-price-rise-13-percent-revenue-rise-decline-in-q4-net-profit-reason-why-2729197-2025-05-23",
      "headline": "Honasa shares rise 13% despite decline in Q4 net profitThe company's revenue from operations went up by 13% year-on-year (YoY), reaching Rs 534 crore in Q4FY25. However, despite the rise in revenue, Honasa's consolidated net profit fell by 18% YoY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-flat-nifty-below-24700-sun-pharma-falls-5-2729185-2025-05-23",
      "headline": "Sensex, Nifty move up in early session despite concerns over FII flowsThe S&P BSE Sensex went up by 289.27 points to 81,241.26, while the NSE Nifty50 added 119.15 points to 24,728.85 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-allotment-how-to-check-status-listing-date-expectation-gmp-online-guide-2729182-2025-05-23",
      "headline": "Borana Weaves IPO allotment: Step-by-step guide to check statusBorana Weaves IPO opened for subscription on May 20 and closed on May 22. The IPO saw strong demand from all investor groups. It was subscribed 147.85 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-change-tax-slab-revamp-talks-begin-government-officials-report-2729163-2025-05-23",
      "headline": "GST rates may change soon as fresh revamp talks begin: ReportGST, which was launched in July 2017, brought together many indirect taxes into one system and created a single national market. The latest round of talks follows the government's introduction of a bill in February this year to simplify income tax laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-may-23-trading-setup-sensex-nifty-nse-bse-2729159-2025-05-23",
      "headline": "Sensex, Nifty opening: Stock market likely to open higher today. Here's whyStock market opening: The Nifty50 index may open slightly above its previous close. Gift Nifty futures were trading at 24,692.5 at 7:59 am, showing a possible rise from Thursday's close of 24,609.7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-23-trading-tips-nse-bse-itc-ola-honasa-sun-pharma-jsw-steel-2729154-2025-05-23",
      "headline": "Stocks to watch on May 23: ITC, Ola, Honasa, Sun Pharma, JSW SteelA number of companies will release their January-March quarter results today. These include JSW Steel, Ashok Leyland, Glenmark Pharmaceuticals, Afcons Infrastructure, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-645-points-lower-nifty-below-24700-indusind-bank-gains-2-percent-it-auto-stocks-2728770-2025-05-22",
      "headline": "Sensex closes 645 points lower, Nifty below 24,700; IndusInd Bank gains 2%The S&P BSE Sensex lost 644.64 points to end at 80,951.99, while the NSE Nifty50 was down by 203.75 points to close at 24,609.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-day-3-subscription-bidding-over-100-times-check-latest-gmp-listing-date-2728751-2025-05-22",
      "headline": "Borana Weaves IPO booked over 100 times: Check latest subscription, GMPAllotment for the Borana Weaves IPO is expected to be finalised on Friday, May 23, 2025. The company is likely to list its shares on the stock exchanges on Tuesday, May 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-to-start-solar-module-factory-this-year-report-2728719-2025-05-22",
      "headline": "Reliance to start solar module factory this year: ReportThis year, Reliance Industries will launch its solar module factory, aiming to meet India's clean energy goals by producing 20 GW annually. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/most-happiest-and-unhappiest-careers-of-the-world-revealed-is-your-job-among-them-2728702-2025-05-22",
      "headline": "World's happiest and unhappiest careers revealed. Is your job among them?Researchers at the University of Tartu in Estonia looked at 263 different jobs and asked over 59,000 people about their work and life satisfaction. They also used health data from the Estonian Biobank to get a better picture of what really makes people happy in their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-down-rising-covid-cases-pause-dalal-street-bull-run-sensex-nifty-outlook-investor-expert-insight-2728677-2025-05-22",
      "headline": "Covid cases surge in India: Will it trigger a stock market crash?Stock market today: The S&P BSE Sensex had dropped by over 900 points to 80,681.76, while the NSE Nifty50 was down 266 points at 24,547.45 as of 12:45 pm. The fall in the market comes after days of strong performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-to-cut-1500-jobs-in-restructuring-move-report-employee-layoff-2728662-2025-05-22",
      "headline": "Walmart to cut 1,500 jobs in restructuring move: ReportThe job cuts will affect several areas, including Walmart's global tech team, the e-commerce section in US stores, and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-adds-1458-lakh-members-in-march-women-and-youth-lead-the-way-2728646-2025-05-22",
      "headline": "EPFO adds 14.58 lakh members in March. Women and youth lead the wayMost of the new members who joined EPFO for the first time in March were youngsters. Around 4.45 lakh people in the 18–25 age group signed up in March, making up nearly 59% of all new subscribers. Many in this age group are first-time jobseekers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-teleservices-shares-jumps-11-percent-today-whats-driving-the-rally-2728642-2025-05-22",
      "headline": "Tata Teleservices shares jumps 11% today. What's driving the rally?The trigger behind the rally appears to be growing speculation around a potential capital infusion by Tata Sons Ltd into its struggling telecom subsidiary, Tata Teleservices Ltd (TTSL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/abfrl-demerger-brokerages-assign-fair-value-to-new-fashion-twins-details-here-2728621-2025-05-22",
      "headline": "ABFRL demerger: Brokerages assign fair value to new fashion twins. Details hereBrokerages have begun breaking down the newly split entities, laying out distinct growth paths and fair value estimates for both ABFRL and ABLBL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/all-itr-forms-are-out-but-you-still-cannot-file-what-causing-the-delay-e-filing-utilities-portal-2728606-2025-05-22",
      "headline": "All ITR forms are out, but you still can't file. What's causing the delay?While all seven ITR forms (ITR-1 to ITR-7) and even the updated ITR-U form are ready, the filing process can't begin until the government activates the utility software. These utilities are essential tools that help taxpayers fill in, check, and submit their returns online or offline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aditya-birla-fashion-and-retail-ltd-abfrl-business-demerger-stock-drop-66-percent-2728594-2025-05-22",
      "headline": "ABFRL stock drops 66% post demerger. What investors should know The sharp decline from Wednesday's close of Rs 268.95 reflects the market's adjustment for the value of the demerged entity, not a deterioration in Aditya Birla Fashion and Retail Ltd's fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vaibhav-taneja-salary-tesla-cfo-more-pay-than-sunder-pichai-google-satya-nadella-microsoft-2728585-2025-05-22",
      "headline": "Who is Vaibhav Taneja? Tesla CFO who made more than Pichai and NadellaWhile Sundar Pichai took home $10.73 million and Satya Nadella received $79.1 million in 2024, Taneja's total earnings far exceeded both. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/itc-q4-results-today-check-dividend-revenue-profit-expectations-2728571-2025-05-22",
      "headline": "ITC set to report Q4 results today: Earnings, dividend payout in focusSo far this financial year, the diversified FMCG and cigarette giant has already handed out an interim dividend of Rs 6.50 per share. Given its track record, investors are now eyeing another generous payout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-fresh-record-high-us-dollar-stability-risks-other-key-reasons-explained-2728564-2025-05-22",
      "headline": "Explained: Why bitcoin has hit a fresh all-time high The world's most valuable cryptocurrency has gained over 50% since April, propelled by improving global risk appetite and a flight to alternatives as doubts over the US dollar's stability grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/government-notice-to-uber-over-advance-tipping-union-minister-calls-it-unethical-2728524-2025-05-22",
      "headline": "Government notice to Uber over advance tipping, Union Minister calls it 'unethical'The Consumer Protection Body has issued a notice to Uber regarding its practice of collecting advanced tips from users. Union Minister Prahlad Joshi has termed the practice 'deeply concerning', 'unethical and exploitative'. Uber has been given 15 days to respond to the notice. The government is widening its crackdown on practices violating consumer protection norms, with Rapido potentially facing a probe as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-300-acre-plant-devanahalli-building-dorms-women-workers-iphone-production-india-report-2728554-2025-05-22",
      "headline": "Foxconn building dorms at 300-acre iPhone campus in India: ReportThe dorms are part of the company's plan to support numerous workers at its plant, which is expected to play a major role in Apple's growing operations in India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-brings-vintage-drama-to-cannes-film-festival-debut-in-peach-outfit-2729678-2025-05-23",
      "headline": "Alia Bhatt brings vintage drama to Cannes debut in peach outfitAlia Bhatt made a stunning red carpet debut in a gorgeous ensemble at the Cannes Film Festival. Pictures of the actor from the red carpet have gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-dipika-kakar-back-home-from-hospital-shoaib-asks-fans-to-keep-her-in-prayers-2729616-2025-05-23",
      "headline": "Actor Dipika Kakar back home from hospital, Shoaib asks fans to keep her in prayersActor Dipika Kakar's husband Shoaib Ibrahim shared her health update with her fans after the delay in tumour resection surgery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-trains-in-low-oxygen-conditioning-for-war-drama-on-galwan-valley-clash-2729589-2025-05-23",
      "headline": "Salman Khan trains in low-oxygen condition for war-drama on Galwan valley clashActor Salman Khan, known for his rigorous fitness regime, is busy training in low-oxygen conditioning for his upcoming war drama. The film is based on the 2020 Galwan valley clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayan-mukerji-shares-war-2-bts-pics-hrithik-roshan-jr-ntr-and-kiara-advani-bring-drama-depth-star-power-2729592-2025-05-23",
      "headline": "Ayan Mukerji shares War 2 BTS pics: Hrithik, Jr NTR bring drama, depth, star powerDirector Ayan Mukerji shared behind-the-scenes photos and a heartfelt note ahead of 'War 2' release, highlighting the film's emotional depth and star-studded cast. The action-thriller, part of the YRF Spy Universe, is set to hit theatres on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-is-all-praise-for-tourist-family-meets-director-abishan-jeevinth-2729593-2025-05-23",
      "headline": "Suriya is all praise for Tourist Family, meets director Abishan JeevinthAfter Dhanush and Rajinikanth, Suriya is all praise for the Tamil film 'Tourist Family'. Debutant director Abishan Jeevinth shared pictures with the actor and expressed admiration for him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-janhvis-param-sundari-teaser-leaked-online-creates-buzz-ahead-of-release-2729560-2025-05-23",
      "headline": "Sidharth-Janhvi's Param Sundari teaser leaked online, creates buzz ahead of releaseThe teaser for 'Param Sundari', starring Sidharth Malhotra and Janhvi Kapoor, was leaked online after being shown in theatres with 'Bhool Chuk Maaf'. Fans are loving the chemistry, visuals, and Sonu Nigam's vocals. The film is slated to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-supports-aamir-khan-amid-sitaare-zameen-par-row-2729534-2025-05-23",
      "headline": "Don't judge the past: Suniel Shetty has Aamir Khan's back amid Sitaare Zameen Par rowActor Suniel Shetty recently reacted to boycott calls for Aamir Khan's 'Sitaaare Zameen Par.' The actor said that people should not judge the past.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/kesari-veer-review-weak-plot-poor-cgi-suniel-shetty-sooraj-pancholi-chhaava-knockoff-2729545-2025-05-23",
      "headline": "Kesari Veer review: Suniel Shetty is the only spark in this Chhaava knockoffReleased-Fri May 23, 2025Kesari Veer movie review: Kesari Veer, despite its grand scale and star cast, fails to deliver a compelling historical drama. The film's poor execution and weak CGI undermine its potential impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/feminism-in-k-dramas-a-growing-voice-or-still-a-whisper-2728815-2025-05-23",
      "headline": "Feminism in K-dramas: A growing voice or still a whisper?K-dramas have evolved from portraying passive, love-struck heroines to celebrating strong, independent women who define themselves beyond romance. The leading ladies in the Korean dramas reflect a more empowered and complex vision of feminism today, moving far beyond the stereotypes of the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-devil-wears-prada-sequel-eyes-may-2026-release-report-2729556-2025-05-23",
      "headline": "The Devil Wears Prada sequel eyes May 2026 release: ReportThe sequel to Meryl Streep and Anne Hathaway's 'The Devil Wears Prada' will be released in May 2026. The cast is yet to be confirmed. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-slams-bollywood-as-son-ahan-shetty-faced-fallout-after-choosing-border-2-2729520-2025-05-23",
      "headline": "Suniel Shetty claims son Ahan was targeted for saying yes to Border 2Actor Suniel Shetty revealed his son Ahan Shetty faced industry backlash and lost roles for choosing 'Border 2'. He warned to expose those behind the alleged sabotage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-new-look-for-tu-meri-main-tera-main-tera-tu-meri-stuns-fans-2729530-2025-05-23",
      "headline": "Kartik Aaryan's new look for Tu Meri Main… stuns fans: Happy to see your faceKartik Aaryan has debuted his new look for his upcoming rom-com 'Tu Meri Main Tera, Main Tera Tu Meri' with Karan Johar's Dharma Productions. The film will hit theatres in February 2026. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumbai-police-regulate-salman-khan-galaxy-apartment-visitor-entry-trespassing-2729524-2025-05-23",
      "headline": "After 2 trespassers caught, cops to regulate visitor entry at Salman Khan's houseMumbai Police plan to regulate entry at Salman Khan's Galaxy Apartments due to repeated trespassing and threats from the Lawrence Bishnoi gang. Enhanced security measures are being considered to safeguard the actor.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sooraj-chamkega-salman-khan-cheers-to-sooraj-pancholi-big-screen-comeback-2729386-2025-05-23",
      "headline": "Sooraj chamkega: Salman Khan cheers on Sooraj Pancholi's big screen comebackActor Sooraj Pancholi is set to make his comeback with Kesari Veer, in which he plays a brave Rajput warrior. Salman Khan showed his support with a heartfelt Instagram post, cheering Sooraj's return to the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/taarak-mehta-ka-ooltah-chashmah-deepti-sadhwani-cannes-comeback-sitara-2729453-2025-05-23",
      "headline": "Deepti Sadhwani makes stylish Cannes comeback with film Sitara'Taarak Mehta Ka Ooltah Chashmah' fame Deepti Sadhwani attended the Cannes Film Festival in a black outfit. This is the second time that the actor has returned to the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/narivetta-tovino-thomas-powerful-film-systemic-oppression-muthanga-incident-2729438-2025-05-23",
      "headline": "Narivetta review: Tovino Thomas headlines powerful film on systemic oppressionReleased-Fri May 23, 2025Narivetta movie review: Director Anuraj Manohar's 'Narivetta' is based on the 2003 Muthanga incident that led to the loss of lives after a clash between police officers and the Adivasi community. The film's gripping narrative post-interval makes up for its sluggish first half. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-did-not-shoot-a-single-scene-before-exiting-hera-pheri-3-report-2729444-2025-05-23",
      "headline": "Paresh Rawal didn't shoot a single scene before exiting Hera Pheri 3: ReportA new development in the Paresh Rawal vs Hera Pheri 3 case suggested that the actor had not shot a single scene for the film, as opposed to the claims made by Akshay Kumar's team in their legal suit against the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-veer-x-twitter-reviews-fans-say-sooraj-pancholi-suniel-shetyy-film-is-history-not-mythology-2729420-2025-05-23",
      "headline": "Kesari Veer X Reviews: Fans say Sooraj Pancholi's film is 'history,' not 'mythology'The audiences seem to have given a thumbs-up to Sooraj Pancholi-Suniel Shetty's 'Kesari Veer: Legends of Somnath.' Fans hailed the film for depicting a 'forgotten chapter of India's history.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/lilo-and-stitch-review-a-worthy-live-action-remake-with-delightful-performances-2729407-2025-05-23",
      "headline": "Lilo & Stitch review: A worthy live-action remake with delightful performancesReleased-Fri May 23, 2025Lilo and Stitch movie review: The live-action remake beautifully captures the essence of the beloved 2002 animated classic with heartfelt performances and emotional depth. This charming film celebrates the spirit of family and friendship against the stunning backdrop of Hawaii, making it a delightful watch for all ages, says our review."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-has-every-right-to-defend-itself-against-terrorism-says-germany-s-jaishankar-welcomes-remarks-2729583-2025-05-23",
      "headline": "Germany backs India's war on terrorism, says country has right to defend itselfGermany condemned the Pahalgam terror attack in India and backed India's right to self-defence. Union Minister Jaishankar reaffirmed zero tolerance for terrorism.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/knife-attack-at-germany-hamburg-train-station-injuries-casualties-glbs-2729712-2025-05-23",
      "headline": "12 injured in knife attack at Germany train station, suspect arrestedSeveral people were injured in a knife attack at Germany's Hamburg train station. Police arrested the suspect, and the motive for the attack remains unclear. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/to-preach-after-killing-civilians-targeting-places-of-worship-grossly-hypocritical-india-slams-pak-at-unsc-2729698-2025-05-23",
      "headline": "To preach after killing civilians grossly hypocritical: India slams Pak at UNSCIndia slammed Pakistan at the UN Security Council, accusing it of hypocrisy for commenting on civilian protection despite cross-border terror links. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-judge-blocks-trump-administration-from-revoking-harvard-enrollment-of-foreign-students-2729634-2025-05-23",
      "headline": "Judge blocks Trump admin from revoking Harvard enrollment of foreign studentsIn a complaint filed in Boston federal court earlier on Friday, Harvard called the revocation a \"blatant violation\" of the US Constitution and other federal laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-brings-vintage-drama-to-cannes-film-festival-debut-in-peach-outfit-2729678-2025-05-23",
      "headline": "Alia Bhatt brings vintage drama to Cannes debut in peach outfitAlia Bhatt made a stunning red carpet debut in a gorgeous ensemble at the Cannes Film Festival. Pictures of the actor from the red carpet have gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-janusza-kusocinskiego-memorial-poland-javelin-julian-weber-2729697-2025-05-23",
      "headline": "Neeraj Chopra 2nd behind Julian Weber in Poland javelin event, extends 4-year streakJanusza Kusocinskiego Memorial 2025: Neeraj Chopra finished second in the men's javelin event in Poland with a best effort of 84.14m. Julian Weber, who won the Doha Diamond League earlier in May, finished first on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/turbulence-hit-indigo-flight-was-assisted-till-landing-after-pak-denied-diversion-request-indian-air-force-2729546-2025-05-23",
      "headline": "Turbulence-hit flight was guided till landing after Pak denied airspace: Air ForceAfter Pakistan denied airspace clearance to an IndiGo flight facing severe turbulence, Indian Air Force units coordinated a safe route and guided the aircraft to a successful landing in Srinagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-no-qurbani-eid-slaughter-order-kolkata-consulate-gets-envoy-shabab-bin-ahmed-punished-2729536-2025-05-23",
      "headline": "No-qurbani order at Kolkata consulate gets envoy punished by Yunus govtThe interim government of Bangladesh, led by Muhammad Yunus, has cancelled diplomat Shabab bin Ahmed's posting to the consulate at Kolkata after he banned animal sacrifices on Eid sacrifices. Ahmed argued that diplomats \"need to respect the customs of the host country\". His ban triggered a controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/is-yunus-flexing-street-power-to-counter-bangladesh-army-chief-ultimatum-2729607-2025-05-23",
      "headline": "Is Yunus flexing street power to counter Bangladesh army chief's ultimatum?On Thursday, Nahid Islam, Yunus's close lieutenant who leads the nascent National Citizens Party, told reporters that Yunus had expressed his desire to resign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-us-delegation-operation-sindoor-congress-india-pakistan-conflict-2729673-2025-05-23",
      "headline": "We will speak with one voice: Team Shashi Tharoor to leave for US tonightRefuting US President Donald Trump's claim of brokering a ceasefire between India and Pakistan, Shashi Tharoor reiterated the government's stand and said that there was no formal mediation by any other country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/how-many-indian-students-in-harvard-hit-by-trump-admin-decision-sevp-revoked-kristi-noem-immigration-2729509-2025-05-23",
      "headline": "How Indians who gained Harvard entry, won't get Harvard degree | 5 big pointsThe Trump administration revoked Harvard's certification to enrol international students, impacting around 788 Indian students. Here are five key points that explain the impact on international students after the university was stripped of its ability to enrol foreign students."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunwar-vijay-shah-apologises-remarks-on-colonel-sofiya-qureshi-says-was-a-linguistic-error-2729629-2025-05-23",
      "headline": "Linguistic error: Madhya Pradesh Minister on remarks against Col Sofiya QureshiThe Madhya Pradesh Minister had said that the Prime Minister had sent a \"sister from the same community\" as those in Pakistan to avenge the April 22 terror attack in Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/kannada-controversy-sonu-nigam-sbi-branch-manager-language-row-opinion-2729553-2025-05-23",
      "headline": "In defence of Sonu Nigam, SBI official and all 'anti-Kannada' peopleSonu Nigam compared being heckled to sing in Kannada to the Pahalgam terror attack. Then an SBI official declared she will \"never speak Kannada\". The two separate controversies about the language have something crucial missing: the full context which reveals a story about intent and circumstance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-senator-water-bomb-rattled-indus-waters-treaty-suspension-india-senator-syed-ali-zafar-2729625-2025-05-23",
      "headline": "It's water bomb, says Pakistan senator rattled by Indus treaty suspensionThe suspension of the Indus Waters Treaty (IWT) by India after the Pahalgam terror attack has rattled Pakistan. Pakistani Senator Syed Ali Zafar referred to the situation created by the suspension of the IWT as a \"water bomb\" on Pakistan, and said that it could lead to severe hunger and deaths. India knew Pakistan would play the victim card and has sent out teams to several countries to explain its stand on anti-terrorism and the IWT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-abhay-oka-farewell-message-supreme-court-chief-justice-centric-image-2729576-2025-05-23",
      "headline": "Must shed top court's 'Chief Justice-centric' image: Abhay Oka's farewell messageIn his farewell message, Justice Abhay Oka urged decentralisation of Supreme Court powers, greater use of technology for case listing, and stronger focus on trial courts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-paklistan-war-1965-field-marshall-km-cariappa-snubbed-pak-dictator-ayub-khan-field-marshal-offer-2729382-2025-05-23",
      "headline": "Not my son, he's prisoner of war: When Gen Cariappa snubbed Pak dictator's offerDuring the 1965 India-Pakistan War, Flight Lieutenant KC Cariappa's plane was shot down, and he was held captive by the Pakistani army. His father, General KM Cariappa (later a Field Marshal), turned down an offer from Pakistan's military dictator Field Marshal Ayub Khan, who served under him earlier, to release his son. This story from 70 years ago also highlights the contrast between the two Field Marshals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-delay-election-aides-push-back-army-chief-waker-uz-zaman-warning-2729579-2025-05-23",
      "headline": "Election not only priority, Yunus aides push back amid Army chief's warningDespite Bangladesh army chief Waker-Uz-Zaman's firm call for elections by December, aides of Muhammad Yunus reaffirmed that the interim government's job is beyond just holding polls, adding it would be conducted by June 2026. This stand comes despite pressure from army chief Zaman and opposition parties, the BNP and the Jamaat, demanding polls by December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-captaincy-shubman-gill-bumrah-pant-england-series-expert-opinion-2729590-2025-05-23",
      "headline": "Shubman Gill or Jasprit Bumrah: Pundits pick India's next Test captainIndia's cricket selectors will set the ball rolling on the team's long transition in the longest format when they name a new Test captain and finalise the squad for the five-match series in England on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-pahalgam-attack-ceasefire-indus-water-treaty-water-flow-dam-flushing-satellite-photo-2729373-2025-05-23",
      "headline": "One month since Indus Waters Treaty suspension: What satellite images revealSince India suspended the Indus Waters Treaty after the April 22 Pahalgam terror attack, satellite and flow data show India has intensified dam flushing operations, causing fluctuating water flows into Pakistan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/uttarakhand-snake-man-surprisingly-calm-reaction-king-cobra-slithers-over-him-bed-video-viral-2729471-2025-05-23",
      "headline": "Man remains surprisingly calm as king cobra slithers over him in viral videoIn the video, the king cobra is seen slowly gliding over the man's legs, but what's unbelievable is that he neither panics nor makes an attempt to escape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-court-say-that-women-should-be-held-equally-responsible-in-an-extra-marital-affair-2729483-2025-05-23",
      "headline": "Court cites privacy rights, rejects Major's plea for CCTV clip to prove wife's affairThe court said that the dated idea of a man stealing away the wife of another man, without ascribing any role or responsibility to the woman, is to be rejected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-extends-airspace-ban-to-pak-flights-military-aircraft-till-june-23-2729572-2025-05-23",
      "headline": "India extends airspace ban to Pak flights, military aircraft till June 23The Indian NOTAM (Notice to Airmen/Air Missions) was issued following the instructions issued by the Civil Aviation Ministry on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/national-herald-case-congress-leaders-donated-lakhs-to-rahul-gandhi-sonia-gandhi-young-indian-ed-enforcement-2729332-2025-05-23",
      "headline": "Rs 80 lakh donated to Rahul, Sonia Gandhi-led firm on Revanth Reddy's request: EDThe ED has alleged in its chargesheet that senior Congress leaders, acting on instructions from top party leaders, donated crores to the company involved in the National Herald case."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-jitesh-sharma-reaction-playoffs-hopes-2729721-2025-05-24",
      "headline": "RCB's defeat to SRH before playoffs a wake-up call: Jitesh SharmaIPL 2025: Royal Challengers Bengaluru suffered a major setback after losing to SunRisers Hyderabad by 42 runs in Lucknow. The defeat drops RCB to third place, complicating their hopes for a top-two finish in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-zimbabwe-only-test-day-2-report-2729718-2025-05-24",
      "headline": "England set for big win after forcing Zimbabwe to follow onEngland are nearing another heavy win in the one-off Test at Trent Bridge after enforcing the follow-on against Zimbabwe to take a commanding lead of 270 runs by stumps on Day 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-injury-rcb-ipl-2025-playoffs-setback-2729715-2025-05-24",
      "headline": "Injury scare for RCB as Tim David pulls hamstring ahead of playoffsRoyal Challengers Bengaluru (RCB) faced a significant blow ahead of the IPL 2025 playoffs, with in-form all-rounder Tim David sustaining a hamstring injury during their final league clash against Sunrisers Hyderabad (SRH) on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rcb-vs-srh-match-report-top-2-points-table-2729709-2025-05-23",
      "headline": "Ishan Kishan dents RCB's top 2 chances as SRH play spoilsportRCB's hopes of top 2 finish were dented after the lost to SRH by 42 runs at the Ekana Stadium on Friday. Ishan Kishan and Eshan Malinga combined to help SRH put in a terrific performance. The loss meant that RCB took a massive hit to their NRR and slipped down to the third spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-janusza-kusocinskiego-memorial-poland-javelin-julian-weber-2729697-2025-05-23",
      "headline": "Neeraj Chopra 2nd behind Julian Weber in Poland javelin event, extends 4-year streakJanusza Kusocinskiego Memorial 2025: Neeraj Chopra finished second in the men's javelin event in Poland with a best effort of 84.14m. Julian Weber, who won the Doha Diamond League earlier in May, finished first on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazilian-ronaldo-sells-majority-stake-in-real-valladolid-after-six-year-spell-2729693-2025-05-23",
      "headline": "Brazilian Ronaldo sells majority stake in Real Valladolid after six-year spellBrazilian legend Ronaldo has sold his majority stake in Real Valladolid. The sale ends a troubled period marked by multiple relegations and fan unrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pbks-vs-dc-ipl-2025-punjab-kings-assistant-coach-brad-haddin-press-conference-2729681-2025-05-23",
      "headline": "Shreyas Iyer has been great at No.3, PBKS happy with batting order: Brad HaddinPunjab Kings' assistant coach Brad Haddin praised his team's batting performance throughout the tournament and denied any change in skipper Shreyas Iyer's batting order, who played down the order in the previous game against Rajasthan Royals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-ireland-matthew-forde-fastest-fifty-ab-de-villiers-record-2729639-2025-05-23",
      "headline": "23-year-old bowler equals AB de Villiers' all-time ODI record for fastest fiftyIRE vs WI, 2nd ODI: 23-year-old Matthew Forde equalled AB de Villiers's all-time record for the fastest ODI fifty. He hit his fifty in just 16 balls against Ireland in Dublin on Friday, May 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-form-india-a-england-tour-stunning-94-vs-rcb-2729669-2025-05-23",
      "headline": "Ishan Kishan returns to form ahead of England tour with stunning 94 vs RCBIshan Kishan marked a strong return to form with a spectacular 94-run innings against Royal Challengers Bangalore, providing a timely boost ahead of the upcoming England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pbks-vs-dc-ipl-2025-delhi-capitals-assistant-coach-matthews-mott-press-conference-2729641-2025-05-23",
      "headline": "Will Axar Patel be available for DC's last game? Assistant coach gives updateDelhi Capitals (DC) will have to wait for skipper Axar Patel's recovery from illness ahead of their IPL 2025 clash against the Punjab Kings, assistant coach Matthew Mott said. \"He's [Axar] is not training today. He's had a pretty rugged time with a few niggly injuries as well. I'm sure he's motivated to come out and play. But, we'll probably know a little bit more tonight when we go back and see the medical staff,\" Mott said at the pre-match press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-live-score-poland-javelin-event-orlen-memorial-janusza-kusocinskiego-2729643-2025-05-23",
      "headline": "Neeraj Chopra at Poland javelin highlights: Indian star finishes secondOrlen Memorial Janusza Kusocinskiego Highlights: Neeraj Chopra jumped to the second spot in the eight-man field with a fine last throw. He finishes the event in Poland with a best effort of 84.14m. Julian Weber takes the top spot with 86.12m while Anderson Peters finishes third. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pbks-vs-dc-ipl-2025-punjab-kings-assistant-coach-brad-haddin-press-conference-2729681-2025-05-23",
      "headline": "Shreyas Iyer has been great at No.3, PBKS happy with batting order: Brad HaddinPunjab Kings' assistant coach Brad Haddin praised his team's batting performance throughout the tournament and denied any change in skipper Shreyas Iyer's batting order, who played down the order in the previous game against Rajasthan Royals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-ireland-matthew-forde-fastest-fifty-ab-de-villiers-record-2729639-2025-05-23",
      "headline": "23-year-old bowler equals AB de Villiers' all-time ODI record for fastest fiftyIRE vs WI, 2nd ODI: 23-year-old Matthew Forde equalled AB de Villiers's all-time record for the fastest ODI fifty. He hit his fifty in just 16 balls against Ireland in Dublin on Friday, May 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-form-india-a-england-tour-stunning-94-vs-rcb-2729669-2025-05-23",
      "headline": "Ishan Kishan returns to form ahead of England tour with stunning 94 vs RCBIshan Kishan marked a strong return to form with a spectacular 94-run innings against Royal Challengers Bangalore, providing a timely boost ahead of the upcoming England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pbks-vs-dc-ipl-2025-delhi-capitals-assistant-coach-matthews-mott-press-conference-2729641-2025-05-23",
      "headline": "Will Axar Patel be available for DC's last game? Assistant coach gives updateDelhi Capitals (DC) will have to wait for skipper Axar Patel's recovery from illness ahead of their IPL 2025 clash against the Punjab Kings, assistant coach Matthew Mott said. \"He's [Axar] is not training today. He's had a pretty rugged time with a few niggly injuries as well. I'm sure he's motivated to come out and play. But, we'll probably know a little bit more tonight when we go back and see the medical staff,\" Mott said at the pre-match press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-live-score-poland-javelin-event-orlen-memorial-janusza-kusocinskiego-2729643-2025-05-23",
      "headline": "Neeraj Chopra at Poland javelin highlights: Indian star finishes secondOrlen Memorial Janusza Kusocinskiego Highlights: Neeraj Chopra jumped to the second spot in the eight-man field with a fine last throw. He finishes the event in Poland with a best effort of 84.14m. Julian Weber takes the top spot with 86.12m while Anderson Peters finishes third. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}