{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-easier-claim-rules-to-jan-dhan-scheme-rbi-3-key-reforms-for-common-man-2767056-2025-08-06",
      "headline": "From easier claim rules to Jan-dhan scheme: RBI's 3 key reforms for common manOne of the major announcements is aimed at easing the process for families to claim money or valuables from bank accounts, lockers, or safe custody after the account holder passes away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forgot-to-e-verify-your-itr-here-is-what-to-do-to-avoid-penalties-what-to-do-if-forgot-to-e-verify-itr-2767009-2025-08-06",
      "headline": "Forgot to e-verify your ITR? Here's what to do to avoid penaltiesEven though the new ITR deadline is now September 15, 2025 for several taxpayers, the 30-day e-verification window begins the moment you file your return and not from the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-stock-market-debut-hold-or-book-profit-2766980-2025-08-06",
      "headline": "Should you hold or sell NSDL shares after stock market listing? Details hereWhile NSDL may not offer sharp near-term upside post listing, many analysts see it as a core holding in India's market infrastructure play, particularly as digital finance expands and retail participation deepens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-debut-with-10-percent-premium-over-ipo-issue-price-2766972-2025-08-06",
      "headline": "NSDL shares debut with 10% premium over IPO issue priceNSDL's Rs 4,012 crore initial public offering was entirely an offer for sale (OFS) involving 5.01 crore equity shares. The issue saw robust demand from all investor segments, with an overall subscription of 41.02 times. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-lending-rate-steady-at-55-amid-global-trade-uncertainty-2766969-2025-08-06",
      "headline": "RBI keeps key lending rate steady at 5.5% amid global trade uncertaintyThe RBI MPC sighted the global tensions and trade uncertainty in keeping key lending rates unchanged. The MPC also decided to continue with a neutral stance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-off-to-shaky-start-amid-trump-tariff-threat-rbi-rate-decision-2766965-2025-08-06",
      "headline": "Sensex, Nifty off to shaky start amid Trump tariff threat, RBI rate decisionThe S&P BSE Sensex was down 65.70 points to 80.644.34 at 9:40 am, while the NSE Nifty50 fell 28.40 points to trade at 24,620."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-today-august-6-home-loan-emi-cheaper-rate-cut-us-tariff-affordable-housing-real-estate-2766959-2025-08-06",
      "headline": "RBI MPC announcement today: Will your home loan get cheaper?With interest rates already lowered three times in 2025, homebuyers and borrowers across the country are waiting to see if there is any further relief coming their way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-august-2025-what-to-expect-from-the-august-6-mpc-meet-2766749-2025-08-06",
      "headline": "RBI MPC rate decision on August 6: Time, expectations, and key updatesRBI Governor Sanjay Malhotra will present the monetary policy statement today. Check time, expectations, and key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/anil-ambani-likely-to-be-summoned-again-by-ed-for-questioning-sources-2766726-2025-08-05",
      "headline": "Anil Ambani likely to be summoned again by ED for questioning: SourcesAnil Ambani faced questioning by the Enforcement Directorate in connection with an alleged Rs 17,000 crore loan fraud case. The questioning lasted for several hours, with sources indicating that he is likely to be summoned again within seven to ten days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-seeks-10-from-ed-days-to-provide-documents-in-fraud-cases-sources-2766708-2025-08-05",
      "headline": "Anil Ambani seeks 10 days from ED to provide documents in fraud cases: SourcesThe 66-year-old industrialist was summoned to the ED headquarters in New Delhi, where his statement was recorded under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-higher-fd-returns-compare-these-1-year-rates-before-investing-indusind-bank-icici-bank-2766623-2025-08-05",
      "headline": "Want higher FD returns? Compare these 1-year rates before investingAmong the different time periods you can choose, a one-year FD is especially attractive. It gives you decent interest without locking up your money for too long. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-cuts-a-cake-as-he-celebrates-border-2-wrap-diljit-dosanjh-2767075-2025-08-06",
      "headline": "Varun Dhawan cuts a cake as he celebrates Border 2 wrapActor Varun Dhawan cut a cake and celebrated the 'Border 2' wrap. Several pictures and videos from the celebration have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/walking-dead-actor-kelley-mack-dies-cancer-33-2767037-2025-08-06",
      "headline": "Walking Dead actor Kelley Mack dies of rare brain cancer at 33In January, actor Kelley Mack, known for her performance in 'Walking Dead', revealed that she had been diagnosed with diffuse midline glioma, a rare form of astrocytoma cancer. She died at the age of 33 on August 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/parineeta-trailer-vidya-balan-starrer-restored-in-8k-ahead-of-re-release-2766976-2025-08-06",
      "headline": "Parineeta trailer: Vidya Balan-starrer restored in 8K ahead of re-releaseAhead of the re-release of 'Parineeta', a new trailer was unveiled by the makers. Now restored in 8K, the trailer retains the charm of the film released 20 years ago. The film, which marked actor Vidya Balan's acting debut, will be re-released in theatres on August 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-sparks-row-sri-lankan-tamils-bad-light-2767026-2025-08-06",
      "headline": "Protests against Vijay Deverakonda's Kingdom over portrayal of Sri Lankan TamilsVijay Deverakonda's film Kingdom has sparked protests in Tamil Nadu by pro-Tamil groups condemning its portrayal of Sri Lankan Tamils. Distributors seek police protection as screenings face disruptions in Madurai and Trichy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-greets-fans-as-saiyaara-becomes-box-office-hit-2766998-2025-08-06",
      "headline": "Ahaan Panday greets fans as Saiyaara becomes box office hit, video goes viralAhaan Panday was seen happily greeting fans and paparazzi after the massive success of his debut film 'Saiyaara', which crossed Rs 500 crore worldwide. The romantic musical has now become the second-highest-grossing Indian film of the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-8-update-tulsi-begs-angad-to-punish-her-with-broom-2767006-2025-08-06",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Ep 8: Tulsi begs Angad to punish her with broom'Kyunki Saas Bhi Kabhi Bahu Thi' moves on to make a point about patriarchy in Indian households, and how gender roles need to be reversed. Angad, Tulsi's son, walks free amid the ongoing accident case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-introduces-son-jack-blues-in-emotional-music-video-yukon-2766994-2025-08-06",
      "headline": "Justin Bieber introduces son Jack Blues in emotional music video YukonJustin Bieber has released the music video for his new song 'Yukon', featuring touching moments with his 11-month-old son, Jack Blues. The video offers fans a heartfelt glimpse into his family life with wife Hailey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rubina-dilaik-backs-deepika-padukones-demand-for-fixed-work-hours-2766978-2025-08-06",
      "headline": "Rubina Dilaik backs Deepika Padukone's demand for fixed work hours: Not unrealisticActor Rubina Dilaik came out in support of Deepika Padukone's demand for fixed eight-hour workdays, calling it a much-needed change in the industry. She shared her own struggles with long working hours and said she would implement better systems if she ever turns producer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-cryptic-post-on-disrespect-2766961-2025-08-06",
      "headline": "Priyanka Chopra shares cryptic post on disrespect. Can you relate?Priyanka Chopra recently shared a cryptic Instagram Story about cutting off people who disrespect her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-apoorva-mukhija-collaboration-ad-podcast-indias-got-latent-controversy-2766962-2025-08-06",
      "headline": "Samay Raina and Apoorva Mukhija spoof their past in funny new adSamay Raina and Apoorva Mukhija have reunited for a quirky skincare ad with their witty banter and playful jabs. The ad went live on Samay's Instagram handle on Tuesday night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/daavudi-to-hrudayam-lopala-are-songs-becoming-a-burden-to-telugu-cinema-2766736-2025-08-06",
      "headline": "Daavudi to Hrudayam Lopala: Are songs becoming a burden to Telugu cinema?From the removal of the much-loved 'Hrudayam Lopala' in 'Kingdom' to viral tracks like 'Daavudi' in 'Devara Part 1' and 'Pippi Pippi Dum Dum' in 'Kuberaa' being left out of final cuts, this growing trend signals a shift in how music fits into mainstream storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-box-office-collection-day-12-historic-run-no-signs-of-slowing-down-2766946-2025-08-06",
      "headline": "Mahavatar Narsimha box office Day 12: Historic run continues for top animated hitDirector Ashwin Kumar's 'Mahavatar Narsimha' is not showing any signs of slowing down at the box office. The film surpassed the Rs 100 crore-mark (nett) at the box office in India and is still holding strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gulshan-grover-recalls-how-women-avoided-him-due-to-his-on-screen-villain-image-2766933-2025-08-06",
      "headline": "Women feared me off-screen too, says actor Gulshan GroverGulshan Grover, famously known as Bollywood's 'Bad Man', revealed how his villainous roles once created real-life misconceptions, especially among women. He will be seen next in 'Heer Express'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-cardiac-arrest-parkinsons-disease-final-concert-2766928-2025-08-06",
      "headline": "Ozzy Osbourne died of cardiac arrest and Parkinson's, cause of death report filedOzzy Osbourne died due to cardiac complications linked to Parkinson's disease. His daughter, Aimee Osbourne, filed his death certificate in London."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-uttarkashi-cloudburst-praying-for-safety-and-healing-2766916-2025-08-06",
      "headline": "Sara Ali Khan heartbroken over Uttarkashi cloudburst: Praying for safety, healingA cloudburst-triggered flash floods hit Uttarkashi, causing fatalities and destruction in Uttarkhand. Actor Sara Ali Khan was distraught seeing the visual and expressed her condolences on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gaga-bruno-mars-top-2025-mtv-vma-nominations-list-glbs-2766883-2025-08-06",
      "headline": "VMAs 2025: Lady Gaga leads, Ed Sheeran's Sapphire, Rose, Jimin nominatedThe 2025 MTV Video Music Awards have unveiled their full nomination list, highlighting a diverse global lineup. Lady Gaga secured 12 nods, while K-Pop artists and Indian-inspired music also featured prominently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-on-aashiqui-3-direction-and-saiyaara-film-making-experience-2766707-2025-08-05",
      "headline": "Mohit Suri on making Saiyaara over Aashiqui 3: No pressure of sequel, opening dayDirector Mohit Suri reveals why he did not direct Aashiqui 3 and shares insights about making Saiyaara. He highlights the freedom from sequel pressure and praises Anurag Basu for taking over the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-ott-release-no-deal-confirmed-makers-react-to-rumours-2766737-2025-08-05",
      "headline": "Mahavatar Narsimha OTT release: Makers urge fans to stay away from rumoursMahavatar Narsimha is currently playing exclusively in theatres worldwide with no OTT deal finalised. The makers urge audiences to trust only official updates amid OTT release rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aanand-l-rai-dhanush-take-legal-action-over-raanjhanaa-ai-altered-re-release-2766767-2025-08-05",
      "headline": "Aanand L Rai, Dhanush to take legal action over Raanjhanaa's AI-altered endingAanand L Rai recently shared how the team is thinking to adopting the legal route for the AI-altered version of their film 'Raanjhanaa'. Their current concern is the unauthorised modification of the film that has created a buzz around. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-rain-uttarkashi-dharali-flash-flood-cloudburst-deaths-missing-army-ndrf-rescue-cm-dhami-2766918-2025-08-06",
      "headline": "Deadly Uttarakhand flash flood cuts off key roads, bad weather hits rescue ops Live UpdatesRescue operations in Uttarkashi have been severely hampered by continuous rain. The Meteorological Department has issued a red alert for heavy rain today in several districts of the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-responds-to-indias-claim-on-us-import-of-russian-uranium-fertiliser-i-dont-know-anything-glbs-2766895-2025-08-06",
      "headline": "India pointed out US's uranium purchases from Russia. Here's what Trump saidIndia said that the United States continues to import key materials from Russia, including uranium hexafluoride for its nuclear industry, palladium for electric vehicles, as well as fertilisers and chemicals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-40-percent-tariffs-backfire-made-in-china-manufacturing-magnet-southeast-asia-vietnam-thailand-india-2766566-2025-08-06",
      "headline": "Trump is Making China Cheaper AgainTrump's tariff of up to 40% on transshipped goods and levies across Southeast Asia has left China a winner. Manufacturers and exporters are asking why they should move out of China. Ironically, Trump's trade war might be doing the unthinkable — making Chinese factories and products cheaper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/uttarkashi-tragedy-could-a-glacial-lake-outburst-be-behind-the-catastrophe-2767042-2025-08-06",
      "headline": "Could a glacial lake outburst be behind the Uttarkashi tragedy?Early assumptions blamed a cloudburst for the destruction in Uttarkashi, a region frequently battered by intense monsoon events. However, recent meteorological and satellite data tell a different story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mira-murati-said-no-to-mark-zuckerberg-proposal-so-he-launched-15-billion-war-to-hire-her-top-engineer-2767063-2025-08-06",
      "headline": "Mira Murati said no to Zuckerberg, he launched $1.5B war to hire her top engineerNever bet against Mark Zuckerberg, or so goes the saying in Silicon Valley. After spurned by Mira Murati, Zuckerberg has now launched a war with over a billion-dollar chest to try to break and lure engineers away from Mira's Thinking Machines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-kartavya-bhavan-spread-over-15-lakh-sq-metres-it-will-house-key-ministries-2767064-2025-08-06",
      "headline": "PM inaugurates Kartavya Bhavan. Ministries get a swanky new addressPM Modi inaugurates Kartavya Bhavan. Spread over 1.5 lakh sq metres, it will house key ministries"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-flash-floods-uttarkashi-cloudburst-landslide-dharali-village-army-camp-2767002-2025-08-06",
      "headline": "Army Colonel radioes in from Uttarkashi ground zero: Camp hit, rescue ops onA cloudburst over the Kheerganga river triggered massive flash floods and a landslide in Uttarkashi's Dharali village, sweeping away homes, damaging an Army camp, and leaving dozens feared trapped."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-claims-pakistani-mercenaries-in-ukraine-russia-war-as-moscow-islamabad-ties-warm-multi-vector-dipomacy-2766944-2025-08-06",
      "headline": "Pakistani mercenaries fighting in Ukraine war amid closer Russia-Pak ties?Amid the economic distress in Pakistan, mercenaries from the country are fighting for Moscow in the Ukraine-Russia war, says Ukrainian President Volodymyr Zelenskyy. Pakistan has denied the allegations, but the reports fuel doubts about Islamabad's agenda as it develops closer ties with Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-cloudburst-uttarkashi-flash-floods-missing-dead-damage-rescue-2766598-2025-08-05",
      "headline": "Live: One more body recovered in Dharali, death toll touches 5Uttarkashi Cloudburst Live: At least five people died, and several others went missing after a cloudburst triggered flash floods in Uttarkashi's Dharali area on Tuesday. Rescue teams from the police, Army, NDRF, and SDRF were deployed. Chief Minister Pushkar Singh Dhami cut short his Andhra Pradesh visit and returned to Dehradun to review the situation at the State Emergency Operation Centre. He said 130 people stranded in affected areas had been shifted to safer locations, and instructions were issued for immediate food, shelter and medical aid. Additional Army helicopters have been requested to speed up rescue efforts. Schools and educational institutions remain closed in multiple districts. Follow indiatoday.in for all Live Updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-india-2025-series-draw-collapse-ben-stokes-2766940-2025-08-06",
      "headline": "From 4–1 to 2–2: How England let a glorious Test series win slip awayThe Test series between England and India ended in a 2-2 draw, but the hosts could well have won it 4-1. Having squandered golden opportunities for victory at Old Trafford and the Kennington Oval, England now must face the harsh reality of making some big changes with the Ashes on the horizon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/ethanol-blending-petrol-sugarcane-environment-2766586-2025-08-06",
      "headline": "Ethanol-blended petrol: The environmental challenges that can't be ignoredDespite its benefits, ethanol production is not without concerns. Stricter environmental controls and sustainable environmental practices can help in achieving a cleaner and greener economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-chirag-paswan-pack-a-power-punch-in-bihar-polls-2766591-2025-08-05",
      "headline": "Can Chirag Paswan pack a power punch in Bihar polls?In Bihar's liminal political spaces—between the BJP's leadership deficit and the JD(U)'s ebbing influence—Chirag Paswan sees a fault line ripe for exploitation\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-raises-concerns-gaya-airport-code-gay-minister-explains-permanence-2767022-2025-08-06",
      "headline": "BJP MP calls 'GAY' code for Gaya airport offensive, government respondsBJP MP Bhim Singh raised concerns about the Gaya airport's IATA code 'GAY' in Rajya Sabha. The MoS Civil Aviation explained that such codes are permanent and only changed under exceptional safety circumstances."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kalyan-banerjee-vs-mahua-moitra-fight-lacks-gratitude-tmc-leaders-feud-mamata-banerjee-2766960-2025-08-06",
      "headline": "Lacks basic gratitude: Kalyan Banerjee regrets backing Mahua Moitra in pastKalyan Banerjee reignited his feud with Mahua Moitra, accusing her of ingratitude and abuse, a day after resigning as Lok Sabha chief whip of the Trinamool Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/daavudi-to-hrudayam-lopala-are-songs-becoming-a-burden-to-telugu-cinema-2766736-2025-08-06",
      "headline": "Daavudi to Hrudayam Lopala: Are songs becoming a burden to Telugu cinema?From the removal of the much-loved 'Hrudayam Lopala' in 'Kingdom' to viral tracks like 'Daavudi' in 'Devara Part 1' and 'Pippi Pippi Dum Dum' in 'Kuberaa' being left out of final cuts, this growing trend signals a shift in how music fits into mainstream storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vantara-supports-madhuri-elephant-return-kolhapur-rehab-centre-plans-2767054-2025-08-06",
      "headline": "Vantara offers full support for elephant Madhuri's return, comes up with rehab planVantara said it supports efforts to bring Madhuri the elephant back to Kolhapur. The Maharashtra government had said it plans to approach the Supreme Court again after public outcry over the jumbo's relocation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-flash-flood-kinner-kailash-pilgrims-rescue-operation-video-2767045-2025-08-06",
      "headline": "Video: Over 400 Kinner Kailash pilgrims rescued using daring rope techniqueThe Indo-Tibetan Border Police (ITBP) rescued 413 people in a daring operation after a flash flood struck the Kinner Kailash Yatra route in Himachal Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gujarat-man-walks-up-to-lion-feeding-on-prey-for-reel-arrested-viral-video-2767004-2025-08-06",
      "headline": "Gujarat man walks up to lion feeding on prey for video, arrested after it goes viralA man in Gujarat was arrested after dangerously approaching a lion while it was feeding on prey. A video of the incident has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-fafo-parenting-is-blowing-up-right-now-2766561-2025-08-06",
      "headline": "Why FAFO parenting is blowing up right nowStepping away from gentle parenting, many parents are now leaning toward the FAFO approach, a style that lets kids learn through real-world consequences instead of endless reminders and warnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dont-burn-ties-with-india-nikki-haley-on-trumps-tariff-threat-over-russian-oil-2766832-2025-08-05",
      "headline": "Don't burn ties with India: Nikki Haley on Trump's tariff threat over Russian oilThe Republican leader also called out the Trump administration's duplicity, highlighting a soft-handling of trade with China in which the US paused the tariffs for 90 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-apoorva-mukhija-collaboration-ad-podcast-indias-got-latent-controversy-2766962-2025-08-06",
      "headline": "Samay Raina and Apoorva Mukhija spoof their past in funny new adSamay Raina and Apoorva Mukhija have reunited for a quirky skincare ad with their witty banter and playful jabs. The ad went live on Samay's Instagram handle on Tuesday night. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/actor-vijay-deverakonda-appears-before-ed-in-online-betting-apps-case-2767040-2025-08-06",
      "headline": "Actor Vijay Deverakonda at ED office in Hyderabad in online betting apps' caseActor Vijay Deverakonda appeared before the ED on August 6 in a case involving illegal promotion of online betting apps. The FIR names 29 celebrities, including Prakash Raj and Rana Daggubati. The ED is probing financial trails and digital ads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-cuts-a-cake-as-he-celebrates-border-2-wrap-diljit-dosanjh-2767075-2025-08-06",
      "headline": "Varun Dhawan cuts a cake as he celebrates Border 2 wrapActor Varun Dhawan cut a cake and celebrated the 'Border 2' wrap. Several pictures and videos from the celebration have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/walking-dead-actor-kelley-mack-dies-cancer-33-2767037-2025-08-06",
      "headline": "Walking Dead actor Kelley Mack dies of rare brain cancer at 33In January, actor Kelley Mack, known for her performance in 'Walking Dead', revealed that she had been diagnosed with diffuse midline glioma, a rare form of astrocytoma cancer. She died at the age of 33 on August 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/parineeta-trailer-vidya-balan-starrer-restored-in-8k-ahead-of-re-release-2766976-2025-08-06",
      "headline": "Parineeta trailer: Vidya Balan-starrer restored in 8K ahead of re-releaseAhead of the re-release of 'Parineeta', a new trailer was unveiled by the makers. Now restored in 8K, the trailer retains the charm of the film released 20 years ago. The film, which marked actor Vidya Balan's acting debut, will be re-released in theatres on August 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-sparks-row-sri-lankan-tamils-bad-light-2767026-2025-08-06",
      "headline": "Protests against Vijay Deverakonda's Kingdom over portrayal of Sri Lankan TamilsVijay Deverakonda's film Kingdom has sparked protests in Tamil Nadu by pro-Tamil groups condemning its portrayal of Sri Lankan Tamils. Distributors seek police protection as screenings face disruptions in Madurai and Trichy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-harry-brook-on-gautam-gambhir-player-of-the-series-2767048-2025-08-06",
      "headline": "Brook stunned by Gambhir's decision to award him Player of the Series over RootEngland batter Harry Brook revealed that he felt undeserving of the Player of the Series award of the England vs India five-match Test series. Brook scored 481 runs from five matches at an average of 53.44."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-grand-masters-chennai-2025-fire-postponement-2767047-2025-08-06",
      "headline": "Chennai Grand Masters postponed to August 7 after fire at tournament venueChennai Grand Masters 2025 postponed to August 7 after a fire at the Hyatt Regency venue. All players, including Arjun Erigaisi, are safe, say organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-brendon-mccullum-on-mohammed-siraj-oval-2767008-2025-08-06",
      "headline": "Mohammed Siraj has heart of a lion: McCullum in awe of India's fighting spiritEngland head coach Brendon McCullum has hailed India fast bowler Mohammed Siraj for his fighting spirit and praised India for a scripitng a sensatiuonal comeback in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-india-pace-leader-greg-chappell-jasprit-bumrah-absence-2766999-2025-08-06",
      "headline": "Mohammed Siraj ready to be India's bowling leader with or without Bumrah: ChappellGreg Chappell backs Mohammed Siraj as the leader of India's pace attack, saying he's ready to take charge with or without Jasprit Bumrah in the side after Oval heroics. Siraj was adjudged as the Player Of The Match for his performance which helped India win the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-on-shubman-gill-odi-captaincy-from-rohit-sharma-2766975-2025-08-06",
      "headline": "Shubman Gill ready to take over ODI captaincy from Rohit Sharma: Mohammad KaifFormer India cricketer-turned commentator Mohammad Kaif feels Shubman Gill is ready to take over ODI captaincy from Rohit Sharma after his heroics in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-yashavi-jaiswal-shubman-gill-sai-sudharsan-india-squad-2766970-2025-08-06",
      "headline": "Shubman Gill, Yashasvi Jaiswal in contention for Asia Cup call-up: ReportIndia's Test captain Shubman Gill, Yashasvi Jaiswal and Sai Sudharsan are in contention to make it to the squad for the upcoming Asia Cup 2025, which will begin on September. All three men remain in contention despite the West Indies Test series later on in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fox-stops-play-the-hundred-opener-oval-invincibles-london-spirit-2766954-2025-08-06",
      "headline": "A foxy affair: Unexpected pitch invader halts The Hundred opener at Lord'sThe Hundred opener between the London Spirit and the Oval Invincibles had an unexpected guest as a fox made its way to the Lord's cricket ground on Tuesday, August 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-india-2025-series-draw-collapse-ben-stokes-2766940-2025-08-06",
      "headline": "From 4–1 to 2–2: How England let a glorious Test series win slip awayThe Test series between England and India ended in a 2-2 draw, but the hosts could well have won it 4-1. Having squandered golden opportunities for victory at Old Trafford and the Kennington Oval, England now must face the harsh reality of making some big changes with the Ashes on the horizon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ganguly-backs-mukesh-kumar-india-recall-2766925-2025-08-06",
      "headline": "Mukesh Kumar is a bowler for all formats: Ganguly on pacer's England Test snubFormer India captain Sourav Ganguly said that Mukesh Kumar is well-suited to bowl across all three formats and backed the pacer to be in contention for a spot in India's squad for the 2025 Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-management-injury-2766917-2025-08-06",
      "headline": "India's Jasprit Bumrah dilemma: Protect the body or preserve his magicJasprit Bumrah and the Indian team management might be on the brink of facing an impossible choice with trade-offs coming in both ends as the premier pacer continues to be binded down by limitations in terms of appearances or workload. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-outer-warriors-team-2766763-2025-08-06",
      "headline": "Siddhant Sharma and Harsh Tyagi's journey fuels Outer Delhi Warriors in DPL 2025From the dusty maidans of Delhi to the leadership roles in DPL 2025, Siddhant Sharma and Harsh Tyagi have walked a path built on patience, perseverance, and passion. Their journeys reflect the unseen grind behind every rising star in Indian domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fox-stops-play-the-hundred-opener-oval-invincibles-london-spirit-2766954-2025-08-06",
      "headline": "A foxy affair: Unexpected pitch invader halts The Hundred opener at Lord'sThe Hundred opener between the London Spirit and the Oval Invincibles had an unexpected guest as a fox made its way to the Lord's cricket ground on Tuesday, August 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-india-2025-series-draw-collapse-ben-stokes-2766940-2025-08-06",
      "headline": "From 4–1 to 2–2: How England let a glorious Test series win slip awayThe Test series between England and India ended in a 2-2 draw, but the hosts could well have won it 4-1. Having squandered golden opportunities for victory at Old Trafford and the Kennington Oval, England now must face the harsh reality of making some big changes with the Ashes on the horizon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ganguly-backs-mukesh-kumar-india-recall-2766925-2025-08-06",
      "headline": "Mukesh Kumar is a bowler for all formats: Ganguly on pacer's England Test snubFormer India captain Sourav Ganguly said that Mukesh Kumar is well-suited to bowl across all three formats and backed the pacer to be in contention for a spot in India's squad for the 2025 Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-management-injury-2766917-2025-08-06",
      "headline": "India's Jasprit Bumrah dilemma: Protect the body or preserve his magicJasprit Bumrah and the Indian team management might be on the brink of facing an impossible choice with trade-offs coming in both ends as the premier pacer continues to be binded down by limitations in terms of appearances or workload. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-outer-warriors-team-2766763-2025-08-06",
      "headline": "Siddhant Sharma and Harsh Tyagi's journey fuels Outer Delhi Warriors in DPL 2025From the dusty maidans of Delhi to the leadership roles in DPL 2025, Siddhant Sharma and Harsh Tyagi have walked a path built on patience, perseverance, and passion. Their journeys reflect the unseen grind behind every rising star in Indian domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-student-college-fees-bagaklot-2766876-2025-08-06",
      "headline": "Pant makes heartfelt gesture, pays college fees for underprivileged studentRishabh Pant extended a generous helping hand to support the education of a student from a financially struggling family in Karnataka's Bagalkot district. After word reached about the student's need, Pant paid the fees directly to the college. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mohammed-siraj-role-model-managing-workload-sourav-ganguly-2766873-2025-08-05",
      "headline": "Siraj a role model for pacers on managing workload: Sourav GangulyENG vs IND: Former Indian captain Sourav Ganguly, in an interview with Aaj Tak, heaped praise on Mohammed Siraj, who finished the Test series against England as the leading wicket-taker with 23 scalps to his name from five games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-cab-president-election-2766857-2025-08-05",
      "headline": "Sourav Ganguly to enter race for Bengal cricket's presidential electionFormer Indian captain Sourav Ganguly confirmed to India Today that he will be submitting his nomination ahead of the Annual General Meeting (AGM) to contest for the post of President of the Cricket Association of Bengal (CAB).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-2766815-2025-08-05",
      "headline": "Ganguly lauds Gautam Gambhir as Gill, Pant step up in absence of Big 2Former India captain Sourav Ganguly lauded the batting depth of the Indian team after the side drew 2-2 against England in the 5-match Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/boys-have-been-brilliant-throughout-last-two-months-gautam-gambhir-on-england-tour-2766791-2025-08-05",
      "headline": "Boys were brilliant throughout last two months: Gambhir on England tourENG vs IND: Head coach of the Indian cricket team, Gautam Gambhir, hailed the entire team's performances throughout their recent tour of England. The Indian team went on to level the series 2-2 with a miraculous win at the Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-ipl-kkr-indian-team-sacking-2766775-2025-08-05",
      "headline": "KKR is where I belong: Abhishek Nayar on his exit from Indian teamFormer India assistant coach Abhishek Nayar was sacked from his role in the aftermath of Border-Gavaskar Trophy. Nayar broke his silence on the matter after joining WPL side UP Warriorz as their head coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-squad-asia-cup-netherlands-t20i-series-2766755-2025-08-05",
      "headline": "Bangladesh name preliminary squad for Asia Cup 2025, Netherlands T20I seriesBangladesh have named a 25‑member preliminary squad for the upcoming Asia Cup and the three-match T20I series against the Netherlands. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-submit-bid-benjamin-sesko-2766727-2025-08-05",
      "headline": "Manchester United submit first bid for RB Leipzig's Benjamin Sesko: ReportThe race intensifies for RB Leipzig's Benjamin Sesko as Manchester United have reportedly submitted their first bid for the Slovenian striker, who is also being pursued by Newcastle United.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/boys-have-been-brilliant-throughout-last-two-months-gautam-gambhir-on-england-tour-2766791-2025-08-05",
      "headline": "Boys were brilliant throughout last two months: Gambhir on England tourENG vs IND: Head coach of the Indian cricket team, Gautam Gambhir, hailed the entire team's performances throughout their recent tour of England. The Indian team went on to level the series 2-2 with a miraculous win at the Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-ipl-kkr-indian-team-sacking-2766775-2025-08-05",
      "headline": "KKR is where I belong: Abhishek Nayar on his exit from Indian teamFormer India assistant coach Abhishek Nayar was sacked from his role in the aftermath of Border-Gavaskar Trophy. Nayar broke his silence on the matter after joining WPL side UP Warriorz as their head coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-squad-asia-cup-netherlands-t20i-series-2766755-2025-08-05",
      "headline": "Bangladesh name preliminary squad for Asia Cup 2025, Netherlands T20I seriesBangladesh have named a 25‑member preliminary squad for the upcoming Asia Cup and the three-match T20I series against the Netherlands. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-submit-bid-benjamin-sesko-2766727-2025-08-05",
      "headline": "Manchester United submit first bid for RB Leipzig's Benjamin Sesko: ReportThe race intensifies for RB Leipzig's Benjamin Sesko as Manchester United have reportedly submitted their first bid for the Slovenian striker, who is also being pursued by Newcastle United.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yograj-singh-on-mohammed-siraj-kapil-dev-oval-test-2766703-2025-08-05",
      "headline": "Mohammed Siraj's heroic spell at Oval reminded me of Kapil Dev: Yograj SinghFormer India cricketer Yograj Singh revealed that Mohammed Siraj's phenomenal spell in the fifth Test against England at the Oval, reminded him of Kapil Dev. Siraj was adjudged Player of the Match for picking nine wickets in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-star-players-oval-test-win-2766699-2025-08-05",
      "headline": "BCCI unlikely to allow India stars to pick and choose games going forwardThe BCCI is set to introduce a rule that will prevent star players from selectively choosing matches in which to rest. On Monday, India drew their five-match series against England after winning the Oval Test by six runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-partey-arsenal-midfielder-granted-bail-villarreal-move-2766693-2025-08-05",
      "headline": "Ex-Arsenal midfielder Thomas Partey granted bail on 5 rape charges: ReportFormer Arsenal midfielder Thomas Partey has been granted bail after appearing in court in London. He is under investigation for five counts of rape and one count of sexual assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-hundreds-analysis-2766556-2025-08-05",
      "headline": "Pressure, what pressure. Shubman Gill aces 1st assignment as India captainUnder immense pressure and taking up the job for the first time, Shubman Gill excelled in his role as India captain during the recently concluded England Test series. With an impressive run with the bat, Gill remained stern in his methods and showed why he can be a great as a skipper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-cincinnati-open-us-open-match-pulls-out-2766680-2025-08-05",
      "headline": "Djokovic pulls out of Cincinnati Open, to play US Open with no match practice24-time Grand Slam champion Novak Djokovic won't be taking part in the Cincinnati Open, meaning that he won't have any warmup matches on hard-courts before the US Open. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-cheteshwar-pujara-on-sai-sudharsan-karun-nair-at-no-3-2766658-2025-08-05",
      "headline": "Pujara shows faith in Sudharsan, Nair at no. 3 after tough England seriesIndia batter Cheteshwar Pujara has backed Sai Sudharsan and Karun Nair to succeed at no 3 after their struggles in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gautam-gambhir-fiery-speech-india-oval-test-win-video-2766651-2025-08-05",
      "headline": "Watch: Gautam Gambhir's fiery speech after India's Oval Test winENG vs IND: Gautam Gambhir delivered a fiery speech after India's iconic win at the Oval to level the five-match Test series against England. The Indian head coach emphasised the importance of the dressing room culture in India's crucial win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-2025-squads-schedule-timing-teams-streaming-2766621-2025-08-05",
      "headline": "The Hundred 2025: Squads, schedule and all you need to knowThe men's and women's competitions in the Hundred 2025 are scheduled to take place from August 5 to 31. David Warner, Kane Williamson, Steve Smith, Ellyse Perry and Jonny Bairstow are amongst the big players in the tournament. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/beyond-the-big-cities-punjab-fc-is-building-indias-next-football-stars-2766606-2025-08-05",
      "headline": "Beyond the big cities: Punjab FC is building India's next football starsWhile most professional sports clubs in India focus on the top tiers, Punjab FC is quietly rewriting the script—starting at the grassroots with 16 centres across Punjab's heartland and a fully integrated residential academy system, the club is nurturing a new generation of footballers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-tim-david-fined-umpire-dissent-2766599-2025-08-05",
      "headline": "Blot on AUS whitewash of WI: Tim David fined for umpire dissentAustralia's whitewash of the West Indies was nearly spotless, but Tim David's moment of frustration in the final T20I saw him penalised for umpire dissent, slightly marred an otherwise flawless series win.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-sourav-ganguly-day-4-miracle-2766585-2025-08-05",
      "headline": "Sourav Ganguly on Oval Test: After Day 4, had confidence India will winFormer India captain Sourav Ganguly suggested that he knew India were going to win the Oval Test after Day 4. His thoughts came to reality as Siraj led a miraculous comeback to level the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-coach-rafael-nadal-season-2766582-2025-08-05",
      "headline": "Emma Raducanu hires Rafael Nadal's former coach until 2025 season endWorld No.33 and 2021 US Open champion Emma Raducanu hired Rafael Nadal's former coach, Francisco Roig, in her coaching staff after parting ways with Mark Petchey.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}