{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-hdfc-union-bank-and-others-offer-attractive-3-year-fd-rates-should-you-invest-now-2767346-2025-08-06",
      "headline": "ICICI, HDFC, Union Bank and others offer attractive 3-year FD rates. Should you invest now?FDs remain one of the safest investment options for those looking for steady returns without risk. However, with repo rates possibly heading downward in the future, locking in higher FD rates now could be a smart financial move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/highway-infrastructure-ipo-opening-date-august-7-gmp-trend-50-percent-listing-gain-details-review-2767294-2025-08-06",
      "headline": "Should you subscribe to this IPO with over 50% listing gains? Check detailsThe public issue is worth Rs 130 crore, made up of a fresh issue of 1.39 crore shares amounting to Rs 97.52 crore, and an offer for sale of 46 lakh shares worth Rs 32.48 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-25-percent-import-duty-imports-phdcci-report-impact-india-economy-minimal-trump-2767228-2025-08-06",
      "headline": "US tariffs won't shake India's economy, says reportThe PHD Chamber of Commerce and Industry (PHDCCI) white paper finds only 1.87% impact on exports and 0.19% on GDP from the new US trade barrier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-usd-64-billion-us-trade-at-risk-as-tensions-with-washington-escalate-after-trump-tariff-threat-2767209-2025-08-06",
      "headline": "India's $64 billion US trade at risk as tensions with Washington escalateIndia faces its most serious diplomatic crisis with the US in years after Trump imposed the highest tariffs among Asian peers on goods imported from India, even before any penalty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-rbi-rate-cut-it-stocks-us-tariff-concern-2767203-2025-08-06",
      "headline": "Sensex, Nifty end lower as US trade tension; RBI rate pause hit sentimentThe S&P BSE Sensex ended 166.26 points lower to end at 80,543.99, while the NSE Nifty50 lost 75.35 points to end at 24,574.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-radhika-gupta-on-why-large-cap-is-the-new-debt-2767168-2025-08-06",
      "headline": "Edelweiss' Radhika Gupta on why large cap is the new debtTraditionally, people invested in debt, like fixed deposits or bonds, when they wanted safety. They turned to equity, like stocks, when they were willing to take more risk for higher returns. But that line is getting blurry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-gen-z-is-trusting-instagram-influencers-over-financial-advisors-for-investment-advice-2767166-2025-08-06",
      "headline": "Is social media ruining investing for Gen Z?Social media is reshaping how young Indians invest. With financial influencer or 'finfluencer' on the rise, traditional financial literacy is being replaced by reels and short YouTube videos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-russia-import-trade-trump-hypocrisy-india-oil-purchase-putin-china-tariff-news-2767164-2025-08-06",
      "headline": "Trump says don't know anything about US-Russia imports. But here's what we knowUS President Donald Trump recently said he was unaware that the United States still imports goods like uranium and fertilisers from Russia. His comments came after India defended its oil trade with Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-ai-manage-your-investment-portfolio-ai-based-portfolio-management-tools-2767113-2025-08-06",
      "headline": "Can AI manage your investment portfolio?AI is rapidly changing how we invest. From portfolio tracking to fund recommendations, it's already doing the heavy lifting. But can it take full charge of your investments, and, should it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-easier-claim-rules-to-jan-dhan-scheme-rbi-3-key-reforms-for-common-man-2767056-2025-08-06",
      "headline": "From easier claim rules to Jan-dhan scheme: RBI's 3 key reforms for common manOne of the major announcements is aimed at easing the process for families to claim money or valuables from bank accounts, lockers, or safe custody after the account holder passes away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forgot-to-e-verify-your-itr-here-is-what-to-do-to-avoid-penalties-what-to-do-if-forgot-to-e-verify-itr-2767009-2025-08-06",
      "headline": "Forgot to e-verify your ITR? Here's what to do to avoid penaltiesEven though the new ITR deadline is now September 15, 2025 for several taxpayers, the 30-day e-verification window begins the moment you file your return and not from the due date."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/war-2-song-rakesh-roshan-performs-aavan-jaavan-hookstep-days-after-surgery-hrithik-kiara-2767338-2025-08-06",
      "headline": "Rakesh Roshan surprises Hrithik with Aavan Jaavan hookstep days after surgeryFillmmaker Rakesh Roshan performed the 'Aavan Jaavan' hookstep from Ayan Mukerji's 'War 2'. His actor son Hrithik Roshan praised the veteran's dancing skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-moved-by-army-learning-korean-shares-why-he-avoids-hand-contact-2767365-2025-08-06",
      "headline": "BTS Jin moved by ARMY learning Korean, shares why he avoids hand contact at showsCurrently on his 'Run Seokjin Ep Tour', Jin is nearing the conclusion of the tour, with the final concert scheduled to take place on August 10 in Amsterdam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-trailer-anushka-shetty-and-krish-returns-in-a-gritty-mountain-saga-2767348-2025-08-06",
      "headline": "Ghaati trailer : Anushka Shetty roars jn gritty saga of revenge ans resistanceAfter multiple delays, the trailer of 'Ghaati' finally sets the stage for Anushka Shetty's return in a rugged, survival drama. Directed by Krish Jagarlamudi, the film is slated for a September 5 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-season-2-announcement-kajol-laughs-off-comeback-comments-release-date-jiohotstar-2767311-2025-08-06",
      "headline": "Kajol laughs off comeback comments in The Trial season 2 announcement videoThe second season of 'The Trial' starring Kajol was announced on Wednesday. In a promo, the actor humorously addressed the notion of her 'comeback'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-allahbadia-denies-celebrities-boycott-claims-latent-controversy-beerbiceps-2767279-2025-08-06",
      "headline": "Ranveer Allahbadia says stars boycotting his podcast were never invited on showYouTuber Ranveer Allahbadia slammed celebrities for claiming that they refused to come to his show after the 'India's Got Latent' controversy. He stated that those making such statements weren't even invited.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-to-hrithik-roshan-bollywood-slams-perfume-ad-for-promoting-rape-culture-1958860-2022-06-06",
      "headline": "Bollywood slams perfume ad for promoting rape cultureTwo advertisements for a perfume brand recently came under the scanner for propagating rape culture. Several celebs have now bashed the campaign on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anne-hathaway-films-love-scenes-for-devil-wears-prada-2-is-andy-finally-in-love-2767305-2025-08-06",
      "headline": "Anne Hathaway films love scenes for Devil Wears Prada 2. Is Andy finally in love?New photographs from the set of 'The Devil Wears Prada 2' have confirmed the actor portraying the new love interest of Anne Hathaway's character is Andy Sachs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-5-conrad-fischer-2767197-2025-08-06",
      "headline": "The Summer I Turned Pretty Ep 5 confirms what we knew all along: Conrad is the one'The Summer I Turned Pretty' Season 3, Episode 5, dives into Conrad's POV - the heartbreak, longing, and proof that Belly's definitely choosing the wrong brother. Here's why it hurts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-begins-kbc-17-shooting-shares-post-2767317-2025-08-06",
      "headline": "New opportunity, challenges: Amitabh Bachchan begins KBC 17 shootingAmitabh Bachchan has begun 'Kaun Banega Crorepati 17' shooting. The legendary actor shared a post and announced the new update. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/triptii-dimri-emotional-scene-dhadak-2-viral-fans-reaction-update-2767229-2025-08-06",
      "headline": "Triptii Dimri's emotional scene from Dhadak 2 goes viral, fans say she's backAn emotional scene of actor Triptii Dimri from 'Dhadak 2' is going viral. Several fans hailed the actor's performance on social media. In the scene, Dimri can be seen responding to a casteist remark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/influencer-ankush-bahuguna-makes-tiramisu-with-selena-gomez-like-it-is-no-big-deal-2767246-2025-08-06",
      "headline": "Influencer Ankush Bahuguna makes tiramisu with Selena Gomez like it's no big dealContent creator Ankush Bahuguna recently met singer Selena Gomez in Malibu. He shared his experience of a tiramisu-baking class with Gomez on Instagram. Bahuguna has over 1 million followers on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-jagga-not-entering-salman-khan-bigg-boss-19-amid-reports-comeback-2767288-2025-08-06",
      "headline": "Priyanka Jagga not entering Bigg Boss 19 amid reports of her comeback: SourcePriyanka Jagga Muise is not entering 'Bigg Boss 19'. After being thrown out of the show, a source close to the show told IndiaToday,in that she had not been approached for the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-faces-backlash-for-snapping-at-hindi-speaking-request-2767289-2025-08-06",
      "headline": "Kajol snaps at paparazzi asking her to speak in Hindi, slammed as video goes viralA video of Kajol reacting sharply to a request to speak in Hindi during an interview has gone viral, drawing backlash online. Many social media users criticised her, questioning her attitude towards the language despite working in Hindi films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/all-about-hrithik-roshan-vs-jr-ntrs-dance-face-off-in-war-2s-jaanabe-aali-2767255-2025-08-06",
      "headline": "All about Hrithik Roshan vs Jr NTR's dance face-off in War 2's Jaanabe AaliThe much-awaited dance face-off between Jr NTR and Hrithik Roshan in 'War 2' is finally getting a glimpse release on August 7, while the full version of the song 'Janaabe Aali' will be reserved exclusively for the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jason-mamoa-chief-of-war-stepping-stone-towards-indigenous-storytelling-2766597-2025-08-06",
      "headline": "How Jason Mamoa's Chief of War is stepping-stone towards indigenous storytellingJason Mamoa's 'Chief of War' has been entirely shot in Maori language while depicting the 18th century Hawaiian kingdom. Can more diverse, indigenous stories also be turned into cinematic spectacles irrespective of language and cultural barriers? Has the audience become more accepting of local, regional cultures being explored in mainstream cinema? IndiaToday.in shares insights on the future of diverse storytelling in cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-2-in-works-but-theres-a-catch-2767192-2025-08-06",
      "headline": "The Raja Saab 2 in works, but there's a catchWith 'The Raja Saab' heading toward its December 5 release, producer TG Vishwa Prasad has revealed plans to turn the horror-comedy into a multiverse-style franchise, where each instalment will feature a new story set in a different universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-varun-badola-says-no-one-expected-saiyaara-to-be-this-big-2767195-2025-08-06",
      "headline": "Exclusive: Actor Varun Badola says no one expected Saiyaara to be this bigActor Varun Badola's brief but powerful role in 'Saiyaara' has captivated audiences. His upcoming TV show features a similar role, highlighting his versatile acting career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-vatsal-sheth-celebrate-joint-birthday-at-ishita-duttas-home-2767221-2025-08-06",
      "headline": "Kajol, Vatsal Sheth celebrate joint birthday at Ishita Dutta's home. PicsKajol and Vatsal Sheth celebrated their shared birthday with an intimate party hosted by Ishita Dutta at her Mumbai home, joined by close friends and family, including Yug Devgn. The duo cut five cakes together, while Ajay Devgn posted fun birthday wishes for both."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/geeta-chandran-disciple-anvita-jain-bharatanatyam-arangetram-delhi-2767112-2025-08-06",
      "headline": "Bharatnatyam legend Geeta Chandran's disciple Anvita Jain's Arangetram in DelhiBharatnatyam legend Geeta Chandran's disciple Anvita Jain's Arangetram ceremony is scheduled at the Chinmaya Mission Auditorium in New Delhi. The event highlights tradition and artistic discipline under the guidance of a cultural icon."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/unfair-unjustified-unreasonable-india-hits-back-at-trumps-additional-25-tariffs-2767391-2025-08-06",
      "headline": "Unfair, unjustified, unreasonable: India hits back at Trump's additional 25% tariffsEarlier, Donald Trump announced an extra 25 per cent trade tariff on India after he warned the country of action over its oil purchases from Russia, taking the total levy to 50 per cent. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indira-gandhi-stood-up-to-us-not-huglomacy-congress-slams-pm-modi-after-trump-50-per-cent-tariff-2767398-2025-08-06",
      "headline": "Indira Gandhi stood up to US, not huglomacy: Congress slams PM after Trump's tariffAfter Trump's announcement of additional levies on Indian goods, Jairam Ramesh took to X to remind PM Modi how Indira Gandhi looked then-US President Richard Nixon in the eye ahead of the 1971 war with Pakistan. He called it \"an abysmal failure of Mr. Modi's personalised and headline-grabbing style of huglomacy\" with Trump."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/six-year-old-indian-origin-girl-brutally-assaulted-racist-attack-ireland-go-back-to-india-immigration-2767324-2025-08-06",
      "headline": "Go back to India: 6‑year‑old Indian‑origin girl hit in private parts in IrelandA six‑year‑old Indian‑origin girl in Waterford, Ireland, was assaulted by a group of boys who punched her, hit her private parts with a bicycle, and hurled racist abuse, telling her to \"go back to India\". Her mother, a nurse, who recently became an Irish citizen, said the child is now terrified to play outside and the family feels unsafe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/extra-25-us-tariffs-on-india-21-days-from-now-full-text-to-trumps-order-2767351-2025-08-06",
      "headline": "Extra 25% US tariffs on India 21 days from now: What Trump said in his orderTwo days after threatening to substantially raise tariffs, US President Donald Trump has signed an executive order imposing an extra 25% tariff on India over Russian oil purchase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/post-uprising-bangladesh-poised-for-next-leap-what-feb-26-polls-could-achieve-2767161-2025-08-06",
      "headline": "Post-uprising Bangladesh poised for next leap: What Feb '26 polls could achieveMemories of the Sheikh Hasina regime, manipulated elections and political violence linger in the Bangladeshi psyche. The road to healing runs through the ballot box"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-was-spending-rs-1500-crore-on-rent-for-ministries-says-pm-from-newly-unveiled-kartavya-bhavan-2767340-2025-08-06",
      "headline": "Centre spent Rs 1,500 crore on ministry rent, not anymore: PM at Kartavya BhavanPM Modi pointed out that the country's administrative machinery had been operating for decades after Independence from buildings constructed during the British era. He further highlighted the poor working conditions in the existing buildings, stating that they lacked proper lighting, space, and ventilation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-oil-secretly-funding-russia-war-machine-ukraine-trump-here-is-the-truth-2767147-2025-08-06",
      "headline": "India secretly funding Russia war machine? 9 facts Trump is not telling youThe narrative that India's growing oil imports from Russia are fuelling the Kremlin's actions in Ukraine exposes not only media misrepresentation but also a pattern of global double standards. We answer your questions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-luxury-car-scam-toyota-land-cruiser-bmw-audi-import-under-invoicing-hawala-payments-economy-imf-fatf-2767339-2025-08-06",
      "headline": "Pak customs scam: 1-crore-rupee Land Cruiser valued at just PKR 17,000Luxury car importers exploited Pakistan's digital customs system to declare high-end vehicles at shockingly low values, evading 19 billion Pakistani rupees (PKR) in duties and taxes from December 2024 to March 2025, an audit revealed. This is the biggest money-laundering scam related to luxury vehicle imports in Pakistan's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/scapegoated-and-silenced-america-turns-on-indian-workers-2767175-2025-08-06",
      "headline": "Scapegoated and Silenced: America Turns on Indian WorkersAs US-India trade tensions have exploded amid disputes over tariffs, currency policy, and geopolitical positioning, Indian professionals in America suddenly find themselves caught in the crossfire. Social media is flooded with posts blaming Indian engineers for everything from unemployment to inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-announces-extra-25-tariff-on-india-over-russian-oil-purchase-total-levy-now-at-50-2767349-2025-08-06",
      "headline": "Trump imposes extra 25% tariff on India over Russian oil, total levy 50%Trump signed a nine-section order on Wednesday, outlining the details of various aspects, like the background, the tariffs, the scope of duties and stacking, among others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/semi-conscious-woman-patient-molested-by-staff-at-ekbalpore-nursing-home-in-kolkata-2767240-2025-08-06",
      "headline": "Kolkata: Semi-conscious patient molested by staff at private nursing homeThe accused, identified as Abdul Subhan (33), is a Group D employee at Ekbalpore Nursing Home, located in the Ekbalpur area of Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/hiroshima-at-80-when-japan-burned-but-the-soviets-got-the-message-2767158-2025-08-06",
      "headline": "80 years of Hiroshima: When Japan burned, but the Soviets got the messageOn August 6, 1945, the US dropped the first atomic bomb on Hiroshima. But it wasn't about Japan alone. It was the fear of German nukes, overlooked warnings, and Cold War power plays that drove the US decision, one that Einstein regretted playing a part in later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-chief-minister-revanth-reddy-warns-rahul-gandhis-rivals-demands-centre-approve-42-bc-quota-2767319-2025-08-06",
      "headline": "Opposing Rahul Gandhi will end political careers: Revanth Reddy at OBC quota protestTelangana Chief Minister Revanth Reddy said those who oppose Rahul Gandhi's message will face political death. Speaking at Jantar Mantar, he demanded Centre approve Telangana's 42% BC quota bills. He also slammed BJP and BRS."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/uttarkashi-tragedy-dharali-flash-flood-leaves-meteorologists-scrambling-for-answers-2767122-2025-08-06",
      "headline": "Uttarkashi tragedy has meteorologists scrambling for answersInitial reports from the Uttarakhand government attributed the disaster to a cloudburst, a phenomenon characterised by extremely heavy rainfall over a short period, typically exceeding 100 mm in an hour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-china-for-shanghai-cooperation-organisation-summit-1st-trip-to-beijing-since-2019-2767204-2025-08-06",
      "headline": "PM Modi to visit China for SCO summit, first trip since 2019PM Modi's visit comes at a time when Donald Trump has targeted the Brics nations for buying oil from Russia and for what the US President claims is a grouping that challenges the hegemony of the dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/bra-cancer-myth-debunked-underwire-bras-not-linked-to-breast-cancer-2767191-2025-08-06",
      "headline": "Tight bras don't cause cancer, but they're not completely risk-freeThe long-standing myth that bras cause breast cancer is scientifically disproven. Experts emphasise comfort and proper fit over unfounded fears about cancer risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-dycm-dk-shivakumar-under-fire-for-inspecting-bengalurus-hebbal-flyover-on-bike-with-rs-18500-fines-2767335-2025-08-06",
      "headline": "Fine ride: Bike DK Shivakumar rode for flyover visit has Rs 18,500 traffic penaltyKarnataka Deputy Chief Minister DK Shivakumar's video of a stylish bike ride at Hebbal flyover inspection in Bengaluru has triggered backlash. BJP flagged Rs 18,500 in pending fines on the bike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-minister-sanjay-nishad-flood-inspection-ganga-kanpur-dehat-river-blessings-woman-savage-reply-uttarakhand-flash-2767148-2025-08-06",
      "headline": "UP minister calls floods Ganga Ma blessings, gets amma's savage replyUP Minister Sanjay Nishad, during a visit to a flood-hit village in Kanpur Dehat, called the rising waters a \"blessing\" from Ganga Ma. But an elderly woman's sharp quick retort turned the minister's remark into a public embarrassment. Opposition parties, including the Congress and the SP, slammed the minister for insensitivity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-russia-import-trade-trump-hypocrisy-india-oil-purchase-putin-china-tariff-news-2767164-2025-08-06",
      "headline": "Trump says don't know anything about US-Russia imports. But here's what we knowUS President Donald Trump recently said he was unaware that the United States still imports goods like uranium and fertilisers from Russia. His comments came after India defended its oil trade with Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-50-years-film-that-died-at-birth-to-live-forever-gabbar-singh-jai-veeru-amitabh-bachchan-dharmendra-283-05-08-2025",
      "headline": "Sholay@50: The film that died at birth to live foreverOn August 15, 1975, Sholay lit up Indian theatres, igniting a cultural fire that burns bright even today. To celebrate its golden jubilee, we revisit the legacy of the masterpiece, exploring the stories, struggles, and serendipity behind its creation. In part one, we revisit the chaos around its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/assam-man-pull-ups-hanging-from-dhola-sadiya-bridge-record-instagram-reel-viral-video-2767327-2025-08-06",
      "headline": "Assam man does pull-ups hanging from Dhola-Sadiya Bridge, video goes viralThe man, seen in the video, hangs from the edge of the bridge's railing and performs pull-ups as bystanders record the risky act on their phones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/gut-health-personalised-probiotics-india-wellness-market-growth-2767183-2025-08-06",
      "headline": "Why everyone's talking about gut health: The rise of personalised probioticsGut health has become a major focus in India's booming wellness industry, driven by personalised probiotic plans and microbiome testing. Supermarket stores and pharmacies are packed with probiotic drinks, capsules with multi-strain bacteria, enzyme-rich supplements, and even botanicals - all promising digestive bliss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/massive-fall-intake-drop-15-lakh-students-may-skip-us-colleges-this-year-2767273-2025-08-06",
      "headline": "1.5 lakh foreign students may skip US colleges this fall, $7 billion loss predictedVisa delays, travel bans, and processing pauses threaten to derail the September 2025 US fall intake. Indian students are the worst hit as 1.5 lakh foreign students may not reach US campuses this fall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/war-2-song-rakesh-roshan-performs-aavan-jaavan-hookstep-days-after-surgery-hrithik-kiara-2767338-2025-08-06",
      "headline": "Rakesh Roshan surprises Hrithik with Aavan Jaavan hookstep days after surgeryFillmmaker Rakesh Roshan performed the 'Aavan Jaavan' hookstep from Ayan Mukerji's 'War 2'. His actor son Hrithik Roshan praised the veteran's dancing skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-trailer-anushka-shetty-and-krish-returns-in-a-gritty-mountain-saga-2767348-2025-08-06",
      "headline": "Ghaati trailer : Anushka Shetty roars jn gritty saga of revenge ans resistanceAfter multiple delays, the trailer of 'Ghaati' finally sets the stage for Anushka Shetty's return in a rugged, survival drama. Directed by Krish Jagarlamudi, the film is slated for a September 5 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-allahbadia-denies-celebrities-boycott-claims-latent-controversy-beerbiceps-2767279-2025-08-06",
      "headline": "Ranveer Allahbadia says stars boycotting his podcast were never invited on showYouTuber Ranveer Allahbadia slammed celebrities for claiming that they refused to come to his show after the 'India's Got Latent' controversy. He stated that those making such statements weren't even invited.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-to-hrithik-roshan-bollywood-slams-perfume-ad-for-promoting-rape-culture-1958860-2022-06-06",
      "headline": "Bollywood slams perfume ad for promoting rape cultureTwo advertisements for a perfume brand recently came under the scanner for propagating rape culture. Several celebs have now bashed the campaign on social media."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-navjot-sidhu-slams-gautam-gambhir-critics-series-draw-2-2-n-england-2767409-2025-08-06",
      "headline": "Will you stand up and greet Gambhir now? Sidhu slams India coach's criticsEngland vs India: Navjot Singh Sidhu has offered strong backing to national head coach Gautam Gambhir after India's hard-fought 2-2 draw in the five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-odi-series-live-streaming-squads-schedule-2767386-2025-08-06",
      "headline": "West Indies vs Pakistan ODI series Live Streaming: Squads, all you need to knowWI vs PAK ODI series: Shai Hope's West Indies and Mohammad Rizwan's Pakistan will be up against each other in a three-match ODI series from Friday, August 8 onwards at the Brian Lara Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-odi-squad-pakistan-series-romario-shepherd-return-alzarri-joseph-rest-2767385-2025-08-06",
      "headline": "Romario returns, Alzarri rested as West Indies name squad for Pakistan ODIsRomario Shepherd has been recalled to the West Indies squad for the upcoming three-match ODI series against Pakistan. Fast bowler Alzarri Joseph, who featured in the recent Test series against Australia, has been rested as part of workload management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/am-ghazanfar-afghanistan-squad-asia-cup-2767362-2025-08-06",
      "headline": "Afghanistan name preliminary squad for Asia Cup, Ghazanfar returnsYoung spinner AM Ghazanfar has returned as Afghanistan named a 22-member preliminary squad for the 2025 Asia Cup and the tri-series, involving Pakistan and hosts UAE. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chennaiyin-fc-suspend-club-operations-due-to-uncertainty-over-isl-2767354-2025-08-06",
      "headline": "Chennaiyin FC suspend club operations due to uncertainty over ISLChennaiyin FC, two-time champions of the Indian Super League (ISL), have announced the suspension of their first-team operations amid increasing uncertainty surrounding the league's future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-ministry-amends-rti-clause-national-sports-governance-bill-relief-bcci-2767343-2025-08-06",
      "headline": "Relief for BCCI: Only bodies taking govt funds to come under RTI in new billThe Sports Ministry has amended the RTI clause in the National Sports Governance Bill to apply only to bodies receiving government funds. This move provides relief to the BCCI and aims to improve accountability and dispute resolution in Indian sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/elina-svitolina-montreal-open-hateful-messages-mothers-2767331-2025-08-06",
      "headline": "Your moms would be disgusted: Elina Svitolina slams hateful textsMontreal Open 2025: Elina Svitolina called out hateful messages from online bettors after she lost in straight sets to four-time Grand Slam champion Naomi Osaka in the quarterfinals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-moeen-ali-mohammed-siraj-match-winner-2767300-2025-08-06",
      "headline": "Mohammed Siraj has matured into a genuine match-winner for India: Moeen AliFormer all-rounder Moeen Ali has lavished praise on Mohammed Siraj following the fast bowler's heroic performance in India's thrilling six-run victory over England in the final Test at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-impact-sachin-tendulkar-2767290-2025-08-06",
      "headline": "Sachin Tendulkar sends message to Jasprit Bumrah trolls after England Tests showIndia vs England: Sachin Tendulkar dismissed claims questioning Jasprit Bumrah's match-winning ability, stating that India's Test victories in England without their pace spearhead were merely coincidental. Bumrah featured in three Tests and picked up 14 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/montreal-open-clara-tauson-madison-keys-grandfather-2767285-2025-08-06",
      "headline": "In tears, Clara Tauson dedicates shock win in Montreal to late grandfatherMontreal Open 2025: Clara Tauson broke down after beating reigning Australian Open champion Madison Keys in straight sets, dedicating the win to her late grandfather. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-salary-hike-central-contract-2767241-2025-08-06",
      "headline": "Pakistan Women rewarded with massive salary hike in central contractThe Pakistan Cricket Board has given a 50 per cent salary raise to the 20 women's cricketers in the central contracts for the 2025-26 season. Left-arm spinner Sadia Iqbal has been promoted to Category A. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/elina-svitolina-montreal-open-hateful-messages-mothers-2767331-2025-08-06",
      "headline": "Your moms would be disgusted: Elina Svitolina slams hateful textsMontreal Open 2025: Elina Svitolina called out hateful messages from online bettors after she lost in straight sets to four-time Grand Slam champion Naomi Osaka in the quarterfinals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-moeen-ali-mohammed-siraj-match-winner-2767300-2025-08-06",
      "headline": "Mohammed Siraj has matured into a genuine match-winner for India: Moeen AliFormer all-rounder Moeen Ali has lavished praise on Mohammed Siraj following the fast bowler's heroic performance in India's thrilling six-run victory over England in the final Test at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-impact-sachin-tendulkar-2767290-2025-08-06",
      "headline": "Sachin Tendulkar sends message to Jasprit Bumrah trolls after England Tests showIndia vs England: Sachin Tendulkar dismissed claims questioning Jasprit Bumrah's match-winning ability, stating that India's Test victories in England without their pace spearhead were merely coincidental. Bumrah featured in three Tests and picked up 14 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/montreal-open-clara-tauson-madison-keys-grandfather-2767285-2025-08-06",
      "headline": "In tears, Clara Tauson dedicates shock win in Montreal to late grandfatherMontreal Open 2025: Clara Tauson broke down after beating reigning Australian Open champion Madison Keys in straight sets, dedicating the win to her late grandfather. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-salary-hike-central-contract-2767241-2025-08-06",
      "headline": "Pakistan Women rewarded with massive salary hike in central contractThe Pakistan Cricket Board has given a 50 per cent salary raise to the 20 women's cricketers in the central contracts for the 2025-26 season. Left-arm spinner Sadia Iqbal has been promoted to Category A. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}