{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-karnataka-chief-minister-siddaramaiah-mysore-during-peddi-film-shoot-2779680-2025-08-31",
      "headline": "Ram Charan meets Siddaramaiah in Mysore during Peddi shootActor Ram Charan met Karnataka Chief Minister Siddaramaiah in Mysore on Sunday. The photos of their meeting were shared by Siddaramaiah on X. The actor is currently shooting for his upcoming film 'Peddi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/adil-hussain-meets-james-bond-actor-mads-mikkelson-venice-film-festival-praises-humility-2779648-2025-08-31",
      "headline": "Adil Hussain meets James Bond actor Mads Mikkelson in Venice, praises his humilityActor Adil Hussain met Hollywood star Mads Mikkelson at the Venice International Film Festival. The encounter highlights growing global connections in cinema and actor camaraderie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-jitendra-kumar-team-up-upcoming-project-viral-video-2779652-2025-08-31",
      "headline": "Ranbir Kapoor and Jitendra Kumar team up for upcoming project. Video goes viralActors Ranbir Kapoor and Jitendra Kumar are collaborating on an upcoming project. On Sunday, a behind-the-scenes video of the sets surfaced on social media. The video shows both actors dressed in ethnic outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-nargis-fakhri-tony-beig-wedding-viral-video-mumbai-event-2779630-2025-08-31",
      "headline": "Did Farah Khan confirm Nargis Fakhri and Tony Beig's wedding in viral video?Actor Nargis Fakhri made her first appearance with her husband Tony Beig on Sunday. At the event, director Farah Khan referred to Nargis as Tony's wife. The video from the event is now going viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/prem-sagar-ramananad-sagars-son-dies-at-84-arun-govil-sunil-lahiri-mourn-loss-2779619-2025-08-31",
      "headline": "Prem Sagar, Ramananad Sagar's son, dies at 84. Arun Govil, Sunil Lahiri mourn lossIndian film producer and 'Ramayan' director Ramanand Sagar's son Prem Sagar died at the age of 84. Actors Arun Govil and Sunil Lahiri paid their heartfelt tributes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/param-sundari-box-office-collection-sidharth-malhotra-janhvi-kapoor-2779519-2025-08-31",
      "headline": "Param Sundari box office Day 2: Sidharth-Janhvi film sees growth, earns Rs 16 crore'Param Sundari', featuring actors Sidharth Malhotra and Janhvi Kapoor, witnessed decent growth on its second day after a modest box office opening. The film was released on August 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sona-mohapatra-slams-people-defending-lollapalooza-over-lack-of-indian-artistes-2779571-2025-08-31",
      "headline": "Sona Mohapatra slams people defending Lollapalooza over lack of Indian artistesIndian singer Sona Mohapatra responded to criticism over her comments on the Lollapalooza India 2026 line-up. She called for more representation of local artistes and slammed the notion that only international acts can draw large crowds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-visits-allu-arjun-home-offers-condolences-on-grandmother-death-2779542-2025-08-31",
      "headline": "Pawan Kalyan visits Allu Arjun's home to offer condolences on grandmother's deathActor-politician Pawan Kalyan recently visited Allu Aravind, Allu Arjun's residence to offer condolences on Allu Kanakaratnam's death. The 94-year-old was Allu Aravind's mother and Allu Arjun's grandmother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-fourth-film-vishal-bharadwaj-tripti-dimri-nana-patekar-avinash-tiwary-disha-patani-farida-jalal-2779551-2025-08-31",
      "headline": "Shahid Kapoor wraps 4th film with Vishal Bhardwaj: This one's super specialActor Shahid Kapoor will next be seen in Vishal Bharadwaj's untitled film. He recently announced the wrap up of the film's shooting on Sunday on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-ganesha-chaturthi-celebration-family-watch-video-2779523-2025-08-31",
      "headline": "Kapil Sharma bids goodbye to Ganesha in festive fervour with family. WatchComedian-actor Kapil Sharma shared a video capturing his family's Ganesh Chaturthi celebrations. The video highlighted his family offering prayers to Lord Ganesha, him dancing on the dhol, and the immersion of the deity's idol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhojpuri-actor-pawan-singh-apologises-to-anjali-raghav-for-touching-her-inappropriately-2779493-2025-08-31",
      "headline": "Actor Pawan Singh apologises to Anjali Raghav for touching her inappropriatelyBhojpuri actor Pawan Singh has apologised to his co-star Anjali Raghav after she accused him of inappropriately touching her without consent. Singh's reaction came after Raghav shared her decision to quit the Bhojpuri industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-salman-schools-contestants-tanya-mittal-in-tears-2779491-2025-08-31",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Salman schools contestants, Tanya Mittal in tearsActor Salman Khan warned Tanya Mittal about being a soft target of Pranit More on the 'Weekend Ka Vaar' episode of 'Bigg Boss 19' on Saturday. This led Tanya to break down in tears. The episode also featured romantic moments between Mridul Tiwari and Natalia Janoszek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/mahesh-babu-takes-trip-down-memory-lane-on-son-gautam-19th-birthday-2779485-2025-08-31",
      "headline": "Mahesh Babu takes trip down memory lane on son Gautam's 19th birthday. See picActor Mahesh Babu shared an adorable throwback photo on the occasion of his son Gautam's 19th birthday. He also expressed his regret at missing his birthday this year, saying it was the only one he has ever missed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pavitra-rishta-actor-priya-marathe-dies-at-38-after-battling-cancer-2779460-2025-08-31",
      "headline": "Pavitra Rishta actor Priya Marathe dies at 38 after battling cancerActor Priya Marathe, known for her work in 'Pavitra Rishta', died in Mumbai on August 31, 2025, after her prolonged battle with cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-fulfils-late-mother-in-law-kanakaratnam-wish-of-donating-her-eyes-2779382-2025-08-31",
      "headline": "Chiranjeevi fulfils late mother-in-law Kanakaratnam's wish of donating her eyesActor Chiranjeevi fulfilled his late mother-in-law Allu Kanararatnam's last wish by donating her eyes following her death on Saturday. Allu Kanararatnam was legendary Telugu actor, Padma Shri Allu Ramalingaiah's wife and Allu Arjun, Ram Charan's grandmother. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-denies-subpoenaing-journalist-megyn-kelly-justin-baldoni-case-2779417-2025-08-31",
      "headline": "Blake Lively denies subpoenaing journalist Megyn Kelly in Justin Baldoni caseActor Blake Lively has denied subpoenaing journalist Megyn Kelly. Kelly had accused Lively of a subpoena in connection to the Justin Baldoni case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranvir-shorey-recalls-rejecting-tiger-zinda-hai-returning-for-tiger-3-out-of-anger-2779238-2025-08-30",
      "headline": "Ranvir Shorey recalls rejecting Tiger Zinda Hai, returning for Tiger 3 out of angerActor Ranvir Shorey shared that he skipped 'Tiger Zinda Hai' because of payment issues. He also recalled that despite not liking his character's portrayal in 'Tiger 3', he agreed to be part of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exclusive-kunickaa-sadanand-shuts-down-age-shaming-bigg-boss-19-calls-irrelevant-2779020-2025-08-30",
      "headline": "Kunickaa Sadanand shuts-down age-shaming on Bigg Boss 19, calls it irrelevantActor Kunickaa Sadanand recently reflected on her decision to participate in 'Bigg Boss 19', in an exclusive interview with India Today. She also shared her views on host Salman Khan's work-ethic and charisma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-do-patti-song-raanjhan-sachet-parampara-kmkz-plagiarism-claims-2779310-2025-08-30",
      "headline": "Music duo Sachet-Parampara to sue KMKZ over plagiarism claims on Raanjhan songMusic composer duo Sachet-Parampara rubbished claims of plagiarism over the 'Do Patti' song 'Raanjhan' on Sunday. They plan to sue KMKZ for defamation. They also said in a recent interview that their authorship of 'Raanjhan' has been verified by major streaming platforms."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-discussed-cross-border-terrorism-with-xi-secured-chinas-understanding-on-need-for-joint-fight-government-2779695-2025-08-31",
      "headline": "PM, Xi discussed cross-border terror, China extended support to India: GovernmentForeign Secretary Vikram Misri said the Chinese side extended their support to India while briefing reporters in Tianjin on the sidelines of the Shanghai Cooperation Organisation (SCO) Summit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cautious-handshake-pm-modi-xi-jinping-meeting-sco-india-china-common-ground-reset-trump-tariffs-2779654-2025-08-31",
      "headline": "A cautious handshake: PM, Xi meet to bring India, China on common groundDelhi is facing the sting of Trump's rebuke and higher tariffs. China, too, is under the threat of sky-high levies. Against this backdrop, the Modi-Xi handshake looked less like triumphal diplomacy and more like pragmatic rapprochement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/panchsheel-principles-of-peaceful-coexistence-must-be-cherished-promoted-jinping-2779722-2025-08-31",
      "headline": "Panchsheel must be cherished: Xi invokes India-China peace doctrine after meeting PMThe Agreement on Trade and Intercourse with the Tibet Region introduced the Five Principles of Peaceful Coexistence that would have formulated a framework for both countries to take their relationship forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/first-pic-of-sco-summit-in-tianjin-prime-minister-narendra-modi-in-front-row-putin-stands-right-next-to-chinas-xi-jinping-2779624-2025-08-31",
      "headline": "SCO family's first pic: PM Modi in front row, Putin right next to Xi JinpingXi Jinping and his wife, Peng Liyuan, hosted a banquet in Tianjin to welcome international guests ahead of the 25th edition of the annual summit being held there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/meet-xiao-he-robot-at-seo-summit-answers-questions-on-india-china-ties-2779708-2025-08-31",
      "headline": "Meet Xiao He: Robot at SEO Summit answers questions on India-China tiesIndia Today's Gaurav Sawant, who is in China for the Shanghai Cooperation Organisation (SCO) summit in Tianjin, interacted with Chinese robots on display. The robots were answering questions and performing tasks through the use of Artificial Intelligence and Robotic technology. The robots were asked questions about the ongoing SCO summit to which they answered questions flawlessly, displaying immense technological advancement. Robots on the display were also seen performing several tasks at the summit venue.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-march-against-immigration-indians-targeted-more-indians-in-5-years-than-greeksand-italians-in-100-2779585-2025-08-31",
      "headline": "More Indians in 5 years...: Thousands in Australia march against immigrationA pre-event Facebook post carrying the promotional material also singled out Indians, whose numbers doubled from 2013 to 2023 to reach about 845,800, according to census data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-xi-jinping-as-india-china-reset-ties-amid-trumps-tariff-barrage-2779433-2025-08-31",
      "headline": "Elephant and Dragon unite, PM Modi-Xi send message to Trump amid tariff stormPrime Minister Narendra Modi met Chinese President Xi Jinping for bilateral talks on the sidelines of the SCO summit in Tianjin, seeking to recalibrate ties amid the tariff barrage unleashed by Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/lollipop-linguistic-terror-how-mamata-is-upping-the-rhetoric-against-bjp-ec-2779164-2025-08-30",
      "headline": "'Lollipop, linguistic terror': How Mamata is upping the rhetoric against BJP, ECThe escalating face-off between the Trinamool Congress and BJP indicates how the 2026 Bengal polls could become a referendum not only on governance but identity and federal authority"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/nikki-bhati-dowry-case-greater-noida-news-viral-reel-making-family-society-instagram-reels-women-violence-patriarchy-2778950-2025-08-31",
      "headline": "How women with risqué content have India reelingSocial media shorts and Instagram Reels are creating dangerous friction in Indian society. The technology of the 21st century is clashing with the mores of a society still in the 19th century. While men opt for risky, women are getting into risque and vulgar content in an economy where eyeballs convert to hard cash. The Nikki Bhati case is just the tip of the iceberg. Here's how Indian society is reeling from the reel-making tornado."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-8-updates-carlos-alcaraz-novak-djokovic-aryna-sabalenka-2779691-2025-08-31",
      "headline": "Day 8 Live Updates: Lehecha wins 2nd set, Alcaraz vs Rinderknech up nextUS Open 2025 Day 8 Live Updates: Jessica Pegula beat Ann Li to qualify for the quarterfinals. Carlos Alcaraz will be in action in the second match on Centre Court against Arthur Rinderknech. Later in the day, Novak Djokovic, Elena Rybakina, Taylor Fritz and Aryna Sabalenka will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/committed-to-advancing-our-ties-on-mutual-trust-respect-pm-modis-message-to-xi-2779536-2025-08-31",
      "headline": "Committed to advance ties based on trust, respect: PM calls talks with Xi fruitfulPrime Minister Narendra Modi, during his bilateral talk with Chinese President Xi Jinping, emphasised that cooperation between India and China is vital not only for the two nations but also for the welfare of 2.8 billion people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-criticises-modi-handshake-xi-china-hostility-border-tensions-2779530-2025-08-31",
      "headline": "Strict action: Congress jibes at Modi-Xi handshake, all-smiles meetingCongress criticised PM Modi for his warm handshake with Xi Jinping during their bilateral meet. The party alleges Modi is weak against China and prioritising economic ties over national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/urgent-action-bold-innovation-the-race-to-rescue-indias-disappearing-glaciers-2778902-2025-08-31",
      "headline": "The race to rescue India's disappearing glaciersGlaciers across the world are witnessing unprecedented change as the planet becomes warmer and temperatures continue to climb under the influence of human-induced climate change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-china-reset-and-the-promise-of-connectivity-2779437-2025-08-31",
      "headline": "India-China reset and the promise of connectivityIndia's rich trade history is shaping its future ties with China and Asia. Strengthening land connectivity and business investments could transform regional relations and economic growth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/man-arrested-for-killing-wife-mother-in-law-with-scissors-in-delhi-rohini-after-fight-over-sons-birthday-gifts-2779564-2025-08-31",
      "headline": "Delhi man kills wife, mother-in-law with scissors over son's birthday giftThe Delhi Police has arrested a man for allegedly murdering his wife and mother-in-law in Rohini following a quarrel over gifts exchanged during his son's birthday celebration. The victims, identified as Priya Sehgal (34) and her mother Kusum Sinha (63), were found dead on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trumps-decisions-based-on-vendettas-grudges-what-us-political-commentator-rick-sanchez-said-2779681-2025-08-31",
      "headline": "Trump's decisions based on vendettas, grudges? What US political commentator saidRick Sanchez criticised the broader approach of the Trump administration towards India. He called the secondary tariffs \"extremely preposterous in the eyes of most people\" and described them as \"a disrespectful and ignorant policy\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-professor-muqabala-dance-video-goes-viral-wrong-profession-says-internet-2779469-2025-08-31",
      "headline": "Bengaluru professor's Muqabala dance video goes viral. Wrong profession, says InternetIn the video, Professor Pushpa Raj grooves to Prabhu Deva's hit track, 'Muqabala', leaving students cheering him on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/minerva-academy-gothia-cup-european-treble-ranjit-bajaj-exclusive-indian-football-2779438-2025-08-31",
      "headline": "Minerva Academy U-14: How a team from Punjab conquered EuropeMinerva Academy U-14 has rewritten Indian football history, conquering Europe's biggest youth tournaments in a single year. From Gothia Cup to Dana Cup to Norway Cup, these Mohali boys proved preparation, grit, and belief can put India on the global football map."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-spokesperson-and-key-commander-abu-obeida-killed-in-gaza-strike-says-israel-2779679-2025-08-31",
      "headline": "Hamas spokesperson and top commander Abu Obaida killed in Gaza strike, says IsraelPrime Minister Benjamin Netanyahu had earlier confirmed that Israel struck Obaida, the longtime spokesperson of Hamas' Qassam Brigades, though he said it was unclear at the time whether the strike had been fatal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-conducts-high-risk-rescue-of-ndrf-personnel-stuck-on-ravi-river-in-punjab-2779584-2025-08-31",
      "headline": "Watch: Air Force's daring rescue of NDRF personnel stuck in Punjab's Ravi riverThe IAF deployed a Mi-171V helicopter for the mission, which was extremely challenging considering the rough terrain. During the operation, the IAF crew on board the helicopter inserted and extracted NDRF personnel and a Garud commando in the area. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/qs-world-university-rankings-2026-mit-tops-imperial-college-rises-to-second-2779622-2025-08-31",
      "headline": "QS World University rankings 2026: MIT tops, Imperial College rises to secondThe QS World University Rankings 2026 are out, showing the world's top universities and changing the view of higher education.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/supreme-leader-ayatollah-ali-khamenei-strategic-partnership-iran-china-power-to-transform-the-world-2779658-2025-08-31",
      "headline": "Iran, China hold power to transform the world, Khamenei calls for 'strategic partnership'Leaders of Iran and China are expected to discuss a range of global issues at the 25th annual Shanghai Cooperation Organisation (SCO) Summit in the Chinese port city of Tianjin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-japan-asia-cup-2025-hockey-result-super-4s-2779602-2025-08-31",
      "headline": "Asia Cup 2025: Clinical India edge closer to Super 4s with thrilling 3-2 win against JapanAsia Cup 2025: Harmanpreet Singh scored a brace and Mandeep Singh bagged a goal as India fought a late-blooming Japan to clinch a 3-2 win and edge closer to the Super 4s of the Asia Cup 2025. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-ends-partnership-coach-gilles-cervara-us-open-2025-exit-2779725-2025-08-31",
      "headline": "Daniil Medvedev parts ways with longtime coach Gilles Cervara after US Open meltdownDaniil Medvedev has ended his long-standing coaching partnership with Gilles Cervara after a challenging year. The split follows poor Grand Slam performances and a controversial meltdown at the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/northern-superchargers-win-hundred-womens-title-beat-southern-brave-2779724-2025-08-31",
      "headline": "Northern Superchargers hammer Southern Brave to claim maiden titleNorthern Superchargers secured their first Hundred Women's title with a commanding seven-wicket win over Southern Brave. In the final, they chased down a target of 116 with 12 balls to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-smackdown-lyon-sami-zyan-us-title-john-cena-logan-paul-2779723-2025-08-31",
      "headline": "SmackDown in Lyon: John Cena confronts Logan Paul, Sami Zayn wins US TitleSmackDown from Lyon set the stage for Clash in Paris, featuring Logan Paul's promo, Sami Zayn winning the US Championship, chaotic tag matches, and rising rivalries, giving fans high-octane WWE action ahead of Sunday's PPV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pathum-nissanka-century-leads-sri-lanka-to-five-wicket-win-over-zimbabwe-2779707-2025-08-31",
      "headline": "Pathum Nissanka 122 powers Sri Lanka to ODI series win in Harare thrillerSL vs ZIM: Pathum Nissanka scored a commanding 122 to lead Sri Lanka to a thrilling five-wicket win over Zimbabwe, securing a 2-0 series whitewash. The visitors chased down 278 in the last over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brighton-defeat-manchester-city-premier-league-erling-haaland-brajan-gruda-pep-guardiola-2779712-2025-08-31",
      "headline": "Brighton stun Manchester City 2-1 to make problems louder for Pep GuardiolaBrighton stunned Manchester City 2-1 at the Amex Stadium, coming from behind for the second consecutive season, as Haaland scored, Milner converted a penalty, and Gruda's late strike exposed Guardiola's defensive concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/dutch-grand-prix-2025-oscar-piastri-lando-norris-crash-ferrari-lewis-hamilton-charles-leclerc-2779699-2025-08-31",
      "headline": "Oscar Piastri wins Dutch GP, Lando Norris crashes out as title hopes take a hitOscar Piastri claimed a controlled victory at the Dutch Grand Prix while teammate Lando Norris retired due to car issues. The race saw Verstappen finish second and young Isack Hadjar achieve his first Formula 1 podium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-ferrari-crash-dutch-grand-prix-2025-2779694-2025-08-31",
      "headline": "Hamilton's woes continue after Dutch GP crash, suffers first Ferrari race retirementLewis Hamilton crashed out of the Dutch Grand Prix while running seventh. This incident deepens Ferrari's ongoing performance challenges in the 2024 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-8-updates-carlos-alcaraz-novak-djokovic-aryna-sabalenka-2779691-2025-08-31",
      "headline": "Day 8 Live Updates: Lehecha wins 2nd set, Alcaraz vs Rinderknech up nextUS Open 2025 Day 8 Live Updates: Jessica Pegula beat Ann Li to qualify for the quarterfinals. Carlos Alcaraz will be in action in the second match on Centre Court against Arthur Rinderknech. Later in the day, Novak Djokovic, Elena Rybakina, Taylor Fritz and Aryna Sabalenka will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-ayush-badoni-north-zone-central-zone-semi-final-2779687-2025-08-31",
      "headline": "Duleep Trophy: Badoni's unbeaten 204 takes spotlight, North and Central Zones advanceAyush Badoni struck an unbeaten double-century to headline the Duleep Trophy quarter-finals. Both North Zone and Central Zone advanced to the semi-finals after strong performances despite drawn matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-india-world-athletics-championship-team-tokyo-javelin-2779688-2025-08-31",
      "headline": "Neeraj Chopra leads India's 19-member squad for World Athletics ChampionshipsNeeraj Chopra leads a 19-member Indian squad for the World Athletics Championships in Tokyo, aiming for redemption after a narrow Diamond League Final loss, as India sends four men's javelin throwers for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-riyan-parag-india-comeback-east-zone-vs-north-zone-ipl-rajasthan-royals-2779682-2025-08-31",
      "headline": "Riyan Parag eyes India comeback with Duleep Trophy target amid RR shuffleAfter months battling shoulder injuries and workload concerns, Riyan Parag is using the Duleep Trophy as a springboard to regain form and fitness, eyeing domestic dominance, IPL resurgence, and a potential India comeback ahead of a busy cricketing calendar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/lewis-hamilton-ferrari-crash-dutch-grand-prix-2025-2779694-2025-08-31",
      "headline": "Hamilton's woes continue after Dutch GP crash, suffers first Ferrari race retirementLewis Hamilton crashed out of the Dutch Grand Prix while running seventh. This incident deepens Ferrari's ongoing performance challenges in the 2024 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-8-updates-carlos-alcaraz-novak-djokovic-aryna-sabalenka-2779691-2025-08-31",
      "headline": "Day 8 Live Updates: Lehecha wins 2nd set, Alcaraz vs Rinderknech up nextUS Open 2025 Day 8 Live Updates: Jessica Pegula beat Ann Li to qualify for the quarterfinals. Carlos Alcaraz will be in action in the second match on Centre Court against Arthur Rinderknech. Later in the day, Novak Djokovic, Elena Rybakina, Taylor Fritz and Aryna Sabalenka will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-ayush-badoni-north-zone-central-zone-semi-final-2779687-2025-08-31",
      "headline": "Duleep Trophy: Badoni's unbeaten 204 takes spotlight, North and Central Zones advanceAyush Badoni struck an unbeaten double-century to headline the Duleep Trophy quarter-finals. Both North Zone and Central Zone advanced to the semi-finals after strong performances despite drawn matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-india-world-athletics-championship-team-tokyo-javelin-2779688-2025-08-31",
      "headline": "Neeraj Chopra leads India's 19-member squad for World Athletics ChampionshipsNeeraj Chopra leads a 19-member Indian squad for the World Athletics Championships in Tokyo, aiming for redemption after a narrow Diamond League Final loss, as India sends four men's javelin throwers for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-riyan-parag-india-comeback-east-zone-vs-north-zone-ipl-rajasthan-royals-2779682-2025-08-31",
      "headline": "Riyan Parag eyes India comeback with Duleep Trophy target amid RR shuffleAfter months battling shoulder injuries and workload concerns, Riyan Parag is using the Duleep Trophy as a springboard to regain form and fitness, eyeing domestic dominance, IPL resurgence, and a potential India comeback ahead of a busy cricketing calendar."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}