{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-close-slightly-higher-bajaj-housing-finance-shines-on-debut-2600658-2024-09-16",
      "headline": "Sensex, Nifty close slightly higher; Bajaj Housing Finance shines on debutThe S&P BSE Sensex ended the trading session 97.84 points higher at 82,988.78, while the NSE Nifty50 rose 27.25 points to settle at 25,383.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-withdraws-external-influence-claims-after-talks-with-employees-madhabi-puri-buch-2600643-2024-09-16",
      "headline": "Sebi withdraws statement blaming external elements for staff protestsJust under two weeks ago, Sebi had issued a statement suggesting that external forces were behind the unrest among its staff, which was seen as an attempt to discredit the organisation and its leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-listing-bonanza-missed-alternate-options-experts-explained-2600641-2024-09-16",
      "headline": "Missed Bajaj Housing Finance listing day rally? Check these alternate optionsBajaj Housing Finance bumper listing: By the end of the trading session, the company's stock price stood at Rs 164.99, marking a significant increase over its IPO issue price. But for those who missed out on the listing day windfall, what are the next steps?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oberoi-inheritance-war-siblings-clash-over-late-prs-oberois-will-vikramjit-natasha-arjun-anastasia-2600606-2024-09-16",
      "headline": "Oberoi inheritance war: Siblings clash over late PRS Oberoi's willOn one side are Vikramjit Oberoi, Natasha Oberoi, and Arjun Oberoi. On the other side is Anastasia Oberoi, PRS Oberoi's daughter from his second marriage to Mirjana Jojic Oberoi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-upper-circuit-bumper-listing-what-next-investor-trading-strategy-2600532-2024-09-16",
      "headline": "Bajaj Housing Finance shares hit upper circuit after bumper listing: What's next?Bajaj Housing Finance listing: By midday, the shares hit an upper circuit at Rs 164.99, representing an overall premium of 135.70% over the IPO price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mf-radhika-gupta-ceo-does-not-own-luxury-cars-depreciating-asset-owns-innova-2600494-2024-09-16",
      "headline": "'Can afford, but won't buy': Edelweiss MF CEO on not owning luxury carsEdelweiss MF Radhika Gupta CEO currently owns an Innova, which is known for its practicality and reliability rather than for being a luxury car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/branch-manager-to-ceo-how-atul-jain-transformed-bajaj-housing-finance-2600465-2024-09-16",
      "headline": "From branch manager to CEO: How Atul Jain transformed Bajaj Housing FinanceAtul Jain, now 52, has been with the Bajaj Group for over two decades. He began his career in investment banking, working as a project executive at PNB Capital Services Limited and later at Prudential Capital Markets Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-bumper-listing-multibagger-gains-gmp-what-should-investors-do-2600452-2024-09-16",
      "headline": "Bajaj Housing Finance shares list at 114% premium. What should investors do? With Bajaj Housing Finance shares debuting at a staggering 114% premium, investors face a pivotal choice: lock in profits now or stay the course for potential long-term rewards. Find out what experts suggest for your next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kross-shares-list-flat-on-dalal-street-rs-240-book-profit-or-hold-expert-view-2600424-2024-09-16",
      "headline": "Kross shares list flat on D-Street: Should you book profit or hold? Kross listing: Shares of Kross made a flat debut opening at Rs 240 on NSE and BSE, the same as its IPO price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-market-listing-blockbuster-debut-114-percent-premium-book-profit-or-hold-2600411-2024-09-16",
      "headline": "Bajaj Housing Finance turns multibagger on listing: Book profits or hold?Bajaj Housing Finance IPO listing: With this blockbuster entry on Dalal Street, the key dilemma for investors is now whether to book profits immediately or hold onto their positions for long-term gains.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-rally-as-fed-rate-cut-looms-markets-stay-bullish-bajaj-housing-finance-debut-2600405-2024-09-16",
      "headline": "Sensex, Nifty rally as Fed rate cut looms; markets stay bullishThe S&P BSE Sensex added 169.53 points to 83,060.47, while the NSE Nifty50 gained 62.55 points to 25,419.05"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-list-at-114-premium-over-ipo-price-at-rs-150-2600399-2024-09-16",
      "headline": "Bajaj Housing Finance makes bumper debut as shares list at 114% premiumBajaj Housing Finance listing: The shares were allocated to successful bidders on September 13, and the listing gains of Rs 80 per share slightly exceeded the grey market premium (GMP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-september-16-2024-precious-metals-record-hike-on-mcx-2600384-2024-09-16",
      "headline": "Gold, silver price today, September 16, 2024: Precious metals record hike on MCXGold Price Today September 16, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-and-major-smartphone-brands-samsung-xiaomi-motorola-face-antitrust-heat-report-2600139-2024-09-15",
      "headline": "Amazon, Flipkart and major smartphone brands face antitrust heat: ReportThe Competition Commission of India (CCI) has found that these companies have been involved in exclusive product launches on their platforms, which may have restricted competition and harmed smaller businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rent-vs-buy-expert-views-smarter-financial-move-for-you-2599981-2024-09-15",
      "headline": "Rent vs buy: What's the smarter financial move for you?Renting offers the freedom to move, explore career opportunities, and invest in other ventures. Buying a home, on the other hand, offers long-term security, a sense of ownership, and equity building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-approves-madhya-pradeshs-request-for-soybean-procurement-at-msp-2599830-2024-09-14",
      "headline": "Centre approves Madhya Pradesh's request for soybean procurement at MSPUnion Agriculture and Farmer Welfare Minister Shivraj Singh Chouhan confirmed that the proposal from the Madhya Pradesh government was received and approved late Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-export-price-limit-basmati-rice-onion-outbound-shipments-and-enhance-farmers-income-2599748-2024-09-14",
      "headline": "Centre lifts minimum export price cap on onion, basmati riceThe $950 per tonne minimum export price for basmati rice has been removed while the export duty on onion has been cut to 20 per cent from 40 per cent, in effect from September 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-expected-listing-gains-double-investors-wealth-latest-gmp-2599745-2024-09-14",
      "headline": "Bajaj Housing Finance IPO: Will it double investors' wealth on market debut?Bajaj Housing Finance IPO listing: With the GMP indicating a significant upside, all eyes are now on whether the shares will live up to the hype and deliver the bumper listing gains many expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-2024-trump-allies-plan-to-privatise-fannie-and-freddie-says-report-2599379-2024-09-13",
      "headline": "Trump allies plan to privatise Fannie and Freddie, says reportThe discussions involve prominent figures close to Trump, including Larry Kudlow, the former director of the National Economic Council, and John McEntee, who previously worked in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-dhaval-address-conflict-of-interest-charges-3-big-clarifications-joint-statemet-2599223-2024-09-13",
      "headline": "Sebi chief addresses conflict of interest allegations with 3 big clarificationsThe Buchs firmly denied any wrongdoing, offering detailed explanations to counter allegations tied to consulting roles, rental income, and Madhabi Puri Buch's ICICI Bank stock options."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-chief-minister-mamata-banerjee-invites-protesting-doctors-meeting-deadlock-kolkata-2600473-2024-09-16",
      "headline": "Protesting doctors agree to meet after Mamata Banerjee's 'fifth and final' inviteMamata Banerjee's fifth invite to the protesting junior doctors came two days after previous discussions failed to materialise due to disagreement over live-streaming of the meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manish-sisodia-arvind-kejriwal-meeting-residence-today-resignation-announcement-next-delhi-chief-minister-buzz-2600409-2024-09-16",
      "headline": "Arvind Kejriwal may resign tomorrow, seeks time to meet Lt Governor: SourcesArvind Kejriwal dropped a bombshell on Sunday, announcing that he would resign as the Delhi Chief Minister in the next two days. His announcement came days after he was granted bail by the Supreme Court in liquor policy case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-kamala-harris-joe-biden-donald-trump-assassination-attempt-backlash-post-2600692-2024-09-16",
      "headline": "Elon Musk deletes 'no one trying to assassinate Biden/Kamala' post after backlashElon Musk deleted a controversial post on why there were \"no\" attempts to kill US President Joe Biden and Vice President Kamala Harris after a row over President Donald Trump's 'second assassination attempt'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-india-4-1-south-korea-semifinal-harmanpreet-singh-2600704-2024-09-16",
      "headline": "Asian Champions Trophy hockey: Dominant India beat Korea to set up final vs ChinaAsian Champions Trophy: A brace from Harmanpreet Singh and goals from Uttam Singh and Jermanpreet Singh helped India hammer South Korea 4-1 in the semi-final. The four-time champions will take on hosts China in the big final on Tuesday, September 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-resignation-delhi-cm-news-political-sixer-five-big-reasons-aam-aadmi-party-aap-delhi-assembly-election-2600535-2024-09-16",
      "headline": "Kejriwal's move to resign is a political sixer. 5 big reasons whyArvind Kejriwal's decision to resign as the Chief Minister of Delhi is a calculated political move. From removing the corruption taint to beating anti-incumbency to gaining from the anti-BJP momentum in the Opposition camp, here are five big reasons why this is Kejriwal's political sixer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-student-drowns-toronto-lake-swimming-brother-birthday-friends-canada-police-2600651-2024-09-16",
      "headline": "Hyderabad student drowns in Canada lake during brother's birthday celebrationA Master's student from Hyderabad drowned in a lake while swimming when he was celebrating his brother's birthday with his friends in Toronto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shiv-sena-mla-sanjay-gaikwad-rs-11-lakh-rahul-gandhi-tongue-reservation-2600694-2024-09-16",
      "headline": "Shinde Sena MLA announces bounty to 'chop off Rahul Gandhi's tongue', sparks rowSanjay Gaikwad, who is a member of the Eknath Shinde-led Shiv Sena faction, said he would reward Rs 11 lakh to whoever chops off Rahul Gandhi's tongue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-donald-trump-assassination-attempt-secret-service-ryan-wesley-routh-2600575-2024-09-16",
      "headline": "Donald Trump was about to putt when Secret Service noticed muzzle of rifleAs Trump lined up his shot at his West Palm Beach club on Monday, the Secret Service caught something unusual: the muzzle of a rifle barrel poking through the bushes near the fence line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-shares-new-wedding-photos-with-husband-siddharth-from-house-library-2600519-2024-09-16",
      "headline": "Aditi Rao Hydari shares new wedding photos with husband Siddharth from house libraryActors Aditi Rao Hydari and Siddharth tied the knot at a temple recently. After announcing their wedding in a social media post, the couple shared a set of new photos highlighting their beautiful chemistry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-withdraws-external-influence-claims-after-talks-with-employees-madhabi-puri-buch-2600643-2024-09-16",
      "headline": "Sebi withdraws statement blaming external elements for staff protestsJust under two weeks ago, Sebi had issued a statement suggesting that external forces were behind the unrest among its staff, which was seen as an attempt to discredit the organisation and its leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/chennai-kancheepuram-samsung-electronics-factory-workers-protest-police-detained-union-2600666-2024-09-16",
      "headline": "104 workers from Samsung's Chennai factory detained for planning protest marchAt least 1,000 workers out of the 1,800 workers employed at the factory have been protesting in makeshift tents near the factory since last week, demanding higher wages and better working conditions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oberoi-inheritance-war-siblings-clash-over-late-prs-oberois-will-vikramjit-natasha-arjun-anastasia-2600606-2024-09-16",
      "headline": "Oberoi inheritance war: Siblings clash over late PRS Oberoi's willOn one side are Vikramjit Oberoi, Natasha Oberoi, and Arjun Oberoi. On the other side is Anastasia Oberoi, PRS Oberoi's daughter from his second marriage to Mirjana Jojic Oberoi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-wins-best-actress-at-siima-2024-aaradhya-takes-pics-of-mom-on-stage-2600363-2024-09-16",
      "headline": "Aishwarya Rai wins Best Actress at SIIMA 2024, Aaradhya turns photographerAishwarya Rai Bachchan and daughter Aaradhya Bachchan wore blingy outfits at SIIMA 2024, held in Dubai. The actor won the Critics award for her performance as Nandini in Ponniyin Selvan: Part 2. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-suspend-polio-vaccination-campaigns-in-afghanistan-united-nation-2600645-2024-09-16",
      "headline": "Taliban have suspended polio vaccination campaigns in Afghanistan: UNAfghanistan is one of two countries in which the spread of the potentially fatal, paralysing disease has never been stopped. The other is Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-hockey-on-field-fight-video-2600583-2024-09-16",
      "headline": "Watch: Heated moments in close India vs Pakistan hockey thriller in ChinaAsian Champions Trophy Hockey: India and Pakistan produced a thriller in their final round-robin game. Tempers flared in the final quarter of the match on Saturday before India clinched a 2-1 victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/shogun-star-anna-sawai-becomes-first-asian-woman-to-win-best-actress-emmy-2600544-2024-09-16",
      "headline": "Shogun star Anna Sawai becomes first Asian woman to win Best Actress EmmyAnna Sawai won the Emmy for Best Actress in a Drama for her role in Shogun, making her the first actor of Asian descent to achieve this honour. She expressed gratitude to her cast and crew, especially co-star Hiroyuki Sanada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-akash-deep-signed-bat-india-bangladesh-test-series-2600685-2024-09-16",
      "headline": "Virat Kohli gifts signed bat to Akash Deep, India pacer over the moonDuleep Trophy: Akash Deep was excited after Virat Kohli gave him an autographed bat before India's Test series against Bangladesh, starting September 19. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-donald-trump-assassination-attempt-ryan-wesley-routh-gunman-ak-47-rifle-fbi-2600349-2024-09-16",
      "headline": "Who is Ryan Routh, Ukraine supporter arrested for shooting at Trump in FloridaThe alleged gunman, whom authorities have identified as 58-year-old Ryan Wesley Routh, earlier on social media stated that \"democracy is on the ballot\" this year and \"we cannot lose.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/polaris-dawn-mission-complete-what-did-the-spacex-astronauts-achieve-2600560-2024-09-16",
      "headline": "Polaris Dawn mission: All that the SpaceX astronauts achievedThe Crew Dragon spacecraft splashed down in the Gulf of Mexico near Florida's Dry Tortugas in the predawn darkness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ios-18-to-start-rolling-out-today-here-is-what-you-should-do-before-installing-2600366-2024-09-16",
      "headline": "iOS 18 to start rolling out today: Here is what you should do before installingiOS 18 is all set to come to India today. Here is how you can prepare your device for the installation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-earth-mars-transfer-window-october-2024-spacex-starship-red-planet-nasa-isro-2600637-2024-09-16",
      "headline": "Planning to go to Mars? A window is opening up in OctoberAn Earth-Mars transfer window will open up in October 2024 as the two planets move in their orbits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-second-assassination-attempt-ryan-wesley-routh-ak-47-rifle-west-palm-golf-course-florida-us-presidential-elections-2600572-2024-09-16",
      "headline": "Donald Trump assassination attempt: What we know so farDonald Trump golf club shooting: Former U.S. President and Republican candidate Donald Trump was rushed to safety following an assassination attempt at his West Palm Beach golf course. The gunman, identified as 58-year-old Ryan Wesley Routh, was spotted by Secret Service agents and later arrested. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-kremlin-russia-comments-on-trump-shooter-alleged-ukrainian-links-2600654-2024-09-16",
      "headline": "Playing with fire...: Russia on Trump shooter with Ukrainian linksThe Kremlin spokesperson noted that \"playing with fire\" had consequences, while adding that the US intelligence services should be fielded questions about the assassination, not him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mamaearth-co-founder-ghazal-alagh-shares-her-secrets-to-cope-with-stress-2600693-2024-09-16",
      "headline": "Mamaearth co-founder Ghazal Alagh shares her secrets to cope with stressMamaearth co-founder Ghazal Alagh opened up about her experience with stress-induced cravings and shared her secret to cope with it in a healthy manner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telangana-cm-relief-fund-chiranjeevi-ram-charan-donation-flood-2600721-2024-09-16",
      "headline": "Tollywood actors Chiranjeevi, Ali, others extend support to Telangana Chief Minister Relief FundSeveral prominent figures from the Telugu film industry, including actors Chiranjeevi, Ali and Vishwak Sen, have contributed to the Chief Minister's Relief Fund (CMRF) of Telangana to support welfare and relief efforts following recent flood. They personally handed over the cheques to Chief Minister Revanth Reddy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/soaps/story/anupamaa-madalsa-sharma-who-played-kavya-quits-rupali-ganguly-show-2600708-2024-09-16",
      "headline": "Anupamaa: Madalsa Sharma, who played Kavya, quits Rupali Ganguly's showActor Madalsa Sharma, who played Kavya in Anupamaa, has quit the show, citing a lack of spark in her character. This follows Sudhanshu Pandey's recent departure. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-gupta-visfot-director-less-audience-in-theatres-exclusive-2600701-2024-09-16",
      "headline": "Kaante director Sanjay Gupta: Theatres empty due to lack of good filmmakersFilmmaker Sanjay Gupta discusses the decline of theatrical footfalls and rise of OTT content in an exclusive interview with India Today. His recent film, Visfot, was released on JioCinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-can-survive-on-tandoori-chicken-and-coffee-forever-aanand-l-rai-2600690-2024-09-16",
      "headline": "Shah Rukh Khan can survive on tandoori chicken and coffee forever: Aanand L RaiFilm director Aanand L Rai revealed that Shah Rukh Khan could live on tandoori chicken and coffee forever. He also praised Akshay Kumar's love for adding \"masala\" to life and work. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-asia-cup-harshitha-samarawickrama-icc-womens-player-of-the-month-award-2600711-2024-09-16",
      "headline": "Sri Lanka's Asia Cup hero wins ICC Women's Player of the Month award Sri Lanka's Harshitha Samarawickrama won the ICC Women's Player of the Month award for August after beating Ireland's Orla Prendergast and Gaby Lewis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-india-4-1-south-korea-semifinal-harmanpreet-singh-2600704-2024-09-16",
      "headline": "Asian Champions Trophy hockey: Dominant India beat Korea to set up final vs ChinaAsian Champions Trophy: A brace from Harmanpreet Singh and goals from Uttam Singh and Jermanpreet Singh helped India hammer South Korea 4-1 in the semi-final. The four-time champions will take on hosts China in the big final on Tuesday, September 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shikhar-dhawan-back-in-the-nets-trains-hard-for-legends-league-cricket-2600698-2024-09-16",
      "headline": "Watch: Shikhar Dhawan back in the nets, trains hard for Legends League CricketIt has not even been a month since Shikhar Dhawan announced his retirement from international cricket, he has already hit the nets. Dhawan will take part in the Legends Cricket League with Gujarat Greats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahli-beardman-called-up-to-australia-squad-for-england-odis-2600686-2024-09-16",
      "headline": "U19 World Cup hero Mahli Beardman called up to Australia squad for England ODIsThe U19 World Cup final hero Mahli Beardman was awarded his maiden international call-up for Australia for their ODI series against England. Beardman earned a surprise maiden international call-up to the Australia ODI squad for the England series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-akash-deep-signed-bat-india-bangladesh-test-series-2600685-2024-09-16",
      "headline": "Virat Kohli gifts signed bat to Akash Deep, India pacer over the moonDuleep Trophy: Akash Deep was excited after Virat Kohli gave him an autographed bat before India's Test series against Bangladesh, starting September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-faces-jasprit-bumrah-and-r-ashwin-in-nets-ahead-of-bangladesh-series-2600664-2024-09-16",
      "headline": "Virat Kohli faces Jasprit Bumrah and R Ashwin in nets ahead of Bangladesh seriesVirat Kohli faced Jasprit Bumrah and Ravichandran Ashwin in the nets at Chepauk Stadium.  The first Test match between India and Bangladesh will begin from September 19 in Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/china-vs-pakistan-asian-champions-trophy-hockey-shock-loss-2600663-2024-09-16",
      "headline": "China shock Pakistan to reach maiden final at Asian Champions Trophy hockeyAsian Champions Trophy hockey: Hosts China progressed to the final of the tournament for the first time in history after stunning three-time champions Pakistan in the semi-final. Pakistan paid the price for a poor penalty shootout in Hulunbuir on Monday, September 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-ian-botham-kapil-dev-record-bangladesh-india-test-series-2600647-2024-09-16",
      "headline": "Shakib Al Hasan eyes Botham, Kapil Dev's huge all-round Test record IND vs BAN: Shakib Al Hasan will look to achieve a major record when Bangladesh and India lock horns in the two-match Test series from September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-in-greater-noida-paved-way-for-hallway-test-cricket-for-new-zealand-stars-2600622-2024-09-16",
      "headline": "Rain in Greater Noida paved way for hallway Test cricket for New Zealand starsRachin Ravindra revealed that the New Zealand team kept themselves entertained by playing a Test series in the corridors of their team hotel in Greater Noida. The one-off Test between Afghanistan and New Zealand was abandoned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-south-korea-semifinal-live-score-asian-champions-trophy-hulunbuir-2600617-2024-09-16",
      "headline": "Asian Champions Trophy semi-final: India beat Korea 4-1, reach finalIndia vs South Korea hockey Highlights, Asian Champions Trophy 2024: India beat South Korea 4-1 in the semi-final in Hulunbuir in China. Harmanpreet, Jarmampreet and Uttam scored against South Korea. India will face China in the final of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lankas-wellalage-samarawickrama-crowned-icc-players-of-the-month-for-august-2600610-2024-09-16",
      "headline": "Dunith Wellalage crowned ICC Men's Player of the Month for August 2024The International Cricket Council (ICC) announced Sri Lanka players Dunith Wellalage and Harshitha Samarawickrama as the ICC Players of the Month for August 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/china-vs-pakistan-asian-champions-trophy-hockey-shock-loss-2600663-2024-09-16",
      "headline": "China shock Pakistan to reach maiden final at Asian Champions Trophy hockeyAsian Champions Trophy hockey: Hosts China progressed to the final of the tournament for the first time in history after stunning three-time champions Pakistan in the semi-final. Pakistan paid the price for a poor penalty shootout in Hulunbuir on Monday, September 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-ian-botham-kapil-dev-record-bangladesh-india-test-series-2600647-2024-09-16",
      "headline": "Shakib Al Hasan eyes Botham, Kapil Dev's huge all-round Test record IND vs BAN: Shakib Al Hasan will look to achieve a major record when Bangladesh and India lock horns in the two-match Test series from September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-in-greater-noida-paved-way-for-hallway-test-cricket-for-new-zealand-stars-2600622-2024-09-16",
      "headline": "Rain in Greater Noida paved way for hallway Test cricket for New Zealand starsRachin Ravindra revealed that the New Zealand team kept themselves entertained by playing a Test series in the corridors of their team hotel in Greater Noida. The one-off Test between Afghanistan and New Zealand was abandoned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-south-korea-semifinal-live-score-asian-champions-trophy-hulunbuir-2600617-2024-09-16",
      "headline": "Asian Champions Trophy semi-final: India beat Korea 4-1, reach finalIndia vs South Korea hockey Highlights, Asian Champions Trophy 2024: India beat South Korea 4-1 in the semi-final in Hulunbuir in China. Harmanpreet, Jarmampreet and Uttam scored against South Korea. India will face China in the final of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lankas-wellalage-samarawickrama-crowned-icc-players-of-the-month-for-august-2600610-2024-09-16",
      "headline": "Dunith Wellalage crowned ICC Men's Player of the Month for August 2024The International Cricket Council (ICC) announced Sri Lanka players Dunith Wellalage and Harshitha Samarawickrama as the ICC Players of the Month for August 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-vacation-in-america-american-football-dhoni-retirement-2600604-2024-09-16",
      "headline": "MS Dhoni relishes vacation with friends in USA, watches American footballLegendary India cricketer MS Dhoni was seen enjoying his holiday in USA as he was in attendance to watch American football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-hockey-on-field-fight-video-2600583-2024-09-16",
      "headline": "Watch: Heated moments in close India vs Pakistan hockey thriller in ChinaAsian Champions Trophy Hockey: India and Pakistan produced a thriller in their final round-robin game. Tempers flared in the final quarter of the match on Saturday before India clinched a 2-1 victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marseille-set-to-sign-france-midfielder-adrien-rabiot-as-free-agent-2600555-2024-09-16",
      "headline": "France midfielder Adrien Rabiot set to join Marseille as free agentAdrien Rabiot is set to join Marseille, having agreed to a deal in principle after leaving Juventus. The French midfielder's return to Ligue 1 marks a significant move for the club, pending a medical examination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2011-dravid-played-his-final-odi-kohli-scored-1st-hundred-on-english-soil-2600553-2024-09-16",
      "headline": "OTD in 2011: Dravid played his final ODI, Kohli scored 1st hundred on English soilOn this day in 2011, Rahul Dravid played his final ODI innings for India during the 5th match of the series against England in Cardiff. In the same match, Kohli scored his first-ever hundred on English soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-ravi-shasti-adelaide-test-36-all-out-karaoke-night-virat-kohli-2600545-2024-09-16",
      "headline": "Ravi Shastri organised karaoke night after 36-all out in Adelaide: R AshwinOff-spinner R Ashwin recalled how Ravi Shastri helped improve the morale in the Indian dressing room after they lost to Australia in Adelaide in 2020. India were bundled out for 36, their lowest total in Test cricket history. However, India bounced back from that defeat and won the series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-ind-vs-ban-rohit-sharma-najmul-hossain-shanto-2600527-2024-09-16",
      "headline": "IND vs BAN: Sunil Gavaskar's stern message for hosts: 'Can't put their guard down'Legendary India batter Sunil Gavaskar has sent a stern message for Indian cricket team ahead of the two-match Test series against Bangladesh beginning from September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-reaction-manchester-city-alleged-financial-breaches-case-2600526-2024-09-16",
      "headline": "Manchester City innocent until proven guilty: Pep GuardiolaManchester City manager Pep Guardiola has reiterated his belief in the Premier League club's innocence as the independent trial into the team's alleged financial breaches begins.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-announce-16-member-squad-for-home-test-series-vs-new-zealand-2600516-2024-09-16",
      "headline": "Sri Lanka announce 16-member squad for home Test series vs New ZealandSri Lanka announced a 16-member squad for the home Test series against New Zealand. The hosts showcased faith in the youngsters, who were brilliant in their performances against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-ravi-shasti-adelaide-test-36-all-out-karaoke-night-virat-kohli-2600545-2024-09-16",
      "headline": "Ravi Shastri organised karaoke night after 36-all out in Adelaide: R AshwinOff-spinner R Ashwin recalled how Ravi Shastri helped improve the morale in the Indian dressing room after they lost to Australia in Adelaide in 2020. India were bundled out for 36, their lowest total in Test cricket history. However, India bounced back from that defeat and won the series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-ind-vs-ban-rohit-sharma-najmul-hossain-shanto-2600527-2024-09-16",
      "headline": "IND vs BAN: Sunil Gavaskar's stern message for hosts: 'Can't put their guard down'Legendary India batter Sunil Gavaskar has sent a stern message for Indian cricket team ahead of the two-match Test series against Bangladesh beginning from September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-reaction-manchester-city-alleged-financial-breaches-case-2600526-2024-09-16",
      "headline": "Manchester City innocent until proven guilty: Pep GuardiolaManchester City manager Pep Guardiola has reiterated his belief in the Premier League club's innocence as the independent trial into the team's alleged financial breaches begins.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-announce-16-member-squad-for-home-test-series-vs-new-zealand-2600516-2024-09-16",
      "headline": "Sri Lanka announce 16-member squad for home Test series vs New ZealandSri Lanka announced a 16-member squad for the home Test series against New Zealand. The hosts showcased faith in the youngsters, who were brilliant in their performances against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-jofra-archer-workload-marcus-trescothick-2600484-2024-09-16",
      "headline": "England continue to be cautious as Jofra Archer returns to ODIs after 18 months England vs Australia: Jofra Archer will not feature in all five ODIs against Australia as the team management will continue to manage his workload. England and Australia will meet in a five-match series from September 19 to 29. It marks Archer's return to the 50-over format after 18 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-is-favourite-to-win-world-chess-championship-match-ding-liren-2600474-2024-09-16",
      "headline": "D Gukesh is favourite to win World Chess Championship match: Ding LirenDefending champion Ding Liren says his Indian challenger D Gukesh is the favourite to win their highly awaited global chess title match in November, while admitting that he has \"dropped a lot\" in the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-two-word-message-hundred-in-duleep-trophy-2600455-2024-09-16",
      "headline": "Ishan Kishan posts two-word message after superb hundred in Duleep TrophyWicketkeeper Ishan Kishan posted a two-word caption with his photo after a superb hundred in the second round of the Duleep Trophy. Ishan did not play for Team India in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/basit-ali-mohammad-rizwan-babar-azam-pakistan-cricket-pcb-2600436-2024-09-16",
      "headline": "Basit Ali reveals how Mohammad Rizwan is better skipper than Babar AzamFormer Pakistan cricketer Basit Ali has backed Mohammad Rizwan to become the next captain of Pakistan replacing Babar Azam."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}