{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-4-tips-to-reduce-premiums-for-senior-citizens-2683576-2025-02-21",
      "headline": "Health insurance: 4 tips to reduce premiums for senior citizens Purchasing a health insurance policy at a younger age can help in securing reduced premium rates. Generally, lower insurance premiums are offered to younger people as they are considered low risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/index-funds-vs-etfs-5-key-things-every-investor-should-know-2683517-2025-02-21",
      "headline": "Index Funds vs. ETFs: 5 key things every investor should know Exchange-Traded Funds are traded like shares on the stock market and can be sold or purchased at existing market prices during the day, while Index Funds are traded only once at the closure of the share market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icmai-seeks-cost-accountant-inclusion-as-accountant-in-income-tax-bill-2683530-2025-02-21",
      "headline": "ICMAI demands 'accountant' status for cost accountants in new Income Tax BillIn its memorandum, ICMAI highlighted the extensive training of Cost and Management Accountants (CMAs), which includes expertise in taxation, finance, auditing, corporate laws, and strategic risk management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-3-deductions-that-can-help-taxpayers-maximise-savings-nps-gratuity-standard-deduction-2683419-2025-02-21",
      "headline": "New tax regime: 3 deductions that can help taxpayers maximise savings  Though the new regime offered concessional tax rates, it reduced several popular deductions and exemptions, like HRA, LTA, interest on home loans, Section 80C, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-to-take-center-stage-at-the-3rd-digital-news-publishers-association-conclave-2683481-2025-02-21",
      "headline": "AI to take centre stage at the 3rd Digital News Publishers Association ConclaveThrough various keynote sessions, panel discussions and expert presentations, this year's DNPA Conclave aims to decode various critical issues, future strategies, opportunities and models that can power an equitable, inclusive and sustainable digital media ecosystem in an era of rapid technological advancement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/association-of-mutual-funds-amfi-launches-chhoti-sip-tarun-yojana-and-mitra-all-you-need-to-know-2683468-2025-02-21",
      "headline": "AMFI launches Chhoti SIP, Tarun Yojana, and MITRA. All you need to knowThe latest initiative by AMFI reinforces its goal of making mutual fund investments accessible to all investors across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-fall-another-session-auto-stocks-tumble-2683435-2025-02-21",
      "headline": "Sensex, Nifty end lower for another session; auto stocks tumbleThe S&P BSE Sensex ended 424.90 points to 75,311.06 at the closing bell, while the NSE Nifty50 fell 117.25 points to settle at 22,795.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/best-high-conviction-stocks-should-you-invest-or-not-explained-2683399-2025-02-21",
      "headline": "Explained: What are 'high-conviction stocks' and why investors should track themHigh-conviction stocks are shares that investors, analysts, or fund managers strongly believe will deliver higher-than-average returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-when-will-it-be-formed-a-look-at-the-past-trends-2683359-2025-02-21",
      "headline": "8th Pay Commission: When will it be formed? A look at the past trendsA Pay Commission recommends changes to the salary structure, allowances and benefits to be offered to employees depending upon the prevailing economic structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-falls-6-percent-today-rights-issue-subsidiaries-explained-2683333-2025-02-21",
      "headline": "Explained: Why M&M share price tumbled 6% todayThe stock tumbled after the company said it will put money into a rights issue for its two subsidiaries—Mahindra & Mahindra Financial Services (MMFSL) and Mahindra Lifespace Developers (MLDL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-about-volatile-stock-market-check-these-10-best-multibagger-stocks-investment-2683312-2025-02-21",
      "headline": "Worried about volatile stock market? Check these 10 potential multibagger stocksThe most important factor for determining multibagger stocks is to check earnings and growth potential. Investors should seek stocks that consistently deliver revenue and profit, check metrics like PE ratio and dividend yield, and compare their performance with sectoral or broader market trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-to-start-sip-2-reasons-why-you-should-consider-nps-national-pension-scheme-2683286-2025-02-21",
      "headline": "Planning to start SIP? 2 reasons why you should consider NPSBy investing in NPS, individuals can claim tax benefits of up to Rs 1.5 lakh under Section 80C and an additional Rs 50,000 under Section 80CCD (1B)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/onerepublic-grammy-nominated-band-collaborates-with-karan-aujla-for-new-song-tell-me-2683449-2025-02-21",
      "headline": "Grammy-nominated band OneRepublic unites with Karan Aujla for new song Tell MeGlobal pop-rock sensation OneRepublic is collaborating with Punjabi artist Karan Aujla for a new track titled Tell Me. It will release on February 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-marry-boyfriend-fiance-vrishank-khanal-february-25-karjat-2683433-2025-02-21",
      "headline": "Mismatched actor Prajakta Koli to marry boyfriend on February 25: ReportActor Prajakta Koli is set to marry her boyfriend Vrishank Khanal on February 25. Their wedding festivities will begin on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-a-great-cook-reveals-his-favourite-dish-aaj-tak-millionaire-tour-2683425-2025-02-21",
      "headline": "Honey Singh says he's a great cook, reveals his favourite dishRapper and music producer Yo Yo Honey Singh opens up about his favourite cuisine, his cooking skills and more in an exclusive interaction with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/park-bo-young-versatility-melo-movie-strong-girl-bong-soon-k-drama-2683400-2025-02-21",
      "headline": "From heartfelt to hilarious, in praise of Park Bo-young's versatilityKorean star Park Bo-young has been acting for almost two decades now. Her ability to completely inhabit the skin of her characters makes her truly stand out. She is currently seen in Melo Movie, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-his-mumbai-concert-doing-something-ive-never-done-before-2683388-2025-02-21",
      "headline": "Honey Singh on his Mumbai concert: Doing something I've never done beforeRapper Honey Singh is starting his countrywide tour from Mumbai on Saturday. In an exclusive interview with us, the singer talked about the gig and what he's doing differently this time at 'Millionaire India Tour at Stage Aajtak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kangana-ranaut-announces-emergency-ott-release-when-and-where-to-watch-2683366-2025-02-21",
      "headline": "Kangana Ranaut's Emergency to premiere on Netflix. Check release dateKangana Ranaut's film, Emergency, is going to hit the screens next month. The actor shared a quick announcement in her Instagram stories on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/robin-tunney-10-years-the-mentalist-finale-simon-baker-2683326-2025-02-21",
      "headline": "Robin Tunney marks 10 years since The Mentalist finale, thanks fan for their loveActor Robin Tunney celebrated the 10th anniversary of The Mentalist finale, expressing gratitude to fans for their unwavering support. She also reflected on the show's impact on her life and career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-surprise-street-performance-london-leaves-fans-in-disbelief-2683349-2025-02-21",
      "headline": "Atif Aslam's surprise street performance in London leaves fans in disbelief. WatchSinger Atif Aslam's video of him performing on a London street has emerged online. This surprise clip has left many fans in disbelief. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-migrants-deportation-human-trafficking-smuggling-racket-usa-canada-punjab-operation-dunki-2683616-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Operation Dunki: How Punjab's human smuggling rackets fuel illegal immigrationAs planeloads of Indian deportees arrived at Amritsar airport in Punjab, Indian Today's Special Investigation Team travelled to the key immigration hub of Jalandhar to expose a thriving human smuggling racket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/usaid-election-funding-to-india-voter-turnout-donald-trump-bangladesh-2683506-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "USAID and abet – Is US funding 'elections' in India?Between 2001 and 2024, USAID has disbursed a total of $2.9 billion to India. That's an average of $119 million annually."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-warning-dont-take-me-lightly-rift-rumours-devendra-fadnavis-maharashtra-2683504-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Don't take me lightly: Eknath Shinde amid rift rumours with Devendra FadnavisEknath Shinde, who has been skipping meetings called by Devendra Fadnavis, asserted that he overturned the incumbent government when he was taken lightly in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-nep-tamil-nadu-language-row-mk-stalin-education-policy-dmk-bjp-2683669-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No animosity among languages: PM amid New Education Policy tussle with Tamil NaduSpeaking at an event in New Delhi, PM Modi emphasised India's linguistic harmony amid a Centre-Tamil Nadu tussle over education reforms and the three-language policy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/microsoft-majorana-1-what-is-it-how-it-works-what-it-means-for-you-and-everything-else-explained-2683437-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: What is Microsoft Majorana 1, how it works and what it means for youMicrosoft on Wednesday made a breakthrough announcement as it launched its first quantum processor, which unlike most other quantum chips that use electrons, the Majorana 1 chip uses Majorana particles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-after-trump-suggests-us-election-interference-india-usaid-funds-2683438-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Deeply troubling: Government after Trump claims US election interference in IndiaIndia has raised serious concerns over US President Donald Trump's claim that USAID allocated $21 million to influence its elections, with the Ministry of External Affairs (MEA) stating the matter is under examination by relevant authorities.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-vs-pakistan-champions-trophy-cricket-1947-partition-lala-amarnath-fazal-mahmood-ck-nayudu-history-2683094-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Partition turned two cricket giants and friends into on-field rivalsLala Amarnath and Fazal Mahmood, two cricketers who grew up playing cricket in Lahore, found themselves on opposite sides of history after India's Partition in 1947. Amarnath was a mentor and friend to Mahmood, and they were supposed to be part of Independent India's first international cricket tour. But history turned them into on-field rivals. While Amarnath captained India, Mahmood led Pakistan's bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-kanpur-says-arvind-kejriwal-mention-in-exam-was-for-academic-purpose-2683557-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT Kanpur says Arvind Kejriwal mention in exam was for academic purposeIIT Kanpur has responded to a viral exam question that mentioned Arvind Kejriwal. The institute clarified that the faculty member often uses well-known personalities, both real and fictional, to make questions more engaging for students. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pm-modi-says-chhaava-ki-dhoom-machi-hui-hai-as-he-praises-vicky-kaushal-laxman-utekar-film-2683650-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi says 'Chhaava ki dhoom machi hui hai' as he praises Vicky Kaushal filmPrime Minister Narendra Modi commended Vicky Kaushal's latest film, Chhaava, highlighting its widespread popularity. The film is about the life of Chhatrapati Sambhaji Maharaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/annamalai-udhayanidhi-clash-over-get-out-modistalin-social-media-challenge-2683251-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Challenge accepted, says Annamalai, throws hashtag dare at Udhayanidhi StalinBJP Tamil Nadu President Annamalai challenged DMK's IT wing to a social media battle, asking them to tweet 'Get Out Modi' while he would post 'Get Out Stalin' at 6 am. His remarks came after Udhayanidhi Stalin warned that Prime Minister Modi would face such slogans if Hindi imposition continued."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cia-funded-congress-to-fight-communists-in-india-revealed-us-officials-usaid-controversy-trump-india-2683375-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CIA funded Congress to fight Communists in India, revealed US officialsDid the Biden administration fund organisations and interfere in India's electoral process? US President Donald Trump is claiming so. As a war of words rages on, here's a throwback to the controversy when the CIA allegedly paid the Congress to thwart the growth of the Communist Party in India. That was revealed by two former American envoys to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-trump-ukraine-zelenskyy-vogue-photoshoot-russia-war-2683484-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From Vogue shoot amid war to polls: Elon Musk makes Zelenskyy his punching bagElon Musk's barrage of attacks started with him sharing a 2022 cover photo of the fashion magazine Vogue featuring Zelenskyy and his wife during the Russia-Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-rekha-gupta-delhi-women-cheated-monthly-allowance-2500-bjp-counter-chief-minister-aap-2683348-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Don't lecture: Rekha Gupta on Atishi's 'BJP cheated Delhi women voters' chargeDelhi Chief Minister Rekha Gupta slammed AAP's Atishi for her comments on the BJP government failing to fulfill its promise of passing a scheme of Rs 2,500 monthly allowance to women in its first cabinet meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-growth-worry-how-indians-rate-modi-govts-economic-policies-2683053-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The growth worry: How Indians rate Modi govt's economic policiesControlling inflation, creating jobs and boosting stagnant incomes emerge as top public scepticisms in the INDIA TODAY Mood of the Nation survey"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhaji-maharaj-controversial-content-row-wikipedia-editors-case-2683414-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Case against 4 Wikipedia editors for not removing content on Sambhaji MaharajSources said 4 to 5 individuals were involved in editing and spreading disinformation about Maratha ruler Chhatrapati Sambhaji Maharaj on Wikipedia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ryan-rickelton-gets-out-in-bizarre-fashion-after-odi-hundred-2683547-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Ryan Rickelton gets out in bizarre fashion after maiden ODI hundredSouth Africa opener Ryan Rickelton got out in a bizarre fashion after scoring his hundred during Match 3 of the ICC Champions Trophy 2025 against Afghanistan in Karachi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-12-physics-paper-analysis-mix-of-easy-and-tricky-questions-2683411-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE Class 12 Physics paper: Tough multiple-choice questions, lengthy numericalsThe CBSE Class 12 Physics paper 2025 was moderate to tough, with tricky MCQs, lengthy numericals, and a few unexpected questions, making time management crucial for students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/aditya-pancholi-assault-case-mumbai-court-upholds-conviction-changes-jail-term-2683609-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court upholds Aditya Pancholi's conviction in assault case, modifies jail termThe sessions court Aditya Pancholi to pay a compensation of Rs 1.5 lakh to assault case victim Pratik Pashine for availing the benefit of release under the Probation of Offenders Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/looking-for-a-cng-car-under-rs-10-lakh-3-maruti-hyundai-tata-models-to-be-considered-2683519-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Looking for a CNG car under Rs 10 lakh? 3 Maruti, Hyundai, Tata models to be consideredCNG cars in India now also come with dual CNG cylinder technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-lady-don-zoya-khan-arrested-gangster-hashim-baba-wife-lavish-parties-luxury-brands-drug-syndicate-2683313-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi's 'lady don' arrested: Lavish parties, luxury brands and drug ring tiesPolice had been trying to arrest Zoya for years, but she always managed to evade arrest. However, Special Cell ACP Sanjay Dutt and Inspector Sandeep Dabas finally managed to trap her in a drug case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/body-of-mother-of-youngest-hostages-not-released-by-hamas-claims-israel-2683175-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israeli PM Netanyahu says Hamas 'will pay' for not returning hostage's bodyIsrael's military accused Hamas of violating the ceasefire after failing to return Shiri Bibas's body, though her sons, Kfir and Ariel, were among the remains handed over.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-3-deductions-that-can-help-taxpayers-maximise-savings-nps-gratuity-standard-deduction-2683419-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New tax regime: 3 deductions that can help taxpayers maximise savings  Though the new regime offered concessional tax rates, it reduced several popular deductions and exemptions, like HRA, LTA, interest on home loans, Section 80C, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pm-modi-says-chhaava-ki-dhoom-machi-hui-hai-as-he-praises-vicky-kaushal-laxman-utekar-film-2683650-2025-02-21",
      "headline": "PM Modi says 'Chhaava ki dhoom machi hui hai' as he praises Vicky Kaushal filmPrime Minister Narendra Modi commended Vicky Kaushal's latest film, Chhaava, highlighting its widespread popularity. The film is about the life of Chhatrapati Sambhaji Maharaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/ranbir-alia-make-the-most-picture-perfect-couple-at-aadar-jain-wedding-2683628-2025-02-21",
      "headline": "Ranbir-Alia make the most picture-perfect couple at Aadar Jain's weddingRanbir Kapoor and Alia Bhatt made a stylish appearance at Aadar Jain and Alekha Advani's wedding. The couple looked picture-perfect as they posed for the paps. While Alia stunned in a light-pink saree, Ranbir looked dapper in sherwani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tajider-bagga-calls-farah-khan-biggest-chappri-after-filmmakers-comment-holi-masterchef-2683619-2025-02-21",
      "headline": "Watch: Tajinder Bagga calls Farah Khan 'biggest Chhapri' after her Holi commentTajinder Bagga criticised Farah Khan's remarks on Holi, calling her the 'biggest chhapri' for targeting Indian culture. He demanded an apology for her statement about the festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-reacts-to-reports-of-his-mother-illness-2683600-2025-02-21",
      "headline": "Chiranjeevi reacts to reports of his mother's illness: She is hale and heartySouth superstar Chiranjeevi has reacted to reports of his mother's illness. The actor dismissed the speculative reports about her and said that she was doing well. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-vs-england-aus-vs-eng-lahore-pitch-report-playing-xi-2683625-2025-02-21",
      "headline": "Australia vs England, all you need to know: Lahore pitch report, playing XIAustralia and England are all set to begin their campaign in the ICC Champions Trophy 2025 as they take on each other on February 22 in Lahore. Both teams are coming on the back of series losses in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-arne-slot-interview-title-race-2683621-2025-02-21",
      "headline": "Arne Slot interview: Liverpool boss reflects on journey, Premier League challengesLiverpool boss Arne Slot is remaining grounded despite his side's incredible season so far in the Premier League. Slot opened up about what drives his team forward amongst a myriad of topics in an interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-prediction-sourav-ganguly-virat-kohli-spin-2683612-2025-02-21",
      "headline": "Sourav Ganguly predicts India vs Pakistan outcome, says spin will be king in DubaiIndia vs Pakistan: Former captain Sourav Ganguly said the defending champions might struggle against India in Dubai. Ganguly also backed Virat Kohli to overcome his struggles against spin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-australia-vs-england-jos-buttler-press-conference-video-lahore-2683596-2025-02-21",
      "headline": "Jos Buttler not taking injury-struck Australia lightly: Expect a tough challengeEngland captain Jos Buttler has claimed that they will not be taking Australia lightly during their Champions Trophy encounter in Lahore on February 22. The Aussies are without the likes of Pat Cummins, Josh Hazlewood, Mitchell Starc and Mitchell Marsh due to injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-england-jos-buttler-number-six-jamie-smith-2683586-2025-02-21",
      "headline": "Jos Buttler excited for No.6 spot return: Very confident in my own formEngland captain Jos Buttler is excited about making a return to the No.6 spot as they get ready to face off against Australia on February 22. Buttler has demoted himself to No.6 as England will use Jamie Smith as their No.3 batter. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-should-learn-from-rohit-sharma-says-anil-kumble-2683580-2025-02-21",
      "headline": "Out-of-form Kohli should take a leaf out of Rohit Sharma's book: Anil KumbleFormer India cricketer and head coach Anil Kumble has suggested star India batter Virat Kohli to bat with the same freedom as Rohit Sharma in order to return back to form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ryan-rickelton-gets-out-in-bizarre-fashion-after-odi-hundred-2683547-2025-02-21",
      "headline": "Watch: Ryan Rickelton gets out in bizarre fashion after maiden ODI hundredSouth Africa opener Ryan Rickelton got out in a bizarre fashion after scoring his hundred during Match 3 of the ICC Champions Trophy 2025 against Afghanistan in Karachi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-do-or-die-haris-rauf-press-dubai-2683549-2025-02-21",
      "headline": "India vs Pakistan: It's do-or-die, but we feel no added pressure, says Haris RaufChampions Trophy 2025: Fast bowler Haris Rauf acknowledged that Pakistan need nothing less than a win against their arch-rivals on Sunday, but said the team is not taking added pressure before they face India. Pakistan slumped to a 60-run loss in the opener against New Zealand. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-round-of-16-draw-real-madrid-liverpool-2683546-2025-02-21",
      "headline": "Champions League Round Of 16: Real Madrid to face Atletico, PSG vs Liverpool setReal Madrid will square off against Atletico Madrid in the Round of 16 of the Champions League while Liverpool will face a tricky test against PSG. Bayern Munich will take on their Bundesliga title rivals Bayer Leverkusen in the Round of 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-kerala-vs-gujarat-semi-final-sanju-samson-2683534-2025-02-21",
      "headline": "Sanju Samson gets emotional as Kerala reach Ranji Trophy final: 1 step awayAn emotional Sanju Samson sent a heartwarming message to the Kerala team as they reached the final of the Ranji Trophy for the first time in their history. Kerala secured a first innings lead against Gujarat to secure their spot. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-should-learn-from-rohit-sharma-says-anil-kumble-2683580-2025-02-21",
      "headline": "Out-of-form Kohli should take a leaf out of Rohit Sharma's book: Anil KumbleFormer India cricketer and head coach Anil Kumble has suggested star India batter Virat Kohli to bat with the same freedom as Rohit Sharma in order to return back to form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ryan-rickelton-gets-out-in-bizarre-fashion-after-odi-hundred-2683547-2025-02-21",
      "headline": "Watch: Ryan Rickelton gets out in bizarre fashion after maiden ODI hundredSouth Africa opener Ryan Rickelton got out in a bizarre fashion after scoring his hundred during Match 3 of the ICC Champions Trophy 2025 against Afghanistan in Karachi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-do-or-die-haris-rauf-press-dubai-2683549-2025-02-21",
      "headline": "India vs Pakistan: It's do-or-die, but we feel no added pressure, says Haris RaufChampions Trophy 2025: Fast bowler Haris Rauf acknowledged that Pakistan need nothing less than a win against their arch-rivals on Sunday, but said the team is not taking added pressure before they face India. Pakistan slumped to a 60-run loss in the opener against New Zealand. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-round-of-16-draw-real-madrid-liverpool-2683546-2025-02-21",
      "headline": "Champions League Round Of 16: Real Madrid to face Atletico, PSG vs Liverpool setReal Madrid will square off against Atletico Madrid in the Round of 16 of the Champions League while Liverpool will face a tricky test against PSG. Bayern Munich will take on their Bundesliga title rivals Bayer Leverkusen in the Round of 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-kerala-vs-gujarat-semi-final-sanju-samson-2683534-2025-02-21",
      "headline": "Sanju Samson gets emotional as Kerala reach Ranji Trophy final: 1 step awayAn emotional Sanju Samson sent a heartwarming message to the Kerala team as they reached the final of the Ranji Trophy for the first time in their history. Kerala secured a first innings lead against Gujarat to secure their spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-england-steve-smith-approach-lahore-2683488-2025-02-21",
      "headline": "Steve Smith says Australia to have 'flexible' approach during Champions TrophyAustralia captain Steve Smith has said that the team will go for a 'flexible' approach during this year's Champions Trophy. Australia are missing some key players ahead of the start of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shubman-gill-virat-kohli-india-vs-pakistan-mohammad-hafeez-dubai-2683436-2025-02-21",
      "headline": "Shubman Gill is next Virat Kohli, trying to take legacy forward: Mohammad HafeezMohammad Hafeez heaped praise on Shubman Gill and claimed that the 25-year-old is the next Virat Kohli. Gill remained unbeaten on 101 as India defeated Bangladesh by 6 wickets to win their opening match of the Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-unveil-new-jersey-for-ipl-2025-2683458-2025-02-21",
      "headline": "Mumbai Indians unveil new jersey as they prepare to bring back old legacyMumbai Indians (MI) unveiled their jersey for the upcoming Indian Premier League 2025 (IPL 2025) in a special video for their fans featuring Hardik Pandya, Rohit Sharma, Jasprit Bumrah, Suryakumar Yadav and Tilak Varma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-south-africa-vs-afghanistan-heinrich-klaasen-injury-news-karachi-2683416-2025-02-21",
      "headline": "Heinrich Klaasen ruled out as South Africa suffer injury blow in KarachiChampions Trophy: South Africa were without their best batter of spin, Heinrich Klaasen, in their Group B opener against Afghanistan in Karachi. The SunRisers Hyderabad star was ruled out due to an elbow injury concern. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-spin-weakness-harbhajan-singh-2683415-2025-02-21",
      "headline": "Why is Virat Kohli struggling against spin? Harbhajan Singh explainsChampions Trophy: After getting out twice to leg-spinner Adil Rashid in an ODI series at home earlier in February, Virat Kohli was undone by spinner Rishad Hossain in India's opening match against Bangladesh in Dubai on February 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pat-cummins-injury-return-date-ipl-2025-target-2683386-2025-02-21",
      "headline": "After missing Champions Trophy, Pat Cummins targets IPL 2025 returnAustralian skipper Pat Cummins is eyeing a return in IPL 2025 after missing the Champions Trophy due to injury. While recovering, he's balancing family time and rehabilitation, ensuring full fitness for upcoming cricketing commitments, including the World Test Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kerala-vs-gujarat-ranji-trophy-historic-miracle-catch-ahmedabad-2683354-2025-02-21",
      "headline": "Watch: Kerala edge closer to their first-ever Ranji final after miraculous catchRanji Trophy 2024-25: With two runs needed to take a decisive first-innings lead, Gujarat were left heartbroken after a miraculous catching effort from Kerala. The visiting team are all but through to the final of the domestic tournament for the first time in their history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-spin-weakness-harbhajan-singh-2683415-2025-02-21",
      "headline": "Why is Virat Kohli struggling against spin? Harbhajan Singh explainsChampions Trophy: After getting out twice to leg-spinner Adil Rashid in an ODI series at home earlier in February, Virat Kohli was undone by spinner Rishad Hossain in India's opening match against Bangladesh in Dubai on February 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pat-cummins-injury-return-date-ipl-2025-target-2683386-2025-02-21",
      "headline": "After missing Champions Trophy, Pat Cummins targets IPL 2025 returnAustralian skipper Pat Cummins is eyeing a return in IPL 2025 after missing the Champions Trophy due to injury. While recovering, he's balancing family time and rehabilitation, ensuring full fitness for upcoming cricketing commitments, including the World Test Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kerala-vs-gujarat-ranji-trophy-historic-miracle-catch-ahmedabad-2683354-2025-02-21",
      "headline": "Watch: Kerala edge closer to their first-ever Ranji final after miraculous catchRanji Trophy 2024-25: With two runs needed to take a decisive first-innings lead, Gujarat were left heartbroken after a miraculous catching effort from Kerala. The visiting team are all but through to the final of the domestic tournament for the first time in their history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-hans-niemann-cheating-joe-rogan-podcast-2683314-2025-02-21",
      "headline": "Carlsen recalls Niemann cheating controversy on Joe Rogan podcastMagnus Carlsen has finally addressed the 2022 cheating scandal involving Hans Niemann, revealing how Niemann's gameplay raised suspicions. He also acknowledged that while most have moved on, trust issues still persist in the chess community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-knocked-out-qatar-open-jiri-lehecka-2683281-2025-02-21",
      "headline": "Alcaraz crashes out of Qatar Open after shock defeat in quarter-finalCarlos Alcaraz suffered a shock Qatar Open exit after losing to Jiri Lehecka in the quarter-finals. The Czech player secured the biggest win of his career, shaking up the tournament with another major upset following Djokovic's early elimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-jai-sholay-gabbar-jasprit-bumrah-india-2683274-2025-02-21",
      "headline": "Shami: The Jai of Indian cricket's Sholay, overshadowed by Gabbar BumrahTime travel to the 90s and the 2000s when Javagal Srinath and Zaheer Khan shared the burden of Indian pace bowling with trundlers like Manoj Prabhakar. Had Mohammed Shami been part of any of these teams, he would have been a legend, a superstar whose face could have launched a million brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-comeback-india-vs-bangladesh-dubai-2683246-2025-02-21",
      "headline": "8 hours a day at NCA: Mohammed Shami's relentless grind for Champions Trophy gloryMohammed Shami stamped his authority with the ball in India's Champions Trophy opener against Bangladesh. Shami picked up 5 wickets and overtook Zaheer Khan as India's most successful bowler in the ICC white-ball tournaments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-slow-over-rate-penalty-new-zealand-mohammed-rizwan-guilty-2683226-2025-02-21",
      "headline": "Champions Trophy: Pakistan fined for slow-over rate against New ZealandPakistan were fined 5 percent of their match fee for maintaining a slow over-rate against New Zealand in their Champions Trophy opener, adding to their struggles as they prepare for a high-stakes clash against India on February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-towhid-hridoy-century-india-vs-bangladesh-build-confidence-2683208-2025-02-21",
      "headline": "Champions Tropphy: Hridoy hopeful century vs India will build confidenceBangladesh batter Towhid Hridoy expressed optimism after his maiden ODI century against India in the Champions Trophy opener on February 20, believing the knock will boost his confidence and play a crucial role in shaping his international cricketing career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammed-shami-india-vs-bangladesh-dedicates-to-father-role-model-2683194-2025-02-21",
      "headline": "Shami dedicates bowling brilliance vs Bangladesh to 'role model' fatherIndia's veteran pacer Mohammed Shami dedicated his stunning five-wicket haul against Bangladesh in the Champions Trophy opener to his father, whom he hailed as his greatest inspiration and role model, crediting him for shaping his cricketing journey and resilience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21",
      "headline": "Sourav Ganguly accident: Former India captain escapes unhurt after collision on roadFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan University. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-india-vs-pakistan-no-special-mindset-needed-2683192-2025-02-21",
      "headline": "5-star Shami not stressing over India vs Pakistan: No special mindsetMohammed Shami remains unfazed ahead of India's high-stakes Champions Trophy clash against Pakistan, trusting his momentum from a stellar five-wicket haul against Bangladesh instead of adopting a special mindset for the blockbuster encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-robin-uthappa-on-virat-kohlis-form-india-vs-bangladesh-ind-vs-ban-2683155-2025-02-21",
      "headline": "Virat Kohli more worried about middling the ball instead of scoring: Robin UthappaFormer India batter Robin Uthappa commented on Virat Kohli's poor form after he got dismissed for 22 in India's first match of the ICC Champions Trophy 2025 against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-harbhajan-singh-india-lession-interview-2683165-2025-02-21",
      "headline": "Harbhajan Singh wants India to learn 'one lesson' despite win against Bangladesh  Champions Trophy: Former Indian spinner Harbhajan Singh said that India should try and put around 280-300 runs on the board while batting first to put pressure on the opposition on the slow and low pitches at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shubman-gill-reactions-2683159-2025-02-21",
      "headline": "Who said what after Shami, Shubman Gill help India beat Bangladesh Champions Trophy: Rohit Sharma praised Shubman Gill and Mohammed Shami for their incredible performance after India beat Bangladesh by six wickets. Shanto, on the other hand, said that losing wickets in the powerplay pushed the Tigers back on the backfoot. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}