{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/struggling-to-find-your-old-mutual-fund-investments-sebis-mitra-help-track-unclaimed-mfs-2688839-2025-03-04",
      "headline": "Struggling to find your old mutual fund investments? Let Sebi's Mitra help With over 7.5 million inactive folios across different asset management companies (AMCs), Mitra is designed to help investors recover their forgotten investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-marriage-impact-your-credit-score-all-you-need-to-know-2688797-2025-03-04",
      "headline": "Does marriage impact your credit score? All you need to know While regular payments can improve both scores, any late or default on payments can considerably impact both the scores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-under-pressure-as-us-and-eu-tighten-trade-policies-2688761-2025-03-04",
      "headline": "India's exports under pressure as US and EU tighten trade policiesUS President Donald Trump's plan to impose reciprocal tariffs from April is a major concern for Indian exporters, particularly in sectors like automobiles, agriculture, and manufacturing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nifty-falls-for-10th-straight-session-longest-daily-losing-streak-since-1996-2688757-2025-03-04",
      "headline": "Nifty falls for 10th straight day, longest daily losing streak since 1996 launchNifty has registered a 10-day losing streak amid multiple triggers, including relentless selling by foreign investors and fears of an escalating trade war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-as-trade-war-fears-keep-investors-on-edge-2688744-2025-03-04",
      "headline": "Sensex, Nifty end lower as trade war fears keep investors on edgeThe S&P BSE Sensex ended 96.01 points lower at 72,989.93 at the closing bell, while the NSE Nifty50 fell 36.65 points to 22,082.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-sensex-nifty-how-to-pick-quality-stocks-mutual-fund-investment-2688732-2025-03-04",
      "headline": "Stock market correction: Here's how to pick quality stocksDuring a market downturn, investors must be careful about stock selection. Choosing the right stocks can help minimise losses and create long-term gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-ceo-bhavish-aggarwal-wants-weekly-updates-from-staff-kya-chal-raha-hai-report-2688701-2025-03-04",
      "headline": "Ola CEO Bhavish Aggarwal wants weekly updates from staff: ReportUnder the new policy, employees must send a short email every week highlighting 3-5 key tasks they have completed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-cryptos-like-bitcoin-ethereum-xrp-cardano-solana-are-crashing-suddenly-2688685-2025-03-04",
      "headline": "Explained: Why popular cryptocurrencies are crashing suddenlyOver the last 24 hours, Bitcoin, the world's largest cryptocurrency, has lost 8.83%, currently trading at $83,461.02."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-in-hibernation-mode-why-have-public-listings-dried-off-dalal-street-slump-2688676-2025-03-04",
      "headline": "IPOs in hibernation mode: Why have public listings dried up?The last mainboard IPO to open for subscription was Quality Power on February 14, 2025. Since then, there has been no fresh activity in the public listing space."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/microchip-to-cut-2000-jobs-impacting-9-of-global-workforce-2688618-2025-03-04",
      "headline": "Microchip to cut 2,000 jobs, impacting 9% of global workforceMicrochip has reported five straight quarters of declining sales, with fourth-quarter revenue and profits falling below expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mixue-chinas-bubble-tea-giant-ipo-listing-share-jumps-over-47-percent-2688653-2025-03-04",
      "headline": "Mixue, China's bubble tea giant, makes a strong IPO debut with 47% stock jumpMixue, popular for its low-cost drinks and Snow King mascot, generated $444 million by offering 17 million shares at HK$202.5 each. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-has-never-fallen-for-6-straight-months-will-march-offer-relief-2688652-2025-03-04",
      "headline": "Nifty stares at worst monthly losing streak. Can March turn the tide?If the situation does not improve in March, Nifty could fall for the sixth straight month, something that has never happened before. This could have a drastic impact on investor sentiments and make the situation worse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oyo-races-to-launch-ipo-as-debt-repayment-deadline-approaches-report-2688607-2025-03-04",
      "headline": "Oyo races to launch IPO as debt repayment deadline approaches: ReportOyo has been flirting with an IPO for years, but Covid-19 wrecked its earlier ambitions. Now, the hotel chain is talking to bankers again, targeting a valuation of up to $5 billion, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/citigroups-copy-paste-error-nearly-led-to-6-billion-transfer-2688592-2025-03-04",
      "headline": "Citigroup employee's error almost cost the bank $6 billion. Here's what happenedThe said error occurred during an attempted transfer of funds between the bank's internal accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-tariffs-spark-trade-war-what-it-means-for-global-stock-markets-economy-2688579-2025-03-04",
      "headline": "Trump's tariffs spark trade war: Will global economy pay a heavy price?Financial experts have warned that Donald Trump's tariffs could ignite a global trade war, disrupting supply chains and jeopardizing international trade flows built over decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trade-war-heats-up-china-strikes-back-at-us-after-donald-trump-tariffs-2688576-2025-03-04",
      "headline": "Trade war heats up: China strikes back at US after Trump's tariffs China's tariffs on the US come after President Donald Trump announced an additional 10% tariff on Chinese goods, bringing the total tariff level to 20%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-stock-market-still-overvalued-warren-buffett-key-indicator-signals-caution-2688569-2025-03-04",
      "headline": "Is stock market still overvalued? Warren Buffett's key indicator signals cautionSensex and Nifty have corrected nearly 15% from their all-time high and, despite these corrections, there are concerns that the stock markets remain expensive, and further downside could be possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-slams-donald-trumps-tariff-plans-act-of-war-2688551-2025-03-04",
      "headline": "Warren Buffett slams Trump's tariffs: They're an act of warWarren Buffett's comments come as Donald Trump has pushed ahead with new tariffs. Starting Tuesday, his administration will slap a 25% tariff on goods from Canada and Mexico. The US President is also hiking tariffs on Chinese imports, raising the rate from 10% to 20%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-says-oil-ministry-raised-281-billion-demand-in-gas-dispute-case-2688540-2025-03-04",
      "headline": "Reliance Industries says oil ministry raised $2.81 billion demand in gas dispute caseOn February 14, a division bench at Delhi High Court ruled against Reliance and its partners in a dispute regarding extraction of gas in a deepwater field in India's KG D6 block in the Krishna Godavari basin in the country's eastern coast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-fall-as-dalal-street-bloodbath-continues-3-reasons-why-2688536-2025-03-04",
      "headline": "Sensex, Nifty in red as Dalal Street bloodbath continues: 3 reasons whyThe S&P BSE Sensex was down 265.30 points to 72,820.64, while the NSE Nifty50 lost 104.85 points to 22,014.45 as of 9.40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-open-lower-as-donald-trumps-new-tariffs-spooks-dalal-street-2688520-2025-03-04",
      "headline": "Sensex, Nifty open in red as Trump's tariffs trigger global markets meltdownThe S&P BSE Sensex fell 368.03 points to 72,717.91, while the NSE Nifty50 lost 136.30 points to 21,982.70 as of 9:16 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/honda-to-build-next-civic-in-us-skips-mexico-over-tariff-concerns-donald-trump-report-2688509-2025-03-04",
      "headline": "Honda to build next Civic in US, skips Mexico over tariff concerns: ReportHonda has chosen Mexico because of rising costs that were making it tough to produce the car in Indiana, the US and Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-markets-jittery-dow-jones-us-market-falls-ahead-of-trump-tariffs-how-will-it-impact-dalal-street-2688501-2025-03-04",
      "headline": "Global markets jittery ahead of Trump tariffs: How will it impact Dalal Street?A decline in US stocks was witnessed, triggered by the latest tariff announcement from US President Donald Trump spooking Wall Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-capital-eyes-india-biggest-ipo-seeks-11-billion-valuation-report-2688305-2025-03-03",
      "headline": "Tata Capital eyes India's biggest IPO, seeks $11 billion valuation: ReportLast week, Tata Capital's board approved the listing of up to 230 million shares, including an offer for sale by existing shareholders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-cost-emis-the-real-cost-behind-zero-interest-deals-and-who-benefits-scam-trap-2688296-2025-03-03",
      "headline": "No-cost EMIs: The real cost behind 'zero interest' deals and who benefits? The idea of breaking down a large payment into smaller, interest-free instalments sounds attractive. However, there is more to these schemes than meets the eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-crypto-strategic-reserve-bitcoin-up-by-7-percent-cardano-jumps-by-47-percent-2688247-2025-03-03",
      "headline": "Bitcoin up by 7%, Cardano jumps by 47% on Trump's US crypto reserves newsAs a result, on March 3, the total crypto market volume witnessed a jump of 197.62% from the previous day, and stood at $206.77 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-under-ed-lens-for-fema-violations-rs-611-crore-notce-failed-to-inform-rbi-on-singapore-deal-2688253-2025-03-03",
      "headline": "Paytm under ED lens for FEMA violations, gets Rs 611 crore noticeThe investigation agency said that Paytm failed to follow the rules under the Foreign Exchange Management Act (FEMA) while making an investment in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irctc-irfc-get-navratna-status-heres-what-it-means-railway-sector-stock-2688210-2025-03-03",
      "headline": "IRCTC and IRFC get 'Navratna' status. Here's what it meansIRCTC has become the 25th Navratna among Central Public Sector Enterprises (CPSEs), while IRFC is now the 26th."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pf-upi-withdrawal-rules-how-to-withdraw-epf-money-via-upi-app-2688187-2025-03-03",
      "headline": "PF UPI withdrawal rules: How to withdraw EPF money via UPI To withdraw your PF money, it is essential to complete the KYC process for your EPF account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-erase-early-gains-to-end-flat-in-volatile-trade-2688182-2025-03-03",
      "headline": "Sensex, Nifty erase early gains to end flat in volatile tradeThe S&P BSE Sensex lost 21,85 points to end at 73,176.25, while the NSE Nifty50 was down by 5.40 points to close at 22,119.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-recover-2-percent-after-4-percent-drop-on-ed-notice-over-fema-violations-2688167-2025-03-03",
      "headline": "Paytm shares recover after 4% drop on ED notice over FEMA violationsPaytm earlier informed stock exchanges that it had received a show cause notice from the Enforcement Directorate (ED) on February 28 at 7:27 PM. The notice, dated 27 February, was related to alleged violations of FEMA rules between 2015 and 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/md-and-ceo-of-edelweiss-mutual-fund-radhika-gupta-compared-nifty-to-shah-rukh-khan-details-here-2688133-2025-03-03",
      "headline": "Why has Radhika Gupta compared Nifty to Shah Rukh Khan? Details hereNifty has hit its longest losing streak in 29 years, wiping out Rs 90 lakh crore in investor wealth since hitting its peak in September. The Sensex has fallen over 12% since its September 2024 all-time high, when it touched its peak at 85,478.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smallcap-and-midcap-stocks-free-fall-what-should-investors-do-2688089-2025-03-03",
      "headline": "Smallcap and midcap stocks are in free fall. What should investors do?The broader market saw heavy selling pressure last month, dragging the BSE Smallcap index down 15%—its first double-digit monthly decline since the pandemic sell-off—while the Nifty Midcap 100 fell over 10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-growth-hits-14-month-low-in-february-on-soft-demand-2688091-2025-03-03",
      "headline": "India's manufacturing growth hits 14-month low in February on soft demandThe HSBC final India Manufacturing Purchasing Managers' Index, compiled by S&P Global, fell to 56.3 in February - its lowest since December 2023 - from 57.7 in January. A preliminary estimate was much higher at 57.1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pli-scheme-government-focus-on-exports-and-value-creation-2688074-2025-03-03",
      "headline": "Government looks to enhance PLI scheme to boost exports. Details hereIntroduced in April 2020, the PLI scheme has drawn substantial investment in 14 sectors, attracting original equipment manufacturers (OEMs) and contract manufacturers to scale up production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-fall-reason-why-over-5-percent-to-hit-52-week-low-today-2688053-2025-03-03",
      "headline": "Explained: Why Ola Electric shares fell over 5% to hit 52-week low todayIn the past five days, Ola Electric shares have lost more than 9%, and in six months, it has crashed a whopping 52%. Since the start of this year, the stock is down over 37%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-ril-tumbled-over-3-percent-today-hitting-a-fresh-52-week-low-2688045-2025-03-03",
      "headline": "Explained: Why Reliance share price tumbled over 3% today Foreign investors have been aggressively selling Indian equities, dragging down heavyweight stocks like RIL. The company's market value has shrunk as a result, reflecting the broader negative sentiment in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-likely-to-cut-1-000-jobs-amid-rising-losses-report-share-price-52-week-low-2688040-2025-03-03",
      "headline": "Ola Electric likely to cut over 1,000 jobs amid rising losses: ReportThe job cuts will affect multiple departments, including procurement, fulfilment, customer relations, and charging infrastructure. Ola Electric shares also fell 5% to hit its 52-week low of Rs 54. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-often-can-taxpayers-switch-between-new-and-old-tax-regime-2688033-2025-03-03",
      "headline": "How often can taxpayers switch between new and old tax regime? Salaried employees can select their tax regime at the start of each financial year. If no preference is given, employers will deduct tax under the new regime by default."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-400-points-nifty-erase-early-gains-why-is-stock-market-falling-today-fii-selling-2688032-2025-03-03",
      "headline": "Sensex, Nifty erases early gains: Why is stock market falling today? By 11:13 AM, the S&P BSE Sensex had fallen 388.70 points to 72,809.40, while the NSE Nifty50 was down 111.50 points to 22,013.30."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-separate-7-years-of-marriage-couple-reacts-2688743-2025-03-04",
      "headline": "Actor Shoaib Ibrahim reacts to divorce rumours: Dipika ne diya mujhe dhokhaTelevision couple, Dipika Kakar and Shoaib Ibrahim have found themselves at the center of the separation rumours. The two addressed the same in their new vlog on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shonali-bose-on-delhi-university-miranda-house-objection-to-ziddi-girls-heartbreaking-2688656-2025-03-04",
      "headline": "Shonali Bose on DU, Miranda House's objection to Ziddi Girls: It was heartbreakingPrime Video's Ziddi Girls faced backlash from sections of Delhi University and Miranda House students over perceived negative portrayal, but director Shonali Bose clarifies the trailer was misunderstood and most students ultimately enjoyed the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anora-ott-release-when-and-where-to-watch-the-oscar-winning-best-film-2688627-2025-03-04",
      "headline": "Anora OTT release: When and where to watch the Oscar-winning Best FilmThe Oscar-winning film 'Anora' is set to stream on JioHotstar from March 17. Directed by Sean Baker and starring Mikey Madison, who won Best Actress, the movie offers a thought-provoking narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-dolly-partons-husband-carl-dean-dies-at-82-2688521-2025-03-04",
      "headline": "Singer Dolly Parton's husband Carl Dean dies at 82Carl Dean, husband of Dolly Parton and inspiration for her hit song, Jolene, has died at the age of 82. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpinks-lisa-on-her-new-album-alter-ego-want-people-to-feel-empowered-2688361-2025-03-03",
      "headline": "Blackpink's Lisa on her new album Alter Ego: Want people to feel empoweredLisa of Blackpink recently spoke about her new solo album, Alter Ego. In a virtual panel discussion, the singer shared her desire to make listeners feel empowered with her new album. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-deepti-sadhwani-turns-showstopper-milan-fashion-week-2688348-2025-03-03",
      "headline": "Taarak Mehta actor Deepti Sadhwani turns showstopper at Milan Fashion WeekTaarak Mehta Ka Ooltah Chashmah actor Deepti Sadhwani turned showstopper at Milan Fashion Week. The actor shared stunning photos from her rampwalk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-emotional-1st-video-india-got-latent-row-ranveer-allahbadia-samay-raina-2688255-2025-03-03",
      "headline": "Kaam Idhar Udhar Hogaya: YouTuber Ashish Chanchlani on India's Got Latent rowYouTuber Ashish Chanchlani got emotional in his first video after his appearance on comedian Samay Raina's India's Got Latent show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maharani-4-teaser-huma-qureshi-returns-rani-bharti-safeguard-bihar-2688207-2025-03-03",
      "headline": "Maharani 4 teaser: Huma Qureshi returns as Rani Bharti to safeguard BiharActor Huma Qureshi is set to return as Rani Bharti in Maharani Season 4. The makers announced the news with the teaser of the upcoming gripping series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tenali-rama-fire-disrupts-shoot-no-casualties-reported-2688145-2025-03-03",
      "headline": "TV show Tenali Rama set catches fire, shoot haltedA fire broke out on the set of TV show Tenali Rama due to a generator malfunction, halting production. There were no casualties, but the set suffered damage and repairs are underway.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-trailer-abhishek-bachchan-reunites-with-ludo-co-actor-inayat-verma-in-feel-good-film-2688128-2025-03-03",
      "headline": "Be Happy: Abhishek Bachchan reunites with Ludo co-actor Inayat in feel-good filmThe trailer of Abhishek Bachchan and Inayat Verma's upcoming dance-drama Be Happy was released today. Directed by Remo D'Souza, the heartfelt film will premiere on Prime Video on March 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-seoul-concert-new-song-fan-proposal-and-special-appearance-by-jin-2688072-2025-03-03",
      "headline": "BTS' J-hope's Seoul concert: New song, fan proposal and special appearance by JinBTS member and rapper J-hope recently held a concert in Seoul which was attended by his close friend and singer Kim Seokjin (Jin). The concert was one big event for the fans as it consisted of many other surprises besides the central performance by the artiste. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-release-date-announced-2688039-2025-03-03",
      "headline": "Khakee The Bengal Chapter: Jeet and Prosenjit announce release date with fun clipThe next installment of Netflix's critically acclaimed thriller series Khakee, Khakee: The Bengal Chapter will premiere on Netflix in March. The makers of the show announced its release date with a fun video. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupamaa-actor-sudhanshu-pandey-breaks-silence-on-rumoured-feud-with-rupali-ganguly-2687828-2025-03-02",
      "headline": "Anupamaa actor Sudhanshu Pandey breaks silence on rumoured feud with Rupali GangulyActor Sudhanshu Pandey has addressed the ongoing rumours about a feud with his Anupamaa co-star Rupali Ganguly. In an interview, he clarified the situation and dismissed the speculations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brit-awards-2025-charli-xcx-wins-album-of-the-year-full-winners-list-here-2687772-2025-03-02",
      "headline": "BRIT Awards 2025: Charli XCX wins album of the year, full winners list hereCharli XCX emerged as a major winner at the Brit Awards 2025, securing multiple accolades. Artists including Sabrina Carpenter and Billie Eilish also took home some of the biggest awards of the night.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-delhi-millionaire-concert-a-night-of-nostalgia-surprises-iconic-hits-2687778-2025-03-02",
      "headline": "Honey Singh's Millionaire Delhi concert: A night of nostalgia, iconic hitsHoney Singh's Delhi concert was packed with nostalgic hits, emotional tributes, surprise guests, and exclusive remixes. The rapper promised bigger things ahead as his Millionaire Tour continues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-celebrates-31st-birthday-with-family-shares-rare-pics-of-son-jack-blues-bieber-2687734-2025-03-02",
      "headline": "Justin Bieber celebrates 31st birthday with family, shares rare pics of son JackPop sensation Justin Bieber marked his 31st birthday with a heartwarming family gathering. He shared rare photos with wife Hailey and their son Jack, capturing the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billy-joel-stumbles-and-falls-mid-performance-2687699-2025-03-02",
      "headline": "Singer Billy Joel stumbles and falls mid-performance, fans say 'that's painful'During a recent performance, legendary musician Billy Joel stumbled and fell onstage, causing fans to worry about his health. The incident has sparked widespread concern and discussions about the artist's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-vows-to-bring-grammy-to-india-at-sold-out-delhi-concert-watch-2687670-2025-03-02",
      "headline": "At sold-out Delhi concert, Honey Singh vows to bring Grammys to India. WatchAt his Delhi concert, Honey Singh wowed fans with his hits and vowed to bring a Grammy to India, inspired by AR Rahman's Oscars win. He also expressed his deep love for Delhi and its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-set-to-perform-in-delhi-excited-fans-rush-into-venue-2687561-2025-03-01",
      "headline": "Honey Singh set to perform in Delhi, excited fans rush to the venueSinger and rapper Honey Singh is set to perform in Delhi today as part of his ongoing Millionaire India tour. Ahead of the concert, excited fans were seen rushing to the venue as soon as the gates opened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-online-negativity-against-him-ive-been-here-before-youtube-existed-2687499-2025-03-01",
      "headline": "Honey Singh on online negativity against him: I've been here before YouTube existedSinger and rapper Honey Singh took a dig at those spreading negativity about him through YouTube podcasts. During his Lucknow concert last night, he also spoke about his lifestyle changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-twitter-x-account-hacked-warns-fans-2687489-2025-03-01",
      "headline": "Shreya Ghoshal's X account hacked: Tried every thing in my capacityRenowned singer Shreya Ghoshal has disclosed that her X account has been compromised since February 13. Despite efforts, she remains unable to access or delete the account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rushali-yadav-harsh-arora-splitsvilla-15-contestants-are-engaged-2687457-2025-03-01",
      "headline": "Splitsvilla 15's Rushali Yadav-Harsh Arora engaged: Just perfectly usSplitsvilla 15 contestants Rushali Yadav and Harsh Arora are now engaged. The couple fell in love on the show. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-trailer-ibrahim-ali-khan-khushi-kapoor-romance-netflix-2687443-2025-03-01",
      "headline": "Nadaaniyan trailer: Ibrahim, Khushi's romance comes with a priceIbrahim Ali Khan is all set to making his acting debut in Nadaaniyan, a love story with a secret deal. Also starring Khushi Kapoor, the film explores romance, ambition, and chaos. It will start streaming on Netflix from March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-returns-to-delhi-for-sold-out-millionaire-concert-2687376-2025-03-01",
      "headline": "Honey Singh returns to Delhi for sold-out Millionaire concert: What to expectYo Yo Honey Singh's Millionaire India Tour hits Delhi with a sold-out show, 20,000 fans, top celebs, and a surprise setlist. His parents will attend the concert, making this emotional homecoming extra special. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-wishes-to-team-up-with-diljit-dosanjh-urges-fans-to-make-it-happen-2687276-2025-02-28",
      "headline": "Honey Singh wishes to team up with Diljit Dosanjh, urges fans to make it happenSinger Honey Singh, currently touring India for his Millionaire India Tour, expressed his desire to collaborate with Diljit Dosanjh again during his recent concert in Lucknow. He urged fans to tag the Peaches singer, hoping to reunite for a new project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-reacts-to-comparisons-between-dabba-cartel-and-saas-bahu-aur-flamingo-2687163-2025-02-28",
      "headline": "Shabana Azmi reacts to comparisons between Dabba Cartel and Saas, Bahu Aur FlamingoShabana Azmi addressed concerns over comparisons between her Netflix show Dabba Cartel and Dimple Kapadia's Saas, Bahu Aur Flamingo, emphasising the unique elements of each series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palash-sen-diljit-dosanjh-concert-culture-remark-euphoria-20-remixes-2687019-2025-02-28",
      "headline": "Singer Palash Sen on Diljit's concert culture remark, Euphoria 2.0 and remixesEuphoria's lead vocalist Palash Sen opened up about Diljit Dosanjh's controversial concert culture remark, the rebranding of the band and more in an exclusive interaction with India Today Digital. Sen recently collaborated with Bollywood star Akshay Kumar on the song, Mahakal Chalo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lisa-blackpink-album-alter-ego-review-confident-versatile-powerful-2686930-2025-02-28",
      "headline": "Alter Ego review: Blackpink's Lisa's album is versatile and powerfulLisa of Blackpink releases her solo album Alter Ego. With a total of 15 songs and several collaborations, the album has a lot to take away from, but Lisa shines the brightest in her solo elements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ek-badnaam-aashram-3-part-2-review-bobby-deol-aaditi-pohankar-prakash-jha-chandan-roy-sanyal-2686921-2025-02-28",
      "headline": "Ek Badnaam Aashram 3 part 2 review: Baba Nirala's journey meets a dramatic endReleased-Thu Feb 27, 2025Prakash Jha's most anticipated series, Aashram Season 3 Part 2, is currently streaming on MX Player. The series focusses on Baba Nirala's fate and how his entire kingdom crashes down because of Pammi's quest for revenge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-review-shabana-azmi-and-gang-will-make-your-jaws-drop-with-boredom-2686950-2025-02-28",
      "headline": "Dabba Cartel review: Shabana Azmi is a silent lioness in a challenging storyReleased-Fri Feb 28, 2025'Dabba Cartel' is supposed to be a powerful story of five women who team up to run a cartel in Mumbai. But, the Netflix series ends up becoming a mushy pie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/g-dragon-ubermensch-album-is-out-a-long-overdue-masterpiece-2686904-2025-02-28",
      "headline": "G-Dragon's Übermensch album is out: A long-overdue masterpieceK-pop King G-Dragon is back with a new album after over a decade. Titled Übermensch, the album is a long-overdue masterpiece the fans deserved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/japanese-woman-summoned-for-kissing-bts-jin-without-consent-2686884-2025-02-28",
      "headline": "Japanese woman summoned for kissing BTS' Jin without consentA Japanese woman has been summoned by the South Korean police after she kissed BTS member Jin without his consent during a fan event held last summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-2-review-pushkar-gayathri-crime-drama-is-trapped-in-the-vortex-of-cliches-aishwarya-rajesh-kathir-2686874-2025-02-28",
      "headline": "Suzhal The Vortex 2 review: This crime-drama is trapped in the vortex of clichesReleased-Fri Feb 28, 2025Suzhal - The Vortex 2 review: Created by Pushkar and Gayatri, Suzhal - The Vortex 2 is a crime drama that suffers from overstuffed ideas. The show has interesting ideas, but it gets lost in the overstretched screenplay.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-discusses-food-music-and-korea-in-new-glimpse-of-with-love-meghan-2686840-2025-02-28",
      "headline": "Meghan Markle discusses food, music and Korea in new glimpse of 'With Love, Meghan'Meghan Markle and chef Roy Choi bond over food and the culture of South Korea as they discuss Karoake bars and music in the new promo for her Netflix show, 'With Love, Meghan'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/composer-pritam-thanks-mumbai-police-for-arresting-studio-theft-culprit-2686604-2025-02-27",
      "headline": "Composer Pritam thanks Mumbai Police for arresting studio theft culpritMusic composer Pritam expressed gratitude towards the Mumbai Police for capturing the suspect involved in a Rs 40 lakh theft from his studio. He praised their efforts in a heartfelt Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-boys-5-supernatural-actors-jensen-ackles-jared-padalecki-misha-collins-to-reunite-2686488-2025-02-27",
      "headline": "The Boys 5: Supernatural actors Jensen Ackles, Jared Padalecki to reuniteThe Boys Season 5 will be an exciting reunion as Soldier Boy Jensen Ackles will be joined by his Supernatural co-stars Jared Padalecki and Misha Collins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-review-sass-swag-and-secrets-in-a-soggy-spin-off-2686399-2025-02-27",
      "headline": "Suits LA review: Sass, swag and secrets in a soggy spin-offReleased-Mon Feb 24, 2025'Suits LA' has the flavour of the original 'Suits', but Teddy Black is no Harvey Spector, and you will be reminded of it, despite all the pizazz in the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/o-saathi-re-new-netflix-show-imtiaz-ali-aditi-rao-hydari-avinash-tiwary-arjun-rampal-2686276-2025-02-27",
      "headline": "O Saathi Re: Imtiaz Ali's Netflix series is a modern story with a vintage heartNetflix has released the first look of its new series O Saathi Re, starring Avinash Tiwary, Aditi Rao Hydari, and Arjun Rampal. The series, directed by Arif Ali, will be an 'ode to vintage love in modern times'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-strong-leadership-zelenskyy-days-oval-office-showdown-russia-ukraine-2688937-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ready to work under Trump's strong leadership: Zelenskyy after US pauses aidUkrainian President Volodymyr Zelenskyy said that he is ready to work under Donald Trump's leadership for peace and affirmed Ukraine's willingness to negotiate, a day after Trump paused US assistance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/hyderabad-techie-dies-by-suicide-in-telanganas-raidurgam-over-dowry-harassment-by-husband-2688857-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Techie, 25, dies by suicide in Telangana over alleged dowry harassmentA 25-year-old woman from Telangana, died by suicide allegedly due to dowry harassment by her husband. Her mother filed a complaint, leading to a police case being filed. The authorities have sent the woman's body for a post-mortem to determine further details."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-khyber-pakhtunkhwa-bomb-blasts-reported-terror-attack-bannu-cantonment-2688909-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "9 killed, 25 injured as 2 bomb blasts rock Pakistan's Khyber PakhtunkhwaThe bomb blasts near Bannu Cantonment in Pakistan's Khyber Pakhtunkhwa, allegedly carried out by Jaish ul Fursan and TTP, targeted a security barrier in a coordinated assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-congressman-brands-patidar-volleyball-casteist-gets-schooled-by-indians-social-media-brandon-gill-anti-hindu-2688798-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Congressman brands Patidar volleyball casteist, gets schooled by Indian-AmericansUS Congressman Brandon Gill criticised an Indian-origin person on X, branding a Patidar community volleyball match in the US as \"casteist\". He argued that America had no space for \"foreign class allegiances\". Gill was schooled by several Indian-Americans, who said such remarks spread anti-India and anti-Hindu hate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-to-choose-the-perfect-cheese-mozzarella-cheddar-parmesan-for-a-health-conscious-weight-loss-diet-2688911-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to choose the perfect cheese for a health-conscious dietLove cheese but unsure if it should be part of your diet? Let experts help you decide."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-origin-nurse-attacker-says-indians-are-bad-beat-the-shit-out-of-an-indian-doctor-2688631-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Beat the s*** out of that doctor: US man after assaulting Indian-origin nurseThe Florida hospital patient who brutally attacked an Indian-origin nurse admitted to the hate crime, reported local law enforcement. The attacker was reported to have said, \"Indians are bad. I just beat the s*** out of an Indian doctor,\" sparking outrage and calls for stricter protections.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-signs-mrf-deal-follows-virat-kohli-tendulkar-2688847-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shubman Gill follows Sachin Tendulkar, Virat Kohli's footsteps with MRF dealIndia batter Shubman Gill has signed a deal with renowned Tyre brand MRF as his bat sponsor. He joins an elite club of players such as Sachin Tendulkar, Virat Kohli and Brian Lara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ipad-air-m3-launched-in-india-with-a-new-magic-keyboard-prices-specs-offers-2688894-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "iPad Air M3 launched in India with a new Magic Keyboard: Prices, specs, offersApple has introduced the latest iPad Air in India, powered by the M3 chip. Here are the details, including India price, specs, and sale offers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-vijay-varma-part-ways-breakup-after-dating-for-2-years-source-2688818-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamannaah Bhatia, Vijay Varma part ways after dating for 2 years: SourceActors Tamannaah Bhatia and Vijay Varma have parted ways after dating for two years. The duo had made their relationship public in 2023. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-dhananjay-munde-resigned-from-devendra-fadnavis-cabinet-2688687-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Dhananjay Munde resigned from Devendra Fadnavis cabinetThe torture and murder of a sarpanch and an extortion case in the NCP leader's Beed district had become a major embarrassment for the Mahayuti government\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-shama-mohamed-old-post-attacking-virat-kohli-viral-row-fat-shaming-remarks-rohit-sharma-2688828-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Before fat-shaming Rohit Sharma, Shama Mohamed attacked Virat Kohli in 2018Congress's Shama Mohamed found herself at the centre of controversy over her remarks fat-shaming Rohit Sharma. Now, her 2018 post slamming Virat Kohli has also surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rti-activist-petitions-karnataka-high-court-for-cbi-probe-in-muda-case-against-cm-siddaramaiah-2688914-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Siddaramaiah faces fresh heat as activist seeks CBI probe in Muda caseKarnataka Chief Minister Siddaramaiah faces renewed trouble in the MUDA scam case as complainant Snehamayi Krishna moves the High Court, seeking a CBI probe. This comes three weeks after the court dismissed Krishna's earlier plea, ruling that the Lokayukta's investigation was not biased. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/toru-dutt-indias-first-woman-poet-took-ramayana-global-before-dying-at-21-2688902-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Toru Dutt, India's first woman poet, took Ramayana global before dying at 21Toru Dutt, India's first-ever woman poet, who wrote in English and French, mastered multiple languages and wrote groundbreaking works before dying at 21. Decades before Sarojini Naidu, she introduced the Ramayana and the Mahabharata to the West, and left a legacy that still influences literature today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-stands-by-remarks-warns-kannada-film-industry-is-struggling-2688924-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gave advice to Kannada film industry in my own rustic language: DK ShivakumarKarnataka Deputy Chief Minister DK Shivakumar defended his blunt remarks on Kannada cinema and insisted his words were for the industry's good. He also warned that the industry was struggling despite recent successes.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-verbal-spat-with-tejashwi-lalu-yadav-bihar-2688790-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I made your father: Nitish Kumar's spat with Tejashwi Yadav in Bihar AssemblyTejashwi Yadav, the Leader of Opposition, had hit out at Nitish Kumar, questioning his narrative of Bihar's history before 2005. Nitish Kumar then hit back at Tejashwi Yadav and said he had \"made\" Lalu Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/five-reasons-why-south-india-is-resisting-the-north-push-2688795-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Five reasons why South India is resisting the 'North' pushThe divisions are seen to have only deepened under BJP-led central rule, prompting a fierce confrontation and counter from Opposition-ruled southern states\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-cola-war-got-indians-a-cold-drink-for-just-rs-5-pepsi-coca-cola-champions-trophy-match-india-obesity-day-2688751-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Cola War got Indians a cold drink for just Rs 5With its latest advertisement and pricing, Pepsi has launched the latest Cola War against rival Coca-Cola. Timed with the Champions Trophy semi-final match between India and Australia, it coincided with World Obesity Day. Here's all about the Cola War of the '90s that made cold drink affordable to a much larger section of the population.       "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-lincolnshire-school-bans-mirrors-in-washroom-girls-punctuality-mobile-smartphones-students-2688840-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A school in UK has removed mirrors from its washrooms. Here's whyA UK school removed mirrors from washrooms to reduce time spent in groups. The decision sparked mixed reactions, adding to the ongoing debate over mirrors and phone bans in schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sambhal-masjid-mosque-uttar-pradesh-harihar-mandir-dispute-survey-allahabad-high-court-2688756-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "High Court agrees to refer to Sambhal Mosque as 'disputed structure': ReportAllahabad High Court has designated the Sambhal Jama Masjid as a 'disputed site' while hearing a petition by the mosque committee seeking permission for whitewashing, amid claims that the structure was built over a demolished Hindu temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-pm-modi-inaugurates-plays-orangutan-animal-rehabilitation-centre-in-vantara-feeds-lion-cub-2688581-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: PM Modi plays with orangutan, feeds lion cub at Vantara animal shelterIn a video, the Prime Minister was seen closely interacting and spending time with various species of animals which have been rehabilitated there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-health-hands-bruised-limping-red-marks-wobbling-2688792-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'What's wrong with Donald Trump's hands, legs?' Viral visuals spark health buzzVideos showing US President Donald Trump limping, struggling to exit a golf cart, and with bruised hands have sparked speculation about his health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pinarayi-vijayan-adani-ports-sez-kerala-success-story-vizhinjam-port-importance-explained-vizhinjam-seaport-2688694-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How an Adani Group port became a Communist state's prideKerala's Vizhinjam Port emerged as the biggest handler of cargo among 15 eastern and southern ports in February. This comes within three months of it being commercially operational. The port became a success story only because Communist veteran and Kerala CM Pinarayi Vijayan dared to go ahead with the Adani Group project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-navneet-rana-samajwadi-party-abu-azmi-aurangzeb-grave-2688706-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Remove Aurangzeb's grave from Maharashtra: BJP's Navneet Rana steps up attackSamajwadi Party's Abu Azmi sparked controversy on Monday by praising Mughal emperor Aurangzeb, contradicting historical accounts. His statements claimed Aurangzeb built temples and was not cruel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-address-to-congress-where-to-watch-and-what-to-expect-2688753-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump address to Congress: Where to watch and what to expect  After six eventful weeks in office, marked by sweeping changes such as reciprocal tariffs, mass deportations of illegal migrants, and a breakdown of US-Ukraine relations on live TV, Donald Trump is set to address his first joint session of Congress tomorrow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/shiori-ito-oscar-nominated-documentary-black-box-diaries-not-release-in-japan-noriyuki-yamaguchi-metoo-allegations-2688925-2025-03-04",
      "headline": " Japan's Oscar-nominated documentary Black Box Diaries won't release in the countryFilmmaker Shiori Ito's Oscar-nominated documentary Black Box Diaries has yet to be aired in her home country, Japan. This comes after Ito's rape allegations against a prominent journalist, Noriyuki Yamaguchi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-rejects-lady-superstar-title-her-name-is-closest-to-her-heart-2688934-2025-03-04",
      "headline": "Nayanthara rejects 'Lady Superstar' title, says her name is closest to her heartActor Nayanthara has denounced the title of 'Lady Superstar' and requested fans to call her by name. The actor said how her name is something that she holds closest to her heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/guy-sebastian-on-acting-debut-indian-roots-and-role-in-hindi-vindi-2688885-2025-03-04",
      "headline": "Musician Guy Sebastian on acting debut, Indian roots, and role in Hindi VindiGuy Sebastian, the popular Australian singer, made his acting debut in the film Hindi Vindi alongside Neena Gupta and Mihir Ahuja. In an exclusive chat, he opened up about his Indian roots and working with Gupta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/vir-das-jibe-at-indian-award-shows-oscars-2025-indias-got-latent-2688889-2025-03-04",
      "headline": "Comedian Vir Das takes a jibe at Indian award shows after watching OscarsVir Das recently took a dig at Indian award shows in a new Instagram post. The actor-comedian said that it is risky to do 'edgy jokes' at such events. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-score-virat-kohli-chase-final-dubai-2688941-2025-03-04",
      "headline": "Chase master Virat Kohli fires India into final, sends Australia home Champions Trophy 2025, India vs Australia semifinal: Virat Kohli came up with a solid batting display as India registered a record chase to beat Australia. The Men in Blue qualified for the final of the Champions Trophy for the third successive time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-virat-kohli-odi-run-chases-sachin-tendulkar-8000-runs-2688919-2025-03-04",
      "headline": "Kohli emulates Sachin Tendulkar after 8000 runs in ODI chasesVirat Kohli joins Sachin Tendulkar as only the second batter to cross 8000 runs in ODI run-chases, reinforcing his reputation as India's ultimate chase master after anchoring the Champions Trophy semi-final win over Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-south-africa-vs-new-zealand-sa-vs-nz-lahore-pitch-live-streaming-2688915-2025-03-04",
      "headline": "SA vs NZ, all you need to know: Lahore pitch report, live streamingSouth Africa and New Zealand are all set to lock horns in the second semi-final of the ICC Champions Trophy 2025. Both teams will carry their rich form into the all-important clash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semis-rohit-sharma-flops-travis-head-viral-celebration-2688892-2025-03-04",
      "headline": "Watch: Head celebrates Rohit's wicket after captain flops in semisIndia vs Australia, Champions Trophy 2025: Rohit Sharma failed to make use of two extra opportunities in India's run chase of 264. The captain was dismissed for 28 in the 8th over as Australia got their man despite putting him down twice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-patience-coach-aaqib-javed-vs-india-bowlers-2688887-2025-03-04",
      "headline": "India loss hurts, but need to be patient: Pakistan coach JavedAaqib Javed urged patience amid Pakistan's struggles, stressing that frequent coaching changes and lack of stability are hindering progress. He emphasised stability, even as the repeated defeats to India continue to frustrate fans after their Champions Trophy group-stage exit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-signs-mrf-deal-follows-virat-kohli-tendulkar-2688847-2025-03-04",
      "headline": "Shubman Gill follows Sachin Tendulkar, Virat Kohli's footsteps with MRF dealIndia batter Shubman Gill has signed a deal with renowned Tyre brand MRF as his bat sponsor. He joins an elite club of players such as Sachin Tendulkar, Virat Kohli and Brian Lara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-shreyas-iyer-alex-carey-run-out-robin-uthappa-2688834-2025-03-04",
      "headline": "Shreyas Iyer's run-out of Alex Carey could be turning point: Robin UthappaRobin Uthappa feels that Shreyas Iyer's run-out of Alex Carey could be the turning point in the India vs Australia semi-final in the Champions Trophy 2025. Shreyas pulled off the stunning effort in the 48th over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-rohit-sharma-fume-at-kuldeep-yadav-ind-vs-aus-2688822-2025-03-04",
      "headline": "Watch: Virat Kohli, Rohit Sharma fume at Kuldeep Yadav for not collecting ballIndia captain Rohit Sharma and star batter Virat Kohli were seen fuming at spinner Kuldeep Yadav during their semi final game against Australia in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-south-africa-semi-final-mitchell-santner-press-conference-2688806-2025-03-04",
      "headline": "Would be nice to play Champions Trophy final in Dubai: Mitchell SantnerChampions Trophy 2025: New Zealand captain Mitchell Santner admitted that he would like to play the Champions Trophy final In Dubai as the track supported spin a lot. New Zealand will face South Africa in the semi-final on March 5 in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-visit-pakistan-bcci-semi-final-lahore-new-zealand-vs-south-africa-2688800-2025-03-04",
      "headline": "BCCI vice-president Rajeev Shukla to watch semi-final in Pakistan Champions Trophy 2025: BCCI vice-president Rajeev Shukla will watch the second semi-final between South Africa and New Zealand from Lahore's Gaddafi Stadium on Wednesday. He will visit Pakistan on a two-day trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-semi-final-mitchell-santner-press-conference-2688784-2025-03-04",
      "headline": "Mitchell Santner rues hectic scheduling ahead of Champions Trophy semi-finalMitchell Santner has rued the hectic schedule ahead of the Champions Trophy 2025 semi-final against South Africa in Lahore on Wednesday, February 4. New Zealand come into the game after making the trip to Dubai to face India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-shreyas-iyer-alex-carey-run-out-robin-uthappa-2688834-2025-03-04",
      "headline": "Shreyas Iyer's run-out of Alex Carey could be turning point: Robin UthappaRobin Uthappa feels that Shreyas Iyer's run-out of Alex Carey could be the turning point in the India vs Australia semi-final in the Champions Trophy 2025. Shreyas pulled off the stunning effort in the 48th over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-rohit-sharma-fume-at-kuldeep-yadav-ind-vs-aus-2688822-2025-03-04",
      "headline": "Watch: Virat Kohli, Rohit Sharma fume at Kuldeep Yadav for not collecting ballIndia captain Rohit Sharma and star batter Virat Kohli were seen fuming at spinner Kuldeep Yadav during their semi final game against Australia in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-south-africa-semi-final-mitchell-santner-press-conference-2688806-2025-03-04",
      "headline": "Would be nice to play Champions Trophy final in Dubai: Mitchell SantnerChampions Trophy 2025: New Zealand captain Mitchell Santner admitted that he would like to play the Champions Trophy final In Dubai as the track supported spin a lot. New Zealand will face South Africa in the semi-final on March 5 in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-visit-pakistan-bcci-semi-final-lahore-new-zealand-vs-south-africa-2688800-2025-03-04",
      "headline": "BCCI vice-president Rajeev Shukla to watch semi-final in Pakistan Champions Trophy 2025: BCCI vice-president Rajeev Shukla will watch the second semi-final between South Africa and New Zealand from Lahore's Gaddafi Stadium on Wednesday. He will visit Pakistan on a two-day trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-semi-final-mitchell-santner-press-conference-2688784-2025-03-04",
      "headline": "Mitchell Santner rues hectic scheduling ahead of Champions Trophy semi-finalMitchell Santner has rued the hectic schedule ahead of the Champions Trophy 2025 semi-final against South Africa in Lahore on Wednesday, February 4. New Zealand come into the game after making the trip to Dubai to face India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-ravindra-jadeja-tape-semifinal-umpire-argument-2688770-2025-03-04",
      "headline": "Explained: Why Ravindra Jadeja was asked to remove tape on handChampions Trophy 2025: Ravindra Jadeja was asked to remove a tape on his bowling hand during the Australian innings in Dubai on Tuesday. The all-rounder shone with two wickets in the middle overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-steve-smith-survives-as-bails-remain-intact-after-hitting-2688763-2025-03-04",
      "headline": "Watch: Steve Smith magically survives against Axar PatelAustralia captain Steve Smith survived a close call against Axar Patel as the bails remained miraculously intact after the ball hit the stumps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-virat-kohli-travis-head-wicket-2688764-2025-03-04",
      "headline": "Watch: Virat Kohli celebration goes viral after Travis Head's dismissalVirat Kohli was over the moon and produced a trademark aggressive celebration as Travis Head was dismissed by Varun Chakravarthy during the semi-final clash on Tuesday, March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-rizwan-pakistan-squad-new-zealand-2688739-2025-03-04",
      "headline": "Babar, Rizwan dropped from Pakistan T20I squad for New Zealand tourChampions Trophy 2025: Babar Azam and Mohammad Rizwan have been left out of Pakistan's squad for the T20I series against New Zealand. Pakistan also named their ODI squad and retained Rizwan as their captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-varun-chakravarthy-travis-head-wicket-fan-reaction-2688731-2025-03-04",
      "headline": "Varun Chakravarthy a national treasure: Fans after Head's wicketVarun Chakravarthy sent Indian fans into a frenzy after dismissing Australia's Travis Head in the Champions Trophy semi-final, continuing his red-hot form and giving India a crucial breakthrough early in the high-stakes clash in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-varun-chakravarthy-dismisses-travis-head-ind-vs-aus-2688719-2025-03-04",
      "headline": "Watch: Varun Chakravarthy cures India's 'Head-ache'India wrist spinner Varun Chakravarthy got the big wicket of Travis Head in the semi-final of the ICC Champions Trophy 2025  in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-padmakar-shivalkar-black-armbands-dubai-2688713-2025-03-04",
      "headline": "Indian team sport black armbands to pay respect to Padmakar ShivalkarThe Indian team paid their respects to the late great Padmakar Shivalkar by wearing black armbands for the semi-final against Australia on Tuesday, March 4. Shivalkar passed away on March 3 at the age of 84. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-rohit-sharma-loses-toss-memes-fans-2688682-2025-03-04",
      "headline": "Rohit Sharma nears world record for losing toss, memes go viral India vs Australia semifinal: The rub of green did not go Rohit Sharma's way as the India captain lost the toss for the 11th successive time. Steve Smith, Australia's stand-in captain, opted to bat on a sluggish pitch in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-varun-chakravarthy-travis-head-wicket-fan-reaction-2688731-2025-03-04",
      "headline": "Varun Chakravarthy a national treasure: Fans after Head's wicketVarun Chakravarthy sent Indian fans into a frenzy after dismissing Australia's Travis Head in the Champions Trophy semi-final, continuing his red-hot form and giving India a crucial breakthrough early in the high-stakes clash in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-varun-chakravarthy-dismisses-travis-head-ind-vs-aus-2688719-2025-03-04",
      "headline": "Watch: Varun Chakravarthy cures India's 'Head-ache'India wrist spinner Varun Chakravarthy got the big wicket of Travis Head in the semi-final of the ICC Champions Trophy 2025  in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-padmakar-shivalkar-black-armbands-dubai-2688713-2025-03-04",
      "headline": "Indian team sport black armbands to pay respect to Padmakar ShivalkarThe Indian team paid their respects to the late great Padmakar Shivalkar by wearing black armbands for the semi-final against Australia on Tuesday, March 4. Shivalkar passed away on March 3 at the age of 84. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-rohit-sharma-loses-toss-memes-fans-2688682-2025-03-04",
      "headline": "Rohit Sharma nears world record for losing toss, memes go viral India vs Australia semifinal: The rub of green did not go Rohit Sharma's way as the India captain lost the toss for the 11th successive time. Steve Smith, Australia's stand-in captain, opted to bat on a sluggish pitch in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-two-extra-spinners-team-news-cooper-conally-adam-zampa-2688681-2025-03-04",
      "headline": "Australia add 2 extra spinners to support Adam Zampa vs IndiaAustralia have stacked their Playing XI with spin options for the Champions Trophy semi-final against India, bringing in Cooper Connolly and Tanveer Sangha to partner Adam Zampa, as they look to counter Dubai's spin-friendly conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-varun-chakravarthy-four-spinners-dubai-2688680-2025-03-04",
      "headline": "IND vs AUS: Varun Chakravarthy retains spot as India go with 4 spinnersIndia have decided to stick with the four spinners mantra as Varun Chakravarthy retained his spot in the playing XI for the semi-final against Australia in Dubai on Tuesday, March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-winning-toss-rohit-sharma-aakash-chopra-2688633-2025-03-04",
      "headline": "Rohit must win toss vs Australia: Aakash Chopra on India's semi-finalAakash Chopra believes India winning the toss in their Champions Trophy semi-final against Australia could be decisive, as Rohit Sharma's luck with the coin continues to be a concern ahead of the crucial knockout clash in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-magnus-carlsen-jeans-sold-36100-dollars-ebay-2688621-2025-03-04",
      "headline": "94 bids, 36,100 USD: Magnus Carlsen's 'Jeansgate' denims gets sold on eBayMagnus Carlsen's infamous 'Jeangate' denims sold for a whopping 36,100 dollars on eBay. Carlsen put the jeans for auction in February this year and the proceedings went to a charity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-travis-head-memes-fan-reaction-2688610-2025-03-04",
      "headline": "India vs Travis Head, not Australia: Fans start meme fest ahead of semi-finalAs India prepare for their Champions Trophy semi-final against Australia, fans are once again wary of Travis Head's threat. Memes and discussions highlight concerns over Head's past dominance, making his wicket a crucial target for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-travis-head-aakash-chopra-2688599-2025-03-04",
      "headline": "Change jersey colour? Aakash Chopra's hilarious take on stopping Travis HeadAakash Chopra joked that India may have to change their jersey colour from blue to stop Travis Head ahead of the semi-final on Tuesday, March 4. Head has tormented India in the recent past by scoring big hundreds in ICC events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ravi-shastri-semi-final-unchanged-xi-2688593-2025-03-04",
      "headline": "Ravi Shastri suggests India to go with unchanged XI for semi-final Champions Trophy 2025: Ravi Shastri said that India should go in with the same playing for the semi-final against Australia after beating New Zealand in their last Group match on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-jake-fraser-mcgurk-ipl-2024-form-ricky-ponting-2688580-2025-03-04",
      "headline": "Ricky Ponting wants IPL 2024-mode Jake Fraser-McGurk in semi-final vs IndiaRicky Ponting has urged Jake Fraser-McGurk to replicate his IPL 2024 form as Australia face India in the Champions Trophy semi-final. With Matthew Short ruled out, Fraser-McGurk's place in the playing XI remains a key decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-axar-patel-india-vs-australia-knockout-2688565-2025-03-04",
      "headline": "Axar Patel could be India's trump card for Champions Trophy knockout stageAxar Patel has emerged as India's game-changer in the Champions Trophy, delivering match-winning performances with both bat and ball. As India gear up for their semi-final against Australia, his impact could be the defining factor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-prediction-sunil-gavaskar-dubai-2688568-2025-03-04",
      "headline": "India has psychological advantage vs Australia in semis: GavaskarSunil Gavaskar feels that India will have a psychological advantage over Australia in the semi-final on Tuesday, March 4. India have won all their matches that they have played in Dubai so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-prediction-brad-haddin-rohit-sharma-steve-smith-2688555-2025-03-04",
      "headline": "All the pressure on India in semi-final clash, none on Australia: Brad HaddinFormer wicketkeeper Brad Haddin has claimed that all the pressure will be on India in the semi-final against Australia. Haddin also said that Australia won't have any pressure on them and feels that they can beat India in Dubai. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}