{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/life-insurance-india-why-most-indians-are-underinsured-term-vs-endowment-explainer-how-to-choose-cover-2857105-2026-01-24",
      "headline": "Why most Indians are still underinsured despite buying insuranceSeveral insurer-backed studies show that a large share of Indian policyholders have life cover of less than five times their annual income. Most financial planners recommend at least 10 to 15 times annual income, and often more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/will-ai-kill-jobs-across-the-globe-and-how-can-india-ride-the-ai-wave-experts-weigh-in-2857006-2026-01-23",
      "headline": "Will AI kill jobs across the globe and how can India ride the AI wave? Experts weigh inIn this India Today special show from the World Economic Forum in Davos, top artificial intelligence innovators share their perspectives on the global AI race, AI's impact on the Indian economy and much more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-income-protection-to-easier-credit-what-gig-workers-expect-from-budget-2026-2856878-2026-01-23",
      "headline": "From income protection to easier credit: What gig workers expect from Budget 2026Delivery partners, drivers and freelancers form the backbone of India's fast-growing gig economy, yet financial security remains fragile for many. As Budget 2026 approaches, gig workers are hoping for measures that offer income protection, smoother credit access and faster support during emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-shines-at-record-highs-what-should-investors-do-now-2856796-2026-01-23",
      "headline": "Gold shines at record highs: What should investors do now?With gold touching new lifetime highs, the metal has once again proved its role as a refuge in uncertain times. But for investors, the rally raises a key question: what is the right move at current levels? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-personal-loans-becoming-the-go-to-option-during-medical-emergencies-2856764-2026-01-23",
      "headline": "Are personal loans becoming the go-to option during medical emergencies?A sudden medical emergency can quickly turn into a financial crisis. With healthcare costs rising and insurance cover often falling short, many Indian families are increasingly turning to personal loans to bridge the gap."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-2856763-2026-01-23",
      "headline": "Sensex sinks 770 points, Nifty tumbles as FII selling hits sentiment hardMarkets slipped sharply as foreign investor selling, sector-wide pressure and a weakening rupee crushed sentiment. With Nifty near a key support zone, the next few sessions could set the tone for February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-sensex-down-750-points-nifty-tumble-reason-fii-selling-2856718-2026-01-23",
      "headline": "Sensex down nearly 800 points at closing: Why stock market fell todayAt the closing bell, the S&P BSE Sensex was down 769.67 points at 81,537.70 and the NSE Nifty50 slipped 241.25 points to 25,048.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-accuses-pwc-and-ey-executives-in-yes-banks-2022-share-sale-report-2856713-2026-01-23",
      "headline": "Sebi accuses PwC and EY executives in Yes Bank's 2022 share sale: ReportIn total, 19 individuals have been accused of insider trading violations. Seven are alleged to have traded using privileged information, while four are accused of sharing it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-help-make-insurance-more-affordable-for-indians-2856656-2026-01-23",
      "headline": "Can Budget 2026 help make insurance more affordable for Indians?With healthcare costs rising and insurance still out of reach for many, Budget 2026 is being closely watched by households and insurers alike. Industry leaders believe the right tax and policy moves could make insurance more affordable for millions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/french-president-emmanuel-macron-viral-davos-shades-give-ivision-tech-a-38-crore-stock-boost-2856639-2026-01-23",
      "headline": "French President's viral Davos shades give iVision Tech a 38 crore stock boostFrench President Emmanuel Macron's look during his World Economic Forum speech went viral online and the market reacted instantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-easier-credit-to-insurance-what-msmes-want-from-union-budget-2026-2856627-2026-01-23",
      "headline": "From easier credit to insurance: What MSMEs want from Union Budget 2026As the Union Budget 2026 approaches, MSMEs are looking for practical support to ease everyday financial pressures. Industry leaders say better access to credit, lower insurance costs and simpler rules could help small businesses grow with confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/earning-50000-month-how-to-invest-smartly-build-portfolio-investment-plan-salary-2856594-2026-01-23",
      "headline": "Is Rs 50,000 salary enough to invest? Sebi advisor explains what actually worksFinancial advisors say this income level is enough to begin building a long-term portfolio, provided the focus remains on discipline, safety and clear financial goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indigo-share-price-today-why-indigo-stock-fell-after-q3-results-interglobe-aviation-buy-sell-hold-2856574-2026-01-23",
      "headline": "IndiGo share price down 4% after Q3 results: Buy, sell or hold?IndiGo share price: The stock slipped as much as 3.9% during early trade to hit an intraday low of Rs 4,723.60. It later recovered part of the losses but continued to trade in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-record-highs-should-investors-buy-sell-2856563-2026-01-23",
      "headline": "Gold and silver hit new highs again. Should you still buy?While the domestic trend remains sharply bullish, experts say understanding the broader backdrop can help investors think about why the rally is persisting and what it could mean for portfolios this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/infosys-hiring-plans-20000-graduates-in-fy27-as-ai-demand-surges-2856555-2026-01-23",
      "headline": "Infosys to hire 20,000 graduates in FY27 as AI demand surges: ReportInfosys is gearing up for heavier AI workloads in 2026 and beyond, and the scale of its campus hiring shows where the company believes client spending is beginning to stabilise and grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-in-green-over-improved-global-cues-tcs-up-1-2856536-2026-01-23",
      "headline": "Sensex, Nifty open in green over improved global cues; TCS up 1%The S&P BSE Sensex was up by 77.47 points to 82,384.84, while the NSE Nifty50 added 31.95 points to 25,321.85 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-update-employee-bodies-meeting-salary-hike-demands-report-2856518-2026-01-23",
      "headline": "8th Pay Commission: Employee bodies to meet soon to finalise salary hike demandsThe meeting will be held under the banner of the National Council (Staff Side) of the Joint Consultative Machinery, which represents central government employees in discussions with the government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-ipo-allotment-status-check-online-guide-gmp-listing-gains-bse-kfin-subscription-2856508-2026-01-23",
      "headline": "Shadowfax IPO allotment: Step-by-step guide to check status and listing gainsInvestors who applied for Shadowfax IPO can check their allotment status online through the Bombay Stock Exchange (BSE) website or the portal of KFin Technologies Limited, which is the official registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-sues-jpmorgan-chase-ceo-jamie-dimon-for-5-billion-over-alleged-debanking-claims-glbs-2856442-2026-01-22",
      "headline": "Trump sues JPMorgan Chase, CEO Jamie Dimon for $5bn over alleged debankingDonald Trump has filed a $5 billion lawsuit against JPMorgan Chase for closing his bank accounts. The case raises questions about political bias and banking practices in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gita-gopinath-says-2026-will-be-a-year-of-high-uncertainty-and-volatility-2856421-2026-01-22",
      "headline": "Gita Gopinath says 2026 will be a year of high uncertainty and volatilityIn an exclusive interaction with India Today at Davos, Harvard Professor and former IMF Deputy Managing Director Gita Gopinath said that 2026 will be a year of high levels of uncertainty and high levels of volatility. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/new-talent-timeless-craft-malayalam-cinema-new-age-actors-and-their-legacy-2857056-2026-01-24",
      "headline": "New talent, timeless craft: Malayalam cinema's new-age actors and their legacy As Malayalam cinema expands its pan-Indian and global footprint, a new generation of actors is stepping into larger creative and commercial roles — balancing the industry's legacy of rooted storytelling with Gen-Z authenticity, genre experimentation and growing cross-industry ambition.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-box-office-collection-day-1-detailed-report-sunny-deol-film-beats-dhurandhar-chhaava-not-gadar-2-2857120-2026-01-24",
      "headline": "Border 2 box office Day 1: Sunny Deol film beats Dhurandhar, Chhaava; not Gadar 2 Sunny Deol's Border 2 opened on a solid note at the box office on Friday. While it surpassed the first day business of both Chhaava and Dhurandhar, it couldn't overshadow Sunny's previous blockbuster, Gadar 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-dhanush-viral-wedding-photo-chennai-ai-generated-fake-2857110-2026-01-24",
      "headline": "Mrunal Thakur- Dhanush viral wedding photo sparks buzz, but here's the truth A digitally created image of actors Mrunal Thakur and Dhanush at a wedding altar has gone viral. The photo has fuelled speculation about their marital status. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-is-not-a-bad-film-just-not-the-border-we-remember-border-2-special-review-sunny-deol-varun-dhawan-2856939-2026-01-24",
      "headline": "Border 2 isn't a bad film, just not the Border we remember Border 2 is a sincere, large-scale war film that struggles under the weight of an iconic legacy. Despite visible effort and solid performances, it can't quite recreate the emotional intimacy that made Border unforgettable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anthony-hopkins-discusses-family-estrangement-and-why-he-wont-waste-blood-2857084-2026-01-24",
      "headline": "Anthony Hopkins discusses family estrangement and why he won't 'waste blood' Anthony Hopkins offered a candid account of his estranged relationship with his daughter during a recent podcast. The veteran British actor said he wishes her well but is moving on now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dj-fat-tony-recalls-dance-floor-row-at-beckham-wedding-party-no-spice-girl-action-2857088-2026-01-24",
      "headline": "No Spice Girl action: DJ Fat Tony recalls dance floor row at Beckham wedding party DJ Fat Tony opened up a tense incident during Brooklyn Beckham and Nicola Peltz Beckham's wedding. He recalled that Victoria's dance left Nicola in tears. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ott-platforms-dominate-south-indian-cinema-post-covid-reshaping-theatrical-release-deals-2856140-2026-01-24",
      "headline": "The OTT takeover: How streaming giants now assert control over South cinema The OTT revolution has transformed South Indian cinema's business model since the pandemic. This shift places streaming platforms in control, challenging traditional theatrical practices and producers' influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/free-bert-review-there-more-to-bert-kreischer-than-his-loud-shirtless-outings-2857027-2026-01-23",
      "headline": "Free Bert review: There's more to Bert Kreischer than his loud shirtless outingsRelease Date:Mon Jan 12, 2026 Free Bert features Bert Kreischer as a fictionalised version of himself navigating the image-obsessed culture of Beverly Hills. The Netflix sitcom explores the tension between his loud, shirtless persona and the desire to change for his daughters, questioning if maturity requires self-erasure. Here's our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ishaan-khatter-praises-neeraj-ghaywan-after-homebound-misses-out-on-oscars-2857007-2026-01-23",
      "headline": "Ishaan Khatter praises Neeraj Ghaywan after Homebound misses out on Oscars Ishaan Khatter praised Neeraj Ghaywan after Homebound missed getting a nomination at the 2026 Oscars. The film also featured actors Vishal Jethwa and Janhvi Kapoor in key roles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chriss-pratt-said-he-photoshopped-himself-as-batman-recalls-james-gunn-reaction-2856988-2026-01-23",
      "headline": "Chris Pratt said he photoshopped himself as Batman, recalls James Gunn's reaction Chris Pratt revealed he pitched a great vision to Kevin Feige for Star-Lord's return to the MCU. He also recalled James Gunn's reaction after he photoshopped his Batman pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-defends-varun-dhawan-against-trolls-calls-the-film-sure-shot-winner-2856970-2026-01-23",
      "headline": "Karan Johar defends Varun Dhawan against trolls, calls the film sure shot winner Karan Johar defended Varun Dhawan against trolls over his smile in Border 2. The filmmaker called the film a sure-shot winner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/assi-motion-poster-out-taapsee-pannu-leads-anubhav-sinha-investigative-thriller-2856915-2026-01-23",
      "headline": "Assi motion poster out: Taapsee Pannu leads Anubhav Sinha's investigative thriller The motion poster of Taapsee Pannu's investigative thriller Assi, was released on January 23, 2026. The upcoming film is directed by Anubhav Sinha.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paro-trupti-bhoir-reveals-shocking-research-taha-shah-talks-of-haryanvi-prep-2856595-2026-01-23",
      "headline": "Paro: Trupti Bhoir reveals shocking research, Taha Shah talks of Haryanvi prep Actor Taha Shah Badussha and Trupti Bhoir reflect on making Paro, a film about bride slavery. In an exclusive interview, Taha spoke about Haryanvi prep and on-set conversations with Farida Jalal. Trupti delved deeper into the shocking research for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-controversy-manoj-muntashir-mithoon-celebrity-responsibility-freedom-expression-2856827-2026-01-23",
      "headline": "Manoj Muntashir, Mithoon react to AR Rahman controversy: India celebrates him Manoj Muntashir and Mithoon share their perspectives on AR Rahman's communalism remarks. They highlight the importance of careful speech and condemn the social media backlash that followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-miss-hong-review-park-shin-hye-powers-a-charming-corporate-caper-2856921-2026-01-23",
      "headline": "Undercover Miss Hong review: Park Shin-hye powers a charming corporate caperRelease Date:Fri Jan 17, 2025 Netflix's Undercover Miss Hong blends corporate thriller with campus comedy in 1997 Seoul. Park Shin-hye leads as a determined investigator undercover amid insider trading and family drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-adoor-gopalakrishnan-reunite-malayalam-film-padayaatra-2856629-2026-01-23",
      "headline": "Padayaatra: Mammootty and Adoor Gopalakrishnan reunite after 32 years Actor Mammootty and director Adoor Gopalakrishnan have reunited for the Malayalam film Padayaatra, marking their first project together in over three decades. The film was officially announced with a title poster launch and puja ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/baby-girl-review-nivin-pauly-film-promising-core-but-convenience-takes-over-2856896-2026-01-23",
      "headline": "Baby Girl review: Nivin Pauly's film has promising core, but convenience takes overRelease Date:Fri Jan 23, 2026 Baby Girl movie review: Baby Girl, directed by Arun Varma and starring Nivin Pauly, Lijomil Jose, Sangeeth Prathap, and Abhimanyu Shammi Thilakan, is an emotional thriller about the kidnapping of a three-day-old baby. The film struggles to balance drama and thriller elements, ultimately failing to do justice to either genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/palash-muchhal-rejects-rs-40-lakh-fraud-allegation-vows-to-take-legal-action-2856847-2026-01-23",
      "headline": "Palaash Muchhal rejects Rs 40 lakh fraud allegation, vows to take legal action Palaash Muchhal reacted to the Rs 40 lakh fraud allegations and alleged that it had been made with malicious intent. He said that the matter will be dealt with strictly through the appropriate legal channels.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/india-today-launches-the-legends-series-with-rajdeep-sardesai-and-zubin-mehta-2856885-2026-01-23",
      "headline": "The Legends: Rajdeep Sardesai's new show explores lives that shaped India This Republic Day, India Today will launch The Legends: Lives That Shaped A Nation, featuring Rajdeep Sardesai in conversation with India's biggest living legends. The inaugural edition will feature Western classical musician and Padma Vibhushan recipient Zubin Mehta"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-nato-allies-countries-afghanistan-front-lines-fact-check-deaths-cost-2857104-2026-01-24",
      "headline": "Trump says Nato avoided Afghanistan war front line. Here is the realityUS President Donald Trump's claim that Nato troops stayed back from the front lines during the 20-year war in Afghanistan has sparked widespread outrage among European military veterans and relatives of the fallen. Did Nato avoid the Afghan war front line? Here is what facts and data tell us."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-all-out-war-warns-donald-trump-us-military-action-2857061-2026-01-24",
      "headline": "Will respond in hardest way possible: Trump warned as warships head to IranA senior Iranian official said the Ayatollah Khamenei regime would ensure that 'everything at its disposal' would be used to push back against what he called a constant military threat from Trump."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-khyber-pakhtunkhwa-suicide-bomber-blast-targets-wedding-ceremony-2857062-2026-01-24",
      "headline": "7 killed, 25 injured as suicide bomber targets wedding ceremony in PakistanSeven people were killed and 25 injured when a suicide bomber blew himself up at a wedding ceremony at the home of a pro-government community leader in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/actor-kamaal-r-khan-detained-for-firing-4-rounds-at-residential-building-in-mumbais-oshiwara-gun-recovered-2857030-2026-01-23",
      "headline": "Actor Kamaal R Khan arrested for firing 4 rounds at Mumbai residential buildingMumbai Police arrested KRK after he fired four rounds from his licenced firearm that struck a residential building in Andheri where writer-director Neeraj Kumar Mishra lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/gen-z-vs-millennials-corporate-world-culture-traditional-household-2856961-2026-01-24",
      "headline": "Why Gen Z is the chhoti bahu of the corporate worldHandcrafted ByOur Editors Gen Z is the chhoti bahu of the corporate world, setting boundaries, prioritising mental health, and refusing to glorify burnout. Millennials, the badi bahu of workplaces, quietly carried the weight of commitment and sacrifice, yet rarely received credit for it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-winter-storm-snow-ice-power-outages-united-states-rain-texas-flight-cancelled-texas-oklahoma-and-kansas-2857103-2026-01-24",
      "headline": "Monster winter storm sweeps US, 7000 flights cancelled over weekendA massive winter storm is threatening to blanket nearly half of the United States with snow, sleet and ice, while plunging temperatures to bone-chilling lows and triggering widespread power outages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/faridabad-man-beats-daughter-to-death-kills-4-year-old-failing-to-write-numbers-till-50-2857106-2026-01-24",
      "headline": "Faridabad man kills daughter over homework, arrested after wife informs policeThe four-year-old died at home after her father allegedly assaulted her for failing a writing task. Police arrested the accused and sent him to one-day remand for investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-red-card-indonesia-masters-quarter-final-lakshya-sen-defeat-2856765-2026-01-23",
      "headline": "PV Sindhu shown red card in Indonesia Masters, Lakshya crashes outIndonesia Masters: India's top shuttler PV Sindhu crashed out of the Indonesia Masters after losing in straight games to top seed Chen Yu Fei. Sindhu was also shown a red card midway through the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ott-platforms-dominate-south-indian-cinema-post-covid-reshaping-theatrical-release-deals-2856140-2026-01-24",
      "headline": "The OTT takeover: How streaming giants now assert control over South cinemaHandcrafted ByOur Editors The OTT revolution has transformed South Indian cinema's business model since the pandemic. This shift places streaming platforms in control, challenging traditional theatrical practices and producers' influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-tamil-and-sanskrit-enigmatic-embrace-and-engagement-part-17-340-23-01-2026",
      "headline": "Time, Tide & Tamil Part 17 | Tamil and Sanskrit: Enigmatic Embrace and EngagementSubcontinental literary history reveals two distinct traditions that conducted a centuries-long, sophisticated dialogue rather than a mere clash. If Tamil was the primordial pulse of the peninsula — forging its identity in earthy Sangam poetry — Sanskrit brought the Vedas, new grammar, and fresh philosophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-greenland-penguins-white-house-trolled-internet-arctic-territory-deal-twitter-post-viral-picture-2857068-2026-01-24",
      "headline": "White House shares Greenland post ft penguin, savage reality check followsThe White House shared an AI-generated image of US President Donald Trump with a penguin in Greenland. The post quickly went viral and invited a savage reality check from the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-slams-canada-over-golden-dome-warns-china-will-eat-them-up-2857049-2026-01-24",
      "headline": "China will eat them up: Trump on Canada opposing Golden Dome over GreenlandDonald Trump accused Canada of opposing the Golden Dome missile shield over Greenland despite its protective benefits, claiming Ottawa instead chose closer business ties with China, which he warned would quickly exploit them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dj-fat-tony-recalls-dance-floor-row-at-beckham-wedding-party-no-spice-girl-action-2857088-2026-01-24",
      "headline": "No Spice Girl action: DJ Fat Tony recalls dance floor row at Beckham wedding partyDJ Fat Tony opened up a tense incident during Brooklyn Beckham and Nicola Peltz Beckham's wedding. He recalled that Victoria's dance left Nicola in tears. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-announces-up-to-ps3-million-in-scholarships-empowering-future-global-leaders-2856640-2026-01-23",
      "headline": "University of Bath School of Management announces up to £3 million in scholarships, empowering future global leadersStrategic Scholarship Investment Aimed at Attracting Exceptional Talent Worldwide"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-woman-urban-company-massage-therapist-physical-altercation-session-was-cancelled-2856870-2026-01-23",
      "headline": "Video: Hair pulled, punches thrown as woman, masseuse fight after session cancelledThe complainant claimed that the altercation took place after she booked a massage through a popular app-based aggregator for treatment of a frozen shoulder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/life-insurance-india-why-most-indians-are-underinsured-term-vs-endowment-explainer-how-to-choose-cover-2857105-2026-01-24",
      "headline": "Why most Indians are still underinsured despite buying insuranceSeveral insurer-backed studies show that a large share of Indian policyholders have life cover of less than five times their annual income. Most financial planners recommend at least 10 to 15 times annual income, and often more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-cinderella-man-comeback-india-vs-new-zealand-2857042-2026-01-24",
      "headline": "Ishan Kishan's Cinderella Man comeback: An overlooked talent to India's wildcardIshan Kishan continues to stun people, and he showed that he is currently Indian cricket's Cindrella Man with his match-winning knock against New Zealand in Raipur. After a hard grind back in the domestic circuit, Jharkhand seems to have matured as a player and a leader. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/miami-university-a-top-us-destination-for-future-tech-and-engineering-leaders-2856701-2026-01-23",
      "headline": "Miami University: A Top U.S. Destination for Future Tech and Engineering LeadersMiami University Expands Opportunities for International Students Through Industry-Integrated Computer Science & Engineering Programs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-563-23-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-kerala-cm-face-decision-postponed-unity-urged-ahead-of-assembly-polls-2857077-2026-01-24",
      "headline": "Who will be Congress's Kerala CM face? What transpired at key Delhi meetThe Congress leadership has urged unity among its Kerala leaders as the party gears up for the high-stakes Assembly elections, scheduled to be held before May this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-is-not-a-bad-film-just-not-the-border-we-remember-border-2-special-review-sunny-deol-varun-dhawan-2856939-2026-01-24",
      "headline": "Border 2 isn't a bad film, just not the Border we rememberBorder 2 is a sincere, large-scale war film that struggles under the weight of an iconic legacy. Despite visible effort and solid performances, it can't quite recreate the emotional intimacy that made Border unforgettable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/anti-india-rhetoric-flares-online-after-texas-h-1b-journalist-sara-gonzaless-video-sparks-backlash-2857057-2026-01-24",
      "headline": "Anti-India rhetoric flares after Texas journalist's H-1B video goes viralAnti-India and anti-Hindu remarks by a self-described MAGA supporter drew backlash after a Texas journalist's H-1B visa video went viral, fuelling online outrage and debate over immigration enforcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-indians-have-high-bad-cholesterol-and-higher-heart-attack-risk-tells-cardiologist-2856809-2026-01-24",
      "headline": "Why Indians have high bad cholesterol and higher heart attack risk, tells cardiologistIndians face higher rates of bad cholesterol and heart disease earlier than Westerners. Learn why this happens, the role of lifestyle and genetics, and how diet and exercise can lower heart attack risk."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/whatever-happened-to-global-warming-president-trump-asks-as-winter-storm-grips-us-2857045-2026-01-24",
      "headline": "Whatever happened to global warning: Trump's mockery as winter storm grips USDonald Trump mocked global warming on Truth Social as a massive winter storm threatened 40 US states, reviving his climate skepticism while forecasters warned of dangerous cold, ice and widespread disruptions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-abhishek-sharma-inside-mind-number-1-batter-method-to-madness-t20-world-cup-2857117-2026-01-24",
      "headline": "Inside Abhishek Sharma's mind: What makes him the No.1 T20I batter in the world The evolution of Abhishek Sharma is the most important plotline for India ahead of the T20 World Cup 2026. In this story we go inside his mind and try to find out what made him the No.1 batter in the T20I format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sunil-gavaskar-on-suryakumar-yadav-technique-raipur-t20i-2857108-2026-01-24",
      "headline": "How Suryakumar Yadav rediscovered his golden touch? Sunil Gavaskar explains Sunil Gavaskar highlights a major technical shift that helped Suryakumar Yadav regain form. Suryakumar played a scintillating knock of 82 off 37 balls, laced with nine fours and four sixes, to help India chase down 209 in second T20I against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-suryakumar-yadav-return-to-form-shivam-dube-enjoyed-prediction-comes-true-2857085-2026-01-24",
      "headline": "Suryakumar Yadav back in form: Shivam Dube delighted after his prediction comes true Shivam Dube's faith in Suryakumar Yadav finally paid off in Raipur. The India captain's return to form against New Zealand delighted Dube and powered a record-breaking chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-cinderella-man-comeback-india-vs-new-zealand-2857042-2026-01-24",
      "headline": "Ishan Kishan's Cinderella Man comeback: An overlooked talent to India's wildcard Ishan Kishan continues to stun people, and he showed that he is currently Indian cricket's Cindrella Man with his match-winning knock against New Zealand in Raipur. After a hard grind back in the domestic circuit, Jharkhand seems to have matured as a player and a leader. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-india-reliant-abhishek-sharma-champions-silence-concern-t20-world-cup-warning-2857041-2026-01-24",
      "headline": "India too reliant on Abhishek? Champions silence concerns, fire T20 World Cup warning IND vs NZ: India brushed aside all the lingering doubts regarding them in style, chasing down a whopping total in record time and proving they are indeed the champions and the ones to beat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-comeback-hiatus-domestic-cricket-india-vs-new-zealand-raipur-2857038-2026-01-24",
      "headline": "Can I do it again? How Ishan Kishan found his answers during India hiatus Ishan Kishan revealed how his time away from the Indian team helped him rediscover himself after his match-winning 76 against New Zealand in Raipur. The wicketkeeper-batter spoke about domestic cricket hustle and how he made his way back into the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-suryakumar-yadav-angry-ishan-kishan-raipur-record-chase-2857034-2026-01-24",
      "headline": "Suryakumar Yadav jokes he was mad at Ishan Kishan during statement knock in Raipur IND vs NZ: Suryakumar Yadav revealed he was briefly \"angry\" with Ishan Kishan for hogging the strike, after the duo smashed 82 off 37 and 76 off 32 to script India's stunning 209-run chase in Raipur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-day-7-updates-jannik-sinner-novak-djokovic-iga-swiatek-2857044-2026-01-24",
      "headline": "AUS Open, Day 7 Live: Sinner makes comeback vs Spizzirri, but heat halts play Australian Open Day 7 Live Score and updates: The action rolls into day 7 as Jannik Sinner and Novak Djokovic will be in third round action on Saturday, January 24. Iga Swiatek will be the big name in the women's side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asif-nazrul-bangladesh-t20-world-cup-fate-india-standoff-2857011-2026-01-23",
      "headline": "Watch: Bangladesh sports advisor acknowledges T20 World Cup fate on live TV T20 World Cup: Bangladesh sports advisor Asif Nazrul appeared to concede the team's uncertain T20 World Cup fate on live TV, as the standoff over playing matches in India threatens to push Bangladesh out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-suryakumar-india-vs-new-zealand-2nd-t20i-raipur-2857008-2026-01-23",
      "headline": "Raipur T20I: Ishan-daar, Surya-uday again as India race to 209 in world record chase Ishan Kishan's 76 off 32 and Suryakumar Yadav's first T20I fifty in 23 innings powered India to a record chase vs New Zealand in Raipur. India finished off the chase within 15.2 overs to smash a world record in T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-rishabh-pant-bat-flying-raipur-india-vs-new-zealand-2856996-2026-01-23",
      "headline": "IND vs NZ: Ishan Kishan channels inner Rishabh Pant, sends bat flying in Raipur Ishan Kishan channeled his inner Rishabh Pant as the southpaw sent the bat flying in Raipur during his record-breaking fifty against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-delhi-capitals-16-year-old-prodigy-deeya-yadav-ruled-out-injury-2856971-2026-01-23",
      "headline": "Delhi Capitals' 16-year-old prodigy ruled out of WPL 2026 due to injuryWPL 2026: 16-year-old Deeya Yadav has been ruled out of the remainder of WPL 2026 due to injury, forcing Delhi Capitals to name Pragati Singh and E Srujana as replacements as their playoff race intensifies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-boycott-without-player-consent-2856967-2026-01-23",
      "headline": "Players not consulted in Bangladesh's T20 World Cup boycott: ReportThe Bangladesh players weren't consulted before the decision was made to boycott the T20 World Cup 2026, according to a latest report. Bangladesh is all set to be replaced by Scotland from the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-cruz-hewitt-roger-federer-twins-daughters-chilling-jannik-sinner-match-2856776-2026-01-23",
      "headline": "Cruz Hewitt's son chills with Federer twins at Australian OpenThe next generation of a famous tennis rivalry shared a moment at Melbourne Park as Cruz Hewitt watched the Australian Open alongside Roger Federer's twin daughters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-abhishek-sharma-new-fear-factor-harbhajan-2856950-2026-01-23",
      "headline": "Dhoni, Tendulkar, now Abhishek: Harbhajan says opener is India's new fear factorHarbhajan Singh heaped praise on Abhishek Sharma and said that the opener has become the new fear factor for the Indian team. Abhishek has made a stunning start to his T20I career for India and is the No. 1-ranked T20I batter in the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/sonal-mehrotra-kapoor-is-toxic-air-threatening-indias-2036-olympic-ambitions-ytvd-2856905-2026-01-23",
      "headline": "Is Toxic Air Threatening India's 2036 Olympic Ambitions?In this special report, Sonal Mehrotra Kapoor examines the escalating pollution crisis in North India and its detrimental impact on the nation's sporting aspirations. Kapoor highlights that the 'air emergency choking North India and several other parts of the country isn't just a health hazard anymore, it's a national liability.' The programme discusses how toxic air quality is jeopardising India's bid for the 2036 Olympics, with Ahmedabad as the frontrunner. Joined by colleague Nikhil Naz, the discussion covers instances where international athletes, including badminton star Anders Antonsen, have raised alarms or refused to play in Delhi. The report further details how pollution affects athlete training, lung capacity, and the overall feasibility of hosting global events like the Commonwealth Games and the ODI World Cup. Kapoor concludes that the environmental crisis is not only an economic burden but a significant hurdle to India's dream of becoming a global sporting powerhouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-2026-beau-webster-matthew-wade-hobart-hurricanes-heated-verbal-tussle-video-viral-2856883-2026-01-23",
      "headline": "Australian stars' heated verbal tussle in Big Bash League knockouts goes viral: WatchBig Bash League: A heated exchange between Beau Webster and Matthew Wade lit up the Hurricanes dugout during the BBL Challenger, before the Sydney Sixers powered into yet another final with a dominant 57-run victory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-icc-dispute-resolution-t20-world-cup-travel-row-2856859-2026-01-23",
      "headline": "Bangladesh turn to ICC's dispute resolution body, but T20 WC removal likelyBangladesh have made a last-ditch effort to save their T20 World Cup 2026 participation by asking the ICC to refer their matter to the Dispute Resolution Committee on Friday, January 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-2nd-t20i-live-score-india-vs-new-zealand-match-abhishek-suryakumar-hardik-2856844-2026-01-23",
      "headline": "2nd T20I Highlights: Record-shattering India chase down 209 in 15.2 oversIND vs NZ Highlights, 2nd T20I: IND (209/3 in 15.2 ov). Suryakumar Yadav and Shivam Dube have helped India race to the target of 209 runs. India complete the fastest ever 200+ run chase, courtesy of Ishan Kishan and Suryakumar Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-shaheen-return-pakistan-squad-australia-t20-series-2856831-2026-01-23",
      "headline": "Despite BBL struggles, Babar, Afridi selected for Pakistan's squad vs AustraliaDespite their struggles in the Big Bash League, Babar Azam and Shaheen Shah Afridi have selected for Pakistan's squad against Australia on Friday, January 23. Salman Ali Agha will be leading the 16-member squad with Shadab Khan continuing his recovery from injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-saina-nehwal-retirement-note-social-media-2856795-2026-01-23",
      "headline": "Thank you: PV Sindhu salutes Saina Nehwal with heartfelt retirement notePV Sindhu wrote a heartfelt retirement note for Saina Nehwal, who brought the curtains down on a decorated career. The two-time Olympic medallist has often acknowledged the path Saina carved before her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-red-card-indonesia-masters-quarter-final-lakshya-sen-defeat-2856765-2026-01-23",
      "headline": "PV Sindhu shown red card in Indonesia Masters, Lakshya crashes outIndonesia Masters: India's top shuttler PV Sindhu crashed out of the Indonesia Masters after losing in straight games to top seed Chen Yu Fei. Sindhu was also shown a red card midway through the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-security-concerns-prompt-venue-shift-request-2856646-2026-01-23",
      "headline": "Why Bangladesh's stance on T20 World Cup controversy can't be ignoredBy declining to relocate Bangladesh's T20 World Cup 2026 fixtures, the ICC has focused on procedure over context, leaving questions about whether wider security concerns were adequately addressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-nathan-ellis-ruled-out-big-bash-league-hobart-hurricanes-2856730-2026-01-23",
      "headline": "Australia's T20 World Cup concerns deepen as Nathan Ellis ruled out of BBLAustralia's T20 World Cup build-up has hit another snag with Nathan Ellis ruled out of the BBL finals. The injury adds to growing fitness concerns around Australia's pace group ahead of the global tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-kyle-jamieson-replaces-adam-milne-t20-world-cup-2026-2856665-2026-01-23",
      "headline": "T20 World Cup: New Zealand replace injured Adam Milne with India tormentorNew Zealand have replaced injured fast bowler Adam Milne with Kyle Jamieson for the T20 World Cup 2026. The change comes after Milne sustained a hamstring injury during the SA20 competition, affecting the Black Caps' pace attack ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-carlos-alcaraz-vs-corentin-moutet-daniil-medvdev-five-set-vs-fabian-marozsan-2856645-2026-01-23",
      "headline": "Australian Open: Carlos Alcaraz cruises through, Medvedev continues 5-set love affairCarlos Alcaraz cruised into the Australian Open last 16 with a commanding straight-sets win, while Daniil Medvedev once again embraced the grind. The Russian survived another five-set battle to keep his Melbourne campaign alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-players-suffering-manoj-tiwary-politics-in-sports-bcb-2856602-2026-01-23",
      "headline": "T20 World Cup decision hurting Bangladesh players: Manoj Tiwary slams politicsManoj Tiwary said Bangladesh's T20 World Cup boycott is hurting the players most, not administrators. The former India cricketer warned that political interference is depriving athletes of growth and risking Bangladesh's future in ICC events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-gucci-partnership-australian-open-global-ambassador-2856572-2026-01-23",
      "headline": "Aryna Sabalenka serves high fashion, happiest person on earth after Gucci dealAustralian Open 2026: Aryna Sabalenka radiated joy after sealing her Gucci deal, calling it a dream come true and admitting she has never felt happier as her on-court success met off-court recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aston-villa-unai-emery-youri-tielemans-shoving-heated-exchange-europa-league-vs-fenerbache-2856564-2026-01-23",
      "headline": "Aston Villa boss Unai Emery shoves Youri Tielemans in heated Europa League momentUnai Emery cut a furious figure during Aston Villa's Europa League win over Fenerbahce. The Villa boss was seen shoving Youri Tielemans during a tense late substitution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bangladesh-boycott-cricket-crisis-what-next-bcb-security-concerns-reasons-2856520-2026-01-23",
      "headline": "Bangladesh cricket in crisis: What next after T20 World Cup boycott?Bangladesh have maintained their stance on not playing the T20 World Cup in India due to security concerns, but a withdrawal could bring serious complications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/bangladesh-boycotts-t20-world-cup-in-india-over-security-concerns-scotland-to-join-tournament-ytvd-2856510-2026-01-23",
      "headline": "Bangladesh Boycotts T20 World Cup In India Over Security Concerns; Scotland To Join TournamentThis special report details the unprecedented decision by the Bangladesh interim government to boycott the T20 World Cup in India. The speaker notes, 'Bangladesh has clearly chosen politics over cricket at this point of time, boycotting the T20 World Cup despite the ICC security assurances.' The fallout of this decision is immediate, with Scotland set to replace Bangladesh as the highest-ranked non-qualified team. The report highlights that the Bangladesh Cricket Board (BCB) lost an ICC board vote 14-2 regarding a venue change, with only Pakistan supporting them. Tensions reportedly escalated after the BCCI requested Kolkata Knight Riders to release Mustafizur Rahman. Despite the ICC providing security guarantees, the interim government cited 'genuine security risks' and a preference for the tournament to be moved to Sri Lanka. This marks the first time a team has boycotted an entire ICC tournament, leaving the future of Bangladesh cricket in a precarious position as the global tournament faces significant controversy."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}