{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-trap-india-mis-selling-policies-irdai-agent-rbm-commissions-bank-targets-financial-illiteracy-2790046-2025-09-20",
      "headline": "Why India's insurance market has become a breeding ground for mis-sellingFrom loans tied to unwanted policies to agents chasing fat commissions, insurance policies that were meant to shield families have instead become a trap for many. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-a-bigger-challenge-to-dollar-than-brics-currency-says-wef-president-2790312-2025-09-19",
      "headline": "Cryptocurrency a bigger challenge to dollar than BRICS currency, says WEF PresidentSpeaking in an exclusive conversation with India Today TV, Brende said de-dollarisation is unlikely in the near term. He added that cryptocurrency is a bigger challenge to the dollar than a potential BRICS currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-powers-18-percent-of-global-growth-wef-president-borge-brende-sees-tariff-row-with-us-easing-soon-2790284-2025-09-19",
      "headline": "India powers 18% of global growth, WEF chief sees tariff row with US easing soonIn an exclusive interaction with India Today TV, WEF President Borge Brende described India's rapid expansion as a source of \"exported prosperity\" to the world. \"Just imagine what it means for global prosperity. So, you are exporting prosperity by growing so fast,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-widow-wait-a-worker-fight-the-human-struggle-behind-pf-claims-2790021-2025-09-19",
      "headline": "A widow's wait, a worker's fight: The human struggle behind PF claimsIn Part 2 of our series on the PF claim crisis, we look at why, for so many Indians, withdrawing their own savings has turned into a struggle, forcing them to fight for money that is rightfully theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/market-optimism-rises-after-sebi-clears-adani-group-hindenburg-allegations-2790095-2025-09-19",
      "headline": "Will October bring a market breakout? Earnings, GST price cuts fuel hopeAdani stocks led the rally on Thursday following Sebi's dismissal of Hindenburg Research allegations. Experts say this could mark the start of renewed market optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-387-points-lower-nifty-below-25400-adani-enterprises-gains-5-2790077-2025-09-19",
      "headline": "Sensex, Nifty end lower amid profit booking; Adani Group shares gainThe S&P BSE Sensex slipped 387.73 points to close at 82,626.23, while the NSE Nifty50 lost 96.55 points to settle at 25,327.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-intel-shares-jumped-22-percent-after-nvidias-usd5-billion-investment-2789998-2025-09-19",
      "headline": "Explained: Why Intel shares jumped 22% after Nvidia's $5 billion investmentThe Nvidia-Intel deal not only fuels Intel's stock surge but strengthens its next-gen manufacturing and product integration, creating potential market shifts that could challenge competitors like AMD over the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-itr-refund-here-is-how-to-track-it-2789924-2025-09-19",
      "headline": "Waiting for your ITR refund? Here is how to track itAfter filing your ITR, the next big question is, when will the refund come? Instead of guessing, you can quickly check the progress on the official portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-down-why-is-the-stock-market-down-today-2789941-2025-09-19",
      "headline": "Sensex tumbles 500 points: Is the stock market rally over?Around midday, the S&P BSE Sensex was down 471.67 points, settling at 82,542.29, while the NSE Nifty50 declined 130.20 points to 25,293.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/does-the-income-tax-department-delay-refunds-above-rs-50000-2789891-2025-09-19",
      "headline": "Does the Income Tax Department delay refunds above Rs 50,000?With the ITR deadline now behind us, many taxpayers are anxiously waiting for their refunds. A common doubt is whether larger refunds, such as those above Rs 50,000, take longer to arrive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-from-september-22-why-you-should-double-check-product-mrps-2789858-2025-09-19",
      "headline": "New GST rates from September 22: Why you should double-check product MRPsConsumers must remain alert as new GST rates take effect September 22; checking MRPs carefully ensures savings are realised, avoiding overpayment due to old pricing or retailer confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/adani-power-in-focus-as-sebi-clean-chit-sparks-fresh-rally-in-adani-group-stocks-2789834-2025-09-19",
      "headline": "Adani Power in focus as Sebi clean chit sparks fresh rally in Adani Group stocksAdani Power's move stood out, as analysts see strong momentum beyond the short-term sentiment boost. Global brokerage Morgan Stanley has initiated coverage with an 'Overweight' rating and a target price of Rs 818 per share."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-episode-30-written-update-amitabh-bachchan-pallavi-niphadkar-seven-miscarriages-2790463-2025-09-20",
      "headline": "KBC 17: Teacher Pallavi Niphadkar opens up about undergoing seven miscarriagesPre-primary teacher Pallavi Niphadkar opened up about experiencing seven miscarriages on the latest episode of 'Kaun Banega Crorepati'. She told host Amitabh Bachchan about her health struggles and shared how adoption brought positivity into her life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-review-neeraj-ghaywan-film-on-caste-faith-holds-mirror-to-society-2790436-2025-09-20",
      "headline": "Homebound review: Neeraj Ghaywan's film on caste, faith holds a mirror to societyRelease Date:Fri Sep 26, 2025Homebound review: Director Neeraj Ghaywan's 'Homebound' is not just to be watched; it's a heavy, unforgettable cinematic experience that holds up a mirror to a reality you can no longer pretend you didn't know, leaving you with a profound sense of responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywoods-franchise-fever-why-filmmakers-keep-chasing-part-twos-and-universes-2789142-2025-09-20",
      "headline": "Bollywood's franchise fever: Why filmmakers keep chasing part twos and universesAre you a fan of franchises? Bollywood is hooked on them, banking on them and building universes for box-office wins. Experts from the industry shared why nothing but fresh storytelling can keep the magic alive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-shares-emotional-post-6th-collaboration-with-shah-rukh-khan-post-kalki-exit-2790421-2025-09-20",
      "headline": "Deepika shares emotional post on 6th collaboration with SRK after exit from Kalki 2Actor Deepika Padukone confirmed her role in Shah Rukh Khan's upcoming film 'King' after leaving the 'Kalki 2989 AD sequel'. This move highlights ongoing industry shifts and creative disagreements in major film projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-final-moments-before-scuba-diving-accident-surface-viral-video-2790416-2025-09-20",
      "headline": "Zubeen Garg's final moments before scuba diving accident surface in viral videoAssamese singer Zubeen Garg died at the age of 52 following a scuba diving accident in Singapore. A video of him wearing a life jacket shortly before the tragedy has since gone viral online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kiss-movie-review-a-cheesy-romantic-fantasy-starring-kavin-that-tugs-at-your-emotions-2790292-2025-09-19",
      "headline": "Kiss review: A cheesy romantic fantasy starring Kavin that tugs at your emotionsRelease Date:Fri Sep 19, 2025Kiss movie review: The Tamil film, written and directed by National award-winning choreographer Sathish Krishnan, stars Kavin and Preeti Israni in the lead. 'Kiss' is a breezy romantic film that is worth watching. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/biff-2025-day-3-kim-da-mi-lee-byung-hun-netflix-dear-x-premieres-guillermo-del-toro-frankenstein-2790308-2025-09-19",
      "headline": "BIFF 2025 Day 3: Kim Da-mi, Dear X screening, and Lee Byung-hun headline BusanThe 30th Busan International Film Festival continued its vibrant run on day 3 with major premieres and star appearances. The event highlighted Netflix hits and exclusive reveals, promising an exciting festival ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-selection-for-oscars-2026-a-unanimous-decision-film-federation-of-india-2790283-2025-09-19",
      "headline": "Homebound selection for Oscars 2026 a unanimous decision: Film Federation of IndiaThe Film Federation of India president, Firdausul Hasan reflected on 'Homebound' being selected as India's official entry for the 98th Academy Awards. In an exclusive interview with India Today, he stated that the film was unanimously selected by a 14-member jury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-calls-out-bollywoods-toxicity-criticises-ai-in-cinema-2790000-2025-09-19",
      "headline": "Anurag Kashyap calls out Bollywood's toxicity, criticises AI in cinemaAnurag Kashyap criticised the \"toxicity\" in Bollywood and said the industry can never be united. He also slammed AI-generated cinema, calling it unethical and warning that actors will only unite when technology begins replacing them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-co-writer-sumit-roy-expresses-pride-as-film-gets-picked-for-oscars-2026-2790245-2025-09-19",
      "headline": "Homebound co-writer Sumit Roy expresses pride as film gets picked for Oscars 2026Director Neeraj Ghaywan's film 'Homebound' has been selected for the Oscars race. The film's co-writer Sumit Roy reacted to the news expressing pride on representing India globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-death-maya-baladeer-songs-gaane-ki-aane-assam-star-ya-ali-gangster-film-life-legacy-2790240-2025-09-19",
      "headline": "Zubeen Garg, Assam's OG pop balladeer, and the question Gaane ki AaneZubeen Garg wasn't just a singer. He was the voice of Assam, weaving raw emotion into every note that defined generations. From the superhit Maya to intimate folk melodies, Zubeen left an indelible mark. He proved that true music transcends time and controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-calls-neeraj-ghaywan-ishaan-khattar-janhvi-kapoor-homebound-a-labour-of-love-as-film-heads-to-oscars-2026-2790243-2025-09-19",
      "headline": "Karan Johar calls Homebound a labour of love as film heads to Oscars 2026Neeraj Ghaywan's 'Homebound', produced by Karan Johar, has been selected as India's official entry for Oscars 2026 in the Best International Feature category. Calling it a \"labour of love,\" Johar expressed pride, while Ghaywan said representing India on a global stage was both \"humbling and a matter of pride.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rohit-saraf-flaunts-his-abs-in-sunny-sanskari-ki-tulsi-kumari-song-panwadi-behind-the-scenes-pics-2790186-2025-09-19",
      "headline": "Rohit Saraf flaunts his abs in Sunny Sanskari Ki Tulsi Kumari song BTS picsRohit Saraf shared behind-the-scenes pictures from the new Holi song 'Panwadi' in his upcoming film 'Sunny Sanskari Ki Tulsi Kumari'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ya-ali-singer-zubeen-garg-death-assamese-music-sister-jonkey-borthakur-road-accident-2002-2790194-2025-09-19",
      "headline": "Zubeen Garg's sister Jonkey Borthakur died in accident; tragedy shaped musicLife's cruel symmetry has played out for the Borthakur family, after Assam's pop star Zubeen Garg lost his life during a sea outing in Singapore. Twenty-three years ago, Zubeen's sister, Jonkey, met with a road accident that resulted in the death of the 20-year-old singer and actor. Her death in 2002 left young Zubeen devastated and shaped his music, spirit, and musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/neeraj-ghaywans-homebound-picked-as-indias-official-entry-to-oscars-2790209-2025-09-19",
      "headline": "Neeraj Ghaywan's Homebound picked as India's official entry to OscarsDirector Neeraj Ghaywan's 'Homebound' has been selected as India's official entry for Oscars 2026. The film features Ishaan Khatter, Janhvi Kapoor and Vishal Jethwa in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-injured-during-ad-shoot-advised-rest-for-few-weeks-official-statement-2790193-2025-09-19",
      "headline": "Jr NTR injured during ad shoot, advised rest for few weeks: Official statementTelugu superstar Jr NTR suffered a minor injury while shooting an ad. His team confirmed he is stable, recovering well, and advised rest for a few weeks. Fans are urged not to speculate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-dies-at-52-fans-pay-tribute-to-assamese-icon-musical-legacy-2790124-2025-09-19",
      "headline": "Zubeen Garg dies at 52: Fans pay tribute to Assamese icon's musical legacySinger Zubeen Garg died at 52 after a scuba diving accident in Singapore. Fans mourned his death while cherishing his music and contribution towards Assamese culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/apateu-apateu-how-a-korean-drinking-game-became-worlds-newest-pop-obsession-2790076-2025-09-19",
      "headline": "Apateu, Apateu! How a Korean drinking game became world's newest pop obsessionIn this week's K-fix, we discuss how Rose and Bruno Mars' 'APT.' turns a Korean drinking game into a viral anthem, uniting fans worldwide with its addictive chant and playful lyrics.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lord-curzon-ki-haveli-anshuman-jha-directorial-debut-hits-theatres-this-october-2790086-2025-09-19",
      "headline": "Lord Curzon Ki Haveli: Anshuman Jha's directorial debut hits theatres this OctoberThe much-awaited black comedy thriller 'Lord Curzon Ki Haveli', marking Anshuman Jha's directorial debut, is set to release in Indian theatres on October 10 after a successful international festival run. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trump-h1-b-visa-fee-order-hike-us-innovation-india-brain-drain-economy-2790448-2025-09-20",
      "headline": "Why Trump's H-1B crackdown could spark India's talent renaissanceFormer Niti Aayog CEO Amitabh Kant said US President Donald Trump's order imposing a USD 100,000 annual fee on H-1B will choke US innovation and turbocharge India's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-defence-minister-nuclear-programme-will-be-available-to-saudi-arabia-glbs-2790397-2025-09-20",
      "headline": "Pakistan says its nukes are available for Saudi Arabia under new defence pactPakistan's nuclear capabilities could be extended to Saudi Arabia under a new defence pact, Defence Minister Khawaja Asif said, in the first clear signal that Islamabad has placed Riyadh under its nuclear umbrella."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-to-impose-100000-fee-for-h-1b-visa-applications-white-house-says-glbs-2790383-2025-09-20",
      "headline": "Trump signs order imposing $100,000 annual fee for H-1B visa applicationsUS President Donald Trump signed a proclamation imposing a $100,000 annual fee on H-1B visas, a sweeping overhaul expected to hit Indian workers hardest as they dominate approvals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-hydrogen-bomb-congress-sir-vote-chori-bihar-elections-2025-backfire-mahagathbandhan-rjd-bjp-jdu-2789989-2025-09-20",
      "headline": "Will Rahul Gandhi's Hydrogen Bomb explode on the Congress?Congress leader Rahul Gandhi's all-out campaign on 'vote chori' and the SIR exercise has raised eyebrows within his own party, with fears it could alienate allies and voters in Bihar. With Gandhi building up the \"hydrogen bomb\" hype, the Congress faces a dangerous gamble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-review-neeraj-ghaywan-film-on-caste-faith-holds-mirror-to-society-2790436-2025-09-20",
      "headline": "Homebound review: Neeraj Ghaywan's film on caste, faith holds a mirror to societyRelease Date:Fri Sep 26, 2025Homebound review: Director Neeraj Ghaywan's 'Homebound' is not just to be watched; it's a heavy, unforgettable cinematic experience that holds up a mirror to a reality you can no longer pretend you didn't know, leaving you with a profound sense of responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ian-bremmer-examines-saudi-arabia-pakistan-defence-pact-impact-on-india-2790321-2025-09-19",
      "headline": "Saudi-Pak defence pact will change life for India, says Ian BremmerGeopolitical expert Ian Bremmer said Saudi Arabia's decision to sign a mutual defence pact with Pakistan will have far-reaching consequences for South Asia, particularly India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/rare-meteor-breaks-up-over-india-lights-up-skies-in-delhi-gurugram-2790404-2025-09-20",
      "headline": "Rare meteor breaks up over India, lights up skies in Delhi, GurugramResidents across Delhi NCR reported the flash was visible for only a few seconds but bright enough to outshine the city lights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-final-moments-before-scuba-diving-accident-surface-viral-video-2790416-2025-09-20",
      "headline": "Zubeen Garg's final moments before scuba diving accident surface in viral videoAssamese singer Zubeen Garg died at the age of 52 following a scuba diving accident in Singapore. A video of him wearing a life jacket shortly before the tragedy has since gone viral online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/gulveer-singh-misses-5000m-final-world-athletics-championships-2025-2790456-2025-09-20",
      "headline": "A final lap fumble: How a tactical error cost Gulveer Singh a spot in the finalGulveer Singh missed out on a spot in the 5000m final at the World Athletics Championships 2025 in agonising fashion. However, the Indian ace committed the cardinal sin which allowed the others to go past him in the final stages of the race on Friday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gunfight-between-security-forces-and-terrorists-in-jks-udhampur-kishtwar-2790405-2025-09-20",
      "headline": "Soldier killed in gunfight in J&K, 4 likely Jaish terrorists trappedA gunfight broke out in Jammu and Kashmir's Udhampur district, where an Army soldier succumbed to his injuries and three to four suspected Jaish-e-Mohammed (JeM) terrorists were trapped by the security forces."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-trap-india-mis-selling-policies-irdai-agent-rbm-commissions-bank-targets-financial-illiteracy-2790046-2025-09-20",
      "headline": "Why India's insurance market has become a breeding ground for mis-sellingFrom loans tied to unwanted policies to agents chasing fat commissions, insurance policies that were meant to shield families have instead become a trap for many. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ya-ali-singer-zubeen-garg-death-assamese-music-sister-jonkey-borthakur-road-accident-2002-2790194-2025-09-19",
      "headline": "Zubeen Garg's sister Jonkey Borthakur died in accident; tragedy shaped musicLife's cruel symmetry has played out for the Borthakur family, after Assam's pop star Zubeen Garg lost his life during a sea outing in Singapore. Twenty-three years ago, Zubeen's sister, Jonkey, met with a road accident that resulted in the death of the 20-year-old singer and actor. Her death in 2002 left young Zubeen devastated and shaped his music, spirit, and musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-shares-emotional-post-6th-collaboration-with-shah-rukh-khan-post-kalki-exit-2790421-2025-09-20",
      "headline": "Deepika shares emotional post on 6th collaboration with SRK after exit from Kalki 2Actor Deepika Padukone confirmed her role in Shah Rukh Khan's upcoming film 'King' after leaving the 'Kalki 2989 AD sequel'. This move highlights ongoing industry shifts and creative disagreements in major film projects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/newsmo/video/hydrogen-bomb-is-coming-satirical-raga-on-politics-parody-apocalypse-rahul-gandhi-bjp-congress-2790433-2025-09-20",
      "headline": "Hydrogen bomb is coming: A satirical raga on politics and parodyA satirical raga for our absurd times when politics slips into parody, truth drowns beneath the beat, and the world chews, gums, and drums its way toward an approaching apocalypse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywoods-franchise-fever-why-filmmakers-keep-chasing-part-twos-and-universes-2789142-2025-09-20",
      "headline": "Bollywood's franchise fever: Why filmmakers keep chasing part twos and universesAre you a fan of franchises? Bollywood is hooked on them, banking on them and building universes for box-office wins. Experts from the industry shared why nothing but fresh storytelling can keep the magic alive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-524-19-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/preschool-fees-soar-to-lakhs-as-toddler-education-becomes-big-business-2789638-2025-09-20",
      "headline": "Preschool fees soar to lakhs: Are parents paying for toddler education or gloss?Over the past couple of years, viral posts have exposed the steep rise in preschool fees, with parents in cities like Bengaluru, Delhi and Jaipur paying lakhs per year. Once affordable neighbourhood playschools, today's preschools are big business, offering things like robotics kits and glossy facilities, leaving many middle-class families torn between aspiration and financial strain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/i-went-to-a-dogs-birthday-party-and-it-was-paws-down-the-best-bash-ever-2790133-2025-09-20",
      "headline": "I went to a dog's birthday party, and it was paws down the best bash everThis read might be an overdose of cuteness, but the emotions behind it are anything but frivolous. Call it funny, call it quirky—but the love people have for their pets is as real and earnest as any bond. And honestly, it turned out to be one of the most wholesome parties I've ever been to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-trust-not-terror-indus-treaty-cooperation-un-pakistan-terrorism-2790435-2025-09-20",
      "headline": "Cooperation needs trust, not terror: India jabs Pak at UN over Indus treaty pauseAt the UN Human Rights Council, India slammed Pakistan's actions politicising the Indus Waters Treaty of 1960, which was suspended following the April 22 Pahalgam terror attack, arguing that state-sponsored terrorism eroded trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-super-4-preview-india-pakistan-sri-lanka-bangladesh-2790417-2025-09-20",
      "headline": "Super 4 preview: Can Pakistan prove they are second-best Asian team?India, Pakistan, Sri Lanka and Bangladesh have reached the Super 4 stage of the Asia Cup. India are the clear favourites to win the trophy. But who is the second-best side in the competition?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/honda-cb-125-hornet-ride-review-price-features-design-2790350-2025-09-20",
      "headline": "Honda CB 125 Hornet review: Time for a Honda to shine againHonda has long played it safe with commuters, but the CB 125 Hornet flips the script. Sharp styling, street fighter stance, and modern features give it serious road presence. But is it more than just a pretty face? We find out.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/gulveer-singh-misses-5000m-final-world-athletics-championships-2025-2790456-2025-09-20",
      "headline": "A final lap fumble: How a tactical error cost Gulveer Singh a spot in the finalGulveer Singh missed out on a spot in the 5000m final at the World Athletics Championships 2025 in agonising fashion. However, the Indian ace committed the cardinal sin which allowed the others to go past him in the final stages of the race on Friday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-india-medal-drought-sarvesh-kusare-sachin-yadav-neeraj-chopra-2790450-2025-09-20",
      "headline": "No World Athletics medal for India after 6 years: The highs and lows in TokyoIndia ended the 2025 World Athletics Championships without a medal, marking a first in six years in the competition. Sarvesh Kushare's high jump and Sachin Yadav's near-podium javelin throw were bright spots in an otherwise disappointing Tokyo campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indw-vs-ausw-india-women-pink-jersey-breast-cancer-awareness-delhi-2790449-2025-09-20",
      "headline": "INDW vs AUSW: Team India to don pink jersey in support of breast cancer awarenessThe Indian women's cricket team will wear pink jerseys in the third ODI against Australia to promote breast cancer awareness. This match holds significance as India aims for a historic series win before the ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-suryakumar-yadav-jemimah-rodrigues-sanju-samson-richa-ghosh-2790438-2025-09-20",
      "headline": "Women's World Cup 2025: Suryakumar Yadav backs Jemimah Rodrigues to deliver for IndiaIndia's men's cricket stars have expressed strong support for the women's team ahead of the Women's World Cup. Their encouragement highlights the growing unity and backing for women's cricket in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-suryakumar-yadav-selfless-captain-india-vs-pakistan-2790434-2025-09-20",
      "headline": "Surya namaskar: In a meaningless pursuit, SKY shines by not battingSurya Kumar Yadav showed his selfless leadership against Oman, demoting himself to give young players batting exposure. His fearless captaincy and team-first ethos continue to define India's T20 journey ahead of the Super Fours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-sri-lanka-asia-cup-2025-super-four-clash-preview-2790200-2025-09-20",
      "headline": "Bangladesh eye revenge against Sri Lanka in Naagin rivalryBangladesh will seek revenge against Sri Lanka in the Asia Cup 2025 Super Four opener on September 20, aiming to rectify their earlier Group B loss and strengthen a fragile batting and bowling lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-on-rohit-sharma-mentor-virat-kohli-comedian-indian-test-team-2790425-2025-09-20",
      "headline": "Mentor Rohit, comedian Kohli: Yashasvi Jaiswal on Indian legendsYashasvi Jaiswal opened up on playing alongside Indian legends Rohit Sharma and Virat Kohli. While Jaiswal said that Rohit has been a mentor for him, he went on to reveal the funny side of Kohli in the dressing room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-kuldeep-yadav-india-test-team-x-factor-return-anil-kumble-2790422-2025-09-20",
      "headline": "Kuldeep Yadav can be India's Test X-factor: Anil Kumble after spinner's Asia Cup showAnil Kumble has backed Kuldeep Yadav to return to India's Test side, calling him the X-factor in the spin department. His Asia Cup form reinforces the spinner's potential to help India take 20 wickets in a match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shaheen-afridi-beyond-yorkers-vs-shubman-gill-india-vs-pakistan-super-4-wasim-akram-2790419-2025-09-20",
      "headline": "Shaheen Afridi needs Plan B ready for Shubman Gill: Wasim Akram before IND vs PAKWasim Akram has urged Shaheen Afridi to look beyond yorkers when Pakistan face India in the Asia Cup Super 4s. The Pakistan legend wants Afridi to keep a Plan B ready, especially against Shubman Gill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-super-4-preview-india-pakistan-sri-lanka-bangladesh-2790417-2025-09-20",
      "headline": "Super 4 preview: Can Pakistan prove they are second-best Asian team?India, Pakistan, Sri Lanka and Bangladesh have reached the Super 4 stage of the Asia Cup. India are the clear favourites to win the trophy. But who is the second-best side in the competition?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/axar-patel-injury-update-india-fielding-coach-t-dilip-ahead-of-pakistan-clash-2790374-2025-09-20",
      "headline": "Will Axar's injury rule him out of Pakistan clash? India fielding coach revealsAxar Patel suffered a head injury while taking a catch during India's win over Oman in the Asia Cup 2025. The all-rounder hit his head on the ground and was taken off the field, causing worry to Indian fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-on-rohit-sharma-mentor-virat-kohli-comedian-indian-test-team-2790425-2025-09-20",
      "headline": "Mentor Rohit, comedian Kohli: Yashasvi Jaiswal on Indian legendsYashasvi Jaiswal opened up on playing alongside Indian legends Rohit Sharma and Virat Kohli. While Jaiswal said that Rohit has been a mentor for him, he went on to reveal the funny side of Kohli in the dressing room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-kuldeep-yadav-india-test-team-x-factor-return-anil-kumble-2790422-2025-09-20",
      "headline": "Kuldeep Yadav can be India's Test X-factor: Anil Kumble after spinner's Asia Cup showAnil Kumble has backed Kuldeep Yadav to return to India's Test side, calling him the X-factor in the spin department. His Asia Cup form reinforces the spinner's potential to help India take 20 wickets in a match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shaheen-afridi-beyond-yorkers-vs-shubman-gill-india-vs-pakistan-super-4-wasim-akram-2790419-2025-09-20",
      "headline": "Shaheen Afridi needs Plan B ready for Shubman Gill: Wasim Akram before IND vs PAKWasim Akram has urged Shaheen Afridi to look beyond yorkers when Pakistan face India in the Asia Cup Super 4s. The Pakistan legend wants Afridi to keep a Plan B ready, especially against Shubman Gill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-super-4-preview-india-pakistan-sri-lanka-bangladesh-2790417-2025-09-20",
      "headline": "Super 4 preview: Can Pakistan prove they are second-best Asian team?India, Pakistan, Sri Lanka and Bangladesh have reached the Super 4 stage of the Asia Cup. India are the clear favourites to win the trophy. But who is the second-best side in the competition?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/axar-patel-injury-update-india-fielding-coach-t-dilip-ahead-of-pakistan-clash-2790374-2025-09-20",
      "headline": "Will Axar's injury rule him out of Pakistan clash? India fielding coach revealsAxar Patel suffered a head injury while taking a catch during India's win over Oman in the Asia Cup 2025. The all-rounder hit his head on the ground and was taken off the field, causing worry to Indian fans. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}