{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-court-restrains-journalists-publishing-unverified-defamatory-content-adani-enterprise-limited-2783317-2025-09-07",
      "headline": "Court restrains media from publishing defamatory content against Adani EnterpriseAEL alleged that coordinated defamatory publications on paranjoy.in, adaniwatch.org and adanifiles.com.au, along with related videos and posts, were deliberately designed to tarnish its reputation and disrupt its global business operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-files-for-rs-3820-crore-ipo-amid-edtech-sector-slowdown-alakh-pandey-2783282-2025-09-07",
      "headline": "PhysicsWallah files for Rs 3,820 crore IPO amid edtech sector slowdownEdtech unicorn PhysicsWallah has filed for a ₹38.2 billion ($437M) IPO, aiming to expand physical centers, tech, and acquisitions. The move comes as India's IPO market gains momentum after a slow start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-forex-reserves-usd-35-billion-to-usd-694-billion-says-reserve-bank-of-india-2782682-2025-09-05",
      "headline": "India's forex reserves rise by $3.5 billion to $694 billion, says RBIFor the week ended August 29, foreign currency assets, a major component of the reserves, increased by USD 1.686 billion to USD 583.937 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/not-just-acting-aamir-khan-serenades-fans-with-his-singing-skills-2783325-2025-09-07",
      "headline": "Not just acting, Aamir Khan serenades fans with his singing skills. WatchAamir Khan has caught everyone's attention with his singing skills in a viral video, showcasing a new side of the star. A video from a recent event has now gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-in-tears-as-kunickaas-son-ayaan-narrates-her-life-story-2783314-2025-09-07",
      "headline": "Bigg Boss 19: Salman Khan in tears as Kunickaa's son Ayaan narrates her life storyThe latest 'Weekend Ka Vaar' episode of 'Bigg Boss 19' touched hearts as Kunickaa Sadanand's son, Ayaan Lal, stood up for his mother against hurtful remarks, revealing her struggles and resilience. Salman Khan and the audience were visibly moved by this emotional moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-awards-winners-amaran-aadujeevitham-prithviraj-sukumaran-sai-pallavi-2783288-2025-09-07",
      "headline": "SIIMA 2025 Tamil, Malayalam: Prithviraj Sukumaran, Sai Pallavi win top honoursSIIMA 2025 honours Tamil and Malayalam cinema: Sivakarthikeyan's 'Amaran' and Prithviraj Sukumaran's 'The Goat Life' take top honours. Sai Pallavi won Best Actor (Female) and Sukumaran bagged Best Actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anuparna-roy-makes-history-wins-best-director-at-82nd-venice-film-festival-2783284-2025-09-07",
      "headline": "India's Anuparna Roy makes history, wins Best Director at 82nd Venice Film FestivalThe 82nd Venice Film Festival concluded with Indian filmmaker Anuparna Roy making history, winning Best Director for her debut 'Songs of Forgotten Trees', while American indie 'Father Mother Sister Brother' took home the Golden Lion for Best Film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-leads-beach-clean-up-drive-in-mumbai-amruta-fadnavis-champions-public-responsibility-2783265-2025-09-07",
      "headline": "Akshay Kumar leads beach clean-up drive in Mumbai, champions public responsibilityAkshay Kumar actively participated in a beach clean-up drive at Mumbai's Juhu Beach, joining hands with Amruta Fadnavis and BMC officials to promote environmental responsibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-vs-bengal-files-box-office-day-2-tiger-shroffs-action-hits-high-gear-2783262-2025-09-07",
      "headline": "Baaghi 4 vs Bengal Files box office Day 2: Tiger Shroff's action hits high gearThe box office clash between 'Baaghi 4' and 'The Bengal Files' reflects audiences' stronger pull towards action, as the Tiger Shroff-starrer leads while the political drama gains attention for its historical narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-stuns-london-crowd-with-surprise-saiyaara-rendition-2783242-2025-09-07",
      "headline": "Arijit Singh stuns London crowd with surprise Saiyaara renditionArijit Singh mesmerised fans at London's Tottenham Hotspur Stadium with a soulful and retro-infused performance of 'Saiyaara'. The unexpected choice of this hit track had the entire stadium singing along. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-slays-in-silver-at-birmingham-event-fans-flock-in-a-flurry-2783228-2025-09-07",
      "headline": "Kareena Kapoor slays in silver at Birmingham event, fans flock in a flurryBollywood icon Kareena Kapoor Khan created a buzz in Birmingham as she dazzled fans at a store launch, charming the crowd with her elegance and warmth. Several videos and pictures from the event went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-announces-break-from-tour-says-been-unwell-for-an-year-2783217-2025-09-07",
      "headline": "Comedian Zakir Khan announces break, says been unwell for a yearStand-up comedian Zakir Khan has decided to take a break from his touring schedule to prioritise his health after a decade of rigorous performances across India. He will continue with a limited 'Papa Yaar India' tour starting October 2025, followed by a much-needed long break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-turns-76-ameesha-simi-garewal-extend-wishes-throwback-pics-2783021-2025-09-06",
      "headline": "Rakesh Roshan turns 76: Ameesha, Simi Garewal extend wishes with throwback picsActor Ameesha Patel wished her mentor Rakesh Roshan on his 76th birthday. She called him a 'beacon of hope' by sharing a throwback photo. His actor-friend Simi Garewal also wrote a sweet birthday note for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-cheers-for-kalyani-priyadarshan-lokah-chandra-gave-me-goosebumps-2783018-2025-09-06",
      "headline": "Chandra gave me goosebumps: Samantha cheers for Kalyani Priyadarshan's Lokah'Lokah: Chapter 1', featuring Kalyani Priyadarshan as India's first female superhero, has garnered widespread acclaim for its captivating blend of mythology and fantasy. Recently, Samantha joined the list of celebs who hailed the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-scolds-amaal-malik-asks-if-he-only-came-to-sleep-2783002-2025-09-06",
      "headline": "Bigg Boss 19: Salman Khan scolds Amaal Malik, asks if he only came to sleepBigg Boss 19 host Salman Khan scolded singer Amaal Malik for not living up to the audience's expectations as a contestant on the reality show. Salman asked Amaal whether he wanted to make a difference or not."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amol-parashar-responds-to-relationship-buzz-with-konkona-sensharma-people-made-it-official-2782999-2025-09-06",
      "headline": "Amol Parashar responds to relationship buzz with Konkona: People made it officialAmol Parashar addressed rumours about his relationship with Konkona Sensharma, clarifying their public appearance was just a casual event with friends and family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-full-winners-list-allu-arjun-rashmika-mandanna-win-big-2782980-2025-09-06",
      "headline": "SIIMA 2025 full winners list: Allu Arjun, Rashmika Mandanna win bigThe South Indian International Movie Awards 2025 celebrated outstanding achievements in South Indian cinema, with 'Kalki 2898 AD' winning Best Film and multiple honours for 'Pushpa 2: The Rule'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-vikram-bhatts-mother-dies-at-85-after-prolonged-illness-report-2782978-2025-09-06",
      "headline": "Director Vikram Bhatt's mother dies at 85 after prolonged illness. ReportDirector-producer Vikram Bhatt's mother Varsha Bhatt died at 85 after a prolonged illness, according to reports. The family is yet to release an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-tanya-mittal-family-reacts-criticism-requests-kindness-humanity-2782961-2025-09-06",
      "headline": "Bigg Boss 19: Tanya Mittal's family reacts to criticism, requests people to be kind'Bigg Boss 19' contestant Tanya Mittal is currently at the centre of social media debates. Her parents have now appealed for fairness and asked viewers to reserve judgment until the show ends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/die-my-love-trailer-robert-pattinson-jennifer-lawrence-play-chaotic-couple-2782937-2025-09-06",
      "headline": "Die My Love trailer: Robert Pattinson, Jennifer Lawrence play a chaotic coupleLynne Ramsay has returned to direction with her new film 'Die My Love', featuring Jennifer Lawrence and Robert Pattinson. The movie shows a chaotic life of a couple living in rural Montana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-reacts-to-stepping-down-from-malayalam-film-body-it-was-time-to-move-on-2782968-2025-09-06",
      "headline": "Mohanlal reacts to stepping down from Malayalam film body: It was time to move onMohanlal resigned as AMMA president following criticism over the handling of sexual abuse complaints, clarifying his decision was a timely conclusion rather than a response to public pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-very-jonas-christmas-teaser-kevin-jonas-joe-jonas-nick-jonas-bring-holiday-mischief-to-screens-2782945-2025-09-06",
      "headline": "A Very Jonas Christmas teaser: The Jonas Brothers' festive fun is here to sleighThe Jonas Brothers have delighted fans with a sneak peek of their festive film 'A Very Jonas Christmas Movie', premiering on Disney+ this November. Featuring comedy, music, and family moments, the movie promises a joyous holiday experience with a star-studded cast and original songs."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-woman-raped-by-two-acquaintances-on-her-birthday-in-regent-park-flat-accused-on-the-run-2783266-2025-09-07",
      "headline": "20-year-old gang-raped by 2 acquaintances during birthday celebration in KolkataA 20-year-old woman from Haridevpur has accused two acquaintances of gang-raping her during her birthday celebration in Kolkata's Regent's Park area. The suspects are at large, while police have registered a case and launched an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-government-building-in-kyiv-catches-fire-in-russian-attack-several-structures-destroyed-2783218-2025-09-07",
      "headline": "Russian strikes damage cabinet building in Kyiv; Ukraine attacks oil pipelineUkrainian Prime Minister Yulia Svyrydenko said that a government building was attacked in strikes for the first time and urged Kyiv's allies to respond with actions, not just by words. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/japanese-pm-shigeru-ishiba-to-resign-to-prevent-split-within-ruling-liberal-democratic-party-report-2783263-2025-09-07",
      "headline": "Japan PM Shigeru Ishiba steps down, bows to pressure after poll setbacksJapanese Prime Minister Shigeru Ishiba on Sunday announced he would step down, ending months of political turmoil within the ruling Liberal Democratic Party (LDP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-sits-last-row-bjp-mp-workshop-vice-president-poll-2783315-2025-09-07",
      "headline": "In rare gesture, PM Modi sits in last row at BJP MPs' workshop for Veep pollPrime Minister Narendra Modi attended the BJP MPs' workshop at the GMC Balayogi Auditorium, choosing to sit in the last row among parliamentarians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/prized-h1b-visa-us-donald-trump-ashes-indians-relations-india-immigrant-america-work-visas-rejected-2783066-2025-09-07",
      "headline": "Lucky with H-1B, unlucky with TrumpOnce the ultimate ticket to the American Dream, the H-1B visa stands vilified now. As the Trump administration cracks down, Indians with H-1B and jobs are scared to go to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-peter-navarro-tears-into-elon-musk-as-x-debunks-his-india-russia-post-on-oil-2783178-2025-09-07",
      "headline": "X fact checks Peter Navarro's India rants, he rants even morePeter Navarro, the White House trade adviser, who has for days targeted New Delhi over its energy purchases from Moscow, alleged that India was buying Russian oil \"purely to profit\" and to feed the Russian \"war machine\" in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-vs-jannik-sinner-us-open-final-no-1-ranking-battle-2783294-2025-09-07",
      "headline": "When unpredictability meets intensity: US Open set for blockbuster finalJannik Sinner and Carlos Alcaraz are meeting for the 3rd time in a Grand Slam final. Whoever wins the match will be crowned No.1 in the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/comeback-kid-congress-will-bihar-walk-rahul-gandhis-voter-adhikar-talk-2783078-2025-09-06",
      "headline": "Comeback kid Congress? Will Bihar walk Rahul Gandhi's Voter Adhikar talk?The Voter Adhikar Yatra, with Tejashwi Yadav and other INDIA leaders, may have just given the Congress what it lacked in the Bihar poll theatre: visibility and legitimacy\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/total-lunar-eclipse-to-turn-the-blood-moon-red-tonight-visible-in-these-cities-time-2783087-2025-09-07",
      "headline": "Total lunar eclipse tonight: Moon to turn blood-red for 82 minutesThis striking phenomenon, often referred to as a \"Blood Moon\", will last for an impressive 82 minutes, making it one of the longest total lunar eclipses of the decade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/ukrainian-refugee-seeking-safety-us-stabbed-death-ex-conman-train-iryna-zarutska-decarlos-brown-jr-charlotte-2783254-2025-09-07",
      "headline": "Ukrainian woman seeking safety in US stabbed to death by ex-conman in trainA 23-year-old Ukrainian refugee, Iryna Zarutska, was fatally stabbed on a Charlotte light rail train in a random attack by homeless ex-convict Decarlos Brown Jr. The incident has raised concerns over transit safety in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anuparna-roy-makes-history-wins-best-director-at-82nd-venice-film-festival-2783284-2025-09-07",
      "headline": "India's Anuparna Roy makes history, wins Best Director at 82nd Venice Film FestivalThe 82nd Venice Film Festival concluded with Indian filmmaker Anuparna Roy making history, winning Best Director for her debut 'Songs of Forgotten Trees', while American indie 'Father Mother Sister Brother' took home the Golden Lion for Best Film."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-to-visit-flood-hit-punjab-gurdaspur-on-september-9-to-meet-families-review-relief-operations-2783221-2025-09-07",
      "headline": "PM Modi to visit flood-hit Punjab's Gurdaspur on September 9, to meet familiesSources said the Prime Minister is likely to stress the urgent need to strengthen embankments along the Sutlej, Beas, Ravi, and Ghaggar rivers, which have weakened over the years due to illegal mining and lack of maintenance, during his visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-pms-is-changing-for-gen-z-and-millennial-women-hustle-culture-2782571-2025-09-07",
      "headline": "Is hustle culture making your PMS worse?Hustle culture impacts women's bodies like a domino effect: more stress, more lifestyle issues, irregular menstrual cycles, and more intense PMS. Believe it or not, it's true. Experts decode the layers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-final-india-vs-korea-preview-world-cup-spot-2783177-2025-09-07",
      "headline": "Red-hot India eye WC spot and 4th Asia Cup title, but Korea stands in their wayThe Indian team have found form at the right time as they chase down a spot in next year's World Cup and aim for their fourth Asia Cup title on Sunday, September 7. But standing in their way will be defending champions, Korea, who have delivered the goods on big occasions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-killing-venezuelan-cartel-members-a-war-crime-vice-president-jd-vance-doesnt-give-a-st-2783289-2025-09-07",
      "headline": "US killing Venezuelan cartel members a war crime? JD Vance 'doesn't give a s**t'JD Vance's remarks came after political commentator Brian Krassenstein condemned the strike as unlawful, arguing that \"killing the citizens of another nation who are civilians without any due process is called a war crime\". "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jailed-ex-mp-prajwal-revanna-to-work-as-library-clerk-for-rs-522-per-day-pay-2783333-2025-09-07",
      "headline": "Jailed ex-MP Prajwal Revanna to work as library clerk for Rs 522 per day payFormer JD(S) MP Prajwal Revanna's main responsibilities include issuing books to other inmates and maintaining records of borrowed books, according to jail authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pune-college-student-dances-to-dupatta-mera-in-viral-video-internet-cant-look-away-2783038-2025-09-06",
      "headline": "Internet can't look away from viral video of Pune student performing at college festIn the video, Ritesh takes centre stage with a remix of three songs – 'Dupatta Mera', 'Jigar Da Tukda', and 'Shaky'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-520-05-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/planned-an-islamic-india-by-2047-chargesheet-in-chhangur-religious-conversion-case-2783320-2025-09-07",
      "headline": "Planned an Islamic India by 2047: Chargesheet in Chhangur religious conversion caseThe ATS cracked down on Chhangur Baba, who allegedly received Rs 500 crore from Muslim countries to operate a conversion racket that systematically targeted poor, widowed, and vulnerable women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/when-bengal-assembly-turned-ground-zero-of-mamata-bjp-war-2783103-2025-09-06",
      "headline": "When Bengal assembly turned Ground Zero of Mamata-BJP warThe Trinamool-BJP battle in the run-up to the Bengal assembly polls is taking the shape of a bitter face-off over Bangla identity, history and the very right to speak the language\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-slays-in-silver-at-birmingham-event-fans-flock-in-a-flurry-2783228-2025-09-07",
      "headline": "Kareena Kapoor slays in silver at Birmingham event, fans flock in a flurryBollywood icon Kareena Kapoor Khan created a buzz in Birmingham as she dazzled fans at a store launch, charming the crowd with her elegance and warmth. Several videos and pictures from the event went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-expected-in-south-korea-next-month-meeting-with-xi-jinping-on-the-cards-glbs-2783172-2025-09-07",
      "headline": "Trump may meet China's Xi in South Korea next month, key talks on cards: ReportAccording to CNN, the White House is considering a bilateral meeting between Donald Trump and Xi Jinping on the sidelines of APEC, though no firm plans have been finalised. The talks are seen as potentially pivotal for trade and security relations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-scientists-say-cancer-vaccine-enteromix-mrna-technology-ready-for-use-2783326-2025-09-07",
      "headline": "Russian scientists say cancer vaccine ready for use after successful trialsThe cancer vaccine, called Enteromix, is based on mRNA technology — the same approach used in some Covid-19 vaccines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/hyundai-cars-get-cheaper-after-gst-cut-creta-sees-benefits-up-to-rs-72145-2783301-2025-09-07",
      "headline": "Hyundai cars get cheaper after GST cut, Creta sees benefits up to Rs 72,145Hyundai has announced price cuts of up to Rs 2.4 lakh across its lineup, passing on the full benefit of the recent GST 2.0 reforms effective September 22, 2025.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prenelan-subrayen-cleared-icc-legal-bowling-action-south-africa-cricket-2783329-2025-09-07",
      "headline": "South Africa's Prenelan Subrayen cleared to bowl by ICC after suspect action reviewThe ICC has cleared South Africa's spinner Prenelan Subrayen to continue bowling in international cricket. This comes alongside South Africa's third ODI game against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-hat-trick-leads-redlands-kfc-t20-max-final-win-2783327-2025-09-07",
      "headline": "Watch: Marnus Labuschagne's hat-trick guides Redlands to T20 Max triumphMarnus Labuschagne took a hat-trick to help Redlands win the KFC T20 Max Final against Valleys. He registered bowling figures of 3/13 in 2.2 overs and secured a 41-run victory for his team in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-squad-selection-ajit-agarkar-2783328-2025-09-07",
      "headline": "Agarkar's selection committee have done a fantastic job: Ex-India playerThe Indian cricket team has seen a fair bit of success in white ball cricket in the recent past. Former cricketer Devang Gandhi has credited that success to brave calls from Ajit Agarkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-r-madhavan-action-movie-teaser-chase-thala-2783330-2025-09-07",
      "headline": "MS Dhoni in an action flick? Thala goes guns blazing with R Madhavan in new teaserMS Dhoni has stunned fans with a high-octane action teaser alongside R Madhavan in Vasan Bala's The Chase. The cricket legend turned task-force officer has left the internet buzzing over his unexpected on-screen avatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pant-used-to-ask-bowlers-to-attack-his-body-at-fast-pace-sanjay-bangar-2783313-2025-09-07",
      "headline": "Pant used to ask bowlers to attack his body at fast pace: Former India coachFormer India batting coach Sanjay Bangar revealed Rishabh Pant's fearless approach from early days. Pant's has been undergoing rehabilitation after fracturing his toe during the England Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-mens-compound-archery-team-wins-maiden-world-championship-gold-2783311-2025-09-07",
      "headline": "Historic gold for India's men's compound archery team at World ChampionshipsThe Indian men's compound archery team won their first-ever gold at the World Archery Championships. This historic victory highlights India's rising prowess in compound archery and boosts medal hopes for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lovlina-borgohain-training-issues-world-boxing-championships-2025-2783303-2025-09-07",
      "headline": "After World Championships exit, Lovlina Borgohain rues lack of training and exposureLovlina Borgohain crashed out early at the Women's World Boxing Championships citing poor training support. She highlights systemic gaps ahead of Paris 2024 but vows to fight back stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-vs-jannik-sinner-us-open-final-no-1-ranking-battle-2783294-2025-09-07",
      "headline": "When unpredictability meets intensity: US Open set for blockbuster finalJannik Sinner and Carlos Alcaraz are meeting for the 3rd time in a Grand Slam final. Whoever wins the match will be crowned No.1 in the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-training-session-2783280-2025-09-07",
      "headline": "Asia Cup 2025: Inside India's first training session in DubaiThe Indian cricket team trained in Dubai ahead of their opening match in the Asia Cup. If the training sessions are anything to go by, it is unlikely that Sanju Samson is going to be a part of India's playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-south-africa-wtc-2025-27-tests-t20is-odis-faisalabad-odi-return-2783256-2025-09-07",
      "headline": "Pakistan to start WTC 2025-27 cycle with two-match series against South AfricaPakistan will host South Africa in their opening series of the World Test Championship (WTC)2025-27. Faisalabad is set to host its first ODI in 17 years, marking a significant return of international cricket to the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-mens-compound-archery-team-wins-maiden-world-championship-gold-2783311-2025-09-07",
      "headline": "Historic gold for India's men's compound archery team at World ChampionshipsThe Indian men's compound archery team won their first-ever gold at the World Archery Championships. This historic victory highlights India's rising prowess in compound archery and boosts medal hopes for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lovlina-borgohain-training-issues-world-boxing-championships-2025-2783303-2025-09-07",
      "headline": "After World Championships exit, Lovlina Borgohain rues lack of training and exposureLovlina Borgohain crashed out early at the Women's World Boxing Championships citing poor training support. She highlights systemic gaps ahead of Paris 2024 but vows to fight back stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-vs-jannik-sinner-us-open-final-no-1-ranking-battle-2783294-2025-09-07",
      "headline": "When unpredictability meets intensity: US Open set for blockbuster finalJannik Sinner and Carlos Alcaraz are meeting for the 3rd time in a Grand Slam final. Whoever wins the match will be crowned No.1 in the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-training-session-2783280-2025-09-07",
      "headline": "Asia Cup 2025: Inside India's first training session in DubaiThe Indian cricket team trained in Dubai ahead of their opening match in the Asia Cup. If the training sessions are anything to go by, it is unlikely that Sanju Samson is going to be a part of India's playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-south-africa-wtc-2025-27-tests-t20is-odis-faisalabad-odi-return-2783256-2025-09-07",
      "headline": "Pakistan to start WTC 2025-27 cycle with two-match series against South AfricaPakistan will host South Africa in their opening series of the World Test Championship (WTC)2025-27. Faisalabad is set to host its first ODI in 17 years, marking a significant return of international cricket to the city."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}