{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-meeting-expectations-today-ipo-investment-fpis-reforms-min-amount-stock-market-dalal-street-2786234-2025-09-12",
      "headline": "Sebi meeting today: What can stock market investors expect from meeting?The Securities and Exchange Board of India (Sebi) is expected to approve a set of reforms that aim to make the market more attractive for businesses and investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armanis-will-outlines-gradual-sale-or-ipo-of-fashion-empire-2786214-2025-09-12",
      "headline": "Giorgio Armani's will outlines gradual sale or IPO of fashion empireThe late Giorgio Armani has left behind more than just a fashion empire. His will reveals a carefully crafted plan for the future of his company. Here's what it says."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-season-9-vijay-sethupathi-host-october-5-premiere-2786894-2025-09-13",
      "headline": "Bigg Boss Tamil 9 to premiere soon, Vijay Sethupathi's show gets launch date'Bigg Boss Tamil' Season 9 will begin in October, with Vijay Sethupathi resuming hosting duties. The official channel has released a new poster announcing the premiere date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zayed-khan-backs-india-unbeatable-ahead-asia-cup-2025-match-pakistan-2786871-2025-09-13",
      "headline": "Zayed Khan backs India as unbeatable ahead of Asia Cup 2025 clash with PakistanActor Zayed Khan voiced his support for India ahead of the Asia Cup 2025, calling the team unbeatable and highlighting the value of India-Pakistan clashes in fostering sportsmanship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-husband-vicky-jain-injured-accident-gets-45-stitches-2786847-2025-09-13",
      "headline": "Ankita Lokhande's husband Vicky Jain injured in accident, gets 45 stitchesActor Ankita Lokhande's husband Vicky Jain was hospitalised after a glass injury left him with 45 stitches. Ankita stayed by his side as he recovered in Mumbai.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karishma-sharma-recounts-train-mishap-after-discharge-2786830-2025-09-13",
      "headline": "Actor Karishma Sharma recounts train mishap after dischargeActor Karishma Sharma recalled her traumatic Mumbai train accident, shared a health update, and urged commuters to stay calm and avoid panic.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-film-release-26-september-2025-neeraj-ghaywan-ishaan-khatter-janhvi-kapoor-vishal-jethwa-karan-johar-2786776-2025-09-13",
      "headline": "Homebound: Janhvi Kapoor, Ishaan Khatter and Vishal's film gets global release dateAfter winning appreciation and standing ovations at various International film festivals, Karan Johar's 'Homebound' is set for a theatrical release. The movie stars Janhvi Kapoor, Vishal Jethwa, and Ishaan Khatter in key roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-father-defends-jagdish-patani-firing-bareilly-home-khushboo-remarks-premanand-maharaj-2786784-2025-09-13",
      "headline": "After firing at home, Disha Patani's father defends Khushboo's remarks on saintDisha Patani's father, Jagdish Patani, recently spoke about the firing incident at his Bareilly home. He even defended his daughter, Khusboo's remarks, which were connected to spiritual leader Premanand Ji Maharaj."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/requiem-for-hate-economy-box-office-bombing-of-the-bengal-files-tells-us-vivek-agnihotri-udaipur-files-2786741-2025-09-13",
      "headline": "Requiem for hate economy? What the box office bombing of Bengal Files tells usPropaganda-driven \"files\" franchise has hit a wall. With Bengal and Udaipur both flopping spectacularly, India's audience seems done subsidising the hate economy wrapped as cinematic history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-supports-anurag-kashyap-nishaanchi-before-release-poster-vedika-pinto-sonakshi-sinha-2786720-2025-09-13",
      "headline": "Salman Khan supports Anurag Kashyap's Nishaanchi before release, praises posterSalman Khan recently extended his luck to Anurag Kashyap's upcoming film 'Nishaanchi'. He shared a video along with a heartfelt note for the entire team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-20-farah-khan-schools-kunickaa-sadanand-baseer-ali-weekend-ka-vaar-salman-khan-2786701-2025-09-13",
      "headline": "Bigg Boss 19 episode 20: Farah Khan schools Kunickaa, Baseer in fiery exchangeFilmmaker-producer Farah Khan took Kunickaa Sadanand to task for taking puris off Zeeshan Quadri's plate, and also pulled up Baseer Ali for questioning the calibre of the housemates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-software-engineer-delhi-fails-answer-rs-50-lakh-question-can-you-2786686-2025-09-13",
      "headline": "KBC 17: Software engineer from Delhi fails to answer Rs 50 lakh question. Can you?In the latest episode of 'Bigg Boss 17', a software engineer from Delhi failed to answer a Rs 50 lakh question on Emerald Capital. Would you like to take your chance? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-punjab-to-goa-how-bollywood-keeps-recycling-state-stereotypes-param-sundari-2786548-2025-09-13",
      "headline": "From Punjab to Kerala, how Bollywood keeps recycling state stereotypesBollywood reduces India's states to punchlines, mustard fields, paan stains, lungi dances. In this week's Cinematic Saturday, we will discuss why audiences deserve better representation on screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-day-1-teja-sajja-film-opens-strong-beats-hanuman-record-2786658-2025-09-13",
      "headline": "Mirai box office Day 1: Teja Sajja's film opens strong, beats HanuMan recordTeja Sajja's 'Mirai' made a strong debut on September 12, 2025. The film earned Rs 12 crore on its first day across all languages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhruv-rathee-criticises-vivek-agnihotri-screening-adult-rated-bengal-files-children-2786631-2025-09-13",
      "headline": "Dhruv Rathee criticises Vivek Agnihotri for showing The Bengal Files to childrenYouTuber Dhruv Rathee calls out filmmaker Vivek Agnihotri for showing the A-rated film The Bengal Files to children, raising concerns about exposure to violent content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parasakthi-release-pongal-sivakarthikeyan-face-clash-thalapathy-vijay-jana-nayagan-2786617-2025-09-13",
      "headline": "Parasakthi release set for Pongal, Sivakarthikeyan to face Vijay's Jana NayaganDirector Sudha Kongara's Parasakthi, featuring Sivakarthikeyan, is set for a Pongal 2026 release and will face a box office clash with Thalapathy Vijay's Jana Nayagan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-homebound-earns-standing-ovation-at-tiff-2025-premiere-janhvi-kapoor-ishaan-khatter-vishal-jethwa-2786610-2025-09-13",
      "headline": "Karan Johar's Homebound earns standing ovation at TIFF 2025 premiere. WatchKaran Johar's 'Homebound', directed by Neeraj Ghaywan, received a standing ovation at the 50th Toronto International Film Festival. The film stars Ishaan Khatter, Janhvi Kapoor, and Vishal Jethwa in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-releases-new-album-play-dance-pop-track-symmetry-out-now-2786455-2025-09-12",
      "headline": "Ed Sheeran releases new album Play, dance-pop track Symmetry out nowEd Sheeran recently released his new album 'Play' featuring Indian and Persian musical influences. The album offers collaborations with producers and musicians from across the globe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/do-you-wanna-partner-review-tamannaah-bhatia-diana-penty-craft-beer-startup-2785961-2025-09-12",
      "headline": "Do You Wanna Partner review: Tamannaah-Diana's beer drama is almost brew-tifulRelease Date:Fri Sep 12, 2025Do You Wanna Partner series review: Tamannaah Bhatia stars as Shikha, a woman reinventing herself through a craft beer startup. The series explores female ambition, jugaad, and fierce competition in a male-dominated industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-sufi-motiwala-says-outdated-stereotypes-of-lgbtq-characters-fuel-societal-stigma-2786451-2025-09-12",
      "headline": "Sufi Motiwala says outdated stereotypes of LGBTQ characters fuel societal stigmaInfluencer-turned-actor Sufi Motiwala expressed that there are hardly any projects being created where LGBTQIA artistes can tell their own stories. In an exclusive chat with India Today, he also discussed his acting debut in 'Do You Wanna Partner'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-gets-emotional-over-kantara-1-song-making-rishab-shetty-shows-love-2786453-2025-09-12",
      "headline": "Diljit Dosanjh gets emotional over Kantara 1 song-making, Rishab Shetty shows loveDiljit Dosanjh just treated fans to a rare, behind-the-scenes peek from 'Kantara: Chapter 1', sharing a warm and heartfelt video with actor-director Rishab Shetty. Shetty, overwhelmed with love, reacted to the post. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ready-to-do-major-sanctions-on-russia-when-all-nato-nations-agree-and-do-the-same-thing-says-trump-2786834-2025-09-13",
      "headline": "Trump lobbies Nato to sanction Russia and hit China with 50-100% tariffsUS President Donald Trump urged Nato nations to stop buying Russian oil and proposed 50–100 percent tariffs on China to break Moscow's grip, warning that failure to act would waste US resources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-is-indias-close-friend-wish-people-there-very-best-for-bright-future-pm-congratulates-sushila-karki-2786793-2025-09-13",
      "headline": "Example of women empowerment: PM Modi congratulates Nepal's Sushila KarkiSushila Karki took oath as Nepal's interim prime minister, the first woman to do so, on Friday night, four days after KP Sharma Oli quit office following massive protests against his government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-jab-animal-lovers-cow-debate-stray-dogs-supreme-court-order-outrage-2786864-2025-09-13",
      "headline": "Cow not an animal for them: PM Modi takes a swipe at animal lovers, and morePM Modi said despite there being many animal lovers, most of them do not consider the cow as an animal. It was seen as a veiled jab at the selective ways some people express their love for animals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/ground-report/story/nepal-genz-protests-ground-report-casinos-shut-looted-vandalised-hotels-hit-tourism-industry-billion-losses-2786816-2025-09-13",
      "headline": "Ground report: Nepal's casinos vandalised, tourism struggles to recoverIndia Today visited casinos near the India-Nepal border in cities like Dhangadhi and Kanchanpur, where the aftermath of recent violent protests is clearly visible. Several of these facilities were targeted during the unrest, and were vandalised and looted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-operation-sindoor-pahalgam-attack-calls-to-boycott-india-pakistan-asia-cup-match-dubai-unites-nation-2786641-2025-09-13",
      "headline": "After Op Sindoor, calls to boycott India-Pak match unite nationAfter the Pahalgam attack and Operation Sindoor, outrage over India facing Pakistan in the Asia Cup has snowballed. From veterans and political leaders to celebrities and common citizens, voices on social media are uniting in calls for a complete boycott of the high-voltage match on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lashkar-e-taiba-rebuilds-markaz-taiba-state-funding-flood-relief-fronts-indian-air-strike-2786791-2025-09-13",
      "headline": "Pak funnels earthquake aid to Lashkar to rebuild mosque destroyed in Op SindoorThe demolition and reconstruction at Markaz Taiba are being supervised by senior LeT leaders. Relief campaigns for flood victims are being used to channel funds into rebuilding the terror infrastructure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-protests-india-pakistan-cricket-match-calls-boycott-pahalgam-attack-outrage-2786874-2025-09-13",
      "headline": "Blood and cricket don't mix: AAP protests India vs Pak clash, burns effigiesThe AAP has launched protests against the upcoming India-Pakistan cricket match, accusing the Centre of disrespecting Pahalgam attack victims and threatening to expose venues screening the match, while calling for a nationwide boycott."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/requiem-for-hate-economy-box-office-bombing-of-the-bengal-files-tells-us-vivek-agnihotri-udaipur-files-2786741-2025-09-13",
      "headline": "Requiem for hate economy? What the box office bombing of Bengal Files tells usPropaganda-driven \"files\" franchise has hit a wall. With Bengal and Udaipur both flopping spectacularly, India's audience seems done subsidising the hate economy wrapped as cinematic history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-first-visit-manipur-strife-torn-churachandpur-kuki-imphal-meitei-visit-project-inauguration-2786399-2025-09-13",
      "headline": "Focus Churachandpur: Why PM Modi's hills area visit is crucialPrime Minister Narendra Modi is visiting Manipur for the first time since ethnic clashes began in 2023. His focus is Churachandpur, the conflict's epicentre, where he will initiate projects worth Rs 7,300 crore. While Imphal shows signs of stability, Kukis in Churachandpur remain sceptical about the government's promises."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/case-against-congress-over-ai-video-mocking-pm-modi-and-his-mother-2786872-2025-09-13",
      "headline": "Case against Congress over AI video mocking PM Modi and his motherThe 36-second clip, marked \"AI GENERATED,\" has been widely shared online and is being seen by the BJP as a personal attack on PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-assistant-coach-ten-doeschate-asia-cup-pakistan-boycott-calls-gambhir-2786895-2025-09-13",
      "headline": "With Gambhir's message, how India is preparing for Pak clash amid boycott callsIndia's Dutch fielding coach, Ryan ten Doeschate, said on Saturday that India-Pakistan boycott sentiments remain a sensitive issue. However, he emphasised that the players are strictly following the directives of the BCCI and the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/3-takers-for-every-iit-seat-the-jee-advanced-bottleneck-no-one-talks-about-2786832-2025-09-13",
      "headline": "3 takers for every IIT seat: The JEE Advanced bottleneck no one talks aboutIn 2025, 54,378 students cracked JEE Advanced but just 18,160 IIT seats were available. The supernumerary additions barely moved the needle, leaving over 36,000 qualifiers settling for NITs or IIITs, navigating uneven private colleges, or bracing for another year in coaching hubs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-modi-unveils-rs-100-coin-commemorating-bhupen-hazarika-in-guwahati-video-2786912-2025-09-13",
      "headline": "Video: PM Modi unveils Rs 100 coin commemorating Bhupen Hazarika in GuwahatiPrime Minister Narendra Modi on Friday attended a special function in Guwahati marking the centenary of legendary singer, composer and Bharat Ratna awardee Dr Bhupen Hazarika."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ryan-crouser-world-championship-shot-put-hat-trick-injury-comeback-tokyo-25-2786888-2025-09-13",
      "headline": "Back from break, USA's Ryan Crouser wins 3rd straight World Championship titleRyan Crouser completed an incredible world championship shot put hat-trick on Saturday, matching his three Olympic golds, after having not thrown once all season before the morning heats. The American produced a winning effort of 22.34 metres to claim gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-must-create-a-bridge-of-harmony-between-hills-and-valley-pms-peace-message-for-meiteis-kukis-in-imphal-2786792-2025-09-13",
      "headline": "In Imphal, PM urges Meiteis and Kukis to build harmony between hills and valleyDuring his visit to the Kuki-Zo–dominated Churachandpur and later the Meitei-dominated Imphal Valley, PM Modi stressed peace and development as his central message to the violence-stricken region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-punjab-to-goa-how-bollywood-keeps-recycling-state-stereotypes-param-sundari-2786548-2025-09-13",
      "headline": "From Punjab to Kerala, how Bollywood keeps recycling state stereotypesBollywood reduces India's states to punchlines, mustard fields, paan stains, lungi dances. In this week's Cinematic Saturday, we will discuss why audiences deserve better representation on screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-522-12-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/explosion-at-cafe-in-madrid-spain-several-injured-2786906-2025-09-13",
      "headline": "21 injured in explosion at cafe in MadridThe blast happened at 3 pm (local time) in Vallecas, a south-central district of Madrid, according to emergency services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-boycott-calls-sunil-gavaskar-reacts-governments-call-final-2786891-2025-09-13",
      "headline": "Government's call is the final call: Sunil Gavaskar on India vs Pakistan in Asia CupFormer India captain Sunil Gavaskar has reacted to the growing controversy around the upcoming India vs Pakistan Asia Cup 2025 clash, emphasising that the team is simply following BCCI and government directives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/pickleball-the-chic-new-playground-for-friendships-and-power-networking-2786165-2025-09-13",
      "headline": "Pickleball, the chic new playground for friendships and power networkingWondering why so many people around you are suddenly talking about pickleball? It's because the courts have turned into some of the coolest hangout spots in town, where friendships brew one game at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championship-2025-indians-to-watch-out-for-neeraj-chopra-animesh-kujur-2786694-2025-09-13",
      "headline": "Five Indian athletes to watch at World Athletics Championships 2025 in TokyoThe World Athletics Championships kicked off on Saturday, September 13. Nineteen Indian athletes are participating in the competition, and here are five you should watch out for."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sikh-woman-raped-by-two-men-in-uk-park-oldbury-told-go-back-to-your-country-racial-attack-hate-crime-sikh-community-abroad-2786721-2025-09-13",
      "headline": "Go back to your country, Sikh woman told after being raped in UKA Sikh woman was told to \"go back to her own country\" by two men who allegedly raped her at a park in Oldbury, UK. Police are treating the assault as a racially aggravated hate crime and launched a manhunt for the suspects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-high-court-taj-palace-max-hospitals-receive-hoax-bomb-threats-via-email-call-2786866-2025-09-13",
      "headline": "After Delhi High Court, Taj Palace and 2 Max Hospitals receive hoax bomb threatsNew Delhi's Hotel Taj Palace and two Max Hospitals received bomb threats on Saturday, later confirmed as hoax. Police, fire services, and cyber cell teams are investigating the chain of threat emails."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-harbhajan-singh-bcci-agm-representatives-president-election-2786913-2025-09-13",
      "headline": "Ganguly, Harbhajan, BCCI secretary Saikia in draft electoral roll ahead of BCCI AGMFormer captain Sourav Ganguly, ex-India spinner Harbhajan Singh, BCCI secretary Devajit Saikia, and IPL chairman Arun Singh Dhumal were confirmed on Saturday as the representatives of the Full Members of the BCCI ahead of the board's AGM and general election scheduled for September 28"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ryan-ten-doeschate-on-mohammad-nawaz-mike-hesson-asia-cup-2786899-2025-09-13",
      "headline": "Nawaz better than Kuldeep, Varun? India coach responds to Mike HessonIndia assistant coach Ryan Ten Doeschate gave his take on Mike Hesson's world no 1 claim about Mohammad Nawaz ahead of the Asia Cup 2025 clash against Pakistan. India and Pakistan are set to lock horns on Sunday, September 14 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-assistant-coach-ten-doeschate-asia-cup-pakistan-boycott-calls-gambhir-2786895-2025-09-13",
      "headline": "With Gambhir's message, how India is preparing for Pak clash amid boycott callsIndia's Dutch fielding coach, Ryan ten Doeschate, said on Saturday that India-Pakistan boycott sentiments remain a sensitive issue. However, he emphasised that the players are strictly following the directives of the BCCI and the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-will-be-happy-not-to-face-virat-kohli-in-the-asia-cup-sunil-gavaskar-2786896-2025-09-13",
      "headline": "Pakistan will be happy not to face Virat Kohli in the Asia Cup: Sunil GavaskarIndian cricket legend Sunil Gavaksar believes that Pakistan would be happy that they will not have to face Virat Kohli during their upcoming Asia Cup clash on September 14. Kohli called time on his T20I career after India's 2024 T20 World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-boycott-calls-sunil-gavaskar-reacts-governments-call-final-2786891-2025-09-13",
      "headline": "Government's call is the final call: Sunil Gavaskar on India vs Pakistan in Asia CupFormer India captain Sunil Gavaskar has reacted to the growing controversy around the upcoming India vs Pakistan Asia Cup 2025 clash, emphasising that the team is simply following BCCI and government directives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ryan-crouser-world-championship-shot-put-hat-trick-injury-comeback-tokyo-25-2786888-2025-09-13",
      "headline": "Back from break, USA's Ryan Crouser wins 3rd straight World Championship titleRyan Crouser completed an incredible world championship shot put hat-trick on Saturday, matching his three Olympic golds, after having not thrown once all season before the morning heats. The American produced a winning effort of 22.34 metres to claim gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-noah-lyles-kishane-thompson-mens-100m-heats-2786873-2025-09-13",
      "headline": "Noah Lyles and Thompson keep apace in World Championship 100m heatsNoah Lyles and Kishane Thompson both ran 9.95 seconds in the 100m heats, while Lamont Marcell Jacobs, Gift Leotela, and Andre De Grasse posted strong performances, setting up an exciting semi-final and final showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletic-championship-india-tough-start-pooja-olla-priyanka-goswami-2786868-2025-09-13",
      "headline": "Pooja Olla, Priyanka struggle as India face a tough start at World ChampionshipsIndia's athletes struggled on the opening day of the World Athletics Championships, facing tough competition in track, field, and race walking events. Despite setbacks, their resilience and determination signal brighter performances in the days ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-final-south-zone-vs-central-zone-yash-rathod-2786867-2025-09-13",
      "headline": "Duleep Trophy final: Yash Rathod's 194 brings Central Zone in commanding positionYash Rathod scored a career-best 194 to help Central Zone take a commanding lead in the Duleep Trophy final. His innings helped Central Zone take a massive lead of 362 in the first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/melissa-jefferson-wooden-julien-alfred-lead-100m-heats-world-championships-2786870-2025-09-13",
      "headline": "World Championship: Jefferson-Wooden, Alfred cruise through 100 metres heatsMelissa Jefferson-Wooden and Julien Alfred advanced comfortably through the first round of 100 metres heats at the world championships. Their performances set the stage for a highly anticipated showdown amid rising expectations and competitive pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-noah-lyles-kishane-thompson-mens-100m-heats-2786873-2025-09-13",
      "headline": "Noah Lyles and Thompson keep apace in World Championship 100m heatsNoah Lyles and Kishane Thompson both ran 9.95 seconds in the 100m heats, while Lamont Marcell Jacobs, Gift Leotela, and Andre De Grasse posted strong performances, setting up an exciting semi-final and final showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletic-championship-india-tough-start-pooja-olla-priyanka-goswami-2786868-2025-09-13",
      "headline": "Pooja Olla, Priyanka struggle as India face a tough start at World ChampionshipsIndia's athletes struggled on the opening day of the World Athletics Championships, facing tough competition in track, field, and race walking events. Despite setbacks, their resilience and determination signal brighter performances in the days ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-final-south-zone-vs-central-zone-yash-rathod-2786867-2025-09-13",
      "headline": "Duleep Trophy final: Yash Rathod's 194 brings Central Zone in commanding positionYash Rathod scored a career-best 194 to help Central Zone take a commanding lead in the Duleep Trophy final. His innings helped Central Zone take a massive lead of 362 in the first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/melissa-jefferson-wooden-julien-alfred-lead-100m-heats-world-championships-2786870-2025-09-13",
      "headline": "World Championship: Jefferson-Wooden, Alfred cruise through 100 metres heatsMelissa Jefferson-Wooden and Julien Alfred advanced comfortably through the first round of 100 metres heats at the world championships. Their performances set the stage for a highly anticipated showdown amid rising expectations and competitive pressure."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}