{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-latest-gmp-3-risks-to-consider-is-it-worth-subscribing-review-analyst-view-2636247-2024-11-20",
      "headline": "NTPC Green Energy IPO GMP dips: Is it worth subscribing? 3 risks to considerNTPC Green Energy IPO: The price band has been set between Rs 102 and Rs 108 per share, with a minimum application size of 138 shares, amounting to Rs 14,904 for retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-goldman-sach-bullish-yellow-metal-why-is-it-set-to-outshine-in-2025-analyst-view-2636222-2024-11-20",
      "headline": "Goldman's bullish call: Why gold is set to outshine by 2025Goldman Sachs analysts are bullish on the prices and have set a target of $3,000 per ounce for gold by December 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-maharashtra-elections-bse-nse-closed-on-november-20-check-details-2636210-2024-11-20",
      "headline": " Is the stock market closed today for Maharashtra elections? The most recent holiday was on November 15 for Guru Nanak Jayanti. The next holiday is scheduled for December 25, Christmas Day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-day-1-check-latest-subscription-gmp-subscribe-skip-review-2635963-2024-11-19",
      "headline": "NTPC Green Energy IPO Day 1: Check latest subscription, GMPThe initial public offering (IPO) of NTPC Green Energy Limited opened for bidding on Tuesday looking to raise Rs 10,000 crore through a fresh issue entirely of 92.59 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-3-reasons-why-sensex-nifty-failed-to-sustain-stock-market-relief-rally-2635939-2024-11-19",
      "headline": "Explained: 3 reasons why Sensex, Nifty failed to sustain relief rallyThe benchmark indices, Sensex and Nifty, surged over 1% in early trade, with the Sensex climbing more than 1,000 points intraday. However, by the end of the session, most of these gains were erased."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-warns-public-about-deepfake-videos-of-top-officials-giving-financial-advice-2635922-2024-11-19",
      "headline": "RBI warns public about deepfake videos of top officials giving financial adviceIn a press release, the central bank clarified that these videos are fake and warned people not to engage with or believe in them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-but-bears-still-hold-control-ril-shares-down-2-percent-2635883-2024-11-19",
      "headline": "Sensex and Nifty bounce back but bears still hold control; RIL down 2%The S&P BSE Sensex added 239.37 points to close at 77,578.38, while the NSE Nifty50 was up 64.70 points to end at 23,518.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-crypto-replace-gold-which-is-better-to-buy-expert-comment-bitcoin-prices-2635826-2024-11-19",
      "headline": "Can cryptocurrency be the next gold? With strong support and remarkable returns, Bitcoin is now increasingly seen as a potential alternative to gold, despite its volatility and regulatory challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rebound-dalal-street-whats-next-2635848-2024-11-19",
      "headline": "Sensex, Nifty rebound: Will the relief rally on D-Street continue or fizzle out?Stock market today: While the market did show some signs of recovery today, the sharp decline in the final hours has left retail investors in an uncertain situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-over-1000-points-all-you-need-to-know-in-5-points-2635828-2024-11-19",
      "headline": "Sensex surges 1,000 points. All you need to know in 5 pointsThe rally saw the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) jump by Rs 6.06 lakh crore to Rs 435.14 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-subscription-review-3-reasons-why-you-should-subscribe-latest-gmp-2635800-2024-11-19",
      "headline": "NTPC Green Energy IPO: 3 reasons why you should subscribeNTPC Green Energy IPO: The subscription for NTPC Green Energy IPO will close on November 22, 2024 and the price band is set between Rs 102 and Rs 108 per share. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/honasa-consumer-mamaearth-share-price-today-30-percent-drop-two-sessions-what-next-for-stock-2635777-2024-11-19",
      "headline": "Honasa Consumer share price tumbles over 30% in two trading sessions. What next?Honasa Consumer share price: The sharp sell-off was triggered by a disappointing set of September quarter results and concerns over the company's near-term growth outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-jumps-morgan-stanley-upgrade-good-opportunity-to-buy-2635752-2024-11-19",
      "headline": "Explained: Why Suzlon Energy share price hit 5% upper circuit today Suzlon Energy share price: The jump in its share price came after brokerage Morgan Stanley upgraded the stock to 'Overweight' from 'Equal-weight.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-is-it-a-good-time-to-buy-3-things-you-should-know-expert-views-future-outlook-2635736-2024-11-19",
      "headline": "Is it a good time to buy gold? 3 things you should knowGold Price: On the MCX, gold futures maturing on December 5, 2024, were priced at Rs 75,450 per 10 grams, reflecting an increase of Rs 403 or 0.54%. The previous close was Rs 75,047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irfc-rvnl-irctc-ircon-railway-stocks-surge-stock-market-rally-2635731-2024-11-19",
      "headline": "IRFC, RVNL, IRCTC, IRCON: Why these railway stocks are gaining todayRailway stocks saw sharp gains during the session, led by IRFC, which rose over 5%.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-other-details-2635692-2024-11-19",
      "headline": "Zinka Logistics IPO allotment: How to check status, latest GMP and other detailsZinka Logistics IPO allotment: Investors can check their allotment status on the Bombay Stock Exchange (BSE) website or through the registrar, KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-calls-for-affordable-interest-rates-after-piyush-goyals-remarks-rbi-governor-shaktikanta-das-2635670-2024-11-19",
      "headline": "Nirmala Sitharaman calls for 'affordable' interest rates after Piyush GoyalThe Reserve Bank of India's (RBI) Monetary Policy Committee (MPC) has kept key interest rates unchanged since February 2023, citing persistent inflation pressures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-bull-run-sensex-up-1000-points-nifty-jumps-worst-over-key-things-to-know-2635666-2024-11-19",
      "headline": "Sensex surges 1,000 points, snaps 7-session losing streak. Is the worst over?Sensex today: At 11:36 am, the Sensex was up 1044.89 points at 78,383.90, while the NSE Nifty50 advanced 304.50 points to 23,758.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amazon-flipkart-executives-foreign-direct-investment-rules-violation-ed-probe-2635634-2024-11-19",
      "headline": "ED likely to summon top Amazon, Flipkart executives over FDI rule violationsThe ED's investigation stems from multiple complaints alleging that Amazon and Flipkart have been violating Foreign Direct Investment (FDI) rules by directly or indirectly favouring select vendors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-aerospace-giant-boeing-layoffs-washington-oregon-south-carolina-financial-crisis-2635628-2024-11-19",
      "headline": "Boeing to cut over 2,500 workers in US amid financial crisisNearly 2,200 layoff notices went to workers in Washington and another 220 in South Carolina, the two states where Boeing builds commercial airliners. Boeing declined to comment on the layoffs on Monday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-jharkhand-vote-high-stakes-assembly-polls-mva-mahayuti-bjp-congress-jmm-2636194-2024-11-20",
      "headline": "Maharashtra, Jharkhand vote in NDA vs INDIA battle Live UpdatesIn Maharashtra, a total of 4,136 candidates are contesting across 288 constituencies. While in Jharkhand, more than 500 candidates, including Chief Minister Hemant Soren and his wife Kalpana Soren, are contesting in 38 of the total 81 Assembly seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-pollution-aqi-severe-category-government-employees-work-from-home-minister-gopal-rai-announce-2636230-2024-11-20",
      "headline": "Delhi government orders 50% of its employees to work from home amid pollutionAs Delhi continues to grapple with the worsening air pollution crisis, the AAP government has decided to implement work from home in government offices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/ncp-sharad-pawar-leader-supriya-sule-denies-crypto-funds-for-polls-charge-says-not-my-voice-fake-messages-2636241-2024-11-20",
      "headline": "Not my voice, fake messages: Supriya Sule denies 'crypto funds for polls' chargeThe NCP (SP) leader dismissed the allegations a day after BJP's Sudhanshu Trivedi played audio clips at a presser, accusing Supriya Sule and Maharashtra Congress chief Nana Patole of indulging in illegal bitcoin transactions to change the results of the Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-wife-saira-banu-announce-separation-composer-statement-2636208-2024-11-20",
      "headline": "AR Rahman says 'we hoped to reach grand thirty' as wife announces separationAR Rahman and Saira Banu announced separation after 29 years of marriage. The composer shared an emotional statement regarding their decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/why-pickled-amla-is-a-superfood-to-add-to-your-indian-winter-diet-2635946-2024-11-20",
      "headline": "Why pickled amla is a superfood to add to your Indian winter dietCan an amla a day keep winter's ailments away? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/joe-biden-missing-joins-g20-summit-rio-brazil-group-photo-retake-narendra-modi-2636200-2024-11-20",
      "headline": "Biden front and centre as world leaders retake G20 family photoG20 Summit in Brazil: After missing the G20 family shot on Monday, US President Joe Biden was given a spot near the middle of the front row of the assembled world leaders as they retook the photo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-retires-offiical-speech-spain-vs-netherlands-davis-cup-final-2636196-2024-11-20",
      "headline": "Rafael Nadal retires: 'Good person from a small village' bids goodbye to tennisDavis Cup FInals: Rafael Nadal's glorious career ended on a bittersweet note as Spain lost their quarter-finals to the Netherlands in Mallaga on Tuesday. Nadal lost the last match of his professional career, but only after showcasing glimpses of his famous fighting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-airport-security-screening-india-bound-flights-anita-anand-bomb-threat-diplomatic-row-2636245-2024-11-20",
      "headline": "Canada tightens airport screening for travellers to India amid tensions: ReportCiting an \"abundance of caution\", the Canadian government has implemented additional security screening measures for passengers travelling from Canada to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-spacexs-super-heavy-rocket-crashes-into-ocean-after-launch-2636186-2024-11-20",
      "headline": "Video: SpaceX's Super Heavy rocket soft lands in ocean, explodesSpaceX: The mission aimed to demonstrate several key objectives, including the first-ever mid-air catch of the Super Heavy booster using the launch tower's \"chopstick\" arms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-who-chief-tedros-adhanom-ghebreyesus-tulsi-bhai-world-health-organisation-2636235-2024-11-20",
      "headline": "PM Modi pledges support to WHO chief 'Tulsi Bhai' for global health effortsPrime Minister Narendra Modi on Wednesday said that India will strengthen global efforts toward a healthy planet, as he responded to the WHO chief thanking for investment support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pollution-news-air-quality-index-severe-plus-flight-operations-grap-4-curbs-2636199-2024-11-20",
      "headline": "Toxic smog blankets Delhi as AQI hits 422, flights cancelled amid low visibilityDelhi AQI: According to the weather department, several monitoring stations in the national capital regions recorded an AQI of over 450 at 6 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maharashtra-assembly-election-2024-voting-live-updates-bollywood-celebrities-mumbai-mahayuti-mva-voter-turn-out-shah-rukh-khan-salman-khan-2636201-2024-11-20",
      "headline": "Akshay Kumar, Rajkummar among early voters in Mumbai amid Maharashtra pollingAs voting opens in Maharashtra Assembly Election, Bollywood celebrities including Akshay Kumar, Shah Rukh Khan, Salman Khan, Aamir Khan and several others are expected to cast their votes throughout the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/sarah-mcbride-transgender-congress-women-bathroom-ban-bill-nancy-mace-republicans-democrats-2636206-2024-11-20",
      "headline": "Republicans move to bar first transgender Congress member from women's bathroomIn a bill aimed specifically at Democrat Sarah McBride, the first transgender person in Congress, Republican Nancy Mace proposed prohibiting any lawmakers from \"using single-sex facilities other than those corresponding to their biological sex\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-issues-response-after-over-100-flyers-stuck-in-phuket-for-over-80-hours-2636068-2024-11-19",
      "headline": "Over 100 flyers stuck in Phuket for more than 80 hours, Air India respondsPassengers claimed on social media that the same flight took off from Phuket twice, but was called back to the airport due to technical issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/russian-president-vladimir-putin-visit-india-next-year-invitation-prime-minister-narendra-modi-2636178-2024-11-20",
      "headline": "Russian President Vladimir Putin likely to visit India next yearRussian officials said on Tuesday that the two sides are looking at the possibility of the visit but nothing has been finalised yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-goldman-sach-bullish-yellow-metal-why-is-it-set-to-outshine-in-2025-analyst-view-2636222-2024-11-20",
      "headline": "Goldman's bullish call: Why gold is set to outshine by 2025Goldman Sachs analysts are bullish on the prices and have set a target of $3,000 per ounce for gold by December 2025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-grap-iv-isnt-enough-for-delhi-to-get-to-grips-with-air-pollution-2635855-2024-11-19",
      "headline": "Why GRAP IV isn't enough for Delhi to get to grips with air pollutionThe annual calamity that winter smog now is proves the National Capital Region requires a sustained, all-year-long action plan rather than reactionary responses"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nuclear-war-risk-high-world-war-three-european-countries-ask-people-stock-food-water-2635926-2024-11-19",
      "headline": "Risk of nuclear war high, European countries ask people to stock up food, waterWorld War III might not be too far, some countries believe. While US President Joe Biden has supplied the US with long-range American missiles, Vladimir Putin has decreased the threshold for the use of nuclear weapons in Russia. Nato countries, afraid, issued pamphlets to their citizens, advising them on how to prepare for World War III."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-diverted-jaipur-delhi-smog-passengers-stranded-pilot-duty-hours-2635928-2024-11-19",
      "headline": "Air India passengers stuck in Jaipur due to flight diversion sent to Delhi on busThe flight, carrying over 180 passengers, was travelling from Paris to Delhi when it was diverted to Jaipur due to poor visibility. However, after completing his duty hours, the pilot refused to continue the journey to Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-pat-cummins-ian-healy-2636024-2024-11-19",
      "headline": "Target Virat Kohli's front pads, else 'body bash': Ian Healy to Australia quicksIan Healy has advised Australian bowlers to focus on Virat Kohli's front pad during the Border-Gavaskar Trophy. If ineffective, Healy suggests a body-targeting strategy to unsettle the Indian batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/maharashtra-elections-2024-akshay-kumar-farhan-akhtar-others-cast-vote-2636237-2024-11-20",
      "headline": "Maharashtra Elections 2024: Akshay Kumar, Farhan Akhtar, and others cast voteSeveral celebrities from the Hindi film and television industry queued up outside polling booths in Mumbai as Maharashtra voted in the assembly elections on Wednesday, November 20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-air-pollution-delhi-patna-lucknow-most-polluted-guwahati-thiruvananthapuram-least-cities-cpcb-air-quality-index-2636212-2024-11-20",
      "headline": "Delhi air worst in India today, Lucknow in 2nd spot; Aizawl least polluted cityAs of Wednesday morning, six major cities recorded \"poor\" air quality, four fell into the \"moderate\" category, four were rated \"satisfactory,\" and only one in the \"Good\" category, according to data from the Central Pollution Control Board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/road-accidents-in-uttar-pradesh-due-to-low-visibility-amid-dense-smog-muzaffarnagar-kanpur-firozabad-greater-noida-2636176-2024-11-20",
      "headline": "Two dead, many hurt in separate road accidents in UP due to dense smogAt least 19 people were injured after a collision between two trucks and a bus on the Eastern Peripheral Expressway of Greater Noida in the wee hours of Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-moment-spacexs-starship-bellyflop-and-crashes-into-indian-ocean-2636190-2024-11-20",
      "headline": "Video: Moment Starship bellyflops and crashes into Indian OceanThe Starship upper stage continued its journey, reaching a suborbital trajectory that took it halfway around the world in less than an hour. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/liam-payne-funeral-wednesday-one-direction-members-attend-2636259-2024-11-20",
      "headline": "Singer Liam Payne's funeral today, One Direction members to attend: ReportsFormer One Direction star Liam Payne's funeral is set for November 20 in England, following his tragic death from a fall in Buenos Aires. It has also been reported that One Direction members will be in attendance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-box-office-collection-day-6-detailed-report-suriya-film-60-crore-nett-in-india-2636257-2024-11-20",
      "headline": "Kanguva box office Day 6: Suriya's film mints Rs 60 crore in IndiaSuriya and director Siva's Kanguva is holding steady in theatres during the weekdays. The fantasy action drama finally earned Rs 60 crore nett in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/maharashtra-elections-2024-akshay-kumar-farhan-akhtar-others-cast-vote-2636237-2024-11-20",
      "headline": "Maharashtra Elections 2024: Akshay Kumar, Farhan Akhtar, and others cast voteSeveral celebrities from the Hindi film and television industry queued up outside polling booths in Mumbai as Maharashtra voted in the assembly elections on Wednesday, November 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-saira-banu-spearation-children-khatija-raheema-ameen-react-2636236-2024-11-20",
      "headline": "AR Rahman-wife Saira's children request privacy after parents announce separationAR Rahman and wife Saira Banu announced their separation on November 19. Their children, Khatija, Raheema and Ameen, requested privacy in these difficult times."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-gautam-gambhir-coach-pressure-2636252-2024-11-20",
      "headline": "Australia vs India: Can coach Gautam Gambhir prove his doubters wrong?Australia vs India: All eyes will firmly be on Gautam Gambhir as the outside noise surrounding the India coach is at an all-time high. Gambhir will be looking to use his ever-constant approach of remaining defiant and undeterred to make a statement during the Border-Gavaskar Trophy and shut down his critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-test-series-stats-preview-pat-cummins-steve-smith-2635870-2024-11-20",
      "headline": "AUS vs IND, Australia Stats Preview: Smith, Cummins near major landmarksAUS vs IND: Pat Cummins, Steve Smith and Nathan Lyon, the three stalwarts in the Australian Test team, will be in focus in the upcoming Test series against India, starting November 22 in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-votes-mumbai-wife-anjali-daughter-sara-maharashtra-elections-2636233-2024-11-20",
      "headline": "Watch Sachin Tendulkar votes in Mumbai along with wife Anjali, daughter SaraMaharashtra Elections: Batting great Sachin Tendulkar voted early in Mumbai on Wednesday and urged fellow citizens to exercise their democratic duty. Tendulkar posed along with his wife and daughter from the polling station. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/brazil-draw-1-1-vs-uruguay-argentina-beat-peru-to-close-in-on-world-cup-spot-2636227-2024-11-20",
      "headline": "Brazil draw 1-1 vs Uruguay, Argentina beat Peru to close in on World Cup spotFIFA World Cup South American qualifiers: Brazil shared points with Uruguay after a 1-1 draw, while Argentina secured a narrow 1-0 win over Peru. The results leave Argentina close to World Cup qualification, with Brazil under pressure to secure their spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-retires-carlos-alcaraz-emotional-tribute-2636215-2024-11-20",
      "headline": "Rafael Nadal's legacy will be eternal: Carlos Alcaraz pays emotional tribute Carlos Alcaraz thanked his 'idol', Rafael Nadal, for inspiring him after the Spanish legend retired from professional tennis in Malaga. Despite their efforts, Spain's team, inspired by Nadal, could not advance in the Davis Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-india-virat-kohli-superstar-magnetic-pull-australia-ponting-2636209-2024-11-20",
      "headline": "Kohli is superstar: Ponting explains India star's magnetic pull in AustraliaFormer Australia captain Ricky Ponting recently delved into what makes Virat Kohli so revered in Australia, sharing his insights during an episode of The ICC Review with host Sanjana Ganesan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-hardik-pandya-play-syed-mushtaq-ali-trophy-brother-krunal-captaincy-2636202-2024-11-20",
      "headline": "Hardik Pandya to play Syed Mushtaq Ali Trophy under brother Krunal's captaincy Hardik Pandya is set to feature in the Syed Mushtaq Ali Trophy for Baroda, under the captaincy of his elder brother Krunal Pandya. The tournament is set to kick off on November 23, a day before the IPL 2024 mega auction takes place in Jeddah.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-retires-offiical-speech-spain-vs-netherlands-davis-cup-final-2636196-2024-11-20",
      "headline": "Rafael Nadal retires: 'Good person from a small village' bids goodbye to tennisDavis Cup FInals: Rafael Nadal's glorious career ended on a bittersweet note as Spain lost their quarter-finals to the Netherlands in Mallaga on Tuesday. Nadal lost the last match of his professional career, but only after showcasing glimpses of his famous fighting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-sanjay-manjrekar-border-gavaskar-trophy-2024-25-australia-vs-india-2636167-2024-11-20",
      "headline": "KL Rahul isn't setting the stage on fire as an opener: Sanjay Manjrekar Former India cricketer Sanjay Manjrekar is against the idea of opening with KL Rahul in the first Test against Australia in Perth on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-finals-rafael-nadal-botic-van-de-zandschulp-farewell-report-2636153-2024-11-19",
      "headline": "Valiant Rafael Nadal goes down fighting in 'farewell' clashDavis Cup Finals: Rafael Nadal fought out of his skins, but lost to Botic van de Zandschulp in the singles match of the Spain vs Netherlands quarterfinals on Tuesday in Malaga. The Dutchman took an hour and 52 minutes to beat the Spanish legend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-nz-sri-lanka-beat-new-zealand-2-0-kusal-mendis-charith-asalanka-mitchell-santner-2636142-2024-11-19",
      "headline": "SL vs NZ: Sri Lanka take series 2-0 after third ODI gets called off due to rainSri Lanka completed a 2-0 series win over New Zealand in the three-match ODI series after the third ODI was called off due to incessant rain in Pallekele. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-hardik-pandya-play-syed-mushtaq-ali-trophy-brother-krunal-captaincy-2636202-2024-11-20",
      "headline": "Hardik Pandya to play Syed Mushtaq Ali Trophy under brother Krunal's captaincy Hardik Pandya is set to feature in the Syed Mushtaq Ali Trophy for Baroda, under the captaincy of his elder brother Krunal Pandya. The tournament is set to kick off on November 23, a day before the IPL 2024 mega auction takes place in Jeddah.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-retires-offiical-speech-spain-vs-netherlands-davis-cup-final-2636196-2024-11-20",
      "headline": "Rafael Nadal retires: 'Good person from a small village' bids goodbye to tennisDavis Cup FInals: Rafael Nadal's glorious career ended on a bittersweet note as Spain lost their quarter-finals to the Netherlands in Mallaga on Tuesday. Nadal lost the last match of his professional career, but only after showcasing glimpses of his famous fighting spirit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-sanjay-manjrekar-border-gavaskar-trophy-2024-25-australia-vs-india-2636167-2024-11-20",
      "headline": "KL Rahul isn't setting the stage on fire as an opener: Sanjay Manjrekar Former India cricketer Sanjay Manjrekar is against the idea of opening with KL Rahul in the first Test against Australia in Perth on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-finals-rafael-nadal-botic-van-de-zandschulp-farewell-report-2636153-2024-11-19",
      "headline": "Valiant Rafael Nadal goes down fighting in 'farewell' clashDavis Cup Finals: Rafael Nadal fought out of his skins, but lost to Botic van de Zandschulp in the singles match of the Spain vs Netherlands quarterfinals on Tuesday in Malaga. The Dutchman took an hour and 52 minutes to beat the Spanish legend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-nz-sri-lanka-beat-new-zealand-2-0-kusal-mendis-charith-asalanka-mitchell-santner-2636142-2024-11-19",
      "headline": "SL vs NZ: Sri Lanka take series 2-0 after third ODI gets called off due to rainSri Lanka completed a 2-0 series win over New Zealand in the three-match ODI series after the third ODI was called off due to incessant rain in Pallekele. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-trophy-tour-pakistan-bcci-pcb-jay-shah-mohsin-naqvi-2636122-2024-11-19",
      "headline": "Champions Trophy 2025 tour begins in Pakistan despite hosting uncertaintyThe trophy tour of the ICC Champions Trophy 2025 has begun in Pakistan despite the uncertainty over the hosting of the complete tournament in the country due to India's reluctance to travel to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-dhruv-jurel-perth-test-2636100-2024-11-19",
      "headline": "Can play as a specialist batter: Shastri lauds Jurel's temperament AUS vs IND: Ravi Shastri has backed Dhruv Jurel to play as a specialist batter ahead of India's five-match Test series against Australia, starting November 22 at the Perth Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-retirement-crying-davis-cup-botic-van-de-zandschulp-spain-vs-netherlands-2636099-2024-11-19",
      "headline": "Watch: Rafael Nadal gets emotional during national anthem in Davis Cup quartersLegendary Tennis player Rafael Nadal was seen getting emotional during the Spanish national anthem ahead of his quarter final game against Netherlands' Botic van de Zandschulp in the Davis Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-finals-rafael-nadal-farewell-live-updates-spain-vs-netherlands-2636053-2024-11-19",
      "headline": "Rafael Nadal Farewell Highlights: Botic van de Zandschulp beats Nadal 6-4, 6-4Davis Cup Finals Highlights: Botic van de Zandschulp beat Rafael Nadal 6-4, 6-4 in the quarterfinal clash in Malaga. It was just the second loss for the Spaniard in  Davis Cup and his first since 2004."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/china-masters-anupama-upadhyaya-first-round-2636034-2024-11-19",
      "headline": "Anupama Upadhyaya stuns World No.15 to book second round berth  World No.50 Anupama Upadhyaya defeated World No.15 Beiwen Zhang 21-17, 8-21, 22-20 and made her way through to the second round of the women's singles in the China Masters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-pat-cummins-ian-healy-2636024-2024-11-19",
      "headline": "Target Virat Kohli's front pads, else 'body bash': Ian Healy to Australia quicksIan Healy has advised Australian bowlers to focus on Virat Kohli's front pad during the Border-Gavaskar Trophy. If ineffective, Healy suggests a body-targeting strategy to unsettle the Indian batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-hussey-india-vs-pakistan-border-gavaskar-trophy-2024-25-australia-vs-india-2635976-2024-11-19",
      "headline": "Border Gavaskar Trophy not at par with India vs Pakistan rivalry: Michael HusseyFormer Australia cricketer Michael Hussey has said that India vs Australia rivalry will never be able to compete with India vs Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-ipl-2025-mega-auction-sanjay-manjrekar-gujarat-titans-2635944-2024-11-19",
      "headline": "Mohammed Shami might see a drop in his price tag at IPL auction: Sanjay ManjrekarFormer India cricketer Sanjay Manjrekar feels fast bowler Mohammed Shami is likely to experience a price drop at the IPL 2025 mega auction due to his injury issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/china-masters-anupama-upadhyaya-first-round-2636034-2024-11-19",
      "headline": "Anupama Upadhyaya stuns World No.15 to book second round berth  World No.50 Anupama Upadhyaya defeated World No.15 Beiwen Zhang 21-17, 8-21, 22-20 and made her way through to the second round of the women's singles in the China Masters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-pat-cummins-ian-healy-2636024-2024-11-19",
      "headline": "Target Virat Kohli's front pads, else 'body bash': Ian Healy to Australia quicksIan Healy has advised Australian bowlers to focus on Virat Kohli's front pad during the Border-Gavaskar Trophy. If ineffective, Healy suggests a body-targeting strategy to unsettle the Indian batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-hussey-india-vs-pakistan-border-gavaskar-trophy-2024-25-australia-vs-india-2635976-2024-11-19",
      "headline": "Border Gavaskar Trophy not at par with India vs Pakistan rivalry: Michael HusseyFormer Australia cricketer Michael Hussey has said that India vs Australia rivalry will never be able to compete with India vs Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-ipl-2025-mega-auction-sanjay-manjrekar-gujarat-titans-2635944-2024-11-19",
      "headline": "Mohammed Shami might see a drop in his price tag at IPL auction: Sanjay ManjrekarFormer India cricketer Sanjay Manjrekar feels fast bowler Mohammed Shami is likely to experience a price drop at the IPL 2025 mega auction due to his injury issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-sam-kerr-kirstie-mewis-chelsea-pride-baby-announcement-2635945-2024-11-19",
      "headline": "Sam Kerr faces 'hate' after baby announcement, Chelsea Pride slams critics Australian football player Sam Kerr was greeted with hate and abuse on social media after she announced her pregnancy with Kirstie Mewis of the United States on Monday, November 18. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-gerald-coetzee-found-guilty-of-icc-code-of-conduct-breach-during-india-t20i-2635940-2024-11-19",
      "headline": "Gerald Coetzee found guilty of ICC Code of Conduct breach during India T20ISouth Africa pacer Gerald Coetzee was found guilty of breaching the ICC Code Of Conduct during the 4th T20I against India. Coetzee was found guilty of breaching Article 2.8 of the ICC Code of Conduct for Players and Player Support Personnel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sledging-australia-vs-india-shane-watson-tip-border-gavaskar-2635911-2024-11-19",
      "headline": "Don't poke Virat Kohli: Shane Watson warns Australia ahead of Test seriesBorder-Gavaskar Trophy: Shane Watson said Australia will be well served if they don't get into the nerves of Virat Kohli and get him pumping. Kohli has had a lean run in Tests, but it is widely expected that the former captain will find his best in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-temba-bavuma-returns-wtc-final-race-2635910-2024-11-19",
      "headline": "SA vs SL: Bavuma returns as South Africa captain as WTC Final race heats upSouth Africa's Test captain Temba Bavuma is back from an elbow injury to lead in the home series against Sri Lanka. The team aims for a spot in the ICC World Test Championship final, needing to win all remaining home Tests."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}