{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-3-crucial-decisions-to-watch-out-for-2781234-2025-09-03",
      "headline": "GST Council Meeting: 3 crucial decisions to watch out forBig changes may be on the way as the GST Council begins its two-day meeting. From reducing GST slabs to easing compliance, the decisions taken could directly affect consumers and businesses alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rate-cut-common-goods-consumer-benefit-state-vs-centre-nirmala-sitharaman-2781225-2025-09-03",
      "headline": "GST Council meet: Rate cuts may spark clash between Centre and statesThe GST Council Meeting is underway and is expected to lower taxes on daily goods. Lower taxes could encourage spending and give the economy a push, but states worry about their already tight finances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-will-major-tax-overhaul-upset-state-revenues-2781166-2025-09-03",
      "headline": "GST Council meeting: Will major tax overhaul upset state revenues?Initial estimates indicate that states could see annual revenue declines from the proposed cuts, though long-term benefits are expected to outweigh the short-term losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/video/gst-20-implementation-tax-cut-consumer-goods-dussehra-september-5-diwali-bonanza-experts-answer-2781153-2025-09-03",
      "headline": "Will GST 2.0 be implemented by Dussehra? Experts answerThe GST Council Meeting will take place from September 2-4, with a lot of buzz about benefits to consumers with a reduction in tax on daily goods before the festive season begins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-your-sips-not-giving-returns-watch-out-for-these-5-mistakes-2781147-2025-09-03",
      "headline": "Are your SIPs not giving returns? Watch out for these 5 mistakesMany investors start SIPs with big hopes but end up disappointed with the returns. Often, the problem is not with SIPs but with some common mistakes that quietly reduce gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-today-whats-likely-to-get-cheaper-and-costlier-2781110-2025-09-03",
      "headline": "GST Council meeting today: What's likely to get cheaper and costlierAt the centre of discussions is a plan to simplify the current four-tier system into just two slabs—5% and 18%—potentially making daily essentials and electronic goods more affordable while introducing higher levies on luxury items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fall-after-opening-in-green-gst-council-meet-in-focus-2781079-2025-09-03",
      "headline": "Sensex, Nifty fall after opening in green, GST Council meeting in focusAt 9:25 am, the S&P BSE Sensex was trading nearly 100 points lower, while the NSE Nifty50 was also down marginally. Banking and financial stocks were among the top drags, reflecting investor caution amid global uncertainty and ongoing trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meets-today-major-tax-cuts-2-slab-structure-luxury-levy-on-agenda-2781071-2025-09-03",
      "headline": "GST Council meet: Key decisions on tax cuts, 2-slab structure in focusThe Centre's proposal, described as a 'next-gen' GST reform, aims to prune the current four-tier tax structure into just two slabs—5% and 18%. This would mean doing away with the 12% and 28% brackets introduced when GST was launched in July 2017. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-finalises-priority-products-for-indigenous-semiconductor-ips-ashwini-vaishnaw-2781021-2025-09-03",
      "headline": "Centre finalises 25 priority products for indigenous semiconductor IPs: IT MinisterIT and Communications Minister Ashwini Vaishnaw said the semiconductor design ecosystem was growing faster than expected, with more than 28 startups moving from concept to product stage under the design-linked incentive scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/markets-end-in-red-gold-soars-to-all-time-high-and-more-2780856-2025-09-02",
      "headline": "Markets end in red, Gold soars to all-time high and moreSensex and Nifty slipped into the red after early gains dragged by banks and heavyweight counters. Nifty fell below 24,600 marks while Sensex closed at 80,200. Mid-caps as well as the small-cap indices have been outperforming with modest gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-bank-of-india-cut-mclr-what-it-means-for-borrowers-2780837-2025-09-02",
      "headline": "PNB, Bank of India cut MCLR: What it means for borrowersPunjab National Bank has made small reductions across different loan tenures. The overnight rate has come down from 8.15% to 8%. The one-month MCLR has dropped slightly to 8.25%, while the three-month rate has been reduced to 8.45%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-evs-may-get-costlier-as-tax-panel-proposes-steep-gst-hike-report-2780736-2025-09-02",
      "headline": "Luxury EVs may get costlier as tax panel proposes steep GST hike: ReportThe proposal, if approved, would hit global brands such as Tesla, Mercedes-Benz, BMW and BYD the hardest, just as they ramp up their India play."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/elli-avrram-mourns-grandmother-death-pays-tribute-pics-videos-2781178-2025-09-03",
      "headline": "Actor Elli AvrRam pays tribute to her late grandmother, shares pics and videosActor Elli AvrRam mourned the death of her grandmother, sharing an emotional tribute with heartfelt memories on social media. Several industry colleagues extended their condolences as the actor remembered her close bond with her late grandparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/simple-kaul-rahul-loomba-separation-13-years-marriage-2781197-2025-09-03",
      "headline": "Simple Kaul and Rahul Loomba separate after 13 years of marriageSimple Kaul has separated from her husband Rahul Loomba after 13 years of marriage. The Shararat actor confirmed the news to a media portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-box-office-collection-day-6-kalyani-priyadarshan-superhero-film-rs-50-crore-india-2781190-2025-09-03",
      "headline": "Lokah box office Day 6: Kalyani's superhero film eyes Rs 50 crore in IndiaKalyani Priyadarshan and Naslen's 'Lokah Chapter 1: Chandra' is inching closer towards Rs 50 crore-mark in India. The superhero film is showing no signs of slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-janhvi-kapoor-groove-to-reimagined-bijuria-in-sunny-sanskari-ki-tulsi-kumari-2781192-2025-09-03",
      "headline": "Sonu Nigam's Bijuria gets revamp for Varun-Janhvi's Sunny Sanskari Ki Tulsi KumariSonu Nigam's 90s hit 'Bijuria' returns in 'Sunny Sanskari Ki Tulsi Kumari', reimagined by Tanishk Bagchi and voiced by Nigam with Asees Kaur for a new-gen groove."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-advance-booking-update-can-tiger-shroff-take-the-franchise-to-rs-500-crore-2781176-2025-09-03",
      "headline": "Baaghi 4 advance booking: Can Tiger Shroff take the franchise to Rs 500 crore?Tiger Shroff's 'Baaghi 4' opened to slow advance bookings but is aiming high at the box office. The action-packed franchise, which has already grossed Rs 428 crore across three films, is eyeing the Rs 500 crore milestone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jason-kelce-unsure-if-he-will-be-best-man-at-travis-kelce-and-taylor-swift-wedding-2781160-2025-09-03",
      "headline": "Jason Kelce unsure if he'll be best man at Travis-Taylor weddingJason Kelce has admitted he's unsure whether he'll be chosen as best man at his brother Travis Kelce's wedding to Taylor Swift. The duo announced their engagement on August 26.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-confirms-diljit-dosanjh-no-entry-2-exit-anees-bazmee-varun-dhawan-arjun-kapoor-2781155-2025-09-03",
      "headline": "Diljit Dosanjh is not part of No Entry 2, parted in good spirits: Boney KapoorBoney Kapoor confirmed that Diljit Dosanjh is not part of 'No Entry 2'. The producer shared that they parted in good spirits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-shows-off-her-cooking-skills-husband-naga-chaitanya-reacts-2781146-2025-09-03",
      "headline": "Sobhita Dhulipala shows off her cooking skills, husband Naga Chaitanya reactsSobhita Dhulipala playfully showcased her cooking on set, cheekily responding to Naga Chaitanya's \"basic human skills\" jibe. The couple got married in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-visits-guruvayur-temple-amid-kerala-shoot-for-haiwaan-2781122-2025-09-03",
      "headline": "Akshay Kumar wears traditional mundu for Guruvayur temple visit in KeralaAkshay Kumar, shooting in Kerala, visited the famous Guruvayur temple in traditional attire. The actor is in the state shooting for his next film, 'Haiwaan', with Priyadarshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-recalls-being-hounded-after-sridevi-death-slammed-for-smiling-2781111-2025-09-03",
      "headline": "Janhvi Kapoor recalls being hounded after Sridevi's death, slammed for smilingJanhvi Kapoor opened up about the difficult phase of promoting her debut film 'Dhadak' soon after the sudden death of her mother, legendary actor Sridevi. The 'Param Sundari' star recalled how she and sister Khushi Kapoor were \"hounded\" by the media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/marathi-singer-actor-rahul-deshpande-announces-separation-wife-neha-after-17-years-daughter-renuka-2781102-2025-09-03",
      "headline": "Marathi singer Rahul Deshpande announces separation from wife Neha after 17 yearsMarathi singer-actor Rahul Deshpande announced his separation from wife Neha after 17 years of marriage. He shared a statement on social media and spoke about co-parenting their daughter, Renuka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shanaya-kapoor-series-student-of-the-year-2781090-2025-09-03",
      "headline": "Exclusive: Shanaya Kapoor to headline series on Student of The Year'Student of the Year', a popular franchise from Dharma Productions, is set to return as a digital series featuring Shanaya Kapoor. The show will explore themes of friendship, rivalry, ambition and romance with a fresh cast and modern setting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/did-you-know-novak-djokovic-kpop-demon-hunters-fan-2781086-2025-09-03",
      "headline": "Did you know that Novak Djokovic is a KPop Demon Hunters fan?Tennis player Novak Djokovic recently unveiled his love for Netflix's popular animated film KPop Demon Hunters. He shared that he dances to the song 'Soda Pop'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-box-office-sidharth-malhotra-janhvi-kapoor-film-push-earns-rs-34-crore-2781069-2025-09-03",
      "headline": "Param Sundari box office Day 5: Sidharth-Janhvi film gets push, earns Rs 34 croreSidharth Malhotra and Janhvi Kapoor's latest release, Param Sundari, slightly increased its numbers on Tuesday. The film is now inching close to Rs 50 crore at the domestic box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/wink-girl-priya-prakash-varrier-background-actor-param-sundari-malayali-representation-row-2781067-2025-09-03",
      "headline": "Priya Varrier appears as extra in Param Sundari amid Malayali representation rowMalayalam actor Priya Prakash Varrier, popularly known as 'Wink Girl', appeared as a background actor in Janhvi Kapoor and Sidharth Malhotra's 'Param Sundari'. Fans were surprised to see her in the background and said that she should have played Janhvi Kapoor's role, a half-Malayali, half-Tamilian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-kenya-minister-ssmb-29-shoot-film-to-release-120-countries-2781054-2025-09-03",
      "headline": "Rajamouli meets Kenya minister amid SSMB 29 shoot, film to release in 120 countriesSS Rajamouli wrapped up the African schedule of his latest film 'SSMB 29' in Kenya, showcasing iconic African locations. He met Kenyan minister Musalia Mudavadi and other delegates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-slams-online-brands-for-using-her-photos-without-permission-2780892-2025-09-02",
      "headline": "Sonakshi Sinha slams online brands for using her photos without permissionSonakshi Sinha has called out online brands for using her social media photos on their websites without permission or usage rights. She urged companies to act ethically and warned them to take down her images before she names them publicly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-shares-first-photo-of-baby-girl-with-jake-bongiovi-2780893-2025-09-02",
      "headline": "Millie Bobby Brown shares first photo of baby girl with Jake BongioviHollywood actor Millie Bobby Brown, best known as Eleven from 'Stranger Things', is embracing life as a young mum at 21. Here's a glimpse into her family life with husband Jake Bongiovi and their baby girl."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-drastic-weight-loss-leaves-fans-stunned-at-venice-film-festival-2780878-2025-09-02",
      "headline": "Dwayne Johnson's drastic weight loss leaves fans stunned at Venice Film FestivalDwayne 'The Rock' Johnson appeared at the photocall and press conference for his latest film 'The Smashing Machine' where his noticeably leaner physique took many by surprise."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/persecuted-minorities-from-afghanistan-bangladesh-pak-who-came-by-2024-will-be-allowed-to-stay-government-2781231-2025-09-03",
      "headline": "Minorities from Pak, Bangladesh who came by 2024 will be allowed to stay: CentreHindus, Sikhs, Buddhists, Jains, Parsis and Christians from Afghanistan, Pakistan and Bangladesh who entered India on or before December 31, 2024 will be allowed to stay in the country, the government said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meets-today-major-tax-cuts-2-slab-structure-luxury-levy-on-agenda-2781071-2025-09-03",
      "headline": "GST Council meet: Key decisions on tax cuts, 2-slab structure in focusThe Centre's proposal, described as a 'next-gen' GST reform, aims to prune the current four-tier tax structure into just two slabs—5% and 18%. This would mean doing away with the 12% and 28% brackets introduced when GST was launched in July 2017. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-boosts-russian-oil-imports-despite-us-tariffs-steep-discounts-2781167-2025-09-03",
      "headline": "Russia's bigger oil discounts lure India, Trump's tariff gambit backfires: ReportBetween August 27 and September 1 – right after Trump's tariffs came into effect – Indian refiners snapped up 11.4 million barrels of discounted Russian crude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/why-umar-khalid-denied-bail-2020-delhi-riots-case-high-court-prolonged-trial-2781189-2025-09-03",
      "headline": "5 years on, Umar Khalid languishes in jail without bail or trial. Natural pace?2020 Delhi riots case: For Umar Khalid, accused of being the 'key conspirator' in the northeast Delhi riots of 2020 that left 53 people dead, this was the sixth time that he was denied bail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/cracks-beneath-concrete-why-india-urban-planning-fails-against-floods-opinion-2781060-2025-09-03",
      "headline": "Cracks beneath concrete: Why India's urban planning fails against floodsRoads do not collapse in isolation. Nor do drains clog themselves. What we are witnessing—from Gurugram's flooded boulevards to Delhi's crumbling flyovers—is the slow, visible erosion of a planning culture that treats cities as finished products rather than evolving organisms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-accuses-xi-jinping-conspiring-russia-north-korea-beijing-military-parade-2781049-2025-09-03",
      "headline": "As Xi hosts Putin, Kim at Beijing parade, Trump fumes at 'conspiracy against US'US President Trump accused Chinese President Xi Jinping of conspiring with Russia and North Korea as the leaders of the three countries came together for Beijing's largest military parade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-paddy-upton-indian-hockey-virat-kohli-world-cup-olympics-2781037-2025-09-03",
      "headline": "18 Virat Kohlis in one side? Why Indian men's hockey team is built to win bigMental conditioning coach Paddy Upton, in an exclusive chat with India Today, revealed his amazement at the fitness of the Indian men's hockey team, calling them a side that has 18 Virat Kohlis in it. Upton also spoke about his current work with the team and praised Craig Fulton as a coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-e-rickshaw-tirri-tuktuk-versatile-ev-memes-reels-viral-instagram-fb-ambulance-police-wedding-transport-safety-2780991-2025-09-03",
      "headline": "Virus Tirri grows up as ambulance, police van and trainThe humble e-rickshaw, a moving menace, gained prominence after 2010 for last-mile connectivity. Popular as Tirri in west UP, Toto in Bengal and Mayuri in Delhi, the e-rickshaw has morphed into ambulances, police vans and even loading trucks. The caterpillar-to-butterfly story has triggered memories and a meme fest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/wink-girl-priya-prakash-varrier-background-actor-param-sundari-malayali-representation-row-2781067-2025-09-03",
      "headline": "Priya Varrier appears as extra in Param Sundari amid Malayali representation rowMalayalam actor Priya Prakash Varrier, popularly known as 'Wink Girl', appeared as a background actor in Janhvi Kapoor and Sidharth Malhotra's 'Param Sundari'. Fans were surprised to see her in the background and said that she should have played Janhvi Kapoor's role, a half-Malayali, half-Tamilian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/ladakh-rains-floods-monsoon-rainfall-surge-in-ladakh-2781203-2025-09-03",
      "headline": "Why Ladakh saw 930% more rain than normal in August 2025Unprecedented August rains in Ladakh have been due to western disturbances and monsoons, with Leh, the region's capital, itself logged 55 mm of rain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-woman-dies-by-suicide-after-alleged-dowry-harassment-husbands-extramarital-affair-2781151-2025-09-03",
      "headline": "Bengaluru woman, 28, dies by suicide over dowry harassment, husband's affairA 28-year-old Bengaluru woman, Poojashree, died by suicide after alleged dowry harassment and her husband's affair. Police registered a case under dowry harassment, and further investigation is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bengaluru-stampede-rcb-ipl-2025-virat-kohli-mourns-loss-2781150-2025-09-03",
      "headline": "After RCB, Virat Kohli breaks silence on Bengaluru stampede: Your loss is our storyRoyal Challengers Bengaluru faced tragedy during their IPL 2025 victory celebrations. The stampede led to multiple casualties, prompting heartfelt responses and safety plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-us-open-taylor-fritz-daughter-tara-soda-pop-birthday-2781100-2025-09-03",
      "headline": "On daughter's birthday, Djokovic turns US Open quarters win into a dance of loveUS Open 2025: Novak Djokovic celebrated his daughter Tara's eighth birthday with a special dance after beating Taylor Fritz in the quarter-finals. The Serb will face second seed Carlos Alcaraz in a blockbuster semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/photos/photo/apple-koregaon-park-in-pune-first-look-ahead-of-iphone-17-launch-2781213-2025-09-03",
      "headline": "Apple Koregaon Park in Pune first look ahead of iPhone 17 launchApple is all set to open its first-ever store in Pune. Apple Koregaon Park will officially welcome customers on Thursday, September 4, at 1 p.m. IST. This new store will be Apple's fourth retail location in India, joining Mumbai, Delhi, and Bengaluru. It will offer customers a hands-on experience with the latest devices and services across the Apple ecosystem. The opening also comes just ahead of Apple's annual fall event — this year's 'awe-dropping' event — scheduled for September 9, where the company is expected to launch the iPhone 17 series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mainpuri-52-year-old-woman-killed-by-26-year-old-lover-she-met-on-instagram-uttar-pradesh-crime-2781053-2025-09-03",
      "headline": "UP woman, 52, murdered by 26-year-old boyfriend she met on InstagramA 52-year-old woman from Farrukhabad was strangled in Mainpuri, Uttar Pradesh, allegedly by her 26-year-old lover she had met on Instagram. Police said the accused, Arun Rajput, killed her after she pressed him for marriage and repayment of money loaned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-indias-shubhanshu-shukla-shows-how-astronauts-eat-lunch-in-space-2781161-2025-09-03",
      "headline": "India's Shubhanshu Shukla shows how astronauts eat lunch in spaceUnlike on Earth, where gravity keeps food neatly on plates, space dining requires precision and patience. A stray morsel or drop of liquid can float away, potentially contaminating equipment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gen-z-boomers-clash-workplace-flexibility-loyalty-india-2781137-2025-09-03",
      "headline": "Why Gen Z and boomers can't agree on workThe workplace sees a generational clash between Boomers and Gen Z over work styles and expectations. This conflict highlights deeper issues of burnout, loyalty, and the need for flexible work arrangements in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/two-indian-telangana-hyderabad-students-killed-in-uk-car-crash-five-injured-after-ganesh-visarjan-drivers-arrested-2781172-2025-09-03",
      "headline": "Two Indian students killed in UK car crash while returning from Ganesh VisarjanTwo Indian students from Telangana's Hyderabad died and five others were injured in a car crash in Essex, United Kingdom, while returning from Ganesh Visarjan celebrations. Essex Police arrested both student drivers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-calls-us-india-trade-one-sided-relationship-glbs-2781025-2025-09-03",
      "headline": "We get along very well, but...: Trump on US-India ties amid tariff disputeThe US President also claimed that unfair tariff structures were pushing companies to set up production outside America. However, he argued that his administration's trade policies, including the imposition of steep reciprocal tariffs, were beginning to reverse the trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-reddit-user-i-quit-corporate-post-echoes-frustrations-of-city-life-2781132-2025-09-03",
      "headline": "Bengaluru Reddit user's 'I quit corporate' post echoes frustrations of city lifeA Bengaluru Reddit user's viral post announcing their decision to quit corporate life sparked debate online and reflected frustrations over work culture, infrastructure, and the rising cost of living in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/meet-vijay-raji-indian-origin-engineer-from-puducherry-named-new-openai-applications-cto-2781115-2025-09-03",
      "headline": "Meet Vijay Raji, Indian-origin engineer from Puducherry named new OpenAI Applications CTOOpenAI is overhauling its applications arm under new chief Fidji Simo, acquiring Statsig for $1.1bn and appointing founder Vijaye Raji as CTO of Applications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-respect-russia-india-ties-pakistan-pm-sharif-tells-putin-during-meeting-with-putin-glbs-2780858-2025-09-02",
      "headline": "Respect your ties with India, Shehbaz Sharif tells Putin. Then, makes a requestPakistani Prime Minister Shehbaz Sharif met Russian President Vladimir Putin in Beijing and told him that Islamabad respects Moscow's close diplomatic relations with New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-congress-rift-ex-minister-kn-rajanna-camp-attacks-deputy-cm-dk-shivakumar-for-plotting-ouster-2781134-2025-09-03",
      "headline": "Congress rift deepens as ex-minister's camp accuses DK Shivakumar of plotting ousterInternal rifts in Karnataka Congress have widened, with expelled minister KN Rajanna's camp accusing Deputy Chief Minister DK Shivakumar of plotting his ouster, triggering sharp exchanges and warnings of a \"September revolution\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-school-headmaster-dharmapuri-faces-probe-after-video-of-children-pressing-her-legs-goes-viral-2781109-2025-09-03",
      "headline": "Video: Tamil Nadu school headmaster lies on table, students massage her legsA viral video from a primary school in Tamil Nadu's Dharmapuri has sparked outrage, showing children pressing their headmaster's legs in class, prompting officials to launch an inquiry into the incident."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-asia-cup-t20-template-irfan-pathan-interview-2781229-2025-09-03",
      "headline": "Leader Shubman Gill won't struggle with India's new T20 template: Irfan PathanAsia Cup 2025: Shubman Gill is set to open the batting alongside Abhishek Sharma, with Sanju Samson likely to make way for the returning star, who has been appointed vice-captain of the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-reaction-carlos-alcaraz-us-open-semi-final-2781191-2025-09-03",
      "headline": "Novak Djokovic looking to 'mess up Sinner-Alcaraz final plans' in US OpenAfter storming into the semifinals of the US Open 2025, Novak Djokovic has laid bare his plans to 'mess up Jannik Sinner vs Carlos Alcaraz final plans' as he prepares for the clash with the Spaniard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-injury-india-cafa-nations-cup-ruled-out-2781144-2025-09-03",
      "headline": "Blow to India as Sandesh Jhingan ruled out of CAFA Nations Cup due to injuryIndian men's football team captain Sandesh Jhingan has been ruled out of the rest of the CAFA Nations Cup after sustaining an injury during India's 0-3 loss to Iran, the All India Football Federation (AIFF) confirmed on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bengaluru-stampede-rcb-ipl-2025-virat-kohli-mourns-loss-2781150-2025-09-03",
      "headline": "After RCB, Virat Kohli breaks silence on Bengaluru stampede: Your loss is our storyRoyal Challengers Bengaluru faced tragedy during their IPL 2025 victory celebrations. The stampede led to multiple casualties, prompting heartfelt responses and safety plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-reports-big-bash-league-ipl-retirement-2781108-2025-09-03",
      "headline": "Ravichandran Ashwin may join Big Bash League after IPL retirementRavichandran Ashwin is reportedly in talks to join the Big Bash League (BBL), with discussions already underway ahead of the upcoming season of Australia's premier T20 competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-us-open-taylor-fritz-daughter-tara-soda-pop-birthday-2781100-2025-09-03",
      "headline": "On daughter's birthday, Djokovic turns US Open quarters win into a dance of loveUS Open 2025: Novak Djokovic celebrated his daughter Tara's eighth birthday with a special dance after beating Taylor Fritz in the quarter-finals. The Serb will face second seed Carlos Alcaraz in a blockbuster semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-2010-asia-cup-shoaib-akhtar-harbhajan-singh-thrilling-finish-2781061-2025-09-03",
      "headline": "Flashback to 2010: Harbhajan Singh, Shoaib Akhtar's fiery Asia Cup exchangeThe 2010 Asia Cup match between India and Pakistan featured a dramatic final over and heated exchanges between Shoaib Akhtar and Harbhajan Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prasidh-krishna-reaction-joe-root-spat-india-england-test-series-2781043-2025-09-03",
      "headline": "Don't know why Root reacted that way: Prasidh on heated altercation in 5th TestIndia pacer Prasidh Krishna has opened up about his on-field exchange with Joe Root during the fifth Test at the Oval, saying he was unsure why the senior batter reacted so heatedly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-us-open-doubles-exit-update-future-2781039-2025-09-03",
      "headline": "Venus Williams offers update on future after age-defying doubles run endsVenus Williams offered an update on her tennis future after bowing out of the U.S. Open on Tuesday, her campaign alongside Canadian Leylah Fernandez ending with a quarter-final defeat in the women's doubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-paddy-upton-indian-hockey-virat-kohli-world-cup-olympics-2781037-2025-09-03",
      "headline": "18 Virat Kohlis in one side? Why Indian men's hockey team is built to win bigMental conditioning coach Paddy Upton, in an exclusive chat with India Today, revealed his amazement at the fitness of the Indian men's hockey team, calling them a side that has 18 Virat Kohlis in it. Upton also spoke about his current work with the team and praised Craig Fulton as a coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-reach-us-open-semifinals-marketa-vondrousova-injury-withdrawal-2781036-2025-09-03",
      "headline": "Sabalenka reaches semifinals after Vondrousova withdraws due to injuryWorld No. 1 Aryna Sabalenka advanced to the semifinals of the US Open on Tuesday without having to play a point, after her quarterfinal opponent, Marketa Vondrousova, withdrew due to a knee injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-2010-asia-cup-shoaib-akhtar-harbhajan-singh-thrilling-finish-2781061-2025-09-03",
      "headline": "Flashback to 2010: Harbhajan Singh, Shoaib Akhtar's fiery Asia Cup exchangeThe 2010 Asia Cup match between India and Pakistan featured a dramatic final over and heated exchanges between Shoaib Akhtar and Harbhajan Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prasidh-krishna-reaction-joe-root-spat-india-england-test-series-2781043-2025-09-03",
      "headline": "Don't know why Root reacted that way: Prasidh on heated altercation in 5th TestIndia pacer Prasidh Krishna has opened up about his on-field exchange with Joe Root during the fifth Test at the Oval, saying he was unsure why the senior batter reacted so heatedly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-us-open-doubles-exit-update-future-2781039-2025-09-03",
      "headline": "Venus Williams offers update on future after age-defying doubles run endsVenus Williams offered an update on her tennis future after bowing out of the U.S. Open on Tuesday, her campaign alongside Canadian Leylah Fernandez ending with a quarter-final defeat in the women's doubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-paddy-upton-indian-hockey-virat-kohli-world-cup-olympics-2781037-2025-09-03",
      "headline": "18 Virat Kohlis in one side? Why Indian men's hockey team is built to win bigMental conditioning coach Paddy Upton, in an exclusive chat with India Today, revealed his amazement at the fitness of the Indian men's hockey team, calling them a side that has 18 Virat Kohlis in it. Upton also spoke about his current work with the team and praised Craig Fulton as a coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-reach-us-open-semifinals-marketa-vondrousova-injury-withdrawal-2781036-2025-09-03",
      "headline": "Sabalenka reaches semifinals after Vondrousova withdraws due to injuryWorld No. 1 Aryna Sabalenka advanced to the semifinals of the US Open on Tuesday without having to play a point, after her quarterfinal opponent, Marketa Vondrousova, withdrew due to a knee injury."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}