{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/is-ai-really-behind-the-global-tech-selloff-2860769-2026-01-31",
      "headline": "Is AI boom really behind the sudden drop in global tech stocks?As high-priced software firms face tighter competition and slowing growth, is the recent plunge in global tech stocks truly an AI shock or just a correction catching up with fundamentals?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jayant-sinha-india-competition-us-china-skills-productivity-education-gap-budget-2860766-2026-01-31",
      "headline": "India's focus should be on education to compete with US and China: Jayant SinhaJayant Sinha said competing with the United States and China will require a budget that focuses on education, higher productivity and broader technological access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/economic-survey-2025-2026-union-budget-on-freebies-unconditional-cash-transfers-brazil-mexico-schemes-2860324-2026-01-31",
      "headline": "How freebies bled Indian economy. Economic Survey suggests a Brazilian modelThe Economic Survey 2025-26 flags the unchecked rise of freebies provided by the state governments in India. It says they are draining public finances, widening deficits by leaving little money for investments in infrastructure and human capital. It argues that reforms are needed to the freebie culture, and urges policymakers to adopt outcome-linked, time-bound models like Brazil's Bolsa Familia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2026-trade-deficit-grew-under-both-upa-and-nda-pace-slowed-after-2014-2860714-2026-01-31",
      "headline": "Budget 2026: Trade deficit grew under UPA and NDA, pace slowed after 2014India's trade deficit widened under both UPA and NDA, but Economic Survey 2026 data shows the pace slowed after 2014 as import growth moderated, despite weaker export momentum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-arrests-ex-reliance-communication-chief-punit-garg-in-rs-40000-crore-fraud-case-2860594-2026-01-30",
      "headline": "ED arrests ex-Reliance Communication chief Punit Garg in Rs 40,000-crore fraud casePunit Garg served as President handling the company's Global Enterprise Business between 2006 and 2013, and later as President (Regulatory Affairs) from 2014 to 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nse-ipo-finally-approved-after-9-years-heres-all-you-need-to-know-2860570-2026-01-30",
      "headline": "NSE IPO finally approved after 9 years: Here's all you need to knowWith Sebi's clearance in hand, NSE can now formally appoint merchant bankers and legal advisers to prepare its draft red herring prospectus (DRHP). Market estimates suggest the exchange could take around eight to nine months to launch the IPO."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-budget-2026-bring-income-tax-relief-what-salaried-taxpayers-can-expect-2860491-2026-01-30",
      "headline": "Will Budget 2026 bring income tax relief? What salaried taxpayers can expectAhead of Budget 2026, one question dominates conversations among salaried taxpayers: will income tax relief finally come? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-ai-training-to-real-jobs-what-industry-wants-from-budget-2026-2860432-2026-01-30",
      "headline": "From AI skilling to real jobs: What industry wants from Budget 2026India has no shortage of AI talent, but turning skills into sustainable jobs remains a challenge. Ahead of Budget 2026, industry leaders want policies that connect training, infrastructure and real-world deployment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-lower-budget-it-metal-stocks-drag-2860433-2026-01-30",
      "headline": "Sensex, Nifty pause winning rally as investors turn cautious ahead of BudgetThe S&P BSE Sensex closed 296.59 points lower at 82,269.78, while the NSE Nifty50 lost 98.25 points to end at 25,320.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-will-employees-get-arrears-and-if-yes-when-2860343-2026-01-30",
      "headline": "8th Pay Commission: Will employees get arrears, and if yes, when?With January 2026 nearly over and no formal announcement yet, government employees are growing anxious about the 8th Pay Commission. The big question now is whether delayed salary revisions will lead to arrears, and when the money may actually reach their bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-building-indias-next-generation-supply-chains-2860315-2026-01-30",
      "headline": "Budget 2026: Building India's next-generation supply chainsContinued public investment in infrastructure remains the single most important driver of logistics efficiency. Budget 2026 presents an opportunity to further strengthen this momentum by deepening last-mile connectivity to industrial clusters, agri-production zones, and Tier 2 and Tier 3 cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-price-rate-today-india-good-time-to-buy-or-wait-explained-2860306-2026-01-30",
      "headline": "Silver prices slide after hitting record highs. Is it the right time to buy?Silver has finally cooled after a record-breaking rally. With prices stabilising and demand still strong, the real question is simple: will you use this dip to start buying?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-etfs-tumble-after-record-highs-buy-the-dip-or-stay-cautious-2860276-2026-01-30",
      "headline": "Gold, silver ETFs tumble after record highs: Buy the dip or stay cautious?After a strong rally that pushed gold and silver to record levels, ETFs tracking the precious metals saw a steep fall on January 30. The sharp correction has sparked fresh questions about whether the dip is worth buying or if volatility may deepen further."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-exporters-need-a-boost-trump-tariff-shock-explained-2860272-2026-01-30",
      "headline": "Budget 2026 should be an exporter's budget. Here's whyFrom tariff pressure to compliance hurdles, exporters are under strain. Budget 2026 needs to focus on easing these burdens so Indian businesses can protect market share and grow confidently this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hindustan-copper-vedanta-hindalco-metal-stocks-fall-nifty-metal-today-why-reasons-gold-silver-2860255-2026-01-30",
      "headline": "Hindustan Copper, Vedanta, Hindalco fall up to 10%: Why are metal stocks down?The Nifty Metal index slipped close to 5% to 11,855.85, ending its three-day winning run during which it had gained nearly 9%. On Friday, the metal index emerged as the worst-performing sector on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-what-the-agriculture-farm-sector-wants-from-the-government-2860226-2026-01-30",
      "headline": "Budget 2026: What the agriculture sector wants from the governmentIndustry leaders say this budget needs to prioritise technology, climate resilience, credit flow, value-added production and better supply-chain systems to unlock the sector's full potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-fall-buy-now-wait-explained-2860204-2026-01-30",
      "headline": "Gold, silver prices fall: Should you buy now or wait?If the sudden drop in gold and silver prices has caught your eye, it's worth knowing what's driving the mood right now."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-dalal-street-stock-market-sensex-nifty-down-2860199-2026-01-30",
      "headline": "Budget 2026 jitters on Dalal Street: Why stock market is under pressureMost global markets have been under pressure this week, especially technology-heavy indices, and the impact has spilled over into emerging markets like India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-news-live-updates-fm-nirmala-sitharaman-income-tax-defence-agriculture-auto-expectations-2860186-2026-01-30",
      "headline": "Budget 2026: What the insurance sector expect from Nirmala SitharamanBudget 2026: A day ahead of the Union Budget, Finance Minister Nirmala Sitharaman tabled the Economic Survey 2025–26 in Parliament, outlining the government's assessment of the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-hits-all-time-low-should-people-worry-what-cea-expert-and-markets-say-2860178-2026-01-30",
      "headline": "Rupee hits lifetime low of Rs 92 against US dollar: Should you be worried?The rupee's weakness comes at a time when global uncertainty remains high and foreign capital flows into emerging markets have slowed"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ananya-panday-lakshya-lead-karan-johar-chand-mera-dil-check-release-date-2860787-2026-01-31",
      "headline": "Ananya Panday-Lakshya lead Karan Johar's Chand Mera Dil. Check release date Karan Johar is backing a new film titled Chand Mera Dil, featuring Ananya Panday and Lakshya in lead roles. The film will be Ananya's second release after Tu Meri Main Tera Main Tera Tu Meri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thanks-but-no-thanks-sunny-deol-border-2-does-not-do-justice-to-the-armed-forces-2860548-2026-01-31",
      "headline": "Thanks, but no thanks, Sunny Deol: Border 2 has a serious problem My father served in the Army, so I will always have a soft corner for Border. Sadly, Border 2 disappointed me. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homi-adajania-wraps-cocktail-2-with-shahid-kriti-and-rashmika-feels-special-2860767-2026-01-31",
      "headline": "Homi Adajania wraps Cocktail 2 with Shahid, Kriti and Rashmika: Feels special Shahid Kapoor, Rashmika Mandanna and Kriti Sanon wrapped up the shooting of Cocktail 2. The actors celebrated with director Homi Adajania after the shoot concluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-sunny-deol-film-crosses-rs-233-crore-on-day-8-despite-a-dip-in-earnings-2860759-2026-01-31",
      "headline": "Border 2 box office Day 8: Sunny Deol's film enters 2nd weekend, faces Mardaani 3 Sunny Deol's Border 2 witnessed a further dip on its eighth day of release. The film has so far earned Rs 257.50 crore at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-saurabh-shukla-thinks-strict-8-hour-shifts-dont-work-exclusive-2858335-2026-01-31",
      "headline": "Why Saurabh Shukla thinks strict 8-hour shifts don't work. Exclusive Veteran actor Saurabh Shukla addressed the demand for eight-hour work shifts in the Hindi film industry. In an exclusive interview, he also reacted to AR Rahman's remarks on the lack of work in Hindi cinema and spoke about why he has stepped away from directing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mardaani-3-box-office-day-1-rani-mukerji-cop-thriller-opens-at-rs-348-crore-2860744-2026-01-31",
      "headline": "Mardaani 3 box office day 1: Rani Mukerji's cop thriller opens at Rs 3.48 crore Rani Mukerji's thriller, Mardaani 3 collected Rs 3.48 crore on its opening day. In-spite of Rani's return as the fierce cop, Shivani Shivaji Roy, the film earned less than its prequel Mardaani 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-sunny-deol-varun-dhawan-old-school-emotion-meets-new-age-audience-gen-z-2860353-2026-01-31",
      "headline": "Border 2: What happens when old-school emotion meets new-age audience 'Border' is truly Bollywood's Gen Z war drama. The first film opened in 1997, the year that marked Gen Z start, and 29 years later we have 'Border 2'. In Cinematic Saturday, we look at the original's legacy that continues to be debated, even as 'Border 2' manages what few sequels can – bring three generations under one roof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/schitts-creek-actor-catherine-ohara-dies-at-71-2860709-2026-01-31",
      "headline": "Schitt's Creek and The Last of Us actor Catherine O'Hara dies at 71 Emmy-winning actor Catherine O'Hara, a towering presence in film and television comedy, died at 71. Her career spanned SCTV, Home Alone, The Last of Us and Schitt's Creek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/margot-robbie-on-steamy-scenes-in-wuthering-heights-2860697-2026-01-30",
      "headline": "No special preparation: Margot Robbie on steamy scenes in Wuthering Heights Margot Robbie has addressed the buzz around the steamy scenes in Wuthering Heights, saying they required no special preparation and were treated like any other part of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-on-wanting-to-quit-social-media-after-motherhood-2860668-2026-01-30",
      "headline": "Life is so personal: Alia Bhatt on wanting to quit social media after motherhood Alia Bhatt shared that there are days she feels like deleting social media and simply being an actor. She also spoke about how motherhood has made her personal life more private and deeply transformative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-bhardwaj-on-arijit-singh-stepping-away-from-playback-singing-2860643-2026-01-30",
      "headline": "This is unfair… Take back your Sanyaas: Vishal Bhardwaj's appeal to Arijit Singh Vishal Bhardwaj shared an emotional video singing a song recorded by Arijit Singh, reacting to the singer's decision to step away from playback singing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-calls-rani-mukerji-feisty-and-strong-as-mardaani-3-hits-theatres-2860629-2026-01-30",
      "headline": "SRK to Rani Mukerji: Just from the heart… to my Rani 'Mardaani' all my best wishes Mardaani 3 released in theatres today with Rani Mukerji returning as cop Shivani Shivaji Roy. Ahead of the release, Shah Rukh Khan wished the actor and praised her performance in a heartfelt message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalpana-iyer-recreates-iconic-ramba-ho-ho-ho-at-family-wedding-video-goes-viral-2860575-2026-01-30",
      "headline": "Kalpana Iyer recreates iconic Ramba Ho Ho Ho at family wedding, video goes viral Kalpana Iyer recreated her iconic Ramba Ho Ho Ho dance at a family wedding, sending fans into a wave of nostalgia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mayasabha-review-jaaved-jafferi-anchors-a-tale-of-illusion-and-deception-2860536-2026-01-30",
      "headline": "Mayasabha review: Jaaved Jafferi anchors a tale of illusion and deceptionRelease Date:Thu Jan 30, 2025 Mayasabha: The Hall of Illusion comes from Rahi Anil Barve, the acclaimed director of Tumbbad, and stars Jaaved Jafferi as a fallen producer trapped by obsession. The film released in theatres on January 30 and also features Mohammad Samad, Veena Jamkar and Deepak Damle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-dhurandhar-is-shorter-on-netflix-than-in-theatres-2860506-2026-01-30",
      "headline": "Why Dhurandhar is shorter on Netflix than in theatres: Explained The Netflix version of Dhurandhar is slightly shorter than the theatrical release due to producer-led edits. Streaming platforms only distribute the version provided to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/poonam-jhawer-mohra-actor-comeback-bollywood-2860431-2026-01-30",
      "headline": "Remember Mohra actor Poonam Jhawer? Here's what she is doing now After her unforgettable Na Kajre Ki Dhaar appearance in Mohra, Poonam Jhawer was seen in films like Oh My God! and R...Rajkumar. In an exclusive chat with us, the actor opened up about her journey and the highs and lows of Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-wrecking-crew-jason-momoa-and-dave-bautistas-film-is-pure-action-chaos-2860441-2026-01-30",
      "headline": "The Wrecking Crew: Jason Momoa and Dave Bautista's film is pure action chaos Jason Momoa and Dave Bautista headline a loud, chaotic throwback action film that prioritises fun over logic. Read to find out if The Wrecking Crew is worth a watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/medha-rana-talks-about-working-with-varun-dhawan-on-border-2-2860479-2026-01-30",
      "headline": "Medha Rana talks about working with Varun Dhawan on Border 2: Sweet and supportive As Border 2 continues its steady box office run, actor Medha Rana opened up about her emotional casting journey and her experience working with Varun Dhawan."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-europe-free-trade-deal-impact-pakistan-jittery-2860786-2026-01-31",
      "headline": "Why India-EU trade deal is mother of all setbacks for PakistanThe India-EU free trade agreement (FTA), years in the making, will give India broad market access to those sectors that have long fostered Pakistan's export success in Europe, especially textiles and apparel. Pakistan now seems to be feeling the heat and is in panic mode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharad-pawar-uncertain-sunetra-pawar-maharashtra-deputy-cm-oath-taking-ajit-pawar-plane-crash-death-ncp-2860762-2026-01-31",
      "headline": "Sharad Pawar breaks silence on Sunetra Pawar's oath-taking as Deputy CMSharad Pawar said that Sunetra Pawar's appointment was a decision made by her party, the Nationalist Congress Party, and that he was not consulted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-compromised-by-israel-fbi-report-epstein-files-jared-kushner-us-president-2860756-2026-01-31",
      "headline": "Trump compromised by Israel: Epstein files drop fresh bombshellAn FBI report citing a 'credible' confidential source claims that United States President Donald Trump's son-in-law, Jared Kushner, effectively ran key operations of his organisation and presidency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/economic-survey-2025-2026-union-budget-on-freebies-unconditional-cash-transfers-brazil-mexico-schemes-2860324-2026-01-31",
      "headline": "How freebies bled Indian economy. Economic Survey suggests a Brazilian modelThe Economic Survey 2025-26 flags the unchecked rise of freebies provided by the state governments in India. It says they are draining public finances, widening deficits by leaving little money for investments in infrastructure and human capital. It argues that reforms are needed to the freebie culture, and urges policymakers to adopt outcome-linked, time-bound models like Brazil's Bolsa Familia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thanks-but-no-thanks-sunny-deol-border-2-does-not-do-justice-to-the-armed-forces-2860548-2026-01-31",
      "headline": "Thanks, but no thanks, Sunny Deol: Border 2 has a serious problemMy father served in the Army, so I will always have a soft corner for Border. Sadly, Border 2 disappointed me. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-blast-car-explosion-red-fort-white-collar-terror-module-doctors-plan-attack-jewish-coffee-chain-2860806-2026-01-31",
      "headline": "Delhi blast probe: Doctor's module had planned attacks on global coffee chainOfficials said that the Red Fort blast module was planning to target a global coffee chain, with Umar-un-Nabi pushing high-visibility strikes in Delhi and other cities to amplify the impact of the attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/confident-group-chief-cj-roy-suicide-brother-seeks-answers-from-income-tax-officials-2860785-2026-01-31",
      "headline": "Tax officials need to answer: Brother of Bengaluru tycoon who shot himself deadCJ Roy, Confident Group chairman, shot himself dead amid ongoing Income Tax raids at his Bengaluru office over an alleged asset discrepancy case. His elder brother has sought answers from I-T officials, saying Roy faced intense pressure despite no financial issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sunetra-pawar-oath-ceremony-live-updates-maharashtra-deputy-cm-ncp-meeting-ajit-pawar-death-sharad-pawar-merger-mahayuti-2860778-2026-01-31",
      "headline": "Live: Ajit Pawar's son meets Sharad Pawar ahead of Sunetra Pawar's oath todayMaharashtra Deputy CM Oath Ceremony Live Updates: Maharashtra politics appears to be at a critical juncture following the sudden death of senior NCP leader Ajit Pawar in a plane crash. While sources said that Ajit Pawar's wife, Sunetra Pawar, is expected to be sworn in as Maharashtra's new Deputy Chief Minister on Saturday evening, NCP chief Sharad Pawar told the media that neither he nor his family were aware of the development, adding that the decision would have been taken by his nephew's party. Meanwhile, talks of a reunion between the two NCP factions have gained momentum, with Sharad Pawar saying discussions between Jayant Patil and Ajit Pawar had been ongoing for four months. CM Devendra Fadnavis said the Mahayuti alliance will back the NCP's decision. Stay tuned to inditatoday.in to get all the latest updates on the Maharashtra politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-rise-and-rifts-justice-partys-power-plays-and-pitfalls-part-19-344-31-01-2026",
      "headline": "Time, Tide & Tamil Part 19 | Rise & Rifts: Justice Party's Power Plays & PitfallsWhile the North unified under Gandhi's call for Non-Cooperation, the Justice Party saw an opening in Madras. They boycotted the boycott, choosing to align with colonial levers rather than revolutionary lanterns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australia-open-novak-djokovic-vs-jannik-sinner-carlos-alcaraz-vs-zverev-9-hours-5-set-semi-finals-marathon-2860765-2026-01-31",
      "headline": "Game, set, marathons: Djokovic, Alcaraz power an epic 9-hour Australian Open bingeMelbourne Park was treated to a Friday for the ages as Novak Djokovic and Carlos Alcaraz delivered more than nine and a half hours of engrossing drama in the Australian Open semifinals. Djokovic outlasted Jannik Sinner to flaunt his seemingly bottomless reserves, while Alcaraz staged a remarkable comeback to shatter Alexander Zverev's title hopes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-woman-alleges-frightening-harassment-on-back-to-back-uber-rides-2860768-2026-01-31",
      "headline": "Delhi woman alleges frightening harassment on back-to-back uber ridesA Delhi woman shared a disturbing experience of two back-to-back unsafe Uber rides that left her shaken, and raised serious questions about driver background checks and women's safety in ride-hailing services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-government-enters-partial-shutdown-as-congress-fails-to-approve-2026-budget-by-midnight-deadline-2860782-2026-01-31",
      "headline": "US government enters partial shutdown as Congress fails to approve 2026 budgetUS lawmakers suggested the shutdown may be short-lived, with the House expected to approve a Senate-backed funding deal early next week. However, Democratic senators are withholding support for the measure that would extend DHS funding in the wake of the deaths of two US citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-sunny-deol-varun-dhawan-old-school-emotion-meets-new-age-audience-gen-z-2860353-2026-01-31",
      "headline": "Border 2: What happens when old-school emotion meets new-age audience'Border' is truly Bollywood's Gen Z war drama. The first film opened in 1997, the year that marked Gen Z start, and 29 years later we have 'Border 2'. In Cinematic Saturday, we look at the original's legacy that continues to be debated, even as 'Border 2' manages what few sequels can – bring three generations under one roof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/has-the-supreme-court-become-indias-second-classroom-ugc-regulations-ugc-equity-norms-nta-neet-2860794-2026-01-31",
      "headline": "Has the Supreme Court become India's second classroom?Handcrafted ByOur Editors Bold education reforms promise equity and autonomy, but many never make it past courtrooms. From NEP pushback to UGC regulations under judicial stay, litigation has become routine. Is India announcing reforms faster than it is building consensus?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/epstein-claimed-bill-gates-had-sex-with-russian-girls-files-show-gates-calls-claims-false-2860716-2026-01-31",
      "headline": "Bill Gates caught STD after sex with Russian girls, latest Epstein files claimNew Epstein files allege Bill Gates contracted an STD from Russian women and sought antibiotics; Gates denies the unverified claims, saying documents show Epstein's frustration and attempts to defame him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-juggernaut-invincible-title-defence-suryakumar-yadav-abhishek-sharma-2860779-2026-01-31",
      "headline": "An unbeaten juggernaut, invincible India stand ready to defend T20 World CupT20 cricket thrives on unpredictability, yet India have dominated the format since August 2023. The defending champions have won 49 of their 63 matches, losing just three, and remain unbeaten across bilateral series and multi-nation events. No team has won the men's T20 World Cup at home or defended the title, but this Indian side has the form and balance to challenge history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/i-took-over-10-flights-with-my-one-year-old-this-is-what-i-learnt-2860265-2026-01-31",
      "headline": "I took over 10 flights with my one-year-old. This is what I learntTaking a flight with your child will never be completely stress-free, but preparing well always helps, and keeping a positive attitude never hurts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-566-30-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/europa-jupiter-ammonia-compounds-europa-jupiter-moon-nasa-galileo-discovery-nasa-news-science-news-space-news-2860614-2026-01-31",
      "headline": "Nasa makes big discovery sparking hopes of alien lifeNasa's old Galileo data reveals ammonia-bearing compounds on Europa's icy surface near fractured zones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/arijit-singh-didnt-quit-playback-singing-he-walked-away-from-a-broken-system-2859947-2026-01-30",
      "headline": "Arijit Singh didn't quit playback singing, he walked away from a broken systemArijit Singh's decision to step away from playback singing can be looked at as resistance, not retirement. By rejecting a broken, compliance-driven system, the singer seems to have chosen autonomy over industry approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-saurabh-shukla-thinks-strict-8-hour-shifts-dont-work-exclusive-2858335-2026-01-31",
      "headline": "Why Saurabh Shukla thinks strict 8-hour shifts don't work. ExclusiveVeteran actor Saurabh Shukla addressed the demand for eight-hour work shifts in the Hindi film industry. In an exclusive interview, he also reacted to AR Rahman's remarks on the lack of work in Hindi cinema and spoke about why he has stepped away from directing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-as-dharmic-imperium-bridging-china-mughal-order-america-kissingerian-dynamism-new-world-order-2860757-2026-01-31",
      "headline": "Tribute, conversion, conversation: Analysing geopolitics as a three-body problemShift the lens from 1648 to 324 BCE and a new geometry of power appears: China as a Mughal-like empire of order and hierarchy, America as a restless nomad wielding freedom with zeal and cunning, and India as the Mauryan heir, balancing both through a dharmic cosmopolis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/healthiest-way-to-eat-sweet-potato-boiled-vs-roasted-explained-2859880-2026-01-30",
      "headline": "Healthiest way to eat sweet potato: Boiled vs roasted explainedSweet potato is tasty and nutritious, but how you cook it affects its health value. Boiling may help control blood sugar and digestion, while roasting enhances flavour. Here's the best way to eat it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-5th-t20i-preview-thiruvananthapuram-sanju-samson-team-news-conditions-2860726-2026-01-31",
      "headline": "5th T20I preview: Sanju Samson comes home with everything to proveIND vs NZ, 5th T20I Preview: With the T20 World Cup just days away, India's series finale against New Zealand is more than a formality. In Thiruvananthapuram, hometown hero Sanju Samson faces a vital test of form beneath the gaze of an expectant Greenfield crowd."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-australia-squad-pat-cummins-ruled-out-injury-2860805-2026-01-31",
      "headline": "T20 World Cup: Pat Cummins ruled out, no Steve Smith in Australia's squad T20 World Cup: Australia have suffered a major setback going into the T20 World Cup captain. Senior fast bowler Pat Cummins has been ruled out of the tournament due to a back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-women-singles-final-live-updates-aryna-sabalenka-vs-elena-rybakina-2860802-2026-01-31",
      "headline": "AUS Open Final Live: Aryna Sabalenka takes on Elena Rybakina Australian Open Live updates, Women's Singles final: It's a 2023 Australian Open final rematch in 2026 as Aryna Sabalenka faces Elena Rybakina at Rod Laver Arena. Sabalenka chases a third AO crown, while Rybakina eyes her second Grand Slam title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-harry-brook-wellington-uturn-nightclub-statement-admits-lying-2860795-2026-01-31",
      "headline": "Harry Brook makes U-turn on England nightclub row: Admits lying to protect teammates Harry Brook admitted he lied about the Wellington nightclub incident to protect teammates. The U-turn comes amid wider scrutiny of England's off-field conduct following a bruising Ashes tour and disciplinary investigations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-juggernaut-invincible-title-defence-suryakumar-yadav-abhishek-sharma-2860779-2026-01-31",
      "headline": "An unbeaten juggernaut, invincible India stand ready to defend T20 World Cup T20 cricket thrives on unpredictability, yet India have dominated the format since August 2023. The defending champions have won 49 of their 63 matches, losing just three, and remain unbeaten across bilateral series and multi-nation events. No team has won the men's T20 World Cup at home or defended the title, but this Indian side has the form and balance to challenge history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-india-vs-pakistan-sachin-tendulkar-2860772-2026-01-31",
      "headline": "U19 stars get pep talk from Sachin ahead of World Cup match against Pakistan U19 World Cup: Ahead of India's Super 6 match against Pakistan, the Indian Cricket Board arranged a legendary pep talk session for the U19 team. Sachin Tendulkar spoke to the Indian kids ahead of their crucial fixture in the World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australia-open-novak-djokovic-vs-jannik-sinner-carlos-alcaraz-vs-zverev-9-hours-5-set-semi-finals-marathon-2860765-2026-01-31",
      "headline": "Game, set, marathons: Djokovic, Alcaraz power an epic 9-hour Australian Open binge Melbourne Park was treated to a Friday for the ages as Novak Djokovic and Carlos Alcaraz delivered more than nine and a half hours of engrossing drama in the Australian Open semifinals. Djokovic outlasted Jannik Sinner to flaunt his seemingly bottomless reserves, while Alcaraz staged a remarkable comeback to shatter Alexander Zverev's title hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-suryakumar-yadav-captain-shadow-of-rohit-sharma-deserves-credit-t20-world-cup-2860760-2026-01-31",
      "headline": "Captain Suryakumar Yadav has the shadow of Rohit Sharma, deserves credit: Irfan Pathan Irfan Pathan believes Suryakumar Yadav's captaincy impact is being overlooked despite India's dominant T20I run. With the World Cup nearing, India's skipper enters the final New Zealand game carrying results, momentum and belief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-aryna-sabalenka-vs-elena-rybakina-womens-final-preview-live-streaming-where-to-watch-2860750-2026-01-31",
      "headline": "Glory vs Revenge: Aryna Sabalenka faces Elena Rybakina in Melbourne showdown Australian Open: World No.1 Aryna Sabalenka and and 2022 Wimbledon champion Elena Rybakina are set to clash on Saturday in a thrilling rematch of the 2023 final at Melbourne Park, where Sabalenka came back from a set down to claim her maiden Grand Slam title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-novak-djokovic-vs-jannik-sinner-experts-retirement-motivation-final-vs-alcaraz-2860743-2026-01-31",
      "headline": "Many experts wanted me to retire, thanks to them for motivation: Novak Djokovic Novak Djokovic hit back at retirement talk after beating Jannik Sinner in an epic Australian Open semi-final. The win sends the 38-year-old into a blockbuster final against Carlos Alcaraz in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-mikel-arteta-pep-guardiola-federer-nadal-relationship-comparison-2860735-2026-01-31",
      "headline": "Arsenal boss Mikel Arteta compares relationship with Pep Guardiola to Federer-Nadal Mikel Arteta likened his relationship with Pep Guardiola to the Federer-Nadal rivalry during the Premier League title race. Arsenal lead City by four points as Arteta insists respect survives fierce competition at the summit still."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-5th-t20i-preview-thiruvananthapuram-sanju-samson-team-news-conditions-2860726-2026-01-31",
      "headline": "5th T20I preview: Sanju Samson comes home with everything to prove IND vs NZ, 5th T20I Preview: With the T20 World Cup just days away, India's series finale against New Zealand is more than a formality. In Thiruvananthapuram, hometown hero Sanju Samson faces a vital test of form beneath the gaze of an expectant Greenfield crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bruno-fernandes-manchester-united-future-domink-szoboszlai-liverpool-premier-league-weekly-2860690-2026-01-30",
      "headline": "The Premier League Weekly: Bruno Fernandes weighs his future, Szoboszlai in demand?From contract talks and transfer plans to managerial decisions and survival fights, this week's Premier League column breaks down the key stories shaping clubs as the season heads into a decisive phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-gujarat-giants-maiden-win-vs-mumbai-indians-eliminator-qualification-2860685-2026-01-30",
      "headline": "All-round Wareham helps Gujarat end Mumbai hoodoo, march into EliminatorGujarat Giants secured their first-ever victory over Mumbai Indians Women in Women's Premier League history to end their eight-match losing streak against the defending champions and booked their place in the Eliminator fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-carlos-alcaraz-medical-time-out-alexander-zverev-outburst-rules-2860673-2026-01-30",
      "headline": "Zverev's outburst over Carlos Alcaraz's medical timeout: But what do the rules say?Alexander Zverev raised a big issue over Carlos Alcaraz taking a medical time-out in the third set of the semifinal at the Australian Open. But, when it comes to treating cramps on court, the ATP and other Tennis organisations have clear-cut rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-5th-t20i-predicted-xi-axar-patel-ishan-kishan-hardik-pandya-2860658-2026-01-30",
      "headline": "5th T20I predicted XI: Axar, Kishan in line to play, Hardik to be restedIndia look to end T20 series on a high in Thiruvananthapuram after losing the fourth T20I. The team management may be tempted to make a few changes with this being the last game ahead of T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-semifinal-novak-djokovic-proves-beating-jannik-sinner-never-impossible-overcomes-demons-2860648-2026-01-30",
      "headline": "Djokovic proves difficult was never impossible, overcomes his demons a.k.a SinnerAustralian Open 2026 semifinal: Written off by many, Novak Djokovic dug deep to defeat Jannik Sinner in a gripping Melbourne semifinal, turning doubt into belief in one of the Australian Open's great epics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-5th-t20i-sanju-samson-thiruvananthapuram-homecoming-2860642-2026-01-30",
      "headline": "Spotlight, spin, scrutiny: Sanju Samson rehearses for Trivandrum homecoming India vs New Zealand, 5th T20I: Sanju Samson's return to the opening slot has yet to click, but in his hometown, on the eve of India's final T20I before the World Cup, the Kerala star fine-tuned his game in the nets. Ishan Kishan and captain Suryakumar Yadav also trained hard under lights on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-alexander-zverev-criticises-medical-timeout-carlos-alcaraz-2860592-2026-01-30",
      "headline": "Australian Open: Zverev criticises Alcaraz's medical time-out after semi-final lossAlexander Zverev criticised officials for allowing Carlos Alcaraz a medical time-out during their Australian Open semi-final. Alcaraz completed a dramatic 6-4, 7-6(5), 6-7(3), 6-7(4), 7-5 victory in five hours and 27 minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-novak-djokovic-beats-jannik-sinner-set-up-final-vs-alcaraz-2860613-2026-01-30",
      "headline": "Ageless Djokovic does the unthinkable, outlasts Sinner to keep No. 25 dream aliveNovak Djokovic refused to bow to time, form or expectation on Friday night, delivering one of the most stirring wins of his career by defeating defending champion Jannik Sinner to reach an 11th Australian Open final and keep his dream of a record-breaking 25th Grand Slam title alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sitanshu-kotak-on-sanju-samson-5th-t20i-t20-world-cup-2026-2860517-2026-01-30",
      "headline": "Sanju is Sanju, nothing to worry about him: Batting coach backs struggling India starIndia batting coach Sitanshu Kotak supports Sanju Samson despite his recent poor form in the ongoing New Zealand T20I series. Samson faces pressure to improve quickly ahead of the T20 World Cup 2026 with stiff competition for places."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-backed-pro10-malaysia-tournament-to-be-rescheduled-2860475-2026-01-30",
      "headline": "Ravi Shastri-backed Pro10 Malaysia tournament to be rescheduledThe Pro10 Malaysia cricket tournament has been postponed until after the ICC Men's T20 World Cup in India and Sri Lanka, with the organisers citing logistical challenges as the reason for the rescheduling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-men-t20-world-cup-2026-match-officials-announced-nitin-menon-javagal-srinath-2860462-2026-01-30",
      "headline": "ICC unveil officials for T20 World Cup, Nitin Menon, Javagal Srinath only IndiansThe ICC has appointed 24 umpires and 6 match referees for the 2026 Men's T20 World Cup group stage. Key officials like Dharmasena and Tucker are set to reach significant milestones during the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-matt-henry-press-conference-5th-t20i-trivandrum-2860457-2026-01-30",
      "headline": "Lessons, not losses: Matt Henry says tough India tour has hardened New ZealandMatt Henry says New Zealand's bruising India tour delivered vital lessons, not damage, as a young bowling attack grew under pressure and gained confidence ahead of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/philip-salt-on-india-t20-world-cup-2026-contenders-abhishek-sharma-2860414-2026-01-30",
      "headline": "India strongest team in T20 World Cup, need luck to beat them: Phil SaltEngland batter Philip Salt acknowledges India as the strongest team ahead of T20 World Cup 2026. He praised India's dominating run and praised Abhishek Sharma's batting prowess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-venue-pakistan-boycott-bangladesh-vs-india-2860396-2026-01-30",
      "headline": "T20 World Cup: Why Pakistan will tuck its tail and travel to Sri LankaPakistan have reportedly threatened to pull out of the T20 World Cup to show solidarity with Bangladesh. But it is highly unlikely that they will ever stick to that. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/paul-stirling-most-capped-mens-t20i-player-rohit-sharma-2860391-2026-01-30",
      "headline": "Ireland's Stirling breaks Rohit's record to become man with most T20I appearancesIreland captain Paul Stirling became the most capped player in men's T20I history on January 29, surpassing former India skipper Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-australian-open-semifinal-alexander-zverev-2860264-2026-01-30",
      "headline": "Astounding Alcaraz downs spirited Zverev in marathon, a win away from Career SlamAustralian Open: Carlos Alcaraz has stormed into the men's singles final after beating Alexander Zverev in a semi-final that lasted five hours and 27 minutes at the Rod Laver Arena. In the final, Alcaraz will face the winner of the clash between Jannik Sinner and 24-time Grand Slam champion Novak Djokovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jensi-kanabar-first-indian-female-wins-australian-open-u14-title-2860296-2026-01-30",
      "headline": "Who is Jensi Kanabar? India U14 star scripts history with Australian Open titleJensi Kanabar won the Australian Open Asia-Pacific U14 title after beating Australia's Musemma Cilek 3-6, 6-4, 6-1 in the final. She became the second Indian after Arnav Paparkar to lift the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ducks-in-cricket-there-are-ten-different-species-do-you-know-them-all-2860289-2026-01-30",
      "headline": "Ducks in cricket: There are ten different 'species'. Do you know them all?Abhishek Sharma has now been dismissed for a duck three times in T20Is for India. The sport, however, recognises ten different types of ducks, defined by how and when a batter is dismissed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hockey-india-pro-league-manpreet-singh-dropped-controversy-2860247-2026-01-30",
      "headline": "Manpreet Singh, 2 others dropped from team due to disciplinary issues: ReportHockey India has excluded veteran Manpreet Singh and two others from the Pro League probables. Sources suggest that this was done due to disciplinary issues during the tour of South Africa."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}