{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-revives-us-investment-plans-amid-ongoing-bribery-case-2687686-2025-03-02",
      "headline": "Adani Group revives US investment plans amid ongoing bribery case: ReportFor now, Adani Group's US footprint remains minimal. Past talks with American companies about petrochemical projects in Texas never led to major deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-fema-violation-notice-company-filing-financial-watchdog-nearbuy-india-little-internet-2687569-2025-03-01",
      "headline": "Paytm clarifies FEMA allegations on acquired subsidiaries. Details hereThe company is seeking legal advice and will take necessary steps to resolve the matter through appropriate regulatory processes in line with applicable laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grubhub-lays-off-500-employees-us-food-delivery-app-merger-with-rival-wonder-2687557-2025-03-01",
      "headline": "US food delivery firm Grubhub lays off 500 employees. Here's whyGrubhub is laying off as many as 500 employees, over 20 per cent of its workforce, following its acquisition by Wonder. The layoffs, spanning all departments, aim to streamline operations as the company integrates with its new parent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tuhin-kanta-pandey-sebi-chaiman-2687522-2025-03-01",
      "headline": "Tuhin Kanta Pandey assumes charge as 11th Sebi chairmanTuhin Kanta Pandey took charge as the 11th Sebi chairman, succeeding Madhabi Puri Buch, who completed her tenure. A former Finance Secretary, Pandey has been appointed for three years.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-remain-fastest-growing-economy-with-65-growth-in-fy26-imf-2687521-2025-03-01",
      "headline": "India to remain fastest growing major economy with 6.5% growth in FY26: IMFIndia's strong economic performance, the IMF said, provides an opportunity for the country to advance critical and challenging structural reforms to realise the ambition of becoming an advanced economy by 2047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-sensex-nifty-crash-what-next-5-things-investors-should-know-2687396-2025-03-01",
      "headline": "From record highs to a five-month slide: Where are Sensex, Nifty headed?From record highs to relentless losses, Dalal Street's dream run has turned into a nightmare in just a few months. Is there any relief in sight for investors or is there more pain ahead? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-stock-market-crash-i-have-no-idea-where-the-markets-go-from-here-2687118-2025-03-01",
      "headline": "Zerodha's Nithin Kamath flags sharp drop in trading activity amid market crashThe stock market fell sharply on Friday, with the Sensex dropping 1,414 points and the Nifty slipping below 22,150. The heavy selling wiped out nearly Rs 9 lakh crore in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/citigroup-employees-typo-nearly-led-to-81-trillion-blunder-details-here-2687054-2025-02-28",
      "headline": "Citigroup employee's typo nearly led to $81 trillion blunder. Details hereThe payment was initially overlooked by two employees before a third employee caught it. Citi later reported the incident as a 'near miss' to the Federal Reserve and the Office of the Comptroller of the Currency (OCC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dont-miss-these-money-deadlines-in-march-2025-special-fds-itr-and-more-2687028-2025-02-28",
      "headline": "Don't miss these money deadlines in March 2025: Special FDs, ITR, and more In case you have missed reporting income or made an error in your ITR, you can still fix it. The final deadline for filing an  updated return (ITR-U) is March 31, 2025.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-ends-1400-points-lower-global-trade-war-fears-rs-9-lakh-crore-gone-2687039-2025-02-28",
      "headline": "Sensex falls 1,400 points as trade war fears rattle D-Street, Rs 9 lakh crore goneStock market crash: During today's trading session, Dalal Street plunged as Sensex tumbled 1,414 points and Nifty sank below 22,150 amid global trade war fears and foreign sell-off, erasing nearly Rs 9 lakh crore in market value. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gdp-grows-q3-2024-25-up-from-q2-figures-2687031-2025-02-28",
      "headline": "GDP grows at 6.2% in Q3 2024-25, up from 5.6% in Q2For the financial year 2023-24, India recorded a real GDP growth rate of 9.2%, marking the highest annual growth in the past 12 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-news-nifty-on-track-for-longest-losing-streak-in-29-years-rs-85-lakh-crore-wiped-out-2687016-2025-02-28",
      "headline": "Nifty posts longest monthly losing streak in 29 years, over Rs 90 lakh crore goneForeign outflows, weak earnings and global uncertainty have wiped out over Rs 90 lakh crore in investor wealth from  since September 2024, when Nifty hit an all-time high of 26,277.35. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brit-awards-2025-charli-xcx-wins-album-of-the-year-full-winners-list-here-2687772-2025-03-02",
      "headline": "BRIT Awards 2025: Charli XCX wins album of the year, full winners list hereCharli XCX emerged as a major winner at the Brit Awards 2025, securing multiple accolades. Artists including Sabrina Carpenter and Billie Eilish also took home some of the biggest awards of the night.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-delhi-millionaire-concert-a-night-of-nostalgia-surprises-iconic-hits-2687778-2025-03-02",
      "headline": "Honey Singh's Millionaire Delhi concert: A night of nostalgia, iconic hitsHoney Singh's Delhi concert was packed with nostalgic hits, emotional tributes, surprise guests, and exclusive remixes. The rapper promised bigger things ahead as his Millionaire Tour continues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-celebrates-31st-birthday-with-family-shares-rare-pics-of-son-jack-blues-bieber-2687734-2025-03-02",
      "headline": "Justin Bieber celebrates 31st birthday with family, shares rare pics of son JackPop sensation Justin Bieber marked his 31st birthday with a heartwarming family gathering. He shared rare photos with wife Hailey and their son Jack, capturing the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billy-joel-stumbles-and-falls-mid-performance-2687699-2025-03-02",
      "headline": "Singer Billy Joel stumbles and falls mid-performance, fans say 'that's painful'During a recent performance, legendary musician Billy Joel stumbled and fell onstage, causing fans to worry about his health. The incident has sparked widespread concern and discussions about the artist's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-vows-to-bring-grammy-to-india-at-sold-out-delhi-concert-watch-2687670-2025-03-02",
      "headline": "At sold-out Delhi concert, Honey Singh vows to bring Grammys to India. WatchAt his Delhi concert, Honey Singh wowed fans with his hits and vowed to bring a Grammy to India, inspired by AR Rahman's Oscars win. He also expressed his deep love for Delhi and its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-set-to-perform-in-delhi-excited-fans-rush-into-venue-2687561-2025-03-01",
      "headline": "Honey Singh set to perform in Delhi, excited fans rush to the venueSinger and rapper Honey Singh is set to perform in Delhi today as part of his ongoing Millionaire India tour. Ahead of the concert, excited fans were seen rushing to the venue as soon as the gates opened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-online-negativity-against-him-ive-been-here-before-youtube-existed-2687499-2025-03-01",
      "headline": "Honey Singh on online negativity against him: I've been here before YouTube existedSinger and rapper Honey Singh took a dig at those spreading negativity about him through YouTube podcasts. During his Lucknow concert last night, he also spoke about his lifestyle changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-twitter-x-account-hacked-warns-fans-2687489-2025-03-01",
      "headline": "Shreya Ghoshal's X account hacked: Tried every thing in my capacityRenowned singer Shreya Ghoshal has disclosed that her X account has been compromised since February 13. Despite efforts, she remains unable to access or delete the account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rushali-yadav-harsh-arora-splitsvilla-15-contestants-are-engaged-2687457-2025-03-01",
      "headline": "Splitsvilla 15's Rushali Yadav-Harsh Arora engaged: Just perfectly usSplitsvilla 15 contestants Rushali Yadav and Harsh Arora are now engaged. The couple fell in love on the show. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-trailer-ibrahim-ali-khan-khushi-kapoor-romance-netflix-2687443-2025-03-01",
      "headline": "Nadaaniyan trailer: Ibrahim, Khushi's romance comes with a priceIbrahim Ali Khan is all set to making his acting debut in Nadaaniyan, a love story with a secret deal. Also starring Khushi Kapoor, the film explores romance, ambition, and chaos. It will start streaming on Netflix from March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-returns-to-delhi-for-sold-out-millionaire-concert-2687376-2025-03-01",
      "headline": "Honey Singh returns to Delhi for sold-out Millionaire concert: What to expectYo Yo Honey Singh's Millionaire India Tour hits Delhi with a sold-out show, 20,000 fans, top celebs, and a surprise setlist. His parents will attend the concert, making this emotional homecoming extra special. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-wishes-to-team-up-with-diljit-dosanjh-urges-fans-to-make-it-happen-2687276-2025-02-28",
      "headline": "Honey Singh wishes to team up with Diljit Dosanjh, urges fans to make it happenSinger Honey Singh, currently touring India for his Millionaire India Tour, expressed his desire to collaborate with Diljit Dosanjh again during his recent concert in Lucknow. He urged fans to tag the Peaches singer, hoping to reunite for a new project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-reacts-to-comparisons-between-dabba-cartel-and-saas-bahu-aur-flamingo-2687163-2025-02-28",
      "headline": "Shabana Azmi reacts to comparisons between Dabba Cartel and Saas, Bahu Aur FlamingoShabana Azmi addressed concerns over comparisons between her Netflix show Dabba Cartel and Dimple Kapadia's Saas, Bahu Aur Flamingo, emphasising the unique elements of each series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palash-sen-diljit-dosanjh-concert-culture-remark-euphoria-20-remixes-2687019-2025-02-28",
      "headline": "Singer Palash Sen on Diljit's concert culture remark, Euphoria 2.0 and remixesEuphoria's lead vocalist Palash Sen opened up about Diljit Dosanjh's controversial concert culture remark, the rebranding of the band and more in an exclusive interaction with India Today Digital. Sen recently collaborated with Bollywood star Akshay Kumar on the song, Mahakal Chalo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lisa-blackpink-album-alter-ego-review-confident-versatile-powerful-2686930-2025-02-28",
      "headline": "Alter Ego review: Blackpink's Lisa's album is versatile and powerfulLisa of Blackpink releases her solo album Alter Ego. With a total of 15 songs and several collaborations, the album has a lot to take away from, but Lisa shines the brightest in her solo elements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ek-badnaam-aashram-3-part-2-review-bobby-deol-aaditi-pohankar-prakash-jha-chandan-roy-sanyal-2686921-2025-02-28",
      "headline": "Ek Badnaam Aashram 3 part 2 review: Baba Nirala's journey meets a dramatic endReleased-Thu Feb 27, 2025Prakash Jha's most anticipated series, Aashram Season 3 Part 2, is currently streaming on MX Player. The series focusses on Baba Nirala's fate and how his entire kingdom crashes down because of Pammi's quest for revenge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-review-shabana-azmi-and-gang-will-make-your-jaws-drop-with-boredom-2686950-2025-02-28",
      "headline": "Dabba Cartel review: Shabana Azmi is a silent lioness in a challenging storyReleased-Fri Feb 28, 2025'Dabba Cartel' is supposed to be a powerful story of five women who team up to run a cartel in Mumbai. But, the Netflix series ends up becoming a mushy pie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/g-dragon-ubermensch-album-is-out-a-long-overdue-masterpiece-2686904-2025-02-28",
      "headline": "G-Dragon's Übermensch album is out: A long-overdue masterpieceK-pop King G-Dragon is back with a new album after over a decade. Titled Übermensch, the album is a long-overdue masterpiece the fans deserved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/japanese-woman-summoned-for-kissing-bts-jin-without-consent-2686884-2025-02-28",
      "headline": "Japanese woman summoned for kissing BTS' Jin without consentA Japanese woman has been summoned by the South Korean police after she kissed BTS member Jin without his consent during a fan event held last summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-2-review-pushkar-gayathri-crime-drama-is-trapped-in-the-vortex-of-cliches-aishwarya-rajesh-kathir-2686874-2025-02-28",
      "headline": "Suzhal The Vortex 2 review: This crime-drama is trapped in the vortex of clichesReleased-Fri Feb 28, 2025Suzhal - The Vortex 2 review: Created by Pushkar and Gayatri, Suzhal - The Vortex 2 is a crime drama that suffers from overstuffed ideas. The show has interesting ideas, but it gets lost in the overstretched screenplay.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-discusses-food-music-and-korea-in-new-glimpse-of-with-love-meghan-2686840-2025-02-28",
      "headline": "Meghan Markle discusses food, music and Korea in new glimpse of 'With Love, Meghan'Meghan Markle and chef Roy Choi bond over food and the culture of South Korea as they discuss Karoake bars and music in the new promo for her Netflix show, 'With Love, Meghan'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/composer-pritam-thanks-mumbai-police-for-arresting-studio-theft-culprit-2686604-2025-02-27",
      "headline": "Composer Pritam thanks Mumbai Police for arresting studio theft culpritMusic composer Pritam expressed gratitude towards the Mumbai Police for capturing the suspect involved in a Rs 40 lakh theft from his studio. He praised their efforts in a heartfelt Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-boys-5-supernatural-actors-jensen-ackles-jared-padalecki-misha-collins-to-reunite-2686488-2025-02-27",
      "headline": "The Boys 5: Supernatural actors Jensen Ackles, Jared Padalecki to reuniteThe Boys Season 5 will be an exciting reunion as Soldier Boy Jensen Ackles will be joined by his Supernatural co-stars Jared Padalecki and Misha Collins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-review-sass-swag-and-secrets-in-a-soggy-spin-off-2686399-2025-02-27",
      "headline": "Suits LA review: Sass, swag and secrets in a soggy spin-offReleased-Mon Feb 24, 2025'Suits LA' has the flavour of the original 'Suits', but Teddy Black is no Harvey Spector, and you will be reminded of it, despite all the pizazz in the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/o-saathi-re-new-netflix-show-imtiaz-ali-aditi-rao-hydari-avinash-tiwary-arjun-rampal-2686276-2025-02-27",
      "headline": "O Saathi Re: Imtiaz Ali's Netflix series is a modern story with a vintage heartNetflix has released the first look of its new series O Saathi Re, starring Avinash Tiwary, Aditi Rao Hydari, and Arjun Rampal. The series, directed by Arif Ali, will be an 'ode to vintage love in modern times'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-hilarious-dance-mere-husband-mujhko-piyar-nahi-karte-at-sangeet-watch-2686265-2025-02-27",
      "headline": "Prajakta Koli hilariously dances to 'Mere Husband Mujhko Piyar…' at sangeet. WatchPrajakta Koli danced to Mere Husband Mujhko Piyar Nahin Karte at her sangeet, leaving guests in splits. She married Vrishank Khanal in Karjat on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kj-yesudas-hospitalised-chennai-old-age-2686238-2025-02-27",
      "headline": "Vijay Yesudas reacts to fake news about father Yesudas's hospitalisationReports were rife that playback singer Yesudas was hospitalised in Chennai due to age-related illness. His son and playback singer Vijay Yesudas exclusively spoke to India Today and shut down the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-education-actor-alexander-westwood-jailed-for-15-years-for-multiple-sex-offenses-2685969-2025-02-26",
      "headline": "Sex Education actor Alexander Westwood jailed for 15 years for sex offencesSex Education actor Alexander Westwood received a 15-year prison sentence for multiple sex offenses. The case has captured widespread media attention due to Westwood's role in the popular Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-1-ending-explained-pammi-aaditi-pohankar-revenge-baba-nirala-bobby-deol-prakash-jha-2685961-2025-02-26",
      "headline": "Aashram 3 Part 1 ending explained: Will Pammi's revenge end Baba Nirala's reign?With Aashram Season 3 Part 2 releasing on February 27, let us take a look at how the season ended on a cliffhanger with Baba Nirala's misuse of power and a change in dynamics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-jasleen-royal-criticism-coldplay-opening-one-bad-act-wont-damage-reputation-of-indian-2685917-2025-02-26",
      "headline": "Amit Trivedi says Jasleen Royal's opening act for Coldplay was 'unfortunate'Amit Trivedi, in an interview with India Today Digital, discussed the controversy over Jasleen Royal's opening act for Coldplay's India tour and whether it would impact on the image of Indian artists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-trying-to-save-marriage-with-bianca-censori-report-2685911-2025-02-26",
      "headline": "Rapper Kanye West trying to save marriage with Bianca Censori: ReportKanye West is reportedly trying to prevent his marriage with Bianca Censori from ending. An insider reveals that Bianca is considering divorce, and Kanye is panicking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/euphoria-palash-sen-akshay-kumar-bollywood-mahakal-chalo-mahashivratri-2685899-2025-02-26",
      "headline": "Singer Palash Sen on working with Akshay Kumar, not being 'accepted' by BollywoodEuphoria's lead vocalist Palash Sen spoke to India Today Digital about collaborating with Bollywood star Akshay Kumar on the song Mahakal Chalo, work opportunities in the Hindi film industry, and more in an exclusive interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-vandana-lalwani-separate-9-years-of-marriage-2685910-2025-02-26",
      "headline": "Actors Aman Verma and Vandana Lalwani to separate after 9 years of marriageActors Aman Verma and Vandana Lalvani are separating after nine-years of marriage. Amid growing speculation, Aman has addressed the rumours about their relationship. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baalveer-actor-dev-joshi-marries-girlfriend-aarti-first-pics-out-2685838-2025-02-26",
      "headline": "Baalveer actor Dev Joshi marries girlfriend Aarti, first pics outBaalveer actor Dev Joshi married his girlfriend Aarti in a beautiful ceremony. The wedding festivities, including haldi and mehndi, were spectacular and captured in stunning photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-abhishek-bachchan-inayat-verma-prime-video-series-release-date-2685817-2025-02-26",
      "headline": "Be Happy: Abhishek Bachchan, Inayat Verma series to stream in MarchThe streaming date of Abhishek Bachchan and Inayat Verma-starrer Be Happy is out. It promises to be a touching film about a single father's journey to support his daughter's dream of performing on a dance reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-man-on-the-inside-review-ted-danson-netflix-charming-comedy-2685801-2025-02-26",
      "headline": "A Man on the Inside: Ted Danson's charming comedy deserves more loveA Man on the Inside is a warm and witty series which tackles multiple subjects, including loss, new beginnings and, well, crime. The Ted Danson-starrer is currently streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-chikni-chameli-embarrassed-when-5-year-old-girls-sing-it-2685777-2025-02-26",
      "headline": "Shreya Ghoshal on Chikni Chameli: Embarrassed when 5-year-old girls sing itShreya Ghoshal says she feels embarrassed when young girls sing Chikni Chameli, stressing that lyrics should be written more thoughtfully, as music and films have a deep impact on society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-updates-fans-about-cancer-treatment-my-chemo-and-surgery-are-over-2685753-2025-02-26",
      "headline": "Hina Khan updates fans about cancer treatment: My chemo and surgery are overHina Khan recently gave an update about her cancer treatment. The actor mentioned that her chemotherapy and surgery are over. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-himani-narwal-death-mother-alleges-party-members-role-in-daughter-murder-2687739-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Haryana Congress worker found dead, mother claims 'killer may be from party'The body of 22-year-old Congress worker Himani Narwal was found in a suitcase near a bus stand in Haryana's Rohtak district on Saturday. She had participated in Rahul Gandhi's Bharat Jodo Yatra, and her death has sparked demands for a high-level probe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/union-minister-raksha-khadse-daughter-molested-in-maharashtra-devendra-fadnavis-reacts-2687760-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Union Minister says daughter harassed in Maharashtra, Devendra Fadnavis reactsUnion Minister Raksha Khadse on Sunday filed a complaint against few boys who allegedly harassed her minor daughter and other girls during the Sant Muktai Yatra in Maharashtra's Jalgaon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-live-score-dubai-weather-rohit-santner-2687697-2025-03-02#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "IND vs NZ Live: Shami, Hardik eye early wickets after India post 249Champions Trophy, India (IND) vs New Zealand (NZ) Live Updates: Hardik Pandya and Mohammed Shami are bowling with the new ball. India need early wickets. Rachin Ravindra and Will Young are the two openers for New Zealand. Earlier in the day, Shreyas Iyer's 79 and handy contributions from Axar Patel and Hardik Pandya helped India recover from 30 for 3 and post 249 on a sluggish pitch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/supported-by-gods-people-pope-francis-in-stable-condition-thanks-well-wishers-2687829-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supported by God's people: Pope Francis in stable condition, thanks well-wishersPope Francis remains in the hospital with stable blood circulation and no rise in white blood cells, suggesting his infection may be easing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/blue-ghost-nasa-private-mission-lands-on-the-moon-successfully-firefly-aerospace-2687748-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "We are on the Moon! Blue Ghost mission nails daring lunar landingThe Blue Ghost spacecraft spent about a month orbiting Earth before heading towards the Moon, where it refined its trajectory over 16 days in lunar orbit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-bjp-poll-rigging-department-trinamool-fake-voter-id-bengal-2687815-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fraud of EPIC proportions: Trinamool after poll body clarification on voter IDsThe Trinamool accused the Election Commission of aiding the BJP's alleged poll-rigging, citing duplicate voter ID numbers across states. The poll panel denied wrongdoing, dismissing claims of electoral roll manipulation as 'manual errors'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/mumbai-court-directs-case-against-madhabi-buch-top-sebi-stock-market-officials-2687720-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai court directs case against Madhabi Buch, top Sebi, stock market officialsThe respondents in the complaint were former Sebi Chairperson Madhabi Puri Buch, Whole Time Members Ashwani Bhatia, Ananth Narayan G, and Kamlesh Chandra Varshney, along with BSE Chairman Pramod Agarwal and CEO Sundararaman Ramamurthy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-republican-senator-lindsey-graham-warning-volodymyr-zelenskyy-donald-trump-white-house-showdown-2687708-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Don't take the bait: US Senator's warning to Zelenskyy before Trump showdownThe Trump-Zelenskyy meeting on Friday started off cordially, as they spoke politely. But when the Ukrainian leader raised alarm about trusting any promises from Putin to end the fighting, JD Vance rebuked him for airing disagreements with Trump in public, instantly shifting the tenor of the conversation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/kinnar-akhada-transgenders-claimed-pivotal-place-in-hindu-monastic-order-maha-kumbh-prayagraj-hijra-lgbtq-what-how-2687525-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kinnar Akhada: How transgenders claimed a pivotal place in Hindu monastic orderFrom being empowered by Lord Rama to bestow blessings on all ceremonious occasions to being criminalised under British colonial laws to claiming an akhara in Kumbh Mela, kinnars have carved a distinct religious identity within Hinduism. This is very different from the Hijra traditions. This is all about kinnars, how they are different from hijras, and how they created a place for themselves in the Hindu monastic system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/govt-may-now-keep-panchayats-pradhan-ji-out-of-office-for-good-2687185-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Government may now keep Panchayat's 'Pradhan Ji' out of office for goodDespite women's reservation in panchayati raj institutions, their male relatives often wield real power. A government panel has now shown how to stop that"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-matt-henry-five-wickets-shoaib-akhtar-dubai-2687833-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Matt Henry breaks Shoaib Akhtar's Champions Trophy record, hurts India againChampions Trophy, IND vs NZ: Matt Henry became the first bowler to take five wickets in an innings against India in a Champions Trophy match. Henry's 5 for 42 helped New Zealand restrict India to 249 in 50 overs in Dubai on Sunday, March 02. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsp-chief-mayawati-removes-nephew-akash-anand-all-party-posts-rejig-new-coordinators-2687747-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mayawati removes nephew Akash Anand from all party posts in big BSP shake-upIn a major leadership shake-up, the BSP removed Akash Anand from all party posts on Sunday, appointing his father, Anand Kumar, and Rajya Sabha MP Ramji Gautam as new national coordinators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-anushka-sharma-reaction-virat-kohli-catch-india-vs-new-zealand-2687769-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Anushka Sharma shocked after Glenn Phillips stunner ruins Virat Kohli's 300th ODIVirat Kohli was dismissed in his 300th ODI for just 11 runs against New Zealand on Sunday, March 2. Anushka Sharma was left shocked in the stands after Glenn Phillips plucked the ball out of thin air while fielding at point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/beauty-industry-raises-the-bar-top-trends-for-2025-2687186-2025-02-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Beauty industry raises the bar: Top trends for 2025From cutting-edge skincare technologies to the rise of preventive wellness rituals, here's what's inspiring the dynamic narrative of the beauty industry"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-avalanche-race-to-rescue-4-trapped-advanced-drones-to-be-deployed-2687677-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand avalanche: 46 safe, death toll rises to 8 as last worker's body foundA massive avalanche hit a BRO camp near Mana village in Uttarakhand's Chamoli, burying 54 workers. Rescue teams have saved 46 workers, but eight died. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-reactions-vidarbha-vs-kerala-2687810-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranji Trophy final: Who said what after Vidarbha win their third championshipRanji Trophy 2025: Vidarbha captain Akshay Wadkar said he was proud of the combined effort from the highly-talented bunch in their third title triumph. Sachin Baby, the Kerala captain, was graceful in defeat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-delhi-millionaire-concert-a-night-of-nostalgia-surprises-iconic-hits-2687778-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Honey Singh's Millionaire Delhi concert: A night of nostalgia, iconic hitsHoney Singh's Delhi concert was packed with nostalgic hits, emotional tributes, surprise guests, and exclusive remixes. The rapper promised bigger things ahead as his Millionaire Tour continues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-452-28-02-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-kerala-congress-stand-united-shashi-tharoor-internal-rift-buzz-2687738-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala Congress leaders stand as one: Rahul Gandhi amid Shashi Tharoor rift buzzRahul Gandhi posted an image on Facebook and captioned it, \"They stand as one, united by the light of purpose ahead.\" The photo was accompanied by the hashtag 'Team Kerala'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-donald-trump-uk-france-peace-deal-us-russia-war-keir-starmer-2687785-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UK, France and Ukraine will present peace deal to Donald Trump: British PMBritish Prime Minister Keir Starmer spoke to Macron and Trump on Saturday after he hosted Ukrainian President Volodymyr Zelenskiy in Downing Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-american-entrepreneur-vivek-ramaswamy-barefoot-interview-trolled-online-where-are-your-socks-2687654-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vivek Ramaswamy faces online vitriol over barefoot interview: 'Third-world uncle'The interview was held at the 39-year-old Harvard graduate's residence last year. But the resurfaced images sparked a wave of negative comments, with some even saying, \"we aren't in India\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-origin-nurse-attacked-face-disfigured-in-us-man-charged-with-hate-crime-2687763-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-origin nurse attacked, face disfigured in US; man charged with hate crimeAn Indian-origin nurse in Florida, 67-year-old Leelamma Lal, suffered severe facial fractures after being brutally attacked by a patient at Palms West Hospital. The suspect, 33-year-old Stephen Scantlebury, was arrested soon after, reportedly making derogatory remarks about Lal's Indian heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/hinduism-endured-aurangzeb-perished-himanta-biswa-jibe-at-mamata-banerjee-rahul-gandhi-2687789-2025-03-02#?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "You will end but Hinduism won't: Himanta Sarma slams Rahul Gandhi, Mamata BanerjeeAssam Chief Minister Himanta Biswa Sarma said Aurangzeb failed to destroy Hinduism and perished instead. He asserted that Hinduism is eternal and warned Mamata Banerjee and Rahul Gandhi against attempting to erase it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-stops-entry-humanitarian-aid-gaza-first-phase-ceasefire-expires-ramadan-begins-2687729-2025-03-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel blocks entry of aid to Gaza as ceasefire expires, Ramadan beginsIsrael on Sunday stopped the entry of all goods and supplies into the Gaza Strip. The office of Israel Prime Minister did not give any detail on the decision but warned of \"additional consequences\" if Hamas does not accept what Israel says is a US proposal for an extension of the ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sai-pallavi-thandel-to-premiere-on-netflix-official-release-date-2687826-2025-03-02",
      "headline": "Naga Chaitanya, Sai Pallavi's Thandel to premiere on NetflixNaga Chaitanya and Sai Pallavi's Thandel will soon premiere on Netflix. The streaming giant unveiled the official release date today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-janhvi-kapoor-to-film-rc-16-at-parliament-jama-masjid-report-2687788-2025-03-02",
      "headline": "Ram Charan, Janhvi Kapoor to film RC 16 at Parliament, Jama Masjid: ReportAfter completing their shoot in Mysore, the RC 16 team, including actors Ram Charan and Janhvi Kapoor, will reportedly film the next schedule in New Delhi. The film is directed by Buchi Babu Sana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/unseen-moments-from-prajakta-koli-wedding-2687804-2025-03-02",
      "headline": "Unseen moments from Prajakta Koli's weddingPrajakta Koli married Vrishank Khanal on February 25. Friends like Mithila Palkar and Sushant Divgikar shared adorable and fun moments from their wedding celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brit-awards-2025-charli-xcx-wins-album-of-the-year-full-winners-list-here-2687772-2025-03-02",
      "headline": "BRIT Awards 2025: Charli XCX wins album of the year, full winners list hereCharli XCX emerged as a major winner at the Brit Awards 2025, securing multiple accolades. Artists including Sabrina Carpenter and Billie Eilish also took home some of the biggest awards of the night.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-matt-henry-five-wickets-shoaib-akhtar-dubai-2687833-2025-03-02",
      "headline": "Matt Henry breaks Shoaib Akhtar's Champions Trophy record, hurts India againChampions Trophy, IND vs NZ: Matt Henry became the first bowler to take five wickets in an innings against India in a Champions Trophy match. Henry's 5 for 42 helped New Zealand restrict India to 249 in 50 overs in Dubai on Sunday, March 02. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shreyas-iyer-innings-india-vs-new-zealand-2687818-2025-03-02",
      "headline": "Shreyas Iyer emulates Virat Kohli with gritty knock vs spin in DubaiShreyas Iyer played a gritty knock of 79 runs against New Zealand on Sunday, March 2. In difficult, spin-friendly conditions in Dubai, Shreyas rescued India from an early collapse in Dubai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-reactions-vidarbha-vs-kerala-2687810-2025-03-02",
      "headline": "Ranji Trophy final: Who said what after Vidarbha win their third championshipRanji Trophy 2025: Vidarbha captain Akshay Wadkar said he was proud of the combined effort from the highly-talented bunch in their third title triumph. Sachin Baby, the Kerala captain, was graceful in defeat. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-dropping-himself-vs-australia-wasnt-a-pr-stunt-says-amit-mishra-2687794-2025-03-02",
      "headline": "Rohit Sharma dropping himself vs Australia wasn't a PR stunt: Amit MishraFormer India cricketer Amit Mishra said that India captain Rohit Sharma didn't drop himself just for PR stunt during the Border Gavaskar Trophy 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-anushka-sharma-reaction-virat-kohli-catch-india-vs-new-zealand-2687769-2025-03-02",
      "headline": "Anushka Sharma shocked after Glenn Phillips stunner ruins Virat Kohli's 300th ODIVirat Kohli was dismissed in his 300th ODI for just 11 runs against New Zealand on Sunday, March 2. Anushka Sharma was left shocked in the stands after Glenn Phillips plucked the ball out of thin air while fielding at point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-vidarbha-crowned-champions-kerala-2687758-2025-03-02",
      "headline": "Vidarbha crowned Ranji champions after beating Kerala, win third title in 7 yearsVidarbha crowned Ranji champions after beating Kerala, win third title in 7 years"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-arshdeep-singh-snubbed-fans-reaction-2687757-2025-03-02",
      "headline": "Justice for Arshdeep Singh: Fans fume over IND selection call for NZIndian fans were frustrated as Arshdeep Singh remained benched for India's Champions Trophy clash against New Zealand. Despite his T20I success, the pacer was overlooked again, leading to widespread criticism of Rohit Sharma and Gautam Gambhir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-varun-chakravarthy-harshit-rana-specialist-fast-bowler-2687752-2025-03-02",
      "headline": "IND vs NZ: Varun Chakravarthy gets a game, India play only 1 specialist pacerIndia vs New Zealand, CT 2025: India surprised quite a few with their team selection for their final Group A game against New Zealand. India played Mohammed Shami as their lone specialist pacer and added Varun Chakravarthy to an already spin-heavy line-up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-india-new-zealand-record-odis-2687744-2025-03-02",
      "headline": "Virat Kohli joins legendary club with 300 ODIs for India Champions Trophy 2025: Virat Kohli became the seventh Indian cricketer to play 300 or more ODIs and he reached the landmark in the Group A match against New Zealand at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-dale-steyn-wants-a-century-from-virat-kohlis-bat-in-300th-odi-ind-vs-nz-2687606-2025-03-02",
      "headline": "A century from Virat Kohli in his 300th ODI would be magical to see: Dale SteynLegendary South Africa fast bowler Dale Steyn expressed his desire to get to see a century from Virat Kohli's bat in his 300th ODI. Kohli will play his 300th ODI vs New Zealand in ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-arshdeep-singh-snubbed-fans-reaction-2687757-2025-03-02",
      "headline": "Justice for Arshdeep Singh: Fans fume over IND selection call for NZIndian fans were frustrated as Arshdeep Singh remained benched for India's Champions Trophy clash against New Zealand. Despite his T20I success, the pacer was overlooked again, leading to widespread criticism of Rohit Sharma and Gautam Gambhir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-varun-chakravarthy-harshit-rana-specialist-fast-bowler-2687752-2025-03-02",
      "headline": "IND vs NZ: Varun Chakravarthy gets a game, India play only 1 specialist pacerIndia vs New Zealand, CT 2025: India surprised quite a few with their team selection for their final Group A game against New Zealand. India played Mohammed Shami as their lone specialist pacer and added Varun Chakravarthy to an already spin-heavy line-up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-india-new-zealand-record-odis-2687744-2025-03-02",
      "headline": "Virat Kohli joins legendary club with 300 ODIs for India Champions Trophy 2025: Virat Kohli became the seventh Indian cricketer to play 300 or more ODIs and he reached the landmark in the Group A match against New Zealand at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-dale-steyn-wants-a-century-from-virat-kohlis-bat-in-300th-odi-ind-vs-nz-2687606-2025-03-02",
      "headline": "A century from Virat Kohli in his 300th ODI would be magical to see: Dale SteynLegendary South Africa fast bowler Dale Steyn expressed his desire to get to see a century from Virat Kohli's bat in his 300th ODI. Kohli will play his 300th ODI vs New Zealand in ICC Champions Trophy 2025."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}