{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/luxury-items-rs-10-lakh-tax-collected-at-source-1-percent-from-april-22-cbdt-new-rules-2713583-2025-04-23",
      "headline": "From watches to antiques, these luxury goods above Rs 10 lakh face 1% TCSThe Central Board of Direct Taxes (CBDT) has issued fresh guidelines to enforce the levy, which aims to plug tax leaks and boost visibility on big-ticket purchases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/operation-zeppelin-reveals-details-of-adanis-counter-to-hindenburg-report-2713535-2025-04-23",
      "headline": "'Operation Zeppelin' reveals details of Adani's counter to Hindenburg: ReportIn January 2023, Hindenburg published a scathing report against the Adani Group. The counter to its damning report against the conglomerate was dubbed 'Operation Zeppelin'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/european-union-fine-apple-usd-570-million-meta-usd-222-million-digital-markets-act-2713460-2025-04-23",
      "headline": "European Union fines Apple $570 million, Meta $228 million under new tech lawsThe fines levied on the two American tech giants are likely to stoke tensions with US President Donald Trump, who has threatened to levy tariffs against countries that penalise US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-high-fd-rates-these-banks-offer-interest-over-9-percent-2713443-2025-04-23",
      "headline": "Looking for high FD rates? These banks offer interest of over 9%A few small finance banks are offering attractive interest rates, some as high as 9.10% for senior citizens. These banks are using competitive rates to draw in long-term deposits, making them a smart pick for cautious investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-520-points-higher-nifty-above-24300-hcltech-jumps-8-percent-2713415-2025-04-23",
      "headline": "Sensex closes 520 points higher; Nifty above 24,300; HCLTech jumps 8%The S&P BSE Sensex jumped 520.90 points to close at 80,116.49, while the NSE Nifty50 gained 161.50 points to end at 24,328.95. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/petrol-diesel-price-relief-fuel-rates-in-india-crude-oil-global-government-tax-2713413-2025-04-23",
      "headline": "Crude oil prices fall below $70, will you get fuel price relief soon?The last reduction in petrol and diesel prices was in March 2024, when prices were cut by Rs 2, just ahead of the general elections. Before that, prices remained unchanged for almost two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-5-key-things-to-know-before-investing-price-band-lot-size-2713378-2025-04-23",
      "headline": "Ather Energy IPO: 5 key things to know before investingAther Energy's IPO will open for public subscription on Monday, April 28, 2025 and will close on April, 30, 2025, while anchor investors will get their allotment on April, 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-to-cut-time-at-doge-may-tesla-profit-falls-71-percent-protest-us-tariff-china-trade-2713341-2025-04-23",
      "headline": "Elon Musk says he'll spend 'less time at DOGE' as Tesla profits fall 71%DOGE, a government body aimed at cutting public spending, has been a major focus for Musk over the past several months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forgot-to-declare-your-tax-regime-choice-to-employer-here-what-happens-2713335-2025-04-23",
      "headline": "Forgot to declare your tax regime choice to employer? Here's what happensIf the old regime is better for you, and you have invested heavily under Section 80C, but don't inform your employer, more tax might be deducted from your salary during the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-operations-100-percent-tariff-anxiety-customers-cfo-vaibhav-taneja-earnings-call-2713329-2025-04-23",
      "headline": "'100% tariffs create anxiety': Tesla says still weighing when to enter IndiaTesla has lobbied India for years to cut its sky-high duties, with Elon Musk calling them among the steepest in the world. Despite no breakthrough yet, Tesla has recently leased showroom space and listed over two dozen job openings in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-ipo-plan-pause-public-listing-delay-amid-market-volatility-uncertainty-report-2713325-2025-04-23",
      "headline": "LG Electronics delays IPO amid market uncertainty: ReportThe South Korean company has told its advisers that it might postpone the IPO of its Indian unit. The reported pause in plans comes at a time when Dalal Street is seeing ups and downs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blusmart-hires-grant-thornton-for-forensic-audit-after-sebi-probe-2713306-2025-04-23",
      "headline": "BluSmart hires Grant Thornton for forensic audit after Sebi probe: ReportBluSmart, which operates over 8,000 EV taxis and has a strong presence in cities like Delhi, Mumbai, and Bengaluru, had to suspend services last week."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/shawn-mendes-spotted-with-portuguese-singer-maro-romance-or-music-collab-glbs-2713742-2025-04-24",
      "headline": "Shawn Mendes spotted with Portuguese singer MARO — Romance or music collab?Shawn Mendes and Portuguese artist MARO were seen enjoying a relaxed coffee date in Los Angeles, sparking rumors of romance or a possible collaboration as fans speculate about their easy chemistry and shared vibe.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/meet-the-new-haymitch-zada-and-peak-join-hunger-games-prequel-cast-glbs-2713739-2025-04-24",
      "headline": "Meet the New Haymitch: Zada and Peak join Hunger Games prequel castJoseph Zada and Whitney Peak will star in Hunger Games: Sunrise on the Reaping, a 2026 prequel exploring young Haymitch Abernathy's past during the 50th Games, directed by franchise veteran Francis Lawrence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/harvey-weinstein-back-in-court-for-rape-retrial-faces-new-charges-from-former-model-glbs-2713733-2025-04-24",
      "headline": "Harvey Weinstein back in court for rape retrial, faces new charges from former modelHarvey Weinstein's retrial began in New York with new and existing sexual assault allegations, including claims from Kaja Sokola. Prosecutors say Weinstein exploited power; his defense argues encounters were consensual.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/2025-american-music-awards-full-list-of-nominees-host-and-how-to-watch-glbs-2713714-2025-04-24",
      "headline": "2025 American Music Awards: Full List of nominees, host, and how to watchKendrick Lamar leads the 2025 American Music Awards with 10 nominations. Jennifer Lopez returns as host for the May 26 Las Vegas event, with Billie Eilish and Chappell Roan earning seven nods each.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/carlos-santana-postpones-san-antonio-concert-after-health-scare-tour-continues-glbs-2713713-2025-04-24",
      "headline": "Carlos Santana Postpones San Antonio Concert After Health Scare, Tour ContinuesCarlos Santana postponed his San Antonio concert after suffering dehydration before the show. The 76-year-old is recovering, with tour dates continuing as scheduled and a rescheduled date for San Antonio to be announced.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/film-federation-to-not-allow-fawad-khan-abir-gulaal-india-release-2713673-2025-04-23",
      "headline": "Will ensure Fawad Khan's Abir Gulaal isn't released in India: Film FederationIn response to the Pahalgam terror attack, FWICE has imposed a ban on Pakistani artistes, and is working to block the release of Abir Gulaal, a film featuring Fawad Khan in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/cid-silent-episode-sony-tv-daya-abhijeet-dayanand-shetty-aditya-shrivastav-2713658-2025-04-23",
      "headline": "CID to air a silent episode, Daya-Abhijeet call it a 'challenging experience'CID is set to air a special silent episode, offering viewers a unique experience as the investigative team faces a major challenge without dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heads-of-state-trailer-priyanka-chopra-john-cena-idris-alba-2713628-2025-04-23",
      "headline": "Heads of State trailer: Priyanka, John Cena, Idris Alba get their guns blazingThe trailer of the action-packed comedy Heads of State, featuring Idris Elba, John Cena, and Priyanka Chopra Jonas, has been released ahead of its global premiere on Prime Video on July 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tastefully-yours-trailer-kang-haneul-go-minsi-k-drama-is-classic-enemies-to-lovers-tale-2713582-2025-04-23",
      "headline": "Tastefully Yours trailer: Netflix's next K-drama is classic enemies-to-lovers tale'Tastefully Yours', a highly anticipated K-drama starring Kang Ha-neul and Go Min-si, premieres on May 12, 2025. The romantic comedy promises culinary conflicts and a classic rivals-to-lovers plot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khauf-review-psychological-horror-unravels-patriarchy-rajat-kapoor-monica-panwar-2713540-2025-04-23",
      "headline": "Khauf review: A psychological horror where fear isn't just a feeling, it's a mirrorReleased-Fri Apr 18, 2025'Khauf' is a psychological horror series that delves into the unsettling fears rooted in patriarchy and trauma, rather than relying on typical jump scares. Set in Delhi, it follows Madhuri's haunting journey as she navigates past traumas and eerie experiences in a women's hostel, offering a raw portrayal of real-world horrors and emotional terror."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonakshi-sinha-backs-tv-show-meri-bhavya-life-talks-about-body-positivity-2713546-2025-04-23",
      "headline": "Sonakshi Sinha backs TV show Meri Bhavya Life, talks about body positivityBollywood actor Sonakshi Sinha has joined the promotion of the TV show 'Meri Bhavya Life,' which challenges societal norms regarding body image. In a recent promo, she is seen discussing her experiences with body-shaming and urged young girls to embrace body positivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-2-teaser-jenna-ortega-is-back-to-create-more-madness-and-mayhem-2713552-2025-04-23",
      "headline": "Wednesday 2 teaser: Jenna Ortega is back to create more madness and mayhemNetflix released the much-awaited teaser of 'Wednesday' Season two on April 23. Along with the season's first glimpse, the release dates were also announced, splitting it into two parts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/carlos-santana-hospitalised-before-texas-concert-due-to-medical-emergency-glbs-2713557-2025-04-23",
      "headline": "Carlos Santana hospitalised before Texas concert due to medical emergencyLegendary musician Carlos Santana was hospitalised in Texas due to a medical emergency before his concert. The incident, suspected to be dehydration, led to the postponement of his San Antonio show. Santana's team remains hopeful for a swift recovery as he plans to continue his U.S. tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-tejas-remembers-shooting-emraan-hashmis-ground-zero-in-baramulla-2713492-2025-04-23",
      "headline": "Director Tejas remembers shooting Emraan Hashmi's 'Ground Zero' in BaramullaDirector Tejas Vijay Deoskar, in an interview with India Today Digital, shared his experience of shooting 'Ground Zero' in Baramulla, Kashmir. The film, starring Emraan Hashmi in the lead, will release in theatres on April 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-collaborates-with-her-mimic-chandni-for-iconic-ad-and-it-is-unmissable-2713468-2025-04-23",
      "headline": "Alia Bhatt collaborates with her mimic Chandni for iconic ad and it is unmissableIt finally happened! Alia Bhatt collaborated with her mimic Chandni aka Alia Vatt for an iconic advertisement. Fans showered love on the video shared on Instagram. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-emraan-hashmi-to-star-in-film-inspired-by-historic-shah-bano-case-2713432-2025-04-23",
      "headline": "Yami Gautam, Emraan Hashmi to star in film inspired by historic Shah Bano caseActors Yami Gautam and Emraan Hashmi to star in a film inspired by the historic Shah Bano case that is seen as one of the milestones in Muslim women's fight for rights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-gives-clarity-on-sujeeth-project-delay-due-to-pawan-kalyan-og-2713406-2025-04-23",
      "headline": "Nani shares update on film with director Sujeeth: Delay due to Pawan Kalyan filmActor Nani cleared the air on his film with director Sujeeth. He revealed that the project is currently on pause as the director is working on Pawan Kalyan's 'OG'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranauts-emergency-legal-row-over-alleged-fact-distortion-by-books-author-coomi-kapoor-2713384-2025-04-23",
      "headline": "Kangana's Emergency faces legal row over alleged fact distortion by book's authorKangana Ranaut's film 'Emergency' is under legal scrutiny as journalist Coomi Kapoor accuses the filmmakers of distorting facts from her book. Kapoor claims breach of contract regarding adaptation rights and misuse of her name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-announces-social-media-break-until-coolie-promotions-2713374-2025-04-23",
      "headline": "Lokesh Kanagaraj announces social media break until Coolie promotionsDirector Lokesh Kanagaraj has announced his break from social media, revealing he'll stay offline until promotions for his next film, 'Coolie', begin."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indus-water-treaty-suspended-attari-checkpost-shut-government-response-pahalgam-attack-2713599-2025-04-23",
      "headline": "Indus Waters Treaty paused, Attari border shut: India responds to J&K attackIndia has unleashed a sweeping diplomatic offensive on Pakistan after the Pahalgam terror strike by suspending Indus Waters Treaty, sealing Wagah border and shutting border checkpost."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-pahalgam-terror-attack-2713605-2025-04-23",
      "headline": "India's 5-pronged offensive against Pakistan after Pahalgam massacreIndia on Wednesday announced strong diplomatic measures against Pakistan, including the suspension of the Indus Waters Treaty and no entry for Pakistani nationals to India, following the terror attack in Jammu and Kashmir's Pahalgam, which claimed 26 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indus-waters-treaty-on-hold-india-pakistan-diplomatic-offensive-pahalgam-terror-attack-2713676-2025-04-23",
      "headline": "India puts Indus Waters Treaty on hold: What it signifiesIndia has suspended the Indus Waters Treaty following the Pahalgam terror attack, halting the supply of 39 billion cubic meters of water annually from rivers such as the Indus, Jhelum, and Chenab originating from Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-nishikant-dubey-indus-waters-treaty-india-pakistan-diplomatic-offensive-pahalgam-attack-2713634-2025-04-23",
      "headline": "This is 56-inch chest: BJP MP's praise for PM after India's move against PakBJP MP Nishikant Dubey on Wednesday praised the government for putting the Indus Waters Treaty of 1960 on hold following the Pahalgam terror attack which killed 26 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-syed-adil-hussain-shah-tried-to-snatch-terrorists-rifle-killed-2713505-2025-04-23",
      "headline": "Syed Adil Hussain: Hero Pahalgam pony ride operator who tried to stop terroristAt least 26 people were killed when terrorists opened fire on tourists in the popular Baisaran meadow in Pahalgam in one of the deadliest terrorist attacks in Kashmir in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saarc-visa-exemption-scheme-suspended-pakistani-nationals-to-depart-48-hours-2713681-2025-04-24",
      "headline": "India suspends visa exemption for Pakistani nationals: What is the scheme?The SAARC Visa Exemption Scheme (SVES) has been suspended by India following the Pahalgam terrorist attack in Jammu and Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-dog-mafia-supreme-court-judges-simple-imprisonment-2713735-2025-04-24",
      "headline": "Mumbai woman calls judges 'dog mafia', sentenced to one week of imprisonmentThe Bombay High Court sentenced the woman to one week of simple imprisonment for calling the judges of the High Court and Supreme Court a part of a \"dog mafia\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pahalgam-terror-attack-fearing-retaliation-from-india-former-pakistan-minister-calls-for-unity-among-parties-2713493-2025-04-23",
      "headline": "'If attacked by India...': Ex-Pak minister's post day after Pahalgam attackAs India vowed retaliation for the deadly Pahalgam terror attack, former Pakistani Minister Chaudhry Fawad Hussain called for national unity, urging all political factions to stand together to defend the country. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khauf-review-psychological-horror-unravels-patriarchy-rajat-kapoor-monica-panwar-2713540-2025-04-23",
      "headline": "Khauf review: A psychological horror where fear isn't just a feeling, it's a mirrorReleased-Fri Apr 18, 2025'Khauf' is a psychological horror series that delves into the unsettling fears rooted in patriarchy and trauma, rather than relying on typical jump scares. Set in Delhi, it follows Madhuri's haunting journey as she navigates past traumas and eerie experiences in a women's hostel, offering a raw portrayal of real-world horrors and emotional terror."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/robert-vadras-muslims-feeling-weakened-remark-on-pahalgam-attack-sparks-row-2713454-2025-04-23",
      "headline": "Muslims feeling weakened: Robert Vadra links Hindutva push to Pahalgam attackRobert Vadra said the government's Hindutva push makes minorities feel \"uncomfortable and troubled\". He called the Pahalgam attack 'a message to PM'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kalima-pahalgam-terror-attack-jammu-kashmir-tourists-killed-islam-kalma-six-importance-what-is-it-2713437-2025-04-23",
      "headline": "What is Kalma, and what is its significance in IslamSome of the victims of the Pahalgam attack were asked to recite the Kalma or Kalima by the terrorists. What is Kalma, and what is its significance in Islam?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-encounter-terrorists-security-forces-jammu-kashmir-jk-kulgam-2713491-2025-04-23",
      "headline": "Gunfight in Kulgam day after Pahalgam attack, TRF terrorist trappedA day after 26 people were killed in a terror attack in Jammu and Kashmir's Pahalgam, a gunfight broke out in Kulgam during which a top TRF commander was trapped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-kashmir-full-list-of-victims-released-2713232-2025-04-23",
      "headline": "US-based techie, IAF official among 26 killed in attack. Who were the victims?Authorities have released the names of the victims who lost their lives in the Pahalgam terror attack, acknowledging for the first time that 26 were killed in the massacre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/luxury-items-rs-10-lakh-tax-collected-at-source-1-percent-from-april-22-cbdt-new-rules-2713583-2025-04-23",
      "headline": "From watches to antiques, these luxury goods above Rs 10 lakh face 1% TCSThe Central Board of Direct Taxes (CBDT) has issued fresh guidelines to enforce the levy, which aims to plug tax leaks and boost visibility on big-ticket purchases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-plea-family-telephonic-interaction-nia-court-2713741-2025-04-24",
      "headline": "NIA opposes Tahawwur Rana's plea to speak to family, court to decide todayDelhi's Patiala House Court heard arguments from both the National Investigation Agency (NIA) and Tahawwur Rana's legal aid counsel on Wednesday and is expected to pronounce its order on the matter today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pahalgam-attack-national-conference-chief-farooq-abdullah-tourists-defy-fear-visit-kashmir-2713588-2025-04-23",
      "headline": "Don't let Pakistan win: Farooq Abdullah urges tourists to defy fear, visit Kashmir Amid rising security concerns in Jammu and Kashmir, National Conference president Farooq Abdullah on Wednesday appealed to tourists not to abandon their travel plans, asserting that their presence is a powerful message against fear and terrorism."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/wildfire-in-new-jersey-flee-homes-evacuation-closure-of-garden-state-parkway-us-fires-los-angeles-california-2713476-2025-04-23",
      "headline": "Wildfire in New Jersey forces 3,000 to flee their homesA wildfire in New Jersey spread to 8,500 acres and forced 3,000 people to flee from their homes. A portion of the Garden State Parkway, one of the busiest highways, had to be closed, and power supply to 25,000 customers had to be cut. The US saw a devastating fire in Los Angeles earlier this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pahalgam-terror-attack-jammu-and-kashmir-mohammed-siraj-virat-kohli-condemn-2713403-2025-04-23",
      "headline": "Mohammad Shami's 'All Eyes On Pahalgam' post to condemn terrorist attackFast bowler Mohammed Shami condemned the terror attack on tourists in Jammu and Kashmir's Pahalgam in a strongly-worded post on social media. Virat Kohli and Sachin Tendulkar were among the several Indian sportspersons who condemned the terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-pahalgam-terror-attack-jammu-kashmir-first-remarks-vows-action-2713439-2025-04-23",
      "headline": "To those behind the scenes in Pahalgam attack, we will get you: Rajnath SinghA day after 26 were killed in a targeted attack on tourists in Pahalgam, Defence Minister Rajnath Singh assured countrymen that those responsible for the heinous act will get a strong response in the near future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-will-reduce-tariffs-donald-trump-on-trade-talks-glbs-2713730-2025-04-24",
      "headline": "India will reduce tariffs, says Donald Trump amid ongoing trade talksDonald Trump said India plans to reduce tariffs, as formal trade talks begin in Washington. While details remain unclear, the move signals progress in bilateral trade talks aimed at reducing the US trade deficit and boosting market access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/pahalgam-massacre-india-october-7-bold-decisive-response-against-terror-attack-2713379-2025-04-23",
      "headline": "Pahalgam massacre is India's 'October 7', demands a bold and decisive responseWhat began as a sunny afternoon in Kashmir's Pahalgam turned into a bloodbath as at least 26 tourists were gunned down in a chilling, Pakistan-linked terror attack – an incident that echoed the horror of Israel's October 7 tragedy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-cuts-short-us-visit-congress-cwc-emergency-meet-pahalgam-attack-2713675-2025-04-23",
      "headline": "J&K attack: Rahul Gandhi cuts short US visit, to attend Congress' emergency meetRahul Gandhi, who was on a US visit, has cut short his trip to attend Congress Working Committee meeting on Thursday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-rohit-sharma-trent-boult-demolish-hyderabad-2713667-2025-04-23",
      "headline": "Rohit Sharma, Trent Boult star as MI move to 3rd after SRH demolitionIPL 2025: Rohit Sharma's return to form and Mumbai Indians' rising momentum dealt another blow to SRH's struggling campaign. Their aggressive approach backfired again as another collapse ended up with MI handing them a 7-wicket defeat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorist-attack-rough-terrain-no-security-attackers-pahalgams-baisaran-osint-2713520-2025-04-23",
      "headline": "Rough terrain, no security: Why attackers chose Pahalgam's BaisaranAt least 26 people died when terrorists opened fire at tourists relishing stunning scenes at Pahalgam's Baisaran."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-pat-cummins-all-attack-mode-hyderabad-2713705-2025-04-24",
      "headline": "SRH to move away from all-attack mode? Cummins hints at new plan after MI lossSRH skipper Pat Cummins feels that his team does need to assess the conditions properly and find scores to target after their all-attack approach flopped once against during the humbling loss to Mumbai Indians on Wednesday, April 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-trent-boult-relishing-new-bowling-role-2713693-2025-04-24",
      "headline": "Trent Boult relishing new role in MI after SRH win: Loving the blue and goldIPL 2025: Trent Boult's redefined bowling role at MI continues to pay off, with his four-wicket spell powering the side to a fourth straight win and pushing them into playoff contention in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-rohit-sharma-virat-kohli-kieron-pollard-2713679-2025-04-23",
      "headline": "Rohit Sharma joins Virat Kohli on mount 12k, goes past Kieron Pollard in MI listRohit Sharma's fine knock of 70 against SRH helped him to reach the landmark of 12,000 runs in T20s, joining Virat Kohli in the process. Rohit also went past Kieron Pollard in an elite list for MI on Wednesday, April 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-rohit-sharma-trent-boult-demolish-hyderabad-2713667-2025-04-23",
      "headline": "Rohit Sharma, Trent Boult star as MI move to 3rd after SRH demolitionIPL 2025: Rohit Sharma's return to form and Mumbai Indians' rising momentum dealt another blow to SRH's struggling campaign. Their aggressive approach backfired again as another collapse ended up with MI handing them a 7-wicket defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-arshad-nadeem-snubs-invite-asian-athletics-championship-2713666-2025-04-23",
      "headline": "Pakistan's Nadeem snubs Neeraj Chopra Classic for Asian Athletics ChampionshipPakistan's javelin star and reigning Olympic champion Arshad Nadeem has decided to decline the invite to take part in the Neeraj Chopra classic event, which will take place in Bengaluru on May 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-slow-start-never-concern-anil-kumble-srh-vs-mi-2713641-2025-04-23",
      "headline": "Rohit Sharma's slow IPL 2025 start was never a concern: Anil KumbleIPL 2025: Anil Kumble backed Rohit Sharma despite a slow IPL 2025 start, praising his composed approach and timely return to form, which coincided with Mumbai Indians' resurgence in the second half of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jaspirt-bumrah-mumbai-indians-most-wickets-lasith-malinga-tie-mi-vs-srh-2713624-2025-04-23",
      "headline": "Jasprit Bumrah equals Malinga's record for most wickets for MI in IPL historyIPL 2025: Jasprit Bumrah tied Lasith Malinga as MI's top wicket-taker in IPL history and became the fastest Indian to reach 300 T20 wickets, as MI bowlers restricted SRH despite Heinrich Klaasen's resistance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-rr-rajat-patidar-press-conference-chinnaswamy-bengaluru-2713618-2025-04-23",
      "headline": "Rajat Patidar enjoying learning process as RCB skipper: Input from seniors helping meRajat Patidar has said that he is enjoying the learning process as RCB skipper and said the input from the senior players is helping him a lot. Patidar has made a good start to life as the RCB skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-rr-rahul-dravid-press-conference-sanju-samson-home-advantage-2713591-2025-04-23",
      "headline": "Rahul Dravid on IPL 2025 home woes: No clear answer to teams' strugglesIPL 2025: Rajasthan Royals head coach Rahul Dravid on Wednesday suggested that players joining new franchises and unfamiliarity with local conditions could be a reason behind teams struggling to make the most of home advantage in the 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-ishan-kishan-walks-hardik-pandya-dressing-room-reaction-2713574-2025-04-23",
      "headline": "Fairplay or brain fade? Ishan Kishan walks, gutted after replay shows no edgeIPL 2025, SRH vs MI: Ishan Kishan walked without waiting for the umpire's call, only to be gutted later as replays showed no edge on his dismissal on Wednesday in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-hardik-pandya-pat-cummins-pahalgam-terror-attack-reaction-2713553-2025-04-23",
      "headline": "Pat Cummins, Hardik Pandya condemn Pahalgam attack, wear black armbands in IPL gameIPL 2025: Pat Cummins and Hardik Pandya offered their condolences to the families of the victims of the Pahalgam terror attack. The captains of the SunRisers Hyderabad and Mumbai Indians were wearing black armbands at the toss in Hyderabad on Wednesday, April 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jaspirt-bumrah-mumbai-indians-most-wickets-lasith-malinga-tie-mi-vs-srh-2713624-2025-04-23",
      "headline": "Jasprit Bumrah equals Malinga's record for most wickets for MI in IPL historyIPL 2025: Jasprit Bumrah tied Lasith Malinga as MI's top wicket-taker in IPL history and became the fastest Indian to reach 300 T20 wickets, as MI bowlers restricted SRH despite Heinrich Klaasen's resistance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-rr-rajat-patidar-press-conference-chinnaswamy-bengaluru-2713618-2025-04-23",
      "headline": "Rajat Patidar enjoying learning process as RCB skipper: Input from seniors helping meRajat Patidar has said that he is enjoying the learning process as RCB skipper and said the input from the senior players is helping him a lot. Patidar has made a good start to life as the RCB skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-rr-rahul-dravid-press-conference-sanju-samson-home-advantage-2713591-2025-04-23",
      "headline": "Rahul Dravid on IPL 2025 home woes: No clear answer to teams' strugglesIPL 2025: Rajasthan Royals head coach Rahul Dravid on Wednesday suggested that players joining new franchises and unfamiliarity with local conditions could be a reason behind teams struggling to make the most of home advantage in the 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-ishan-kishan-walks-hardik-pandya-dressing-room-reaction-2713574-2025-04-23",
      "headline": "Fairplay or brain fade? Ishan Kishan walks, gutted after replay shows no edgeIPL 2025, SRH vs MI: Ishan Kishan walked without waiting for the umpire's call, only to be gutted later as replays showed no edge on his dismissal on Wednesday in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-hardik-pandya-pat-cummins-pahalgam-terror-attack-reaction-2713553-2025-04-23",
      "headline": "Pat Cummins, Hardik Pandya condemn Pahalgam attack, wear black armbands in IPL gameIPL 2025: Pat Cummins and Hardik Pandya offered their condolences to the families of the victims of the Pahalgam terror attack. The captains of the SunRisers Hyderabad and Mumbai Indians were wearing black armbands at the toss in Hyderabad on Wednesday, April 23. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}