{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-to-get-costlier-may-1-rs-23-charges-go-up-check-new-rbi-rules-here-2701499-2025-03-31",
      "headline": "ATM withdrawals to cost Rs 23 from May 1 as RBI hikes fee. Check detailsATM cash withdrawal will see an increase from the current charge of Rs 21 per transaction. Despite the fee hike, customers will continue to receive a limited number of free ATM transactions every month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-eid-2025-is-nse-bse-closed-for-trading-monday-dalal-street-sensex-nifty-2701479-2025-03-31",
      "headline": "Is stock market closed today for Eid?The stock market follows a five-day workweek, operating from Monday to Friday. Regular trading hours are from 9:15 am to 3:30 pm. Markets remain closed on weekends and designated public holidays as per the official schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sukanya-samriddhi-yojana-ssy-help-save-rs-20-lakh-in-15-years-for-your-daughter-education-2700387-2025-03-28",
      "headline": "How this scheme can help you save Rs 20 lakh in 15 years for daughterIf you are planning for your daughter's higher education expenses, the Sukanya Samriddhi Yojana (SSY) can be a great savings option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-youngest-billionaire-razorpay-founders-harshil-mathur-shashank-kumar-age-34-2700382-2025-03-28",
      "headline": "Razorpay's Shashank Kumar, Harshil Mathur become India's youngest billionairesHarshil Mathur and Shashank Kumar met at IIT Roorkee, where they shared an interest in technology and problem-solving. Their journey into fintech began in 2014 when they launched Razorpay to simplify digital payments in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-30-points-lower-nifty-flat-in-early-trade-infosys-mahindra-down-up-to-3-percent-2700328-2025-03-28",
      "headline": "Sensex, Nifty fall in early trade over Trump tariff threats; Infosys down 2%The S&P BSE Sensex lost 282.59 points to 77,323.84, while the NSE Nifty50 was down 84.70 points to 23,507.25 as of 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-services-unavailable-on-march-31-fund-transfer-cash-deposit-withdrawal-rtgs-neft-financial-year-end-2700325-2025-03-28",
      "headline": "Planning a bank transfer on March 31? Here's why it may not workWhile banks will remain open, transactions like fund transfers, cash deposits, and withdrawals may not go through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-28-infosys-tata-motors-bel-adani-power-hcltech-and-more-2700293-2025-03-28",
      "headline": "Stocks to watch today: Infosys, Tata Motors, BEL, Adani Power, HCLTech and moreMarkets are set for a strong start on March 6 as key stocks like Infosys, Tata Motors, and Adani Power grab attention. Trade talks, global deals, and company moves could shape today's trading session. Here's what investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-on-march-28-sensex-nifty-trends-expert-view-key-factors-2700290-2025-03-28",
      "headline": "Sensex, Nifty today: Will positive run continue on stock market?Stock market opening today: The Sensex and Nifty gained in the previous session amid reports of positive talks between Indian and US officials about a trade deal. Analysts have noted that the focus during today's trading session will be on upcoming tariff developments and the India-US trade deal outcome.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-suspends-wto-financial-contributions-report-glbs-2700200-2025-03-27",
      "headline": "US suspends WTO financial contributions: ReportThe Trump administration has reportedly suspended financial contributions to The World Trade Organisation amid efforts to cut back government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-as-auto-tariffs-hurt-gm-help-tesla-and-others-glbs-2700188-2025-03-27",
      "headline": "Wall Street drifts as auto tariffs hurt GM, help Tesla and othersDonald Trump's auto tariffs impacted Wall Street on Thursday morning, with autogiant General Motors falling by 6.8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-25-auto-tariff-which-indian-companies-will-pay-the-price-glbs-2700039-2025-03-27",
      "headline": "Trump's 25% auto tariff: Which Indian companies will pay the priceUS President Donald Trump's 25% tariff on car imports will affect a few Indian companies, including Tata Motors, Eicher Motors, and Samvardhana Motherson. These firms ship components to the US and Europe's markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-close-higher-top-gainers-and-losers-donald-trump-tariff-impact-and-more-2700007-2025-03-27",
      "headline": "Sensex, Nifty close higher: Top gainers and losers, tariff impact and key driversStock market today: Some of the top gainers during today's session were Bajaj Finserv, IndusInd Bank, NTPC, L&T, Ultratech Cement, Hero MotoCorp, Adani Enterprises and BPCL. On the other hand, some of the top losers were Tata Motors, Sun Pharma, Eicher Motors, Apollo Hospitals, Bharti Airtel, Kotak Mahindra Bank and HCLTech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-318-points-higher-nifty-just-below-23600-tata-motors-down-5-2699968-2025-03-27",
      "headline": "Sensex ends 318 points higher, Nifty just below 23,600; Tata Motors down 5%Stock market closing bell: The S&P BSE Sensex ended 317.93 points higher at 77,606.43, while the NSE Nifty50 rose 105.10 points to settle at 23,591.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-greater-noida-flats-to-get-costlier-registration-fees-increase-20-30-percent-2699948-2025-03-27",
      "headline": "Noida, Greater Noida flat registration fees may rise 20-30%According to a draft notification, circle rates in Noida could see a 20% hike, while in Greater Noida, the increase may go up to 30%. The move is expected to make property transactions more expensive in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-open-lower-amid-us-tariff-uncertainty-wipro-trent-gain-nearly-2-percent-2699764-2025-03-27",
      "headline": "Sensex, Nifty gain after opening lower in volatile trade; Wipro rises nearly 2%Stock market opening: While the Sensex opened 100 points lower, it was trading 64.27 points higher at 77,552.77 at around 9.26 am. The Nifty50 was trading 16.75 points higher at 23,503.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-27-wipro-bandhan-bank-infosys-vedanta-upl-and-more-2699760-2025-03-27",
      "headline": "Top stocks to watch today: Tata Motors, Wipro, JB Chemicals, Infosys, Vedanta, UPLWhile positive cues are likely to support the two leading indices on Dalal Street, US tariff uncertainty looms large. Here are some of the key stocks that will be in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-expectations-march-27-sensex-nifty-today-nse-bse-dalal-street-2699718-2025-03-27",
      "headline": "Stock market on March 27: What to expect from Sensex, Nifty today?Stock market prediction: Nifty and Sensex have gained nearly 2% in the past five sessions, but investors will now be watching to see if the market can recover from Wednesday's drop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-is-drifting-again-after-getting-whipsawed-for-weeks-glbs-2699577-2025-03-26",
      "headline": "Wall Street is drifting again after getting whipsawed for weeksThe New York Stock Exchange saw a steady opening on Wednesday with marginal drops for S&P 500 and the Nasdaq composite."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/gautami-kapoor-claps-back-at-ekta-kapoor-indirect-dig-at-ram-kapoor-weight-loss-2701519-2025-03-31",
      "headline": "Gautami Kapoor claps back at Ekta Kapoor's indirect dig at Ram Kapoor's weight lossActor and Ram Kapoor's wife Gautami Kapoor mimicked Ekta Kapoor's video amid the ongoing feud between Ekta and Ram. The conflict started over Ram's claims about Bade Achhe Lagte Hain and intensified with social media digs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-collection-day-1-salman-khan-subpar-opening-rs-26-crore-2701496-2025-03-31",
      "headline": "Sikandar box office Day 1: Piracy hits Salman Khan's film, opens at Rs 26 croreSikandar box office collection Day 1: Salman Khan's film had a decent opening on Sunday. However, piracy hit the film ahead of its release. Experts have suggested that the film's online leak might cause a 30-40% loss in business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-collection-day-4-mohanlal-film-rs-60-crore-in-india-amid-backclash-controversy-2701495-2025-03-31",
      "headline": "Empuraan box office Day 4: Mohanlal film earns Rs 60 crore in India amid backlashMohanlal and director Prithviraj Sukumaran's Empuraan courted controversy over the portrayal of riot scenes. Despite the row, the film has earned over Rs 60 crore nett at the domestic box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-prithviraj-sukumaran-mother-mallika-sukumaran-statement-2701483-2025-03-31",
      "headline": "Mohanlal aware of every scene: Prithviraj's mother over Empuraan rowPrithviraj Sukumaran's mother and actor Mallika Sukumaran defended her son in the ongoing Empuraan row. In a long Facebook post, she claimed that Mohanlal was aware of every scene in Empuraan and that her son never deceived anyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/screen-idol-richard-chamberlain-dies-at-90-2701390-2025-03-30",
      "headline": "Screen idol Richard Chamberlain dies at 90American actor Richard Chamberlain, known for his shows such as Shogun and Dr Kildare, has died. He was 90. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-box-office-performance-might-be-impacted-film-leaked-2701372-2025-03-30",
      "headline": "Salman Khan's Sikandar box office performance might be impacted. Here's whySuperstar Salman Khan's Sikandar's box office performance might be severely impacted in the days to come. Already, trade experts are predicting only a Rs 30 crore opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-day-1-prediction-salman-khan-film-rs-30-crore-2701340-2025-03-30",
      "headline": "Sikandar box office Day 1 prediction: Salman film to open around Rs 30 crore-markSikandar box office Day 1 prediction: Superstar Salman Khan's latest release, Sikandar, is gearing up for a grand opening. According to trade reports, Sikandar might make somewhere around Rs 25-30 crore on its opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidyut-jammwal-supports-kunal-kamra-kamaal-r-khan-2701326-2025-03-30",
      "headline": "Actor Vidyut Jammwal supports Kunal Kamra, asks why no one questions Kamaal R KhanActor Vidyut Jammwal has seemingly extended his support to comedian Kunal Kamra in his latest social media post. He also asked why no one ever questions actor Kamaal R Khan's statements that often target women and the country itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-aaradhya-viral-pics-cousins-wedding-2701327-2025-03-30",
      "headline": "Aishwarya Rai, Abhishek Bachchan, and Aaradhya's viral pics from cousin's weddingA photo of Aishwarya Rai enjoying her cousin's wedding with her husband-actor Abhishek Bachchan and daughter Aaradhya has gone viral. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-mohanlal-film-inches-close-rs-50-crore-mark-2701319-2025-03-30",
      "headline": "Empuraan box office Day 3: Mohanlal's film inches close to Rs 50 crore markPrithviraj Sukumaran's third directorial, L2: Empuraan, witnessed a slight rise in domestic earnings on Saturday. The film released in theatres on March 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pm-narendra-modi-big-shoutout-to-rapper-hanumankind-for-run-it-up-2701314-2025-03-30",
      "headline": "PM Modi's big shoutout to rapper Hanumankind for his song Run it UpPrime Minister Narendra Modi has congratulated Indian-origin rapper Hanumankind for his latest song, Run it Up. The PM shared his congratulatory wishes to the artiste during his Mann Ki Baat address. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-gets-grand-welcome-in-jaipur-2701302-2025-03-30",
      "headline": "From regal forts to peacocks: Priyanka Chopra gets grand welcome in JaipurPriyanka Chopra reached Jaipur for her professional commitments. The actor shared a bunch of pictures from her stay on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mobland-review-tom-hardy-pierce-brosnan-2701188-2025-03-30",
      "headline": "MobLand review: A gritty crime drama with a stellar castReleased-Mon Mar 31, 2025MobLand delves into the violent world of two crime families in London. With a stellar cast, this series offers gripping drama and intense power dynamics. Read on and find out if it suits your taste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-apologises-over-riot-references-in-empuraan-2701275-2025-03-30",
      "headline": "Mohanlal says Gujarat riot themes to be removed from Empuraan: Regret mental painActor Mohanlal has apologised over riot references in his film L2: Empuraan. The Malayalam star released a statement on social media on Sunday amid the ongoing row. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sikandar-review-ode-to-salman-khan-stardom-rashmika-mandanna-2701267-2025-03-30",
      "headline": "Sikandar review: An ode to Salman Khan's stardom that's devoid of funReleased-Sun Mar 30, 2025Salman Khan-starrer Sikandar has released with a bang, with the promise of entertaining Khan's die-hard fans. Directed by AR Murugadoss, the film also stars Rashmika Mandanna. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-chief-minister-pinarayi-vijayan-watches-empuraan-amid-row-over-its-themes-2701264-2025-03-30",
      "headline": "Kerala Chief Minister watches Empuraan: Freedom of expression must be protectedKerala Chief Minister Pinarayi Vijayan recently watched Prithviraj's L2: Empuraan and shared his take on social media. The film has been caught in the middle of a controversy over its allusion to the Gujarat riots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-x-reviews-salman-khan-entry-say-goosebumps-guaranteed-rashmika-mandanna-2701239-2025-03-30",
      "headline": "Sikandar X reviews: Fans praise Salman Khan's entry, say 'goosebumps guaranteed' Live Updates Salman Khan's much-awaited movie Sikandar has finally been released in theatres today, March 30. Fans showered their love on the film and praised Salman's return to the big screen. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-leaked-online-hours-before-theatrical-release-2701223-2025-03-30",
      "headline": "Salman Khan's Sikandar leaked online hours before theatrical releaseSalman Khan's Sikandar was leaked online hours before its release on March 30. The movie was available on various pirated sites. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-akshay-kumar-prabhas-kannappa-release-postponed-vfx-2701206-2025-03-30",
      "headline": "Vishnu Manchu, Akshay Kumar's Kannappa release postponedVishnu Manchu's upcoming film, Kannappa, has been delayed. The actor shared a statement on social media and addressed the reason behind the delay. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-readies-missiles-to-retaliate-after-trumps-threat-over-nuclear-deal-report-2701473-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Iran readies missiles to retaliate after Trump's threat over nuclear deal: ReportFollowing Donald Trump's threat, Iran has placed its missiles in ready-to-launch mode within underground facilities across the country, designed to withstand airstrikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-raj-thackeray-on-row-over-aurangzebs-tomb-dont-ready-history-on-whatsapp-2701465-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Raj Thackeray on row over Aurangzeb's tomb: Don't read history on WhatsAppSpeaking at his Gudhi Padwa rally in Mumbai, Raj Thackeray warned against misleading narratives and WhatsApp forwards, stressing the need for credible historical sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prashant-kishor-kunal-kamra-gaddar-joke-eknath-shinde-habitat-comedy-club-2701480-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prashant Kishor backs 'friend' Kunal Kamra in joke row: No ulterior motivePrashant Kishor defended Kunal Kamra, stating the comedian has no political motives. Kamra is facing legal trouble over remarks on Eknath Shinde, prompting backlash and vandalism by Shiv Sena supporters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ex-uttarakhand-chief-minister-trivendra-singh-rawats-lion-dont-hunt-dogs-against-dalit-ias-officer-sparks-row-2701469-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Chief Minister's 'lion don't hunt dogs' remark against Dalit officer sparks rowThe Uttarakhand IAS Association has protested Haridwar MP Trivendra Singh Rawat's remark against Dalit IAS officer Brajesh Sant amid the escalating illegal mining controversy, condemning it as casteist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-prithviraj-sukumaran-mother-mallika-sukumaran-statement-2701483-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohanlal aware of every scene: Prithviraj's mother over Empuraan rowPrithviraj Sukumaran's mother and actor Mallika Sukumaran defended her son in the ongoing Empuraan row. In a long Facebook post, she claimed that Mohanlal was aware of every scene in Empuraan and that her son never deceived anyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonia-gandhi-education-policy-nep-implementation-tamil-nadu-dmk-bjp-2701500-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sonia Gandhi slams National Education Policy: Government pushing '3 Cs' agendaSonia Gandhi has slammed the BJP government for imposing NEP 2020 without consultation, alleging it centralises control, promotes commercialisation, and undermines federalism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meerut-murder-accused-days-in-jail-farming-sewing-and-a-visit-by-arun-govil-2701492-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meerut murder accused's days in jail: Farming, sewing and a visit by Arun GovilThe duo had killed Saurabh, dismembered his body, stuffed the remains into a drum, and sealed it with cement before leaving for a vacation in Himachal Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iiit-allahabad-student-suicide-prayagraj-hostel-birthday-academic-pressure-2701474-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Specially-abled IIIT Allahabad student dies by suicide in hostel on his birthdayIIIT Allahabad student Rahul Chaitanya Madala died by suicide on his birthday, citing academic pressure. His death has sparked student protests over mental health neglect and campus medical inadequacies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-stats-as-finisher-since-2023-csk-vs-rr-2701490-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MS Dhoni still the same old match-winner? CSK legend's IPL numbers don't agree IPL 2025: MS Dhoni hasn't contributed enough to CSK's wins since the 2023 edition of the tournament. On Sunday, Dhoni's 16-run knock went in vain as the Super Kings lost to Rajasthan Royals by six runs in Guwahati."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-lamborghni-crash-man-rams-luxury-car-into-labourers-detained-hospital-2701412-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did anyone die, Lamborghini driver asks on camera after ramming 2 in NoidaA man rammed his Lamborghini into two labourers in Noida Sector 94, seriously injuring them before asking locals whether somebody had died during a confrontation with them. Police detained the accused and confiscated the vehicle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/florida-woman-films-sex-acts-with-pet-chihuahua-posts-on-instagram-arrested-2701507-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Florida woman films sex acts with pet chihuahua, posts on Instagram; arrestedLogan Guminski admitted that she had received USD 500 (nearly Rs 43,000) from a social media user in exchange for more videos of her engaging in sexual acts with her pet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-to-get-costlier-may-1-rs-23-charges-go-up-check-new-rbi-rules-here-2701499-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ATM withdrawals to cost Rs 23 from May 1 as RBI hikes fee. Check detailsATM cash withdrawal will see an increase from the current charge of Rs 21 per transaction. Despite the fee hike, customers will continue to receive a limited number of free ATM transactions every month."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-collection-day-1-salman-khan-subpar-opening-rs-26-crore-2701496-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sikandar box office Day 1: Piracy hits Salman Khan's film, opens at Rs 26 croreSikandar box office collection Day 1: Salman Khan's film had a decent opening on Sunday. However, piracy hit the film ahead of its release. Experts have suggested that the film's online leak might cause a 30-40% loss in business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eid-al-fitr-greetings-pm-modis-harmony-message-in-eid-wishes-rahul-gandhi-prays-for-peace-2701503-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi's harmony message in Eid wishes, Rahul Gandhi prays for peacePrime Minister Narendra Modi, Congress leader Rahul Gandhi and other political leaders extended Eid wishes on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/woman-pulled-alive-from-rubble-three-days-after-myanmar-earthquake-death-toll-2701498-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman pulled alive from rubble 3 days after Myanmar quake; toll nears 2,000The woman was pulled from the rubble of the Great Wall Hotel in the city of Mandalay, according to a Chinese government post on Facebook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jakub-mensik-beats-novak-djokovic-to-win-1st-atp-title-at-miami-open-2701501-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jakub Mensik stuns idol Novak Djokovic to win 1st ATP title at Miami OpenJakub Mensik beat his idol Novak Djokovic to clinch his maiden ATP title at the Miami Open. The 19-year-old beat Djokovic 7-6 (7-4), 7-6 (7-4) and became the ninth youngest to win an ATP title."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/did-rajput-icon-rana-sanga-invite-babur-the-political-row-thats-raging-in-up-2701281-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Rajput icon Rana Sanga invite Babur? The political row that's raging in UPAmidst a BJP-Rajput community backlash and violence, the Samajwadi Party has rallied behind its Rajya Sabha MP Ramji Lal Suman whose remarks started it all\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/forcing-virginity-test-violates-womens-right-to-dignity-chhattisgarh-high-court-2701468-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Forcing virginity test violates women's right to dignity: Chhattisgarh High CourtThe Chhattisgarh High Court ruled that forcing a woman to undergo a virginity test violates Article 21 of the Constitution, which safeguards her right to life, liberty, and dignity. The court emphasised that such tests breach fundamental rights, natural justice, and a woman's modesty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-says-will-slap-reciprocal-tariffs-on-all-nations-as-liberation-day-nears-2701472-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says will slap reciprocal tariffs on all nations as 'Liberation Day' nearsTrump has promised to unveil a massive tariff plan on Wednesday, which he has dubbed \"Liberation Day.\" He has already imposed tariffs on aluminium, steel and autos, along with increased tariffs on all goods from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-modi-government-bjp-vaccine-maitri-health-diplomacy-pm-congress-2701416-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shashi Tharoor praises PM Modi's leadership again, this time for vaccine diplomacyCongress MP Shashi Tharoor praised the Centre's decision to implement India's Vaccine Maitri initiative during the Covid-19 pandemic, aimed at sending vaccines to several countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/maaya-rajeshwaran-rafael-nadal-exclusive-interview-wta-debut-mumbai-2701169-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Under Nadal's tutelage, Maaya Rajeshwaran sets sights on ultimate ambitionIn an exclusive interview with India Today Digital, India's 15-year-old tennis sensation Maaya Rajeshwaran talked about her campaign in the Mumbai Open, where she qualified for the semi-finals and opened up on her experience of training under the eyes of Rafael Nadal at the Spanish legend's academy in Mallorca. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-rid-yourself-of-acne-oily-skin-naturally-2701285-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to rid yourself of acne, oily skin naturallySay no to skin woes as our expert shares easy-to-follow home remedies that promise to calm breakouts and soothe your skin\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-bjp-mla-nand-kishore-on-show-cause-notice-by-party-conspiracy-to-kill-me-2701463-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP MLA Nand Kishore on show-cause notice by party: Conspiracy to kill meBJP MLA from Ghaziabad's Loni, Nand Kishore Gurjar, has responded to the party's show-cause notice, alleging a conspiracy to have him killed during a Kalash Yatra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-hes-considering-ways-to-serve-3rd-term-i-am-not-joking-2701460-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says he's considering ways to serve 3rd term: I am not jokingUS President Donald Trump has again suggested he may seek a third term, asserting in a televised interview that he is \"not joking\" about the possibility, despite constitutional restrictions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jakub-mensik-beats-novak-djokovic-to-win-1st-atp-title-at-miami-open-2701501-2025-03-31",
      "headline": "Jakub Mensik stuns idol Novak Djokovic to win 1st ATP title at Miami OpenJakub Mensik beat his idol Novak Djokovic to clinch his maiden ATP title at the Miami Open. The 19-year-old beat Djokovic 7-6 (7-4), 7-6 (7-4) and became the ninth youngest to win an ATP title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-stats-as-finisher-since-2023-csk-vs-rr-2701490-2025-03-31",
      "headline": "MS Dhoni still the same old match-winner? CSK legend's IPL numbers don't agree IPL 2025: MS Dhoni hasn't contributed enough to CSK's wins since the 2023 edition of the tournament. On Sunday, Dhoni's 16-run knock went in vain as the Super Kings lost to Rajasthan Royals by six runs in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jasprit-bumrah-starts-bowling-at-nca-mumbai-indians-mi-2701488-2025-03-31",
      "headline": "Watch: Bumrah starts bowling at NCA, sparks return hopes for Mumbai IndiansIndia and Mumbai Indians fast bowler Jasprit Bumrah has started bowling with full intensity at the Centre of Excellence in Bengaluru. The speedster has been out of action since the fifth Test of the Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-michael-vaughan-on-csk-batting-ruturaj-gaikwad-rahul-tripathi-2701476-2025-03-31",
      "headline": "Gaikwad to open, not Tripathi: Vaughan suggests CSK batting changeMichael Vaughan believes Chennai Super Kings must let Ruturaj Gaikwad open instead of Rahul Tripathi to revive their batting order. Tripathi was underwhelming yet  again in CSK's 6 -run defeat to Rajasthan Royals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/maaya-rajeshwaran-rafael-nadal-exclusive-interview-wta-debut-mumbai-2701169-2025-03-31",
      "headline": "Under Nadal's tutelage, Maaya Rajeshwaran sets sights on ultimate ambitionIn an exclusive interview with India Today Digital, India's 15-year-old tennis sensation Maaya Rajeshwaran talked about her campaign in the Mumbai Open, where she qualified for the semi-finals and opened up on her experience of training under the eyes of Rafael Nadal at the Spanish legend's academy in Mallorca. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-rr-vs-csk-highlights-orange-purple-cap-2701464-2025-03-31",
      "headline": "Points Table, March 30: MI pushed to bottom by Royals after Chennai heistIPL Points Table Update, March 30: Rajasthan Royals got off from the bottom of the table after beating the Chennai Super Kings by six runs in the second of Sunday's doubleheader at the Barsapara Cricket Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-checks-injured-rahul-dravid-rr-vs-csk-2701461-2025-03-31",
      "headline": "IPL 2025: MS Dhoni checks on injured RR coach Dravid after Guwahati thrillerDespite Chennai Super Kings' heartbreaking defeat to Rajasthan Royals, MS Dhoni's heartwarming gesture of checking on injured RR coach Rahul Dravid after the match won hearts. CSK suffered a narrow defeat in Guwahati despite Dhoni coming up to bat at number 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ruturaj-gaikwad-rr-vs-csk-defeat-2701459-2025-03-31",
      "headline": "CSK not pro-active enough? Gaikwad calls for improvement after defeat vs RRIPL 2025, RR vs CSK: Ruturaj Gaikwad said that the Chennai Super Kings were not proactive enough after losing to the Rajasthan Royals on Sunday where they failed to chase down 183 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-number-7-batting-position-rr-vs-csk-2701458-2025-03-30",
      "headline": "IPL 2025: MS Dhoni walks in at No.7, but fails to fire for CSK vs RRMS Dhoni's promotion to number 7 wasn't enough as Chennai Super Kings suffered their second consecutive defeat, falling short of the 183-run target against Rajasthan Royals despite a valiant effort from their skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-match-report-highlights-hasaranga-ms-dhoni-jadeja-nitish-rana-2701454-2025-03-30",
      "headline": "Nitish Rana, Hasaranga stun CSK in Guwahati as RR open account in IPL 2025IPL 2025: Rajasthan Royals clinched their first win of the season by defeating Chennai Super Kings on Sunday, March 30. Chennai failed to chase down a target of over 180 runs once again. Wanindu Hasaranga and Nitish Rana starred for RR after poor starts to their respective seasons.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-jake-fraser-mcgurk-vijay-shankar-rr-vs-csk-2701450-2025-03-30",
      "headline": "Riyan Parag, Fraser-McGurk, Vijay Shankar grab sensational catchesIPL 2025: Riyan Parag took a brilliant catch to send Shivam Dube packing in the match between CSK and RR. Earlier in the day, Delhi Capitals' Jake Fraser-McGurk pulled off a stupendous catch as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-checks-injured-rahul-dravid-rr-vs-csk-2701461-2025-03-31",
      "headline": "IPL 2025: MS Dhoni checks on injured RR coach Dravid after Guwahati thrillerDespite Chennai Super Kings' heartbreaking defeat to Rajasthan Royals, MS Dhoni's heartwarming gesture of checking on injured RR coach Rahul Dravid after the match won hearts. CSK suffered a narrow defeat in Guwahati despite Dhoni coming up to bat at number 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ruturaj-gaikwad-rr-vs-csk-defeat-2701459-2025-03-31",
      "headline": "CSK not pro-active enough? Gaikwad calls for improvement after defeat vs RRIPL 2025, RR vs CSK: Ruturaj Gaikwad said that the Chennai Super Kings were not proactive enough after losing to the Rajasthan Royals on Sunday where they failed to chase down 183 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-number-7-batting-position-rr-vs-csk-2701458-2025-03-30",
      "headline": "IPL 2025: MS Dhoni walks in at No.7, but fails to fire for CSK vs RRMS Dhoni's promotion to number 7 wasn't enough as Chennai Super Kings suffered their second consecutive defeat, falling short of the 183-run target against Rajasthan Royals despite a valiant effort from their skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-match-report-highlights-hasaranga-ms-dhoni-jadeja-nitish-rana-2701454-2025-03-30",
      "headline": "Nitish Rana, Hasaranga stun CSK in Guwahati as RR open account in IPL 2025IPL 2025: Rajasthan Royals clinched their first win of the season by defeating Chennai Super Kings on Sunday, March 30. Chennai failed to chase down a target of over 180 runs once again. Wanindu Hasaranga and Nitish Rana starred for RR after poor starts to their respective seasons.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-jake-fraser-mcgurk-vijay-shankar-rr-vs-csk-2701450-2025-03-30",
      "headline": "Riyan Parag, Fraser-McGurk, Vijay Shankar grab sensational catchesIPL 2025: Riyan Parag took a brilliant catch to send Shivam Dube packing in the match between CSK and RR. Earlier in the day, Delhi Capitals' Jake Fraser-McGurk pulled off a stupendous catch as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-girona-match-report-robert-lewandowski-2701441-2025-03-30",
      "headline": "20 games, 0 losses: Barcelona hammer Girona 4-1 to continue dream run in 2025FC Barcelona thrashed Girona 4-1 on Sunday to continue their dream run in 2025. Barcelona have played a total of 20 matches so far in 2025 and have not lost a single one of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-jofra-archer-rachin-ravindra-wicket-2701437-2025-03-30",
      "headline": "After 699 days, Jofra Archer ends wait for IPL wicket with fiery overIPL 2025, RR vs CSK: Jofra Archer breathed fire in his first two overs when he also got the wicket of the in-form Rachin Ravindra in Rajasthan's clash against Chennai on Sunday at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-abhishek-porel-press-kl-rahul-axar-patel-captaincy-2701429-2025-03-30",
      "headline": "DC vs SRH: How big brother KL Rahul helped Abhishek Porel forget costly dropIPL 2025, DC vs SRH: Abhishek Porel dropped SunRisers Hyderabad's Aniket Verma on 6 in Vzag on Sunday. The debutant went on to hit 74 off 41 deliveries in their loss to Delhi Capitals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-r-ashwin-ms-dhoni-stumping-nitish-rana-vieo-2701418-2025-03-30",
      "headline": "Watch: R Ashwin and MS Dhoni recreate old magic to outfox rampaging Nitish RanaIPL 2025, RR vs CSK: MS Dhoni and R Ashwin recreated a bit of old magic to stop Nitish Rana's rampage in Guwahati. The Rajasthan Royals star missed a well-deserved hundred after he was out stumped by Dhoni on Sunday, March 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-mi-chandrkant-pandit-pitch-controversy-home-advantage-2701417-2025-03-30",
      "headline": "KKR coach responds to pitch controversy: We expect some home advantageIPL 2025: Chandrakant Pandit downplayed pitch controversy, asserting KKR's readiness to adapt to any conditions while expecting fair home advantage like other IPL teams. KKR take on Mumbai Indians on March 31, as they look to build some winning momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-mitchell-starc-five-wickets-2701408-2025-03-30",
      "headline": "Starc drops fast bowler's ego, runs through SRH to close perfect Vizag chapterMitchell Starc ran through the SRH batting order on Sunday, March 29. After picking his maiden 5-wicket haul in T20s, Starc said that he has had to snub his fast bowler's ego in the recent past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-playing-xi-big-changes-deepak-hooda-vijay-shankar-2701393-2025-03-30",
      "headline": "IPL 2025: CSK make big changes vs RR after disastrous loss to RCBDesperate to recover from their loss to Royal Challengers Bengaluru, Chennai  Super Kings made two big changes to their playing XI against an unchanged Rajasthan Royals for their Guwahati clash on March 30.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-score-mitchell-starc-faf-du-plessis-vizag-2701387-2025-03-30",
      "headline": "Mitchell Starc haunts SRH once again as DC flaunt title aspirationsIPL 2025, DC vs SRH: Delhi Capitals came up with an all-round performance to hammer SunRIsers Hyderabad by 7 wickets in Vizag on Sunday, March 30. Mitchell Starc's five-wicket haul and Faf du Plessis's quick-fire 50 helped SRH win with four overs to spare, chasing 164 without breaking a sweat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-mi-chandrkant-pandit-pitch-controversy-home-advantage-2701417-2025-03-30",
      "headline": "KKR coach responds to pitch controversy: We expect some home advantageIPL 2025: Chandrakant Pandit downplayed pitch controversy, asserting KKR's readiness to adapt to any conditions while expecting fair home advantage like other IPL teams. KKR take on Mumbai Indians on March 31, as they look to build some winning momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-mitchell-starc-five-wickets-2701408-2025-03-30",
      "headline": "Starc drops fast bowler's ego, runs through SRH to close perfect Vizag chapterMitchell Starc ran through the SRH batting order on Sunday, March 29. After picking his maiden 5-wicket haul in T20s, Starc said that he has had to snub his fast bowler's ego in the recent past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-playing-xi-big-changes-deepak-hooda-vijay-shankar-2701393-2025-03-30",
      "headline": "IPL 2025: CSK make big changes vs RR after disastrous loss to RCBDesperate to recover from their loss to Royal Challengers Bengaluru, Chennai  Super Kings made two big changes to their playing XI against an unchanged Rajasthan Royals for their Guwahati clash on March 30.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-score-mitchell-starc-faf-du-plessis-vizag-2701387-2025-03-30",
      "headline": "Mitchell Starc haunts SRH once again as DC flaunt title aspirationsIPL 2025, DC vs SRH: Delhi Capitals came up with an all-round performance to hammer SunRIsers Hyderabad by 7 wickets in Vizag on Sunday, March 30. Mitchell Starc's five-wicket haul and Faf du Plessis's quick-fire 50 helped SRH win with four overs to spare, chasing 164 without breaking a sweat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-mitchell-starc-vizag-bowling-figures-2701383-2025-03-30",
      "headline": "DC vs SRH: Mitchell Starc rocks Sunrisers Hyderabad with maiden T20 5-wicket haulIPL 2025, DC vs SRH: Delhi Capitals' fast bowler Mitchell Starc finished with figures of 3.4-0-35-5 against Sunrisers Hyderabad on Sunday as he recorded his best figures in T20s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-blackmail-hyderabad-cricket-association-free-tickets-letter-2701378-2025-03-30",
      "headline": "SRH threaten to leave Hyderabad over blackmail for free IPL tickets: ReportIPL 2025: SunRisers Hyderabad have reportedly threatened to move their home base from Hyderabad after alleging blackmail from Hyderabad Cricket Association over free tickets. A VIP box was locked after SRH refused to give out extra complementary passes during their home game against Lucknow Super Giants on March 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rr-vs-csk-live-score-ipl-match-today-updates-guwahati-ms-dhoni-2701376-2025-03-30",
      "headline": "RR vs CSK Highlights: RR defeat CSK by 6 runs in Guwahati thrillerRajasthan Royals (RR) vs Chennai Super Kings (CSK) Highlights, IPL 2025: Chennai Super Kings suffered their second straight defeat with a 6-run loss to Rajasthan Royals, which could not have been prevented even with MS Dhoni coming in at number 7 in their 183 chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-jake-fraser-mcgurk-catch-aniket-verma-2701354-2025-03-30",
      "headline": "Catch of IPL 2025? Jake Fraser-McGurk special dismisses Aniket Verma in DC vs SRHJake Fraser-McGurk picked up one of the best catches of IPL this season, dismissing Aniket Verma in DC vs SRH. JFM's catch came against the run of play when Aniket Verma was hitting big sixes against the DC bowlers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-dc-aniket-verma-fans-reactions-2701350-2025-03-30",
      "headline": "New star is here: Aniket Verma wows fans with sparking 74 vs DCIPL 2025, DC vs SRH: Aniket Verma smashed five fours and six sixes as the right-handed batter scored 74 runs off 41 balls against Delhi Capitals on March 30 at the Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket Stadium in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-aniket-verma-sunrisers-hyderabad-v-delhi-capitals-2701347-2025-03-30",
      "headline": "Who is Aniket Verma? Jhansi batter is new spin destroyer of SRHSunerisers Hyderabad found a new spin destroyer in their side in Jhansi born 23-year-old Aniket Verma, who put on a blistering show in the side's IPL 2025 clash against Delhi   Capitals on March 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-mitchell-starc-record-vs-travis-head-2701332-2025-03-30",
      "headline": "Mitchell Starc's bunny: Travis Head gets out for the 6th time in 8 matchesMitchell Starc once again ripped into the SRH line-up on Sunday, March 30. Starc dismissed Travis Head for the 6th time in top level cricket. Due to Starc's spell, SRH were reduced to 37/4 in the 5th over.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-zeeshan-ansari-debut-vizag-2701321-2025-03-30",
      "headline": "Who is Zeeshan Ansari? Lucknow leg-spinner makes debut for SRH against DCSunrisers Hyderabad has handed a debut for Zeeshan Ansari against Delhi Capitals on Sunday, March 30. Here's all you need to know about the Lucknow leg-spinner who is set to make a big impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-live-score-today-match-sunrisers-delhi-vizag-2701297-2025-03-30",
      "headline": "DC vs SRH Highlights: Delhi decimate Hyderabad by 7 wicketsIPL 2025, DC (Delhi) and SRH (Hyderabad)Highlights: Delhi Capitals clinched a dominating win over a clueless Sunrisers Hyderabad by 7 wickets in Visakhapatnam, and the Pat Cummin-led side has a lot to recover from after back-to-back defeats. After the bowling brilliance of Mitchell Starc's five-wicket haul, Faf du Plessis put them in cruise control of their 164-run chase with his fifty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-2025-full-schedule-odi-t20i-womens-tests-2701294-2025-03-30",
      "headline": "India to play 3 ODIs, 5 T20Is in Australia in October-November: Full scheduleIndia tour of Australia 2025-26: India men's team will play three ODIs and five T20Is in October-November in Australia. The women's team will play 3 T20Is, as many ODIs and a one-off Test in February-March 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-form-sanjay-manjrekar-mumbai-indians-2701292-2025-03-30",
      "headline": "He is not the Rohit Sharma of 4 years ago, things are slipping: Sanjay ManjrekarIPL 2025: Former India batter Sanjay Manjrekar said Rohit Sharma needs to put in extra efforts to regain form in the Indian Premier League. Rohit has managed just eight runs from two matches for Mumbai Indians. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}