{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-9705-minors-sign-up-on-day-1-how-to-open-account-online-offline-documents-2603579-2024-09-20",
      "headline": "NPS Vatsalya: 9,705 minors sign up on Day 1. Here's how to invest for your child?The scheme, overseen by the Pension Fund Regulatory and Development Authority (PFRDA), is part of the National Pension System (NPS) and aims to help parents and guardians begin retirement savings for their children from an early age"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-scans-paytm-qr-at-vishwakarma-exhibition-highlights-fintechs-role-for-small-merchants-2603537-2024-09-20",
      "headline": "PM Modi scans Paytm QR at Vishwakarma exhibition, highlights fintech's role for small merchantsPM Modi bought an artefact of Bhagwan Jagannath and paid via Paytm QR, showcasing not only the significance of the crafts but also the role of fintech in empowering small merchants and fostering increased trust in mobile payments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/study-shows-people-us-need-to-work-5-days-to-buy-iphone-16-how-long-do-indians-need-2603531-2024-09-20",
      "headline": "Study shows people in US work 5 days to buy iPhone 16; how long do Indians need?A recent study reveals how long people in different countries need to work in order to afford the iPhone 16, with citizens in Switzerland requiring the least number of days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-work-no-pay-termination-samsung-warns-workers-on-strike-in-chennai-report-2603462-2024-09-20",
      "headline": "No work, no pay: Samsung warns workers on strike in Chennai The strike, which began on September 9, 2024, involves hundreds of workers at Samsung's home appliances factory near Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1400-points-higher-nifty-above-25800-icici-bank-jumps-5-2603442-2024-09-20",
      "headline": "Sensex ends 1,400 points higher, Nifty above 25,800; ICICI Bank jumps 5%At the closing bell, the S&P BSE Sensex was up 1,381.99 points to 84,566.79, while the NSE Nifty50 gained 375.15 points to settle at 25,790.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-shares-reason-behind-his-one-day-exit-from-ey-rs-1-crore-package-check-here-2603418-2024-09-20",
      "headline": "Ashneer Grover shares why he quit EY in a day despite Rs 1 crore salaryIn an old video, Grover shares why he left Ernst & Young (EY) on his very first day despite being offered a Rs 1 crore salary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-vodafone-idea-shares-after-20-percent-fall-ubs-nomura-novuma-new-target-price-2603391-2024-09-20",
      "headline": "Should you buy Vodafone Idea shares after 20% fall? UBS shares new target priceVodafone Idea shares fell 20% after the Supreme Court on Thursday dismissed the company's curative petition, which sought a re-computation of Adjusted Gross Revenue (AGR) dues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-iifl-finance-shares-surged-13-percent-today-2603356-2024-09-20",
      "headline": "Explained: Why IIFL Finance shares surged 13% todayIIFL Finance stock climbed to a high of Rs 560.60, marking its peak since late February, before settling to trade 9.31% higher as of 2:06 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-shares-jump-10-percent-today-ftse-all-world-index-inclusion-2603280-2024-09-20",
      "headline": "Explained: Why Cochin Shipyard shares soared 10% todayAt around 12:25 pm, shares of the company were up 9.45% at Rs 1,837.30 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2603255-2024-09-20",
      "headline": " Western Carriers IPO allotment: Step-by-step guide to check statusWestern Carriers IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-16-in-10-minutes-quick-commerce-blinkit-steals-spotlight-from-e-commerce-giants-2603215-2024-09-20",
      "headline": "iPhone 16 in 10 minutes: Quick commerce firms bring fight to Amazon, FlipkartiPhone 16 sales: Quick commerce platforms like Blinkit, BigBasket and Zepto have started delivering the latest iPhone 16 in minutes, challenging traditional e-commerce giants Amazon and Flipkart.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-all-time-high-sensex-84000-nifty-sharp-rise-us-fed-rate-cut-small-and-midcap-stocks-2603213-2024-09-20",
      "headline": "Sensex jumps over 1,276 points to cross 84,400, Nifty nears 25,800The S&P BSE Sensex was up 1275.45 points to 84,460.25 at 12:49 pm, while the NSE Nifty50 gained 368.70 points to trade at 25,784.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-ipo-allotment-latest-gmp-step-by-step-guide-to-check-status-2603206-2024-09-20",
      "headline": "Northern Arc IPO allotment: Latest GMP, step-by-step guide to check statusNorthern Arc IPO allotment: To check their share allocation, investors should visit the IPO registrar's portal or the BSE and NSE websites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rites-share-price-up-over-7-percent-railway-psu-stock-ex-bonus-dividend-2603180-2024-09-20",
      "headline": "RITES shares rise 8% but why railway PSU stock may be showing 48% slideDespite this positive momentum, many investors were caught off guard, seeing what appeared to be a 48% slide in the stock price on their trading apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-intern-to-ceo-elliott-hill-32-year-journey-at-nike-linkendin-profile-goes-viral-2603178-2024-09-20",
      "headline": "Elliott Hill's 32-year journey at Nike from intern to CEO goes viralElliott Hill, who has spent over 32 years at Nike, started his journey as an intern and will now be leading the iconic company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-surges-500-points-nifty-gains-momentum-rites-jumps-over-7-2603164-2024-09-20",
      "headline": "Sensex surges 500 points, Nifty gains momentum; JSW Steel jumps 3%The S&P BSE Sensex was up 415.45 points at 83,600.25 at 10:16 am, while the NSE Nifty50 gained 135.80 points to trade at 25,550.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-ipo-allotment-check-status-latest-subscription-gmp-listing-gains-2603115-2024-09-20",
      "headline": "Arkade Developers IPO allotment: Check status, GMP, subscription Arkade Developers IPO allotment: Investors can check their allotment status by logging into the BSE website or the Bigshare Services Pvt Ltd website, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-allotment-tomorrow-check-latest-subscription-listing-gain-gmp-2602821-2024-09-19",
      "headline": "Northern Arc Capital IPO allotment tomorrow: Check latest subscription, GMPNorthern Arc Capital Limited, founded in 2009, provides retail loans to underserved households and businesses across India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-after-us-feds-50-bps-rate-cut-ntpc-gains-2602758-2024-09-19",
      "headline": "Sensex, Nifty end higher after US Fed's 50 bps rate cut; NTPC gainsThe S&P BSE Sensex ended 236.57 points higher at 83,184.80, while the NSE Nifty50 settled 38.25 points higher at 25,415.80. Both the indices had hit fresh all-time highs in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-takes-oath-new-delhi-cm-arvind-kejriwal-aap-manish-sisodia-2604042-2024-09-21",
      "headline": "AAP's Atishi takes oath as Delhi Chief Minister, replaces Arvind KejriwalAAP's Atishi takes oath as Delhi Chief Minister, replaces Arvind Kejriwal"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-remarks-sikhs-bjp-indians-practice-their-religion-congress-2604029-2024-09-21",
      "headline": "Rahul Gandhi breaks silence on his Sikh remark in US: BJP spreading liesDays after receiving criticism from BJP leaders over his comments on Sikhs in the US, Congress MP Rahul Gandhi said that the BJP has been spreading lies about his remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tirupati-laddoo-animal-fat-row-ayodhya-ram-temple-pran-pratishtha-2603906-2024-09-21",
      "headline": "Tirupati laddoos were distributed during Ram temple event, says chief priestTirupati laddoos row: Ram Temple chief priest Acharya Satyendra Das has said that laddoos from Tirupati temple were distributed as prasadam during the pran prathistha January ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-us-visit-president-joe-biden-quad-leaders-summit-2603793-2024-09-21",
      "headline": "PM's 3-day US visit begins today, to participate in Biden-hosted QuadThe fourth Quad Leaders' Summit will be hosted by President Joe Biden in his hometown of Wilmington in Delaware. The next Quad Summit will be hosted by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/decoding-the-fatigue-of-action-and-violence-in-indian-cinema-kill-thiruchitrambalam-bade-miyan-chote-miyan-leo-jailer-cinematic-saturday-2602727-2024-09-21",
      "headline": "Audiences have had enough, action movies need an intervalAction and violent films have been on the rise in Indian cinema in the last couple of years. However, not many action films have seen box office success in 2024. Is there an action-film fatigue among the audience?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-oath-ceremony-live-updates-aap-arvind-kejriwal-delhi-lieutenant-governor-raj-bhawan-2603974-2024-09-21",
      "headline": "Saurabh Bhardwaj, Gopai Rai take oath to join Delhi Chief Minister's CabinetDelhi CM Atishi Oath Ceremony: Aam Aadmi Party (AAP) leader Atishi will take oath as the new Chief Minister of Delhi today at 4.30 pm along with her council of ministers at Raj Niwas. According to sources, the oath-taking ceremony will be a low-key affair as the mood in the party is not upbeat because of Arvind Kejriwal's resignation and also because of the delay in approvals, leaving little time for preparations. The new council of ministers announced by the AAP would include Gopal Rai, Kailash Gahlot, Saurabh Bharadwaj, Imran Hussain and new entrant Mukesh Ahlawat. The tenure of the Atishi government will be brief as assembly polls in Delhi are due in February next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/kourtney-kardashian-has-a-natural-ozempic-for-weight-loss-is-it-a-scam-2602790-2024-09-21",
      "headline": "Kourtney Kardashian has a 'natural Ozempic' for weight loss. Is it a scam?Ozempic is a medication for Type 2 diabetes that helps control blood sugar, with the added side effect of weight loss. Socialite and reality TV personality Kourtney Kardashian has a natural alternative to Ozempic that she is going gaga over. What do doctors have to say?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-hilariously-sets-field-for-bangladesh-ind-vs-ban-chennai-test-2603895-2024-09-21",
      "headline": "Watch: Rishabh Pant hilariously helps Bangladesh to set field on Day 3 of 1st TestStar India batter Rishabh Pant was seen hilariously setting the field for Bangladesh on Day 3 of the first Test at MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tirupati-laddoos-row-animal-fat-amul-files-complaint-social-media-users-2603984-2024-09-21",
      "headline": "Amul files complaint against X users for linking it to Tirupati laddoos row Amul has lodged a complaint with the Ahmedabad Cyber Crime Police Station against false claims made on social media, alleging that the company supplied the ghee used in the Tirupati temple's laddoos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/student-films-women-bengaluru-college-bathroom-threatens-kill-exposed-arrested-2603915-2024-09-21",
      "headline": "Student films women in Bengaluru college bathroom, threatens to kill if exposedHundreds of students, including men and women, protested at the college campus after the incident came to light. Visuals showed police trying to pacify the protesting students. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-marshal-amar-preet-singh-new-air-force-chief-to-take-charge-from-september-30-2603960-2024-09-21",
      "headline": "Air Marshal Amar Preet Singh to take over as new Air Force chief from September 30The government has appointed Air Marshal Amar Preet Singh, currently serving as the Vice Chief of the Air Staff, to be the next Chief of the Air Staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/edelweiss-ceo-radhika-gupta-shark-tank-airlines-flight-breakfast-menu-2603971-2024-09-21",
      "headline": "Spare us the sandwich: Edelweiss CEO's request to airlines on breakfast menuEdelweiss CEO Radhika Gupta has asked airlines to end boxed food items like sandwiches and include healthier and tastier dishes like parathas, idlis, and dhoklas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-pager-blasts-lebanon-israel-businessman-kerela-india-hungary-norway-rinson-hose-bulgaria-2603617-2024-09-20",
      "headline": "Why Kerala-born businessman's name has come up in Hezbollah pager blasts?As the focus shifts to companies linked to the exploding pagers being used by Hezbollah members, the name of a Kerala-born businessman, Rinson Jose, and his Bulgaria-based company Norta Global cropped up. They have been given a clean chit by Bulgarian authorities. However, the entire saga points to a complex web of companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/noida-woman-thrown-onto-elevated-road-pillar-after-being-hit-by-vehicle-in-sector-25-2603977-2024-09-21",
      "headline": "Woman thrown onto elevated road pillar after being hit by vehicle in NoidaA woman riding a two-wheeler in Sector 25 was hit by an unidentified vehicle, leading to her being thrown onto a road pillar. Two men were seen attempting to rescue her.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/polar-bear-iceland-police-shoot-dead-2603828-2024-09-21",
      "headline": "Rare polar bear shows up outside woman's house in Iceland, cops shoot it deadThe bear was killed Thursday afternoon in the northwest of Iceland after police consulted the Environment Agency, which declined to have the animal relocated, police told Associated Press."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-drunk-driver-goes-on-rampage-in-lucknow-chased-down-by-locals-2603928-2024-09-21",
      "headline": "'Drunk' driver goes on rampage in Lucknow, chased down by localsThe Lucknow Police arrested a man after he rammed his car into several people in the city's Rumi Gate area allegedly under the influence of alcohol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-422-21-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-ernst-and-young-pune-woman-death-parliament-workplace-2603825-2024-09-21",
      "headline": "Fixed calendar for workplaces: Shashi Tharoor speaks to EY worker's fatherShashi Tharoor said he would propose legislation in Parliament for a fixed calendar to regulate working hours across all workplaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-war-lebanon-explosive-pagers-bac-gold-apollo-2603838-2024-09-21",
      "headline": "Globetrotting career, PhD in Physics: Woman linked to Lebanon pager blastsAfter her company was revealed to have licensed the design for the pagers from their original Taiwanese manufacturer Gold Apollo, Cristiana Barsony-Arcidiacono said that she didn't make them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-rohit-saraf-past-zero-calories-appreciation-post-2603900-2024-09-21",
      "headline": "Janhvi Kapoor treats Rohit Saraf with 'zero Kcal' pastaJanhvi Kapoor treated her co-star Rohit Saraf to a guilt-free pasta dish with zero calories. The two are set to star in the film Sunny Sanskari Ki Tulsi Kumari. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-embassy-official-found-dead-under-mysterious-circumstances-in-washington-2603857-2024-09-21",
      "headline": "Indian embassy official found dead under mysterious circumstances in USIn a statement, the Indian Embassy said that an official died on September 18 and his family members had been informed to ensure swift transfer of the body to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cancer-moonshot-on-agenda-during-pm-modis-us-visit-quad-summit-india-2603501-2024-09-21",
      "headline": "Cancer Moonshot on agenda during PM Modi's US visit: What is it?Prime Minister Narendra Modi will attend the annual Quad summit with leaders from Australia, Japan and the United States in Delaware, US to discuss various global issues including Joe Biden's Cancer Moonshot Initiative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-parvin-dabas-in-icu-after-road-accident-2603863-2024-09-21",
      "headline": "Actor Parvin Dabas in ICU after road accident. DetailsBollywood actor Parvin Dabas met with a car accident early Saturday, September 21, and is currently in the ICU. His wife, Preity Jhangiani, is by his side. Details of the incident are still emerging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/kareena-kapoor-khan-karisma-kapoor-to-come-together-on-the-great-indian-kapil-sharma-show-2604032-2024-09-21",
      "headline": "Exclusive: Karisma and Kareena to come together on Kapil Sharma showActors Kareena Kapoor Khan and Karisma Kapoor are set to appear together on The Great Indian Kapil Sharma Show. They have already filmed an episode for the show on September 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-turns-44-akshay-kumar-to-vijay-varma-celebs-extend-birthday-wishes-2603990-2024-09-21",
      "headline": "Kareena Kapoor turns 44: Akshay Kumar to Vijay Varma, celebs extend birthday wishes Bollywood actor Kareena Kapoor Khan is celebrating her 44th birthday today, September 21. On the occasion, actors Akshay Kumar, Vijay Varma, Rakul Preet Singh, Soha Ali Khan and others shared heartfelt wishes for her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/the-legend-of-maula-jatt-fawad-khan-mahira-khan-film-to-only-release-in-punjab-in-india-2603996-2024-09-21",
      "headline": "The Legend of Maula Jatt: Fawad-Mahira's film to only release in Punjab in IndiaFawad Khan and Mahira Khan's Pakistani film The Legend of Maula Jatt will only be released in Punjab, not all across India. A Karachi-based film producer and distributor confirmed the news in an exclusive interview with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shibani-dandekar-on-battling-love-jihad-trolls-after-marrying-farhan-akhtar-being-called-gold-digger-2603983-2024-09-21",
      "headline": "Shibani Dandekar on battling 'love jihad' trolls after marrying Farhan Akhtar Shibani Dandekar, who married actor Farhan Akhtar in 2022, recalled being trolled for being with a Muslim man. On a podcast recently, she spoke about being labelled a 'gold-digger' and being attacked with 'love-jihad' comments on her social media posts. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faheem-ashraf-umpiring-champions-cup-viral-video-2604030-2024-09-21",
      "headline": "Faheem Ashraf exposes umpiring standards in Pakistan: 'Friends get saved'Pakistan all-rounder Faheem Ashraf has slammed the umpiring standards in domestic cricket. In an interview that has gone viral on social media. Faheem can be seen pleading with the PCB to fix this issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-afg-vs-sa-afghanistan-cricket-rahmanullah-gurbaz-2604027-2024-09-21",
      "headline": "Rashid Khan fought hamstring injury in historic series win spell vs South AfricaAfghanistan wrist spinner Rashid Khan revealed that he fought through a hamstring injury during his match-winning spell in the second ODI vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-2nd-odi-rashid-khan-rahmanullah-gurbaz-timeline-2604026-2024-09-21",
      "headline": "Rise of Afghanistan cricket since 2023 - A historic timeline AFG vs SA: Afghanistan beat South Africa by 177 runs in the second ODI on Friday at the Sharjah Cricket Stadium to take a 2-0 lead in the three-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-iqbal-in-awe-of-shubman-gills-calmness-enroute-his-hundred-vs-bangladesh-2604023-2024-09-21",
      "headline": "Tamim Iqbal in awe of Shubman Gill's calmness enroute his hundred vs BangladeshTamim Iqbal hails Shubman Gill's calmness en route his hundred vs Bangladesh in the 1st Test match in Chennai. Gill notched up his 5th Test hundred as he scored 119 runs from 176 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-yashasvi-jaiswal-picks-a-one-handed-blinder-in-gully-to-dismiss-opener-zakir-hasan-2604010-2024-09-21",
      "headline": "Watch: Jaiswal, Gill pick stunning blinders to dismiss Bangladesh openersYashasvi Jaiswal and Shubman Gill picked up stunning catches to dismiss both the Bangladesh openers. After a strong and defiant start, Bangladesh lost two wickets in quick succession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-arsenal-preview-head-to-head-livestreaming-details-team-news-2604004-2024-09-21",
      "headline": "Premier League, Manchester City vs Arsenal: Head-to-Head, all you need to knowManchester City and Arsenal are all set to lock horns in what promises to be an exciting clash at the Etithad stadium on Sunday, September 22. Both teams are unbeaten so far in the Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ind-vs-ban-chennai-test-ms-dhoni-adam-gilchrist-2603995-2024-09-21",
      "headline": "Rishabh Pant will hit most Test hundreds as wicketkeeper batter in history: Tamim IqbalBangladesh cricketer Tamim Iqbal has predicted Rishabh Pant to score the most hundreds by a wicketkeeper in his Test career. Pant scored his sixth century on Day 3 of the first Test against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kalikesh-singh-deo-elected-national-rifle-association-of-india-president-2603985-2024-09-21",
      "headline": "Kalikesh Singh Deo elected National Rifle Association of India presidentKalikesh Narayan Singh Deo was elected the president of the National Rifle Association of India (NRAI), defeating VK Dhall. He will serve until 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-ravi-shastri-wants-kl-rahul-to-realise-his-ultimate-talent-2603979-2024-09-21",
      "headline": "IND vs BAN: Ravi Shastri wants KL Rahul to realise his ultimate talent Ravi Shastri during the on-air commentary expressed his desire to see KL Rahul utilise and realise his ultimate talent. Rahul's place in the Test side was questioned after his early dismissal in 1st innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-three-shubman-gill-hundred-father-applauds-video-2603970-2024-09-21",
      "headline": "Watch: Shubman Gill's father all smiles as batter scores 5th Test hundredShubman Gill's father was all smiles as the star batter scored his 5th Test hundred on Saturday, September 21. Gill continued his fine second innings form with his hundred at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-vs-arsenal-preview-head-to-head-livestreaming-details-team-news-2604004-2024-09-21",
      "headline": "Premier League, Manchester City vs Arsenal: Head-to-Head, all you need to knowManchester City and Arsenal are all set to lock horns in what promises to be an exciting clash at the Etithad stadium on Sunday, September 22. Both teams are unbeaten so far in the Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ind-vs-ban-chennai-test-ms-dhoni-adam-gilchrist-2603995-2024-09-21",
      "headline": "Rishabh Pant will hit most Test hundreds as wicketkeeper batter in history: Tamim IqbalBangladesh cricketer Tamim Iqbal has predicted Rishabh Pant to score the most hundreds by a wicketkeeper in his Test career. Pant scored his sixth century on Day 3 of the first Test against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kalikesh-singh-deo-elected-national-rifle-association-of-india-president-2603985-2024-09-21",
      "headline": "Kalikesh Singh Deo elected National Rifle Association of India presidentKalikesh Narayan Singh Deo was elected the president of the National Rifle Association of India (NRAI), defeating VK Dhall. He will serve until 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-ravi-shastri-wants-kl-rahul-to-realise-his-ultimate-talent-2603979-2024-09-21",
      "headline": "IND vs BAN: Ravi Shastri wants KL Rahul to realise his ultimate talent Ravi Shastri during the on-air commentary expressed his desire to see KL Rahul utilise and realise his ultimate talent. Rahul's place in the Test side was questioned after his early dismissal in 1st innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-three-shubman-gill-hundred-father-applauds-video-2603970-2024-09-21",
      "headline": "Watch: Shubman Gill's father all smiles as batter scores 5th Test hundredShubman Gill's father was all smiles as the star batter scored his 5th Test hundred on Saturday, September 21. Gill continued his fine second innings form with his hundred at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-trains-hard-in-chepauk-nets-after-failure-in-1st-test-2603969-2024-09-21",
      "headline": "Watch: Virat Kohli trains hard in Chepauk nets after failure in 1st TestVirat Kohli wasted no time as he jumped back to training in the nets during the ongoing Test between India and Bangladesh at the MA Chidambaram Stadium. Kohli was dismissed for scores of six and 17 in the 1st Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-leads-chepauks-rousing-applause-as-pant-scores-test-comeback-ton-2603955-2024-09-21",
      "headline": "Virat Kohli leads Chepauk's rousing applause as Pant scores Test comeback tonVirat Kohli led Chepauk's rousing applause as Rishabh Pant scored a spectacular hundred on his return to Test cricket. Pant scored 109 runs from 128 deliveries against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ind-vs-ban-shubman-gill-chennai-test-2603949-2024-09-21",
      "headline": "Rishabh Pant's comeback hundred leaves fans in frenzy: 'Test Cricket missed you' India wicketkeeper batter Rishabh Pant scored a magnificent hundred on his comeback to Test cricket after over 20 months during Day 3 of the first Test against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-shubman-gill-hundred-2nd-innings-chennai-2603936-2024-09-21",
      "headline": "Chennai Test: 2nd innings expert Shubman Gill silences critics with 5th hundredSecond innings expert Shubman Gill silenced his doubters as he scored his 6th Test hundred on Saturday, September 21. Gill got to the landmark in 161 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-questions-injured-shakibs-inclusion-bangladesh-playing-with-4-bowlers-2603927-2024-09-21",
      "headline": "Tamim questions injured Shakib's inclusion: Bangladesh playing with 4 bowlersTamim Iqbal questioned Shakib Al Hasan's inclusion in Bangladesh's playing XI after he learnt that the veteran all-rounder suffered an injury to his shoulder and was recovering from finger surgery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-test-hundred-chennai-ms-dhoni-record-2603921-2024-09-21",
      "headline": "Rishabh Pant equals MS Dhoni's record with 6th Test hundredIndia vs Bangladesh, Chennai Test: Rishabh Pant celebrated his Test comeback with his sixth Test hundred in the second innings of the first Test. Pant equaled MS Dhoni's record of most Test hundreds by an Indian wicketkeeper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-rishabh-pant-six-hasan-mahmud-virat-kohli-chennai-2603907-2024-09-21",
      "headline": "Rishabh Pant's audacious six off Hasan Mahmud leaves Virat Kohli stunnedVirat Kohli was left stunned as Rishabh Pant pulled off an audacious six off Hasan Mahumd on Day 3 of the Chennai Test. Pant was back to his vintage best as India piled on the misery on Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-hilariously-sets-field-for-bangladesh-ind-vs-ban-chennai-test-2603895-2024-09-21",
      "headline": "Watch: Rishabh Pant hilariously helps Bangladesh to set field on Day 3 of 1st TestStar India batter Rishabh Pant was seen hilariously setting the field for Bangladesh on Day 3 of the first Test at MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-questions-injured-shakibs-inclusion-bangladesh-playing-with-4-bowlers-2603927-2024-09-21",
      "headline": "Tamim questions injured Shakib's inclusion: Bangladesh playing with 4 bowlersTamim Iqbal questioned Shakib Al Hasan's inclusion in Bangladesh's playing XI after he learnt that the veteran all-rounder suffered an injury to his shoulder and was recovering from finger surgery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-test-hundred-chennai-ms-dhoni-record-2603921-2024-09-21",
      "headline": "Rishabh Pant equals MS Dhoni's record with 6th Test hundredIndia vs Bangladesh, Chennai Test: Rishabh Pant celebrated his Test comeback with his sixth Test hundred in the second innings of the first Test. Pant equaled MS Dhoni's record of most Test hundreds by an Indian wicketkeeper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-rishabh-pant-six-hasan-mahmud-virat-kohli-chennai-2603907-2024-09-21",
      "headline": "Rishabh Pant's audacious six off Hasan Mahmud leaves Virat Kohli stunnedVirat Kohli was left stunned as Rishabh Pant pulled off an audacious six off Hasan Mahumd on Day 3 of the Chennai Test. Pant was back to his vintage best as India piled on the misery on Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-hilariously-sets-field-for-bangladesh-ind-vs-ban-chennai-test-2603895-2024-09-21",
      "headline": "Watch: Rishabh Pant hilariously helps Bangladesh to set field on Day 3 of 1st TestStar India batter Rishabh Pant was seen hilariously setting the field for Bangladesh on Day 3 of the first Test at MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-test-fifty-chennai-2603891-2024-09-21",
      "headline": "Rishabh Pant celebrates his Test comeback with superb 2nd-innings fiftyIndia vs Bangladesh: Rishabh Pant celebrated his Test comeback with a superb fifty in the second innings of the first Test against Bangladesh in Chennai. This was Pant's first Test fifty since December 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-first-test-rest-day-presidential-elections-galle-2603883-2024-09-21",
      "headline": "Sri Lanka vs New Zealand: Why does Galle Test have a rest day on Saturday?The Sri Lanka vs New Zealand first Test in Galle had a first since 2008 as the match will have a rest day on September 21, Saturday. Here's the reason why the teams will take a rest on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-virat-kohli-ind-vs-ban-india-vs-bangladesh-2603867-2024-09-21",
      "headline": "Ravi Shastri's advice to struggling Virat Kohli: 'You've got to move with time'Former India cricketer and head coach Ravi Shastri has advised Virat Kohli to change his game plan while facing spinners after his dismissal in the second innings of the first Test against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-becomes-oldest-bangladeshi-to-play-test-cricket-2603864-2024-09-21",
      "headline": "Shakib Al Hasan becomes oldest Bangladesh player to play Test cricketIndia vs Bangladesh, Chennai Test: Shakib Al Hasan, at 37 years and 181 days, becomes the oldest Bangladeshi cricketer to play a Test match, breaking Mohammad Rafique's record. Shakib achieved this milestone during Bangladesh's first Test against India in Chennai."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}