{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/confident-of-good-outcome-under-pm-modi-hardeep-singh-puri-on-us-india-trade-talks-2788247-2025-09-16",
      "headline": "Confident of good outcome under PM Modi: Hardeep Puri on US-India trade talksAs US-India trade talks resumed with the arrival of the US chief negotiator in India, Union Minister for Petroleum and Natural Gas, Hardeep Singh Puri expressed confidence of a good outcome under PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-resume-with-india-first-focus-says-hardeep-singh-puri-2788262-2025-09-16",
      "headline": "India–US trade talks resume with 'India First' focus, says Hardeep Singh PuriAs fresh trade talks begin between India and the US, Union Minister Hardeep Singh Puri, in an exclusive interview with India Today said the government will prioritise national interests, with farmers and MSMEs at the heart of its strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-will-us-india-trade-talk-impact-markets-ahead-nse-bse-sensex-nifty-modi-trump-2788261-2025-09-16",
      "headline": "How will US-India trade talk impact markets ahead?Experts said that any progress in the India-US trade deal is likely to trigger short covering on Dalal Street and the market is also looking forward to pent-up consumer demand from Navaratri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodhas-nithin-kamath-flags-regulatory-risk-for-weekly-options-2788205-2025-09-16",
      "headline": "Zerodha's Nithin Kamath flags regulatory risk for weekly optionsWeekly options in India are under scrutiny, and Zerodha CEO Nithin Kamath has warned about the mounting regulatory risks that could reshape trading in these short-term derivatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-595-points-nifty-above-25200-kotak-bank-gains-3-percent-2788193-2025-09-16",
      "headline": "Sensex jumps 595 points, Nifty above 25,200; Kotak Bank gains 3%The S&P BSE Sensex gained 594.95 points to close at 82,380.69 points, while the NSE Nifty50 added 169.90 points to end at 25,239.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/apollo-tyres-shares-jump-2-percent-reason-bcci-new-sponsor-team-india-2788188-2025-09-16",
      "headline": "Apollo Tyres shares jump 2% after it's named India cricket team jersey sponsorApollo Tyres shares jumped to the day's high of Rs 490.80 after opening at Rs 479.45. Apollo Tyres shares closed at Rs 486.80, up 1.56% after the news. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-rs-25000-salary-fund-both-your-home-and-car-2788098-2025-09-16",
      "headline": "Can a Rs 25,000 salary fund both your home and car?Think a Rs 25,000 salary can't get you a house and a car? Think again. With the right strategy and disciplined savings, even modest paychecks can turn into big dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-gst-overhaul-mother-dairy-slashes-product-prices-milk-cheaper-by-rs-2-2788112-2025-09-16",
      "headline": "Mother Dairy slashes ghee, butter prices, tetra-pack milk cheaper by Rs 2Mother Dairy announced a cut in prices across its portfolio of dairy and processed foods, saying it is passing on the benefits of the government's GST 2.0 reforms directly to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-listing-september-17-bse-nse-strong-subscription-expected-gains-gmp-2788093-2025-09-16",
      "headline": "Urban Company to debut on BSE, NSE: What investors can expect on listing dayUrban Company is set to list on the BSE and NSE on September 17, 2025 after its IPO was subscribed nearly 109 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-trump-blinks-cheese-corn-agriculture-dairy-sectors-2788074-2025-09-16",
      "headline": "Say cheese: Trump blinks on trade as talks resume with IndiaIndia-US trade negotiations have resumed, weeks after Trump imposed steep 50% tariffs last month. The US, now, doesn't want sweeping access to India's agricultural and dairy markets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-portal-still-facing-glitches-is-1-day-extension-enough-for-taxpayers-2788012-2025-09-16",
      "headline": "1-day ITR extension: Is it enough for taxpayers?Filing income tax returns turned into a nightmare this year, as taxpayers battled login errors, frozen screens and missed payments. Now, with just a one-day extension, many are asking, is that really enough?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-family-rs-55000-national-insurance-mdindia-rejected-claim-denied-series-2787789-2025-09-16",
      "headline": "System is tainted: Delhi family's 6-year fight over Rs 55,000 insurance claimIn this week's story, part of our ongoing series' Claim Denied,' we tell the story of a Delhi family whose insurance claim was denied and whose battle is still ongoing after six years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-top-buys-defence-infra-best-bets-govt-spending-it-shares-2787985-2025-09-16",
      "headline": "Want to invest in stock market? Defence and infra may be your best betsExperts highlighted the current opportunities in the market and suggested which sectors could perform well in the coming months."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-us-crucial-trade-talks-begin-after-donald-trumps-50-tariff-move-2787911-2025-09-16",
      "headline": "India-US crucial trade talks begin after Donald Trump's 50% tariff moveThe Trump administration's chief negotiator, Brendan Lynch, is in India for trade discussions following Washington's decision to impose a 50% tariff on Indian goods, a move New Delhi termed \"unfair, unjustified and unreasonable.\" The visit is an initial meeting to ease tensions, not a formal round of negotiations. This follows five previous rounds of talks. Prime Minister Narendra Modi responded to the trade situation by promising to protect local interests and stating his government would not let farmers, small entrepreneurs, or animal breeders be harmed. He also promoted a 'swadeshi' philosophy of encouraging products made in India. US President Donald Trump, while noting his friendly relationship with PM Modi, expressed disappointment over India buying Russian oil but affirmed the special relationship means there is \"nothing to worry about.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cas-taxpayers-slam-governments-midnight-1-day-itr-income-tax-filing-deadline-extension-2787951-2025-09-16",
      "headline": "One day is an insult: CAs, taxpayers slam last-minute ITR deadline extensionThe government's last-minute one-day ITR extension has ignited anger, with taxpayers and chartered accountants slamming it as tokenism, mocking portal glitches and questioning accountability in digital governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-dalal-street-us-fed-rate-decision-september-16-2787943-2025-09-16",
      "headline": "Sensex, Nifty open flat as investors await key US Fed decisions on rate cutThe S&P BSE Sensex added 148.51 points to 81,934.25, while the NSE Nifty50 gained 40.25 points to 25,109.50 as of 9:28 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-surge-elon-musk-1-billion-investment-record-high-2787926-2025-09-16",
      "headline": "Tesla shares surge 3% as Elon Musk invests $1 billion in company stockTesla shares rose over 3% on Monday after CEO Elon Musk purchased more than 2.5 million shares, valued at about $1 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inox-siddharth-jain-buys-india-inc-first-tesla-ev-cars-elon-musk-2787917-2025-09-16",
      "headline": "INOX's Siddharth Jain buys India Inc's first Tesla EVSiddharth Jain's purchase follows the earlier delivery of India's first Tesla Model Y to Maharashtra Transport Minister Pratap Sarnaik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-agreement-talks-resume-trump-tariffs-shift-modi-commerce-ministry-2787907-2025-09-16",
      "headline": "India, US resume trade talks, first since Trump's 50% tariffsThe trade talks come after Trump softened his tone, saying he was optimistic about finalising a trade agreement with India. Government officials see a chance to rescue a free trade deal that had been thrown into doubt by punitive tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deadline-for-filing-income-tax-returns-extended-by-one-day-until-tuesday-government-glbs-2787853-2025-09-16",
      "headline": "Income tax return deadline extended till todayTo facilitate necessary updates and changes in the filing utilities, the department also announced that the e-filing portal will undergo maintenance from 12:00 am to 2:30 am on September 16, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-turns-to-barter-trade-to-dodge-sanctions-swaps-grain-for-chinese-cars-2787713-2025-09-15",
      "headline": "Russia turns to barter trade to dodge sanctions, swaps grain for Chinese carsEven as Russia builds warm ties with China and India, the return of barter shows just how far the war in Ukraine has distorted trading relationships for the world's biggest producer of natural resources, three decades after the 1991 collapse of the Soviet Union ushered in Russian economic integration with the West."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/last-chance-to-file-itr-2025-step-by-step-online-filing-process-explained-2787567-2025-09-15",
      "headline": "Last chance to file ITR 2025: Step-by-step online filing process explainedThe clock is ticking! Today is the final chance for taxpayers to file their ITR for AY 2025–26. Missing the deadline could mean penalties. Here's a quick guide to file online before midnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-coming-to-table-trump-aide-navarrros-big-claim-day-ahead-of-trade-talks-in-delhi-2787651-2025-09-15",
      "headline": "India coming to table: Trump aide Navarro's big claim ahead of Delhi trade talksIndia and the US will hold fast-tracked trade talks in New Delhi on Tuesday after White House trade adviser Peter Navarro said India is \"coming to the table,\" weeks after Washington imposed tariffs on Indian exports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-close-cautious-ahead-of-us-fed-meet-gst-20-seen-as-growth-trigger-2787628-2025-09-15",
      "headline": "Markets close flat ahead of US Fed meet, GST 2.0 driving consumption boostA cautious session kept Indian equities flat, with investors eyeing the US Fed's decision. Experts, however, expect GST 2.0 reforms to drive domestic consumption and benefit core sectors such as FMCG and banking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-119-points-lower-nifty-below-25100-titan-down-1-percent-2787607-2025-09-15",
      "headline": "Sensex ends 119 points lower, Nifty below 25,100; Titan down 1%The S&P BSE Sensex was down by 118.96 points to end at 81,785.74, while the NSE Nifty50 lost 44.80 points to end at 25,069.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-extension-glitch-income-tax-portal-what-to-do-september-15-2787597-2025-09-15",
      "headline": "Income tax portal faces glitch on last day of ITR filing. Here's what to doAs the September 15, 2025 deadline ticks away, users have been facing serious issues like very slow page loading, errors in uploading forms, and repeated system failures while submitting their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-gen-z-is-changing-money-habits-explains-financial-advisor-2787518-2025-09-15",
      "headline": "How Gen-Z is changing money habits, explains financial advisorGen-Z is shaking up traditional money habits. From saving to investing and spending on experiences, this generation is rewriting the rules of wealth. A financial advisor explains how and why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-relief-insurance-policyholders-tax-cut-benefit-hospital-bills-2787519-2025-09-15",
      "headline": "Can GST relief on insurance turn first-time buyers into long-term policyholders?For millions of families who hesitated to buy insurance because of the extra tax burden, the recent GST reforms could be a turning point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2025-deadline-know-penalties-and-benefits-you-lose-for-missing-the-due-date-2787482-2025-09-15",
      "headline": "ITR 2025 deadline: Know penalties and benefits you lose for missing the due dateThe deadline to file Income Tax Returns (ITR) for 2025 is here, and missing it can cost more than just a late fee. From penalties to lost tax perks, here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-deadline-today-september-15-how-much-to-pay-and-penalty-for-delay-2787458-2025-09-15",
      "headline": "Advance tax deadline today: How much to pay and penalty for delayThe second instalment of advance tax for financial year 2026 is due on 15 September. Here's what individuals need to pay, who is liable, and the consequences of missing the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/value-stocks-to-buy-on-dalal-street-top-picks-auto-psu-railways-nbfc-bajaj-finance-2787450-2025-09-15",
      "headline": "Looking for value-based stocks to buy on Dalal Street? Here are the top picksExperts believe the current market offers good opportunities, especially in sectors that have seen recent corrections and are expected to benefit from domestic demand, GST reforms, and a good monsoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-today-key-faqs-for-last-minute-filers-2787427-2025-09-15",
      "headline": "ITR filing deadline today: Key FAQs for last-minute filersToday marks the final chance to file Income Tax Returns for AY 2025–26. As the deadline closes in, last-minute filers are rushing to the portal. Here are the answers to the most common questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/dev-accelerator-ipo-allotment-finalised-strong-subscription-listing-2025-2787414-2025-09-15",
      "headline": "Dev Accelerator IPO allotment today: Step-by-step guide to check status onlineThe share allotment for Dev Accelerator IPO was finalised on September 15, 2025. Investors can check their allotment status using official BSE or registrar websites following outlined procedures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-54-points-higher-nifty-above-25100-eternal-rises-1-percent-2787372-2025-09-15",
      "headline": "Sensex opens 54 points higher, Nifty above 25,100; Eternal rises 1%The S&P BSE Sensex was up by 57.17 points to 81,961.87, while the NSE Nifty50 added 5.35 points to 25,119.35 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-allotment-check-status-gmp-listing-date-profit-shares-rise-market-debut-2787348-2025-09-15",
      "headline": "Urban Company IPO allotment out today: Check status as GMP jumps ahead of debutUrban Comapny IPO allotment follows a strong response, with bidding exceeding 100 times during the three-day subscription period from September 10 to 12, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-20-reforms-big-win-for-every-citizen-finance-minister-nirmala-sitharaman-2787197-2025-09-14",
      "headline": "Tax reforms for rising Bharat: GST 2.0 big win for citizens, says Nirmala SitharamanThe Union Finance Minister said that GST reforms will be implemented much ahead of Prime Minister Narendra Modi's instructions of launching them before Deepavali festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/us-consul-general-meets-jr-ntr-stresses-on-bilateral-relations-job-creation-2788367-2025-09-16",
      "headline": "US Consul General meets Jr NTR, stresses on bilateral relations, job creationActor Jr NTR met US Consul General Laura Williams in Hyderabad. Williams shared a social media post highlighting the growing collaboration and stronger ties between India and the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rise-and-fall-pawan-singh-nayandeep-rakshit-wear-saree-bindi-viral-video-2788333-2025-09-16",
      "headline": "Rise & Fall: Pawan Singh tells Nayandeep Rakshit to wear saree, bindi. Video viralA video from reality show 'Rise & Fall' featuring Pawan Singh and Nayandeep Rakshit has gone viral. In the clip, Pawan can be seen telling Nayandeep to wear a saree and a bindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-arshad-jolly-llb-3-gets-ua-rating-alcohol-brand-abusive-dialogues-cut-2788316-2025-09-16",
      "headline": "Akshay, Arshad's Jolly LLB 3 gets U/A rating - alcohol brand, abusive dialogues cut'Jolly LLB 3' received a U/A certificate after the CBFC suggested a few modifications. The courtroom-drama features actors Akshay Kumar, Arshad Warsi, Huma Qureshi and Amrita Rao in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-courtroom-drama-film-nyaya-saiyaara-success-report-2788296-2025-09-16",
      "headline": "After Saiyaara, Aneet Padda to star in a courtroom drama: ReportActor Aneet Padda, following her successful debut in Saiyaara, has reportedly signed her next film. Unlike what many were expecting, her next film is not going to be romantic. Here's everything you need to know about her next film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijays-classic-kushi-returns-to-theatres-after-25-years-2788337-2025-09-16",
      "headline": "Thalapathy Vijay's classic Kushi returns to theatres after 25 yearsThalapathy Vijay and Jyotika's romantic comedy 'Kushi' is set to return to the big screen. Marking 25 years since its original release, the film will be re-released in theatres on 25 September.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-starts-youtube-channel-in-memory-of-shefali-jariwala-2788335-2025-09-16",
      "headline": "After NGO, Parag Tyagi starts YouTube channel in memory of Shefali JariwalaParag Tyagi has launched a YouTube channel to share his and late wife Shefali Jariwala's story, with proceeds going to the Shefali Jariwala Rise Foundation. The initiative follows his pledge to carry forward Shefali's dreams of supporting underprivileged children and empowering women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ileana-d-cruz-shares-she-nearly-quit-barfi-after-anurag-basu-lashed-out-2788030-2025-09-16",
      "headline": "Ileana D'Cruz reveals she almost quit Barfi! after Anurag Basu's outburstIleana D'Cruz shared that she almost quit 'Barfi' after director Anurag Basu lashed out at her on set, leaving her in tears. The actor said she was calmed down by producer Siddharth Roy Kapur, after which she reconciled with Basu and continued with the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-shares-why-aryan-khan-rarely-smiles-on-camera-2788301-2025-09-16",
      "headline": "Raghav Juyal shares why Aryan Khan rarely smiles on cameraRaghav Juyal shared that Aryan Khan avoids smiling on camera due to a \"phobia,\" preferring to maintain a serious persona despite his playful side off-screen. Aryan is all set to make his directorial debut with the Netflix satire 'Ba***ds of Bollywood', releasing on September 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vir-das-says-its-impossible-to-gauge-sensitivities-before-show-am-not-that-artiste-2788319-2025-09-16",
      "headline": "Vir Das says it's impossible to gauge sensitivities before show: Am not that artisteVir Das announced his new stand-up tour 'Sounds of India', celebrating the country's everyday rhythms from Kanyakumari to Kashmir. At the launch, the Emmy-winning comedian opened up about the challenge of balancing comedy with social responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/robert-redford-oscar-winning-actor-and-director-dies-at-89-2788304-2025-09-16",
      "headline": "Robert Redford, Oscar-winning actor and director, dies at 89Actor-director Robert Redford, known for his role in 'Butch Cassidy and the Sundance Kid', died at the age of 89. He was celebrated for his iconic roles and for founding the Sundance Institute, which nurtured independent filmmakers across the globe.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jackie-shroff-calls-out-traffic-chaos-after-ambulance-struggles-to-move-in-mumbai-2788268-2025-09-16",
      "headline": "Jackie Shroff calls out traffic chaos after ambulance struggles to move in MumbaiJackie Shroff voiced concern over Mumbai's traffic after witnessing an ambulance stuck in a jam, warning that such delays could cost lives. The actor also made headlines for snapping at paparazzi over excessive flashlights before resuming his usual cheerful interactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lakshmi-manchu-reacts-sexist-remark-questions-mahesh-babu-going-shirtless-at-50-2788228-2025-09-16",
      "headline": "Lakshmi Manchu reacts to sexist remark, questions Mahesh Babu going shirtless at 50Actor Lakshmi Manchu confronts a reporter for questioning her dressing sense. She raised concerns about gendered double standards in media interviews and advocated for greater responsibility among journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coachella-2026-headliners-sabrina-carpenter-justin-bieber-karol-g-announced-2788250-2025-09-16",
      "headline": "Sabrina Carpenter, Justin Bieber and Karol G to headline Coachella 2026Coachella has revealed its headline acts for 2026, featuring Sabrina Carpenter, Justin Bieber and Karol G, with tickets set to go on sale this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-mahieka-sharma-all-about-hardik-pandyas-new-rumoured-partner-2788203-2025-09-16",
      "headline": "Who is Mahieka Sharma? All about Hardik Pandya's new rumoured partnerHardik Pandya has sparked dating rumours with model Mahieka Sharma after a Reddit thread spotted a male figure in the background of her selfie. While neither has confirmed the speculation, social media is abuzz as fans connect the dots after Hardik's recent separation from Natasa Stankovic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shinchan-goes-desi-director-masakazu-hashimoto-on-bollywood-humour-indian-debut-2788134-2025-09-16",
      "headline": "Shinchan goes desi: Director Masakazu Hashimoto on Bollywood, humour, Indian debutThe 33rd Shinchan film, 'Crayon Shin-chan the Movie: Super Hot! The Spicy Kasukabe Dancers' brings Japan's most notorious cartoon kid to India for the first time, mixing masala, mischief, and a lot of dance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nidradevi-next-door-review-a-technically-brilliant-film-by-suraag-sagar-that-deserves-more-love-2788140-2025-09-16",
      "headline": "Nidradevi Next Door review: A technically brilliant film that deserves more loveRelease Date:Fri Sep 12, 2025Nidradevi Next Door review: This Kannada film written and directed by Suraag Sagar is a psychological drama flavoured with romance, that tastefully presents sensitive issues such as chronic insomnia due to emotional baggage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karanvir-sharma-bigg-boss-19-choosing-kajol-the-trial-2-2787610-2025-09-16",
      "headline": "Karanvir Sharma on saying no to Bigg Boss 19, choosing Kajol's The Trial 2Ahead of 'The Trial 2' premiere, actor Karanvir Sharma told IndiaToday.in that his biggest disadvantage in Bollywood has been his looks. He also opened up about turning down 'Bigg Boss 19' to prioritise the courtroom drama series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gen-v-season-2-release-date-plot-cast-prime-video-2788195-2025-09-16",
      "headline": "Gen V Season 2 review: It's funnier, bloodier and paradoxically more tender'Gen V' season 2 review: The show arrives with sharper storytelling and a more hopeful tone. It honours the late Chance Perdomo while deepening its emotional and action-packed narrative. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abir-gulaal-first-reviews-out-critics-call-fawad-khan-vaani-kapoor-film-frustrating-2788190-2025-09-16",
      "headline": "Abir Gulaal first reviews out: Critics call Fawad Khan-Vaani's film frustratingFawad Khan and Vaani Kapoor's film 'Abir Gulaal' is barred from Indian release following the Pahalgam terror attack. It has drawn negative responses from critics worldwide, citing incoherent storytelling and lacklustre performances."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-thanks-president-trump-for-birthday-wishes-in-first-call-since-june-backs-his-ukraine-peace-push-2788436-2025-09-16",
      "headline": "Thank you, my friend: PM gets birthday call from Trump, backs his Ukraine peace pushThis was the first call between the two world leaders since June 17. The relationship between India and US turned sour after Trump imposed an additional sanction of 25 per cent on India, with total levy of 50 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ceasefire-offer-came-via-us-but-india-did-not-agree-pakistan-foreign-minister-ishaq-dar-big-admission-operation-sindoor-trump-mediation-claims-2788299-2025-09-16",
      "headline": "India refused third-party role in truce talks: Pak minister busts Trump claimPakistan's Foreign Minister Ishaq Dar has admitted that India never accepted any third-party mediation in ceasefire talks. He said a ceasefire offer had come via the US, but India insisted the issue remain bilateral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/masood-azhar-family-killed-bahawalpur-operation-sindoor-jaish-commander-admits-2788096-2025-09-16",
      "headline": "Masood Azhar's family 'torn into pieces' by India: Jaish admits Op Sindoor impactThis is the first public confirmation from within the Jaish-e-Mohammad regarding the fate of Masood Azhar's family after India hit the terror outfit's headquarters in Bahwalpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-says-trade-talks-with-us-positive-forward-looking-ground-set-for-6th-round-2788398-2025-09-16",
      "headline": "India says trade talks with US positive, forward-looking; ground set for 6th roundThe Commerce Ministry said the discussions with the US trade officials were \"positive and forward-looking\" and covered various aspects of the proposed trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/qatar-arab-islamic-summit-nations-nato-military-alliance-pakistan-turkey-nexus-impact-on-india-middle-east-security-israel-2788111-2025-09-16",
      "headline": "Push for Arab-Islamic Nato in meeting attended by Pak, TurkeyLeaders of Arab and Islamic nations pushed for an \"Arab Nato\" in a meeting of over 40 Muslim countries, including Pakistan and Turkey. Egypt, which has the Arab world's largest army, pitched it as a collective defence shield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dont-know-how-accident-happened-bmw-crash-case-accuseds-husband-tells-police-2788423-2025-09-16",
      "headline": "Took different cabs: Delhi crash accused's husband, who was in same BMW, to copsParikshit claimed he did not know how the accident happened and said Gaganpreet took the victims to a hospital by taxi while he followed separately. Police are verifying his version with call detail records and location data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-pre-match-press-conference-uae-clash-handshake-row-2788300-2025-09-16",
      "headline": "After boycott threat, sulking Pakistan cancel pre-match presser ahead of UAE clashPakistan have cancelled their pre-match press conference ahead of their Asia Cup 2025 clash against the UAE, sparking speculation of a boycott amid tensions with the ICC and ACC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-trump-blinks-cheese-corn-agriculture-dairy-sectors-2788074-2025-09-16",
      "headline": "Say cheese: Trump blinks on trade as talks resume with IndiaIndia-US trade negotiations have resumed, weeks after Trump imposed steep 50% tariffs last month. The US, now, doesn't want sweeping access to India's agricultural and dairy markets. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abir-gulaal-first-reviews-out-critics-call-fawad-khan-vaani-kapoor-film-frustrating-2788190-2025-09-16",
      "headline": "Abir Gulaal first reviews out: Critics call Fawad Khan-Vaani's film frustratingFawad Khan and Vaani Kapoor's film 'Abir Gulaal' is barred from Indian release following the Pahalgam terror attack. It has drawn negative responses from critics worldwide, citing incoherent storytelling and lacklustre performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-mohammad-yousuf-slur-suryakumar-yadav-pig-comment-explanation-2788422-2025-09-16",
      "headline": "After pig jibe against Suryakumar, ex-Pakistan cricketer offers bizarre explanationFormer Pakistan cricketer Mohammad Yousuf sparked outrage by calling India's Suryakumar Yadav a 'pig' during a heated TV debate, a slur that has further escalated tensions following the handshake row. Suryakumar refused to shake hands with Pakistan players during India's Asia Cup match on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/sexual-predator-indian-origin-surgeon-amal-bose-united-kingdom-jailed-for-groping-female-colleagues-england-crime-lancashire-2788375-2025-09-16",
      "headline": "Grabbed breasts, groped staff: Indian-origin surgeon jailed in UK for sexual assaultA 55-year-old Indian-origin surgeon in the UK has been sentenced to six years in jail for sexually assaulting five staff members and also branded \"a sexual predator hiding in plain sight\" by the judge. All the victims were staff members at Blackpool Victoria Hospital, where he served as head of the cardiovascular surgery department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-pushes-islamic-arab-nato-doha-summit-implications-concerns-for-india-turkey-arab-nations-2788345-2025-09-16",
      "headline": "Pakistan pushes for Islamic Nato. What's in it for India?At a summit of over 40 Muslim countries in Doha after Israel's strike in Qatar, a proposal was floated for an Islamic Nato. Pakistan aggressively pitched for an \"Arab-Islamic task force\", reviving talks about a Nato-style military alliance. Though targeted at Israel, does the bloc, with Pakistan and Turkey, have any implications for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/commonwealth-leaked-report-2024-pakistan-general-election-rigging-shehbaz-sharif-asim-munir-army-pti-imran-khan-2788344-2025-09-16",
      "headline": "Pakistan rigged election, Commonwealth panel buried it: Leaked reportThe Commonwealth is facing criticism for allegedly suppressing its observer report on Pakistan's 2024 general election. A leaked document accuses the military-backed Shehbaz Sharif government of widespread rigging and curbing political freedoms. Despite protocol, the Commonwealth failed to publish the findings for the first time in 70 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-boycott-mohsin-naqvi-2787989-2025-09-16",
      "headline": "Asia Cup withdrawal only honourable exit for below-par PakistanPakistan have threatened to withdraw from the Asia Cup if match referee Andy Pycroft is not removed for the remainder of the tournament. Is the abrupt exit the only way for Pakistan to avoid humiliation in the Super 4 stage?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/anti-immigrant-uk-unite-the-kingdom-rally-leader-tommy-robinson-surprising-take-on-indians-hindus-allies-britain-2788130-2025-09-16",
      "headline": "Anti-immigrant UK leader Tommy Robinson has surprising take on IndiansDespite his hardline anti-immigrant stance, UK leader Tommy Robinson has repeatedly praised Indians, particularly Hindus, calling them allies who integrate into British life. Robinson, who recently led a massive rally through the heart of London, had pledged street muscle for Hindus, who he saw as distinctly different from other immigrants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/is-us-howard-lutnick-donald-trump-aide-corn-attack-linked-to-india-ethanol-rush-2787793-2025-09-16",
      "headline": "Is US corn attack linked to India's ethanol rush?US Commerce Secretary Howard Lutnick attacked India for not importing American corn. India was an exporter of maize till 2023 but the diversion of corn to produce ethanol for fuel blending turned it into an importer. DC's desperation as China skips its grains and India's corn imports are behind the Trump aide's attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2014-the-man-behind-narendra-modi-2788258-2025-09-16",
      "headline": "From the India Today archives (2014) | The man behind Narendra ModiNarendra Modi turning 75 is also time to remember Lakshmanrao Inamdar, the RSS veteran who perhaps had the most profound impact on the prime minister's early years"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bangladesh-beat-afghanistan-alive-super-4-race-2788456-2025-09-17",
      "headline": "Asia Cup: Bangladesh stay alive in Super 4 race with 8-run win vs AfghanistanAsia Cup: Bangladesh fought hard to claim an 8-run victory over Afghanistan in a must-win Group B clash, keeping their Super Four hopes alive in the Asia Cup 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ias-officer-swapnil-wankhede-warm-interaction-with-orphan-girl-viral-video-2788041-2025-09-16",
      "headline": "Viral video of IAS officer's warm interaction with orphan girl delights InternetA touching video of Swapnil Wankhede, a 2016-batch IAS officer and Collector of Datia district in Madhya Pradesh, warmly interacting with an orphaned girl has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-arshad-jolly-llb-3-gets-ua-rating-alcohol-brand-abusive-dialogues-cut-2788316-2025-09-16",
      "headline": "Akshay, Arshad's Jolly LLB 3 gets U/A rating - alcohol brand, abusive dialogues cut'Jolly LLB 3' received a U/A certificate after the CBFC suggested a few modifications. The courtroom-drama features actors Akshay Kumar, Arshad Warsi, Huma Qureshi and Amrita Rao in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/india-gold-rush-festive-tradition-faces-geoeconomic-test-2788244-2025-09-16",
      "headline": "India gold rush: Festive tradition faces geoeconomic testAmidst RBI and central banks globally stockpiling gold, Indians navigate price surges in the festive-wedding season. All eyes are now on the September 17 US Federal Reserve meeting"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ex-nepal-minister-np-saud-admits-failures-after-gen-z-protests-2788336-2025-09-16",
      "headline": "We didn't deliver good governance: Ex-Nepal minister admits failures after protestsIn a candid interview with India Today TV, Former Foreign Minister Narayan Prakash Saud reflects on Nepali youths' disillusionment, corruption, and the challenges facing the interim government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/red-rain-alert-in-dehradun-heavy-rainfall-likely-after-cloudburst-leaves-13-dead-2788397-2025-09-16",
      "headline": "Red rain alert in Dehradun, heavy rainfall likely after cloudburst leaves 13 deadThe state government has issued a red alert for Dehradun, Champawat, and Udham Singh Nagar, warning of extremely heavy rain and the risk of further fatalities, landslides, and infrastructure collapse through September 20."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-pakistan-resume-training-boycott-threat-uae-clash-2788457-2025-09-17",
      "headline": "Asia Cup: Despite threatening boycott, Pakistan train on eve of UAE matchPakistan resumed training ahead of their decisive Asia Cup match against UAE. The team's future in the tournament remains uncertain amid ongoing tensions with India and PCB deliberations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bangladesh-beat-afghanistan-alive-super-4-race-2788456-2025-09-17",
      "headline": "Asia Cup: Bangladesh stay alive in Super 4 race with 8-run win vs AfghanistanAsia Cup: Bangladesh fought hard to claim an 8-run victory over Afghanistan in a must-win Group B clash, keeping their Super Four hopes alive in the Asia Cup 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-mohammad-yousuf-suryakumar-yadav-pig-slur-madan-lal-2788447-2025-09-16",
      "headline": "Mohammad Yousuf's slur on Suryakumar shows Pakistan's character: Madan LalAsia Cup 2025: World Cup-winning former India fast bowler Madan Lal, speaking to India Today, criticised Mohammad Yousuf for his derogatory remarks against Suryakumar Yadav. Madan Lal said such comments from Pakistan cricketers shows the true character of their country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-west-indies-announce-squad-for-india-tests-ahmedabad-delhi-2788433-2025-09-16",
      "headline": "IND vs WI: West Indies name squad for India Tests, Chanderpaul returnsCricket West Indies has named a 15-member squad for the upcoming two-Test series against India. The selection features recalls and a maiden spinner call-up, aiming to tackle challenging Indian conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-lose-afc-champions-league-2-opener-to-ahal-fk-late-goal-2788432-2025-09-16",
      "headline": "Mohun Bagan stunned at home: Late Ahal strike hands 1-0 home defeat in ACL2 openerMohun Bagan started their AFC Champions League 2 campaign with a 1-0 defeat to Ahal FK at Salt Lake Stadium. The loss highlights defensive issues and raises concerns about their qualification hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-mohammad-yousuf-slur-suryakumar-yadav-pig-comment-explanation-2788422-2025-09-16",
      "headline": "After pig jibe against Suryakumar, ex-Pakistan cricketer offers bizarre explanationFormer Pakistan cricketer Mohammad Yousuf sparked outrage by calling India's Suryakumar Yadav a 'pig' during a heated TV debate, a slur that has further escalated tensions following the handshake row. Suryakumar refused to shake hands with Pakistan players during India's Asia Cup match on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-200m-gold-bid-2025-world-championships-tebogo-bednarek-2787872-2025-09-16",
      "headline": "Noah Lyles aims for 200m glory amid fierce competitionNoah Lyles aims to turn his 100m bronze into 200m gold at the 2025 World Championships, with fierce rivals Tebogo and Bednarek setting the stage for a thrilling race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-abhishek-sharma-fearless-hitting-yuvraj-singh-mentorship-2788402-2025-09-16",
      "headline": "Decoding Abhishek Sharma's fearlessness: Facing 150 kph, Yuvraj Singh's mentorshipAbhishek Sharma has quickly become a key batsman for India in T20Is through hard work and mentorship. His fearless style and family support have shaped his rise, with hopes high for Asia Cup success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-set-to-rest-jasprit-bumrah-oman-asia-cup-arshdeep-singh-2788399-2025-09-16",
      "headline": "Asia Cup: India likely to rest Jasprit Bumrah against OmanIndia are unlikely to make changes to their XI for Friday's final Asia Cup group game against Oman, apart from resting pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sarvesh-kushare-lifetime-best-high-jump-world-championships-top-six-2788355-2025-09-16",
      "headline": "Sarvesh Kushare records lifetime best in high jump, finishes 6thWorld Athletics Championships 2025: Sarvesh Kushare scripted history by becoming only the fourth Indian athlete to finish in the top six in a world meet. The 30-year-old from Maharashtra produced his personal best of 2.28m in the men's high jump final in Tokyo on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-200m-gold-bid-2025-world-championships-tebogo-bednarek-2787872-2025-09-16",
      "headline": "Noah Lyles aims for 200m glory amid fierce competitionNoah Lyles aims to turn his 100m bronze into 200m gold at the 2025 World Championships, with fierce rivals Tebogo and Bednarek setting the stage for a thrilling race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-abhishek-sharma-fearless-hitting-yuvraj-singh-mentorship-2788402-2025-09-16",
      "headline": "Decoding Abhishek Sharma's fearlessness: Facing 150 kph, Yuvraj Singh's mentorshipAbhishek Sharma has quickly become a key batsman for India in T20Is through hard work and mentorship. His fearless style and family support have shaped his rise, with hopes high for Asia Cup success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-set-to-rest-jasprit-bumrah-oman-asia-cup-arshdeep-singh-2788399-2025-09-16",
      "headline": "Asia Cup: India likely to rest Jasprit Bumrah against OmanIndia are unlikely to make changes to their XI for Friday's final Asia Cup group game against Oman, apart from resting pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sarvesh-kushare-lifetime-best-high-jump-world-championships-top-six-2788355-2025-09-16",
      "headline": "Sarvesh Kushare records lifetime best in high jump, finishes 6thWorld Athletics Championships 2025: Sarvesh Kushare scripted history by becoming only the fourth Indian athlete to finish in the top six in a world meet. The 30-year-old from Maharashtra produced his personal best of 2.28m in the men's high jump final in Tokyo on Tuesday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}