{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-urban-millennials-are-renting-lifestyle-products-instead-of-buying-them-2815220-2025-11-07",
      "headline": "Why urban millennials are renting lifestyle products instead of buying themUrban millennials are rewriting the rules of ownership. Instead of buying lifestyle products, from furniture to gadgets, they're choosing to rent. The reason? Flexibility, affordability, and freedom from long-term commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-voluntary-retirement-under-ups-unified-pension-scheme-all-you-need-to-know-2815171-2025-11-07",
      "headline": "Planning voluntary retirement under UPS? All you need to knowThe guidelines aim to offer clarity and smoother planning for retirement decisions, ensuring eligible employees understand their rights, timelines, and benefits under UPS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/groww-ipo-gmp-latest-subscription-day-3-key-details-2815158-2025-11-07",
      "headline": "Groww IPO closes today. Here's what the latest GMP signalsWith the IPO closing today, attention now shifts to final subscription numbers and post-allotment reactions. Analysts expect a modestly positive debut given the strong retail response and steady grey market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eow-investigation-indusind-bank-probe-market-cap-fall-forex-hedging-probe-arun-khurana-former-executives-2815143-2025-11-07",
      "headline": "Financial watchdog to seek RBI's help in IndusInd Bank forex hedging probeAs of now, EOW officials have recorded statements of around 12 people from IndusInd Bank, which includes the former top management and other employees in connection with the ongoing investigations into the accounting lapse at the bank of Rs 2000 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-a-magical-12-percent-sip-may-not-give-you-solid-returns-expert-breaks-it-down-2815142-2025-11-07",
      "headline": "Why a magical 12% SIP may not give you solid returns? Expert breaks it downEither compare everything in nominal terms, without adjusting for inflation, or adjust every single figure — contributions, taxes, fees, and final value — for inflation, says expert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-are-rising-again-key-factors-behind-fresh-rally-explained-2815127-2025-11-07",
      "headline": "Gold and silver are rising again. What's driving the fresh rally?On Friday morning, gold futures on the MCX were trading around Rs 1,21 lakh per 10 grams, while silver was trading over Rs 1,48 lakh per kg. Both metals have rebounded from their one-week lows, aided by a weaker US dollar and fresh geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-salary-kras-for-tesla-details-market-cap-robo-taxi-financial-targets-2815112-2025-11-07",
      "headline": "Elon Musk's $1 trillion payday sounds huge. But can he actually earn it?To actually collect on this historic paycheque, Musk must achieve what Tesla's board calls \"Mars-shot milestones\", a suite of operational and financial targets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-today-sensex-falls-500-points-nifty-tumbles-key-factors-explained-2815100-2025-11-07",
      "headline": "Sensex tumbles 500 points: Why stock market is down todayThe broad-based weakness comes as investors continue to digest a mix of global uncertainties, ranging from geopolitical tensions to expectations of prolonged high interest rates in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-allotment-status-gmp-listing-date-details-2025-11-07-2815093-2025-11-07",
      "headline": "Lenskart IPO allotment out: Check latest GMP, listing date and moreLenskart's IPO allotment is done, but all eyes are now on its stock market debut. With strong demand and a steady GMP, will India's eyewear leader deliver clear gains?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-shares-tumble-4-percent-in-early-trade-whats-behind-the-fall-2815078-2025-11-07",
      "headline": "Bharti Airtel shares tumble 4% in early trade. What's behind the fall?At 9:29 am, Bharti Airtel shares were down 3.66% at Rs 2,018 on the Bombay Stock Exchange (BSE), with heavy volumes recorded in the opening minutes of trade. The decline came even as broader market sentiment remained weak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-below-25400-airtel-falls-over-3-2815067-2025-11-07",
      "headline": "Sensex falls 500 points, Nifty below 25,400; Airtel falls over 3%At 9:19 am, the S&P BSE Sensex was down 456.75 points at 82,854.26, while the NSE Nifty50 slipped 129.40 points to 25,380.30. All major sectoral indices opened lower, led by losses in banking, IT and metal stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-tesla-pay-package-usd-1-trillion-approved-tech-ceo-salary-comparison-apple-google-meta-2815061-2025-11-07",
      "headline": "Musk's $1 trillion payout approved: How it compares to Apple, Google, Meta CEOsThe pay approval, backed by over 75% of voting shareholders, grants Musk stock options that could fundamentally reshape how CEOs are paid in Silicon Valley and beyond.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-premium-more-costly-metro-tier-1-cities-why-pollution-rising-medical-treatment-costs-irda-insurer-2815039-2025-11-07",
      "headline": "Polluted air, pricier cover: Why health insurance costs more in big citiesWhile higher premiums may sound like an unfair penalty for metro city dwellers, experts say it reflects the growing health and cost gap between metros and smaller towns due to numerous factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trade-talks-with-us-eu-in-full-force-india-awaits-final-nodnirmala-sitharaman-2814761-2025-11-06",
      "headline": "US, EU trade talks still on; atmanirbharta is resilient interdependence: SitharamanFinance Minister Nirmala Sitharaman on Thursday said efforts to finalise trade agreements with the US and the EU are in \"full force.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-ipo-opens-on-november-11-check-price-size-gmp-and-key-details-2814674-2025-11-06",
      "headline": "Physicswallah IPO opens on November 11: Check price, size, GMP and key detailsThe wait is nearly over for investors tracking PhysicsWallah. The edtech firm will open its IPO on November 11, aiming to raise significant capital as it prepares for its stock market debut. Here's everything you need to know in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-down-end-in-red-metal-sector-slide-fii-outflows-2814663-2025-11-06",
      "headline": "Sensex, Nifty erase early gains to close lower, FII selling dampens marketThe S&P BSE Sensex lost 148.14 points to close at 83,311.01, while the NSE Nifty50 was down by 87.95 points to end at 25,509.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/pine-labs-ipo-opens-tomorrow-review-check-price-band-minimum-amount-gmp-details-2814655-2025-11-06",
      "headline": "Pine Labs IPO opens tomorrow for bidding: Check price band, GMP, other detailsPine Labs IPO involves the sale of 9.41 crore new shares aggregating to Rs 2,080 crore, while the offer for sale includes 8.23 crore shares worth Rs 1,819.91 crore, being sold by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-philanthropy-list-2025-shiv-nadar-tops-with-rs-2708-crore-check-others-2814643-2025-11-06",
      "headline": "Shiv Nadar tops Hurun Philanthropy List 2025. Here's who else made the top 10Shiv Nadar and family have retained the top spot for the fourth time in five years. The HCL founder donated Rs 2,708 crore in 2025, averaging Rs 7.4 crore per day, up 26% from last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-bpnl-buy-now-pay-later-a-lifesaver-or-a-debt-trap-the-hidden-side-of-easy-credit-explains-expert-2814617-2025-11-06",
      "headline": "Is BPNL a lifesaver or a debt trap? The hidden side of easy credit, explains expertBuy Now, Pay Later (BNPL) has made shopping feel easier than ever — no paperwork, no waiting, just buy now and pay in instalments. But beneath the convenience lies a growing concern: is it really a smart money tool or a slippery debt trap? Let's have a look."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/reliance-moves-to-sell-middle-east-crude-as-sanctions-reshape-trade-report-2814568-2025-11-06",
      "headline": "Reliance moves to sell Middle East crude as sanctions reshape trade: ReportThe company has reportedly offered grades such as Murban and Upper Zakum to both domestic and overseas buyers in recent days. While it is not yet clear how much crude Reliance is seeking to offload, the approach itself has caught the oil market's attention. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/feminist-icon-jennifer-lawrence-describes-miss-piggy-coproduction-with-emma-stone-2815253-2025-11-07",
      "headline": "Feminist icon: Jennifer Lawrence describes Miss Piggy co-production with Emma Stone Jennifer Lawrence says her upcoming co-production of 'Miss Piggy' with Emma Stone is a film that aims to present the protagonist as a feminist icon. The Disney film is being written by Cole Escola.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-season-3-trailer-release-date-cast-plot-prime-video-manoj-bajpayee-jaideep-ahlawat-2815241-2025-11-07",
      "headline": "The Family Man 3 trailer: Manoj Bajpayee's Srikant is on the run, faces new foes 'The Family Man Season 3' trailer was launched today in Mumbai ahead of its November 21 premiere. The new season intensifies the espionage drama with Srikant Tiwari on the run from his own agency and new powerful enemies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gouri-kishan-reporter-sexist-question-pa-ranjith-khushbu-sundar-kavin-2815230-2025-11-07",
      "headline": "Pa Ranjith, Khushbu condemn reporter's sexist question to actor Gouri: Shameful Director Pa Ranjith, actor-politician Khushbu Sundar, and actor Kavin have publicly condemned a reporter's sexist question directed at Gouri Kishan during a press event for her film 'Others', voicing strong support for the actor and calling for greater respect towards women in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/baramulla-review-manav-kauls-haunting-ode-to-loss-memory-and-exile-2815239-2025-11-07",
      "headline": "Baramulla review: Manav Kaul's haunting ode to loss, memory and exileRelease Date:Fri Nov 07, 2025 Manav Kaul delivers one of his most haunting performances yet in 'Baramulla', a Netflix film that finds horror not in ghosts but in grief, memory, and the pain of exile. A chilling reflection on loss and belonging in the Kashmir Valley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-upsc-contestant-vikas-pawar-wins-rs-50-lakhs-snooker-inventor-question-2815181-2025-11-07",
      "headline": "KBC 17: UPSC aspirant fails to answer Rs 1 crore question. Can you? Vikas Singh Pawar from New Delhi opted to quit at the Rs 1 crore question on 'Kaun Banega Crorepati', which connected the invention of snooker to an army officer sharing his name with a former British Prime Minister, with the correct answer being Neville Chamberlain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/m-night-shyamalans-father-nelliat-c-shyamalan-dies-at-88-2815208-2025-11-07",
      "headline": "Director M Night Shyamalan's father, Nelliat C Shyamalan, dies at 88 Renowned cardiologist Dr Nelliat C Shyamalan, father of filmmaker M Night Shyamalan, died in the US aged 88. The funeral is scheduled for 7 November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlals-vrusshabha-to-release-in-christmas-actor-announces-with-new-post-2815186-2025-11-07",
      "headline": "Mohanlal's Vrusshabha to release in Christmas, actor announces with new post After several delays, Mohanlal's much-awaited film 'Vrusshabha' is now set for a Christmas 2025 release. The Malayalam superstar announced the news on Friday, unveiling a brand-new motion poster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/meet-kumbha-prithviraj-sukumaran-futuristic-look-in-ss-rajamouli-globe-trotter-with-mahesh-babu-priyanka-chopra-2815178-2025-11-07",
      "headline": "Meet Kumbha: Prithviraj Sukumaran's futuristic look in Rajamouli's Globe Trotter SS Rajamouli's team unveiled the first look of Prithviraj Sukumaran as Kumbha from their upcoming film 'Globe Trotter', also starring Mahesh Babu and Priyanka Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/from-rx-100-to-the-girlfriend-five-telugu-love-stories-that-broke-conventions-2814903-2025-11-07",
      "headline": "RX 100 to The Girlfriend: Five Telugu love stories that broke conventions Telugu cinema has never shied away from love, but few films have dared to question it. These stories broke conventions, redefined relationships, and proved that love on screen can be raw, flawed, and deeply human."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/class-of-2025-priyanka-chopra-kiara-advani-lead-bollywood-cheers-for-vicky-kaushal-katrina-kaif-baby-boy-2815166-2025-11-07",
      "headline": "#Classof2025: New parents Vicky-Katrina flooded with cute Bollywood wishes Bollywood stars, including Priyanka Chopra, Kiara Advani, and Kareena Kapoor Khan sent heartfelt wishes as Katrina Kaif and Vicky Kaushal welcomed their baby boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hilary-duff-releases-mature-comeback-reflective-new-song-10-years-2815156-2025-11-07",
      "headline": "Is Hilary Duff's Mature a jab at Leonardo DiCaprio? Watch the song here Hilary Duff returns to music after a decade-long hiatus with the single 'Mature', accompanied by a music video and lyrics that reference Leonardo DiCaprio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zarine-khan-sussane-and-zayed-khans-mother-dies-of-cardiac-arrest-2815162-2025-11-07",
      "headline": "Zarine Khan, mother of Sussane and Zayed Khan, dies of cardiac arrest Zarine Khan, wife of Sanjay Khan and mother of Sussanne and Zayed Khan, died at her Mumbai home at the age of 81 after a prolonged illness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-alia-bhatt-celebrate-daughter-raha-third-birthday-family-party-2815122-2025-11-07",
      "headline": "Raha's 3rd birthday: Ranbir-Alia host family bash, Neetu, Rani Mukerji attend Ranbir Kapoor and Alia Bhatt's daughter Raha celebrated her third birthday on Thursday, attended by close family members and friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/met-my-hero-anurag-kashyap-fanboy-moment-with-rahul-dravid-2815149-2025-11-07",
      "headline": "Met my hero: Anurag Kashyap's fanboy moment with Rahul Dravid Filmmaker Anurag Kashyap shared a moment with former cricketer Rahul Dravid, while Dravid's son Anvay prepares to play for Team C at the Men's U19 One-Day Challenger Trophy in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zohran-mamdani-wins-new-york-mayoral-race-youngest-muslim-indian-american-bollywood-campaign-2815124-2025-11-07",
      "headline": "How Amitabh Bachchan's Bollywood magic fuelled Zohran Mamdani's mayor run Zohran Mamdani's election as New York City's youngest mayor in decades highlights the influence of cultural identity on urban politics, with his innovative use of Bollywood references resonating with diverse communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-clarifies-comments-on-karur-stampede-asks-fans-to-not-set-him-up-against-thalapathy-vijay-2815135-2025-11-07",
      "headline": "Don't set me up against Vijay: Ajith Kumar clarifies comments on Karur stampede After stressing unity and shared accountability following the tragic stampede at Vijay's political rally in Karur, Ajith Kumar clarified his statement. The actor said his remarks were not aimed at blaming Vijay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vicky-kaushal-katrina-kaif-become-parents-to-baby-boy-2815132-2025-11-07",
      "headline": "Our bundle of joy has arrived: Vicky, Katrina become parents to baby boy Vicky Kaushal and Katrina Kaif have announced the arrival of their first child, a baby boy. The couple shared the good news on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-hints-at-orlando-bloom-split-in-emotional-new-song-bandaids-2815096-2025-11-07",
      "headline": "Katy Perry hints at Orlando Bloom split in emotional new song Bandaids Katy Perry's new single 'Bandaids' captures the heartbreak and emotional turmoil of her split from Orlando Bloom after nearly a decade together. The song and its visuals trace the painful unravelling of their relationship with raw honesty and poetic depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boogie-woogie-original-team-reunites-with-meezaan-jaaferi-for-viral-dance-off-to-3-shaukk-2815073-2025-11-07",
      "headline": "Boogie Woogie stars Jaaved, Naved and Ravi Behl's dance-off wins hearts. Watch Jaaved Jaaferi, Naved Jafri, and Ravi Behl join Meezaan Jaaferi for a special performance on the song '3 Shaukk' from the upcoming film De De Pyaar De 2, sparking nostalgia among fans and celebrities."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/several-flights-delayed-at-delhi-airport-due-to-technical-snag-with-air-traffic-control-system-2815057-2025-11-07",
      "headline": "300 flights delayed in Delhi due to software glitch, some may be cancelledA technical glitch in the Air Traffic Control system at Indira Gandhi International Airport caused significant flight delays on Friday. Airlines might cancel a few evening flights, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/isnt-rs-4-lakh-per-month-already-a-lot-of-money-supreme-court-asks-shamis-wife-issues-notice-to-cricketer-2815218-2025-11-07",
      "headline": "Isn't Rs 4 lakh a month lot, Supreme Court asks Shami's wife, issues notice to himThe Supreme Court has sought responses from Indian cricketer Mohammed Shami and the West Bengal government on a plea filed by his estranged wife, Hasin Jahan, seeking an increase in the monthly maintenance granted to her and their daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-elections-2025-first-phase-record-turnout-voting-pattern-analysis-nda-mahagathbandhan-2815090-2025-11-07",
      "headline": "Record Phase 1 turnout in Bihar polls. Who should be more worried?In the first phase of the Bihar elections, the voter turnout touched 64.66%, a jump from the 56.1% recorded in the 2020 assembly polls. What do the record voting figures in Bihar indicate?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vicky-kaushal-katrina-kaif-become-parents-to-baby-boy-2815132-2025-11-07",
      "headline": "Our bundle of joy has arrived: Vicky, Katrina become parents to baby boyVicky Kaushal and Katrina Kaif have announced the arrival of their first child, a baby boy. The couple shared the good news on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/afghanistan-pakistan-babrra-massacre-1948-pathan-khudai-khidmatgars-frontier-gandhi-bacha-khan-pashtun-2810750-2025-11-07",
      "headline": "When Pakistan slaughtered Frontier Gandhi's 600 unarmed PathansPakistan, partitioned as an Islamic nation, stained its history shedding blood of Muslim Pathans within a year of its creation. On August 12, 1948, police forces in the regime of Muhammad Ali Jinnah slaughtered 600 Pathan or Pashtun followers of Frontier Gandhi Khan Abdul Gaffar Khan for trying to protest peacefully. Here's all about the Babrra Massacre, also referred to as the \"Karbala of the Pashtuns\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sridhar-vembu-proposes-whatsapp-disposes-soon-you-might-use-whatsapp-to-send-messages-to-arattai-users-2815130-2025-11-07",
      "headline": "Soon, you might use WhatsApp to send messages to Arattai usersWeeks after Zoho founder Sridhar Vembu explored the idea of cross compatibility between messaging apps like Arattai, WhatsApp is reportedly testing a new feature which could allow you to send messages to users on other platforms.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/explosion-at-mosque-inside-a-school-in-jakarta-during-friday-prayers-54-injured-2815258-2025-11-07",
      "headline": "Massive explosion inside mosque in Jakarta during Friday prayers, 54 injuredThe explosion tore through a mosque inside a Navy compound in North Jakarta during Friday prayers, injuring at least 54 people, including children and teachers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-to-blame-for-mamdani-victory-why-maga-knives-are-out-for-their-hero-affordability-shutdown-republican-2814826-2025-11-07",
      "headline": "Trump to blame for Mamdani victory: Why MAGA knives are out for their heroThe MAGA crowd, Donald Trump's support base, has gone berserk after electoral defeats in mayoral and gubernatorial polls. Zohran Mamdani's victory in New York City is particularly stinging. Supporters are blaming Trump, saying his obsession with foreign politics and ignoring crucial domestic issues caused the setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/baramulla-review-manav-kauls-haunting-ode-to-loss-memory-and-exile-2815239-2025-11-07",
      "headline": "Baramulla review: Manav Kaul's haunting ode to loss, memory and exileRelease Date:Fri Nov 07, 2025Manav Kaul delivers one of his most haunting performances yet in 'Baramulla', a Netflix film that finds horror not in ghosts but in grief, memory, and the pain of exile. A chilling reflection on loss and belonging in the Kashmir Valley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-new-luxury-how-republic-of-nature-redefines-meaningful-living-on-ecr-2814472-2025-11-06",
      "headline": "The New Luxury: How Republic of Nature Redefines Meaningful Living on ECRDiscover how Republic of Nature by GTB Developers is reshaping Chennai's East Coast Road with design-forward homes that blend luxury, nature, and mindfulness in one of India's most refined new communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vande-matram-commemoration-nehru-dropped-stanzas-durga-bjp-attacks-congress-2815049-2025-11-07",
      "headline": "Nehru dropped Maa Durga stanzas from Vande Mataram in 1937: BJP attacks CongressBJP spokesperson CR Kesavan accused the Congress of \"deliberately distorting\" Vande Mataram under Nehru's leadership, claiming stanzas hailing Goddess Durga were removed in 1937 to appease communal sensitivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/the-rise-of-work-from-leave-why-indians-are-taking-time-off-just-to-work-2814870-2025-11-07",
      "headline": "The rise of 'Work From Leave': Why Indians are taking time off just to workMany Indian employees are taking time off just to voluntarily finish their office tasks. Think of it as Work-From-Leave, where the main purpose of taking a day off is to catch up on pending office work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-claims-she-once-rejected-zohran-mamdani-on-dating-app-hinge-because-of-his-height-2815137-2025-11-07",
      "headline": "Woman claims she once rejected Zohran Mamdani on dating app because of his heightHer confession on her TikTok profile has now gone viral after an X user shared a screenshot of it with the caption \"Fumble of the century.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zarine-khan-sussane-and-zayed-khans-mother-dies-of-cardiac-arrest-2815162-2025-11-07",
      "headline": "Zarine Khan, mother of Sussane and Zayed Khan, dies of cardiac arrestZarine Khan, wife of Sanjay Khan and mother of Sussanne and Zayed Khan, died at her Mumbai home at the age of 81 after a prolonged illness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-season-3-trailer-release-date-cast-plot-prime-video-manoj-bajpayee-jaideep-ahlawat-2815241-2025-11-07",
      "headline": "The Family Man 3 trailer: Manoj Bajpayee's Srikant is on the run, faces new foes'The Family Man Season 3' trailer was launched today in Mumbai ahead of its November 21 premiere. The new season intensifies the espionage drama with Srikant Tiwari on the run from his own agency and new powerful enemies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/nobody-in-country-believes-it-was-pilots-fault-supreme-court-remarks-on-fathers-plea-over-air-india-crash-2815152-2025-11-07",
      "headline": "Don't carry the burden, it wasn't your son's fault: Supreme Court to pilot's fatherThe Supreme Court has firmly stated that the pilot of the Air India Dreamliner crash is not to be blamed, offering solace to the bereaved family. It has also sought responses from authorities on a plea for an independent probe into the tragedy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-salary-kras-for-tesla-details-market-cap-robo-taxi-financial-targets-2815112-2025-11-07",
      "headline": "Elon Musk's $1 trillion payday sounds huge. But can he actually earn it?To actually collect on this historic paycheque, Musk must achieve what Tesla's board calls \"Mars-shot milestones\", a suite of operational and financial targets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/delhi-smog-pollution-crisis-chinas-clean-air-model-looks-good-on-paper-tough-in-reality-2815141-2025-11-07",
      "headline": "Only good on paper: Why Delhi can't borrow China's clean-air modelDespite government measures such as water sprinkling and temporary controls, the pollution remains dangerously high, posing serious public health challenges to the city's millions of residents.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/meet-kumbha-prithviraj-sukumaran-futuristic-look-in-ss-rajamouli-globe-trotter-with-mahesh-babu-priyanka-chopra-2815178-2025-11-07",
      "headline": "Meet Kumbha: Prithviraj Sukumaran's futuristic look in Rajamouli's Globe TrotterSS Rajamouli's team unveiled the first look of Prithviraj Sukumaran as Kumbha from their upcoming film 'Globe Trotter', also starring Mahesh Babu and Priyanka Chopra."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/british-man-escapes-delhi-airport-goes-missing-deportation-fear-manhunt-underway-2815177-2025-11-07",
      "headline": "British national facing deportation flees Delhi airport; manhunt underwayFitz Patrick, a British citizen who arrived from Bangkok on October 28, missed his London flight after arriving late. He then slipped out of the airport terminal instead of staying under watch, prompting a large-scale search operation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-land-deal-probe-rs-1800-crore-plot-sold-for-rs-300-crore-questions-over-ajit-pawars-son-parths-role-2815019-2025-11-07",
      "headline": "Rs 1,800-crore plot sold for just Rs 300 crore: Ajit Pawar's son Parth faces heatThe Maharashtra government has launched a high-level probe into a Rs 1,800-crore land scam linked to Parth Pawar, following an interim report exposing serious irregularities. The investigation aims to uncover procedural lapses and recover state losses in a controversial Pune property deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-2025-voter-turnout-poll-fate-nitish-kumar-nda-lalu-prasad-yadav-2815163-2025-11-07",
      "headline": "How Bihar voter turnouts have decided poll fate of Nitish Kumar, Lalu PrasadBihar elections: An analysis of past elections shows that voter turnout in Bihar tells a compelling story — often determining whether Nitish Kumar or Lalu Prasad forms the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/feminist-icon-jennifer-lawrence-describes-miss-piggy-coproduction-with-emma-stone-2815253-2025-11-07",
      "headline": "Feminist icon: Jennifer Lawrence describes Miss Piggy co-production with Emma StoneJennifer Lawrence says her upcoming co-production of 'Miss Piggy' with Emma Stone is a film that aims to present the protagonist as a feminist icon. The Disney film is being written by Cole Escola.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gouri-kishan-reporter-sexist-question-pa-ranjith-khushbu-sundar-kavin-2815230-2025-11-07",
      "headline": "Pa Ranjith, Khushbu condemn reporter's sexist question to actor Gouri: ShamefulDirector Pa Ranjith, actor-politician Khushbu Sundar, and actor Kavin have publicly condemned a reporter's sexist question directed at Gouri Kishan during a press event for her film 'Others', voicing strong support for the actor and calling for greater respect towards women in the industry."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-pakistan-two-runs-rain-affected-hong-kong-sixes-2025-2815259-2025-11-07",
      "headline": "Hong Kong Sixes: India beat Pakistan by 2 runs in rain-affected thriller India defeated Pakistan by two runs on the DLS method in their Hong Kong Sixes 2025 opener at Mong Kok on Friday. Pakistan won the toss and opted to bowl first, but openers Robin Uthappa and Bharat Chipli gave India a flying start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-winners-amanjot-kaur-harleen-deol-celebrated-chandigarh-2815245-2025-11-07",
      "headline": "World champions Amanjot Kaur, Harleen Deol get grand welcome in Chandigarh World Cup-winning Indian women's cricket team members Amanjot Kaur and Harleen Deol received a grand welcome in Chandigarh on Friday, with families, fans, and supporters greeting them with sweets and the vibrant beats of the dhol as they returned home after India's historic triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-ravi-shastri-sachin-tendulkar-shut-up-2815243-2025-11-07",
      "headline": "India vs Australia: When Ravi Shastri told Sachin Tendulkar to 'shut up' Former India head coach Ravi Shastri recalled the time he told a young Sachin Tendulkar to 'shut up' during a match. Shastri said that the teenager was eager to sledge his opponents, unaware that his batting alone was enough to silence them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jay-shah-ensured-pratika-rawal-got-her-world-cup-medal-reveals-father-2815225-2025-11-07",
      "headline": "Jay Shah ensured Pratika Rawal got her World Cup medal: India star's father India batter Pratika Rawal's father, Pradeep Rawal, has revealed that ICC President Jay Shah personally ensured that his daughter gets the World Cup winner's medal after India's victory over South Africa in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/isnt-rs-4-lakh-per-month-already-a-lot-of-money-supreme-court-asks-shamis-wife-issues-notice-to-cricketer-2815218-2025-11-07",
      "headline": "Isn't Rs 4 lakh a month lot, Supreme Court asks Shami's wife, issues notice to him The Supreme Court has sought responses from Indian cricketer Mohammed Shami and the West Bengal government on a plea filed by his estranged wife, Hasin Jahan, seeking an increase in the monthly maintenance granted to her and their daughter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-jasprit-bumrah-varun-chakravarthy-abhishek-sharma-t20-world-cup-2026-2815161-2025-11-07",
      "headline": "R Ashwin snubs Bumrah in India's two biggest weapons for T20 World Cup 2026 Ravichandran Ashwin has pointed to Abhishek Sharma and Varun Chakravarthy, not Jasprit Bumrah, as the two players teams must focus on to defeat India in the 2026 T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/turkish-football-betting-scandal-arrests-21-referees-club-president-2815175-2025-11-07",
      "headline": "Turkey orders arrest of 17 referees, one club president in football betting probe Turkish prosecutors said on Friday they had ordered the detention of 21 people, including 17 referees and the chairman of an unnamed Super Lig club, as part of a wide-ranging investigation into alleged betting on football matches and possible match-fixing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-absent-new-zealand-west-indies-odi-series-november-2815134-2025-11-07",
      "headline": "After T20I retirement, Kane Williamson pulls out of ODI series vs West Indies Kane Williamson will not feature in New Zealand's ODI squad for the upcoming three-match series against the West Indies, following his recent retirement from T20 internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-icc-womens-player-of-the-month-nomination-world-cup-2815125-2025-11-07",
      "headline": "Mandhana vs Wolvaardt: Mercurial batters nominated for player of the month award Women's World Cup: India's Smriti Mandhana has been nominated for the ICC Women's Player of the Month for October following her outstanding performances in the tournament. She will be vying for the award against Laura Wolvaardt and Ashleigh Gardner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-focus-future-ronaldo-criticism-issues-2815107-2025-11-07",
      "headline": "Manchester United's Ruben Amorim urges focus on future after Ronaldo criticism Manchester United manager Ruben Amorim has responded to Cristiano Ronaldo's sharp remarks that he cannot \"work miracles\" with the current squad, insisting that the club is focused on rebuilding its future rather than revisiting its mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-suryakumar-yadav-r-ashwin-2815106-2025-11-07",
      "headline": "Suryakumar Yadav's 10-ball 20 might be more valuable than you think: Ashwin Former India spinner Ravichandran Ashwin has defended out of form Suryakumar Yadav. Ashwin said that Surya's short bursts might be much more effective in T20Is than what his numbers reflect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/turkish-football-betting-scandal-arrests-21-referees-club-president-2815175-2025-11-07",
      "headline": "Turkey orders arrest of 17 referees, one club president in football betting probe Turkish prosecutors said on Friday they had ordered the detention of 21 people, including 17 referees and the chairman of an unnamed Super Lig club, as part of a wide-ranging investigation into alleged betting on football matches and possible match-fixing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-absent-new-zealand-west-indies-odi-series-november-2815134-2025-11-07",
      "headline": "After T20I retirement, Kane Williamson pulls out of ODI series vs West Indies Kane Williamson will not feature in New Zealand's ODI squad for the upcoming three-match series against the West Indies, following his recent retirement from T20 internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-icc-womens-player-of-the-month-nomination-world-cup-2815125-2025-11-07",
      "headline": "Mandhana vs Wolvaardt: Mercurial batters nominated for player of the month award Women's World Cup: India's Smriti Mandhana has been nominated for the ICC Women's Player of the Month for October following her outstanding performances in the tournament. She will be vying for the award against Laura Wolvaardt and Ashleigh Gardner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-focus-future-ronaldo-criticism-issues-2815107-2025-11-07",
      "headline": "Manchester United's Ruben Amorim urges focus on future after Ronaldo criticism Manchester United manager Ruben Amorim has responded to Cristiano Ronaldo's sharp remarks that he cannot \"work miracles\" with the current squad, insisting that the club is focused on rebuilding its future rather than revisiting its mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-suryakumar-yadav-r-ashwin-2815106-2025-11-07",
      "headline": "Suryakumar Yadav's 10-ball 20 might be more valuable than you think: Ashwin Former India spinner Ravichandran Ashwin has defended out of form Suryakumar Yadav. Ashwin said that Surya's short bursts might be much more effective in T20Is than what his numbers reflect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-investigates-sexual-harassment-allegations-jahanara-alam-2815082-2025-11-07",
      "headline": "Bangladesh Board to investigate Jahanara Alam's sexual harassment allegationsThe Bangladesh Cricket Board (BCB) has announced the formation of a committee to investigate sexual harassment allegations made by former women's team captain Jahanara Alam against former team officials. The board stated that the enquiry panel has been directed to submit its findings and recommendations within 15 working days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-hong-kong-sixes-match-today-2815079-2025-11-07",
      "headline": "India vs Pakistan, Hong Kong Sixes: Livestreaming details, full squadsIndia and Pakistan are set to play against each other in the Hong Kong Sixes. The match will be telecasted and livestreamed in India. Dinesh Karthik will lead the Indian side in the 6-over game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/historic-indias-world-cup-winners-meet-pm-modi-deepti-sharma-reveals-teams-mindset-ytvd-2815075-2025-11-07",
      "headline": "Deepti Sharma on India's Historic Women's World Cup Win & Meeting PM ModiThis special report focuses on the Indian women's cricket team's historic 2025 World Cup victory and their subsequent meeting with Prime Minister Narendra Modi, with insights from all-rounder Deepti Sharma. On her stellar performance, Deepti Sharma stated, 'I think God has already written it. And it has already happened.' Following their maiden World Cup title win against South Africa, where she was named Player of the Tournament, Sharma spoke to India Today's Nitin Srivastav. She reflected on the journey from being runners-up in 2017 to becoming world champions on home soil in 2025. Sharma credited her brother for her success and discussed the challenging start to the tournament, the team's unwavering belief, and the honour of meeting the Prime Minister after achieving their ultimate goal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ollie-robinson-bowls-steve-smith-ashes-warm-up-australia-cricket-2815065-2025-11-07",
      "headline": "Ashes: England's Robinson helps Australia star Steve Smith prepare in Sydney netsOut-of-favour England pacer Ollie Robinson bowled to Australia's stand-in captain Steve Smith during a net session in Sydney on Thursday. Robinson is in Australia to play club cricket for Sydney University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-rising-star-asia-cup-trophy-controversy-2815037-2025-11-07",
      "headline": "Asia Cup trophy yet to return home, but India ready for another Asia CupIt's been over a month since India defeated Pakistan in the Asia Cup T20 final, yet the trophy has still not reached Indian hands. With no presentation or closure, the triumph feels oddly unfinished. Now, as the BCCI confirms participation in the Rising Star Asia Cup, another chapter begins. The familiar rivalry is set to resume, but questions over the ACC's governance continue to linger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-venues-bengaluru-snubbed-ahmedabad-final-2815036-2025-11-07",
      "headline": "Bengaluru snubbed again, Ahmedabad set to host T20 World Cup final: ReportBengaluru is unlikely to host matches in the T20 World Cup 2026. According to a PTI report, the city has been snubbed once again due in the aftermath of the 2025 stampede incident which claimed the life of 11 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-ms-dhoni-comparison-india-vs-south-africa-test-series-rishabh-pant-2815027-2025-11-07",
      "headline": "Why Dhoni-esque Dhruv Jurel deserves spot in Test team alongside Rishabh PantDhruv Jurel once again showcased his composure under pressure with a measured knock against South Africa A in the second unofficial Test. But with Rishabh Pant set to return for the South Africa series, the key question remains — can Jurel retain his place as a specialist batter alongside the Indian vice-captain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-irfan-pathan-varun-aaron-india-vs-australia-2815020-2025-11-07",
      "headline": "You need Gill in T20I side: Ex-cricketers slam India vice-captain's criticsFormer India cricketers Varun Aaron and Irfan Pathan rallied behind Shubman Gill after his composed innings in the fourth T20I against Australia. Gill's 46-run knock, though restrained, proved instrumental in guiding India to victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-rising-star-asia-cup-trophy-controversy-2815037-2025-11-07",
      "headline": "Asia Cup trophy yet to return home, but India ready for another Asia CupIt's been over a month since India defeated Pakistan in the Asia Cup T20 final, yet the trophy has still not reached Indian hands. With no presentation or closure, the triumph feels oddly unfinished. Now, as the BCCI confirms participation in the Rising Star Asia Cup, another chapter begins. The familiar rivalry is set to resume, but questions over the ACC's governance continue to linger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-venues-bengaluru-snubbed-ahmedabad-final-2815036-2025-11-07",
      "headline": "Bengaluru snubbed again, Ahmedabad set to host T20 World Cup final: ReportBengaluru is unlikely to host matches in the T20 World Cup 2026. According to a PTI report, the city has been snubbed once again due in the aftermath of the 2025 stampede incident which claimed the life of 11 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-ms-dhoni-comparison-india-vs-south-africa-test-series-rishabh-pant-2815027-2025-11-07",
      "headline": "Why Dhoni-esque Dhruv Jurel deserves spot in Test team alongside Rishabh PantDhruv Jurel once again showcased his composure under pressure with a measured knock against South Africa A in the second unofficial Test. But with Rishabh Pant set to return for the South Africa series, the key question remains — can Jurel retain his place as a specialist batter alongside the Indian vice-captain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-irfan-pathan-varun-aaron-india-vs-australia-2815020-2025-11-07",
      "headline": "You need Gill in T20I side: Ex-cricketers slam India vice-captain's criticsFormer India cricketers Varun Aaron and Irfan Pathan rallied behind Shubman Gill after his composed innings in the fourth T20I against Australia. Gill's 46-run knock, though restrained, proved instrumental in guiding India to victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-beats-faustino-oro-pranav-pranesh-progress-fide-world-cup-2025-2814973-2025-11-06",
      "headline": "Vidit Gujrathi downs Argentine prodigy, Pranav and Pranesh win in 3rd roundVidit Gujrathi held his nerve to outplay 12-year-old sensation Faustino Oro in the rapid tiebreaks, while Pranav V and Pranesh M also secured clutch wins to extend India's strong run at the FIDE World Cup 2025. The Indian contingent now features seven players in Round 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/quinton-de-kock-unbeaten-123-leads-south-africa-to-eight-wicket-odi-win-over-pakistan-2814965-2025-11-06",
      "headline": "Quinton de Kock's first hundred after return blows away Pakistan in 2nd ODIQuinton de Kock's unbeaten 123 powered South Africa to a comprehensive victory in the second ODI against Pakistan, levelling the three-match series 1-1. De Kock's hundred anchored a dominant chase of 270, with support from Tony de Zorzi and strong bowling performances from Nandre Burger and Nqaba Peter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-waugh-calls-virat-kohli-greatest-odi-player-of-all-time-2814919-2025-11-06",
      "headline": "Steve Waugh ends the debate, calls Virat Kohli greatest ODI player of all timeLegendary Australia captain has named Virat Kohli as the best ODI cricketer in history. Kohli is the second-highest run scorer in the 50-over format with 14,255 runs, including a record 51 centuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-explains-absence-diogo-jota-funeral-2814912-2025-11-06",
      "headline": "Cristiano Ronaldo reveals why he did not attend Diogo Jota's funeralCristiano Ronaldo explains why he chose not to attend Diogo Jota's funeral, saying his presence would have shifted attention away from the grieving family during an emotional time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/deepti-sharma-on-winning-world-cup-pm-modi-lord-hanuman-jai-shree-ram-2814904-2025-11-06",
      "headline": "Winning the World Cup was destiny, God had already written this: Deepti SharmaAll-rounder Deepti Sharma reflected on the team's Women's World Cup 2025 triumph and said the win was written in destiny and God had already planned it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-pm-modi-notices-lord-hanuman-tattoo-india-womens-cricket-world-cup-2814894-2025-11-06",
      "headline": "PM Modi noticing my lord Hanuman tattoo and Insta bio meant a lot: Deepti SharmaIndia all-rounder Deepti Sharma shares her excitement after meeting Prime Minister Narendra Modi. The PM acknowledged her Lord Hanuman tattoo and Instagram bio, highlighting her unique connection with the leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/i-was-trying-to-improve-my-bowling-it-was-not-happening-shivam-dube-2814895-2025-11-06",
      "headline": "I was trying to improve my bowling, it was not happening: Shivam DubeAustralia vs India, 4th T20I: Shivam Dube credited Gautam Gambhir, Suryakumar Yadav and Morne Morkel for helping him improve his bowling skills. Dube took two crucial wickets in India's 48-run win in Gold Coast on Thursday, November 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-shivam-dube-bowling-skills-gautam-gambhir-morne-morkel-2814891-2025-11-06",
      "headline": "Bindaas bowling daal: Shivam Dube enjoys Gautam Gambhir's trust in secondary skillAUS vs IND, 2nd T20I: Once seen as only a middle-order hitter, Shivam Dube is finally earning the trust he waited years for with the ball. Backed by Gautam Gambhir, guided by Morne Morkel and captained by Suryakumar Yadav, Dube is getting opportunities to bowl under pressure and test himself."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}