{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/reserve-bank-of-india-governor-sanjay-malhotra-india-goldilocks-phase-high-growth-low-inflation-2839522-2025-12-21",
      "headline": "India in goldilocks phase with 8% growth, low inflation: RBI GovernorIn an exclusive interview with India Today, Reserve Bank of India (RBI) Governor Sanjay Malhotra described the Indian economy as being in a 'Goldilocks period' characterised by high GDP growth of 8 per cent and low inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-it-difficult-to-run-airline-in-india-aviation-industry-challenges-failures-indigo-airindia-kingfisher-2839324-2025-12-21",
      "headline": "India is flying more, but why do airlines still struggleIndia's skies are busier than ever, airports are expanding, and passengers are flying in record numbers. Yet the business of running an airline remains unforgiving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-new-insurance-amendment-bill-sabka-bima-sabki-rakhsha-decoded-2838964-2025-12-20",
      "headline": "New insurance rules: Will claim settlements improve for policyholders?The new insurance laws strengthen oversight and enforcement. In this special report, IndiaToday.in examines whether that will actually improve claim settlements for policyholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-today-record-high-204-lakh-per-kg-delhi-gold-flat-136-lakh-per-10-grams-2838777-2025-12-19",
      "headline": "Silver slips after hitting record high of Rs 2.04 lakh/kg in Delhi, gold flatSpot silver was trading 0.56 per cent higher at USD 65.85 per ounce in the overseas trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-ports-to-airports-strategy-behind-adani-group-airport-push-jeet-adani-2838773-2025-12-19",
      "headline": "From ports to airports: What pushed Adani Group into aviationJeet Adani, Gautam Adani's younger son and a director at Adani Airports, said the experience gained in ports and logistics helped the group enter aviation with confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-jeet-adani-says-resilience-is-the-next-big-challenge-for-indian-aviation-2838728-2025-12-19",
      "headline": "Why Jeet Adani says resilience is the next big challenge for Indian aviationWhile speaking to India Today, Adani said that aviation is a fragile system in which even small issues can quickly escalate into major problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jeet-adani-navi-mumbai-airport-most-sustainable-in-world-green-energy-solar-mangrove-conservation-2838715-2025-12-19",
      "headline": "Navi Mumbai airport will be one of most sustainable airports in world: Jeet AdaniSpeaking in the 'Jab We Met' segment, Jeet Adani said development and ecology should not be viewed as opposing ideas. He said large infrastructure projects must grow in a way that protects natural systems, as this also helps safeguard long-term assets and operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/built-for-the-future-jeet-adani-on-how-navi-mumbai-airport-changes-mumbai-aviation-2838694-2025-12-19",
      "headline": "Built for the future: Jeet Adani on how Navi Mumbai Airport changes Mumbai aviationJeet Adani said the new airport will unlock long-term growth and improve global connectivity for the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avadhut-sathe-gets-interim-relief-as-sat-defreezes-accounts-for-expenses-2838612-2025-12-19",
      "headline": "Avadhut Sathe gets interim relief as SAT defreezes accounts for expensesIn August, Sebi conducted a search-and-seizure operation at Avadhut Sathe's Karjat Trading Academy as part of a broader crackdown on financial influencers offering market advice without proper registration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-447-points-higher-nifty-above-25900-ril-tata-motors-pv-up-2838547-2025-12-19",
      "headline": "Sensex ends 447 points higher, Nifty above 25,900; RIL up 1%The S&P BSE Sensex added 447.55 points to close at 84,929.36, while the NSE Nifty50 rose 150.85 points to end at 25,966.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-an-sms-or-email-from-the-income-tax-department-heres-what-it-means-2838515-2025-12-19",
      "headline": "Got an SMS or email from the Income Tax Department? Here's what it meansGot an unexpected SMS or email from the Income Tax Department about your transactions and unsure what to do next? The department has clarified the purpose behind these alerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-bid-for-11-airports-amid-indias-air-travel-boom-report-2838460-2025-12-19",
      "headline": "Adani Group to bid for 11 airports amid India's air travel boom: ReportThe Indian government has been leasing out government-owned airports on long-term contracts to private companies. At the same time, it is encouraging the construction of new airports to improve connectivity across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-update-how-big-could-be-the-salary-hike-and-what-to-expect-2838427-2025-12-19",
      "headline": "8th Pay Commission update: How big could be the salary hike and what to expectHere's what central government employees can realistically expect from the 8th Pay Commission now that the 7th CPC's term ends in December 2025 and when the cash might actually hit bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/icici-prudential-amc-share-price-long-short-term-investors-should-do-strategy-hold-sell-2838396-2025-12-19",
      "headline": "ICICI Prudential AMC makes strong debut: What long, short-term investors should doICICI Prudential AMC share price: The listing was slightly below grey market expectations. Ahead of the debut, the IPO was commanding a grey market premium of Rs 520–530, which had indicated possible listing gains of around 24%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/icici-prudential-amc-share-price-strong-debut-20-percent-premium-bse-nse-review-hold-or-sell-2838370-2025-12-19",
      "headline": "ICICI Prudential AMC shares list at 20% premium: Hold or sell?Shares of ICICI Prudential AMC debuted at Rs 2,606.20 on the BSE, marking a premium of 20.38% over the IPO issue price of Rs 2,165. On the NSE, the stock opened at around Rs 2,600, up 20.09%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-stock-market-rising-today-sensex-nifty-jump-bse-nse-us-inflation-soft-asia-market-wall-street-jump-2838350-2025-12-19",
      "headline": "Sensex jumps 500 points: 3 reasons why stock market is rising today?At around 9:45 am, the S&P BSE Sensex jumped 525.11 points to 85,006.92, while the NSE Nifty50 climbed 147.50 points to 25,963.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-fall-sell-or-hold-promoter-bhavish-aggarwal-sells-shares-3rd-stake-sale-2838325-2025-12-19",
      "headline": "Ola Electric shares fall over 60% this year: What should investors do?The stock has now fallen nearly 63% in calendar year 2025, making it one of the worst-performing newly listed technology stocks this year. Ola Electric shares hit a fresh 52-week low of Rs 31.54 on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japan-central-bank-hikes-interest-rates-to-075-per-cent-highest-level-since-1995-2838315-2025-12-19",
      "headline": "Japan's central bank raises rates to 0.75%, highest in 30 yearsThe Bank of Japan raised its short-term policy rate to 0.75% from 0.5%, its first rate hike since January. In a statement, the Bank of Japan said that even after the hike, financial conditions would remain supportive for the economy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/metal-sector-job-creation-aluminium-key-states-income-growth-jobs-story-india-mineral-rich-states-2838312-2025-12-19",
      "headline": "How aluminium is changing the job story in India's mineral-rich statesIndustry estimates cited by the Aluminium Association of India show that the sector has already generated over eight lakh jobs and supports 4,000 SMEs in its downstream ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-300-points-higher-nifty-above-25900-infosys-up-1-percent-2838311-2025-12-19",
      "headline": "Sensex opens 300 points higher, Nifty above 25,900; Infosys up 1%The S&P BSE Sensex jumped 525.11 points to 85,006.92, while the NSE Nifty50 rose 147.50 points to 25,963.30 as of 9:45 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cruz-beckham-denies-unfollow-rumour-says-brooklyn-blocked-david-beckham-victoria-beckham-2839553-2025-12-21",
      "headline": "Not True: Cruz Beckham denies unfollow rumour, says Brooklyn blocked David-Victoria Cruz Beckham shut down rumours of a social media snub within the Beckham family, clarifying that his parents, David and Victoria Beckham, did not unfollow his elder brother Brooklyn on Instagram. Cruz said it was Brooklyn who unfollowed them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saumya-tandon-says-she-slapped-akshaye-khanna-for-real-in-dhurandhar-2839545-2025-12-21",
      "headline": "Saumya Tandon says she slapped Akshaye Khanna for real in Dhurandhar; BTS pics Saumya Tandon revealed that a powerful slap scene with Akshaye Khanna in Dhurandhar was filmed for real and completed in a single take at director Aditya Dhar's insistence on authenticity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-ruth-gets-mobbed-in-hyderabad-days-after-nidhhi-agerwal-incident-2839524-2025-12-21",
      "headline": "Samantha Ruth gets mobbed in Hyderabad days after Nidhhi Agerwal incident. Video Samantha Ruth Prabhu was mobbed by a large crowd during a work-related outing in Hyderabad, days after a similar incident involving Nidhhi Agerwal, with videos of the chaos going viral online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-to-be-seen-in-a-new-avatar-in-mysaa-2839519-2025-12-21",
      "headline": "Rashmika Mandanna to be seen in a new avatar in Mysaa, first glimpse date out The makers of Rashmika Mandanna's Mysaa have announced that the film's first glimpse will be unveiled on December 24, 2025, sharing a striking new poster to mark the update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/david-and-victoria-beckham-unfollow-brooklyn-amid-ongoing-family-rift-2839511-2025-12-21",
      "headline": "David, Victoria Beckham unfollow son Brooklyn amid rift reports; he does the same David and Victoria Beckham have unfollowed their eldest son Brooklyn Peltz Beckham on Instagram, with Brooklyn also cutting social media ties with his parents and siblings, signalling a deepening family rift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/welcome-turns-18-anil-kapoor-pays-tribute-to-feroz-khan-rdx-2839505-2025-12-21",
      "headline": "Welcome turns 18: Anil Kapoor pays tribute to Feroz Khan's RDX Welcome, the 2007 comedy starring Anil Kapoor, Feroz Khan, Akshay Kumar, and others, celebrates its 18th anniversary today, with Kapoor paying tribute to the late Feroz Khan and his iconic RDX character."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-says-she-initially-didnt-like-her-tere-ishk-mein-character-mukti-2839492-2025-12-21",
      "headline": "Kriti Sanon says she initially didn't like her Tere Ishk Mein character Mukti Kriti Sanon shared that she initially disliked her Tere Ishk Mein character Mukti Beniwal, finding her selfish and negative, and even expressed her discomfort to director Aanand L. Rai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-season-9-finale-live-who-will-win-nagarjuna-hosted-show-2839405-2025-12-21",
      "headline": "Bigg Boss Telugu 9 finale live: Kalyan Padala lifts trophy, beats Thanuja Bigg Boss Telugu finale Live updates: The grand finale of Bigg Boss Telugu Season 9 airs tonight, with Kalyan Padala, Pavan, Sanjjanaa Galrani, Thanuja Puttaswamy and Emmanuel battling it out for the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-you-know-tamannaah-bhatia-was-almost-part-of-dhurandhars-shararat-song-2839445-2025-12-21",
      "headline": "Did you know Tamannaah Bhatia was almost part of Dhurandhar's Shararat song? Choreographer Vijay Ganguly shared that Tamannaah Bhatia was initially considered for Dhurandhar's song Shararat, but director Aditya Dhar rejected the idea to ensure the track stayed rooted in the film's narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-returns-comedy-host-wheel-of-fortune-india-nostalgic-promo-2839424-2025-12-21",
      "headline": "Wheel of Fortune India: Akshay Kumar channels Tees Maar Khan vibe in new promo Akshay Kumar appears in a promotional video for the upcoming Wheel of Fortune India show, sparking nostalgia among fans for his iconic comic roles. The actor, known for performances in Hera Pheri and Tees Maar Khan, channels his comedic style in the advertisement shared on Sony TV's social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-made-anupam-kher-nostalgic-about-their-refugee-days-2839420-2025-12-21",
      "headline": "When Kareena Kapoor made Anupam Kher nostalgic about their Refugee days Anupam Kher shared a nostalgic moment after bumping into Kareena Kapoor Khan on a flight to Delhi, revisiting memories from her debut film Refugee and praising her growth over 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-shares-reflective-note-on-recognition-and-innovation-2839419-2025-12-21",
      "headline": "RGV's witty quip on inspiring many great filmmakers is priceless. Read here Ram Gopal Varma recently reflected on inspiring great filmmakers in a post on X. His witty reaction to a social media account has caught the attention of all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumtaz-opens-up-on-charging-rs-20-lakh-for-indian-idol-appearance-with-dharmendra-2839401-2025-12-21",
      "headline": "Mumtaz opens up on charging Rs 20 lakh for Indian Idol appearance with Dharmendra Veteran actor Mumtaz shared that her rare television appearance on Indian Idol 13 alongside Dharmendra came with a fee of Rs 18–20 lakh, explaining why she continues to stay away from TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/narendra-modi-biopic-maa-vande-filming-begins-unni-mukundan-lead-role-2839373-2025-12-21",
      "headline": "PM Narendra Modi biopic Maa Vande starts shoot, Marco actor Unni Mukundan in lead Actor Unni Mukundan has begun shooting for his new film, 'Maa Vande'. The upcoming drama is based on the life of Prime Minister Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-great-indian-kapil-show-4-ep-1-review-same-sofa-same-jokes-bigger-deja-vu-2839364-2025-12-21",
      "headline": "The Great Indian Kapil Show 4 ep 1 review: Same sofa, same jokes, bigger deja vu The first episode of 'The Great Indian Kapil Show' Season 4 premiered on Netflix on December 20, and for comedy lovers, it comes with a small disclaimer. While it may not always tickle your funny bone, it still works as a decent, family-friendly binge-watch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-car-accident-mumbai-minor-injuries-drunk-driver-sunburn-festival-2839349-2025-12-21",
      "headline": "My head bashed on window: Nora Fatehi updates fans after car accident. Watch video After Nora Fatehi sustained minor injuries in a car accident in Mumbai on Saturday afternoon, the actor shared her health update in a video on social media. She described the incident as 'one of the most terrifying and traumatic moments' of her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kiara-advani-toxic-film-march-19-2026-indian-festival-weekend-2839331-2025-12-21",
      "headline": "Yash's Toxic: Kiara Advani as Nadia promises layered, intense turn in first poster The makers of 'Toxic: A Fairytale for Grown-Ups' have released the first official look at Kiara Advani's character, Nadia. This highlights a significant new chapter in both Advani's acting career and the Kannada film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sohail-khan-birthday-celebration-salman-khan-salim-khan-helen-arbaaz-khan-family-unity-2839309-2025-12-21",
      "headline": "Sohail celebrates birthday with Salman, Arbaaz and Khan-daan Sohail Khan celebrated his birthday on Saturday with a family gathering that included Salman Khan, Salim Khan, Helen, and Arbaaz Khan, bringing the Khan family together for the occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendras-final-film-ikkis-aims-to-unite-indian-and-pakistani-audiences-2839272-2025-12-21",
      "headline": "Dharmendra's final wish: India and Pakistan both should see Ikkis Sunny Deol shared a behind-the-scenes video of late veteran actor Dharamendra from his final film 'Ikkis'. The video highlights Dharmendra's hopes for unity through the upcoming movie. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-firmly-with-development-pm-modi-on-mahayutis-massive-win-in-local-body-polls-2839557-2025-12-21",
      "headline": "Maharashtra stands with development: PM Modi on Mahayuti's massive civic poll win UpdatesPM Narendra Modi said Maharashtra's civic poll verdict was a strong endorsement of development-oriented governance as the Mahayuti alliance secured a sweeping win in civic polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-president-mallikarjun-kharge-prime-minister-narendra-modi-assam-infiltrators-remarks-2839520-2025-12-21",
      "headline": "Puts everything on Opposition: Congress chief slams PM over infiltrators remarksKharge pointed out that Assam was being governed under a so-called \"double-engine government\" and questioned why the Prime Minister was shifting the blame to Congress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-express-pilot-captain-virender-sejwal-assault-flier-ankit-dewan-delhi-airport-2839421-2025-12-21",
      "headline": "Casteist remark, threat to family: Pilot accused of assaulting flier respondsCaptain Sejwal bemoaned the \"unfair projecting\" of the incident as a \"pilot vs passenger\" dispute and called the portrayal on social and news media \"one-sided and misrepresentation of facts\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/javed-akhtar-debate-mufti-shamail-nadwi-does-god-exist-gaza-violence-terrorism-majority-2839310-2025-12-21",
      "headline": "In debate on existence of God, Javed Akhtar's 'PM Modi is better' retortThe nearly two-hour debate on 'Does God Exist?' marked a rare public exchange between Javed Akhtar, a legendary screenwriter and an atheist, and Mufti Shamail Nadwi, an Islamic scholar with online clout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/paying-to-get-insulted-why-people-throng-roast-comedy-shows-stand-up-ticket-price-jokes-2838784-2025-12-21",
      "headline": "Paying to get insulted: What makes people throng roast comedy showsAt a time when even a mildly worded tweet can spark outrage, a parallel universe exists inside comedy clubs: one where people pay to get roasted. Comedians are cashing in, turning sharp-tongued jabs into fame and full houses. But what's in it for the patrons?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-snub-mohsin-naqvi-u19-asia-cup-final-pakistan-trophy-presentation-2839504-2025-12-21",
      "headline": "India snub Naqvi after U19 Asia Cup final, PCB chief joins Pakistan celebrationsIndia snubbed Mohsin Naqvi completely during the U19 Asia Cup final post-match presentation while the PCB chairman decided to hand the trophy to Pakistan and celebrate with them after their win on Sunday, November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/central-government-aravalli-mountain-range-mining-push-charge-over-90-per-cent-area-protected-2839538-2025-12-21",
      "headline": "Centre denies Aravalli mining push charge, says over 90% area protectedUnion Environment Minister Bhupender Yadav said claims that the revised definition would destroy the Aravallis were based on misinformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-season-9-finale-live-who-will-win-nagarjuna-hosted-show-2839405-2025-12-21",
      "headline": "Bigg Boss Telugu 9 finale live: Kalyan Padala lifts trophy, beats ThanujaBigg Boss Telugu finale Live updates: The grand finale of Bigg Boss Telugu Season 9 airs tonight, with Kalyan Padala, Pavan, Sanjjanaa Galrani, Thanuja Puttaswamy and Emmanuel battling it out for the trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/david-and-victoria-beckham-unfollow-brooklyn-amid-ongoing-family-rift-2839511-2025-12-21",
      "headline": "David, Victoria Beckham unfollow son Brooklyn amid rift reports; he does the sameDavid and Victoria Beckham have unfollowed their eldest son Brooklyn Peltz Beckham on Instagram, with Brooklyn also cutting social media ties with his parents and siblings, signalling a deepening family rift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-sri-lanka-1st-t20i-match-report-vizag-2839562-2025-12-21",
      "headline": "IND vs SL: No World Cup hangover as India thrash Sri Lanka in 1st T20IThe Indian women's team put on a dominant performance to thrash Sri Lanka by eight wickets to start the T20I series with a win in Vizag on Sunday, December 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/president-droupadi-murmu-gives-nod-to-vb-g-ram-g-bill-replacing-mgnrega-2839466-2025-12-21",
      "headline": "G RAM G Bill gets President Droupadi Murmu's nod, becomes lawPresident Droupadi Murmu has approved the VB-G RAM G Bill, 2025, replacing MGNREGA with a new rural employment law that raises guaranteed work to 125 days, alters funding to a 60:40 Centre-state split and narrows the scope of permissible works.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sridhar-vembu-breaks-silence-on-arattai-app-says-zoho-is-working-on-some-very-important-features-2839297-2025-12-21",
      "headline": "Sridhar Vembu says Zoho is working on some important features for Arattai appZoho founder Sridhar Vembu reveals ongoing weekly updates for Arattai chat app. The company is planning a marketing push once the feature set is perfected, signalling a patient long-term strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sun-halo-sweden-22-degree-sun-dogs-refraction-ice-crystals-optical-phenomenon-winter-sky-watch-video-2839521-2025-12-21",
      "headline": "Watch: Sun gets crowned in magical rings in Sweden. Science explainedA viral video from Jamtland, Sweden, captures a breathtaking 22-degree Sun halo with vivid sun dogs and rainbow arcs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-ruth-gets-mobbed-in-hyderabad-days-after-nidhhi-agerwal-incident-2839524-2025-12-21",
      "headline": "Samantha Ruth gets mobbed in Hyderabad days after Nidhhi Agerwal incident. VideoSamantha Ruth Prabhu was mobbed by a large crowd during a work-related outing in Hyderabad, days after a similar incident involving Nidhhi Agerwal, with videos of the chaos going viral online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/several-flights-cancelled-many-others-delayed-dense-fog-indira-gandhi-international-airport-delhi-air-quality-2839457-2025-12-21",
      "headline": "107 flights cancelled, over 450 others delayed in Delhi due to low visibility, smogFlight tracking data from Flightradar24 showed that over 450 flights faced delays, with departing flights experiencing an average delay of about 36 minutes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/javed-akhtar-churches-empty-youth-reject-faith-without-logic-the-lallantop-does-god-exist-debate-2839463-2025-12-21",
      "headline": "Churches are empty: Javed Akhtar says youth rejecting 'stupid' faiths without logicJaved Akhtar said young people are rejecting faith systems that demand belief without logic or evidence, citing empty churches in Europe as a sign of changing times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/is-silent-resignation-becoming-the-new-normal-for-indias-gen-z-2839403-2025-12-21",
      "headline": "Why is India's Gen Z quietly quitting without resigning?India's Gen Z is redefining disengagement not by walking out of offices, but by emotionally checking out while staying on payrolls. The absence of resignations is masking a deeper crisis brewing inside workplaces.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-552-19-12-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-india-final-sameer-minhas-vaibhav-suryavanshi-final-dubai-2839464-2025-12-21",
      "headline": "India stunned as Pakistan clinch U19 Asia Cup title with 191-run winPakistan beat India by 191 runs in the final to win their second U19 Asia Cup title. Sameer Minhas scored 172, after which Ali Raza's four-wicket haul helped Pakistan bowl their opponents out for 156 in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-attempt-to-breach-india-on-protest-outside-bangladesh-mission-delhi-hindu-man-lynching-2839397-2025-12-21",
      "headline": "No attempt to breach: India on protest outside Bangladesh mission in DelhiIndia dismissed what it called misleading reports about a protest outside the Bangladesh High Commission in New Delhi, saying a small group of youths briefly gathered to protest the lynching of Hindu man Dipu Chandra Das in Bangladesh and were dispersed peacefully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/ghost-schools-in-india-why-5149-government-schools-have-zero-students-2839109-2025-12-21",
      "headline": "Ghost schools in India: Why 5,149 government schools have zero studentsParliament data reveals 5,149 zero-enrolment government schools in India. This deep dive goes further — tracing where these 'ghost schools' are concentrated, why teachers remain posted, and how enrolment, migration and policy failures are quietly reshaping India's education map."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-three-holy-cities-sri-anandpur-sahib-rupnagar-talwandi-sabo-bathinda-galiara-golden-temple-amritsar-2839546-2025-12-21",
      "headline": "Meat, tobacco, alcohol now banned in three holy cities of PunjabSri Anandpur Sahib in Rupnagar district, Talwandi Sabo in Bathinda and the 'Galiara' area around the Golden Temple in Amritsar were granted the 'holy city' status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/volcanic-vortex-rings-mount-etna-smoke-rings-volcano-perfect-circles-rare-phenomenon-viral-video-2839500-2025-12-21",
      "headline": "Watch: Volcano puffs flawless smoke rings. Know the science behindA volcano can casually puff out perfect smoke rings into the sky. There is a simple science behind these rare volcanic vortex rings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/gurugram/story/gurugram-work-from-home-advisory-grap-stage-iv-air-pollution-2839512-2025-12-21",
      "headline": "Gurugram issues work from home advisory for private firms amid GRAP-IV curbsThe Gurugram district administration has advised private offices to allow work from home from December 22, 2025, to curb pollution amid worsening air quality. \r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-sri-lanka-1st-t20i-match-report-vizag-2839562-2025-12-21",
      "headline": "IND vs SL: No World Cup hangover as India thrash Sri Lanka in 1st T20I The Indian women's team put on a dominant performance to thrash Sri Lanka by eight wickets to start the T20I series with a win in Vizag on Sunday, December 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-4000-runs-womens-t20i-record-india-vs-sri-lanka-2839558-2025-12-21",
      "headline": "IND vs SL: Smriti Mandhana hits new milestone after return to cricket Smriti Mandhana crossed a new milestone as she became the second player in women's T20Is to get to the 4,000-run mark during the first match of the series between India and Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-considered-retirement-2023-world-cup-final-loss-2839542-2025-12-21",
      "headline": "Rohit Sharma contemplated retirement after 2023 World Cup: Felt I had nothing left Former India captain Rohit Sharma revealed that he considered retirement after the loss to Australia in the final of the 2023 World Cup. India stumbled at the final hurdle with the Aussies securing a comfortable win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kolkata-knight-riders-secure-cameron-green-rs-25-20-crores-ipl-2026-auction-2839516-2025-12-21",
      "headline": "Green is the future: Why KKR went big for all-rounder in IPL 2026 auction Kolkata Knight Riders head coach Abhishek Nayar details the strategic acquisition of Australian all-rounder Cameron Green at the IPL 2026 auction, highlighting the franchise's intent to strengthen its top order and fill the gap left by Andre Russell's departure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sports-must-get-priority-bhaichung-bhutia-after-lionel-messis-goat-india-tour-2839518-2025-12-21",
      "headline": "Sports must get priority, says Bhaichung Bhutia after Messi's chaotic India tour Former India football captain Bhaichung Bhutia and national team defender Sandesh Jhingan have spoken out following the disorder at Lionel Messi's Kolkata event, highlighting the need for sport to take precedence over politics at major football occasions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indw-vs-slw-1st-t20i-harmanpreet-kaur-gifts-vaishnavi-sharma-maiden-india-cap-international-debut-2839517-2025-12-21",
      "headline": "Who is Vaishnavi Sharma? U19 sensation rewarded with T20I debut in Visakhapatnam IND vs SL, Women's T20Is: India handed a debut to U19 star Vaishnavi Sharma against Sri Lanka, reflecting a bold push to expand depth ahead of the T20 World Cup. The 20-year-old spinner's rise adds fresh promise to the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-snub-mohsin-naqvi-u19-asia-cup-final-pakistan-trophy-presentation-2839504-2025-12-21",
      "headline": "India snub Naqvi after U19 Asia Cup final, PCB chief joins Pakistan celebrations India snubbed Mohsin Naqvi completely during the U19 Asia Cup final post-match presentation while the PCB chairman decided to hand the trophy to Pakistan and celebrate with them after their win on Sunday, November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afc-nations-league-offers-hope-amidst-indian-football-domestic-uncertainty-isl-future-stalemate-2839503-2025-12-21",
      "headline": "Hope for Indian football? Asian Football Confederation set to launch Nations League With ISL governance in limbo and commercial uncertainty mounting, the AFC Nations League arrives as a rare opportunity for India to secure meaningful fixtures and competitive continuity amid domestic turbulence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-sri-lanka-women-1st-t20i-2025-live-updates-match-today-2839487-2025-12-21",
      "headline": "1st T20I Highlights: Jemimah's unbeaten fifty gives India 8-wicket win India Women vs Sri Lanka Women 1st T20I Highlights: A composed finish from India sees Jemimah Rodrigues and Harmanpreet Kaur steer the chase home, capitalising on Sri Lanka's late misfields. Smart rotation under pressure seals a clinical win and highlights India's poise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-india-final-sameer-minhas-vaibhav-suryavanshi-final-dubai-2839464-2025-12-21",
      "headline": "India stunned as Pakistan clinch U19 Asia Cup title with 191-run win Pakistan beat India by 191 runs in the final to win their second U19 Asia Cup title. Sameer Minhas scored 172, after which Ali Raza's four-wicket haul helped Pakistan bowl their opponents out for 156 in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ali-raza-spat-u19-asia-cup-final-2839453-2025-12-21",
      "headline": "Suryavanshi's U19 Asia Cup final flop show: Spat with Ali Raza, slammed by fans Vaibhav Suryavanshi had a day to forget in the U19 Asia Cup Final as he had another poor performance with the bat against Pakistan. Suryavanshi then had a spat with Ali Raza and the fans slammed his performance on the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devon-conway-tom-latham-test-cricket-records-twin-centuries-new-zealand-west-indies-2839399-2025-12-21",
      "headline": "NZ vs WI: Conway, Latham create a first in Tests with twin centuriesDevon Conway and Tom Latham set unprecedented records as New Zealand's opening pair, both scoring two centuries each in the same Test against the West Indies at Bay Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-doubtful-boxing-day-test-australia-ashes-3-0-lead-2839407-2025-12-21",
      "headline": "Job's done: Pat Cummins opts out of MCG Test, emphasises WTC outcome not a concernPat Cummins is set to miss the Boxing Day Test as Australia, having already retained the Ashes, focus on managing risks despite a dominant World Test Championship run. On Sunday, the Aussies took a 3-0 lead in the series with an 82-run win at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-england-ashes-2025-preparation-mistakes-2839406-2025-12-21",
      "headline": "Did England flop in Ashes preparation? Brendon McCullum admits regret after series lossEngland coach Brendon McCullum admitted that his side got their preparations wrong for the Ashes 2025-26 series as Australia retained their crown with a win in the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-3rd-test-day-4-devon-conway-tom-latham-record-partnership-west-indies-daunting-target-2839402-2025-12-21",
      "headline": "Conway, Latham's twin tons put New Zealand in control, West Indies face big chaseNew Zealand's openers made history with twin tons in both innings, setting West Indies 462 on a placid Bay Oval pitch. With all results still possible, the visitors face a stern test of skill and resolve on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-fan-message-kashmir-india-2839385-2025-12-21",
      "headline": "Big Hug: Smriti Mandhana's response for young Kashmiri fangirl wins heartsIndian women's batter Smriti Mandhana won hearts with a touching reply to a young fan in Kashmir as she gears up to chase a historic 4,000-run milestone in Women's T20Is during the five-match series against Sri Lanka.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sameer-minhas-record-u19-asia-cup-final-pakistan-india-2839363-2025-12-21",
      "headline": "Who is Sameer Minhas? Pakistan batter hits 113-ball 172 in U19 Asia Cup finalU19 Asia Cup final, IND vs PAK: Sameer Minhas was at his stupendous best in the grand finale after he scored 172 off 113 balls with 17 fours and nine sixes against India at the ICC Academy Ground in Dubai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-aus-vs-eng-bazball-failed-brendon-mccullum-must-go-geoffrey-boycott-slams-2839355-2025-12-21",
      "headline": "Bazball has failed, McCullum must go: Boycott slams England after Ashes letdownGeoffrey Boycott has launched a blistering attack on Bazball after England's latest Ashes collapse. With Australia retaining the urn, Boycott insists England must change leadership and mindset to avoid repeating familiar failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-besn-stokes-ashes-defeat-australia-third-test-adelaide-press-conference-2839350-2025-12-21",
      "headline": "Can't be so poor: Disappointed Ben Stokes slams England after conceding AshesAshes 2025, AUS vs ENG: Skipper Ben Stokes admitted England's poor execution cost them the Ashes after an 82-run loss at the Adelaide Oval left them 0–3 down, with Australia consistently outplaying them in all departments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-sri-lanka-odi-world-cup-experiment-vaishnavi-sharma-kamalini-t20i-series-2839341-2025-12-21",
      "headline": "Repeating history? India turn to proven ODI World Cup formula for T20I successIND-W vs SL-W: India have taken an experimental approach in their preparations for the T20 World Cup, calling up Vaishnavi Sharma and G Kamalini for the T20I series against Sri Lanka. Both Kamalini and Vaishnavi helped India lift the U19 Women's T20 World Cup earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-squad-sanju-samson-malyalam-entertainer-2839335-2025-12-21",
      "headline": "Sanju Samson's road to T20 World Cup 2026: A Malayalam entertainer in the makingSanju Samson's journey to India's T20 World Cup 2026 squad reads like a Mohanlal-led Mollywood classic — full of promise, setbacks, and quiet resilience before a hometown send-off in Trivandrum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-visit-indian-super-league-uncertain-football-dark-phase-2839283-2025-12-21",
      "headline": "Messi came and left, but Indian football stays stuck in one placeFor a few days, Indian football felt alive again. Once Lionel Messi left, the silence returned, exposing a stalled ISL, anxious players and a system struggling to survive without the glare of spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-ruturaj-gaikwad-maharashtra-captain-full-squad-prithvi-shaw-2839278-2025-12-21",
      "headline": "After ODI heroics, Ruturaj Gaikwad back as Maharashtra captain for Vijay HazareFresh off his maiden ODI century, Ruturaj Gaikwad returns to domestic duty as Maharashtra captain. The Vijay Hazare Trophy offers him a chance to extend his form and lead a strong, balanced squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-live-score-under-19-asia-cup-2025-final-ind-vs-pak-2839262-2025-12-21",
      "headline": "IND vs PAK Highlights: India suffer embarrassing 191-run defeat to PakistanIND U19 vs PAK 19 Highlights: India have suffered an embarrassing defeat by 191 runs to Pakistan in the continental tournament final. A poor batting display from the Indian unit resulted in Pakistan being the sole winners of the tournament for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-vs-eng-adelaide-test-report-ben-stokes-pat-cummins-bazball-2839261-2025-12-21",
      "headline": "England implode once again in Adelaide, lose Ashes after just 11 days of cricketAshes: England lost the Ashes 2025-26 after hosts Australia took a 3-0 lead on Sunday, December 21. Ben Stokes' team were blown away once again and lost the Adelaide Test by 82 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-world-cup-preparations-sri-lanka-series-mandhana-harmanpreet-preview-1st-t20i-2839060-2025-12-21",
      "headline": "After ODI glory, India Women pivot to T20 World Cup preps with Sri Lanka seriesIND-W vs SL-W, 1st T20I: India will begin their preparations for the T20 World Cup with a five-match T20I series against Sri Lanka. The spotlight will be on Harmanpreet Kaur, Smriti Mandhana and other senior players who played pivotal roles in the ODI World Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-jamie-smith-wicket-ponting-aus-vs-eng-adelaide-test-2839241-2025-12-21",
      "headline": "Want to rip my hair out: England fans cannot tolerate Bazball any moreAshes: Jamie Smith's dismissal on the final day of the 3rd Test match had England fans fuming. Batting on 60, Smith lost his wicket trying to hit his third consecutive boundary, leaving England reeling in the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-t20-world-cup-snub-informed-moments-before-bcci-reports-2839242-2025-12-21",
      "headline": "Shubman Gill told of T20 World Cup snub on the day of squad announcement: ReportsShubman Gill's T20 World Cup omission came as a surprise not just to fans but to the batter himself. Reports suggest he was informed only moments before the BCCI made the squad announcement public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-nathan-lyon-injury-limps-off-field-adelaide-test-australia-vs-england-2839236-2025-12-21",
      "headline": "Ashes 2025 3rd Test: Australia suffer big scare as Nathan Lyon limps off injuredAustralia's Ashes momentum was shaken after Nathan Lyon limped off injured on Day 5 in Adelaide. The veteran spinner's hamstring scare has put his series availability under doubt at a critical stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajit-agarkar-shubman-gill-t20-world-cup-2026-selection-analysis-bcci-2839218-2025-12-21",
      "headline": "Often criticised, Ajit Agarkar, BCCI get 10 on 10 for T20 World Cup 2026 squadOften criticised for his selection calls, Ajit Agarkar got things spot on with his bold calls for the T20 World Cup 2026. The snubbing of Shubman Gill, making course corrections, and the recall of Ishan Kishan into the side have seen Agarkar and the BCCI being brave enough to accept their mistakes and select a 10 on 10 team for the upcoming ICC event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-equals-cristiano-ronaldo-record-real-madrid-vs-sevilla-siu-celebration-help-adjust-2839233-2025-12-21",
      "headline": "Kylian Mbappe equals Cristiano Ronaldo's Real Madrid, reveals relationship with idolKylian Mbappe matched Cristiano Ronaldo's iconic Real Madrid calendar-year goal record with a birthday strike. The French star revealed Ronaldo's guidance eased his transition and inspired a symbolic Siu celebration at the Santiago Bernabéu stadium.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}