{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2026-mahatma-gandhi-national-rural-employment-guarantee-act-viksit-bharat-guarantee-for-rozgar-and-ajeevika-mission-gramin-2861515-2026-02-01",
      "headline": "MGNREGA cut, VB-G RAM G gets a boost: Union Budget 2026 signals a rural resetUnder the Budget, VB-G RAM G has been allocated Rs 95,692 crore, positioning it as the single largest component of the Department of Rural Development's spending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-ashwini-vaishnaw-outlines-indias-high-speed-rail-future-semiconductor-mission-20-2861504-2026-02-01",
      "headline": "Ashwini Vaishnaw outlines India's high-speed rail future, semiconductor mission 2.0Union Minister Ashwini Vaishnaw outlined initiatives for developing around 4,000 km high-speed network in India and the next phase of the India Semiconductor Mission, focusing on self-reliance and infrastructure growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-key-challenges-economic-survey-issues-p-chidambaram-nirmala-sitharaman-2861465-2026-02-01",
      "headline": "Budget 2026 ignored 10 key challenges flagged in Economic Survey: ChidambaramFormer Finance Minister P Chidambaram criticised the Union Budget 2026-27 for not addressing core economic challenges flagged in the recent Economic Survey, raising questions on fiscal management and policy priorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/budget/story/hooda-slams-union-budget-2025-26-discriminatory-haryana-empty-handed-2861459-2026-02-01",
      "headline": "Hollow, disappointing: Bhupinder Hooda says Budget 2026 left Haryana empty-handedFormer Haryana CM Bhupinder Singh Hooda termed the Union Budget 2025–26 \"hollow and disappointing,\" alleging it discriminated against Haryana and offered no relief to the common man."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/artificial-intelligence-emerging-technologies-transform-india-union-budget-nirmala-sitharaman-2861436-2026-02-01",
      "headline": "Budget: India AI mission gets big push. AI to boost governance, says SitharamanPresenting the Union Budget 2026–27, Finance Minister Nirmala Sitharaman highlighted the transformative role of artificial intelligence and other emerging technologies. Calling AI a \"force multiplier for better governance,\" she outlined plans for a full-stack, ethical and inclusive AI ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-niamala-tamil-nadu-high-speed-rail-corridor-west-bengal-dankuni-freight-corridor-2861317-2026-02-01",
      "headline": "Has Budget 2026 silently focused on poll-bound Tamil Nadu and West Bengal?While Tamil Nadu walked away with a Rare Earths Corridor, high-speed rails, cash crop boosts and a push for its key archaeological site, West Bengal too gained in the Union Budget 2026-27 through a freight corridor and high-speed rail line. Both the non-BJP states will be holding Assembly polls in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-loses-lustre-for-common-man-in-india-finance-minister-nirmala-sitharaman-2861352-2026-02-01",
      "headline": "The Budget and this analysis. None will change your lifeOnce upon a time, the Union Budget had significance in the everyday life of Indians. Not any more. Yet, out of sheer stubborn habit, we spot the brass band and start swaying senselessly every Budget day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-winners-capex-msmes-ai-technology-losers-corporates-2861328-2026-02-01",
      "headline": "Budget 2026: Who are the winners and losers?Budget 2026: With a 10% hike in capital expenditure, the government has signalled its continued focus on building roads, railways and logistics. Small businesses also get a boost, as do technology and manufacturing. However, the Budget tightens the screws on wealthy investors and corporates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/did-budget-2026-announce-any-tax-relief-for-salaried-taxpayers-here-is-the-answer-2861368-2026-02-01",
      "headline": "Did Budget 2026 announce any tax relief for salaried taxpayers? Here's the answerIncome tax relief is always one of the most closely watched parts of the Union Budget, especially for salaried and middle-class taxpayers. As Budget 2026 was presented in Parliament, many were keen to see whether any changes were announced for those dependent on monthly salaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/futures-and-options-trade-stt-hike-what-it-means-for-retail-investors-2861359-2026-02-01",
      "headline": "STT hike on F&O trade: What it means for retail investorsThe STT hike raises costs and tempers derivatives frenzy, but experts say the broader market remains stable. For retail investors, the shift signals a move toward smarter, slower and more disciplined trading."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mamata-banjerjee-fumes-over-no-west-bengal-mention-humpty-dumpty-budget-2861335-2026-02-01",
      "headline": "Humpty Dumpty Budget: Mamata Banjerjee fumes over no Bengal mentionWest Bengal Chief Minister Mamata Banerjee has strongly criticised the Union Budget 2026-27, labelling it as a 'Humpty-Dumpty Budget' that neglects common people and states like West Bengal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-heavweights-down-budget-day-action-ril-bel-tank-2861321-2026-02-01",
      "headline": "Markets bleed on Budget day: 3 reasons why Sensex fell 1,500 points todayThe S&P BSE Sensex tanked 1,546.84 points to close at 80,722.94, while the NSE Nifty50 lost 495.20 points to end at 24,825.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/buyback-tax-budget-2026-who-gains-and-losers-explained-2861312-2026-02-01",
      "headline": "Buybacks to be taxed as capital gains: Who gains and who loses?Budget 2026 puts buybacks back in the spotlight, reshaping how India Inc returns cash and how investors respond. But in this new regime, who truly gains and who loses?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-revised-income-tax-returns-date-time-limit-deadline-extended-march-31-to-december-31-nirmala-sitharaman-2861294-2026-02-01",
      "headline": "Deadline for filing revised IT returns extended to March 31 from Dec 31The time limit for filing revised income tax returns has been extended to March 31 from December 31, on payment of a nominal fee, Finance Minister Nirmala Sitharaman proposed on Sunday while presenting the Union Budget 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/what-is-the-infrastructure-risk-guarantee-fund-announced-in-budget-2026-2861291-2026-02-01",
      "headline": "What is the Infrastructure Risk Guarantee Fund announced in Budget 2026?Taken together, the Infrastructure Risk Guarantee Fund, higher capital spending and focus on smaller cities point to a more execution-driven approach to infrastructure development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2026-international-travel-tcs-reduced-sitharaman-foreign-trip-cheaper-2861283-2026-02-01",
      "headline": "Budget 2026: International travel to get cheaper as tour package tax cut to 2%Tabling her ninth consecutive Budget in Lok Sabha, Union Finance Minister Nirmala Sitharaman proposed a steep cut in tax collection at source (TCS) on overseas tour packages from the current 5 and 20 per cent to just 2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-tourism-boost-heritage-eco-trails-medical-hubs-2861260-2026-02-01",
      "headline": "Buddhist circuit in Northeast, 15 new heritage sites: Budget bets big on tourismFinance Minister Nirmala Sitharaman announced major tourism initiatives in Budget 2026 to drive growth and employment. Proposals include heritage site development, eco-trails, and medical tourism hubs, aiming to transform tourism into a key economic pillar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-classrooms-to-content-budget-2026s-big-push-for-creator-economy-2861263-2026-02-01",
      "headline": "From classrooms to content: Budget 2026's big push for creator economyFrom schools and colleges to social media platforms, content creation is getting policy backing. Budget 2026 outlines steps to support creators, local languages and creative skills at an early stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-foreigners-indian-equities-non-resident-investors-raised-limits-budget-2026-2861244-2026-02-01",
      "headline": "Budget: Overseas residents, foreigners can now invest directly in Indian stocksKey non-resident investment measures announced in Budget 2026 include raising the individual investment limit for Persons Resident Outside India (PROIs) from 5 per cent to 10 per cent and increasing the aggregate investment cap for all PROIs from 10 per cent to 24 per cent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-infra-defence-ai-cancer-drugs-tax-push-key-details-2861247-2026-02-01",
      "headline": "Big infra, AI data centres boost, massive defence hike, cheaper cancer drugsInfra, tech and manufacturing take the spotlight, but the market reaction adds a twist. Read on for a clearer view of what stood out in Finance Minister Nirmala Sitharaman's Budget 2026 presentation. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-says-bollywood-isnt-making-enough-good-films-we-should-do-better-2861505-2026-02-01",
      "headline": "Shahid Kapoor: We are not making as many good films as we should Actor Shahid Kapoor opened up on the creative challenges filmmakers face today. He emphasised that the Hindi film industry is falling short when it comes to making truly good films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parasakthi-to-stream-on-ott-when-and-where-to-watch-2861475-2026-02-01",
      "headline": "Parasakthi OTT release: When and where to watch Sivakarthikeyan's political drama Sivakarthikeyan and Ravi Mohan's Parasakthi will begin streaming on OTT soon. The film also features Atharvaa Murali, Sreeleela, Kulappulli Leela, Prakash Belawadi and others in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-on-dating-tejasswi-love-is-not-what-you-see-on-social-media-2861450-2026-02-01",
      "headline": "Love is not what you see on Instagram: Karan Kundrra opens up on relationship Karan Kundrra recently reflected on his relationship with Tejasswi Prakash. He emphasised that love is not always what is shown in social media and cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shazia-iqbal-slams-dhurandhar-inciting-hate-and-violence-is-in-its-dna-2861374-2026-02-01",
      "headline": "Did Dhadak 2 director Shazia Iqbal call Dhurandhar a sinister film in cryptic post? Dhadak 2 director Shazia Iqbal has indirectly criticised Dhurandhar, referring to it as a sinister film, inciting hate and violence. Dhurandhar features Ranveer Singh in the lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/film-body-seeks-cm-fadnavis-intervention-after-firing-at-rohit-shetty-juhu-home-2861407-2026-02-01",
      "headline": "Film body seeks CM Fadnavis' intervention after firing at Rohit Shetty's Juhu home The Indian Film & Television Directors' Association (IFTDA) has condemned the firing incident at Rohit Shetty's residence. The film body has also sought Maharashtra Chief Minister Devendra Fadnavis's intervention regarding the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rohit-shetty-cancels-all-plans-asks-friends-to-not-visit-him-for-next-2-days-2861398-2026-02-01",
      "headline": "Rohit Shetty cancels all plans, asks friends to not visit him for next 2 days Rohit Shetty has cancelled all his plans for the next two days following the recent firing incident at his residence. He has also asked close friends not to visit him for the next 48 hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mirzapur-the-film-announce-wrap-up-with-video-from-sets-watch-ali-fazal-pankaj-tripathi-amazon-prime-2861261-2026-02-01",
      "headline": "It's a wrap for Mirzapur The Film, makers share video from sets. Watch The makers of the upcoming gangster drama 'Mirzapur: The Film' announced the film's wrap with a special video from the sets. The movie is created by Puneet Krishna and directed by Gurmmeet Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/video-ram-charan-daughter-klin-kaara-mobbed-at-hospital-fans-slam-crowd-2861327-2026-02-01",
      "headline": "Video: Ram Charan, daughter Klin Kaara mobbed at hospital. Fans slam crowd Ram Charan and his two-year-old daughter Klin Kaara were mobbed outside a Hyderabad hospital. They were visiting Upasana Konidela and the newborn twins.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/scenes-from-a-situationship-modern-relationships-dating-app-dilemmas-indian-indie-cinema-2861269-2026-02-01",
      "headline": "Scenes from a Situationship: Vaibhav Munjal film offers a fresh take on modern love Vaibhav Munjal's directorial debut presents 'Scenes from a Situationship', a candid look at contemporary relationships. It captures the complexities and contradictions experienced by young urban couples."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-sreeleela-team-up-for-upcoming-film-d55-directed-by-rajkumar-periasamy-2861213-2026-02-01",
      "headline": "D55: Sreeleela to star opposite Dhanush in Rajkumar Periasamy film The makers of the tentatively titled 'D55' have announced that Sreeleela has been roped in to star opposite Dhanush in director Rajkumar Periasamy's next film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-marry-udaipur-after-viral-video-claim-heres-the-truth-2861208-2026-02-01",
      "headline": "Rashmika-Vijay to marry in Udaipur as per viral video claim? Here's the truth A viral video by a vlogger claimed that Rashmika Mandanna and Vijay Deverakonda are set to marry on February 2. However, no official confirmation is there from the two actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-meets-uttar-pradesh-cm-yogi-adityanath-divine-encounter-marriage-rumours-2861147-2026-02-01",
      "headline": "Govinda meets Yogi Adityanath, calls it a divine moment. See pic Actor Govinda visited UP Chief Minister Yogi Adityanath in Lucknow during a period of personal scrutiny, sharing a moment he called 'divine'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-film-praised-by-anurag-kashyap-as-courageous-amid-political-debate-2861123-2026-02-01",
      "headline": "Anurag Kashyap calls Dhurandhar a courageous film, dismisses propaganda claims Filmmaker Anurag Kashyap has expressed admiration for the blockbuster 'Dhurandhar', describing it as a courageous mainstream release, while also clarifying his position regarding the film's political stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-crosses-rs-250-crore-mark-strong-box-office-collections-2026-2861086-2026-02-01",
      "headline": "Border 2 box office Day 9: Sunny's film set to rule 2026, crosses Rs 250 crore mark Sunny Deol's war film 'Border 2' surpassed Rs 250 crore at the box office within nine days of release. The film outperformed expectations and held steady against the debut of 'Mardaani 3'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mardaani-3-box-office-collection-rs-10-crore-two-days-strong-audience-response-2861066-2026-02-01",
      "headline": "Mardaani 3 box office Day 2: Rani Mukerji's cop drama stays strong vs Border 2 Rani Mukerji's action thriller 'Mardaani 3' has achieved robust box office numbers in its first two days, holding its own despite competition from 'Border 2' and surpassing the opening collections of earlier films in the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-upasana-konidela-welcome-twins-delighting-fans-chiranjeevi-konidela-2861057-2026-02-01",
      "headline": "Ram Charan and Upasana welcome twins, Chiranjeevi shares joyful update with fans Actor Ram Charan and Upasana Konidela have welcomed twins, a boy and a girl. Chiranjeevi Konidela shared the news on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/why-cant-desi-reality-tv-create-a-uniquely-indian-show-2861038-2026-02-01",
      "headline": "Copy, borrow, rehash: Why can't desi reality TV create a uniquely Indian show? Reality TV in India is all about franchised foreign shows being rehashed in Hindi or local languages. It's time our production houses tried creating truly Indian concepts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rehman-dakait-akshaye-khanna-viral-dance-dhurandhar-box-office-success-2861009-2026-01-31",
      "headline": "Akshaye Khanna grooves to Chaiyya Chaiyya in old clip, fans can't keep calm Akshaye Khanna's old video grooving to Chaiyya Chaiyya has emerged online. Fans reacted to the video and expressed their love for the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kennedy-neo-noir-thriller-anurag-kashyap-premiere-zee5-india-february-2026-2861017-2026-01-31",
      "headline": "Kennedy: Anurag Kashyap's film set for OTT release after world premiere at Cannes The neo-noir thriller 'Kennedy' directed by Anurag Kashyap and starring Rahul Bhat and Sunny Leone, will premiere on ZEE5 on February 20, 2026. The film had its world premiere at the Cannes Film Festival in 2023."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-boycott-mohsin-naqvi-bcci-2861488-2026-02-01",
      "headline": "Pakistan to boycott India match at T20 WC, ICC says not aware of official wordPakistan will play the T20 World Cup but will not play their match against India, confirmed the country's government on Sunday, February 1. Pakistan were set to clash against India on February 15 in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-infra-defence-ai-cancer-drugs-tax-push-key-details-2861247-2026-02-01",
      "headline": "Big infra, AI data centres boost, massive defence hike, cheaper cancer drugsInfra, tech and manufacturing take the spotlight, but the market reaction adds a twist. Read on for a clearer view of what stood out in Finance Minister Nirmala Sitharaman's Budget 2026 presentation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-novak-djokovic-australian-open-career-grand-slam-title-2861389-2026-02-01",
      "headline": "Alcaraz crowns Career Slam dream, keeps Djokovic's historic 25th on holdAustralian Open 2026: Carlos Alcaraz became the youngest man to complete the Career Grand Slam after defeating 10-time champion Novak Djokovic 2-6, 6-2, 6-3, 7-5 on Sunday at the Rod Laver Arena. The loss also prolonged Djokovic's wait for a record-extending 25th Grand Slam title.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-balochistan-liberation-army-attack-bla-rebels-wake-up-call-for-united-states-china-2861402-2026-02-01",
      "headline": "Why the biggest Baloch attack in decades is a wake-up call for US, ChinaA series of coordinated attacks by BLA rebels across Pakistan's province of Balochistan is a wake-up call to both the US and China. Both countries have high stakes in Balochistan centred around resource extraction and access to alternative trade routes. These moves are fuelling the wave of BLA attacks that have struck Pakistan in the past few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-loses-lustre-for-common-man-in-india-finance-minister-nirmala-sitharaman-2861352-2026-02-01",
      "headline": "The Budget and this analysis. None will change your lifeOnce upon a time, the Union Budget had significance in the everyday life of Indians. Not any more. Yet, out of sheer stubborn habit, we spot the brass band and start swaying senselessly every Budget day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-boycott-india-match-icc-t20-world-cup-sanctions-possible-2861508-2026-02-01",
      "headline": "Will ICC punish Pakistan for boycotting India at T20 World Cup?The International Cricket Council has reportedly not received any official or written communication from the Pakistan Cricket Board regarding its decision to boycott India in the ICC Men's T20 World Cup. Sources told India Today that the ICC would consider any action or sanctions only after the PCB formally communicates its position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-heavweights-down-budget-day-action-ril-bel-tank-2861321-2026-02-01",
      "headline": "Markets bleed on Budget day: 3 reasons why Sensex fell 1,500 points todayThe S&P BSE Sensex tanked 1,546.84 points to close at 80,722.94, while the NSE Nifty50 lost 495.20 points to end at 24,825.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-qualify-under-19-world-cup-2026-semi-finals-beating-pakistan-2861507-2026-02-01",
      "headline": "U-19 World Cup: India thrash Pakistan by 58 runs to seal semi-final berthUnder 19 World Cup, IND vs PAK: India qualified for the semi-finals of the Under-19 World Cup 2026 after beating Pakistan by 58 runs at Queens Sports Club in Bulawayo. Asked to chase a target of 253 runs, Pakistan got all out for 194 runs in 46.2 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/dhurandhar-ott-netflix-pakistan-ppp-benazir-bhutto-dilan-teer-bija-hyderabad-weddings-history-fa9la-song-2860579-2026-02-01",
      "headline": "How Dilan Teer Bija from Pak's Lyari became a hit at Indian weddingsA Balochi song, Dilan Teer Bija, has been a must-play at shaadis in India's Hyderabad for years. Dilan Teer Bija was a political song of Benazir Bhutto's time from Karachi's Lyari, the canvas of Dhurandhar. But how did a PPP song become a staple in marriages in India? This Sunday Special reveals the unusual journey of music across borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-niamala-tamil-nadu-high-speed-rail-corridor-west-bengal-dankuni-freight-corridor-2861317-2026-02-01",
      "headline": "Has Budget 2026 silently focused on poll-bound Tamil Nadu and West Bengal?While Tamil Nadu walked away with a Rare Earths Corridor, high-speed rails, cash crop boosts and a push for its key archaeological site, West Bengal too gained in the Union Budget 2026-27 through a freight corridor and high-speed rail line. Both the non-BJP states will be holding Assembly polls in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/global-economic-data-elon-musk-highlights-asia-led-global-economic-growth-2026-india-china-2861284-2026-02-01",
      "headline": "Balance of power is...: Elon Musk as IMF puts India ahead of US in global growthElon Musk said the 'balance of power is changing,' highlighting an eastward shift in the global economy amid trade tensions and moderating inflation trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/defence-budget-2026-hike-pakistan-china-threat-2861233-2026-02-01",
      "headline": "Silent in Budget speech, defence gets big firepower amid Pak, China threatDefence Budget 2026: The massive defence allocation signals the Modi government's continued focus on military readiness and modernisation amid twin threats from Pakistan and China, especially after the brief conflict with Islamabad last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/40s-and-laid-off-what-does-this-budget-have-for-you-2861326-2026-02-01",
      "headline": "40s and laid off: What does this budget have for you?While Budget 2026, presented by Finance Minister Nirmala Sitharaman, bets big on education and skilling, it offers limited answers for mid-career professionals in India facing layoffs, AI-led disruption and growing job insecurity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/budget-support-to-bangladesh-halved-amid-strained-ties-2861295-2026-02-01",
      "headline": "India halves budget support to Bangladesh amid strained tiesBangladesh faces one of the steepest cuts in India's foreign aid, with its allocation reduced from Rs 120 crore to Rs 60 crore, even as assistance to most other neighbouring countries has been maintained or increased."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-weather-forecast-february-2-rain-snow-fog-imd-update-2026-2861458-2026-02-01",
      "headline": "Western Disturbances to bring snow and rain to North India on MondayNorth India prepares for rain and snow on February 2 due to Western Disturbances. Dense fog will continue to affect visibility across Punjab, Haryana, and Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/buyback-tax-budget-2026-who-gains-and-losers-explained-2861312-2026-02-01",
      "headline": "Buybacks to be taxed as capital gains: Who gains and who loses?Budget 2026 puts buybacks back in the spotlight, reshaping how India Inc returns cash and how investors respond. But in this new regime, who truly gains and who loses?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-budget-talked-about-health-but-it-forgot-how-india-breathes-air-pollution-union-budget-2026-fm-nirmala-sitharama-2861322-2026-02-01",
      "headline": "The Budget talked about health, but it forgot how India breathesHandcrafted ByOur Editors The Union Budget had room for cancer care, mental health, biopharma, and even wellness narratives. But in a country choking on pollution and chronic respiratory disease, lung health barely featured. What we don't budget for, we quietly accept as collateral damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-566-30-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/union-budget-2026-state-wise-projects-infrastructure-igh-speed-rails-corridor-west-bengal-uttar-pradesh-kerala-tamil-nadu-assam-odisha-2861285-2026-02-01",
      "headline": "High-speed rails, rare earths corridors, AI data centres: Which state got whatBudget 2026 unveils major projects for states including West Bengal, Tamil Nadu, Kerala, Assam, Uttar Pradesh, and more. Here's a state-wise look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/rohit-shetty-mumbai-firing-house-pune-police-arrest-five-suspects-lawrence-bishnoi-gang-2861324-2026-02-01",
      "headline": "Rohit Shetty house firing: Lawrence Bishnoi gang claims responsibility, 5 detainedPune Police have arrested five suspects linked to the firing outside Rohit Shetty's Mumbai residence, even as the Lawrence Bishnoi gang claimed responsibility for the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/video-ram-charan-daughter-klin-kaara-mobbed-at-hospital-fans-slam-crowd-2861327-2026-02-01",
      "headline": "Video: Ram Charan, daughter Klin Kaara mobbed at hospital. Fans slam crowdRam Charan and his two-year-old daughter Klin Kaara were mobbed outside a Hyderabad hospital. They were visiting Upasana Konidela and the newborn twins.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/did-budget-2026-announce-any-tax-relief-for-salaried-taxpayers-here-is-the-answer-2861368-2026-02-01",
      "headline": "Did Budget 2026 announce any tax relief for salaried taxpayers? Here's the answerIncome tax relief is always one of the most closely watched parts of the Union Budget, especially for salaried and middle-class taxpayers. As Budget 2026 was presented in Parliament, many were keen to see whether any changes were announced for those dependent on monthly salaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-winners-capex-msmes-ai-technology-losers-corporates-2861328-2026-02-01",
      "headline": "Budget 2026: Who are the winners and losers?Budget 2026: With a 10% hike in capital expenditure, the government has signalled its continued focus on building roads, railways and logistics. Small businesses also get a boost, as do technology and manufacturing. However, the Budget tightens the screws on wealthy investors and corporates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/stress-is-leading-to-microromance-but-is-that-any-less-problematic-2856707-2026-02-01",
      "headline": "Does stress make microromance okay?As stress reshapes our inner worlds, it reshapes our love lives too. And maybe sometimes, it does impact how we love and why."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-pakistan-boycott-india-t20-world-cup-reacts-2861518-2026-02-01",
      "headline": "Salman Agha reacts after Pakistan's decision to boycott T20 World Cup game vs India Pakistan skipper Salman Agha reacted to the decision to boycott their T20 World Cup match against India. The Government of Pakistan confirmed that the team would participate in the tournament but would not take the field against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-boycott-india-match-icc-t20-world-cup-sanctions-possible-2861508-2026-02-01",
      "headline": "Will ICC punish Pakistan for boycotting India at T20 World Cup? The International Cricket Council has reportedly not received any official or written communication from the Pakistan Cricket Board regarding its decision to boycott India in the ICC Men's T20 World Cup. Sources told India Today that the ICC would consider any action or sanctions only after the PCB formally communicates its position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-qualify-under-19-world-cup-2026-semi-finals-beating-pakistan-2861507-2026-02-01",
      "headline": "U-19 World Cup: India thrash Pakistan by 58 runs to seal semi-final berth Under 19 World Cup, IND vs PAK: India qualified for the semi-finals of the Under-19 World Cup 2026 after beating Pakistan by 58 runs at Queens Sports Club in Bulawayo. Asked to chase a target of 253 runs, Pakistan got all out for 194 runs in 46.2 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-honours-novak-djokovic-resilience-australian-open-final-2861501-2026-02-01",
      "headline": "Carlos Alcaraz doffs hat to Novak Djokovic for silencing doubters Australian Open: Carlos Alcaraz heaped praise on Novak Djokovic for proving the naysayers wrong by qualifying for the final at Melbourne. Djokovic beat Jannik Sinner in the semis, but lost to Alcaraz in four sets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-chases-25th-grand-slam-australian-open-final-loss-vs-carlos-alcaraz-2861489-2026-02-01",
      "headline": "Novak Djokovic refuses to give up on 25th Grand Slam dream: I always believe I can Novak Djokovic is not ready to walk away from his pursuit of a record-extending 25th Grand Slam title, even after suffering his first-ever defeat in an Australian Open final on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-doubters-historic-australian-open-career-grand-slam-2861477-2026-02-01",
      "headline": "Carlos Alcaraz sounds alarm to his doubters after historic Australian Open win Australian Open 2026: Carlos Alcaraz hit back at his critics after becoming the youngest man to complete the Career Grand Slam, defeating Novak Djokovic in four sets to win the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-boycott-mohsin-naqvi-bcci-2861488-2026-02-01",
      "headline": "Pakistan to boycott India match at T20 WC, ICC says not aware of official word Pakistan will play the T20 World Cup but will not play their match against India, confirmed the country's government on Sunday, February 1. Pakistan were set to clash against India on February 15 in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-whitewash-australia-t20i-series-lahore-mohammad-nawaz-2861474-2026-02-01",
      "headline": "Pakistan warm up for T20 World Cup with historic T20I series clean sweep vs Australia PAK vs AUS, 3rd T20I: Salman Ali Agha's Pakistan hammered Australia by 111 runs in the third T20I to complete a 3-0 whitewash as a big boost before the T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-karnataka-andhra-jharkhand-jk-through-to-quarterfinals-with-mumbai-2861470-2026-02-01",
      "headline": "Karnataka, Andhra, Jharkhand, J&K through to quarterfinals with Mumbai Karnataka, Andhra, Jharkhand and Jammu & Kashmir sealed their places in the Ranji Trophy quarterfinals on a dramatic final day of group-stage action, joining already-qualified Mumbai in the knockout round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-beats-novak-djokovic-australian-open-2026-nadal-tribute-2861453-2026-02-01",
      "headline": "Novak Djokovic's moving shoutout to Rafael Nadal steals spotlight after Aus Open final Novak Djokovic paid an emotional tribute to Rafael Nadal during the Australian Open ceremony, honouring the 22-time Grand Slam champion who watched from the stands. Despite dominating the first set, Djokovic ultimately fell to Carlos Alcaraz, who completed a Career Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-88-year-record-career-grand-slam-history-aus-open-2861444-2026-02-01",
      "headline": "Carlos Alcaraz breaks 88-year record, rewrites history with Career Grand SlamCarlos Alcaraz ended an 88-year wait on Sunday night, completing a career Grand Slam with a four-set victory over Novak Djokovic in the Australian Open final. Aged 22 years and 272 days, the Spaniard became the youngest man in history to win all four major singles titles, surpassing the record set by Don Budge in 1938."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-vs-up-warriorz-wpl-2026-updates-jemimah-rodrigues-2861451-2026-02-01",
      "headline": "Delhi Capitals vs UP Warriorz, Live Score: UP eliminated as DC need 123 to qualifyDC vs UPW, WPL 2026 Live Score: UP Warriorz have been knocked out of the tournament as they needed at least 157 runs to stay in the hunt. Delhi Capitals, on the other hand, need 123 runs to qualify for the Eliminator and knock Mumbai Indians out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-final-defeat-carlos-alcaraz-future-retirement-2861434-2026-02-01",
      "headline": "Djokovic leaves retirement call to the almighty after Australian Open final defeatAustralian Open: Novak Djokovic hinted at an uncertain future after his Australian Open final loss to Carlos Alcaraz, admitting he never expected to be back at a Grand Slam closing ceremony at this stage of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-no-handshake-policy-u19-world-cup-ayush-mhatre-farhan-yousaf-2861415-2026-02-01",
      "headline": "India, Pakistan captains continue no handshake policy in Under-19 World Cup 2026India and Pakistan continued their no-handshake policy during their Super Six match in the Under-19 World Cup 2026. The two teams have not done handshakes since the Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-novak-djokovic-australian-open-career-grand-slam-title-2861389-2026-02-01",
      "headline": "Alcaraz crowns Career Slam dream, keeps Djokovic's historic 25th on holdAustralian Open 2026: Carlos Alcaraz became the youngest man to complete the Career Grand Slam after defeating 10-time champion Novak Djokovic 2-6, 6-2, 6-3, 7-5 on Sunday at the Rod Laver Arena. The loss also prolonged Djokovic's wait for a record-extending 25th Grand Slam title.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/devika-sihag-wins-thailand-masters-bwf-super-300-goh-jin-wei-retires-2861337-2026-02-01",
      "headline": "Devika Sihag secures maiden Super 300 title at Thailand MastersYoung Indian shuttler Devika Sihag clinched her first BWF Super 300 title at the Thailand Masters. Sihag was leading 21-8, 6-3 when her opponent Goh Jin Wei pulled out due to a hamstring injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-goods-manufacturing-rs-500-crore-boost-union-budget-2026-india-2861349-2026-02-01",
      "headline": "Union Budget allocates Rs 500 crore to boost sports goods manufacturing in IndiaIndia's sports sector received a major boost in the Union Budget, with a first-ever Rs 500 crore allocation for sports goods manufacturing and a sharp rise in overall funding."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-u19-dominate-india-vaibhav-suryavanshi-struggles-u19-world-cup-2861274-2026-02-01",
      "headline": "Let off twice, but Vaibhav Suryavanshi fails to cash in; another failure vs PakU19 World Cup 2026: Vaibhav Suryavanshi struggled to again make an impact against Pakistan, scoring 30 off 22 balls before Mohammad Sayyam accounted for his wicket in the Super 6 match in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/union-budget-2026-government-proposes-khelo-india-mission-to-transform-sports-2861237-2026-02-01",
      "headline": "Union Budget 2026: Government proposes Khelo India mission to transform sportsThe government on Sunday proposed the launch of a Khelo India mission aimed at strengthening India's sports ecosystem over the next decade, expanding the scope of the existing programme beyond talent identification to include systemic development of infrastructure, coaching and support systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-miss-t20-world-cup-announce-new-domestic-tournament-2861217-2026-02-01",
      "headline": "No T20 World Cup, no problem. Bangladesh rolls out their own domestic T20 CupFollowing the ICC's decision to replace Bangladesh with Scotland for the ICC Men's T20 World Cup 2026, the Bangladesh Cricket Board has moved swiftly to address the gap, announcing the launch of a new domestic tournament—the ODOMMO Bangladesh T20 Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-under-19-world-cup-live-score-vaibhav-suryavanshi-sameer-minhas-2861204-2026-02-01",
      "headline": "IND vs PAK, Highlights: India hammer Pakistan, storm into semi-final unbeatenIND vs PAK, U-19 World Cup Highlights: India have made their way through to the semi-final after beating Pakistan by 58 runs in the Super 6 clash on Sunday in Bulawayo. Pakistan, on the other hand, failed to qualify for the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-carlos-alcaraz-vs-novak-djokovic-final-live-score-updates-melbourne-2861165-2026-02-01",
      "headline": "Carlos Alcaraz lifts trophy, Novak Djokovic thanks fans after an epic finalAustralian Open men's singles Highlights: Carlos Alcaraz has defeated Novak Djokovic in four sets to win his maiden Australian Open title, becoming the youngest man in the Open Era to complete the Career Grand Slam. Meanwhile, Novak Djokovic lost his first-ever Australian Open title.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ishan-kishan-sanju-samson-tatkal-ticket-playing-xi-ind-vs-nz-century-2861122-2026-02-01",
      "headline": "Ishan Kishan grabs the Tatkal ticket. Is Sanju Samson back on the waiting list?Has one dominant T20I series reshaped India's batting hierarchy? Ishan Kishan's surge has brought urgency and clarity, while Sanju Samson's struggles have reopened familiar questions on the eve of a T20 World Cup title defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-ishan-kishan-abhishek-sharma-threats-mitchel-santner-thiruvananthapuram-2861107-2026-02-01",
      "headline": "If Abhishek doesn't get you, Ishan will: NZ skipper Santner on India's Trivandrum showIshan Kishan's Thiruvananthapuram hundred left New Zealand out of options, forcing Mitchell Santner to put his hands up. With the T20 World Cup days away, India's batting firepower is peaking at the right time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-djokovic-vs-alcaraz-mens-final-preview-head-to-head-rivalry-difficult-vs-impossible-melbourne-2861050-2026-02-01",
      "headline": "Djokovic vs Alcaraz: Melbourne Park braces for ultimate Difficult vs Impossible clashAustralian Open: Carlos Alcaraz and Novak Djokovic are all set for a blockbuster final at Melbourne Park on Sunday. While Djokovic is looking for his 25th Grand Slam title, Alcaraz is one win away from a Career Slam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-chelsea-vs-west-ham-cucurella-adama-traore-fight-todibo-strangles-joao-pedro-2861052-2026-02-01",
      "headline": "Watch: Chelsea vs West Ham thriller ends in ugly brawl as Todibo strangles Joao PedroChelsea completed a stunning 3–2 comeback against West Ham at Stamford Bridge, but victory was eclipsed by chaos. A stoppage-time brawl ended with Todibo sent off for throttling Joao Pedro, turning a thriller into flashpoint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-delhi-capitals-risk-first-wpl-playoff-miss-2026-2861005-2026-02-01",
      "headline": "The Jemimah Rodrigues struggle: Why the Delhi captain is faltering in close matchesWPL 2026: Jemimah Rodrigues has endured a mixed season as captain, with Delhi Capitals on the brink of an early exit from the tournament. The challenges have been compounded by her struggles with the bat, making it a testing campaign both as a leader and as a batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-final-carlos-alcaraz-vs-novak-djokovic-livestreaming-details-india-2861034-2026-02-01",
      "headline": "Alcaraz vs Djokovic live streaming: When and where to watch Australian Open finalNovak Djokovic and Carlos Alcaraz meet in the Australian Open men's singles final. The match could redefine tennis history with records and legacies on the line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-maiden-t20i-hundred-wicketkeeping-india-beat-new-zealand-5th-t20i-2861033-2026-02-01",
      "headline": "IND vs NZ: Why did Ishan Kishan keep in place of Samson? Suryakumar Yadav explainsIshan Kishan took over wicketkeeping duties and scored his maiden T20I hundred in the fifth match against New Zealand. This planned rotation strategy boosts India's preparation and confidence ahead of the T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ishan-kishan-century-t20i-comeback-t20-world-cup-2026-target-2861028-2026-01-31",
      "headline": "Kishan not satisfied with New Zealand comeback, sets sights on World Cup gloryIshan Kishan scored a stunning century in the final T20I against New Zealand in Thiruvananthapuram. He remains focused on winning the T20 World Cup in 2026 despite his comeback success."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}