{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gccs-global-capability-centres-push-indias-office-leasing-to-new-heights-report-2751996-2025-07-07",
      "headline": "GCCs push India's office leasing to new heights: ReportGCCs are no longer coming to India just for cheaper costs. They now see India as a strong base for talent, innovation and large modern offices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-increase-watch-derivative-trading-sanjay-malhotra-jane-street-ban-fo-stock-market-news-2751986-2025-07-07",
      "headline": "Sebi to intensify watch on derivatives trading after Jane Street episodeIndia is currently the world's largest equity derivatives market. According to the Futures Industry Association, it accounted for nearly 60% of the derivatives contracts traded globally in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/emis-hurt-india-middle-class-more-than-inflation-says-financial-expert-2751948-2025-07-07",
      "headline": "EMIs hurt India's middle class more than inflation, says financial expertToday, almost everything is available on easy monthly instalments, from a new phone to flight tickets, even groceries. What was once a helpful option has now turned into a lifestyle. However, this is silently eating into people's income, leaving little room for savings or emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-7-common-errors-new-taxpayers-must-avoid-2751883-2025-07-07",
      "headline": "Filing ITR for the first time? 7 common errors new taxpayers must avoidFiling your ITR is not enough. You must verify it too. If you forget, the tax department treats it as if you never filed it at all. You can e-verify using Aadhaar OTP, net banking, or by sending a signed physical copy. Without verification, your return stays incomplete."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/house-rent-above-rs-50000-heres-the-tds-rule-you-need-to-know-2751860-2025-07-07",
      "headline": "House rent above Rs 50,000? Here's the TDS rule you need to knowFor tenants living in high-rent homes, the line between a routine payment and a tax lapse can be thinner than it seems, and ignoring it can invite penalties that quickly snowball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-hindustan-unilever-q1-results-brokerage-views-ubs-nuvama-should-you-buy-2751850-2025-07-07",
      "headline": "HUL shares gain 2% today. Should you buy the FMCG stock?HUL share price: The stock has gained 3.67% in the last five trading sessions. However, when looking at a longer time frame, the stock is still down 7.97% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-rs-18-lakh-in-6-months-financial-advisor-abhishek-walia-warning-on-online-betting-2751836-2025-07-07",
      "headline": "Lost Rs 18 lakh in 6 months: Financial advisor's warning on online bettingWhat begins as casual fun can spiral into secrecy, debt, and broken trust. A financial advisor warns that, without strong regulation, betting apps are fast becoming one of India's biggest financial threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariffs-steel-auto-aluminium-interim-trade-deal-us-trump-deadline-commerce-2751832-2025-07-07",
      "headline": "Tariffs on steel, auto unlikely in interim trade deal with US: Government sourcesWith the US to soon notify countries of higher tariffs by July 9, with new rates effective August 1, sectoral levies on steel, auto and aluminium are unlikely in the India-US interim trade deal, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-lower-nifty-below-25500-hul-up-1-percent-2751812-2025-07-07",
      "headline": "Sensex opens 100 points lower, Nifty below 25,500; HUL up 2%The S&P BSE Sensex was down by 65.28 points to 83,367.61, while the NSE Nifty50 lost 16.45 points to 25,444.55 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-trade-letters-india-deal-global-trade-what-to-expect-stock-market-2751802-2025-07-07",
      "headline": "Trump reveals tariff letter plan with a twist: Here's what's coming nextTrump also said that any country supporting what he called the 'Anti-American policies' of the BRICS group will face an additional 10% tariff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trade-setup-trump-tariff-trade-deal-india-bse-nse-2751784-2025-07-07",
      "headline": "Stock market opening: Will Sensex, Nifty fall as Trump singals delay in tariffs?The Gift Nifty futures were trading at 25,512 as of 8:08 am., suggesting that the Nifty 50 may open around its previous close of 25,461. Sensex and Nifty declined by 0.7% each last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-5-confirmed-for-2026-season-4-breaks-franchise-records-2752007-2025-07-07",
      "headline": "Panchayat Season 5 confirmed for 2026 after Season 4 breaks franchise recordsThe new season of TVF's 'Panchayat' has been renewed for 2026. After the success of season 4, the Prime Video series has confirmed season 5 of the comedy-drama series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-first-official-look-from-kyunkii-saas-bhi-kabhi-bahu-thi-is-pure-nostalgia-see-pic-2752017-2025-07-07",
      "headline": "Smriti Irani's first official look from Kyunkii Saas... is pure nostalgia. See picActor Smriti Irani reprises her iconic character - Tulsi Virani - in the new season of the popular show 'Kyunkii Saas Bhi Kabhi Bahu Thi.' The actor's first-look from the show is now out and being circulated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-on-india-got-latent-controversy-grateful-2751849-2025-07-07",
      "headline": "Grateful that it happened to me: Apoorva Mukhija on India's Got Latent controversySocial media influencer Apoorva Mukhija expressed gratitude for 'India's Got Latent' row. She reflected on how the controversy led to personal growth and detachment from online negativity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-gunn-discusses-themes-of-humanity-in-david-corenswet-superman-says-its-about-an-immigrant-2751991-2025-07-07",
      "headline": "James Gunn says Superman is an immigrant story, may not resonate with allThe upcoming film 'Superman', directed by James Gunn, is portrayed as a tale of America through the eyes of an immigrant seeking hope and purpose. It delves into themes of basic human kindness, morality, and politics, highlighting the contrasting beliefs between Superman and Lois Lane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-shares-fangirl-moment-with-katrina-kaif-in-an-old-video-2751983-2025-07-07",
      "headline": "Zareen Khan shares fangirl moment with Katrina Kaif in an old video. WatchZareen Khan shared a throwback video of her taking Katrina Kaif's autograph at the 'Race' (2008) premiere, calling it a true fangirl moment. She recalled how she never imagined being part of the film industry back then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-rashmika-mandanna-first-kodava-actor-claim-upset-her-own-community-2751981-2025-07-07",
      "headline": "Why Rashmika Mandanna's 'first Kodava actor' claim has angered her communityActor Rashmika Mandanna, in a recent interview, called herself the first Kodava actor. Her claim has angered the artistes who had entered the film industry before her.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ishaan-khatter-changed-17-homes-by-age-16-calls-it-bombays-struggling-lifestyle-2751890-2025-07-07",
      "headline": "Ishaan Khatter changed 17 homes by age 16, calls it Bombay's struggling lifestyleActor Ishaan Khatter talked about his modest upbringing in a recent interview. He shared that he had to live in 17 different homes by the time he turned 16, citing what he called a 'Bombay struggling lifestyle'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/andrew-garfield-monica-barbaro-twin-in-white-confirm-relationship-at-wimbledon-2025-2751920-2025-07-07",
      "headline": "Andrew Garfield-Monica Barbaro twin in white, confirm relationship at Wimbledon 2025Actor Andrew Garfield and his girlfriend, Monica Barbaro, were twinning in white at Wimbledon 2025 while sharing sweet PDA moments. The couple were rumoured to be dating since earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imtiaz-ali-mother-75th-birthday-bash-in-pahalgam-2751960-2025-07-07",
      "headline": "Filmmaker Imtiaz Ali celebrates his mother's 75th birthday in PahalgamFilmmaker Imtiaz Ali celebrated his mother's 75th birthday in Pahalgam, sharing moments from the celebration on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-honoured-with-bihar-gaurav-award-says-forever-a-proud-bihari-2751947-2025-07-07",
      "headline": "Gurmeet Choudhary honoured with Bihar Gaurav Award, says forever a proud BihariActor Gurmeet Choudhary was honoured with the Bihar Gaurav Award by Chirag Paswan and Governor Arif Mohammed Khan for his contributions to entertainment. Calling it a proud moment, the actor shared photos from the event and said that Biharis are known by their actions, not words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raghav-juyal-kill-gets-a-tamil-remake-dhruv-vikram-to-play-lead-reports-2751958-2025-07-07",
      "headline": "Raghav Juyal's Kill gets a Tamil remake, Dhruv Vikram to play lead: ReportsThe Bollywood action-thriller 'Kill', featuring Lakshya and Raghav Juyal, is set for a Tamil remake. The film might have Dhruv Vikram as the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-ramayana-film-150-crore-earnings-diwali-2026-2751930-2025-07-07",
      "headline": "Here's how much Ranbir Kapoor is being paid for the two Ramayana filmsActor Ranbir Kapoor is set to earn a hefty sum for his role in the two-part Ramayana films. The project promises a visual spectacle and features a star-studded cast, aiming to captivate a global audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-legal-notice-real-estate-endorsement-complaint-2751934-2025-07-07",
      "headline": "Actor Mahesh Babu gets legal notice for promoting real estate firmTelugu star Mahesh Babu has been issued a legal notice by the Rangareddy District Consumer Commission over his role as a brand ambassador for a real estate firm accused of misleading consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fool-volume-trailer-vir-das-brings-wit-wisdom-laughter-new-standup-show-2751876-2025-07-07",
      "headline": "Fool Volume trailer: Vir Das brings wit, wisdom and laughter in new standup showThe trailer of 'Vir Das: Fool Volume' released on July 7. The upcoming Netflix standup comedy show is scheduled for a July 18 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-to-make-a-special-appearance-in-ranveer-singh-don-3-sources-2751923-2025-07-07",
      "headline": "Shah Rukh Khan to make a special appearance in Ranveer Singh's Don 3: SourcesShah Rukh Khan will reportedly make a surprising cameo in Ranveer Singh's 'Don 3'. The film is currently in works. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jennifer-aniston-says-the-morning-show-is-layered-complicated-nothing-like-friends-2751886-2025-07-07",
      "headline": "Jennifer Aniston says The Morning Show is layered, complicatedJennifer Aniston shared insights into the demanding and emotionally charged production of Apple TV's 'The Morning Show'. She also highlighted its difference from her earlier work in 'Friends'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-f1-the-movie-review-opinion-brad-pitt-hans-zimmer-2751527-2025-07-07",
      "headline": "Brad Pitt's F1 is a familiarly unfamiliar ride across your favourite racing circuit'F1 - The Movie' seemed to be like any other sports film that we have seen in the past with the same themes, moments and plot twists. Yet, the Brad Pitt-starrer leaves behind a fresh feeling for a viewer, who may or may not be an ardent fan of Formula One. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-in-tears-at-mumbai-airport-amid-cryptic-social-media-post-2751839-2025-07-07",
      "headline": "Nora Fatehi in tears at Mumbai airport amid cryptic social media postBollywood actor Nora Fatehi was seen crying at Mumbai airport. Before the incident, she had shared a cryptic post on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-on-bollywood-rejection-nobody-wanted-to-launch-amitabh-bachchan-son-2751857-2025-07-07",
      "headline": "Nobody wanted to launch Amitabh Bachchan's son: Abhishek on industry's rejectionAbhishek Bachchan reflected on his initial days in the industry and shared that he faced initial rejections due to his father's giant film legacy. He said directors were hesitant to launch him, fearing expectations."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-revelations-nia-custody-mumbai-terror-attacks-26-11-pakistan-connection-2751903-2025-07-07",
      "headline": "Trusted by Pak army, was part of 26/11 plan: Tahawwur Rana's explosive revelationsDuring questioning by the Mumbai Crime Branch in NIA custody, Tahawwur Rana confirmed his presence in Mumbai during the 26/11 attacks and that it was part of the terrorists' plan, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-oppose-tariffs-being-used-as-tool-to-coerce-others-china-on-trumps-fresh-threat-to-brics-nations-2751957-2025-07-07",
      "headline": "Brics not seeking confrontation: China calls Trump's tariff threat coercion toolThe Chinese foreign ministry said that the use of tariffs benefits no one and opposed the idea of using tariffs as a tool to coerce others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-no-cabinet-remark-himachal-pradesh-cloudburst-mandi-visit-2751969-2025-07-07",
      "headline": "Way of expression: Kangana Ranaut firm on 'no Cabinet' remark over disaster aidAfter her 'no Cabinet post' remark while seeking disaster relief for rain-hit Himachal Pradesh, BJP MP Kangana Ranaut remained firm on her statement, saying it was not controversial and a way of expression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-politicians-drunk-son-rams-into-influencers-car-abuses-her-on-camera-2752022-2025-07-07",
      "headline": "Mumbai politician's drunk son rams into influencer's car, abuses her on cameraRajshree More claimed on social media that Rahil Javed Shaikh, son of Mumbai politician Javed Shaikh, caused her accident in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/are-you-in-a-wellness-trap-when-self-care-harms-your-mental-health-stress-anxiety-depression-deepika-padukone-2751980-2025-07-07",
      "headline": "Are you caught in the 'wellness trap'? When self-care backfires on mental healthGreen smoothies to gratitude journals, India's self-care boom does promise healing. But is it also quietly triggering anxiety and burnout instead? Doctors say health is at the receiving end of this burden of \"being well\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asim-munir-pakistan-kargil-hero-karnal-sher-khan-india-letter-bajwa-nishan-e-haider-disowned-body-first-2751972-2025-07-07",
      "headline": "Munir hails Pak Kargil War hero, but a letter from India revealed his bravery firstAs Pakistan Army Chief Asim Munir, along with the top military brass, paid tribute to Kargil War hero, Captain Karnal Sher Khan, on his 26th martyrdom anniversary, it's worth remembering that it was an Indian Brigadier's letter that first ensured Khan's bravery didn't go unrecognised. Pakistan had initially disowned Sher Khan and refused to claim his body from Indian soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about me, do well for India: Akash Deep's sister amid cancer battleIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-businessman-shot-dead-abohar-police-cctv-sanjay-verma-bishnoi-gang-2752004-2025-07-07",
      "headline": "Punjab businessman shot dead in broad daylight, Bishnoi gang claims responsibilityTextile merchant Sanjay Verma was shot dead outside his showroom by three masked assailants in Punjab's Abohar. Police have sealed all entry and exit points of the town and the hunt for the accused is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-first-official-look-from-kyunkii-saas-bhi-kabhi-bahu-thi-is-pure-nostalgia-see-pic-2752017-2025-07-07",
      "headline": "Smriti Irani's first official look from Kyunkii Saas... is pure nostalgia. See picActor Smriti Irani reprises her iconic character - Tulsi Virani - in the new season of the popular show 'Kyunkii Saas Bhi Kabhi Bahu Thi.' The actor's first-look from the show is now out and being circulated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-defeat-pakistan-propaganda-social-media-lt-general-rahul-singh-pib-2751938-2025-07-07",
      "headline": "Did Army General admit India's defeat to Pakistan? Centre's one-word clarificationPakistani propaganda posts claiming Lt Gen Rahul Singh admitted India's defeat in the recent conflict with are fake, the PIB has clarified, dismissing the viral quotes as completely baseless claims. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/special-intensive-revision-sir-electoral-rolls-bihar-citizenship-verification-election-commission-opposition-rjd-congress-2750969-2025-07-07",
      "headline": "Voter rolls revision is legal, moral and essential. So, what's the problem?An intensive vetting of electoral rolls is a must to ensure that only Indian citizens get to decide on the country's politics and policy. If the Election Commission (EC) is mandated to conduct a special intensive revision (SIR) of voter lists, why is there such opposition to the exercise in Bihar from political parties?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-orders-shutdown-kabootar-khanas-mumbai-health-hazards-pigeon-droppings-2751945-2025-07-07",
      "headline": "No more 'kabootar khanas' in Mumbai: Why state ordered closure of feeding zonesShiv Sena leader Manisha Kayande said these 'kabootar khanas' pose a danger to the people living around them as their waste and feathers lead to respiratory diseases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-nico-hulkenberg-podium-lando-norris-oscar-piastri-ignore-2751837-2025-07-07",
      "headline": "Selfish Norris, Piastri slammed for ignoring Hulkenberg on British GP podiumNico Hulkenberg secured his first ever Formula 1 podium at the British Grand Prix. At the celebrations, he was ignored by both McLaren drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indore-woman-harassed-beef-religion-conversion-begusarai-love-jihad-facebook-2751758-2025-07-07",
      "headline": "Forced to eat beef, convert religion: Indore woman accuses husband of 'love jihad'A woman from Indore alleged mental and physical harassment by her husband in Bihar over her refusal to eat beef and convert her religion. She approached police seeking to return home, while the husband denied all allegations.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-disinformation-campaign-rafale-fighter-jets-india-operation-sindoor-pakistan-france-2751769-2025-07-07",
      "headline": "Why China ran disinformation campaign against Rafale jets after India's Op SindoorTo hammer the Rafale fighter jets' reputation, China's foreign missions sought to persuade countries that ordered the French-made fighter not to buy them and encourage others to go for Chinese-made planes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/suspicious-boat-another-country-spotted-maharashtra-off-raigad-coast-security-heightened-2751863-2025-07-07",
      "headline": "Suspicious boat, likely from Pak, spotted off Maharashtra coast; state on alertSecurity was heightened after a suspicious boat, believed to bear Pakistani markings, was sighted near the Revdanda coast in Maharashtra's Raigad district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-car-hit-and-run-viral-video-defence-colony-lajpat-nagar-flyover-viral-reddit-post-2751917-2025-07-07",
      "headline": "Driver hits auto on Delhi flyover, speeds off. Reddit user shares videoA video of a reckless driver hitting an auto on a Delhi flyover and leaving behind a scene of chaos has gone viral on social media, sparking outrage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/owaisi-election-commission-bihar-voter-list-clean-up-overhaul-aimim-ec-rjd-2751971-2025-07-07",
      "headline": "Why were they allowed in Lok Sabha polls? Owaisi slams Bihar voter list clean-upAIMIM chief Asaduddin Owaisi has questioned Bihar's voter list clean-up ahead of Assembly polls, warning that rushed deletions could strip thousands of citizenship rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/brics-summit-2025-xi-jinping-absence-speculations-power-shift-chinese-president-military-purge-2751294-2025-07-07",
      "headline": "Where is Xi Jinping amid China's military purge?Chinese President Xi Jinping's absence from public view, appearing only twice in videos in over a month, amid a military purge and economic challenges, has fuelled speculation of a power shift in the Chinese Communist Party. With former President Hu Jintao's allies reportedly gaining influence, Xi's absence from the Brics summit has raised questions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-youth-assaulted-made-to-strip-naked-for-sending-obscene-texts-to-ex-girlfriend-actor-darshan-renukaswamy-murder-case-referenced-2751902-2025-07-07",
      "headline": "End up like Darshan case: Man tortured with rods over obscene texts in BengaluruA youth in Bengaluru was abducted, stripped, and brutally assaulted by a group allegedly led by his ex-girlfriend's boyfriend, after he sent obscene messages. The attackers referenced the high-profile Renukaswamy murder case involving actor Darshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-ramayana-film-150-crore-earnings-diwali-2026-2751930-2025-07-07",
      "headline": "Here's how much Ranbir Kapoor is being paid for the two Ramayana filmsActor Ranbir Kapoor is set to earn a hefty sum for his role in the two-part Ramayana films. The project promises a visual spectacle and features a star-studded cast, aiming to captivate a global audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-rashmika-mandanna-first-kodava-actor-claim-upset-her-own-community-2751981-2025-07-07",
      "headline": "Why Rashmika Mandanna's 'first Kodava actor' claim has angered her communityActor Rashmika Mandanna, in a recent interview, called herself the first Kodava actor. Her claim has angered the artistes who had entered the film industry before her.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-jyoti-malhotra-was-invited-by-kerala-as-state-tourism-influencer-rti-2751875-2025-07-07",
      "headline": "'Spy' Jyoti Malhotra was hosted by Kerala as influencer, minister says no clueAn RTI has revealed that Jyoti Malhotra, now arrested for alleged espionage, toured Kerala as a state-sponsored influencer — raising questions about vetting in the state government's tourism outreach campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/where-are-the-dead-remains-of-166-people-sent-to-space-lost-in-the-ocean-2751985-2025-07-07",
      "headline": "Space burial gone wrong: Human remains of 166 people lost in the oceanThe flight, named the Perseverance Flight, was designed to offer families a unique cosmic tribute, sending cremated remains and DNA samples into low Earth orbit. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-british-grand-prix-report-verstappen-piastri-penalty-2751955-2025-07-07",
      "headline": "F1: Oscar Piastri brake-checks himself out of victory in British Grand PrixLando Norris claimed a dramatic win at Silverstone after Oscar Piastri brake-checked himself into a second place finish at the British Grand Prix. Nico Hulkenberg secured his first-ever podium in a rain-hit, chaotic race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-backs-sam-konstas-west-indies-vs-australia-2751933-2025-07-07",
      "headline": "Pat Cummins backs Sam Konstas despite inconsistent Test formAustralian captain Pat Cummins has backed young batter Sam Konstas despite his inconsistent Test performances. Cummins highlights the importance of patience and faith in emerging players during challenging phases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about me, do well for India: Akash Deep's sister amid cancer battleIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-test-captaincy-batting-record-edgbaston-test-2751885-2025-07-07",
      "headline": "Shubman Gill 2.0: How Edgbaston Test marked the rise of a potential India greatENG vs IND: Shubman Gill didn't have a great record outside the subcontinent, but the young India captain has put his best foot forward in the ongoing England tour, scoring runs in heaps and guiding India to a 336-run win at Edgbaston. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-appoints-sanjog-gupta-as-chief-executive-officer-2751872-2025-07-07",
      "headline": "ICC appoints Sanjog Gupta as Chief Executive OfficerThe International Cricket Council (ICC) has appointed Sanjog Gupta as its new chief executive officer (CEO). He will assume office on July 7, 2025, becoming the seventh CEO in the history of the ICC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-b-game-chess-win-zagreb-gukesh-2751866-2025-07-07",
      "headline": "My B-game is enough: Magnus Carlsen after winning Grand Chess Tour ZagrebMagnus Carlsen clinched the SuperUnited Rapid and Blitz combined title in Croatia. Carlsen reacted to his win on social media, stating that his B-game was enough to beat the others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-flat-tacks-in-england-a-missed-opportunity-for-virat-kohli-2751750-2025-07-07",
      "headline": "Flat tracks on England tour a missed opportunity for Virat Kohli?Did Virat Kohli time his Test retirement right with flat decks on offer on the ongoing England tour? Kohli's childhood coach, Rajkumar Sharma, opened up on the batter's Test retirement in a conversation with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-criticises-dukes-ball-quality-flat-pitches-england-test-series-2751861-2025-07-07",
      "headline": "Shubman Gill warns declining Dukes ball quality is hurting Test cricket's balanceIndia captain Shubman Gill on Sunday slammed the fast-deteriorating quality of the Dukes ball, while also giving a thumbs down to the trend of flat pitches seen in the first two Tests of the series — despite his own prolific run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-44-birthday-celebrations-cake-ranchi-2751841-2025-07-07",
      "headline": "Watch: MS Dhoni celebrates his 44th birthday with friends, cake and warm wishesMS Dhoni rang in his 44th birthday on Monday with a low-key celebration in Ranchi, surrounded by close friends and familiar faces. A clip from the evening - showing the former India captain in a sleeveless T-shirt, cutting cake and sharing laughs - quickly went viral, giving fans a heartwarming glimpse into the cricketer's special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-nico-hulkenberg-podium-lando-norris-oscar-piastri-ignore-2751837-2025-07-07",
      "headline": "Selfish Norris, Piastri slammed for ignoring Hulkenberg on British GP podiumNico Hulkenberg secured his first ever Formula 1 podium at the British Grand Prix. At the celebrations, he was ignored by both McLaren drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-b-game-chess-win-zagreb-gukesh-2751866-2025-07-07",
      "headline": "My B-game is enough: Magnus Carlsen after winning Grand Chess Tour ZagrebMagnus Carlsen clinched the SuperUnited Rapid and Blitz combined title in Croatia. Carlsen reacted to his win on social media, stating that his B-game was enough to beat the others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-flat-tacks-in-england-a-missed-opportunity-for-virat-kohli-2751750-2025-07-07",
      "headline": "Flat tracks on England tour a missed opportunity for Virat Kohli?Did Virat Kohli time his Test retirement right with flat decks on offer on the ongoing England tour? Kohli's childhood coach, Rajkumar Sharma, opened up on the batter's Test retirement in a conversation with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-criticises-dukes-ball-quality-flat-pitches-england-test-series-2751861-2025-07-07",
      "headline": "Shubman Gill warns declining Dukes ball quality is hurting Test cricket's balanceIndia captain Shubman Gill on Sunday slammed the fast-deteriorating quality of the Dukes ball, while also giving a thumbs down to the trend of flat pitches seen in the first two Tests of the series — despite his own prolific run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-44-birthday-celebrations-cake-ranchi-2751841-2025-07-07",
      "headline": "Watch: MS Dhoni celebrates his 44th birthday with friends, cake and warm wishesMS Dhoni rang in his 44th birthday on Monday with a low-key celebration in Ranchi, surrounded by close friends and familiar faces. A clip from the evening - showing the former India captain in a sleeveless T-shirt, cutting cake and sharing laughs - quickly went viral, giving fans a heartwarming glimpse into the cricketer's special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-nico-hulkenberg-podium-lando-norris-oscar-piastri-ignore-2751837-2025-07-07",
      "headline": "Selfish Norris, Piastri slammed for ignoring Hulkenberg on British GP podiumNico Hulkenberg secured his first ever Formula 1 podium at the British Grand Prix. At the celebrations, he was ignored by both McLaren drivers."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}