{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-indian-leather-footwear-exports-impact-trade-cle-russia-africa-markets-kanpur-piyush-goyal-2777387-2025-08-27",
      "headline": "Indian leather industry eyes expansion in Russian, African markets amid US tariffsTrade delegations are set to visit Russia and Africa soon, with Commerce Minister Piyush Goyal expected to lead the mission in Russia. Buyer-seller meets are also planned in African countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-ganesh-chaturthi-2025-nse-bse-close-derivatives-trading-details-us-tariff-2777143-2025-08-27",
      "headline": "Ganesh Chaturthi 2025: Is stock market open for trading today?The stock market holiday list for 2025 is available on the official BSE (Bombay Stock Exchange) website. Earlier, markets were closed on August 15 for Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/how-will-trumps-50-tariff-impact-indian-economy-and-its-exports-2777315-2025-08-27",
      "headline": "How will Trump's 50% tariff impact Indian economy and its exports?The United States has escalated its trade dispute with India, imposing new tariffs that bring the total rate to 50% on certain goods. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/what-impact-will-trumps-50-tariff-have-on-the-indian-economy-experts-weigh-in-2777272-2025-08-26",
      "headline": "How will Trump's 50% tariff impact Indian economy? Experts weigh inThe discussion centres on the implications of a 50% tariff threatened by Donald Trump on Indian goods. Experts analyse the potential impact on India's economy, particularly labour-intensive sectors such as textiles, leather, gems and jewellery. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/papa-johns-pizza-returns-to-india-with-first-outlet-in-bengaluru-plans-650-stores-by-2035-2777192-2025-08-26",
      "headline": "Papa John's to return to India with Bengaluru outlet, plans 650 stores by 2035US-based Papa John's will re-enter India this October, opening its first store in Bengaluru and targeting 650 outlets by 2035. The pizza chain, which exited in 2017 due to poor performance, has partnered with Pulsar Capital and UAE's PJP Investments Group as master franchisees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-appoints-amit-kapur-to-lead-new-ai-and-services-transformation-unit-2777191-2025-08-26",
      "headline": "TCS appoints Amit Kapur to lead new AI and services transformation unitIn a bid to deepen its AI capabilities, TCS has named Amit Kapur as the head of its newly formed AI and services transformation unit, effective September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-credit-history-how-lenders-are-opening-doors-for-new-borrowers-2777127-2025-08-26",
      "headline": "No credit history? How lenders are opening doors for new borrowersFor decades, a blank credit history meant a closed door to loans. Now, fintechs and banks are rewriting the rules—using digital footprints and alternative data to bring first-time borrowers into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pmo-holds-high-level-meet-on-us-tariff-impact-explores-relief-for-exporters-2777081-2025-08-26",
      "headline": "PM holds high-level meet on US tariff impact, explores relief for exportersThe PMO on Tuesday held a high-level meeting with senior ministers and officials from the Finance and Commerce Ministries to frame India's response to the US decision to double tariffs on Indian goods to 50% from Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-acts-password-override-privacy-threat-or-necessary-power-2777086-2025-08-26",
      "headline": "New Income Tax Act's password override: Privacy threat or necessary power?India's new tax law brings a digital twist; officials can now override passwords during raids. Supporters say it's just enforcement in the digital age, but privacy advocates worry about unchecked surveillance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-us-tariff-sensex-loses-849-points-nifty-below-24750-tata-steel-down-3-percent-2777012-2025-08-26",
      "headline": "Sensex slumps 849 points, Nifty below 24,750; Tata Steel down 3%The S&P BSE Sensex tanked 849.37 points to close at 80,786.54, while the NSE Nifty50 lost 255.70 points to end at 24,712.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-notice-rs-258-crore-recuced-to-zero-money-saving-section-54-land-sell-property-buy-2776992-2025-08-26",
      "headline": "Woman got tax notice of Rs 2.58 crore. Here's how she reduced it to Rs 0Seema found herself staring at a tax notice of Rs 2.58 crore after selling a piece of land in Patna. The confusion arose due to a simple error in her tax return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-august-27-impact-economy-export-pmo-meeting-modi-government-textile-gems-pharma-2776931-2025-08-26",
      "headline": "Trump's 50% tariff takes effect tomorrow: Who wins, who losesThe United States government has issued a draft notification confirming the step, which will be applied through a supplementary 25% duty on top of existing tariffs."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-daughter-misha-turns-9-mira-rajput-posts-adorable-birthday-wish-2777408-2025-08-27",
      "headline": "Shahid Kapoor's daughter Misha turns 9, Mira Rajput posts adorable birthday wishShahid Kapoor and Mira Rajput's daughter Misha turned nine on August 26, with Mira sharing a heartfelt birthday post and a rare picture of her. The post received warm wishes from celebrities, including Ananya Panday and Neha Dhupia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-chennai-express-comparisons-param-sundari-cant-group-all-south-indians-together-deepika-srk-2777401-2025-08-27",
      "headline": "Janhvi, Sidharth reject Chennai Express parallels with Param SundariJanhvi Kapoor and Sidharth Malhotra are gearing up for their upcoming film 'Param Sundari.' The two stars recently reacted to the comparison with Deepika Padukone and Shah Rukh Khan's 'Chennai Express.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-dreamy-proposal-engagement-missouri-ed-kelce-shares-2777397-2025-08-27",
      "headline": "Taylor-Travis engaged 2 weeks ago in Missouri, Ed Kelce reveals dreamy proposalDid you know that Taylor Swift and Travis Kelce got engaged in Missouri almost two weeks ago? Kelce's father, Ed, discussed the planning that went on and how the two broke the news to their parents and friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lara-dutta-rejected-bipasha-basu-role-20-years-of-no-entry-challenge-myself-anees-bazmee-salman-khan-fardeen-khan-2777386-2025-08-27",
      "headline": "Lara Dutta rejected Bipasha Basu's role in No Entry: Wanted to challenge myselfActor Lara Dutta recently recalled rejecting Bipasha Basu's role in 'No Entry'. In a heartfelt note on the film's 20th anniversary, she stated how she wanted to challenge herself with the character. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engagement-married-internet-reaction-2777369-2025-08-27",
      "headline": "Taylor Swift engaged to Travis Kelce, Internet awaits Royal American weddingTaylor Swift and Travis Kelce, the IT couple, announced their engagement in a joint post on Instagram. Soon after the post was made, the Swifties expressed their joy on social media, calling it a fairytale dream that came true."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bruce-willis-wife-emma-shares-health-update-dementia-advocates-for-caregivers-2777282-2025-08-26",
      "headline": "Bruce Willis' wife Emma shares update on his dementia, advocates for caregiversActor Bruce Willis' wife Heming Willis opened up about her journey caring for Bruce Willis after his FTD diagnosis. She aimed to raise awareness and provide guidance for other caregivers facing similar challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engagement-pics-love-story-now-has-a-ring-dreamy-proposal-2777287-2025-08-26",
      "headline": "Taylor Swift-Travis Kelce's love story now has a ring. See engagement picsTaylor Swift and Travis Kelce are now engaged. The couple shared a few dreamy pictures from their romantic moment on social media and announced the good news to fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-feeds-underprivileged-children-outside-noida-metro-station-viral-video-2777245-2025-08-26",
      "headline": "Honey Singh feeds underprivileged children at Noida metro station, video goes viralRapper Yo Yo Honey Singh was seen sharing food with children outside Noida metro station. The compassionate act has touched many hearts and sparked widespread social media appreciation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/odum-kuthira-chaadum-kuthira-onam-release-fahadh-faasil-kalyani-priyadarshan-viral-reel-2777213-2025-08-26",
      "headline": "Fahadh Faasil, Kalyani Priyadarshan recreate iconic comedy sceneFahadh Faasil and Kalyani Priyadarshan star in 'Odum Kuthira Chaadum Kuthira', a film set for Onam release, featuring a blend of comedy and fantasy. The star cast of the film recreated a viral scene from 'Mookkilla Rajyathu', with Kalyani Priyadarshan calling it their acting workshop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/internet-praises-amit-sadh-humility-after-content-creators-fail-recognise-him-2777229-2025-08-26",
      "headline": "Internet praises Amit Sadh's humility after content creators fail to recognise himContent creators known as therealstreets fail to recognise actor Amit Sadh during a chance encounter, later photographing him. Here's what happened and where you've seen him before.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-launches-production-studio-keneeshaa-francis-an-ordinary-man-2777198-2025-08-26",
      "headline": "Actor Ravi Mohan calls Keneesha god-sent gift, leaves her teary-eyedActor Ravi Mohan, who launched his new production banner, Ravi Mohan Studios, in a grand fashion, had a few heartfelt things to say about his 'companion' Keneeshaa Francis. She was visibly emotional upon hearing his speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ntr-x-neel-jr-ntr-begin-film-2nd-schedule-with-director-prashanth-neel-2777194-2025-08-26",
      "headline": "NTR x Neel: Jr NTR to soon begin film's 2nd schedule with director Prashanth NeelActor Jr NTR is set to begin the second schedule of the much-awaited film NTR x Neel in September 2025. The collaboration with director Prashanth Neel is speculated to be a major pan-India film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-candid-in-flight-moment-goes-viral-amid-love-and-war-shoot-2777204-2025-08-26",
      "headline": "Ranbir Kapoor's candid in-flight moment goes viral amid Love and War shootRanbir Kapoor's candid off-screen moment during a flight went viral, showing his relatable side to fans. Meanwhile, his much-anticipated film 'Love and War', featuring a star-studded cast and high-octane action, is currently under production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/king-conqueror-director-says-james-norton-nikolaj-fantastic-2777168-2025-08-26",
      "headline": "King & Conqueror director says James Norton and Nikolaj were fantasticKing & Conqueror explores the legendary clash between Harold Godwinson and William of Normandy. The series blends history and drama with powerful performances, premiering soon on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lil-nas-x-pleads-not-guilty-amid-charges-of-assaulting-police-roaming-in-underwear-2777132-2025-08-26",
      "headline": "Lil Nas X pleads not guilty amid charges of assaulting police, roaming in underwearAmercian rapper Lil Nas X pleaded not guilty to charges after allegedly assaulting police officers in Los Angeles. The case highlights the legal and personal challenges facing the Grammy-winning rapper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aneez-bazmee-salman-khan-anil-kapoor-no-entry-sequel-2777174-2025-08-26",
      "headline": "Aneez Bazmee on not having Salman and Anil in No Entry sequel: Pain remainsFilmmaker Aneez Bazmee talked about the pain of not having actors Salman Khan and Anil Kapoor in the sequel to 'No Entry' in a recent interview. He also expressed his hesitation over Bipasha Basu's character in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harry-styles-and-zoe-kravitz-dating-rome-walk-2777019-2025-08-26",
      "headline": "Are Harry Styles and Zoe Kravitz dating? Their Rome walk has fans guessingSinger Harry Styles and actor Zoe Kravitz were seen holding hands in Rome, setting off dating rumours after a paparazzi video made the rounds on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-the-epic-teaser-ss-rajamouli-prabhas-rana-daggubati-anushka-shetty-tamannaah-bhatia-2777108-2025-08-26",
      "headline": "Baahubali The Epic teaser: Prabhas-starrer is a trip down memory laneThe teaser for 'Baahubali: The Epic', starring Prabhas, Rana Daggubati, Anushka Shetty and Tamannaah Bhatia, was released on Tuesday. Directed by SS Rajamouli, the film is set for a release on October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hridayapoorvam-trailer-mohanlal-next-is-a-festive-mix-of-comedy-love-and-emotion-2777146-2025-08-26",
      "headline": "Hridayapoorvam trailer: Mohanlal's next is a festive mix of comedy, love and emotionMohanlal's latest film 'Hridayapoorvam' promises a feel-good narrative, releasing on August 28 during Onam festivities. The trailer hints at a humorous yet touching journey post heart surgery."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/30-dead-several-injured-after-heavy-rain-triggered-landslide-on-vaishno-devi-yatra-route-in-jk-2777356-2025-08-27",
      "headline": "31 dead, several feared trapped after landslide hits Vaishno Devi Yatra routeA landslide triggered by heavy rains claimed 31 lives and left 23 others injured along the Mata Vaishno Devi Yatra track in Katra. Officials fear more people may be trapped under the debris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trumps-50-tariffs-kick-today-us-india-ties-hit-new-low-key-points-glbs-2777351-2025-08-27",
      "headline": "Trump's 50% tariffs kick in, India stands firm as duties set to pinch exportersAccording to US President Donald Trump, the higher levies, which double the previous 25 per cent tariff, are intended to push Russian President Vladimir Putin toward negotiations with Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-stopped-india-pakistan-flare-up-threatening-high-tariffs-glbs-2777337-2025-08-27",
      "headline": "Tariffs so high your head will spin: Trump claims he pushed India for Pak truceThe US President said he pressured Indian Prime Minister Narendra Modi to ease tensions with Pakistan, warning of steep tariffs if the conflict escalated. Trump claimed his blunt warning prompted quick action from New Delhi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-f-35-warship-ins-udaygiri-and-ins-himgiri-navy-defence-2777302-2025-08-26",
      "headline": "India has floating F-35: Rajnath Singh's mention of US jet at warships' launchINS Udaygiri and INS Himgiri, advanced indigenously built frigates, are India's F-35s of the seas, Defence Minister Rajnath Singh said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engagement-married-internet-reaction-2777369-2025-08-27",
      "headline": "Taylor Swift engaged to Travis Kelce, Internet awaits Royal American weddingTaylor Swift and Travis Kelce, the IT couple, announced their engagement in a joint post on Instagram. Soon after the post was made, the Swifties expressed their joy on social media, calling it a fairytale dream that came true."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/case-registered-against-tvk-leader-vijay-after-cadre-alleges-assault-by-bouncers-2777389-2025-08-27",
      "headline": "Case against TVK's Vijay as cadre alleges assault by bouncers in Madurai conferenceA case has been registered against TVK leader Vijay and his bouncers after a cadre alleged he was injured during the Madurai conference. Sharath Kumar claimed he was pushed down while trying to meet Vijay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-guwahati-maharaja-prithu-flyover-gnb-road-himanta-biswa-sarma-king-who-defeated-invader-bakhtiyar-khilji-2777016-2025-08-27",
      "headline": "Who is Assam's Raja Prithu who decimated Bakhtiyar Khilji's invading forces?The Himanta Biswa Sarma-led Assam government's decision to name Guwahati's GNB Flyover 'Maharaj Prithu Flyover' has revived the heroic tales of King Prithu, the 13th-century raja of Kamrupa. When Khilji, after attacking Nalanda and invading Bengal, was marching through Kamrupa with 12,000 cavalry and 20,000 infantry fighters, Raja Prithu led a multi-community force and decimated Khilji's army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-3-updates-iga-swiatek-jannik-sinner-coco-gauff-2777216-2025-08-26",
      "headline": "Day 3 LIVE: Zverev leads Tabilo after 2 setsUS Open 2025 Day 3 Live Updates: Coco Gauff has won the first round against Ajla Tomljanovic. Naomi Osaka has made her way to the second round, beating Greet Minnen 6-3, 6-4. At the moment, Alexander Zverev is in action against Alejandro Tabilo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-tape-ball-cricket-exclusive-interview-2777097-2025-08-27",
      "headline": "Afghanistan's tape-ball dreams: Blossoming in alleys, yearning for respectIn an exclusive interview with India Today, Afghanistan Tapeball Cricket president Sheer Rahman Khater explained how tape-ball cricket has been the grassroots heartbeat of South Asian cricket, shaping legends from Pakistan and powering Afghanistan's rise with fearless batters and fiery pacers. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/twin-strike-at-sea-indian-navy-ups-the-game-with-warships-himgiri-udaygiri-2777215-2025-08-26",
      "headline": "Twin strike at sea: Indian Navy ups the game with warships Himgiri, UdaygiriThe inductions coincide with the Indo-Pacific region witnessing unprecedented maritime contestation as China and Pakistan rapidly expand their naval footprints"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-55-year-old-tribal-woman-gives-birth-17th-child-rajasthan-poverty-2777359-2025-08-27",
      "headline": "Udaipur woman, 55, gives birth to 17th child. Her family collects scrap to surviveA 55-year-old tribal woman in Udaipur gave birth to her 17th child, with her family facing extreme poverty and homelessness despite government schemes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/commerce-secretary-lutnick-change-h-1b-visas-green-card-system-glbs-2777329-2025-08-27",
      "headline": "Trouble for techies? Trump official calls H-1B visa system a scam, vows changesThe US Commerce Secretary said the current green card system is flawed, citing recipient income levels as evidence of misplaced priorities. He added that Trump's immigration policy will shift toward attracting wealth and skill.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/a-lot-of-luck-trump-congratulates-taylor-swift-and-travis-kelce-on-engagement-glbs-2777332-2025-08-27",
      "headline": "A lot of luck: Trump congratulates Taylor Swift and Travis Kelce on engagementPresident Donald Trump congratulated Taylor Swift and Travis Kelce on their engagement, offering \"a lot of luck,\" a surprisingly warm shift from his past feuds and critical remarks about the pop star.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/punjab/story/stray-dog-carries-infant-severed-head-near-rajindra-hospital-patiala-probe-2777378-2025-08-27",
      "headline": "Street dog seen carrying infant's severed head at Punjab hospital; probe orderedA street dog was spotted carrying an infant's severed head on the premises of Rajindra Hospital in Patiala. Authorities have launched a probe and are examining forensic evidence to uncover the origins of the remains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-refused-donald-trump-calls-four-times-in-recent-weeks-german-newspaper-frankfurter-allgemeine-faz-2777026-2025-08-26",
      "headline": "Modi refused Trump's calls 4 times in recent weeks: German newspaperUS President Donald Trump tried to talk to Indian Prime Minister Narendra Modi four times in recent weeks amid a raging trade dispute, but the Indian leader refused to talk, according to German newspaper Frankfurter Allgemeine. This demonstrates the anger and caution in New Delhi, suggests the Mainz-based newspaper of record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-force-chief-ap-singh-india-air-power-operation-sindoor-ran-samwad-2025-theatre-command-model-2777385-2025-08-27",
      "headline": "Can't copy US, China models, Op Sindoor showed India's primacy: Air Force chiefAir Chief Marshal AP Singh said India must avoid rushing into theatre command models, stressing that Operation Sindoor proved air power's decisive role and left Pakistan's military on the back foot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-interview-ipl-test-specialist-advice-youngsters-2777260-2025-08-26",
      "headline": "Wouldn't tell youngsters to focus on just Test cricket: Cheteshwar PujaraCheteshwar Pujara, speaking to India Today, said Test selections are now increasingly influenced by both red-ball performances and white-ball exploits, urging youngsters to equip themselves to excel across all three formats. The batting great admitted he missed out on IPL deals after being labelled a Test specialist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-us-colleges-would-struggle-without-chinese-students-amid-maga-backlash-glbs-2777330-2025-08-27",
      "headline": "Trump says US colleges would struggle without Chinese students amid MAGA backlashTrump defended a plan to allow 600,000 Chinese students, saying US colleges would \"struggle\" without them, sparking a MAGA backlash over security, trade tensions, and potential risks to American graduates and research sectors.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-officer-ritesh-kumar-singh-who-assaulted-spicejet-staff-at-srinagar-airport-put-on-no-fly-list-2777278-2025-08-26",
      "headline": "Army officer put on 5-year no-fly list month after assault on SpiceJet staffArmy officer Lt Col Ritesh Kumar Singh has been put on the no-fly list weeks after he violently assaulted SpiceJet staff at Srinagar airport over excess baggage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-spacexs-building-sized-super-heavy-rocket-crashes-into-ocean-after-launch-2777347-2025-08-27",
      "headline": "Watch: SpaceX's building-sized rocket crashes into ocean after launchShortly after liftoff, the Super Heavy booster separated cleanly from the Starship upper stage before initiating a complex series of descent maneuvers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/how-to-get-your-protein-game-right-2776969-2025-08-27",
      "headline": "How to get your protein game rightWe all know protein is important; social media has made sure of that. But the real question is: how do you manage your daily intake? Let the experts explain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-donald-trump-silently-switched-laws-in-india-tariff-case-ieepa-us-court-ruling-tax-rate-duties-russia-war-oil-2768888-2025-08-26",
      "headline": "Why Trump was forced to silently switch laws in India tariff caseIn April, US President Trump used a national emergency law from 1977 to impose tariffs against India and other countries. However, a legal challenge, which is ongoing, forced him to silently switch to a 1962 law to enforce the tariffs. Can the case against the use of the 1977 law have bearings on Trump's tariffs?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/1404-people-earning-in-lakhs-availing-subsidies-meant-for-poor-in-madhya-pradesh-2777298-2025-08-26",
      "headline": "1,404 people, earning in lakhs, availing subsidies meant for poor in Madhya PradeshAccording to a recent investigation by the district administration, 1,404 affluent individuals have been identified as beneficiaries of welfare schemes intended for the poor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-pmk-anbumani-ramadoss-dmk-mk-stalin-poll-promises-2026-assembly-elections-dmk-files-2777400-2025-08-27",
      "headline": "Not even pass mark: Tamil Nadu regional party leader says DMK met 13% poll promisesPMK President Anbumani Ramadoss released Vidiyal Yengey, alleging DMK fulfilled only 13 per cent of its 505 poll promises. He challenged Chief Minister MK Stalin's 98 per cent claim and called for an open debate on the issue."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-narendra-modi-chess-world-cup-goa-2777415-2025-08-27",
      "headline": "FIDE Chess World Cup: PM Modi delighted to host event in IndiaPrime Minister Narendra Modi was elated to host the FIDE Chess World Cup. The PM took to X to express his joy on Wednesday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-us-open-win-naomi-osaka-straight-victory-first-round-2777411-2025-08-27",
      "headline": "Gauff survives Tomljanovic scare, Osaka cruises to second roundCoco Gauff survived a tough first-round match against Ajla Tomljanovic at the US Open. Naomi Osaka impressed with a commanding straight sets win, signalling strong form ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-naveen-kumar-haryana-steelers-homecoming-comeback-exclusive-2777178-2025-08-27",
      "headline": "Naveen Kumar's big homecoming: Haryana Steelers raider on a mission to regain magicA motivated and excited Naveen Kumar is eager to find his past best as the star raider returns home to join the Haryana Steelers ahead of the Pro Kabaddi League season 12. Naveen talked about his goals for the new campaign, including facing his former side Dabang Delhi and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-cadillac-drivers-bottas-perez-2777383-2025-08-27",
      "headline": "Thrown out of F1, Sergio Perez and Valtteri Bottas make comeback with CadillacSergio Perez and Valtteri Bottas, who were thrown out of Red Bull and Mercedes respectively, are set to make their Formula 1 return in 2026. Cadillac, the new team in the paddock have signed the duo as their drivers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-federation-faces-fifa-ban-threat-once-again-report-2777379-2025-08-27",
      "headline": "Indian football federation faces FIFA ban threat once again: ReportThe All India Football Federation (AIFF) reportedly risks suspension if it does not have its constitution ratified by 30 October, according to a letter from FIFA and the Asian Football Confederation (AFC) sent on Tuesday. Such a suspension would reportedly prevent India's national teams and clubs from competing in international tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-venus-williams-doubles-match-2777370-2025-08-27",
      "headline": "Venus Williams to compete in women's doubles with 2021 finalist Leylah FernandezVenus Williams will be playing women's doubles with Leylah Fernandez after receiving a wild-card entry from the US Tennis Association. The development comes a day after her singles match, where she put up a valiant fight against Karolina Muchova."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-tape-ball-cricket-exclusive-interview-2777097-2025-08-27",
      "headline": "Afghanistan's tape-ball dreams: Blossoming in alleys, yearning for respectIn an exclusive interview with India Today, Afghanistan Tapeball Cricket president Sheer Rahman Khater explained how tape-ball cricket has been the grassroots heartbeat of South Asian cricket, shaping legends from Pakistan and powering Afghanistan's rise with fearless batters and fiery pacers. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/playing-on-rank-turners-for-wtc-points-at-home-backfired-on-india-cheteshwar-pujara-2777357-2025-08-27",
      "headline": "Playing on rank-turners for WTC points at home backfired on India: PujaraCheteshwar Pujara has cautioned against preparing rank turners, saying they have hurt both India's batting and the quality of Test cricket. He urged India to focus on sporting pitches that produce balanced contests lasting into the fourth and fifth days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-us-open-win-over-vit-kopriva-full-fitness-form-2777326-2025-08-27",
      "headline": "Healthy again, Jannik Sinner breezes into 2nd round, equals Italian recordJannik Sinner began his US Open title defence with a dominant straight-sets win over Vit Kopriva on August 26. The Italian World No. 1 extended his winning run in hard-court Grand Slams to 22 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pulwama-kashmir-day-night-cricket-match-royal-premier-league-2777306-2025-08-26",
      "headline": "Pulwama hosts its first-ever day-night cricket match, draws thousands of spectatorsThe Royal Premier League kicked off in Pulwama as Royal Goodwill defeated Sultan Springs Baramulla in a thrilling opener, with thousands of fans celebrating the start of Kashmir's biggest local cricketing platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-kerala-cricket-league-2025-form-india-asia-cup-2025-2777295-2025-08-26",
      "headline": "Sanju Samson in red-hot form ahead of Asia Cup, shines as opener in Kerala leagueSanju Samson continues his stellar form as the Asia Cup approaches. He scored a blistering 89 in 46 balls to help the Kochi-based franchise post a fighting first-innings total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-tape-ball-cricket-exclusive-interview-2777097-2025-08-27",
      "headline": "Afghanistan's tape-ball dreams: Blossoming in alleys, yearning for respectIn an exclusive interview with India Today, Afghanistan Tapeball Cricket president Sheer Rahman Khater explained how tape-ball cricket has been the grassroots heartbeat of South Asian cricket, shaping legends from Pakistan and powering Afghanistan's rise with fearless batters and fiery pacers. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/playing-on-rank-turners-for-wtc-points-at-home-backfired-on-india-cheteshwar-pujara-2777357-2025-08-27",
      "headline": "Playing on rank-turners for WTC points at home backfired on India: PujaraCheteshwar Pujara has cautioned against preparing rank turners, saying they have hurt both India's batting and the quality of Test cricket. He urged India to focus on sporting pitches that produce balanced contests lasting into the fourth and fifth days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-us-open-win-over-vit-kopriva-full-fitness-form-2777326-2025-08-27",
      "headline": "Healthy again, Jannik Sinner breezes into 2nd round, equals Italian recordJannik Sinner began his US Open title defence with a dominant straight-sets win over Vit Kopriva on August 26. The Italian World No. 1 extended his winning run in hard-court Grand Slams to 22 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pulwama-kashmir-day-night-cricket-match-royal-premier-league-2777306-2025-08-26",
      "headline": "Pulwama hosts its first-ever day-night cricket match, draws thousands of spectatorsThe Royal Premier League kicked off in Pulwama as Royal Goodwill defeated Sultan Springs Baramulla in a thrilling opener, with thousands of fans celebrating the start of Kashmir's biggest local cricketing platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-kerala-cricket-league-2025-form-india-asia-cup-2025-2777295-2025-08-26",
      "headline": "Sanju Samson in red-hot form ahead of Asia Cup, shines as opener in Kerala leagueSanju Samson continues his stellar form as the Asia Cup approaches. He scored a blistering 89 in 46 balls to help the Kochi-based franchise post a fighting first-innings total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lucas-vazquez-bayer-leverkusen-transfer-real-madrid-xabi-alonso-2777290-2025-08-26",
      "headline": "Lucas Vazquez signs for Bayer Leverkusen till 2027 after Real Madrid goodbyeLucas Vazquez's switch from Real Madrid to Bayer Leverkusen marks the end of an era for the veteran defender. The move opens a fresh Bundesliga chapter, with Xabi Alonso's legacy still looming large at the German club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-iga-swiatek-vs-emiliana-arango-result-2777288-2025-08-26",
      "headline": "US Open: Iga Swiatek brushes aside Emiliana Arango to reach second roundIga Swiatek made the perfect start to her US Open campaign as she made light work of Emiliana Arango in the first round on Tuesday, August 26. Swiatek needed just an hour to get past the Colombian Arango at the Arthur Ashe stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-sony-sports-promo-virender-sehwag-criticism-2777224-2025-08-26",
      "headline": "Asia Cup promo faces backlash over emphasis on India vs Pakistan amid tensionsThe official promo for the Asia Cup, with special focus on the India vs Pakistan clash on September 14, has sparked online backlash, with fans citing the Pahalgam terror attack and Virender Sehwag's involvement as key points of contention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-interview-ipl-test-specialist-advice-youngsters-2777260-2025-08-26",
      "headline": "Wouldn't tell youngsters to focus on just Test cricket: Cheteshwar PujaraCheteshwar Pujara, speaking to India Today, said Test selections are now increasingly influenced by both red-ball performances and white-ball exploits, urging youngsters to equip themselves to excel across all three formats. The batting great admitted he missed out on IPL deals after being labelled a Test specialist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-manchester-united-european-football-not-ready-building-foundations-2777253-2025-08-26",
      "headline": "Manchester United need time to build before competing in Europe: Ruben AmorimManchester United manager, Ruben Amorim, admitted that his side was not ready for European football and wants to focus on building the foundations first before competing on all fronts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sunil-gavaskar-foreign-pundits-india-bcci-squad-selection-remarks-2777240-2025-08-26",
      "headline": "Asia Cup 2025: Sunil Gavaskar slams foreign pundits over India squad remarksFormer India captain Sunil Gavaskar said that foreign cricketers should have no business around India's squad selection. He adds that pundits comment negatively to gain more followers from India on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-message-cheteshwar-pujara-retirement-2777230-2025-08-26",
      "headline": "Puji, thanks for making my job easier: Virat Kohli's Insta note for ex-teammateVirat Kohli penned an emotional message for Cheteshwar Pujara after he retired from Indian cricket. Pujara, who retired on August 24, ended his career with 7,195 Test runs in 103 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sl-brendon-taylor-returns-zimbabwe-odi-squad-sri-lanka-series-2777222-2025-08-26",
      "headline": "Brendon Taylor set for ODI comeback, named in Zimbabwe's squad for Sri Lanka seriesBrendon Taylor could make his return to ODI cricket since his last in 2021 as he was named for the two-match series against Sri Lanka set to be held in Harare, later in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-manchester-united-european-football-not-ready-building-foundations-2777253-2025-08-26",
      "headline": "Manchester United need time to build before competing in Europe: Ruben AmorimManchester United manager, Ruben Amorim, admitted that his side was not ready for European football and wants to focus on building the foundations first before competing on all fronts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sunil-gavaskar-foreign-pundits-india-bcci-squad-selection-remarks-2777240-2025-08-26",
      "headline": "Asia Cup 2025: Sunil Gavaskar slams foreign pundits over India squad remarksFormer India captain Sunil Gavaskar said that foreign cricketers should have no business around India's squad selection. He adds that pundits comment negatively to gain more followers from India on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-message-cheteshwar-pujara-retirement-2777230-2025-08-26",
      "headline": "Puji, thanks for making my job easier: Virat Kohli's Insta note for ex-teammateVirat Kohli penned an emotional message for Cheteshwar Pujara after he retired from Indian cricket. Pujara, who retired on August 24, ended his career with 7,195 Test runs in 103 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sl-brendon-taylor-returns-zimbabwe-odi-squad-sri-lanka-series-2777222-2025-08-26",
      "headline": "Brendon Taylor set for ODI comeback, named in Zimbabwe's squad for Sri Lanka seriesBrendon Taylor could make his return to ODI cricket since his last in 2021 as he was named for the two-match series against Sri Lanka set to be held in Harare, later in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-3-updates-iga-swiatek-jannik-sinner-coco-gauff-2777216-2025-08-26",
      "headline": "Day 3 LIVE: Zverev leads Tabilo after 2 setsUS Open 2025 Day 3 Live Updates: Coco Gauff has won the first round against Ajla Tomljanovic. Naomi Osaka has made her way to the second round, beating Greet Minnen 6-3, 6-4. At the moment, Alexander Zverev is in action against Alejandro Tabilo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hs-prannoy-bwf-world-championships-2025-joakim-oldorff-win-2777217-2025-08-26",
      "headline": "BWF World Championships: HS Prannoy makes solid start with straight games winIndia's HS Prannoy defeated Finland's Joakim Oldorff 21-18, 21-15 in the BWF World Championships 2025 opener. He now faces 2nd seed Anders Antonsen in the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/cheteshwar-pujara-says-ultimate-goal-was-to-play-for-india-again-wanted-the-comeback-2777201-2025-08-26",
      "headline": "Pujara says ultimate goal was to play for India again: Wanted the comebackCheteshwar Pujara revealed, in an exclusive interview with India Today's Consulting Editor Rajdeep Sardesai and Sports Consulting Editor Nikhil Naz, that his ultimate goal was to play for India again as he was eager to make a comeback to the Test team. Pujara announced his retirement from Indian cricket on August 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hanuma-vihari-andhra-tripura-india-domestic-season-2777196-2025-08-26",
      "headline": "Good enough to play all three formats: Hanuma Vihari joins TripuraAfter leaving Andhra, veteran India batter Hanuma Vihari has joined Tripura for the 2025-26 season, saying that he's still good enough to play all three formats of the game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-buchi-babu-back-to-back-centuries-india-selectors-comeback-2777172-2025-08-26",
      "headline": "Sarfaraz sends message to India selectors with successive Buchi Babu 100s\fBack-to-back centuries in the Buchi Babu Tournament have reignited Sarfaraz Khan's push for an India Test comeback. The Mumbai batter is seizing opportunities amid middle-order vacancies ahead of the home series against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-beats-kaloyana-nalbantova-second-round-bwf-world-championships-2025-2777171-2025-08-26",
      "headline": "PV Sindhu shakes off slow start to ease into second roundPV Sindhu came up with a solid show in the opening round of BWF World Championships 2025. After a sluggish start, the 2019 champion outclassed Bulgaria's Kaloyana Nalbantova 23-21, 21-6 to ease into the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-goa-india-host-schedule-2777165-2025-08-26",
      "headline": "Goa to host Chess World Cup as showpiece event returns to India after 23 yearsThe Chess World Cup has returned to India after 23 years with Goa set to host the upcoming event later this year from October 30 to November 27. 206 participants are set to battle for a massive USD 2,000,000 prize money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/cadillac-2026-bottas-perez-lineup-horner-rumours-2777139-2025-08-26",
      "headline": "F1: Cadillac ropes in Bottas and Perez for 2026, squash Horner rumoursCadillac F1 have confirmed Valtteri Bottas and Sergio Perez as their drivers for their maiden Formula One campaign in 2026. The team also denied Christian Horner links, as they decided to back Graeme Lowdon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-real-money-gaming-ban-usman-khawaja-australia-government-push-2777122-2025-08-26",
      "headline": "As India bans real-money gaming, Khawaja urges Australia to curb gambling adsAustralian cricketer Usman Khawaja has urged the government to curb gambling ads in sport, warning of their impact on young fans. His call comes after India banned real-money gaming under the Online Gaming Bill 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-exclusive-regrets-selection-saurashtra-2777107-2025-08-26",
      "headline": "No regrets over last 2 years, proud to have played 100 Tests for India: PujaraIn an exclusive interview, Cheteshwar Pujara said he took the decision to retire a week after contemplating the big call. The Test specialist added that he has no regrets about his career, including the last two years when he was not selected for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-on-england-vs-india-test-series-oval-test-2777084-2025-08-26",
      "headline": "Could've played another game in England, can do anything for Test cricket: SirajIndia fast bowler Mohammed Siraj revealed the secret behind his hunger to bowl tireless long spells in Tests and spoke about his love for Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-anthony-gordon-red-card-liverpool-virgil-van-djik-newcastle-united-2777085-2025-08-26",
      "headline": "Anthony Gordon apologises after reckless tackle on Virgil Van DjikAnthony Gordon took to social media to apologise for his horrendous tackle on Virgil van Djik, which resulted in him being sent off. He admitted that he got caught up at the moment."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}