{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-150-points-nifty-above-25700-infosys-tech-mahindra-up-2852757-2026-01-16",
      "headline": "Sensex jumps over 150 points, Nifty above 25,700; Infosys up 4%Sensex jumps over 150 points, Nifty above 25,700; Infosys up 4%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-headcount-falls-it-sector-job-crisis-india-fy26-infosys-ai-automation-upskill-2852752-2026-01-16",
      "headline": "TCS headcount dips sharply: Why is India's IT sector facing a job crisisAt the end of Q3 FY26, Tata Consultancy Services said its total headcount stood at 582,163, down by 11,151 employees from 593,314 at the end of the September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-why-indian-markets-may-open-higher-infosys-earnings-gift-nifty-2852742-2026-01-16",
      "headline": "Sensex, Nifty today: Stock markets likely to open higher. Here's why?Market participants are now waiting for earnings announcements from other large companies. Results from firms such as Reliance Industries, Wipro, HDFC Bank and ICICI Bank are expected later on Friday and on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/not-so-strait-hormuz-iran-and-the-global-oil-trade-2852653-2026-01-15",
      "headline": "Not so 'strait': Hormuz, Iran, and the global oil tradeAround 84 per cent of the crude oil and condensate transported through this strait goes to Asian markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-from-mental-health-to-medtech-healthcare-seeks-policy-push-2852556-2026-01-15",
      "headline": "Budget 2026: From mental health to medtech, healthcare seeks policy pushAhead of Union Budget 2026, voices from across the healthcare ecosystem are drawing attention to long-standing gaps. While funding has improved in recent years, experts say sharper policy focus is needed on mental health, medtech and early diagnosis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tiger-global-will-have-to-pay-tax-in-india-on-16-billion-flipkart-stake-sale-to-walmart-supreme-court-2852416-2026-01-15",
      "headline": "Supreme Court rules Tiger Global must pay tax on $1.6 billion Flipkart-Walmart dealThe top court ruled that Tiger Global is not entitled to claim tax exemption under the India–Mauritius treaty. It agreed with the Income Tax Department's view that the structure used for the transaction was aimed at avoiding tax liability in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-edtech-and-adtech-seek-policy-support-for-ai-led-growth-2852397-2026-01-15",
      "headline": "Budget 2026: Edtech and adtech seek policy support for AI-led growthWith artificial intelligence playing a growing role in education and digital advertising, industry leaders are looking to Budget 2026 for policy measures that support innovation, skills development and sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-and-eu-inch-closer-to-finalising-trade-deal-report-2852378-2026-01-15",
      "headline": "India and EU inch closer to finalising trade deal: ReportSenior European Union leaders are set to attend India's Republic Day celebrations on January 26, followed by the India–EU Summit on January 27, where the trade deal is expected to be a key topic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-is-the-old-income-tax-regime-slowly-on-its-way-out-2852320-2026-01-15",
      "headline": "Budget 2026: Is the old income tax regime slowly on its way out?As Union Budget 2026 draws closer, taxpayers are wondering whether the old income tax regime is nearing a phase-out. While it still exists today, many are questioning whether continued policy support for the new regime signals a gradual discontinuation of the old one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-turn-household-gold-into-economic-growth-2852294-2026-01-15",
      "headline": "Can Budget 2026 turn household gold into economic growth?India holds a vast amount of gold in households, much of which remains unused for economic activity. As Budget 2026 approaches, experts believe the government has an opportunity to turn this idle wealth into a driver of growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-unlock-the-next-phase-of-indias-clean-energy-transition-2852270-2026-01-15",
      "headline": "Can Budget 2026 unlock the next phase of India's clean energy transition?With targeted actions from the upcoming Union Budget, India's energy sector could move beyond capacity building and towards more reliable, flexible, and competitive clean power for industrial and commercial consumers nationwide."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/nithin-kamath-questions-stock-market-holiday-mumbai-elections-bmc-bse-nse-close-2852225-2026-01-15",
      "headline": "For a local poll? Zerodha CEO slams poor planning as markets shut for BMC electionNithin Kamath's comments come on a day when Dalal Street is closed after the Maharashtra government declared January 15 a public holiday to ensure smooth polling for local body elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bccl-ipo-allotment-status-bharat-coking-coal-shares-expected-profit-listing-date-2852190-2026-01-15",
      "headline": "Waiting for BCCL shares? Check your allotment status, expected profit hereBCCL shares: The allotment status is now available, and investors can check whether they have received shares in the first mainboard IPO of 2026, which saw massive demand during the subscription period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/is-stock-market-open-today-bse-nse-holiday-january-15-bmc-elections-mcx-trading-2852172-2026-01-15",
      "headline": "BSE, NSE holiday: Is stock market open or closed for trading today?Indian stock markets will remain closed for a total of 16 days in 2026. January 26 will be the next market holiday this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-will-tax-reforms-and-clearer-rules-revive-indias-crypto-market-2851983-2026-01-14",
      "headline": "Budget 2026: Will tax reforms and clearer rules revive India's crypto market?With the Union Budget 2026 around the corner, the virtual digital asset sector is hoping for changes that can ease taxation and provide regulatory certainty. Experts believe this could reignite growth in India's crypto ecosystem."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wholesale-inflation-rises-to-083-in-december-as-prices-firm-up-2851918-2026-01-14",
      "headline": "Wholesale inflation rises to 0.83% in December as prices firm upFood prices showed mixed trends during the month. Wholesale food inflation remained flat in December, compared with a sharp 2.6% decline recorded in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-senior-citizens-trust-bank-targets-agent-commission-2851860-2026-01-14",
      "headline": "Trust, targets and commissions: How senior citizens are trapped by mis-sold insuranceHandcrafted ByOur Editors Senior citizens walk into banks seeking safety and certainty. Too often, they walk out with complex insurance products that quietly put their savings and peace of mind at risk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-what-real-estate-sector-expects-on-housing-tax-relief-and-infra-2851821-2026-01-14",
      "headline": "Budget 2026: What real estate sector expects on housing, tax relief and infraWith the Union Budget 2026 around the corner, real estate developers are hoping for policy steps that improve affordability, simplify taxes and strengthen urban infrastructure to support long-term growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/where-does-lic-invest-bonds-debt-policyholders-money-and-how-returns-work-2851807-2026-01-14",
      "headline": "Buying an LIC policy? Here's where your money goes and what you get backWith assets under management of over Rs 57 lakh crore, LIC is not just an insurance company but also one of India's biggest long-term investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-245-points-lower-nifty-below-25700-tcs-down-it-auto-metal-psu-banking-up-2851801-2026-01-14",
      "headline": "Sensex ends 245 points lower, Nifty below 25,700; TCS down 2%The S&P BSE Sensex was down by 244.98 points to close at 83,382.71, while the NSE Nifty50 lost 66.70 points to end at 25,665.60. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-exclusive-kim-seon-ho-go-youn-jung-can-this-love-be-translated-interview-kdrama-2852743-2026-01-16",
      "headline": "Exclusive: Kim Seon-ho, Go Youn-jung on Love Beyond Words, connection with fans Netflix's Can This Love Be Translated explores a tender romance with Kim Seon-ho and Go Youn-jung. The series highlights love's complexity and emotional language across three countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-actor-saumya-tandon-says-her-name-was-missing-from-bmc-poll-list-2852739-2026-01-16",
      "headline": "Dhurandhar actor Saumya Tandon says her name was missing from BMC poll list Saumya Tandon faced confusion while attempting to vote in the Mumbai BMC elections after discovering her name was missing from the voter list despite prior online verification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-explains-how-he-added-sanskrit-verses-to-ramayana-track-with-hans-zimmer-2852731-2026-01-16",
      "headline": "AR Rahman explains how he added Sanskrit words to Ramayana track with Hans Zimmer Composer AR Rahman shared insights into the process of working with Hans Zimmer on the music for Nitesh Tiwari's Ramayana, highlighting the challenges and creative efforts involved in blending iconic sounds with Sanskrit words to offer a fresh interpretation of the epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-12-finale-week-emotions-sankranthi-celebrations-2852691-2026-01-16",
      "headline": "Bigg Boss Kannada 12: Emotions run high in first finalists-only episode The final leg of the show begins on an emotional note as the house celebrates Sankranthi, reflects on past conflicts, and gears up for the Bigg Boss Kannada 12 finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sophie-turner-steps-into-lara-croft-role-in-tomb-raider-series-first-look-2852730-2026-01-16",
      "headline": "Sophie Turner steps into Lara Croft role in Tomb Raider series. First look Prime Video unveiled the first look of Sophie Turner as Lara Croft from a wardrobe test for its upcoming Tomb Raider series, confirming her transformation into the iconic video game hero."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-kara-teaser-intense-action-thriller-karma-redemption-2852725-2026-01-16",
      "headline": "Kara teaser: Wounded Dhanush vows to wipe stain upon his name in gritty actioner The first teaser for Kara, Dhanush's newly titled film, introduced viewers to a mysterious, action-driven narrative, highlighting his portrayal as Karasaami. The film is directed by Vignesh Raja and is scheduled for a summer 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/riya-shibu-shares-sarvam-maya-gen-z-ghost-reshaped-on-screen-mythology-2852453-2026-01-16",
      "headline": "Riya Shibu: My role as Gen-Z ghost in Sarvam Maya has redefined screen horror In an exclusive interaction with India Today, Malayalam actor Riya Shibu reflected on her character as the Delulu ghost in the latest release 'Sarvam Maya'. The film, also starring Nivin Pauly, is currently running in theatres and has surpassed the Rs-100 crore milestone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jodie-foster-says-taxi-driver-fame-shielded-her-from-sexual-abuse-in-hollywood-2852719-2026-01-16",
      "headline": "Jodie Foster says Taxi Driver fame shielded her from sexual abuse in Hollywood Jodie Foster reflected on her early years as a child actor and said her Oscar-nominated role in Taxi Driver gave her a level of power that helped protect her from sexual predators in Hollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/paul-mccartney-opens-up-on-life-after-the-beatles-in-man-on-the-run-2852715-2026-01-16",
      "headline": "Paul McCartney opens up on life after The Beatles in Man on the Run Man on the Run sees Paul McCartney reflect on the emotional fallout of The Beatles' breakup, including depression, the \"Paul is dead\" rumour and his fear of never making music again. The documentary traces his creative rebirth through Wings and his enduring partnership with wife Linda McCartney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hans-zimmer-on-board-as-composer-for-hbos-harry-potter-series-2852712-2026-01-16",
      "headline": "Hans Zimmer on board as composer for HBO's Harry Potter series HBO's upcoming adaptation of the Harry Potter books will feature an original score by Hans Zimmer and Bleeding Fingers Music, aiming to honour and reimagine the saga's musical legacy for television."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harry-styles-announces-new-album-kiss-all-the-time-disco-occasionally-2026-2852686-2026-01-15",
      "headline": "Harry Styles announces new album 'Kiss All The Time. Disco, Occasionally'. Details Singer Harry Styles has confirmed a new album, titled 'Kiss All the Time. Disco, Occasionally'. in an announcement that sets his musical direction for 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-apologises-controversial-concert-remark-safe-sex-awareness-2852668-2026-01-15",
      "headline": "Honey Singh 'sorry' for viral explicit words: Meant to promote safe sex among Gen Z Rapper Yo Yo Honey Singh issued a public apology after a remark made at a Delhi concert sparked criticism. In his video message, Honey Singh explained his intention behind the remark and claimed it was wrongly perceived by some people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/wheel-of-fortune-india-promo-akshay-kumar-hosts-contestants-spin-big-2852667-2026-01-15",
      "headline": "Wheel of Fortune India promo: Akshay Kumar hosts as contestants spin for big prize The makers of the upcoming show 'Wheel of Fortune India' shared a new promo that features Akshay Kumar taking charge as the host. The show will air on Sony TV on January 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-slumdog-millionaire-being-his-finest-2852665-2026-01-15",
      "headline": "Hollywood wasn't fool to vote: AR Rahman on Slumdog Millionaire being his finest AR Rahman, in a recent interview, defended his music in 'Slumdog Millionaire'. He called the soundtrack his finest work in Hollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-arslan-goni-grabs-sussanne-khan-phone-shows-hrithik-roshan-on-video-call-2852625-2026-01-15",
      "headline": "Watch: Arslan Goni grabs Sussanne Khan's phone, shows Hrithik Roshan on video call Sussanne Khan and Hrithik Roshan, who continue to share a cordial bond post-divorce, caught fans' attention once again with Sussanne's latest gesture at the airport. Watch the video here."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kalamkaval-ott-release-when-and-where-to-watch-mammootty-crime-thriller-2852565-2026-01-15",
      "headline": "Kalamkaval OTT release: When and where to watch Mammootty's crime-thriller Mammootty's crime-thriller 'Kalamkaval' has been released on OTT. The film, directed by Jithin K Jose also features Vinayakan in a pivotal character."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-jana-nayagan-makers-eye-republic-day-box-office-window-if-court-case-clears-report-2852243-2026-01-15",
      "headline": "Jana Nayagan makers eye Republic Day box office window if court case clears: Report Vijay's Jana Nayagan eyes a Republic Day release as makers wait for a hearing in the Madras High Court against the stay on the film's censor certificate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-witty-fan-encounter-on-khosla-ka-ghosla-2-sets-watch-2852583-2026-01-15",
      "headline": "Anupam Kher's witty fan encounter on Khosla Ka Ghosla 2 sets. Watch Anupam Kher shared a fun BTS moment from the sets of 'Khosla Ka Khosla 2'. The film is currently shot in Delhi with Boman Irani. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-on-bollywood-music-scene-people-who-are-not-creative-have-the-power-now-2852562-2026-01-15",
      "headline": "AR Rahman on Bollywood music scene: People who are not creative have the power now AR Rahman has addressed recent industry shifts that have impacted his work. He said the music industry has changed, with non-creative people now holding more power. The music composer also shared that he felt like an outsider in Bollywood until Taal helped him truly belong."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/bmc-elections-results-thackerays-together-pawars-united-maharashtras-mega-civic-poll-verdict-january-16thane-navi-mumbai-kalyan-dombivli-pimpri-chinchwad-nagpur-nashik-amravati-2852695-2026-01-16",
      "headline": "BJP-Sena vs Thackerays fight dominates Maharashtra civic polls, results todayThe stakes are high, with ideological lines blurring amid unlikely alliances across the state. All eyes will be on the results of the BMC and 28 other municipal corporations as counting begins from 10 am. Will the Thackeray reunion click in Mumbai? Will the Pawars joining hands in their Pune citadel boost their prospects? Find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-meets-venezuelan-opposition-leader-maria-corina-machado-at-white-house-stance-unchanged-2852702-2026-01-16",
      "headline": "Venezuela's Machado presents her Nobel Peace Prize to Trump at White HouseUS President Donald Trump held a first-ever meeting with Venezuelan opposition leader and Nobel laureate Maria Corina Machado, signalling America's engagement in the Latin American nation's future while maintaining scepticism about her immediate political backing.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-halts-800-executions-after-trumps-warning-over-protest-killings-white-house-2852694-2026-01-16",
      "headline": "Iran backs down on 800 executions after Trump's warning, White House confirms  Live UpdatesWhite House Press Secretary Karoline Leavitt said Trump and his team had delivered a direct warning to Iranian officials, linking the planned executions to what Washington described as violent repression of demonstrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-medicines-replacing-pakistani-drugs-in-afghanistan-pakistan-pharmaceuticals-banned-islamabad-kabul-clashes-2852022-2026-01-16",
      "headline": "Indian medicines replacing Pakistani drugs in Afghanistan?An Afghan vlogger has claimed that Indian medicines that are cheaper and work better are fast-replacing Pakistani drugs. India has sent tonnes of medical assistance to Afghanistan even as the Taliban-led regime's ties with Pakistan hit rock bottom. Earlier, Pakistan-made drugs accounted for 70% of all medicines in the Afghan market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/india-foreign-policy-decisions-jaishankar-bangladesh-kkr-mustafizur-rahman-row-2852693-2026-01-16",
      "headline": "Who is deciding India's foreign policy?External Affairs Minister S Jaishankar often makes headlines for his sharp and pointed soundbites. And yet, there have been enough moments when the minister must wonder who is calling the shots in South Block. The handling of relations with Bangladesh exemplifies the latest instance of diplomatic confusion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/mumbai-bmc-election-results-2026-live-updates-civic-body-bjp-shiv-sena-ncp-congress-2852721-2026-01-16",
      "headline": "Live: BJP gears up for victory celebrations as counting to begin at 10 amMumbai BMC Election Results Live Updates: Counting of votes for the Brihanmumbai Municipal Corporation (BMC) election will begin at 10 am on Friday, following polling held on January 15 alongside elections to 28 other local bodies across Maharashtra. Authorities have set up 23 counting centres across Mumbai, with tight security in place. Exit polls have projected a decisive victory for the BJP–Shiv Sena alliance in the BMC, while forecasting a setback for the Shiv Sena (UBT)–Maharashtra Navnirman Sena combine. The contest carries high political stakes, with the BJP-led Mahayuti taking on the reunited Thackeray cousins -- Raj Thackeray of the MNS and Uddhav Thackeray of the Shiv Sena (UBT) -- for control of India's richest civic body. Follow indiatoday.in for all Live Updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-aaib-summons-captain-sumeet-sabharwal-pilots-body-ahmedabad-crash-2852753-2026-01-16",
      "headline": "Can call anyone: Air India crash probe body on summoning late captain's pilot nephewThe pilots association FIP has issued a legal notice to the Aircraft Accident Investigation Bureau (AAIB) over its decision to summon the nephew of Sumeet Sabharwal, a pilot who operated the ill-fated Air India plane that crashed in Ahmedabad last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-headcount-falls-it-sector-job-crisis-india-fy26-infosys-ai-automation-upskill-2852752-2026-01-16",
      "headline": "TCS headcount dips sharply: Why is India's IT sector facing a job crisisAt the end of Q3 FY26, Tata Consultancy Services said its total headcount stood at 582,163, down by 11,151 employees from 593,314 at the end of the September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-open-badminton-controversy-delhi-olympics-hopes-hosting-ready-2852751-2026-01-16",
      "headline": "India wants the Olympics, but is it truly ready to host the world?The India Open exposed more than polluted air. It revealed recurring failures in how India plans, manages and acknowledges hosting shortcomings, failures the country must confront before its Olympic ambitions can be taken seriously.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/maharashtra-municipal-election-result-2026-live-updates-civic-body-polls-shiv-sena-ncp-bjp-congress-2852722-2026-01-16",
      "headline": "LIVE: Counting of votes for Maharashtra municipal elections 2026 from 10 am todayMaharashtra Civic Body Election Result Live Updates: After nearly nine years, Maharashtra held civic body elections across 29 municipal corporations, including key urban centres such as Mumbai, Pune, Thane, Nagpur, Pimpri-Chinchwad and Nashik. With polling completed on Thursday and an overall turnout of 46–50 per cent, attention has now shifted to counting, scheduled to begin at 10 am today. The elections featured several high-profile political contests. The coming together of the Thackeray brothers to take on the BJP-led alliance, including Deputy Chief Minister Eknath Shinde's Shiv Sena, emerged as a major talking point. In Pune and Pimpri-Chinchwad, members of the Pawar family joined forces to defend their traditional strongholds. Notably, despite being on opposite sides at the state level, the NCP and NCP (SP) put aside differences for the municipal polls and jointly fielded candidates, adding another layer of intrigue to the results. Stay with IndiaToday.in for the latest and live updates-"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/priya-kapur-moves-supreme-court-to-access-karisma-sanjay-divorce-settlement-details-2852699-2026-01-16",
      "headline": "Priya Kapur approaches Supreme Court for Sunjay Kapur-Karisma Kapoor divorce recordsPriya Kapur has sought access to the said divorce records to ascertain the financial and child custody arrangements made by her late former husband."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-trump-suspends-immigrant-visas-75-nations-pakistan-iran-libya-myanmar-why-kuwait-thailand-bhutan-explained-2852389-2026-01-15",
      "headline": "US bans immigrant visas. But why are Thailand, Bhutan, Kuwait among 75 nations?The US has indefinitely paused immigrant visa processing for citizens of 75 countries, citing the financial burden on Americans. The inclusion of countries like Bhutan, Brazil, Kuwait and Thailand has surprised many, and sparked confusion over the criteria used to devise the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-slumdog-millionaire-being-his-finest-2852665-2026-01-15",
      "headline": "Hollywood wasn't fool to vote: AR Rahman on Slumdog Millionaire being his finestAR Rahman, in a recent interview, defended his music in 'Slumdog Millionaire'. He called the soundtrack his finest work in Hollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-exclusive-kim-seon-ho-go-youn-jung-can-this-love-be-translated-interview-kdrama-2852743-2026-01-16",
      "headline": "Exclusive: Kim Seon-ho, Go Youn-jung on Love Beyond Words, connection with fansNetflix's Can This Love Be Translated explores a tender romance with Kim Seon-ho and Go Youn-jung. The series highlights love's complexity and emotional language across three countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-career-axar-patel-waiting-2852717-2026-01-16",
      "headline": "Clock's ticking on Ravindra Jadeja's ODI career as Axar Patel waits on the sidelinesIND vs NZ: India's loss in the 2nd ODI has intensified scrutiny on Ravindra Jadeja, whose recent struggles with both bat and ball have raised concerns about his place in the side. With Axar Patel's rapid rise, Jadeja's days in the ODI setup look numbered as the all-rounder is in a race against time to prove his worth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/dense-fog-delhi-ncr-rail-air-travel-affected-2852723-2026-01-16",
      "headline": "Dense fog grips Delhi-NCR, airport wants of flight delays, trains also hitDense fog gripped large parts of north India, reducing visibility to near zero in several cities and disrupting road, rail, and air services.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-nisha-verma-who-did-not-answer-whether-men-can-get-pregnant-2852624-2026-01-15",
      "headline": "Who is Nisha Verma, doctor viral for response to can men get pregnant question?A Reproductive Health Adviser and senior figure associated with Physicians for Reproductive Health, Verma was born in an Indian immigrant family in North Carolina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protests-live-updates-death-toll-ayatollah-khamenei-violent-unrest-crackdown-protesters-executions-glbs-2852698-2026-01-16",
      "headline": "Live: 3,400 Iranian tech leaders back Reza Pahlavi, seek US support to end regimeIran Protests Live Updates: Iran is showing tentative signs of a return to daily life after weeks of nationwide anti-government protests and a violent crackdown, but fears of further escalation — including possible US military action — continue to loom. Residents in Tehran have begun resuming routine activities, even as uncertainty persists amid a prolonged state-imposed communications blackout that has largely cut the country off from the outside world for more than a week. Human rights groups say more than 2,600 people have been killed since the unrest began, with thousands more detained. While the US has refused to rule out military action and imposed fresh sanctions on Iranian officials accused of directing the crackdown. Donald Trump has warned of \"grave consequences\" if killings continue, while saying he has been told executions have been halted. Iran, for its part, has denied plans for hangings. Follow indiatoday.in for live updates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-those-viral-glucose-monitor-videos-dont-tell-you-about-blood-sugar-spikes-2852302-2026-01-16",
      "headline": "What those viral glucose monitor videos don't tell you about blood sugar spikesHooked to those 'what will this food item do to my blood sugar level?' videos on social media? They can be addictive to watch, but they don't always give you the full picture of what's healthy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-apologises-controversial-concert-remark-safe-sex-awareness-2852668-2026-01-15",
      "headline": "Honey Singh 'sorry' for viral explicit words: Meant to promote safe sex among Gen ZRapper Yo Yo Honey Singh issued a public apology after a remark made at a Delhi concert sparked criticism. In his video message, Honey Singh explained his intention behind the remark and claimed it was wrongly perceived by some people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ivf-failure-hoxa10-twist2-genes-implantation-reserch-embryo-2852381-2026-01-16",
      "headline": "Why IVF doesn't always work, even when everything seems 'perfect'New research reveals how two genes in the uterus control embryo implantation during IVF. This discovery may explain repeated IVF failures and pave the way for personalised treatments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/loh-kean-yew-air-quality-concerns-india-open-pollution-players-stamina-2852545-2026-01-15",
      "headline": "I breathe less: Ex-world champ Loh says Delhi air hurting players at India OpenFormer world champion Loh Kean Yew said Delhi's air pollution has impacted players' energy levels at the India Open. The tournament faces mounting criticism over conditions and hygiene from several top shuttlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-asks-citizens-in-israel-to-stay-vigilant-avoid-non-essential-travel-amid-iran-tensions-2852656-2026-01-15",
      "headline": "Stay vigilant, India cautions citizens in Israel amid rising Iran tensionsIn its advisory, the embassy asked Indian citizens to strictly follow safety guidelines and protocols issued by the Israeli authorities and the Home Front Command. Indian nationals were also advised to avoid all non-essential travel to Israel until further notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-harleen-deol-up-warriorz-bounces-back-retire-worst-nightmare-2852734-2026-01-16",
      "headline": "Harleen Deol makes her bat do the talking, bounces back from batter's worst nightmareHarleen Deol bounced back from the setback of being retired out by producing a commanding 64 against Mumbai Indians, letting her bat do the talking and reaffirming her value to UP Warriorz."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-u19-world-cup-detrimental-bcci-big-picture-prodigy-india-2852756-2026-01-16",
      "headline": "Vaibhav Suryavanshi's U19 run could hurt him: Ex-India cricketer makes bold statement Former India cricketer WV Raman has sparked debate by questioning whether Under-19 cricket is the right pathway for teenage prodigy Vaibhav Suryavanshi despite his rapid rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-open-badminton-controversy-delhi-olympics-hopes-hosting-ready-2852751-2026-01-16",
      "headline": "India wants the Olympics, but is it truly ready to host the world? The India Open exposed more than polluted air. It revealed recurring failures in how India plans, manages and acknowledges hosting shortcomings, failures the country must confront before its Olympic ambitions can be taken seriously.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-aryna-sabalenka-heal-old-wounds-final-heartbreak-melbourne-park-2852720-2026-01-16",
      "headline": "One year on, Aryna Sabalenka seeks to heal old wounds at the Australian Open Australian Open 2026: Aryna Sabalenka suffered a shock defeat to Madison Keys in last year's Australian Open final, and the world No. 1 will be eager to reassert her dominance when this year's hard-court showpiece unfolds in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-harleen-deol-up-warriorz-bounces-back-retire-worst-nightmare-2852734-2026-01-16",
      "headline": "Harleen Deol makes her bat do the talking, bounces back from batter's worst nightmare Harleen Deol bounced back from the setback of being retired out by producing a commanding 64 against Mumbai Indians, letting her bat do the talking and reaffirming her value to UP Warriorz."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-boycott-nazmul-islam-public-apology-report-2852724-2026-01-16",
      "headline": "Bangladesh cricketers to end boycott if ex-director issues public apology: Report Bangladesh's cricketers have made a public apology from former BCB chairman Nazmul Islam a key condition for ending their boycott, with domestic competitions remaining affected as talks with the board continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravindra-jadeja-odi-career-axar-patel-waiting-2852717-2026-01-16",
      "headline": "Clock's ticking on Ravindra Jadeja's ODI career as Axar Patel waits on the sidelines IND vs NZ: India's loss in the 2nd ODI has intensified scrutiny on Ravindra Jadeja, whose recent struggles with both bat and ball have raised concerns about his place in the side. With Axar Patel's rapid rise, Jadeja's days in the ODI setup look numbered as the all-rounder is in a race against time to prove his worth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-up-warriorz-retire-out-mumbai-indians-wpl-2026-2852689-2026-01-15",
      "headline": "Harleen Deol reacts to retire out saga after heroics vs Mumbai Indians WPL 2026: 24 hours after being retired out against Delhi Capitals, Harleen Deol starred with an unbeaten 64 as UP Warriorz secured their first win, defeating Mumbai Indians by seven wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vidarbha-beats-karnataka-vijay-hazare-trophy-semi-final-aman-mokhade-138-2852684-2026-01-15",
      "headline": "Vidharbha storm in Vijay Hazare Trophy final, knock defending champion Karnataka out Vidarbha outplayed defending champions Karnataka with a dominant all-round display, clinching a six-wicket win to book their place in the Vijay Hazare Trophy final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-up-warriorz-mumbai-indians-nat-sciver-brunt-report-2852655-2026-01-15",
      "headline": "Retire out to heroics: Harleen Deol seals UP Warriorz maiden win of WPL 2026 WPL 2026, MI vs UPW: Harleen Deol scored an unbeaten 64 as the UP Warriorz opened their account with a seven-wicket win over Mumbai Indians on Thursday in Navi Mumbai. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-india-open-quarterfinals-win-2852661-2026-01-15",
      "headline": "Rejuvenated Lakshya keeps India's hopes alive after rusty Sat-Chi crash out India Open 2026: Former champion Lakshya Sen stormed into the quarters, keeping India's hopes alive on a day when big guns, including Satwiksairaj Rankireddy-Chirag Shetty, KidambI Srikanth and HS Prannoy crashed out in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-returns-the-hundred-2026-manchester-super-giants-2852633-2026-01-15",
      "headline": "Smriti Mandhana returns to The Hundred Women, joins Manchester Super Giants Smriti Mandhana returns to The Hundred with Manchester Super Giants for 2026 after standout WPL form, bringing proven experience, big-match pedigree and elite top-order firepower to a star-studded squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manoj-tiwary-criticises-mary-kom-disrespecting-ex-husband-divorce-2852610-2026-01-15",
      "headline": "Manoj Tiwary slams boxer Mary Kom over allegations on ex-husband, deletes videoFormer cricketer Manoj Tiwary criticised Mary Kom for publicly disrespecting her ex-husband, saying her comments caused him pain and highlighted the importance of mutual support in relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-confirms-world-championships-delhi-india-open-hygiene-row-2852611-2026-01-15",
      "headline": "BWF backs Delhi for Badminton World C'ships, vows to address hygiene concernsThe Badminton World Federation has backed Delhi to remain as the venue for the World Championships later in the year amid hygiene concerns during the India Open. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-india-vs-usa-henil-patel-abhigyan-kundu-dls-win-2852599-2026-01-15",
      "headline": "U19 World Cup: Henil, Kundu star but India off to shaky start with win over USAU19 World Cup 2026: India overcame a tricky chase against USA in the U19 World Cup as Abhigyan Kundu held firm and Henil Patel starred with a five-wicket haul. India won the rain-marred match by six wickets in the end via DLS method. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/loh-kean-yew-air-quality-concerns-india-open-pollution-players-stamina-2852545-2026-01-15",
      "headline": "I breathe less: Ex-world champ Loh says Delhi air hurting players at India OpenFormer world champion Loh Kean Yew said Delhi's air pollution has impacted players' energy levels at the India Open. The tournament faces mounting criticism over conditions and hygiene from several top shuttlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-leads-australia-dominant-ashes-series-victory-31-wickets-2852447-2026-01-15",
      "headline": "Ashes hero Starc bags ICC award for his sensational performance vs EnglandMitchell Starc ended Australia's wait for an ICC Player Of The Month award as he was rewarded for his performance against England in the Ashes on Thursday, January 15. Starc was the Player Of The Series during the matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-pre-season-training-south-africa-2026-events-2852468-2026-01-15",
      "headline": "Neeraj Chopra begins pre-season training in South Africa after MOC approvalNeeraj Chopra, India's two-time Olympic medallist in javelin throw, has begun his 32-day pre-season training camp in Potchefstroom, South Africa, after receiving approval from the Sports Ministry's Mission Olympic Cell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-backs-kuldeep-yadav-rajkot-odi-india-nz-2852469-2026-01-15",
      "headline": "Kuldeep is No.1 spinner in the world: Chahal backs India star after Rajkot ODIYuzvendra Chahal has jumped to the defence of Kuldeep Yadav after his horror show during the Rajkot ODI against New Zealand on January 14. Kuldeep leaked runs and was the most expensive bowler in the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-confirms-truncated-isl-gets-afc-recognition-isl-and-super-cup-winners-to-get-indirect-slots-2852454-2026-01-15",
      "headline": "AIFF says ISL gets AFC recognition; ISL, Super Cup champions to get indirect slotsThe All India Football Federation (AIFF) on Thursday confirmed that the Asian Football Confederation (AFC) has recognised the truncated 2025-26 Indian Super League, with winners of the ISL and Super Cup earning indirect entry into the AFC Champions League 2 via zonal qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hs-prannoy-india-open-bird-droppings-disrupt-match-monkey-delhi-2852436-2026-01-15",
      "headline": "Dirty drop: Bird poop halts India Open match, day after monkey spotted in standsIndia Open 2026: The men's singles pre-quarters match between HS Prannoy and Loh Kean Yew was halted twice after bird droppings fell on the main court. The halts came days after the BAI assured the venue was pigeon-free, while responding to Denmark shuttler Mia Blichfeldt's allegations of unhygienic playing conditions in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-sack-director-m-najmul-islam-players-boycott-bpl-2852426-2026-01-15",
      "headline": "Bangladesh Cricket Board sack director M Najmul Islam after players boycott BPLThe Bangladesh Cricket Board (BCB) on Thursday sacked director M Nazmul Islam, relieving him of all responsibilities, including his position as head of the finance committee, following demands from cricketers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mehidy-hasan-miraz-criticises-bcb-finance-chairman-t20-world-cup-compensation-2852411-2026-01-15",
      "headline": "Mehidy Hasan slams BCB director over bizarre remarks: Shameful, inappropriateMehidy Hasan Miraz slammed BCB director M. Najmul Islam's \"shameful\" remarks on player compensation, triggering backlash from cricketers and boycott threats amid Bangladesh's T20 World Cup uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/henil-patel-five-wicket-haul-india-bowl-out-usa-under-19-world-cup-opener-2852406-2026-01-15",
      "headline": "India's Henil Patel wreaks havoc with sensational five-wicket haul vs USAIndia made a thunderous start to their ICC Under-19 World Cup campaign as Henil Patel spearheaded a ruthless bowling performance with a five-wicket haul to dismantle the USA for a paltry 107 in 35.2 overs on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-rajkot-odi-india-nz-hanuma-vihari-2852393-2026-01-15",
      "headline": "Nitish faces trolls, but finds backing from former India batter after Rajkot ODIFormer India batter Hanuma Vihari has jumped to the defence of Nitish Kumar Reddy after the all-rounder was trolled on social media, following his performance in the Rajkot ODI. Nitish didn't have a big role to play in the second match as New Zealand levelled the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/daryl-mitchell-lincoln-pitch-training-success-india-spin-friendly-conditions-2852345-2026-01-15",
      "headline": "How Daryl Mitchell prepared for India's white-ball tour in New ZealandIndia vs New Zealand: Batting mainstay Daryl Mitchell said training at New Zealand Cricket's marquee pitch facility in Lincoln helped him adapt to spin-friendly subcontinent conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-showcause-notice-najmul-islam-player-boycott-threat-2852325-2026-01-15",
      "headline": "Bangladesh issue showcause to director as players revolt sees BPL game delayedBangladesh cricket remains in turmoil as players' revolt sees a BPL game get delayed with both teams yet to reach the stadium. The Bangladesh cricket board has issued a showcase notice to director Najmul Islam, whom the players want out of the organisation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-usa-u-19-world-cup-live-score-vaibhav-suryavanshi-ayush-mhatre-2852280-2026-01-15",
      "headline": "IND vs USA, U-19 World Cup Highlights: India off to nervy win as Henil, Kundu starIND vs USA U-19 World Cup live score: Abhigyan Kundu has got India over the line with a sensational knock as India start their campaign with a win. USA put on a brave fight with the ball but in the end, India's quality proved to be too much in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-draw-jannik-sinner-novak-djokovic-semi-final-showdown-2852271-2026-01-15",
      "headline": "Australian Open: Sinner, Djokovic on course for semi-final showdownJannik Sinner and Novak Djokovic are on course for a mouth-watering semi-final showdown at the Australian Open after the draw was revealed at Melbourne Park on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-vs-up-warriorz-match-preview-predicted-xi-2852261-2026-01-15",
      "headline": "Winless UP Warriorz seek revival against in-form Mumbai IndiansWPL 2026, MIW vs UPW Preview: UP Warriorz, still searching for their first win of the season, come into the match after a seven-wicket defeat to Delhi Capitals. Mumbai Indians, meanwhile, beat Gujarat Giants in their previous outing and have enjoyed a day's rest ahead of the clash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-poor-form-bbl-kamran-akmal-urges-return-pakistan-2852248-2026-01-15",
      "headline": "Mohammad Rizwan should leave Big Bash League and return to Pakistan: Former batterKamran Akmal has called on Mohammad Rizwan to leave the Big Bash League due to his disappointing performance. The call highlights the pressure on Rizwan as he struggles to adapt to fast-paced T20 cricket and faces an uncertain future in Pakistan's T20 squad."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}