{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sri-lotus-developers-ipo-review-shah-rukh-khan-amitabh-bachchan-bollywood-celebrities-2759947-2025-07-23",
      "headline": "SRK and Big B back this IPO: All you need to know about Sri Lotus DevelopersOther celebrities, including Hrithik Roshan, Ajay Devgn, Ektaa Kapoor, Sara Ali Khan, Tiger Shroff, and Rajkummar Rao have also invested in the firm as per reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-abhishek-walia-explains-why-timing-your-investments-matters-as-much-as-diversifying-2759920-2025-07-23",
      "headline": "CA explains why timing your investments matters as much as diversifyingCA explains that good investing isn't just about picking the right assets, it's about planning for the right moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-posts-rs-123-crore-profit-in-q1-is-it-a-good-time-to-buy-the-stock-2759902-2025-07-23",
      "headline": "Paytm posts Rs 123 crore profit in Q1: Is it a good time to buy the stock?Paytm's Q1 profit signals a turning point, but long-term sustainability hinges on regulatory clarity, competitive strength, and consistent execution across payments and lending. Investors must weigh promise against real-world pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/deepinder-goyal-net-worth-rs-2000-crore-rise-eternal-shares-rise-record-high-2759886-2025-07-23",
      "headline": "Deepinder Goyal adds Rs 2,000 crore as Eternal shares hit record highShares of Eternal jumped over 21% in the last 48 hours, hitting a new record high of Rs 311.60 on the NSE on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-over-200-points-up-nifty-above-25100-infosys-gains-1-2759880-2025-07-23",
      "headline": "Sensex, Nifty open higher after US-Japan trade deal; Tata Motors leads gainsThe S&P BSE Sensex was up by 201.98 points to 82,388.09, while the NSE Nifty50 gained 63 points to 25,123.90 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-july-23-us-japan-trade-deal-15-percent-tariff-2759869-2025-07-23",
      "headline": "Will US-Japan trade deal weigh in on Sensex, Nifty today?Gift Nifty futures were trading at 25,181.50 as of 8:30 am, indicating that the Nifty 50 may open above Tuesday's close of 25,060.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-mainboard-market-dalal-street-rs-258-lakh-crore-primary-market-2759861-2025-07-23",
      "headline": "IPO season heating up with Rs 2.58 lakh crore in queue: Is Dalal Street ready?After a steady first half, the second half of 2025 is expected to be packed with major public issues.  In July alone, 11 mainboard IPOs have either been listed or are set to launch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-quit-why-kristin-cabot-was-not-fired-over-coldplay-kiss-cam-scandal-2759715-2025-07-22",
      "headline": "CEO quits, HR head stays: Why Astronomer didn't fire Kristin Cabot over kiss cam rowAstronomer CEO Andy Byron resigned after a viral kiss cam video showed him and HR head Kristin Cabot cuddling at a Coldplay concert, sparking public backlash. While Cabot remains employed, legal experts say contractual obligations and internal investigations likely explain the delay in any action against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-posts-rs-123-crore-profit-in-q1fy26-strengthens-lead-in-merchant-payments-2759667-2025-07-22",
      "headline": "Paytm posts Rs 123 crore profit in Q1FY26, strengthens lead in merchant paymentsOperating revenue rises 28% YoY; contribution profit up 52% as AI-led efficiencies and financial services boost bottom line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-anish-shah-ceo-mahindra-annual-salary-top-paid-auto-sector-ceo-95-percent-hike-rs-47-crore-2759620-2025-07-22",
      "headline": "Who Is Anish Shah, the auto CEO whose salary nearly doubled to Rs 47 crore?Anish Shah, Group CEO and managing director of the Mahindra Group, entered the list of top 5 paid auto CEOs for the first time. He received a 95% hike in pay, with his total earnings touching Rs 47.33 crore in FY25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-small-ais-check-can-save-you-from-a-tax-notice-2759547-2025-07-22",
      "headline": "How a small AIS check can save you from a tax noticeIf you skip checking your AIS, you might end up missing some income details. This can lead to a mismatch between what you file and what the tax department already knows, and that can easily get you a notice later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-flat-nifty-below-25100-eternal-up-11-percent-tata-motors-down-2759578-2025-07-22",
      "headline": "Sensex closes flat, Nifty below 25,100; Eternal up 11%The S&P BSE Sensex lost 13.53 points to end at 82,186.81, while the NSE Nifty50 ended lower by 29.80 points to close at 25,060.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-entry-india-problem-competition-model-y-price-ev-sector-news-mahindra-tata-mg-2759556-2025-07-22",
      "headline": "Why Tesla's ride into India's EV market won't be a smooth oneTesla's entry comes at a time when it is facing its biggest drop in global sales to date. Its domestic sales in the US fell 6.3% in the second quarter of 2025, the third straight quarterly decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-is-now-tax-free-check-who-benefits-and-how-income-tax-exemption-2759508-2025-07-22",
      "headline": "NOIDA is now tax-free. Check who benefits and howAt a time when cities are competing hard to attract businesses and investors, this tax relief could give NOIDA a fresh edge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-receives-plea-to-cut-28-percent-gst-on-aerated-drinks-2759502-2025-07-22",
      "headline": "Government receives plea to cut 28% GST on aerated drinksThe matter is likely to be taken up at the upcoming 56th GST Council meeting, expected to be held in mid-August. The meeting is already set to review a broader rate rationalisation framework, with officials indicating that certain slabs and cesses may be simplified or merged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ex-icici-ceo-chanda-kochhar-rs-64-crore-vibe-videocon-tribunal-bribe-case-report-2759484-2025-07-22",
      "headline": "Chanda Kochhar found guilty in Rs 64-crore Videocon bribe case: ReportAn appellate tribunal gave this ruling in an order dated July 3. The tribunal said that the money was routed through Kochhar's husband Deepak Kochhar, using a company connected to Videocon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-indian-homebuyers-growing-wealth-or-buying-liabilities-explains-consultant-2759436-2025-07-22",
      "headline": "Are Indian homebuyers growing wealth or buying liabilities? Explains consultantA real-estate consultant points out that the middle class often assumes owning a house means they are moving forward, but in reality, possession alone does not guarantee real financial progress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-rcom-fraud-sbi-allegation-cbi-case-trouble-reliance-communications-2759429-2025-07-22",
      "headline": "SBI to approach CBI after tagging Anil Ambani and RCom as 'fraud'SBI's exposure to Reliance Communications includes a fund-based principal outstanding of Rs 2,227.64 crore, along with interest and expenses since August 26, 2016. In addition, there is a non-fund based bank guarantee exposure of Rs 786.52 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-stricter-digital-banking-rules-what-it-means-for-you-2759405-2025-07-22",
      "headline": "RBI proposes stricter digital banking rules: What it means for youTo keep online fraud in check, all banks must use proper fraud detection tools and keep an eye on unusual transactions. They should also study how customers usually spend money so that any odd activity can be spotted quickly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-now-a-household-name-new-ceos-first-statement-after-kiss-cam-scandal-2759370-2025-07-22",
      "headline": "Astronomer now a household name: New CEO's first statement after kiss-cam scandalFormer CEO Andy Byron stepped down days after a video of him and Chief People Officer Kristin Cabot appearing on a 'kiss cam' at a Coldplay concert near Boston went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-ban-sebi-removal-with-conditions-investigation-ongoing-stock-market-manipulation-2759369-2025-07-22",
      "headline": "Sebi clears Jane Street to resume trading, with strings attachedJane Street was allowed to return to the markets after it complied with a key part of Sebi's interim order. The firm deposited Rs 4,844 crore in an escrow account held with a scheduled commercial bank in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-see-sharp-rally-after-q1-results-buy-sell-or-hold-2759367-2025-07-22",
      "headline": "Eternal shares see sharp rally after Q1 results. Buy, sell or hold?The rally comes on the back of strong performance across verticals, with quick commerce overtaking food delivery in terms of Net Order Value (NOV) for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-jump-14-after-q1-results-check-target-price-brokerage-views-2759364-2025-07-22",
      "headline": "Eternal shares jump 14% after Q1 results. Check target price, brokerage viewsThe stock rose 13.38% to Rs 307.50 on the Bombay Stock Exchange at 9:34 am, crossing the Rs 300 milestone for the first time and extending its recent upward trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-md-anup-kumar-resigns-fuels-buzz-around-indusind-bank-ceo-role-2759355-2025-07-22",
      "headline": "Bajaj Finance MD Anup Kumar Sinha resigns amid IndusInd Bank CEO role buzBajaj Finance shares were up 0.82% on the Bombay Stock Exchange around 9:17 am, while IndusInd Bank rose nearly 2.4%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rally-sensex-opens-267-points-higher-nifty-above-25100-eternal-jumps-10-2759351-2025-07-22",
      "headline": "Sensex opens 267 points higher, Nifty above 25,100; Eternal jumps 10%The S&P BSE Sensex was up by 204.96 points to 82,405.30, while the NSE Nifty5o gained 43.90 points to 25,123.55 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-paid-auto-sector-ceo-salary-pawan-munjal-hero-rajiv-bajaj-anish-shah-mahindra-jayadev-galla-2759339-2025-07-22",
      "headline": "Pawan Munjal top paid auto sector CEO in India. Check others on the listHero MotoCorp chairman and managing director Pawan Munjal remained the highest-paid auto sector CEO in FY25. His total pay stood at Rs 109.41 crore, the same as in FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-update-news-government-starts-talks-with-states-ministries-da-hike-salary-news-2759330-2025-07-22",
      "headline": "8th Pay Commission update: Government kickstarts talks with states, ministriesThe government adjusts the salaries of employees and pensioners through dearness allowance (DA), which is reviewed every six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/mango-millionaire-makes-money-feel-relatable-radhika-gupta-niranjan-awasthi-2758912-2025-07-21",
      "headline": "From Bollywood to dal-chawal, Mango Millionaire makes money feel relatable'Mango Millionaire' turns personal finance into a relatable conversation, using Bollywood, family meals, and everyday metaphors to explain money matters. It's simple, practical, and feels more like advice from a friend than a finance manual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/louis-vuitton-faces-scrutiny-over-hong-kong-data-leak-2759100-2025-07-21",
      "headline": "Louis Vuitton faces scrutiny over Hong Kong data leakHong Kong's Office of the Privacy Commissioner for Personal Data said on Monday that it has started an investigation into how this happened and whether the company told the authorities on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-survey-2025-foundit-appraisals-done-not-enough-employees-want-to-change-jobs-2759058-2025-07-21",
      "headline": "Over 85% of employees plan to change jobs after salary hikes in 2025: SurveyMost hikes fell in the 5–10% range, with only a small fraction crossing the 20% mark. Advertising, education, and IT saw the highest share of professionals reporting no hike at all, while sectors like energy and BFSI offered relatively better payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-shock-for-karnataka-vendor-raises-concerns-among-small-upi-users-2759049-2025-07-21",
      "headline": "GST shock for Karnataka vendor raises concerns among small UPI usersThe incident shows why small traders might stop taking UPI payments out of fear. Many would rather handle cash than deal with confusing tax demands. This goes against the government's aim of building a cashless economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-homes-under-rs-1-crore-metro-city-property-price-rs-1-crore-new-delhi-mumbai-bangalore-2759033-2025-07-21",
      "headline": "Affordable homes are vanishing. Can you still get a 2BHK under Rs 1 crore?Real estate prices across major metros have surged due to strong demand, high construction costs, and a steady flow of luxury housing projects. Yet, there are still locations in both Tier-1 and Tier-2 cities where a 2BHK under Rs 1 crore is within reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-442-points-nifty-ends-above-25000-eternal-jumps-over-7-2759031-2025-07-21",
      "headline": "Sensex gains 442 points, Nifty ends above 25,000; Eternal jumps over 7%The S&P BSE Sensex gained 442.61 points to close at 82,200.34, while the NSE Nifty50 added 122.30 points to end at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/have-not-got-your-tax-refund-yet-here-is-why-it-may-be-delayed-wrong-hra-claims-mismatch-itr-ais-data-2758954-2025-07-21",
      "headline": "Haven't got your tax refund yet? Here's why it may be delayedSometimes, taxpayers claim deductions like HRA or medical insurance without having proper proof. If the tax department finds something suspicious, they may stop your refund and send you a notice for more details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-now-hosts-over-half-the-worlds-gccs-led-by-bengaluru-2758930-2025-07-21",
      "headline": "India now hosts over half the world's GCCs, led by BengaluruFrom cost-saving outposts to strategic anchors, India's GCC evolution is reshaping global operations. As Tier-2 cities gear up, the next big wave might come from smaller, smarter urban bets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-in-lok-sabha-today-how-it-impacts-you-2758892-2025-07-21",
      "headline": "New income tax bill in Lok Sabha today: How it impacts youThe Bill aims to make clearer rules for exemptions, TDS, TCS, and not-for-profit organisations. All this, the government hopes, will cut down on confusion and save everyone time and trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-vegetable-vendor-hit-with-rs-29-lakh-gst-notice-here-is-why-2758841-2025-07-21",
      "headline": "Karnataka vegetable vendor hit with Rs 29 lakh GST notice. Here's whySelling veggies for four years and accepting UPI has landed Shankargouda with a Rs 29 lakh GST notice on Rs 1.63 crore turnover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-share-price-nse-bse-27-percent-premium-market-debut-review-2758793-2025-07-21",
      "headline": "Anthem Biosciences share price: Stock lists at 27% premium on market debutAnthem Biosciences stock price: The company's shares opened at Rs 723.05 on the NSE and Rs 723.10 on the BSE. This was about 27% higher than its issue price of Rs 570."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/burger-singh-hilariously-debunks-rs-47-crore-funding-report-clatification-goes-viral-2758780-2025-07-21",
      "headline": "Burger Singh debunks Rs 47 crore funding claim with viral statementIn a statement that's equal parts denial and stand-up comedy set, the homegrown burger chain responded to reports that it had secured a Rs 47.15 crore investment round, calling the claims premature, misleading, and just plain wrong—at least for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-ril-reliance-shares-falls-2-percent-2758766-2025-07-21",
      "headline": "Sensex opens flat, Nifty below 25,000; RIL falls 2%The S&P BSE Sensex was down by 130.29 points to 81,627.44, while the NSE Nifty50 lost 48.95 points to 24,919.45 as of 9:22 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-confirms-all-of-us-are-dead-season-2-with-fresh-zombie-threat-2759919-2025-07-23",
      "headline": "Netflix confirms All of Us Are Dead season 2 with fresh zombie threat. Watch'All of Us Are Dead' is set to return on Netflix with a new season. The second season will follow the aftermath of the zombie outbreak. A mix of returning and new actors will join the cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-incredible-weight-loss-looks-unrecognisable-in-new-pics-loses-26-kgs-without-exercise-2759937-2025-07-23",
      "headline": "Boney Kapoor looks unrecognisable in new pics, loses 26 kgs without exercise: ReportBoney Kapoor has shed 26 kilos without setting foot in a gym, relying solely on a disciplined diet inspired by a heartfelt memory of his late wife, Sridevi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-salman-khan-aamir-khan-give-saiyaara-premiere-a-miss-ahaan-panday-aneet-padda-mohit-suri-2759938-2025-07-23",
      "headline": "Exclusive: Here's why Khan families gave Saiyaara premiere a missSaiyaara has become the biggest hit of the year, earning over Rs 100 crore in just four days. The film's success comes despite a deliberately low-key release and the absence of major celebrities at the premiere, including the Khans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shahid-kapoor-chhatrapati-shivaji-biopic-shelved-director-amit-rai-confirms-2759888-2025-07-23",
      "headline": "Shahid Kapoor-starrer Chhatrapati Shivaji biopic shelved, director Amit Rai confirmsThe biopic on Chhatrapati Shivaji Maharaj, starring Shahid Kapoor, has been shelved. Director Amit Rai confirmed the development in a recent interview and criticised systemic issues in the film industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-mother-deanne-panday-pours-heart-in-special-note-calls-saiyaara-success-blessing-of-grandparents-2759929-2025-07-23",
      "headline": "Ahaan's mother pours heart in special note, calls Saiyaara blessing of grandparentsAhaan Panday's mother, Deanne Panday, shared an emotional message as her son enjoys success with 'Saiyaara', reflecting on his upbringing and family blessings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karuppu-teaser-suriya-unleashes-full-swag-in-rj-balajis-action-drama-2759914-2025-07-23",
      "headline": "Karuppu teaser: Suriya unleashes full swag in RJ Balaji's action dramSuriya's birthday was marked by the release of the teaser for 'Karuppu', a film that promises a blend of cultural richness and high-energy storytelling. This cinematic glimpse has generated excitement among fans, showcasing Suriya in diverse avatars and hinting at a visually captivating and emotionally deep narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-5-detailed-report-ahaan-panday-unstoppable-film-gets-bigger-tuesday-than-monday-2759912-2025-07-23",
      "headline": "Saiyaara box office Day 5: Ahaan's unstoppable film gets bigger Tuesday than MondayYRF's 'Saiyaara' has rocked the box office like no other love story starring debutants could do before. The film is looking at wrapping its first week in the range of Rs 160 crore nett, and that should speak for the kind of terrific traction it is receiving from the audience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-every-actor-now-wants-to-play-the-villain-in-pan-india-films-2759823-2025-07-23",
      "headline": "Why every actor now wants to play the villain in pan-India filmsBig stars playing villains are becoming a regular feature in pan-India films. From Rana as 'Baahubali's' Bhallaladeva to Bobby Deol in 'Animal', these roles are now stylish, powerful, and central to the story. But as more actors take this route, it raises questions about where the trend is heading and what it means for the future of Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-steps-out-for-saiyaara-screening-with-rumoured-boyfriend-rahul-mody-2759897-2025-07-23",
      "headline": "Shraddha Kapoor steps out for Saiyaara screening with rumoured boyfriend Rahul ModyShraddha Kapoor was recently seen with her rumoured boyfriend Rahul Mody at the screening of 'Saiyaara'. In the video going viral on social media, the duo could be seen stepping out after watching the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-shows-swollen-face-after-lip-filler-removal-reveals-if-she-can-speak-2759870-2025-07-23",
      "headline": "Uorfi Javed shows swollen face after lip filler removal, reveals if she can speakInfluencer and reality TV star Uorfi Javed shared a video of her puffy face after lip filler removal. In the video, the 26-year-old revealed if she could talk after her face swelled after the procedure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-has-been-through-a-lot-says-sister-in-law-shilpa-shirodkar-2759890-2025-07-23",
      "headline": "Mahesh Babu has been through a lot, says sister-in-law Shilpa ShirodkarTelugu superstar Mahesh Babu faced a heart-wrenching year in 2022 with the sudden loss of his father, mother, and brother, as revealed by his sister-in-law Shilpa Shirodkar. She praised his unwavering strength and support for family during these tough times. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-coldplay-christ-martin-us-concert-kiss-came-row-2759882-2025-07-23",
      "headline": "AR Rahman pulls off a Chris Martin at US concert amid Coldplay kiss cam row. WatchAR Rahman took a dig at the Coldplay row at his concert in Washington, US. At the event, the cameraman focussed on the crowd when Rahman cracked the joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blancos-cheeky-post-kicks-off-selena-gomezs-33rd-birthday-celebrations-2759873-2025-07-23",
      "headline": "Benny Blanco's cheeky post kicks off Selena Gomez's 33rd birthday celebrationsSelena Gomez celebrated her 33rd birthday on Tuesday, July 22. Her fiancé, Benny Blanco, shared heartfelt moments on Instagram to mark the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-jaipur-temple-visit-photos-tu-meri-main-tera-main-tera-tu-meri-kartik-aaryan-2759854-2025-07-23",
      "headline": "Ananya Panday visits Hanuman Ji temple in Jaipur amid 'Tu Meri...' shoot. PicsBollywood actor Ananya Panday recently visited Kale Hanuman Ji Temple in Jaipur and expressed gratitude. Currently in Rajasthan for a film shoot, she shared images from her visit on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-meets-rajasthan-cm-bhajanlal-sharma-tu-meri-main-tera-main-tera-tu-meri-2759855-2025-07-23",
      "headline": "Kartik Aaryan meets Bhajanlal Sharma during Tu Mera Main Tera shoot in RajasthanBollywood actor Kartik Aaryan met Rajasthan's Chief Minister Bhajanlal Sharma during his film shoot. Jackie Shroff joins the cast of 'Tu Meri Main Tera Main Tera Tu Meri'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanushree-dutta-harassment-police-complaint-me-too-activism-2759843-2025-07-23",
      "headline": "Tanushree Dutta breaks down in video, claims harassment at home since MeToo rowIn a video, actor Tanushree Dutta claimed she has been facing harassment at her home since 2018, following the #MeToo movement. She broke down and said that she would be lodging a police complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-new-promo-amar-upadhyay-on-being-offered-mihir-smriti-irani-ekta-kapoor-2759760-2025-07-23",
      "headline": "Amar Upadhyay on being offered Mihir in Kyunki...: Thought someone had pulled a prankActor Amar Upadhyay is all set to reprise his role of Mihir Virani in Ekta Kapoor 'Kyunki Saas Bhi Kabhi Bahu Thi'. In a new promo, he shared his reaction to being offered the iconic character. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/black-sabbath-lead-singer-ozzy-osbourne-dies-at-76-weeks-after-farewell-show-2759803-2025-07-22",
      "headline": "Black Sabbath lead singer Ozzy Osbourne dies at 76, weeks after farewell showThe British rocker rose to fame as the lead singer of Black Sabbath, where his voice became a defining force of heavy metal. He introduced the world to groundbreaking tracks like \"Iron Man,\" \"Paranoid,\" and \"War Pigs.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidya-balan-backs-deepika-padukone-flexible-work-hours-new-mothers-sandeep-reddy-vanga-row-2759687-2025-07-22",
      "headline": "Vidya Balan backs flexible working hours for new mothers amid Deepika-Vanga rowActor Vidya Balan recently spoke about the need for flexible working hours to support new mothers in the film industry. She urged the adoption of empathetic work cultures to retain women workforce in cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-resignation-opposition-congress-speculation-vice-president-2759925-2025-07-23",
      "headline": "'Dal mein kuch kaala': Opposition speculation on Veep's exit refuses to dieCongress chief Mallikarjun Kharge suggested that some mischief was at play behind Jagdeep Dhankhar's sudden resignation and questioned the conspicuous silence of the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-to-set-up-special-bench-to-hear-justice-varma-plea-in-cash-row-as-chief-justice-recuses-himself-2759940-2025-07-23",
      "headline": "Top court to form special bench in cash row plea as Chief Justice recuses himselfJustice Yashwant Varma was divested of judicial work and sent back to the Allahabad High Court from the Delhi High Court in April after a fire broke out at his official residence in Delhi. During firefighting operations, bundles of cash were found in March, prompting an inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-relations-reset-trump-ric-jaishankar-xi-jinping-galwan-trade-deficit-geopolitical-pragmatism-2759184-2025-07-23",
      "headline": "In India, China inching closer, a Trump role he won't brag aboutThe deep chill in India-China ties seems to be over with Beijing welcoming Moscow's proposal for a tri-nation bloc. Though India and China are natural competitors, it is a realisation brought about by US President Trump's brazenness, Washington's slant during the Indo-Pak mini-war, and a mutual need that is making the two shake hands, albeit with Op Sindoor awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/india-student-assaulted-in-australia-adelaide-racially-abused-parking-dispute-2759936-2025-07-23",
      "headline": "F*** off, Indian: Student kicked, punched after parking spot tiff in AustraliaCharanpreet Singh, a 23-year-old Indian student, suffered brain trauma and facial fractures after being attacked by five men shouting racial slurs in Adelaide. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/the-late-show-comedians-unite-stephen-colbert-f-bomb-trump-jimmy-fallon-kimmel-anderson-cooper-2759894-2025-07-23",
      "headline": "The 'Solidarity' Show: Comedians roast Trump as he targets late-night hostsA bevy of celebrities as well as late-night TV giants like Jimmy Fallon and Anderson Cooper assembled on Colbert's late-night show. Armed with sharp wit and wisecracks, they took on Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-opposition-protest-lok-sabha-rajya-sabha-bihar-elections-modi-congress-2759898-2025-07-23",
      "headline": "Live: Another rocky start, both Houses witness Opposition sloganeeringParliament Session 2025 Live Updates: The third day of the ongoing Monsoon Session of Parliament will resume at 11 am today and Opposition parties are most likely to intensify their demand for discussions on the Pahalgam terror attack and voter-roll revision in Bihar. On Tuesday, repeated protests by opposition MPs over the same issues brought both Houses to a standstill, stalling proceedings in the Lok Sabha and Rajya Sabha for the second consecutive day. In the Lok Sabha, opposition leaders stormed the Well at 11 am, waving placards and shouting slogans to press for the withdrawal of the Special Intensive Revision (SIR) of the electoral rolls in Bihar. Agriculture Minister Shivraj Singh Chouhan urged them to let the Question Hour proceed, but his plea went unheeded, forcing Speaker Om Birla to adjourn the House till noon. Each time the Lower House reassembled, similar disruptions erupted. The Rajya Sabha also witnessed multiple adjournments following uproar over the two prime issues and was ultimately adjourned for the day shortly after it met post-lunch at 2 pm without conducting any business. Follow indiatoday.in for all Live Updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-preview-predicted-xi-pitch-report-weather-forecast-2759800-2025-07-23",
      "headline": "4th Test: Depleted and hurt, Gill's India hunt Lord's payback in ManchesterIndia vs England: Shubman Gill's India lost the Lord's Test match by a narrow margin. Depleted and hurt, the Indian team will look to hit back at England in the damp conditions of Manchester on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-power-sharing-demand-gets-shriller-is-tamil-nadu-set-for-a-new-phase-of-coalitions-2759589-2025-07-22",
      "headline": "Is Tamil Nadu set for a new phase of coalitions?The phrase defining this aspiration—'a share in governance... a share in authority'—was first articulated last year by the DMK's partner Viduthalai Chiruthaigal Katchi"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanushree-dutta-harassment-police-complaint-me-too-activism-2759843-2025-07-23",
      "headline": "Tanushree Dutta breaks down in video, claims harassment at home since MeToo rowIn a video, actor Tanushree Dutta claimed she has been facing harassment at her home since 2018, following the #MeToo movement. She broke down and said that she would be lodging a police complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-confirms-pakistan-visit-fuels-buzz-of-trump-sharif-meeting-in-washington-2759884-2025-07-23",
      "headline": "US confirms Pakistan visit, fuels buzz of Trump-Sharif meeting in WashingtonTammy Bruce was responding to a reporter who asked for her thoughts on Donald Trump's past offer to mediate on the Kashmir issue - a proposal he had made while claiming to have prevented war between India and Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-asi-suicide-video-death-note-mp-police-datia-sand-mafia-nexus-torture-2759885-2025-07-23",
      "headline": "Madhya Pradesh cop exposes big police-sand mafia nexus, then dies by suicideA 51-year-old Madhya Pradesh cop was found dead by suicide inside his police quarters after recording chilling videos accusing his senior officers and a local sand mafia of mental torture and caste abuse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-incredible-weight-loss-looks-unrecognisable-in-new-pics-loses-26-kgs-without-exercise-2759937-2025-07-23",
      "headline": "Boney Kapoor looks unrecognisable in new pics, loses 26 kgs without exercise: ReportBoney Kapoor has shed 26 kilos without setting foot in a gym, relying solely on a disciplined diet inspired by a heartfelt memory of his late wife, Sridevi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/steeped-in-fanaticism-serial-borrower-from-imf-india-blasts-pakistan-at-un-2759862-2025-07-23",
      "headline": "Steeped in fanaticism, serial borrower from IMF: India blasts Pak at UNParvathaneni Harish also issued a strong message on the need for accountability in terror cases, citing the April 22 terrorist attack in Pahalgam, Jammu and Kashmir, in which 26 civilians were killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-salman-khan-aamir-khan-give-saiyaara-premiere-a-miss-ahaan-panday-aneet-padda-mohit-suri-2759938-2025-07-23",
      "headline": "Exclusive: Here's why Khan families gave Saiyaara premiere a missSaiyaara has become the biggest hit of the year, earning over Rs 100 crore in just four days. The film's success comes despite a deliberately low-key release and the absence of major celebrities at the premiere, including the Khans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/500-billion-year-old-fossil-reveals-where-spiders-on-your-wall-came-from-2759934-2025-07-23",
      "headline": "500-billion-year-old fossil reveals where spiders on your wall came fromSpiders and scorpions have ruled as terrestrial predators for 400 million years, with their success often attributed to adaptations for life on land."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-shows-swollen-face-after-lip-filler-removal-reveals-if-she-can-speak-2759870-2025-07-23",
      "headline": "Uorfi Javed shows swollen face after lip filler removal, reveals if she can speakInfluencer and reality TV star Uorfi Javed shared a video of her puffy face after lip filler removal. In the video, the 26-year-old revealed if she could talk after her face swelled after the procedure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-raps-ips-officer-after-ex-husband-jailed-for-109-days-over-false-cases-2759926-2025-07-23",
      "headline": "Apologise: Supreme Court raps IPS officer after ex-husband jailed over false casesThe Supreme Court also warned the officer \"not to use her position and power\" - or that of her colleagues or superiors - to initiate any proceedings against her ex-husband or his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kanwar-yatra-2025-modern-bhakti-what-keeps-them-walking-2759840-2025-07-23",
      "headline": "5 states, 12 cities: What Kanwar Yatra 2025 tells us about modern bhaktiIndia Today spoke to over 100 Kanwar yatris across five states and 12 cities to understand what keeps them walking and why this journey of faith matters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/this-was-treason-trump-accuses-obama-of-rigging-us-presidential-elections-2759810-2025-07-23",
      "headline": "Bizarre, outrageous: Obama hits back at Trump over 2016 election treason chargeTrump repeated remarks made by Tulsi Gabbard, his intelligence chief, who said Obama officials should face prosecution. Gabbard released documents and called the 2016 events a \"treasonous conspiracy\" by top Obama officials to damage Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-every-actor-now-wants-to-play-the-villain-in-pan-india-films-2759823-2025-07-23",
      "headline": "Why every actor now wants to play the villain in pan-India filmsBig stars playing villains are becoming a regular feature in pan-India films. From Rana as 'Baahubali's' Bhallaladeva to Bobby Deol in 'Animal', these roles are now stylish, powerful, and central to the story. But as more actors take this route, it raises questions about where the trend is heading and what it means for the future of Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-noida-gurgaon-heavy-rain-waterlogging-traffic-jam-flights-advisory-2759865-2025-07-23",
      "headline": "Red alert issued as rain pounds Delhi-NCR. Waterlogging, traffic jams returnThe area near the Delhi airport was also battered by heavy rain. However, no disruption to flight operations was reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-4th-test-manchester-history-analysis-records-2759896-2025-07-23",
      "headline": "Can India make it 2-2 in Manchester Test? Here's what history suggestsENG vs IND, 4th Test: India will be looking to bounce back at the Old Trafford to make it 2-2 in the Test series after their narrow 22-run victory at the Lord's Cricket Ground. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-minor-gang-raped-in-forest-assaulted-again-by-truck-driver-after-escape-in-malkangiri-district-2759703-2025-07-22",
      "headline": "Odisha girl dragged into forest, raped; escapes, assaulted again by truck driverA girl in Odisha was gang-raped by three men in a forest after being abducted, then sexually assaulted by a truck driver moments after escaping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bobby-to-saiyaara-youthful-musical-love-stories-in-bollywood-ahaan-pandey-aneet-padda-mohit-suri-2759472-2025-07-23",
      "headline": "Bobby to Saiyaara: Bollywood's timeless legacy of youthful musical love storiesAs director Mohit Suri's romantic drama 'Saiyaara' achieves a box office milestone, here's a glimpse into the youthful romantic musicals in Bollywood over the decades. What contributes to the cinematic spectacle when it comes to new-age love stories in Hindi cinema? IndiaToday.in shares insights on the Indian film industry's knack at romance sagas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-incredible-weight-loss-looks-unrecognisable-in-new-pics-loses-26-kgs-without-exercise-2759937-2025-07-23",
      "headline": "Boney Kapoor looks unrecognisable in new pics, loses 26 kgs without exercise: ReportBoney Kapoor has shed 26 kilos without setting foot in a gym, relying solely on a disciplined diet inspired by a heartfelt memory of his late wife, Sridevi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-salman-khan-aamir-khan-give-saiyaara-premiere-a-miss-ahaan-panday-aneet-padda-mohit-suri-2759938-2025-07-23",
      "headline": "Exclusive: Here's why Khan families gave Saiyaara premiere a missSaiyaara has become the biggest hit of the year, earning over Rs 100 crore in just four days. The film's success comes despite a deliberately low-key release and the absence of major celebrities at the premiere, including the Khans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shahid-kapoor-chhatrapati-shivaji-biopic-shelved-director-amit-rai-confirms-2759888-2025-07-23",
      "headline": "Shahid Kapoor-starrer Chhatrapati Shivaji biopic shelved, director Amit Rai confirmsThe biopic on Chhatrapati Shivaji Maharaj, starring Shahid Kapoor, has been shelved. Director Amit Rai confirmed the development in a recent interview and criticised systemic issues in the film industry.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-goalkeeper-pant-shastri-indian-men-cricket-teamfootball-xi-2759944-2025-07-23",
      "headline": "Rishabh Pant as left back: Shastri, Lloyd pick Indian cricket's football XITeam India's visit to Manchester United's training facilities ahead of the fourth Test sparked a playful conversation between English pundits and Ravi Shastri about how the Indian cricket team would line up for a football match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-kranti-gaud-england-vs-india-women-video-2759931-2025-07-23",
      "headline": "Watch: Harmanpreet wins heart with special gesture for six-star KrantiENG-W vs IND-W: Harmanpreet Kaur shared her Player of the Match award with Kranti Gaud and gave her an autographed ball after India won the third Women's ODI by 13 runs on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-live-updates-manchester-weather-gill-stokes-score-2759922-2025-07-23",
      "headline": "4th Test, Manchester Weather Live: Will rain delay the start of play on Day 1?India (IND) vs England (ENG), 4th Test, Manchester Weather Live Updates: Trailing 2-1 after a narrow 22-run loss at Lord's, India will be eager to draw level when the fourth Test begins in Manchester today. While overcast conditions are expected, forecasts indicate that rain is unlikely to disrupt play during the match hours.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/will-lionel-messi-play-mls-all-stars-brace-for-clash-against-liga-mx-elite-2759911-2025-07-23",
      "headline": "Will Lionel Messi play? MLS All-Stars brace for clash against Liga MX eliteThe 2025 MLS All-Star Game in Austin, Texas, was expected to be Lionel Messi's first appearance in the event after injury sidelined him in 2024. However, that prospect appeared less certain following Monday's opening training session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-wants-to-india-to-pass-the-benchmark-before-odi-world-cup-2759903-2025-07-23",
      "headline": "Harmanpreet Kaur wants India to pass the benchmark before ODI World CupA series win over England, anchored by her match-winning century, left Indian skipper Harmanpreet Kaur pleased-but far from content. For the captain, India's 2-1 ODI triumph is more than just a morale boost; it's a stepping stone towards a larger ambition-setting new benchmarks ahead of the 2025 Women's ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-4th-test-manchester-history-analysis-records-2759896-2025-07-23",
      "headline": "Can India make it 2-2 in Manchester Test? Here's what history suggestsENG vs IND, 4th Test: India will be looking to bounce back at the Old Trafford to make it 2-2 in the Test series after their narrow 22-run victory at the Lord's Cricket Ground. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-josh-inglis-andre-russell-2nd-t20i-2759887-2025-07-23",
      "headline": "Josh Inglis spoils Andre Russell's farewell as Australia take 2-0 leadWI vs AUS, 2nd T20I: Josh Inglis' unbeaten 78-run knock off 33 balls helped Australia beat West Indies by eight wickets in Andre Russell's last international appearance at the Sabina Park. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anshul-kamboj-glenn-mcgrath-england-vs-india-4th-test-2759864-2025-07-23",
      "headline": "Manchester calling: Glenn McGrath-inspired Anshul Kamboj ready for Test bowWith lessons from Glenn McGrath and learning calmness from MS Dhoni, Anshul Kamboj is all set for his Test bow in Manchester. The pacer has shown maturity and excelled in England during the England A tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-guard-of-honour-farewell-2nd-t20i-video-west-indies-2759858-2025-07-23",
      "headline": "Watch: Andre Russell gets special guard of honour before West Indies farewellWI vs AUS: Before the second T20I, Andre Russell was greeted with a special guard of honour from the West Indies and Australian cricketers at the Sabina Park in Kingston, Jamaica. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-kranti-gaud-india-women-vs-england-women-odi-series-2759845-2025-07-23",
      "headline": "Harmanpreet's historic feat, Kranti's fire seal ODI series win for IndiaIND-W vs ENG-W: Harmanpreet Kaur scored 102 and Kranti Gaud picked up six wickets as India claimed the Women's ODI series after beating England by 13 runs on Tuesday in Chester-le-Street. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-josh-inglis-andre-russell-2nd-t20i-2759887-2025-07-23",
      "headline": "Josh Inglis spoils Andre Russell's farewell as Australia take 2-0 leadWI vs AUS, 2nd T20I: Josh Inglis' unbeaten 78-run knock off 33 balls helped Australia beat West Indies by eight wickets in Andre Russell's last international appearance at the Sabina Park. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anshul-kamboj-glenn-mcgrath-england-vs-india-4th-test-2759864-2025-07-23",
      "headline": "Manchester calling: Glenn McGrath-inspired Anshul Kamboj ready for Test bowWith lessons from Glenn McGrath and learning calmness from MS Dhoni, Anshul Kamboj is all set for his Test bow in Manchester. The pacer has shown maturity and excelled in England during the England A tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-guard-of-honour-farewell-2nd-t20i-video-west-indies-2759858-2025-07-23",
      "headline": "Watch: Andre Russell gets special guard of honour before West Indies farewellWI vs AUS: Before the second T20I, Andre Russell was greeted with a special guard of honour from the West Indies and Australian cricketers at the Sabina Park in Kingston, Jamaica. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-kranti-gaud-india-women-vs-england-women-odi-series-2759845-2025-07-23",
      "headline": "Harmanpreet's historic feat, Kranti's fire seal ODI series win for IndiaIND-W vs ENG-W: Harmanpreet Kaur scored 102 and Kranti Gaud picked up six wickets as India claimed the Women's ODI series after beating England by 13 runs on Tuesday in Chester-le-Street. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}