{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-house-bank-loan-emi-burden-expert-explains-drawabacks-2760148-2025-07-23",
      "headline": "Explained: Why buying flats on hefty EMIs may not be wiseAs returns from residential real estate continue to underwhelm, financial advisors are urging Indians to rethink the emotional appeal of homeownership and consider smarter, more flexible investment avenues for long-term wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-aspiration-to-achievement-paytms-operational-discipline-powers-profitability-2760125-2025-07-23",
      "headline": "From aspiration to achievement: Paytm's operational discipline powers profitabilityThe new stock pricing implies that the Noida-based firm will be valued at 63-times of FY27-ended earnings. This revised valuation reflects the brokerage's positive view of Paytm's structural profitability journey, operating leverage, and robust performance in its core business segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-540-points-nifty-settles-above-25200-tata-motors-bharti-airtel-rally-over-2-2760104-2025-07-23",
      "headline": "Sensex up 540 points, Nifty tops 25,200; Tata Motors, Airtel gain over 2%The S&P BSE Sensex rose 539.83 points to 82,726.64 at the closing bell, while the NSE Nifty50 settled 159 points higher at 25,219.90. Most of the broader market indices also gained during the trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-files-rs-1654-crore-case-against-myntra-over-fdi-violations-2760042-2025-07-23",
      "headline": "ED files Rs 1,654-crore case against Myntra over FDI violationsThe investigation comes at a time when e-commerce firms operating in India, particularly those backed by foreign investment, are facing increasing regulatory scrutiny for allegedly bypassing FDI rules through complex business arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/indiqube-spaces-ipo-review-skip-subscribe-latest-gmp-listing-date-allotment-price-band-2760007-2025-07-23",
      "headline": "Indiqube Spaces IPO: Should you invest? Check GMP and review by expertsIndiqube Spaces is aiming to raise Rs 700 crore through this IPO. The issue includes a fresh issue of 2.74 crore shares worth Rs 650 crore and an offer for sale of 21 lakh shares valued at Rs 50 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-luxury-real-estate-market-hits-rs-14750-crore-sales-2759986-2025-07-23",
      "headline": "Mumbai's luxury real estate market hits Rs 14,750 crore salesEven as affordability worsens for the middle class, Mumbai's luxury real estate market continues to soar, fuelled by billionaires, upgraders and a fresh pipeline of designer residences in coveted neighbourhoods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sri-lotus-developers-ipo-review-shah-rukh-khan-amitabh-bachchan-bollywood-celebrities-2759947-2025-07-23",
      "headline": "SRK and Big B back this IPO: All you need to know about Sri Lotus DevelopersOther celebrities, including Hrithik Roshan, Ajay Devgn, Ektaa Kapoor, Sara Ali Khan, Tiger Shroff, and Rajkummar Rao have also invested in the firm as per reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-abhishek-walia-explains-why-timing-your-investments-matters-as-much-as-diversifying-2759920-2025-07-23",
      "headline": "CA explains why timing your investments matters as much as diversifyingCA explains that good investing isn't just about picking the right assets, it's about planning for the right moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-posts-rs-123-crore-profit-in-q1-is-it-a-good-time-to-buy-the-stock-2759902-2025-07-23",
      "headline": "Paytm posts Rs 123 crore profit in Q1: Is it a good time to buy the stock?Paytm's Q1 profit signals a turning point, but long-term sustainability hinges on regulatory clarity, competitive strength, and consistent execution across payments and lending. Investors must weigh promise against real-world pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/deepinder-goyal-net-worth-rs-2000-crore-rise-eternal-shares-rise-record-high-2759886-2025-07-23",
      "headline": "Deepinder Goyal adds Rs 2,000 crore as Eternal shares hit record highShares of Eternal jumped over 21% in the last 48 hours, hitting a new record high of Rs 311.60 on the NSE on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-over-200-points-up-nifty-above-25100-infosys-gains-1-2759880-2025-07-23",
      "headline": "Sensex, Nifty open higher after US-Japan trade deal; Tata Motors leads gainsThe S&P BSE Sensex was up by 201.98 points to 82,388.09, while the NSE Nifty50 gained 63 points to 25,123.90 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-july-23-us-japan-trade-deal-15-percent-tariff-2759869-2025-07-23",
      "headline": "Will US-Japan trade deal weigh in on Sensex, Nifty today?Gift Nifty futures were trading at 25,181.50 as of 8:30 am, indicating that the Nifty 50 may open above Tuesday's close of 25,060.90."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-documentary-series-in-works-channel-4-2760147-2025-07-23",
      "headline": "A new Taylor Swift documentary series in works? Here's everything we knowSinger-songwriter Taylor Swift's life is set to be examined in an upcoming documentary series. Here's everything we know about it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shaad-randhawa-mohit-suri-constant-star-in-saiyaara-aneet-padda-ahaan-panday-2760065-2025-07-23",
      "headline": "Who is Shaad Randhawa, the Saiyaara actor seen in every Mohit Suri film?Actor Shaad Randhawa has been a staple in films directed by Mohit Suri. He was also seen in his latest directorial 'Saiyaara' featuring Ahaan Panday and Aneet Padda. Randhawa's career includes notable roles in successful films such as 'Aashiqui 2' and 'Ek Villain'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-shares-viral-clip-from-j-hope-concert-jin-jungkook-suga-v-2760032-2025-07-23",
      "headline": "Viral: BTS shares behind-the-scenes clip from J-Hope's last concertBTS shares a behind-the-scenes video from J-Hope's concert in which Jungkook, V, and Suga grabbed the spotlight. The clip has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ratan-thiyam-indian-playwright-theatre-icon-dies-at-77-2760116-2025-07-23",
      "headline": "Ratan Thiyam, Indian playwright and theatre icon, dies at 77Indian playwright and theatre icon Ratan Thiyam died at 77 in Imphal. His death marks a significant loss to Indian theatre and cultural heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-raising-a-girl-we-live-in-india-i-have-to-buy-a-gun-2760117-2025-07-23",
      "headline": "Richa Chadha on raising a girl: We live in India, I have to buy a gunActor Richa Chadha recently spoke about her fear of raising a girl. The actor, in an interview, reflected her concern for her child's safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-sharvari-wagh-feature-war-2-post-credit-scene-alpha-agents-2760054-2025-07-23",
      "headline": "Not SRK, but Alia Bhatt and Sharvari Wagh to feature in War 2 post-credit sceneAlia Bhatt and Sharvari Wagh will appear in the War 2 post-credit scene, setting up YRF's next spy film 'Alpha'. This strategic move builds anticipation for the female-led spy film releasing in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vaani-kapoor-mandala-murders-netflix-thriller-crime-mythology-emotional-growth-2760045-2025-07-23",
      "headline": "Vaani Kapoor on criticism:  If you've nothing constructive to say, don't say at allVaani Kapoor takes on a darker, introspective role in Mandala Murders. She discusses handling criticism and embracing challenges in her digital debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-viral-scene-breaking-internet-and-hearts-starring-ahaan-panday-aneet-padda-heartbreaking-stadium-scene-breakdown-2760039-2025-07-23",
      "headline": "This one wild scene in Saiyaara is breaking the internet - and heartsIn 'Saiyaara', full of music, love and longing, there's one scene that has been creating noise online. For many, it's the most unforgettable scene of the film, and the one that captures the ache of waiting. Read on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dilip-joshi-dismisses-taarak-mehta-ka-ooltah-chashmah-exit-rumours-attends-show-success-bash-2760034-2025-07-23",
      "headline": "Dilip Joshi dismisses Taarak Mehta exit rumours, attends show's success bashActor Dilip Joshi dismissed rumours of his exit from 'Taarak Mehta Ka Ooltah Chashmah'. The actor attended the success bash of the popular sitcom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-says-trusting-anurag-basu-in-metro-in-dino-came-naturally-2759956-2025-07-23",
      "headline": "Exclusive: Sara Ali Khan says trusting Anurag Basu in Metro In Dino came naturallySara Ali Khan shared her experience of playing Chumki in Anurag Basu's 'Metro... In Dino'. In an interview with India Today, she reflected on modern relationships and the freedom of working with a visionary director."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-50th-birthday-jyotika-party-actor-fans-outside-his-home-2760013-2025-07-23",
      "headline": "Jyothika celebrates Suriya's 50th birthday, actor waves at fans gathered outside homeActor Suriya turned 50 years old on Wednesday, July 23. His actor-wife Jyothika hosted a party to celebrate his milestone birthday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/dylan-marlowe-breaks-silence-being-kicked-out-concert-2759975-2025-07-23",
      "headline": "Singer Dylan Marlowe kicked out of country jam festival, reacts to viral clipIn a TikTok post, country singer Dylan Marlowe revealed the reason behind his removal from the Country Jam music festival in Eau Claire, Wisconsin. The 'Boys Back Home' singer forgives the guard. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-congratulates-team-saiyaara-praises-ahaan-pandey-aneet-padda-mohit-suri-2759968-2025-07-23",
      "headline": "Aamir Khan congratulates team Saiyaara, praises Ahaan Panday and Aneet PaddaAamir Khan shared a heartfelt note congratulating the Saiyaara team for its box office storm, praising Ahaan Panday and Aneet Padda for their stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-tanvi-the-great-tax-free-in-madhya-pradesh-chief-minister-mohan-yadav-2759951-2025-07-23",
      "headline": "Anupam Kher's Tanvi the Great declared tax-free in Madhya Pradesh'Tanvi the Great' has been declared tax-free by Madhya Pradesh chief minister Mohan Yadav in the state.  The film addresses the struggles and dreams of an autistic girl.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-wife-uditaa-goswami-emotional-note-calls-him-star-maker-saiyaara-success-aneet-padda-ahaan-panday-2759961-2025-07-23",
      "headline": "Mohit Suri's wife Uditaa Goswami shares emotional note, calls him star-makerMohit Suri's film 'Saiyaara' is a big hit and currently a fan favourite. Amid the movie's success, the director's wife, Uditaa Goswami, shared an emotional post, calling him a 'star-maker' and praising his hard work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bobby-to-saiyaara-youthful-musical-love-stories-in-bollywood-ahaan-pandey-aneet-padda-mohit-suri-2759472-2025-07-23",
      "headline": "Bobby to Saiyaara: Bollywood's timeless legacy of youthful musical love storiesAs director Mohit Suri's romantic drama 'Saiyaara' achieves a box office milestone, here's a glimpse into the youthful romantic musicals in Bollywood over the decades. What contributes to the cinematic spectacle when it comes to new-age love stories in Hindi cinema? IndiaToday.in shares insights on the Indian film industry's knack at romance sagas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-confirms-all-of-us-are-dead-season-2-with-fresh-zombie-threat-2759919-2025-07-23",
      "headline": "Netflix confirms All of Us Are Dead season 2 with fresh zombie threat. Watch'All of Us Are Dead' is set to return on Netflix with a new season. The second season will follow the aftermath of the zombie outbreak. A mix of returning and new actors will join the cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-incredible-weight-loss-looks-unrecognisable-in-new-pics-loses-26-kgs-without-exercise-2759937-2025-07-23",
      "headline": "Boney Kapoor looks unrecognisable in new pics, loses 26 kgs without exercise: ReportBoney Kapoor has shed 26 kilos without setting foot in a gym, relying solely on a disciplined diet inspired by a heartfelt memory of his late wife, Sridevi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-salman-khan-aamir-khan-give-saiyaara-premiere-a-miss-ahaan-panday-aneet-padda-mohit-suri-2759938-2025-07-23",
      "headline": "Exclusive: Here's why Khan families gave Saiyaara trial a missSaiyaara has become the biggest hit of the year, earning over Rs 100 crore in just four days. The film's success comes despite a deliberately low-key release and why the trial didn't see many big names coming including the Khans. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/hospital-sent-wrong-bodies-of-air-india-crash-victims-to-families-in-uk-ahmedabad-dreamliner-boeing-787-britain-2760033-2025-07-23",
      "headline": "Wrong bodies of Air India crash victims reached families in UKA lawyer representing the relatives of the victims of the Air India crash of June 12 has claimed that wrong remains were sent to two families in the UK. Sources said the remains were sent by a government hospital in Ahmedabad in sealed coffins, and Air India had no role in the mix-up. India said victims were identified in accordance with established protocols. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-to-vacate-vice-presidents-residence-soon-starts-packing-2760150-2025-07-23",
      "headline": "Jagdeep Dhankhar to vacate residence, started packing the night he quit: SourcesAccording to sources, the former Vice President began packing on the night of his resignation itself, although his resignation was officially accepted only yesterday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/gelatin-sticks-found-hidden-in-plastic-cover-at-bus-stand-in-bengaluru-police-on-spot-2760143-2025-07-23",
      "headline": "Explosives found hidden at Bengaluru bus stand, police on spotSix gelatin sticks were found concealed in a plastic cover at Bengaluru's Kalasipalya bus stand, triggering a police and anti-terrorism squad inspection. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-live-updates-manchester-weather-gill-stokes-score-2759922-2025-07-23",
      "headline": "4th Test Day 1 Live: Gorgeous KL Rahul helps visitors get to a solid startIndia (IND) vs England (ENG), 4th Test, Day 1 Live Score Updates: KL Rahul and Yashasvi Jaiswal are looking solid. They have survived a tricky spell of bowling in the first hour and are looking to hit back at the English."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-cost-of-convenience-what-we-lost-to-10-minute-deliveries-2759963-2025-07-23",
      "headline": "The cost of convenience: What we lost to 10-minute deliveriesSure, instant delivery apps bring the world to your doorstep. But convenience comes at a cost - and it's not what you pay, it's what you miss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-relations-reset-trump-ric-jaishankar-xi-jinping-galwan-trade-deficit-geopolitical-pragmatism-2759184-2025-07-23",
      "headline": "In India, China inching closer, a Trump role he won't brag aboutThe deep chill in India-China ties seems to be over with Beijing welcoming Moscow's proposal for a tri-nation bloc. Though India and China are natural competitors, it is a realisation brought about by US President Trump's brazenness, Washington's slant during the Indo-Pak mini-war, and a mutual need that is making the two shake hands, albeit with Op Sindoor awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-are-boston-brahmins-astronomer-hr-chief-kristin-cabot-viral-kiss-cam-coldplay-concert-2760083-2025-07-23",
      "headline": "Scandal-hit Astronomer HR chief has ties to Boston Brahmins. Who are they?Kristin, whose cosy moment with Astronomer CEO went viral during a Coldplay concert, is married to Andrew Cabot. The Cabots are one of the original Boston Brahmin families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-power-sharing-demand-gets-shriller-is-tamil-nadu-set-for-a-new-phase-of-coalitions-2759589-2025-07-22",
      "headline": "Is Tamil Nadu set for a new phase of coalitions?The phrase defining this aspiration—'a share in governance... a share in authority'—was first articulated last year by the DMK's partner Viduthalai Chiruthaigal Katchi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rain-aap-takes-water-sport-jibe-at-bjp-after-brief-rain-turns-roads-of-capital-city-into-pools-2760095-2025-07-23",
      "headline": "Video: Man swims in waterlogged Delhi road, AAP takes 'water sport' jibe at BJPA brief but intense downpour on Thursday morning left Delhi's key roads flooded and traffic crippled, as AAP leaders mocked the BJP government's monsoon preparedness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-targets-akhilesh-yadav-over-mosque-meeting-questions-wife-dimples-outfit-2760021-2025-07-23",
      "headline": "BJP targets Akhilesh Yadav over mosque meeting, questions wife Dimple's outfitBJP leader Jamal Siddiqui attacked the Samajwadi Party after several party leaders, including party chief AKhilesh Yadav and his wife Dimple Yadav, visited a mosque near the Parliament. Siddiqui accused the party of holding a political meeting inside a religious space and criticised Dimple Yadav for her attire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/op-sindoor-parliament-discussion-from-july-29-government-undertakes-special-prep-2760029-2025-07-23",
      "headline": "Op Sindoor Parliament discussion from July 28, government undertakes special prepThe move comes after days of uproar from the Opposition, demanding answers from the Prime Minister over US President Donald Trump's sensational claim that he \"brokered a ceasefire\" between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-viral-scene-breaking-internet-and-hearts-starring-ahaan-panday-aneet-padda-heartbreaking-stadium-scene-breakdown-2760039-2025-07-23",
      "headline": "This one wild scene in Saiyaara is breaking the internet - and heartsIn 'Saiyaara', full of music, love and longing, there's one scene that has been creating noise online. For many, it's the most unforgettable scene of the film, and the one that captures the ache of waiting. Read on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-claimed-truce-credit-25-times-but-pm-modi-is-still-silent-rahul-gandhi-2760086-2025-07-23",
      "headline": "Trump claimed truce credit 25 times, but PM Modi is still silent: Rahul GandhiRahul Gandhi also slammed the large-scale voter roll revision in Bihar that rocked the first three days of the Monsoon Session, and alleged a broader pattern of electoral fraud by the BJP in multiple states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-fake-embassy-up-police-harsh-vardhan-jain-londonia-envoy-number-plate-2760002-2025-07-23",
      "headline": "'Londonia envoy' caught in Ghaziabad; luxury cars, morphed photos with PM foundThe accused, Harsh Vardhan Jain, allegedly converted a Ghaziabad bungalow into a fake embassy for self-styled micronations, using morphed photos and fake diplomatic paraphernalia to dupe people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-woman-kills-husband-for-not-sexually-satisfying-her-fakes-suicide-story-2760078-2025-07-23",
      "headline": "Delhi woman kills husband for not sexually satisfying her, fakes suicide storyPolice said that the woman stabbed her husband three times in the chest, and took him to hospital claiming he had killed himself. However, her phone's search history on 'ways to kill' exposed her gruesome murder plan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-says-trusting-anurag-basu-in-metro-in-dino-came-naturally-2759956-2025-07-23",
      "headline": "Exclusive: Sara Ali Khan says trusting Anurag Basu in Metro In Dino came naturallySara Ali Khan shared her experience of playing Chumki in Anurag Basu's 'Metro... In Dino'. In an interview with India Today, she reflected on modern relationships and the freedom of working with a visionary director."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/india-student-assaulted-in-australia-adelaide-racially-abused-parking-dispute-2759936-2025-07-23",
      "headline": "F*** off, Indian: Student kicked, punched after parking spot tiff in AustraliaCharanpreet Singh, a 23-year-old Indian student, suffered brain trauma and facial fractures after being attacked by five men shouting racial slurs in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/gujarat/story/surat-friend-conspires-murder-wife-insurance-money-2759895-2025-07-23",
      "headline": "Couple kills business partner for insurance claim. Plot inspired by daily soapThe victim's friend had taken out a loan for the two trucks he owned. Furthermore, his business was not going well. He, thus, hatched a plan to kill him to get the insurance money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-resignation-opposition-congress-speculation-vice-president-2759925-2025-07-23",
      "headline": "'Dal mein kuch kaala': Opposition speculation on Veep's exit refuses to dieCongress chief Mallikarjun Kharge suggested that some mischief was at play behind Jagdeep Dhankhar's sudden resignation and questioned the conspicuous silence of the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/fluoride-benefits-cavity-prevention-herbal-toothpaste-oral-care-balance-2759692-2025-07-23",
      "headline": "Fluoride vs fluoride-free toothpaste: What's actually better for your teeth?As fluoride-free toothpaste gains popularity, the divide between natural health trends and dental science grows wider. While fluoride remains a dentist-recommended cavity fighter, growing consumer interest in natural alternatives is raising questions about what truly keeps teeth healthy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanushree-dutta-harassment-police-complaint-me-too-activism-2759843-2025-07-23",
      "headline": "Tanushree Dutta breaks down in video, claims harassment at home since MeToo rowIn a video, actor Tanushree Dutta claimed she has been facing harassment at her home since 2018, following the #MeToo movement. She broke down and said that she would be lodging a police complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mig-21-bison-indian-air-force-crown-jewel-six-decades-became-flying-coffins-explained-2759739-2025-07-23",
      "headline": "Six decades of MiG-21: How IAF's crown jewel became flying coffinInducted in 1963 by the IAF, the MiG-21s were once the crown jewels, playing a crucial role in nearly every war India had fought since the mid-1960s. But over time, this celebrated warhorse has come to be known as a \"flying coffin\", a nickname earned after a series of crashes that claimed the lives of over 170 IAF pilots. How did this warplane become a symbol of tragedy?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-to-set-up-special-bench-to-hear-justice-varma-plea-in-cash-row-as-chief-justice-recuses-himself-2759940-2025-07-23",
      "headline": "Cash row: Supreme Court to hear Justice Varma's plea, Chief Justice opts outsJustice Yashwant Varma was divested of judicial work and sent back to the Allahabad High Court from the Delhi High Court in April after a fire broke out at his official residence in Delhi. During firefighting operations, bundles of cash were found in March, prompting an inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shaad-randhawa-mohit-suri-constant-star-in-saiyaara-aneet-padda-ahaan-panday-2760065-2025-07-23",
      "headline": "Who is Shaad Randhawa, the Saiyaara actor seen in every Mohit Suri film?Actor Shaad Randhawa has been a staple in films directed by Mohit Suri. He was also seen in his latest directorial 'Saiyaara' featuring Ahaan Panday and Aneet Padda. Randhawa's career includes notable roles in successful films such as 'Aashiqui 2' and 'Ek Villain'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-raising-a-girl-we-live-in-india-i-have-to-buy-a-gun-2760117-2025-07-23",
      "headline": "Richa Chadha on raising a girl: We live in India, I have to buy a gunActor Richa Chadha recently spoke about her fear of raising a girl. The actor, in an interview, reflected her concern for her child's safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-sharvari-wagh-feature-war-2-post-credit-scene-alpha-agents-2760054-2025-07-23",
      "headline": "Not SRK, but Alia Bhatt and Sharvari Wagh to feature in War 2 post-credit sceneAlia Bhatt and Sharvari Wagh will appear in the War 2 post-credit scene, setting up YRF's next spy film 'Alpha'. This strategic move builds anticipation for the female-led spy film releasing in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-viral-scene-breaking-internet-and-hearts-starring-ahaan-panday-aneet-padda-heartbreaking-stadium-scene-breakdown-2760039-2025-07-23",
      "headline": "This one wild scene in Saiyaara is breaking the internet - and heartsIn 'Saiyaara', full of music, love and longing, there's one scene that has been creating noise online. For many, it's the most unforgettable scene of the film, and the one that captures the ache of waiting. Read on. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/anti-doping-bill-amendment-lok-sabha-sports-minister-2760135-2025-07-23",
      "headline": "Anti‑doping amendment introduced in Lok Sabha by Sports MinisterThe Indian Sports Minister, Mansukh Mandaviya, has tabled the National Anti-Doping Bill at the Lok Sabha to give more operational independence to the National Anti-Doping Agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-ireland-t20i-series-eyman-fatima-squad-2760130-2025-07-23",
      "headline": "Pakistan Women call-up 20-year-old batter for Ireland T20I series20-year-old batter Eyman Fatima has been called up for Pakistan Women's upcoming three-match T20I series against Ireland to be held from August 6 to 10. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mansukh-mandaviya-introduces-national-sports-bill-greater-transparency-nsfs-bcci-2760100-2025-07-23",
      "headline": "Sports minister introduces National Sports Bill for greater transparency in NSFsSports Minister Mansukh Mandaviya introduced the National Sports Governance Bill in Lok Sabha to reform sports federations. The bill aims to enhance accountability, regulate disputes, and bring BCCI under government oversight, signalling a major shift in Indian sports administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-manchester-test-anshul-kamboj-debut-sai-sudharsan-return-toss-2760090-2025-07-23",
      "headline": "ENG vs IND: Anshul Kamboj to debut, Sai Sudharsan returns in ManchesterENG vs IND: Anshul Kamboj is set to make his international debut in the Manchester Test. England won the toss and decided to bowl first. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-umberto-ferrera-returns-doping-us-open-2025-2760058-2025-07-23",
      "headline": "Jannik Sinner rehires Umberto Ferrera post-doping row to begin US Open preparationsJannik Sinner has rehired his former trainer, Umberto Ferrera, who was dismissed from his role due to the doping scandal last year. Now he returns to aid the Italian in his preparations for the US Open. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-wins-china-open-round-of-16-satwiksairaj-chirag-doubles-win-2759998-2025-07-23",
      "headline": "PV Sindhu downs sixth seed Miyazaki; Satwik-Chirag advance tooDouble Olympic medallist PV Sindhu defeated sixth seed Tomoka Miyazaki to reach the round of 16, while the world No. 15 men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty made a strong start at the China Open Super 1000 tournament on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-washington-open-second-oldest-wta-peyton-stearns-2759980-2025-07-23",
      "headline": "Venus Williams, 45, becomes second oldest to win WTA Tour level matchWashington Open: 45-year-old Venus Williams became the second-oldest player after Martina Navratilova to win a WTA tour level match after beating Peyton Stearns 6-3, 6-4 on Tuesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-three-sixes-final-t20i-west-indies-retirement-farewell-2759972-2025-07-23",
      "headline": "Watch: Andre Russell wows Sabina Park with three sixes in farewell flourishAndre Russell, in his final international appearance, thrilled the Sabina Park crowd with three towering sixes in a single over, reminding the world of his explosive talent. Though the West Indies lost, Russell's farewell was a powerful tribute to his legendary T20 career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-navjot-singh-sidhu-india-predicted-xi-manchester-test-2759955-2025-07-23",
      "headline": "Sai Sudharsan back for 4th Test: Navjot Singh Sidhu predicts India's playing XIEngland vs India: Former cricketer Navjot Singh Sidhu has shared his predicted playing XI for the Manchester Test, backing Sai Sudharsan's return and questioning Karun Nair's place in the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-sanjay-manjrekar-england-vs-india-manchester-2759945-2025-07-23",
      "headline": "Nitish Reddy's absence won't create much imbalance: Sanjay ManjrekarENG vs IND: Sanjay Manjrekar said that India may opt for a specialist batter to replace Nitish Kumar Reddy for the fourth Test in Manchester given their batting collapses in the series thus far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-wins-china-open-round-of-16-satwiksairaj-chirag-doubles-win-2759998-2025-07-23",
      "headline": "PV Sindhu downs sixth seed Miyazaki; Satwik-Chirag advance tooDouble Olympic medallist PV Sindhu defeated sixth seed Tomoka Miyazaki to reach the round of 16, while the world No. 15 men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty made a strong start at the China Open Super 1000 tournament on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-washington-open-second-oldest-wta-peyton-stearns-2759980-2025-07-23",
      "headline": "Venus Williams, 45, becomes second oldest to win WTA Tour level matchWashington Open: 45-year-old Venus Williams became the second-oldest player after Martina Navratilova to win a WTA tour level match after beating Peyton Stearns 6-3, 6-4 on Tuesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-three-sixes-final-t20i-west-indies-retirement-farewell-2759972-2025-07-23",
      "headline": "Watch: Andre Russell wows Sabina Park with three sixes in farewell flourishAndre Russell, in his final international appearance, thrilled the Sabina Park crowd with three towering sixes in a single over, reminding the world of his explosive talent. Though the West Indies lost, Russell's farewell was a powerful tribute to his legendary T20 career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-navjot-singh-sidhu-india-predicted-xi-manchester-test-2759955-2025-07-23",
      "headline": "Sai Sudharsan back for 4th Test: Navjot Singh Sidhu predicts India's playing XIEngland vs India: Former cricketer Navjot Singh Sidhu has shared his predicted playing XI for the Manchester Test, backing Sai Sudharsan's return and questioning Karun Nair's place in the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-sanjay-manjrekar-england-vs-india-manchester-2759945-2025-07-23",
      "headline": "Nitish Reddy's absence won't create much imbalance: Sanjay ManjrekarENG vs IND: Sanjay Manjrekar said that India may opt for a specialist batter to replace Nitish Kumar Reddy for the fourth Test in Manchester given their batting collapses in the series thus far. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}