{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-a-fake-income-tax-call-key-warning-signs-and-tips-to-protect-yourself-2772963-2025-08-18",
      "headline": "Received a fake income tax call? Key warning signs and tips to protect yourselfScammers are increasingly posing as income tax officials to trick people into sharing personal and financial information. If you receive a suspicious call during the filing season, it's important to stay calm and know the warning signs before taking any action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-job-unemployment-rate-drops-52-percent-july-festive-season-gst-cut-agriculture-economy-gdp-2772962-2025-08-18",
      "headline": "India's job market shows relief as unemployment rate falls to 5.2% in JulyThe jobless rate in rural areas for people aged 15 years and above fell to 4.4% in July from 4.9% in June. Seasonal demand for workers in agriculture and related activities supported this improvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-quicker-pf-access-here-are-the-updated-epfo-rules-2772871-2025-08-18",
      "headline": "Want quicker PF access? Here are the updated EPFO rulesUnder the updated rules, if your name, gender and date of birth match in both Aadhaar and UAN records, you no longer need EPFO approval to link the two."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-676-points-higher-nifty-above-24800-maruti-gains-9-percent-2772869-2025-08-18",
      "headline": "Sensex ends 676 points higher, Nifty above 24,800; Maruti gains 9%The S&P BSE Sensex gained 676.09 points to end at 81,273.75, while the NSE Nifty50 added 245.65 points to close at 24,876.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-tax-cut-festive-season-diwali-save-money-common-man-shopkeepers-cheaper-items-food-appliance-prices-2772865-2025-08-18",
      "headline": "GST bonanza before festive rush? Here's what it could mean for youThe biggest change for middle-class families could be in aspirational goods such as televisions, refrigerators, and washing machines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crorepati-on-paper-cash-poor-in-reality-ca-explains-why-liquidity-matters-more-than-net-worth-2772767-2025-08-18",
      "headline": "Crorepati on paper, cash-poor in reality? CA explains why liquidity matters moreA high net worth can be misleading if most of your wealth is tied up in property or long-term investments. An expert believes that true financial security comes from having liquid assets that can be accessed at short notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-tax-slabs-low-reforms-rationalisation-insurance-everyday-item-cars-appliance-tv-money-2772777-2025-08-18",
      "headline": "GST cut before Diwali? These items likely to cost you less this festive seasonPrime Minister Narendra Modi gave the first indication of GST reforms in his Independence Day address from the Red Fort, calling it a \"Diwali Bonanza.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/sunjay-kapurs-sister-raises-concern-over-treatment-of-family-claims-being-sidelined-2772711-2025-08-18",
      "headline": "Exclusive: Sunjay Kapur's sister raises concern over treatment of familyMandhira Kapur Smith, sister of late Sona Comstar Chairperson Sunjay Kapur, has raised concerns over her family's treatment by the automotive firm founded by their late father. She said her 80-year-old mother Rani Kapur has been sidelined, claiming the family has been treated \"like strangers\" and excluded from obituaries and public acknowledgments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-6-excel-utility-now-live-who-is-eligible-to-file-2772650-2025-08-18",
      "headline": "ITR-6 excel utility now live: Who is eligible to file?The Income Tax Department has rolled out the excel utility for ITR-6 for AY 2025-26. But this form isn't meant for everyone — here's who is required to use it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/regaal-resources-ipo-allotment-out-today-status-online-guide-gmp-listing-gains-stock-market-debut-date-2772642-2025-08-18",
      "headline": "Regaal Resources IPO allotment today: Check status, GMP & listing dateInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (previously known as Link Intime India Pvt Ltd)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/parineeta-premiere-2773097-2025-08-18",
      "headline": "Parineeta premiere: Vidya Balan, Rekha, Dia Mirza dazzle at re-release eventThe red-carpet event of producer-director Vidhu Vinod Chopra's 'Parineeta' witnessed the reunion of the film's team. Actors Vidya Balan, Rekha and Dia Mirza were among the attendees who were present at the screening.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/darshan-wife-vijayalakshmi-manages-social-media-amid-legal-troubles-2773065-2025-08-18",
      "headline": "Actor Darshan's wife takes over his social media, says he will be back soonKannada actor Darshan, whose bail was recently revoked by the Supreme Court, was arrested on August 14. Darshan's wife Vijayalakshmi, who is now handling his social media accounts, shared a message for the actor's fans after his arrest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ian-mckellen-gandalf-frodo-return-the-hunt-for-gollum-lord-of-the-rings-andy-serkis-2772979-2025-08-18",
      "headline": "Sir Ian McKellen hints at Gandalf, Frodo Baggins return in The Hunt for GollumVeteran actor Sir Ian Mckellen recently opened up about the upcoming 'The Lord of the Rings' movie 'The Hunt for Gollum'. He also hinted at the return of important characters in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sahher-bambba-bads-of-bollywood-aryan-khan-directorial-debut-netflix-2773047-2025-08-18",
      "headline": "Who is Sahher Bambba? Know all about the Bads of Bollywood actorActor Sahher Bambba is set to play a key role in Aryan Khan's directorial debut series 'The Bads of Bollywood'. Ahead of its Netflix premiere, here's everything you need to know about the actor, her debut movie, previous projects and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elvish-yadav-shares-update-firing-at-gurugram-home-family-is-safe-2773045-2025-08-18",
      "headline": "My family and I are safe: Elvish Yadav shares update after firing at Gurugram homeYouTuber and 'Bigg Boss OTT 2' winner Elvish Yadav shared an update after firing outside his Gurugram home. He assured that his family is safe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-b-shetty-su-from-so-grosses-rs-100-crore-global-box-office-2772990-2025-08-18",
      "headline": "Su From So box office: Raj B Shetty's film grosses Rs 100 crore worldwideRaj B Shetty's 'Su From So' achieves blockbuster status, marking a significant success for the Kannada film industry amid challenging times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-walks-down-memory-lane-opens-the-8-scene-kaminey-chapter-2773042-2025-08-18",
      "headline": "Priyanka Chopra walks down memory lane, opens the 8-scene Kaminey chapter Priyanka Chopra revisits 'Kaminey' as the film completes 16 years of. She shares a heartfelt post, recalling director Vishal Bhardwaj's faith in her, her chemistry with Shahid Kapoor, with a promise of an exciting comeback to Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bareilly-ki-barfi-completes-8-years-ayushmann-khurrana-shares-a-special-teaser-2773026-2025-08-18",
      "headline": "Bareilly Ki Barfi completes 8 years, Ayushmann Khurrana shares a special teaserAyushmann Khurrana, Kriti Sanon and Rajkummar Rao's 'Bareilly Ki Barfi' completed eight years. To mark the milestone, Ayushmann shared a special teaser on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ed-helms-recalls-filming-the-office-hangover-simultaneously-2772993-2025-08-18",
      "headline": "Actor Ed Helms recalls filming for Hangover film and The Office simultaneouslyActor Ed Helms opened up about filming for the sitcom 'The Office' and 'The Hangover' film in a recent podcast. He called it one of the most hectic yet most rewarding times of his life. The actor further recalled having six energy drinks to get through the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-rumoured-girlfriend-larissa-bonesi-on-bads-of-bollywood-2773033-2025-08-18",
      "headline": "Proud is an understatement: Aryan Khan's rumoured girlfriend on Bads of BollywoodAryan Khan's rumoured girlfriend, Larissa Bonesi, gave a shout-out to Shah Rukh Khan's son for his debut web series, 'The Bads of Bollywood'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-bads-of-bollywood-aryan-khan-directorial-debut-bobby-deol-shah-rukh-salman-cameo-2773002-2025-08-18",
      "headline": "All about Aryan Khan's The Bads of Bollywood: Release date, cast, story, surprisesActor Shah Rukh Khan's son Aryan Khan launched the first look of his directorial debut 'The Bads of Bollywood'. The Netflix series reveals Bollywood's glamorous facade and its hidden controversies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/dabboo-malik-on-son-amaal-mallik-depression-and-family-conflict-2772965-2025-08-18",
      "headline": "I failed as a father: Dabboo Malik on son Amaal's depression and family conflictMusic composer Dabboo Malik admitted his mistakes as a father after son Amaal Mallik shared earlier this year that he had cut ties with his family and was battling depression. Dabboo confessed that in focusing on Armaan's career, the family unintentionally neglected Amaal, but is now working to rebuild their bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sufi-motiwala-ends-friendship-apoorva-mukhija-rebel-kid-the-traitors-2772745-2025-08-18",
      "headline": "Influencer Sufi Motiwala slams Apoorva Mukhija: I didn't use her for cloutInfluencer Sufi Motiwala announced the end of his friendship with 'The Traitors' contestant Apoorva Mukhija on Sunday. He also addressed accusations of using Mukhija for clout on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shekhar-kapur-recalls-working-with-sridevi-in-mr-india-praises-her-loyalty-2772810-2025-08-18",
      "headline": "Shekhar Kapur recalls working with Sridevi in Mr India, praises her loyaltyShekhar Kapur recalled shooting his first scene with Sridevi in 'Mr India', saying her dance left the entire crew mesmerised. He also praised her fierce loyalty, protective nature, and vulnerability, calling them the qualities that made her a true star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/malayali-creators-allege-instagram-video-takedowns-param-sundari-trailer-controversy-2772975-2025-08-18",
      "headline": "Param Sundari upsets Malayali influencers after makers allegedly remove Insta videosMalayali creators allege Instagram removed their videos criticising 'Param Sundari' trailer. The Sidharth Malhotra-Janhvi Kapoor-starrer is being criticised for cultural misrepresentation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-brother-faissal-khan-cuts-ties-with-family-new-chapter-of-dignity-2772923-2025-08-18",
      "headline": "Aamir Khan's brother Faissal cuts ties with family for new chapter of dignityActor Faissal Khan has officially cut ties with his family. He shared an Instagram post, admitting he has severed all ties with actor-brother Aamir Khan and the family members.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayan-mukerji-belongs-to-language-of-love-yeh-jawaani-hai-deewani-brahmastra-war-2-action-2772880-2025-08-18",
      "headline": "Why Ayan Mukerji belongs to language of love, not noise of WarAyan Mukerji, who once charmed audiences with the warmth and emotions of 'Yeh Jawaani Hai Deewani', takes a sharp turn into high-octane action with 'War 2'. However, the shift feels mismatched, revealing his true strength lies in emotional storytelling, not spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sholay-turns-50-dharmendra-emotional-tribute-to-cinematographer-dwarka-divecha-2772939-2025-08-18",
      "headline": "Sholay turns 50: Dharmendra's emotional tribute to cinematographer Dwarka DivechaAmitabh Bachchan and Dharmendra's 'Sholay' turned 50 on August 15. To celebrate the special occasion, Dharmendra paid homage to the late cinematographer Dwarka Divecha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-dances-ranganna-aavesham-odimaga-okck-promotions-2772957-2025-08-18",
      "headline": "Fahadh Faasil recreates viral Aavesham dance at OKCK promotionsMalayalam actor Fahadh Faasil, who is currently busy promoting his upcoming film 'Odum Kuthira Chaadum Kuthira', thrilled fans by performing his viral 'Aavesham' dance moves at a college event in Kerala."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-zelenskyy-meet-at-white-house-to-discuss-peace-deal-with-russia-to-end-35-year-long-war-2773128-2025-08-18",
      "headline": "Putin wants Ukraine war to end, says Trump with Zelenskyy beside him at White HouseNearly six months after their infamous clash at the Oval Office, US President Donald Trump warmly welcomed his Ukrainian counterpart Voldodymyr Zelenskyy at the White House. He said Kyiv will get security guarantees in a bid to end the Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-volodymyr-zelenskyy-meet-live-updates-us-russia-ukraine-war-european-leaders-washington-2772984-2025-08-18",
      "headline": "Live: Trump, Zelenskyy open to trilateral talks with Putin as Europeans press ceasefireTrump, Zelenskyy meeting in Washington Live: Ukrainian President Volodymyr Zelenskyy met with US President Donald Trump at the White House on Monday for one-on-one talks focused on ending the ongoing war in Ukraine. The high-stakes meeting followed Trump's recent summit with Russian President Vladimir Putin in Alaska, as Washington intensifies efforts to broker a peace deal. To support Zelenskyy, several European leaders, including German Chancellor Friedrich Merz, French President Emmanuel Macron, UK Prime Minister Keir Starmer, Italian Prime Minister Giorgia Meloni, Finnish President Alexander Stubb, European Commission President Ursula von der Leyen, and NATO Secretary-General Mark Rutte, also arrived at the White House. Follow indiatoday.in for all Live Updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/open-to-election-after-peace-in-ukraine-says-zelenskyy-during-trump-meet-to-discuss-deal-to-end-russia-war-2773134-2025-08-18",
      "headline": "Open to election after peace: Zelenskyy during ceasefire talks with TrumpZelenskyy said he is open to elections once peace is restored in Ukraine during his Oval Office meeting with Trump. European leaders will also meet them, stressing unity against Russian aggression.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-thanks-putin-for-sharing-insights-on-alaska-meet-with-trump-after-tariffs-on-india-over-russian-oil-2772941-2025-08-18",
      "headline": "Putin briefs PM Modi on Trump meet after tariffs on India over Russian oilPrime Minister Narendra Modi, in a tweet on Monday, thanked Russian President Vladimir Putin for calling him up and sharing insights on his meeting with US President Donald Trump. Both the leaders met in Alaska on August 15.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-zelenskyy-putin-red-carpet-jets-meeting-russia-ukraine-war-2773171-2025-08-19",
      "headline": "No red carpet, no B2 bombers: Trump courts Putin, cools on ZelenskyyTrump rolled out military theatrics and personal warmth for Vladimir Putin during their Alaska meeting, complete with B-2 bombers and a shared limousine ride. In stark contrast, Ukrainian President Volodymyr Zelenskyy received a rather sombre welcome, with no fanfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-shubhanshu-shukla-first-indian-astronaut-to-visit-space-station-in-delhi-2773037-2025-08-18",
      "headline": "Shubhanshu Shukla meets PM Modi, gifts tricolour he carried into spaceShubhanshu Shukla conveyed the exhilaration and challenges of his groundbreaking journey, which saw an Indian astronaut actively participate in long-duration space operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-zelenskyy-trump-meets-delegation-of-european-leaders-in-white-house-to-discuss-ukraine-peace-deal-2773168-2025-08-19",
      "headline": "Trump meets European leaders in White House to discuss Ukraine peace dealAt the White House, Trump told European leaders he wants to \"put the Ukraine war to sleep,\" urging peace talks while Zelenskyy insisted on security guarantees and rejected territorial concessions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-bjp-chose-a-soccer-solution-to-its-bangla-conundrum-2772992-2025-08-18",
      "headline": "Why the BJP chose a soccer solution to its Bangla conundrumPitching itself as a defender of the Bengali identity, the saffron party plans to tap the local fascination with football and Vivekananda for a counterstrike on the party that rules Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-controversy-explained-vivek-agnihotri-kolkata-1946-riots-2772718-2025-08-18",
      "headline": "The Bengal Files row explained: Why Vivek Agnihotri's film is facing backlashVivek Agnihotri's film 'The Bengal Files' has stirred controversy over its portrayal of 1946 riots. The movie faces backlash over historical accuracy and portrayal of key figures, with legal notices and public debates intensifying ahead of its September release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/same-suit-zelenskyy-fires-witty-comeback-at-journalist-who-mocked-his-outfit-2773154-2025-08-18",
      "headline": "Same suit! Zelenskyy fires witty comeback at journalist who mocked his outfit At the White House, Trump praised Zelenskyy's black suit, but the Ukrainian leader quipped at a reporter: \"I changed, you have not,\" recalling earlier outfit criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-action-cec-ecs-vote-chori-claims-india-bloc-forms-government-bihar-2773165-2025-08-19",
      "headline": "Rahul Gandhi vows action against poll body chief if INDIA bloc forms governmentCongress MP Rahul Gandhi said that he will initiate action against the Chief Election Commissioner and the two Election Commissioners over 'vote chori' (vote theft) if the INDIA bloc forms the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-says-it-accepts-60-day-gaza-ceasefire-in-proposed-hostage-release-deal-reports-news-agency-reuters-2773080-2025-08-18",
      "headline": "Hamas accepts 60-day Gaza ceasefire in proposed hostage release deal: ReportHamas said it accepted a 60-day ceasefire in Gaza as part of a proposed hostage release deal as truce talks appeared to make headway to end the nearly two-year-old war in the war-ravaged Palestinian enclave."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayan-mukerji-belongs-to-language-of-love-yeh-jawaani-hai-deewani-brahmastra-war-2-action-2772880-2025-08-18",
      "headline": "Why Ayan Mukerji belongs to language of love, not noise of WarAyan Mukerji, who once charmed audiences with the warmth and emotions of 'Yeh Jawaani Hai Deewani', takes a sharp turn into high-octane action with 'War 2'. However, the shift feels mismatched, revealing his true strength lies in emotional storytelling, not spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-suit-zelenskyy-picks-black-jacket-for-meeting-with-trump-at-white-house-2773122-2025-08-18",
      "headline": "No suit, Zelenskyy picks black jacket for meeting with Trump at White HouseUkrainian President Volodymyr Zelenskyy has arrived at the White House for a meeting with US President Donald Trump to talk peace over the ongoing Russia-Ukraine war. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/peace-on-border-de-escalation-key-for-positive-momentum-in-india-china-ties-jaishankar-to-chinese-minister-2773019-2025-08-18",
      "headline": "Peace on border crucial for India-China ties: Jaishankar to Chinese counterpartExternal Affairs Minister S Jaishankar told his Chinese counterpart Wang Yi that both countries had gone through a difficult period and needed to move forward with a clear and cooperative approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-candidate-nda-bjp-cp-radhakrishnan-governor-maharashtra-different-from-other-governors-how-explained-three-points-2772819-2025-08-18",
      "headline": "How CP Radhakrishnan, Vice-President nominee, is quietly different | 3 pointsThe NDA's Vice-President nominee, CP Radhakrishnan, stands out as a governor and politician for several reasons. While governors of some states have been in the news for being confrontationist, Radhakrishnan has been quietly performing his duties. Here are three points that set CPR apart from the others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/are-weightloss-drugs-for-me-5-things-to-consider-anti-obesity-india-2772571-2025-08-18",
      "headline": "Weight loss drugs are booming, but should you really be taking them?Anti-obesity drugs like GLP-1 are quite popular now. But, do you really need it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-delhis-stray-dogs-belong-to-its-lanes-2772926-2025-08-18",
      "headline": "Why Delhi's stray dogs belong to its lanesMass relocation of strays risks overcrowding, disease and eroded emotional bonds. The way forward is humane solutions grounded in sterilisation and community care"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-for-you-zelensky-gives-trump-letter-for-melania-from-ukrainian-first-lady-2773161-2025-08-19",
      "headline": "Not for you: Zelensky gives Trump letter for Melania from Ukrainian First LadyUkrainian President Volodymyr Zelensky handed the letter, addressed to Melania Trump, from First Lady Olena Zelenska, to US President Donald Trump during "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/exports-jobs-at-stake-how-rajasthan-is-bracing-for-trump-tariffs-2771341-2025-08-15",
      "headline": "Exports, jobs at stake, how Rajasthan is bracing for Trump tariffsDonald Trump's tariff shocker has imperiled labour-intensive sectors like garments and gems-jewellery that contribute majorly to Rajasthan's exports to the US"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-cincinnati-open-title-jannik-sinner-retires-2773172-2025-08-19",
      "headline": "Carlos Alcaraz wins maiden title after hapless Jannik Sinner retiresCarlos Alcaraz won his first Cincinnati Open title after Jannik Sinner retired midway through the final with illness. Sinner's withdrawal raises doubts about his readiness for the US Open, while Alcaraz prepares to compete in mixed doubles with Emma Raducanu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-justice-br-gavai-questions-the-payment-of-toll-by-commuters-if-delhi-gets-paralysed-in-two-hours-of-rain-2773013-2025-08-18",
      "headline": "Delhi paralysed in 2 hours of rain, why should commuters pay toll? Chief JusticeCJI Gavai made the comment while hearing a petition from the NHAI over the collection of tolls on National Highway 544 in the Thrissur district of Kerala. The Kerala High Court has suspended toll collection on the highway due to its poor condition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manisha-murder-case-haryana-bhiwani-singhani-19-playschool-teacher-protests-nayab-singh-saini-selja-2772746-2025-08-18",
      "headline": "All about Manisha case: Protests in Haryana as teacher, 19, found with slit throatThe murder of 19-year-old teacher Manisha in Bhiwani's Singhani village has triggered massive protests, with villagers blocking roads and holding mahapanchayats. Her family, alleging police inaction, have refused to hold a funeral. The NHRC has sought a report, and opposition parties are attacking the Haryana government. Here's all about the Manisha case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/parineeta-premiere-2773097-2025-08-18",
      "headline": "Parineeta premiere: Vidya Balan, Rekha, Dia Mirza dazzle at re-release eventThe red-carpet event of producer-director Vidhu Vinod Chopra's 'Parineeta' witnessed the reunion of the film's team. Actors Vidya Balan, Rekha and Dia Mirza were among the attendees who were present at the screening.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/darshan-wife-vijayalakshmi-manages-social-media-amid-legal-troubles-2773065-2025-08-18",
      "headline": "Actor Darshan's wife takes over his social media, says he will be back soonKannada actor Darshan, whose bail was recently revoked by the Supreme Court, was arrested on August 14. Darshan's wife Vijayalakshmi, who is now handling his social media accounts, shared a message for the actor's fans after his arrest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ian-mckellen-gandalf-frodo-return-the-hunt-for-gollum-lord-of-the-rings-andy-serkis-2772979-2025-08-18",
      "headline": "Sir Ian McKellen hints at Gandalf, Frodo Baggins return in The Hunt for GollumVeteran actor Sir Ian Mckellen recently opened up about the upcoming 'The Lord of the Rings' movie 'The Hunt for Gollum'. He also hinted at the return of important characters in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-b-shetty-su-from-so-grosses-rs-100-crore-global-box-office-2772990-2025-08-18",
      "headline": "Su From So box office: Raj B Shetty's film grosses Rs 100 crore worldwideRaj B Shetty's 'Su From So' achieves blockbuster status, marking a significant success for the Kannada film industry amid challenging times."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-cincinnati-open-title-jannik-sinner-retires-2773172-2025-08-19",
      "headline": "Carlos Alcaraz wins maiden title after hapless Jannik Sinner retiresCarlos Alcaraz won his first Cincinnati Open title after Jannik Sinner retired midway through the final with illness. Sinner's withdrawal raises doubts about his readiness for the US Open, while Alcaraz prepares to compete in mixed doubles with Emma Raducanu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-indian-super-league-supreme-court-u-turn-clarification-fsdl-2773133-2025-08-18",
      "headline": "AIFF clarifies ISL U-turn, cites legal advice for Supreme Court stepThe All India Football Federation defended its sudden U-turn on the ISL case, citing legal advice to prioritise the National Sports Governance Bill, after a weekend of confusion over its Supreme Court approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gianluigi-donnarumma-ederson-transfer-news-manchester-city-galatasaray-explained-2773126-2025-08-18",
      "headline": "Gianluigi Donnarumma-Ederson transfer domino at Manchester City: ExplainedAugust's transfer window could see one of the most dramatic goalkeeping reshuffles in recent years, with Ederson, Donnarumma, Manchester City, PSG, and Galatasaray locked in a chain reaction of uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-supreme-court-fsdl-aiff-clubs-hearing-plea-2773096-2025-08-18",
      "headline": "Supreme Court steps in: ISL clubs, AIFF and FSDL face decisive showdownThe Supreme Court will hear the AIFF–FSDL contract dispute on August 22, a date that could determine the fate of the Indian Super League and decide the immediate future of 11 clubs in limbo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-varun-chakravarthy-on-gautam-gambhir-2773079-2025-08-18",
      "headline": "Gautam Gambhir always backed me when others ignored: Varun ChakravarthyIndia wrist spinner Varun Chakravarthy has revealed how Gautam Gambhir backed him during the lowest phase of his career when he was ignored by others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-kedar-jadhav-boycott-2773035-2025-08-18",
      "headline": "Confident India won't play Pakistan in Asia Cup 2025: Kedar JadhavFormer India cricketer Kedar Jadhav has called for a boycott of the Asia Cup 2025 match against Pakistan. India and Pakistan are scheduled to play in Dubai on September 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-shubman-gill-in-t20is-asia-cup-2025-2773030-2025-08-18",
      "headline": "Shubman Gill can adapt to any format, T20 not just about big hitting: HarbhajanFormer India spinner Harbhajan Singh has backed Shubman Gill to adapt his game to T20Is, mentioning his ability to switch gears quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-injury-miss-duleep-trophy-2025-east-zone-squad-2772952-2025-08-18",
      "headline": "Why Ishan Kishan will miss Duleep Trophy for East Zone? Injury details revealedThe reason behind Ishan Kishan missing the Duleep Trophy has been revealed, with the wicketkeeper still recovering from an injury he suffered recently. Kishan was replaced in the squad by Odisha's Aashirwad Swain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chetan-sharma-defends-jasprit-bumrahs-workload-management-2772944-2025-08-18",
      "headline": "Jasprit Bumrah should listen to physios, they're the better judges: Chetan SharmaFormer India fast bowler Chetan Sharma has defended Jasprit Bumrah's workload management, saying that the players should listen to their physios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-century-buchi-babu-tournament-mumbai-cricket-test-comeback-2024-2772930-2025-08-18",
      "headline": "Sarfaraz Khan slams 138 off 114 in Chennai, sends strong message to selectorsSarfaraz Khan scored a quickfire 138 in the Buchi Babu Invitational tournament in Chennai. The 27-year-old batter will be bidding to return to the Test squad when India's home season begins in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-denies-player-release-for-india-camp-injury-fifa-rules-controversy-2772922-2025-08-18",
      "headline": "Mohun Bagan refuses to release players for India camp citing injury concernsMohun Bagan firmly refused to release their players for the ongoing national camp, stating that it is \"not mandatory\" outside a FIFA window and accusing the All India Football Federation of neglecting player welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-shubman-gill-in-t20is-asia-cup-2025-2773030-2025-08-18",
      "headline": "Shubman Gill can adapt to any format, T20 not just about big hitting: HarbhajanFormer India spinner Harbhajan Singh has backed Shubman Gill to adapt his game to T20Is, mentioning his ability to switch gears quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-injury-miss-duleep-trophy-2025-east-zone-squad-2772952-2025-08-18",
      "headline": "Why Ishan Kishan will miss Duleep Trophy for East Zone? Injury details revealedThe reason behind Ishan Kishan missing the Duleep Trophy has been revealed, with the wicketkeeper still recovering from an injury he suffered recently. Kishan was replaced in the squad by Odisha's Aashirwad Swain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chetan-sharma-defends-jasprit-bumrahs-workload-management-2772944-2025-08-18",
      "headline": "Jasprit Bumrah should listen to physios, they're the better judges: Chetan SharmaFormer India fast bowler Chetan Sharma has defended Jasprit Bumrah's workload management, saying that the players should listen to their physios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-century-buchi-babu-tournament-mumbai-cricket-test-comeback-2024-2772930-2025-08-18",
      "headline": "Sarfaraz Khan slams 138 off 114 in Chennai, sends strong message to selectorsSarfaraz Khan scored a quickfire 138 in the Buchi Babu Invitational tournament in Chennai. The 27-year-old batter will be bidding to return to the Test squad when India's home season begins in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-denies-player-release-for-india-camp-injury-fifa-rules-controversy-2772922-2025-08-18",
      "headline": "Mohun Bagan refuses to release players for India camp citing injury concernsMohun Bagan firmly refused to release their players for the ongoing national camp, stating that it is \"not mandatory\" outside a FIFA window and accusing the All India Football Federation of neglecting player welfare."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}