{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tv-todays-cfo-yatender-kumar-tyagi-wins-silver-award-from-safa-for-best-presented-annual-report-in-financial-reporting-2632100-2024-11-12",
      "headline": "TV Today's CFO wins Silver Award from SAFA for Best Presented Annual Report in Financial reportingPresented by the South Asian Federation of Accountants (SAFA), this award recognises TV Today's excellence in financial transparency within the Service Sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-listing-date-latest-gmp-indicate-ahead-of-market-debut-share-price-2632095-2024-11-12",
      "headline": "Swiggy IPO listing: What does latest GMP indicate ahead of market debut? Bengaluru-based Swiggy opened for subscription with a price band of Rs 371 to Rs 390, aiming to raise Rs 11,327 crore through the Initial Public Offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-insurance-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2632068-2024-11-12",
      "headline": "Niva Bupa Health Insurance IPO allotment: Step-by-step guide to check statusNiva Bupa Health Insurance IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-nears-90000-dollars-strong-rally-will-it-continue-donald-trump-stance-2632047-2024-11-12",
      "headline": "Bitcoin price nears $90,000. What's behind the rally and will it continue? The recent rally in Bitcoin, now nearing $90,000, comes on the back of Donald Trump's pro-crypto stance following his recent election victory in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindalco-shares-gain-over-2-percent-after-beating-estimates-in-q2-report-should-you-buy-sell-or-hold-2632019-2024-11-12",
      "headline": "Hindalco shares gain 2% after beating estimates in Q2 report: Should you buy? Hindalco shares: Hindalco reported a 123% year-on-year (YoY) rise in standalone net profit, amounting to Rs 1,891 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-inflation-data-hindalco-share-price-today-2632016-2024-11-12",
      "headline": "Sensex, Nifty rise ahead of inflation data; Hindalco gains after Q2 resultsThe S&P BSE Sensex was up 148.85 points to 79,645 at 10:26 am, while the NSE Nifty was up 46.75 points to 24,188.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-share-maret-listing-decent-debut-premium-over-ipo-price-2632007-2024-11-12",
      "headline": "Sagility India shares list at 3.5% premium over IPO priceSagility India share market listing: The stock listed with a modest premium, drawing mixed views on valuation but strong demand from investors across segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-12-2024-precious-metals-record-hike-on-mcx-2631995-2024-11-12",
      "headline": "Gold, silver price today, November 12, 2024: Precious metals record hike on MCXGold Price Today November 12, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-donald-trump-us-elections-win-dollars-market-2631958-2024-11-12",
      "headline": "Bitcoin crosses $89,000 as Trump vows to make US 'crypto capital of the planet'Leading cryptocurrency bitcoin pushed to a new all-time high of $89,637 (approx Rs 75 lakh) on Tuesday. Trump has vowed to make the United States \"the crypto capital of the planet\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-insurance-ipo-day-3-check-latest-subscription-gmp-2631713-2024-11-11",
      "headline": "Niva Bupa Health Insurance IPO Day 3: Check latest subscription, GMPNiva Bupa Health Insurance IPO: The public issue has seen moderate interest and allotment for the Niva Bupa Health Insurance IPO is likely to be finalised on Tuesday, November 12, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-lic-shares-after-q2-results-expert-view-what-brokerages-say-2631680-2024-11-11",
      "headline": "Should you buy LIC shares after Q2 results? Here's what brokerages suggestLIC reported a 4% year-on-year (YoY) decline in standalone net profit, amounting to Rs 7,621 crore for the quarter ending September 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-flat-amid-volatile-trading-asian-paints-down-8-percent-2631639-2024-11-11",
      "headline": "Sensex, Nifty close flat amid volatile trading; Asian Paints down 8%The S&P BSE Sensex added 9.83 points to close at 79,496.15, while the NSE Nifty50 was down 6.90 points to end at 24,141.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-amazon-executives-summon-plan-government-for-foreign-investment-violations-report-2631614-2024-11-11",
      "headline": "Flipkart, Amazon under scrutiny for foreign investment violations: ReportWalmart-owned Flipkart and Amazon, both of which are experiencing rapid growth in India's Rs 70 billion e-commerce market, face rising regulatory scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-holdings-shares-hit-all-time-high-rise-70-percent-in-just-4-sessions-2631568-2024-11-11",
      "headline": "JSW Holdings shares hit all-time high, surging 70% in just 4 sessionsJSW Holdings Ltd shares: The rally has positioned the stock as one of the year's top performers, delivering multibagger returns with a 228.18% rise on a year-to-date (YTD) basis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-last-flights-today-bids-farewell-before-air-india-merger-loyalty-program-tickets-2631480-2024-11-11",
      "headline": "Goodbye, Vistara: Airline set for final flight today as it merges with Air IndiaThe Vistara airline began its operations on January 9, 2015, with an inaugural flight from Delhi to Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-surges-past-81000-record-high-reason-what-is-driving-the-surge-us-election-trump-2631448-2024-11-11",
      "headline": "Bitcoin rallies past $81,000. What's driving the surge?Bitcoin surged past $81,000 for the first time, hitting a record high on Monday with its market cap reaching $1.6 trillion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-of-8438-against-us-dollar-trump-us-election-2631433-2024-11-11",
      "headline": "Rupee plunges to all-time low of 84.38 against US dollarThe rupee dropped to a new low of 84.3875 in early trading, surpassing its previous record set last Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-allotment-step-by-step-online-guide-to-check-status-latest-gmp-2631411-2024-11-11",
      "headline": "Swiggy IPO allotment: Step-by-step guide to check status Swiggy IPO allotment: Investors can check their allotment status by logging in to the BSE website or the registrar Link Intime India's portal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-despite-gain-in-it-and-auto-stocks-2631388-2024-11-11",
      "headline": "Sensex, Nifty open flat despite gains in IT and auto stocks The S&P BSE Sensex was down 48.63 points to 79,437.69, while the Nifty50 lost 20.40 points to 24,127.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crazy-capitalist-over-organised-socialist-ruchir-sharma-on-why-billionaires-back-donald-trump-2631143-2024-11-10",
      "headline": "Ruchir Sharma on why billionaires support 'crazy capitalist' Donald TrumpDespite his 'crazy capitalist' persona, Donald Trump's pro-business approach continues to win over America's influential elites and billionaires.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/nana-patole-bjp-dog-remark-controversy-akola-kirit-somaiya-2632029-2024-11-12",
      "headline": "Maharashtra Congress chief compares BJP to 'dog': Time to show its placeThe Maharashtra Congress chief attacked the BJP for bringing down the Maha Vikas Aghadi government and singled out Devendra Fadnavis, saying that the former Chief Minister considers himself 'God'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bollywood-actor-shah-rukh-khan-death-threat-suspect-arrested-chhattisgarh-2631987-2024-11-12",
      "headline": "Lawyer who issued death threat to Shah Rukh Khan arrested in ChhattisgarhLast week, Bandra police station received a call threatening Shah Rukh Khan and demanding a ransom of Rs 50 lakh. An extortion case was filed in this connection following a complaint by the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-okhla-waste-to-energy-plant-toxic-emissions-ash-health-complications-2632067-2024-11-12",
      "headline": "Delhi's 'eco-friendly' waste-to-energy plant poisoning millions: ReportA five-year investigation by The New York Times has revealed that a waste-to-energy plant in Delhi's Okhla is exposing millions of people to highly toxic emissions and putting them at risk of serious health issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/project-2025-trump-presidency-agenda-47-immigration-border-control-pornography-us-indian-americans-citizenship-2631764-2024-11-12",
      "headline": "Why Project 2025 is scaring Americans and its impact on immigrationDonald Trump has always spoken of stricter border controls and a crackdown on illegal immigrants, but some of his rivals said he would implement a far-right policy playbook, Project 2025. Here's why Project 2025 is scaring Americans and its take on immigration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-virat-front-page-australian-media-hindi-punjabi-font-2631980-2024-11-12",
      "headline": "Virat Kohli on front page as Aussie newspaper printed in Hindi, PunjabiBorder-Gavaskar Trophy: The \"Virat Kohli fever\" has swept through the Australian media, with the India batter featuring prominently on the front pages of various Australian newspapers. The Aussie newspapers feature Virat and Yashasvi Jaiswal with Hindi and Punjabi headlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-ias-officers-suspended-religious-whatsapp-group-violation-of-discipline-2631946-2024-11-12",
      "headline": "'Collector Bro' among 2 Kerala IAS officers suspended for indisciplineN Prasanth, one of the two suspended officers who previously served as Kozhikode District Collector, was popularly known as 'Collector Bro' and had earlier posted on Facebook to refute the allegations against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/six-x-factors-that-will-decide-the-fate-of-maharashtra-in-the-assembly-polls-opinion-2632082-2024-11-12",
      "headline": "6 X-factors that will decide fate of Maharashtra in assembly pollsAlliances often disturb social coalitions — both the MVA and the Mahayuti have unnatural partners in the Shiv Sena (Uddhav Balasaheb Thackeray) and the NCP (Ajit Pawar) respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/president-elect-donald-trump-advisors-tough-times-ahead-indian-immigrants-us-2631886-2024-11-11",
      "headline": "A Trump appointment may be cause for concern for Indian techies. Here's whyTrump's second term spells tough times for Indian immigrants, with hardline advisors Homan and Miller set to drive stricter immigration policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/new-journey-awaits-indigo-pays-tribute-to-vistara-as-last-flight-takes-off-before-merger-with-air-india-2632040-2024-11-12",
      "headline": "New journey awaits: IndiGo's tribute to Vistara as last flight takes offIndiGo paid tribute to Vistara as it operated its final flight ahead of its merger with Air India on November 12. Vistara CEO Vinod Kannan thanked the team and passengers for their support during the airline's 9-year journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-elections-special-report-hemant-soren-maiya-yojna-silently-changing-game-jharkhand-2632064-2024-11-12",
      "headline": "Is Hemant Soren's Maiya Yojna silently changing the game in JharkhandThe JMM-led INDIA alliance in Jharkhand is banking on its electoral strategy—Maiya Samman Yojna (JMMSY). Meanwhile, the BJP aims to counter it with its GoGo Didi scheme, which promises financial support of Rs 2,100 per month. But why are both the BJP and JMM so focused on women voters in Jharkhand? And is the Maiya Yojna truly effective on the ground? Here's a detailed ground report from Jharkhand's Khunti, Tamar, and Jamshedpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-team-secretary-of-the-state-senator-marco-rubio-united-states-white-house-2631951-2024-11-12",
      "headline": "Trump picks India backer, China hawk Marco Rubio as Secretary of State: ReportMarco Rubio is a leading China hawk in the Senate, and a vocal advocate for strengthening ties with India. Over the years, he has championed efforts to deepen US-India cooperation in defence and trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-the-final-reckoning-teaser-trailer-tom-cruise-watch-2631970-2024-11-12",
      "headline": "Watch: Tom Cruise faces new threat in Mission Impossible: The Final Reckoning teaserThe teaser of Mission: Impossible – The Final Reckoning offers a glimpse of Tom Cruise's Ethan Hunt battling AI 'the Entity'. Directed by Christopher McQuarrie, the film will release in May 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/gate-2025-exam-schedule-announced-at-gate2025iitracin-check-dates-here-2632074-2024-11-12",
      "headline": "GATE 2025 exam schedule announced. Check dates hereThe GATE 2025 exam schedule has been released by IIT Roorkee on the official website. Candidates can now check the full timetable to prepare for their specific test dates and sessions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/telegram-ceo-pavel-durov-offers-free-ivf-to-women-interested-in-using-his-sperm-2632038-2024-11-12",
      "headline": "Telegram CEO Pavel Durov offers free IVF to women interested in using his spermTelegram CEO Pavel Durov has embarked on a unique initiative offering free IVF to women using his sperm, aiming to help those who want to start a family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-nears-90000-dollars-strong-rally-will-it-continue-donald-trump-stance-2632047-2024-11-12",
      "headline": "Bitcoin price nears $90,000. What's behind the rally and will it continue? The recent rally in Bitcoin, now nearing $90,000, comes on the back of Donald Trump's pro-crypto stance following his recent election victory in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/new-maruti-suzuki-dzire-vs-old-maruti-suzuki-dzire-all-major-updates-explained-2632076-2024-11-12",
      "headline": "New Dzire vs Old Dzire: All major updates explainedNew Dzire vs Old Dzire: We explain the major differences between the two generations of India's largest-selling sedan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/mns-always-for-marathi-but-ill-focus-more-on-peoples-issues-amit-thackeray-2631725-2024-11-11",
      "headline": "MNS always for Marathi , but I'll focus more on people's issues: Amit ThackerayRaj Thackeray's son talks about his electoral plunge, plans for Mahim constituency and why the party's decline since 2009 is just a 'bad patch'\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-pakistan-fan-icc-champions-trophy-2025-bcci-pcb-2632053-2024-11-12",
      "headline": "Pakistan kyu nahi aa rahe aap? Fans question India's Suryakumar Yadav in SAA Pakistan fan was seen asking Suryakumar Yadav that why don't India come to Pakistan to play cricket. The schedule for the ICC Champions Trophy is yet to be released due to India's reluctance to travel to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/batenge-to-katenge-bjp-yogi-adityanath-divide-and-rule-akhilesh-yadav-maharashtra-jharkhand-2632031-2024-11-12",
      "headline": "Yogi Adityanath intensifies 'batenge toh katenge' stand, Akhilesh Yadav respondsSamajwadi Party Chief Akhilesh Yadav compared the BJP's use of slogans like 'batenge to katenge' to British divide-and-rule tactics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/samudrayaan/story/samudrayaan-mission-objective-deep-sea-minerals-polymetallic-nodules-cobalt-oceanfloor-2631731-2024-11-12",
      "headline": "India's Deep Sea Mission chief reveals what Samudrayaan will look forSamudrayaan will focus on exploring India's exclusive economic zones and continental shelf, seeking to uncover a wealth of ocean resources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/video/cop29-azerbaijan-climate-change-finance-trillion-dollars-extreme-weather-2631756-2024-11-11",
      "headline": "COP29 begins: Can UN find $1 trillion to fight climate change?This year's COP29 summit has drawn attention, as some question Azerbaijan's role as host, given its oil-producing status. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-cricketer-ben-manenti-recreates-yusuf-dikecs-iconic-olympic-pose-during-one-day-cup-match-2631991-2024-11-12",
      "headline": "Australian cricketer recreates Yusuf Dikec's iconic Olympic pose after run outAustralian cricketer Ben Manenti recreated Turkish shooter Yusuf Dikec's iconic pose from the Paris Olympics 2024 during a match between New South Wales and South Australia in the One Day Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/india-plans-to-create-a-mini-silicon-valley-in-goa-details-inside-2632084-2024-11-12",
      "headline": "India plans to create a mini 'Silicon Valley' in Goa. Details insideThe central and state governments aim to make Goa a hub for data centres, high-quality semiconductor design, and advanced electronics and automotive production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/k-idol-iu-sues-180-people-including-ex-classmate-for-online-harassment-2632085-2024-11-12",
      "headline": "K-idol IU sues 180 people, including ex-classmate, for online harassmentSouth Korean actor and singer IU has sued 180 people, including some of her former classmates, for online harassment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-on-his-love-story-with-wife-kirron-kher-we-were-best-friends-for-10-years-2632098-2024-11-12",
      "headline": "Anupam Kher on his love story with wife Kirron: We were best friends for 10 years Actor Anupam Kher recently shared details about his love story with his wife, Kirron Kher. He revealed that they were best friends for many years before eventually getting married in 1985. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-addresses-rumours-of-being-late-to-set-by-8-hours-calls-it-ridiculous-2632083-2024-11-12",
      "headline": "Dwayne Johnson addresses rumours of being late to set by 8 hours: That's ridiculousIn a recent interview with GQ Magazine, Dwayne Johnson addressed ongoing rumours about his behaviour on film sets. The actor admits to quirky habits and occasional tardiness but firmly denies extreme claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-lady-singham-standalone-film-confirms-rohit-shetty-2632096-2024-11-12",
      "headline": "Deepika Padukone's Lady Singham to get standalone film, confirms Rohit ShettyRohit Shetty, in an exclusive interview with India Today Digital, confirmed Lady Singham (Deepika Padukone) and Tiger Shroff's Satya will get standalone films in the cop universe."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-rahul-dravid-vvs-laxman-adelaide-test-2003-aus-vs-ind-2003-2632099-2024-11-12",
      "headline": "Recapping BGT heroics: When Dravid and Laxman did Kolkata 2001 encore in AdelaideStar India batters Rahul Dravid and VVS Laxman forged a magnificent 303-run partnership for the fifth wicket in the second Test vs Australia in Adelaide, 2003. The partnership helped India win the match by four wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-awaits-pakistans-call-on-hybrid-champions-trophy-as-india-declines-to-travel-2632078-2024-11-12",
      "headline": "ICC awaits Pakistan's call on hybrid Champions Trophy as India declines to travelThe International Cricket Council has asked the Pakistan Cricket Board for its stance on hosting the Champions Trophy under a hybrid model after India declined to travel to Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-perth-pitch-good-pace-bounce-curator-india-first-test-2632059-2024-11-12",
      "headline": "Perth pitch to have good pace, bounce: Curator warns India ahead of first TestBorder-Gavaskar Trophy: India is set for a challenging start to their Australia tour, as the Optus Stadium curator revealed that the pitch for the opening Test has been prepared to deliver \"good bounce and pace,\" in line with Perth's reputation for fiery, fast surfaces.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-pakistan-fan-icc-champions-trophy-2025-bcci-pcb-2632053-2024-11-12",
      "headline": "Pakistan kyu nahi aa rahe aap? Fans question India's Suryakumar Yadav in SAA Pakistan fan was seen asking Suryakumar Yadav that why don't India come to Pakistan to play cricket. The schedule for the ICC Champions Trophy is yet to be released due to India's reluctance to travel to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-bayern-munich-extend-ceo-jan-christian-dreesens-contract-2027-2632034-2024-11-12",
      "headline": "Bayern Munich extend CEO Jan-Christian Dreesen's contract till 2027 Bayern Munich has extended Jan-Christian Dreesen's contract as chief executive by two years through June 2027. Bayern said 57-year-old Dreesen's contract extension was unanimously agreed by the supervisory board.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alexander-zverev-atp-finals-andrey-rublev-carlos-alcaraz-casper-ruud-2632032-2024-11-12",
      "headline": "Alexander Zverev begins ATP final campaign with straight sets win over Andrey RublevAlexander Zverev began his ATP Finals campaign with straight sets win over Andrey Rublev at the Inalpi Arena. Zverev beat Rublev 6-4, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-tim-paine-on-dhruv-jurel-bgt-2632014-2024-11-12",
      "headline": "Tim Paine backs India's Dhruv Jurel to impress in Australia Test seriesTim Paine praised Dhruv Jurel's impressive batting on the challenging, bouncy wicket at the MCG during the second unofficial Test between Australia A and India A, where the 23-year-old scored 80 and 68, handling the pace and bounce with ease.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-cricketer-ben-manenti-recreates-yusuf-dikecs-iconic-olympic-pose-during-one-day-cup-match-2631991-2024-11-12",
      "headline": "Australian cricketer recreates Yusuf Dikec's iconic Olympic pose after run outAustralian cricketer Ben Manenti recreated Turkish shooter Yusuf Dikec's iconic pose from the Paris Olympics 2024 during a match between New South Wales and South Australia in the One Day Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-virat-front-page-australian-media-hindi-punjabi-font-2631980-2024-11-12",
      "headline": "Virat Kohli on front page as Aussie newspaper printed in Hindi, PunjabiBorder-Gavaskar Trophy: The \"Virat Kohli fever\" has swept through the Australian media, with the India batter featuring prominently on the front pages of various Australian newspapers. The Aussie newspapers feature Virat and Yashasvi Jaiswal with Hindi and Punjabi headlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-uncertainty-pakistan-board-india-stand-off-hosting-rights-2631973-2024-11-12",
      "headline": "Champions Trophy in limbo amid Pakistan board, India stand-off over hostingThe 2025 ICC Champions Trophy faces an uncertain future as a standoff between the Pakistan Cricket Board (PCB) and the Board of Control for Cricket in India (BCCI) over hosting arrangements threatens to derail the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-nathan-mcsweeney-on-jasprit-bumrah-challenge-2631966-2024-11-12",
      "headline": "How Australia's debutant McSweeney is planning for 'unique' Bumrah challengeBorder-Gavaskar Trophy: Australia's uncapped opener Nathan McSweeney has admitted that facing Jasprit Bumrah will be \"quite the challenge\" as he prepares for his Test debut against India in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-tim-paine-on-dhruv-jurel-bgt-2632014-2024-11-12",
      "headline": "Tim Paine backs India's Dhruv Jurel to impress in Australia Test seriesTim Paine praised Dhruv Jurel's impressive batting on the challenging, bouncy wicket at the MCG during the second unofficial Test between Australia A and India A, where the 23-year-old scored 80 and 68, handling the pace and bounce with ease.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-cricketer-ben-manenti-recreates-yusuf-dikecs-iconic-olympic-pose-during-one-day-cup-match-2631991-2024-11-12",
      "headline": "Australian cricketer recreates Yusuf Dikec's iconic Olympic pose after run outAustralian cricketer Ben Manenti recreated Turkish shooter Yusuf Dikec's iconic pose from the Paris Olympics 2024 during a match between New South Wales and South Australia in the One Day Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-virat-front-page-australian-media-hindi-punjabi-font-2631980-2024-11-12",
      "headline": "Virat Kohli on front page as Aussie newspaper printed in Hindi, PunjabiBorder-Gavaskar Trophy: The \"Virat Kohli fever\" has swept through the Australian media, with the India batter featuring prominently on the front pages of various Australian newspapers. The Aussie newspapers feature Virat and Yashasvi Jaiswal with Hindi and Punjabi headlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-uncertainty-pakistan-board-india-stand-off-hosting-rights-2631973-2024-11-12",
      "headline": "Champions Trophy in limbo amid Pakistan board, India stand-off over hostingThe 2025 ICC Champions Trophy faces an uncertain future as a standoff between the Pakistan Cricket Board (PCB) and the Board of Control for Cricket in India (BCCI) over hosting arrangements threatens to derail the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-nathan-mcsweeney-on-jasprit-bumrah-challenge-2631966-2024-11-12",
      "headline": "How Australia's debutant McSweeney is planning for 'unique' Bumrah challengeBorder-Gavaskar Trophy: Australia's uncapped opener Nathan McSweeney has admitted that facing Jasprit Bumrah will be \"quite the challenge\" as he prepares for his Test debut against India in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-awaits-pakistan-board-decision-champions-trophy-india-decline-to-travel-2631954-2024-11-12",
      "headline": "ICC awaits Pakistan's decision on Champions Trophy after India decline to travelThe ICC has asked the PCB for a response about hosting the Champions Trophy in a hybrid model after India refused to travel to Pakistan. The PCB confirmed on Sunday that it received an email from the ICC about India's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-referee-david-coote-suspended-anti-liverpool-klopp-video-2631950-2024-11-12",
      "headline": "Premier League referee Coote suspended over alleged anti-Liverpool, Klopp videoThe English referees' body, PGMOL, suspended Premier League referee David Coote after a video allegedly showing him making derogatory remarks about Liverpool and former manager Jürgen Klopp surfaced online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-2024-rohan-bopanna-matthew-ebden-2631922-2024-11-12",
      "headline": "Rohan Bopanna, Matthew Ebden off to losing start in ATP Finals 2024ATP Finals 2024: Simone Boleli and Andrea Vavassori took 56 minutes to beat Rohan Bopanna, Matthew Ebden in the group stage match on Monday, November 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghanistan-vs-bangladesh-rahmanullah-gurbaz-azmatullah-omarzai-series-win-2631903-2024-11-11",
      "headline": "Gurbaz, Omarzai power Afghanistan to ODI series win vs Bangladesh AFG vs BAN: Rahmanullah Gurbaz and Azmatullah Omarzai starred as Afghanistan beat Bangladesh by five wickets on Monday to win the three-match ODI series. Gurbaz scored his eighth ODI hundred while Omarzai was effective with both bat and ball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lockie-ferguson-ruled-out-calf-injury-sri-lanka-vs-new-zealand-2631888-2024-11-11",
      "headline": "Calf injury rules Lockie Ferguson out of ODI series vs Sri Lanka SL vs NZ: Fast bowler Lockie Ferguson has been ruled out of the ODI series against Sri Lanka after he sustained a calf injury during the second T20I on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ruud-van-nistelrooy-leaves-manchester-united-right-after-reuben-amorims-arrival-2631885-2024-11-11",
      "headline": "Ruud van Nistelrooy leaves Manchester United right after Amorim's arrivalInterim Manchester United manager Ruud van Nistelrooy will not be joining the technical staff of incoming Ruben Amorim, confirmed the club on Monday, 11 November. Van Nistelrooy and three first-team coaches departed the club on the day of Amorim's arrival.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-sad-barcelona-fan-gets-stuck-between-dancing-real-sociedad-supporters-2631856-2024-11-11",
      "headline": "Watch: Sad Barcelona fan gets stuck between dancing Real Sociedad supportersA Barcelona fan got stuck in between hundreds of Real Sociedad fans in a LaLiga match on Sunday. The home fans celebrated by dancing while as the Barcelona supporter stood there in silence after the visitors conceded a goal. The video of the incident has gone viral on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-referee-suspended-after-video-showed-him-abusing-liverpool-and-klopp-2631850-2024-11-11",
      "headline": "Premier League referee suspended after video showed him abusing Liverpool and KloppEnglish Premier League referees' body PGMOL has suspended Premier League referee David Coote on Monday, November 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lockie-ferguson-ruled-out-calf-injury-sri-lanka-vs-new-zealand-2631888-2024-11-11",
      "headline": "Calf injury rules Lockie Ferguson out of ODI series vs Sri Lanka SL vs NZ: Fast bowler Lockie Ferguson has been ruled out of the ODI series against Sri Lanka after he sustained a calf injury during the second T20I on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ruud-van-nistelrooy-leaves-manchester-united-right-after-reuben-amorims-arrival-2631885-2024-11-11",
      "headline": "Ruud van Nistelrooy leaves Manchester United right after Amorim's arrivalInterim Manchester United manager Ruud van Nistelrooy will not be joining the technical staff of incoming Ruben Amorim, confirmed the club on Monday, 11 November. Van Nistelrooy and three first-team coaches departed the club on the day of Amorim's arrival.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-sad-barcelona-fan-gets-stuck-between-dancing-real-sociedad-supporters-2631856-2024-11-11",
      "headline": "Watch: Sad Barcelona fan gets stuck between dancing Real Sociedad supportersA Barcelona fan got stuck in between hundreds of Real Sociedad fans in a LaLiga match on Sunday. The home fans celebrated by dancing while as the Barcelona supporter stood there in silence after the visitors conceded a goal. The video of the incident has gone viral on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-referee-suspended-after-video-showed-him-abusing-liverpool-and-klopp-2631850-2024-11-11",
      "headline": "Premier League referee suspended after video showed him abusing Liverpool and KloppEnglish Premier League referees' body PGMOL has suspended Premier League referee David Coote on Monday, November 11."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-blind-team-t20-world-cup-pakistan-2631845-2024-11-11",
      "headline": "Blind cricket team awaits government approval for T20 World Cup in PakistanAfter getting an NOC from the Sports Ministry, the Indian blind cricket team is awaiting approval from the government to visit Pakistan for the upcoming T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/the-fiery-gautam-gambhir-press-conference-and-sanjay-manjrekars-tweet-sledging-room-s02-ep-61-2631838-2024-11-11",
      "headline": "The fiery Gautam Gambhir press conference | Sledging Room, S02, Ep 61Former India batter Sanjay Manjrekar criticised Gautam Gambhir, saying he 'does not have the right demeanour' to speak to the media after the head coach addressed a press conference in Mumbai. Akshay Ramesh, Saurabh Kumar and Kingshuk Kusari discuss the explosive start to the Border-Gavskar Trophy buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-sunil-gavaskar-warm-up-match-2631837-2024-11-11",
      "headline": "Gavaskar slams India for cancelling warm-up match before Australia Tests AUS vs IND: Sunil Gavaskar said that India should not have cancelled their warm-up match against India A given how their batters performed in the Test series that New Zealand won 3-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-hussey-backs-rohit-sharma-virat-kohli-to-do-well-2631835-2024-11-11",
      "headline": "Silly to write off 'proud' India: Hussey backs Rohit, Kohli to do well in AUSFormer batter Michael Hussey is wary of India ahead of the Border-Gavaskar Trophy. Hussey said that India are a proud cricketing nation and it is possible that they come out all guns blazing in Australia.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}