{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-418-points-higher-nifty-above-24700-tata-steel-ends-4-percent-up-2766024-2025-08-04",
      "headline": "Sensex closes 418 points higher, Nifty above 24,700; Tata Steel ends 4% upThe S&P BSE Sensex added 418.81 points to close at 81,018.72, while the NSE Nifty50 gained 157.40 points to end at 24,722.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoffs-it-jobs-at-risk-ai-automation-entry-mid-level-why-reasons-expert-view-2766017-2025-08-04",
      "headline": "TCS to cut 12,000 jobs in FY26: Why are mid-level IT jobs at risk?Experts believe TCS layoffs point to a broader structural change where automation and AI are beginning to take over routine tasks, leading to a change in the type of roles companies want to retain and the kind of talent they want to hire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-probes-banks-in-rs-17000-crore-loan-fraud-linked-to-anil-ambani-2765906-2025-08-04",
      "headline": "ED probes banks in Rs 17,000 crore loan fraud linked to Anil AmbaniThe Enforcement Directorate (ED) is investigating why 39 banks failed to report a loan fraud of ₹17,000 crore linked to companies of businessman Anil Ambani. The agency suspects that the banks' silence may have been bought. The central question being investigated is, \"Was there a certain bribe that was paid to the banks to buy their silence?\" The ED has asked the banks to explain their inaction, especially when the loans turned into non-performing assets (NPAs). As the money laundering investigation mounts, Anil Ambani has been summoned to appear on the 5th of August. The ED has also summoned his top executives and close aides, including Amitabh Jhunjhunwala and Satish Seth, believing they hold key information on how the alleged frauds and payment of bribes occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-sector-banks-spending-on-recovery-agents-exclusive-rti-details-2765958-2025-08-04",
      "headline": "RTI reveals how much PSU banks spend on recovery agentsIndia Today filed a Right to Information (RTI) query with the Department of Financial Services (DFS) to uncover how much taxpayer-funded public sector banks are spending on recovery agents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-whats-better-for-you-in-fy-2024-25-2765913-2025-08-04",
      "headline": "Old vs new tax regime: What's better for you in FY 2024–25?With the ITR filing deadline extended to September 15, 2025, you've got more time to pick the right tax regime. Should you stick to the old one with its deductions, or go for the new one with lower rates?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-probe-summons-anil-ambani-top-executives-questions-39-bank-rs-17000-crore-loan-fraud-2765902-2025-08-04",
      "headline": "ED summons Anil Ambani's top aides; probes banks over Rs 17,000 crore loan fraudDays after summoning Anil Ambani, the Enforcement Directorate (ED) has now issued summons to several of his top executives for questioning under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mango-millionaire-radhika-gupta-niranjan-avasthi-sips-investing-financial-freedom-2765882-2025-08-04",
      "headline": "'Mango Millionaire' authors Radhika Gupta, Niranjan Avasthi on SIPs, investing and moreIn this exclusive Q&A interaction, Gupta and Avasthi reflect on the core ideas in their book, the pitfalls of social media-driven investing, why SIPs still matter, and what India needs to change in the way it talks about money and long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-dubai-property-with-credit-cards-why-many-indians-are-now-in-trouble-2765838-2025-08-04",
      "headline": "Buying Dubai property with credit cards? Why many Indians are now in troubleSeveral homebuyers either clicked on payment links shared by Dubai-based builders or swiped their credit cards during their visits to the UAE. It felt hassle-free, no paperwork, no visits to the bank. But there's a catch. Read here to know more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-ceo-c-vijaykumar-earned-rs-95-crore-who-are-india-top-highest-paid-it-bosses-tcs-infosys-wipro-2765847-2025-08-04",
      "headline": "HCLTech CEO earned Rs 95 crore: Here are India's highest-paid IT bossesHCLTech also reported a 17.6% increase in the median pay for its employees during the financial year. HCLTech currently has 1,67,316 permanent employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dehlivery-shares-rally-up-to-5-percent-after-q1-results-should-you-buy-2765822-2025-08-04",
      "headline": "Dehlivery shares rally up to 5% after Q1 results. Should you buy?Delhivery shares jumped 5% in early trade after the company posted its Q1FY26 results. Should you buy into the rally or wait and watch how the integration and margins play out?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sri-lotus-developers-ipo-allotment-today-august-4-check-status-gmp-listing-date-expected-profit-2765804-2025-08-04",
      "headline": "Sri Lotus Developers IPO allotment today: Check your status, GMP, listing dateThe IPO of Sri Lotus Developers received a strong response during its three-day bidding window, with total subscriptions reaching 74.10 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-hurting-us-economy-jobs-inflation-data-explained-2765799-2025-08-04",
      "headline": "Explained: How Trump's tariffs are hurting the US economyWith inflation rising and global backlash mounting, data suggests Trump's tariff blitz is straining the American economy, casting doubt on his promise to 'make it great again'."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-aneet-padda-pay-hike-saiyaara-blockbuster-success-2766020-2025-08-04",
      "headline": "Here's how much Ahaan, Aneet were paid for Saiyaara, fee hike expected for nextDebut actors Ahaan Panday and Aneet Padda are renegotiating their fees after 'Saiyaara's' massive success. Their rising market value signals a shift in Bollywood's casting dynamics and pay scales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/raanjhanaa-ai-climax-rewriting-film-endings-controversy-dhanush-anand-l-rai-risk-opinion-2765921-2025-08-04",
      "headline": "Kundan's death in Raanjhanaa mattered: Why AI shouldn't rewrite endings meant to hurtKundan's death in 'Raanjhanaa' remains a poignant moment cherished by fans. AI-generated happy endings risk diluting the emotional core and the director's original vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/spy-x-family-spy-moves-heres-what-its-secretly-teaching-you-2765942-2025-08-04",
      "headline": "Spy X Family isn't just about spy moves, here's what it's secretly teaching you'Spy X Family' isn't just about action and espionage, it's a masterclass in emotional intelligence, trust, and family dynamics.  Find out what else Anya, Loid, and Yor teach you. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amul-celebrates-shah-rukh-khan-vikrant-massey-anational-award-win-12th-fail-jawan-2766014-2025-08-04",
      "headline": "Amul celebrates SRK, Vikrant Massey's National Award win with witty doodleAmul recently celebrated Massey and Shah Rukh Khan's National Award win with a doodle on August 4. Take a look at it here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-demands-national-awards-for-tv-actors-calls-out-bollywood-bias-2765894-2025-08-04",
      "headline": "Rupali Ganguly demands National Awards for TV actors, calls out Bollywood biasActor Rupali Ganguly recently called for recognition of TV actors in response to the recent National Film Awards. In a recent interview, she highlighted the dedication of TV actors, especially during the pandemic. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-patani-warns-legal-action-fake-news-aniruddhacharya-premanandji-2765928-2025-08-04",
      "headline": "Khushboo Patani warns legal action amid Aniruddhacharya row: I will not spareActor Disha Patani's sister Khushboo Patani has issued a stern warning to those spreading fake news against her. She plans to file police complaints and sue for defamation and cybercrime offences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivakarthikeyan-is-scared-of-sequels-2765968-2025-08-04",
      "headline": "Tamil actor Sivakarthikeyan is scared of sequels. Here's why'Amaran' actor Sivakarthikeyan, who attended the Nasscom People Summit 2025 as a guest, spoke about why he is scared of sequels during a question and answer session. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-actor-aasif-khan-quits-smoking-shares-emotional-note-on-friendship-day-2765920-2025-08-04",
      "headline": "Actor Aasif Khan quits smoking after health scare, shares emotional noteActor Aasif Khan has quit smoking after a recent health scare. He admitted he hasn't had a cigarette in 21 days in an emotional note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-jyothika-visit-tirupati-with-kids-after-agaram-15-year-celebrations-video-2765909-2025-08-04",
      "headline": "Suriya, Jyothika visit Tirupati with kids after Agaram event. Viral videoTamil cinema's star couple, Suriya and Jyothika, recently visited the Tirupati temple in Andhra Pradesh, with their family. This comes after a grand celebration marking 15 years of Suriya's charitable foundation, Agaram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-shatters-box-office-becomes-indias-highest-grossing-animated-film-2765966-2025-08-04",
      "headline": "Mahavatar Narsimha shatters box office, becomes India's highest-grossing animated filmAshwin Kumar's 'Mahavatar Narsimha' has taken the Indian box office by storm, becoming the highest-grossing animated film in the country with Rs 91.25 crore in just 10 days. The multi-language mythological drama's success signals a promising future for Indian animation and its rich storytelling traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rihanna-launches-fenty-beauty-to-india-check-launch-date-tira-sephora-india-2765946-2025-08-04",
      "headline": "Rihanna brings Fenty Beauty to India. Check launch dateMuch to the excitement of beauty enthusiasts, pop icon Rihanna's Fenty Beauty is all set to enter India. The singing sensation announced the launch date with a fun video on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pati-patni-aur-panga-forced-fun-flat-reality-checks-dull-munawar-faruqui-sonali-bendre-2765912-2025-08-04",
      "headline": "Pati Patni Aur Panga: Forced fun and flat reality checks dull the excitement'Pati Patni Aur Panga -Jodiyon Ka Reality Check' premiered on August 2 on Colors TV. Starring seven celebrity couples and hosted by Munawar Faruqui and Sonali Bendre, the show that promises a glimpse of REAL-ationship fails to deliver the freshness and emotional depth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/urvashi-questions-transparency-national-film-awards-selection-process-2765947-2025-08-04",
      "headline": "Urvashi on National Awards selection process: Can't accept it silently like pensionVeteran actor Urvashi questioned the criteria used for National Film Awards and called for transparency from the Centre and State in award decisions. She won the Best Supporting Actor for Malayalam film, Ullozhukku'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-expresses-gratitude-to-canada-police-after-incident-at-kaps-cafe-2765856-2025-08-04",
      "headline": "Kapil Sharma thanks Canada police after shooting incident at Kap's cafeComedian Kapil Sharma thanked officials for their support in the firing incident at Kap's Cafe. He shared a video of the local police visiting his cafe on his Instagram account. The cafe resumed operations on July 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashamah-shailesh-lodha-approached-for-salman-khan-bigg-boss-19-2765944-2025-08-04",
      "headline": "Taarak Mehta actor Shailesh Lodha approached for Bigg Boss 19: SourceSalman Khan hosted 'Bigg Boss', is set to return with another season. While the new season promises some unique twists, India Today has exclusively learnt that actor Shailesh Lodha has been approached for the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-shares-photos-jungkook-rm-jimin-gym-2765916-2025-08-04",
      "headline": "BTS V shares messy gym update with Jungkook, RM, and JiminBTS member V, also known as Kim Taehyung, delighted ARMYs with an unexpected post featuring a collection of photos and videos from his recent outings with Jungkook, RM, Jimin, and other bandmates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tamannaah-bhatia-joins-shahid-kapoor-vishal-bhardwaj-romeo-action-thriller-2025-2765911-2025-08-04",
      "headline": "Tamannaah joins Shahid Kapoor in Vishal Bhardwaj's RomeoTamannaah Bhatia has been cast alongside Shahid Kapoor in Vishal Bhardwaj's upcoming thriller 'Romeo'. The film promises a gritty crime drama with complex characters and a big year-end release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-rana-daggubati-dance-to-ek-niranjan-in-baahubali-bts-video-2765854-2025-08-04",
      "headline": "Prabhas, Rana Daggubati dance to Ek Niranjan in Baahubali BTS video. WatchA fun video from the sets of 'Baahubali' shows Prabhas dancing to 'Ek Niranjan' in his royal costume. Shared on Friendship Day, the clip also features Rana Daggubati and Anushka Shetty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-wife-sshura-flaunts-baby-bump-for-first-time-at-his-birthday-bash-2765827-2025-08-04",
      "headline": "Arbaaz Khan's wife Sshura flaunts baby bump for first time at his birthday bashActor-filmmaker Arbaaz Khan's wife Sshura flaunted her baby bump at an event on Sunday. The couple made a stylish entry at Khan's birthday bash in Mumbai. The celebration was attended by several Bollywood celebrities, including actor Salman Khan. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-5-live-score-updates-weather-mohammed-siraj-shubman-gill-2765824-2025-08-04",
      "headline": "Day 5 Live: Siraj strikes twice, India are alive and kicking at OvalENG vs IND, 5th Test Day 5 Live Score: Mohammed Siraj strikes in his very first over! India are alive and kicking in the Test match and are within reach of winning this game. India desperately need Prasidh Krishna to support Siraj from the other end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-jairam-ramesh-china-border-rahul-gandhi-supreme-court-galwan-indian-territory-arunachal-true-indian-2765985-2025-08-04",
      "headline": "Centre's DDLJ policy: Congress fumes after court raps Rahul Gandhi on China remarkCongress leader Jairam Ramesh posed a series of questions to the government on its handling of China and accused it of following a \"DDLJ\" policy -- Deny, Distract, Lie, and Justify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-statehood-bill-parliament-buzz-social-media-pm-modi-amit-shah-president-2766007-2025-08-04",
      "headline": "J&K statehood to be restored? Buzz grows as PM, Amit Shah meet PresidentJ&K statehood: The fact that these meetings came days ahead of the Article 370 abrogation anniversary on August 5 has only added grist to the rumour mill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-pigeon-feeding-ban-kabutarkhanas-protests-heath-hazards-high-court-2765952-2025-08-04",
      "headline": "Maximum city, maximum kabutars? Mumbai bans pigeon feeding, protests take flightMumbai pigeon feeding ban: A Bombay High Court order directing the closure of kabutarkhanas has given flight to controversy, protests, as well as the first FIR for feeding pigeons. Here is why the issue has sparked protests across Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/tcs-layoffs-show-indian-it-giants-have-missed-the-bus-job-loss-and-pain-ahead-2765897-2025-08-04",
      "headline": "TCS layoffs show Indian IT giants have missed the bus, job loss and pain aheadNo one is willing to say it loudly, but it is clear that the nature of IT work is changing due to artificial intelligence. And it is changing in a way that may not turn out to be favourable for our IT giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-raps-uttar-pradesh-banke-bihari-ordinance-temple-funds-management-2765989-2025-08-04",
      "headline": "Not a case of no man's land: Court raps UP's 'hurry' in Banke Bihari ordinanceThe Supreme Court pulled up Uttar Pradesh over the Bankey Bihari Temple Trust Ordinance, which effectively hands over the management of the famous shrine in Vrindavan to the government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-pays-homage-to-shibu-soren-consoles-jharkhand-chief-minister-hemant-soren-pictures-2765988-2025-08-04",
      "headline": "PM Modi pays homage to Shibu Soren at Delhi hospital, consoles son Hemant SorenPrime Minister Narendra Modi was seen consoling an emotional Hemant Soren at Delhi hospital where his father and JMM patriarch, Shibu Soren, passed away after a prolonged illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dharmasthala-mass-burial-case-suspected-human-remains-found-at-spot-11-say-sources-2766021-2025-08-04",
      "headline": "Suspected human remains found at Spot 11 in Dharmasthala mass burial case: SourcesOn Day 6 of the Dharmasthala mass burial case probe, suspected human remains were recovered at Spot 11, revealed sources. This comes after skeletal remains were earlier found at Spot 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-shatters-box-office-becomes-indias-highest-grossing-animated-film-2765966-2025-08-04",
      "headline": "Mahavatar Narsimha shatters box office, becomes India's highest-grossing animated filmAshwin Kumar's 'Mahavatar Narsimha' has taken the Indian box office by storm, becoming the highest-grossing animated film in the country with Rs 91.25 crore in just 10 days. The multi-language mythological drama's success signals a promising future for Indian animation and its rich storytelling traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-inaugurate-new-central-vista-building-kartavya-bhawan-on-august-6-2766023-2025-08-04",
      "headline": "PM Modi to inaugurate new Central Vista building 'Kartavya Bhawan' on August 6The new building, named 'Kartavya Bhawan', will house the offices of the Union Home Ministry, and the Department of Personnel & Training among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/kaleshwaram-atm-report-brs-kcr-congress-crosshairs-telangana-politics-2765980-2025-08-04",
      "headline": "Dam-ning report on Kaleshwaram puts KCR in Congress crosshairsCongress gets official backing in Kaleshwaram 'ATM' charge as inquiry report flags financial, procedural lapses; BRS faces heat, BJP too feels the tremors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-wild-journey-from-flop-auditions-to-bollywood-singing-god-2765769-2025-08-04",
      "headline": "Kishore Kumar's wild journey: From flop auditions to Bollywood's singing GodKishore Kumar ruled the stage like a rock star, but his career began with rejection of his signature style that defied norms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-u-turn-shashi-tharoor-bcci-gautam-gambhir-2765941-2025-08-04",
      "headline": "Tharoor is right, Gambhir and BCCI should swallow pride and get Kohli backShashi Tharoor's call for Virat Kohli's return to Test cricket comes at a time when India's batting order looks unsettled and leadership gaps are showing in England. As fans debate the timing and merit of Kohli's retirement, the question remains: can the BCCI and Gambhir convince him to reconsider?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cockroaches-air-india-san-francisco-mumbai-flight-airline-sorry-probe-incident-2765898-2025-08-04",
      "headline": "Cockroaches on a plane, Air India says sorryAn Air India spokesperson said that cabin crew relocated two passengers who were bothered by the presence of cockroaches. The airline also issued an apology and said it is probing the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorists-operation-mahadev-pakistan-link-voter-cards-chocolates-satellite-phone-2765829-2025-08-04",
      "headline": "Voter IDs, Candyland chocolates, GPS: Trail of Pahalgam terrorists leads to PakFindings drawn from the post-encounter evidence released by security agencies establish beyond doubt that the Pahalgam terrorists were from Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/are-women-more-prone-to-headaches-and-why-are-their-symptoms-often-dismissed-2765896-2025-08-04",
      "headline": "Are women more prone to headaches, and why are their symptoms often dismissed?Women suffer severe migraines linked to hormonal changes but often face dismissal in clinics. Neurologists call for personalised, gender-sensitive headache care to bridge this critical gap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-slams-rahul-gandhi-china-land-grab-case-congress-defamation-case-2765863-2025-08-04",
      "headline": "True Indian wouldn't...: Top court raps Rahul Gandhi over China claim, halts caseThe Supreme Court slammed Rahul Gandhi for his claim that China had annexed 2,000 km of Indian territory, but stayed defamation proceedings against him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangla-language-row-bengali-mamata-banerjee-political-controversy-lecture-on-language-amit-malviya-bjp-2765951-2025-08-04",
      "headline": "What exactly is BJP's Malviya lecturing Mamata on amid Bangla rowAs a letter by the Lodhi Colony Police Station to the Banga Bhawan in Delhi requesting an official to help understand \"Bangladeshi language\" sparked a political storm, BJP leader Amit Malviya tutored West Bengal CM Mamata Banerjee on Bangla. But what exactly was Malviya, who called Mamata \"poorly lettered\", trying to explain to the native speaker of Bangla?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-guwahati-develops-breath-based-sensor-for-voice-free-communication-2766009-2025-08-04",
      "headline": "Difficulty speaking? IIT Guwahati's sensor turns your breath into voice commandsResearchers at IIT Guwahati have created an underwater vibration sensor that allows people with voice disabilities to control smart devices without speaking. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/is-it-spying-on-us-nasa-could-turn-juno-towards-interstellar-object-3iatlas-near-jupiter-2765933-2025-08-04",
      "headline": "Is the interstellar traveller a spy? Nasa could reroute Juno to investigateDiscovered in July 2025, 3I/ATLAS is the third confirmed interstellar visitor traversing our solar system, following 'Oumuamua and Comet Borisov. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-sector-banks-spending-on-recovery-agents-exclusive-rti-details-2765958-2025-08-04",
      "headline": "RTI reveals how much PSU banks spend on recovery agentsIndia Today filed a Right to Information (RTI) query with the Department of Financial Services (DFS) to uncover how much taxpayer-funded public sector banks are spending on recovery agents. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mp-r-sudha-injured-chain-snatching-poland-embassy-delhi-2765874-2025-08-04",
      "headline": "I'm highly traumatised: Congress MP's chain snatched in Delhi's diplomatic enclaveCongress MP R Sudha was injured in a chain-snatching incident near the Poland Embassy in Chanakyapuri. She described the incident as \"highly shocking\" given it occurred in the high-security diplomatic enclave of the capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/param-bir-singh-malegaon-blast-case-king-of-controversies-mumbai-police-hindu-terror-ajmal-kasab-antilia-bomb-2765279-2025-08-04",
      "headline": "Param Bir Singh: Malegaon blast cop who's the king of controversiesParam Bir Singh probed the Malegaon blast case as an assistant commissioner of Maharashtra ATS. The case was projected by the establishment as a case of \"Hindu terror\", and all the accused have been let off. Not just Malegaon, from the Antilia bomb scare case to the Rs 100-crore extortion racket in Mumbai, the now-retired IPS officer has remained the king of controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-aneet-padda-pay-hike-saiyaara-blockbuster-success-2766020-2025-08-04",
      "headline": "Here's how much Ahaan, Aneet were paid for Saiyaara, fee hike expected for nextDebut actors Ahaan Panday and Aneet Padda are renegotiating their fees after 'Saiyaara's' massive success. Their rising market value signals a shift in Bollywood's casting dynamics and pay scales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/raanjhanaa-ai-climax-rewriting-film-endings-controversy-dhanush-anand-l-rai-risk-opinion-2765921-2025-08-04",
      "headline": "Kundan's death in Raanjhanaa mattered: Why AI shouldn't rewrite endings meant to hurtKundan's death in 'Raanjhanaa' remains a poignant moment cherished by fans. AI-generated happy endings risk diluting the emotional core and the director's original vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amul-celebrates-shah-rukh-khan-vikrant-massey-anational-award-win-12th-fail-jawan-2766014-2025-08-04",
      "headline": "Amul celebrates SRK, Vikrant Massey's National Award win with witty doodleAmul recently celebrated Massey and Shah Rukh Khan's National Award win with a doodle on August 4. Take a look at it here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-patani-warns-legal-action-fake-news-aniruddhacharya-premanandji-2765928-2025-08-04",
      "headline": "Khushboo Patani warns legal action amid Aniruddhacharya row: I will not spareActor Disha Patani's sister Khushboo Patani has issued a stern warning to those spreading fake news against her. She plans to file police complaints and sue for defamation and cybercrime offences."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/chief-justice-of-india-felicitates-divya-deshmukh-after-chess-world-cup-glory-2766008-2025-08-04",
      "headline": "Chief Justice of India felicitates Divya Deshmukh after Chess World Cup gloryChief Justice of India BR Gavai visited Divya Deshmukh in Nagpur to honour her after she clinched the FIDE Women's World Cup and became India's 88th Grandmaster, scripting history at just 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-harry-brook-rishabh-pant-comparison-2765998-2025-08-04",
      "headline": "Harry Brook's 'impactful' ton at Oval draws Rishabh Pant comparisonHarry Brook's aggressive century helped England take control in the final Test against India. Former cricketer Ajay Jadeja praised Harry Brook's fearless approach, comparing his impact and style to India's Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-4-early-stoppage-heavy-roller-2765982-2025-08-04",
      "headline": "Did forced early Oval Test Day 4 stoppage cost India a chance to level series?India had their tails up on Day 4 and had England on the ropes before the play was stopped early. Did that decision all but ended India's chances of getting a win and levelling the series?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-prasidh-krishna-oval-test-rp-singh-praise-2765977-2025-08-04",
      "headline": "Siraj and Prasidh Krishna made the ball talk in Oval Test Day 4: RP SinghMohammed Siraj and Prasidh Krishna lit up Day 4 at the Oval with relentless pressure and late breakthroughs, keeping India alive in a tense Test as England edge closer to victory in a rain-threatened finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-harry-brook-ben-stokes-successor-ollie-pope-england-test-captaincy-2765959-2025-08-04",
      "headline": "Not Ollie Pope, but Harry Brook should be Ben Stokes' successor: VaughanFormer England captain Michael Vaughan believes that Harry Brook is the ideal fit to take over the reins of Test captaincy from current skipper Ben Stokes, instead of the current stand-in skipper Ollie Pope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-u-turn-shashi-tharoor-bcci-gautam-gambhir-2765941-2025-08-04",
      "headline": "Tharoor is right, Gambhir and BCCI should swallow pride and get Kohli backShashi Tharoor's call for Virat Kohli's return to Test cricket comes at a time when India's batting order looks unsettled and leadership gaps are showing in England. As fans debate the timing and merit of Kohli's retirement, the question remains: can the BCCI and Gambhir convince him to reconsider?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-3rd-t20i-sahibzada-farhan-saim-ayub-lauderhill-2765940-2025-08-04",
      "headline": "Farhan, Ayub star as Pakistan take series-clinching win by 13 runsPakistan's opening pair, Sahibzada Farhan and Saim Ayub, laid the foundation for securing the win over the West Indies in the third T20I, which also helped them win the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-akash-deep-mohammed-siraj-performance-day-4-oval-test-2765883-2025-08-04",
      "headline": "Dinesh Karthik slams Akash Deep, Siraj after India's poor show on Day 4 at OvalDinesh Karthik wasn't pleased with India's bowling and fielding on Day 4 at The Oval. Karthik criticised Akash Deep's bowling performance and Mohammed Siraj's work in the outfield, especially with the drop catch of Harry Brook. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-shubman-gill-injection-stump-mic-akash-deep-2765878-2025-08-04",
      "headline": "Watch: Gill's stump-mic injection chat with Akash Deep leaves fans in splitsShubman Gill, during a tense Day 4 at The Oval, was caught on stump mic asking injured pacer Akash Deep about a painkiller injection as India desperately searched for a breakthrough against England's batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-morne-morkel-unfazed-day-4-early-end-rain-2765865-2025-08-04",
      "headline": "India bowling coach Morkel unfazed by early Day 4 end: Rain beyond controlENG vs IND: India bowling coach Morne Morkel explained how the side is not thinking much about the early end of what promised to be an exciting or potentially decisive Day 4 of the Oval Test against England, and that the team would rather focus on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-prediction-joe-root-press-conference-2765855-2025-08-04",
      "headline": "Joe Root backs England to win Oval Test: We have got what we need to cross lineEngland star Joe Root is backing the hosts to get over the finish line in the Oval Test and seal the series against India 3-1. Root scored his 39th Test century to put England on course for the win before a late twist got India back in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-3rd-t20i-sahibzada-farhan-saim-ayub-lauderhill-2765940-2025-08-04",
      "headline": "Farhan, Ayub star as Pakistan take series-clinching win by 13 runsPakistan's opening pair, Sahibzada Farhan and Saim Ayub, laid the foundation for securing the win over the West Indies in the third T20I, which also helped them win the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-akash-deep-mohammed-siraj-performance-day-4-oval-test-2765883-2025-08-04",
      "headline": "Dinesh Karthik slams Akash Deep, Siraj after India's poor show on Day 4 at OvalDinesh Karthik wasn't pleased with India's bowling and fielding on Day 4 at The Oval. Karthik criticised Akash Deep's bowling performance and Mohammed Siraj's work in the outfield, especially with the drop catch of Harry Brook. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-shubman-gill-injection-stump-mic-akash-deep-2765878-2025-08-04",
      "headline": "Watch: Gill's stump-mic injection chat with Akash Deep leaves fans in splitsShubman Gill, during a tense Day 4 at The Oval, was caught on stump mic asking injured pacer Akash Deep about a painkiller injection as India desperately searched for a breakthrough against England's batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-morne-morkel-unfazed-day-4-early-end-rain-2765865-2025-08-04",
      "headline": "India bowling coach Morkel unfazed by early Day 4 end: Rain beyond controlENG vs IND: India bowling coach Morne Morkel explained how the side is not thinking much about the early end of what promised to be an exciting or potentially decisive Day 4 of the Oval Test against England, and that the team would rather focus on Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-prediction-joe-root-press-conference-2765855-2025-08-04",
      "headline": "Joe Root backs England to win Oval Test: We have got what we need to cross lineEngland star Joe Root is backing the hosts to get over the finish line in the Oval Test and seal the series against India 3-1. Root scored his 39th Test century to put England on course for the win before a late twist got India back in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-prediction-varun-aaron-2765839-2025-08-04",
      "headline": "India are in a position to win Oval Test: Varun Aaron's big claim before Day 5Former pacer Varun Aaron believes India can clinch victory in the Oval Test on Day 5. The match is evenly poised as England needed 35 runs and India is aiming to get four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-5-live-score-updates-weather-mohammed-siraj-shubman-gill-2765824-2025-08-04",
      "headline": "Day 5 Live: Siraj strikes, India are alive and kicking at OvalENG vs IND, 5th Test Day 5 Live Score: Mohammed Siraj strikes in his very first over! India are alive and kicking in the Test match and are within reach of winning this game. India desperately need Prasidh Krishna to support Siraj from the other end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3-pacers-no-kuldeep-yadav-morne-morkel-explains-oval-test-2765821-2025-08-04",
      "headline": "3-pacer policy, no Kuldeep Yadav: Morne Morkel explains India's Oval callENG vs IND: India's persistent three-pacer strategy came under scrutiny after Day 4 at The Oval, as bowling coach Morne Morkel addressed the absence of Kuldeep Yadav and hinted at a post-tour reassessment of selection tactics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-conditions-heavy-roller-ollie-pope-shubman-gill-2765798-2025-08-04",
      "headline": "Curious case of the heavy roller: How it can affect Day 5 of the Oval TestThe Oval Test is set for a tense final day with England needing 35 runs and India requiring four wickets. The use of the heavy roller could influence the pitch, adding intrigue to the match's outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-weather-report-london-rain-prediction-2765762-2025-08-04",
      "headline": "Oval Test Day 5 weather report: Will rain be the villain in London drama?The England vs India Test series reached a dramatic pause on Day 4 at the Oval with rain and bad light halting play early. The weather forecast for Day 5 suggests rain to be on the horizon, adding uncertainty to the thrilling series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-chris-woakes-injured-batting-joe-root-2765744-2025-08-04",
      "headline": "Like Rishabh Pant, Chris Woakes ready to put his body on the line: Joe RootInjured seamer Chris Woakes will bat if needed on the final day of the fifth Test match of the series, said Joe Root. Woakes, who was injured on Day 1 of the 5th Test, was believed to be out of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-calls-mohammed-siraj-a-real-warrior-2765712-2025-08-04",
      "headline": "Mohammed Siraj is a real warrior, he gives his everything for India: Joe RootStar England batter Joe Root hailed Mohammed Siraj for his lion-hearted bowling performance in the ongoing fifth Test against England at the Oval and called him a true warrior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-day-5-drama-all-four-results-possible-weather-2765709-2025-08-04",
      "headline": "Final day, final Test: England need 35, India 4 wickets and 4 results possibleEngland vs India: England need just 35 runs, India only four wickets, and as this unforgettable five-Test saga builds towards its crescendo, all four outcomes — win, loss, draw, or tie — remain tantalisingly on the table. A dramatic finale awaits, fitting for a series that has defied logic and thrilled at every turn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-weather-report-london-rain-prediction-2765762-2025-08-04",
      "headline": "Oval Test Day 5 weather report: Will rain be the villain in London drama?The England vs India Test series reached a dramatic pause on Day 4 at the Oval with rain and bad light halting play early. The weather forecast for Day 5 suggests rain to be on the horizon, adding uncertainty to the thrilling series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-chris-woakes-injured-batting-joe-root-2765744-2025-08-04",
      "headline": "Like Rishabh Pant, Chris Woakes ready to put his body on the line: Joe RootInjured seamer Chris Woakes will bat if needed on the final day of the fifth Test match of the series, said Joe Root. Woakes, who was injured on Day 1 of the 5th Test, was believed to be out of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-calls-mohammed-siraj-a-real-warrior-2765712-2025-08-04",
      "headline": "Mohammed Siraj is a real warrior, he gives his everything for India: Joe RootStar England batter Joe Root hailed Mohammed Siraj for his lion-hearted bowling performance in the ongoing fifth Test against England at the Oval and called him a true warrior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-day-5-drama-all-four-results-possible-weather-2765709-2025-08-04",
      "headline": "Final day, final Test: England need 35, India 4 wickets and 4 results possibleEngland vs India: England need just 35 runs, India only four wickets, and as this unforgettable five-Test saga builds towards its crescendo, all four outcomes — win, loss, draw, or tie — remain tantalisingly on the table. A dramatic finale awaits, fitting for a series that has defied logic and thrilled at every turn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-bowling-coach-morne-morkel-praises-mohammed-siraj-leader-oval-test-2765711-2025-08-04",
      "headline": "Recognition of Siraj thrills bowling coach Morkel: His actions drive the groupIndia's bowling coach Morne Morkel said he was pleased that natural leader Mohammed Siraj was finally receiving the recognition he deserves, praising the pacer's unwavering commitment and consistency throughout the five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-4-stumps-rain-lazy-decision-debate-2765710-2025-08-03",
      "headline": "Lazy decision? Early stumps on Day 4 of Oval Test sparks debateOval Test: Play was called off early on Day 4 due to bad light and a passing shower. England needed 35 runs and India were pushing for four more wickets when wet weather pushed the fifth and final Test into Day 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-prasidh-krishna-india-fightback-england-final-test-oval-2765708-2025-08-03",
      "headline": "Tired legs, aching body: Prasidh Krishna and Mohammed Siraj defy odds at OvalMohammed Siraj and Prasidh Krishna delivered exceptional bowling spells to revive India's chances in the final Test at The Oval. Their resilience sparked a thrilling comeback, stirring hope amid tough odds and intense pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shashi-tharoor-missing-virat-kohli-in-england-2765703-2025-08-03",
      "headline": "Shashi Tharoor missing Virat Kohli in England: Too late to call him out of retirement?Congress MP Shashi Tharoor said that he's missing Virat Kohli in the ongoing Test series in England after India's poor bowling performance on Day 4 of the fifth Test at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-day-4-cliffhanger-score-2765700-2025-08-03",
      "headline": "Oval Test cliffhanger fittingly heads into Day 5 with series still on the lineThe Oval Test between India and England extends to a dramatic fifth day after rain played spoilsport in a thrilling final session on Sunday. England need 35 runs to break Indian hearts and win the series 3-1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-surpasses-kumar-sangakkara-with-39th-test-century-2765690-2025-08-03",
      "headline": "ENG vs IND: Joe Root surpasses Kumar Sangakkara with 39th Test century at OvalStar England batter Joe Root surpassed Kumar Sangakkara with his 39th Test century on Day 4 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-oval-harry-brook-fourth-innings-century-2765684-2025-08-03",
      "headline": "Dropped on 19, Harry Brook hurts India with 4th innings century in Oval TestEngland vs India, 5th Test: Harry Brook tore into India's hopes of a series-leveling win with a 90-ball 111 on Sunday. It was the 26-year-old's 10th Test hundred in only his 50th innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-holder-breaks-dwayne-bravos-record-for-most-wickets-in-t20is-for-wi-2765672-2025-08-03",
      "headline": "Jason Holder breaks Bravo's record to become highest wicket-taker for WI in T20IsJason Holder has broken Dwayne Bravo's record for most wickets in T20Is for West Indies after his match-winning performance against Pakistan in the second T20I."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-exclusive-fide-womens-world-cup-chess-boom-2765656-2025-08-03",
      "headline": "Divya Deshmukh exclusive: Fearless chess, World Cup win, and India's surgeDivya Deshmukh recently created history by winning the Chess World Cup, becoming the youngest player and the first Indian to lift the title. The 19-year-old spoke to India Today about her success, style and the golden era of Indian chess. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/son-heung-min-tottenham-farewell-seoul-emotional-sendoff-lafc-transfer-2765648-2025-08-03",
      "headline": "Video: Son in tears as Spurs legend receives guard of honour in farewell gameAn emotional Son Heung-min was moved to tears as he bid farewell to Tottenham, in what is expected to have been his final outing in a Spurs shirt against Newcastle United."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gills-performance-in-england-better-than-my-record-of-774-runs-sunil-gavaskar-2765640-2025-08-03",
      "headline": "Gill's performance in England better than my record of 774 runs: Sunil GavaskarLegendary India batter Sunil Gavaskar has rated Shubman Gill's performance in the ongoing series against England better than his debut series against West Indies in 1971."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-aura-farming-dance-south-africa-wcl-title-celebration-2765637-2025-08-03",
      "headline": "Watch: AB de Villiers' aura farming dance during SA's WCL title celebrationAB de Villiers, at 41, gave cricket fans a masterclass in both performance and personality—first with a match-winning century, then with an 'aura-farming' celebration that lit up the internet."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}