{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-key-proposals-for-fds-long-term-savings-capital-markets-mutual-funds-taxation-and-compliance-2659369-2025-01-03",
      "headline": "Budget 2025: Key proposals for FDs, and long-term savingsTax incentives for fixed deposits and boost middle-class savings could redefine savings strategies in Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-goods-and-services-tax-on-vouchers-and-gift-cards-all-you-need-to-know-2659315-2025-01-03",
      "headline": "GST on vouchers and gift cards: All you need to knowGift vouchers are exempt from GST, but commissions and services linked to them remain taxable under GST rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-sensex-nifty-fall-nearly-1-percent-as-it-financial-banking-pharma-stocks-tumble-in-volatile-day-2659277-2025-01-03",
      "headline": "Sensex, Nifty fall nearly 1% as IT, banking stocks tumble in volatile day The S&P BSE Sensex plunged 720.60 points to end at 79,223.11, while the NSE Nifty50 lost 199.60 points to end at 23,989.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-taxpayers-5-reforms-that-could-make-new-tax-regime-a-better-deal-for-you-2659264-2025-01-03",
      "headline": "Budget 2025: 5 reforms that could make new tax regime a better deal for youThe government is expected to focus on boosting consumption, given the low GDP for the second quarter, which could lead to tax relief measures aimed at increasing disposable income for salaried taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-date-time-and-what-to-expect-fm-nirmala-sitharaman-to-present-key-policies-and-reforms-income-tax-2659224-2025-01-03",
      "headline": "Budget 2025: Date, time, and what to expectThe countdown to India's Union Budget 2025 has begun, with Nirmala Sitharaman set to present key policies and reforms on February 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-kpi-green-energy-share-price-is-showing-36-decline-on-some-trading-apps-bonus-issue-stmp-2659186-2025-01-03",
      "headline": "Explained: Why KPI Green Energy shares are down 36% on some trading appsKPI Green Energy stock price: The stock declined 4.44% to trade at Rs 547 on the Bombay Stock Exchange (BSE) at Rs 1:40 pm after hitting an intraday low of Rs 548."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-rises-4-percent-should-you-buy-brokerage-review-clsa-nomura-stmp-2659167-2025-01-03",
      "headline": "Tata Motors share price rises 4%. Is it a good time to invest?Tata Motors stock: Over the past five trading sessions, Tata Motors has gained more than 6%. However, the stock has seen a decline of 18.36% in the last six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-five-key-announcements-india-is-waiting-for-income-tax-relief-reduction-in-excise-duty-on-fuel-focus-on-job-creation-2659149-2025-01-03",
      "headline": "Budget 2025: 5 key announcements India is waiting forBudget 2025 holds the potential to bring much-needed relief to the economy, addressing both long-term growth and immediate concerns like inflation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-gains-over-12-percent-hits-all-time-high-know-why-stmp-2659153-2025-01-03",
      "headline": "ITI share price soars over 12%, hits all-time high. Know whyITI stock price: Earlier, some analysts had advised investors to book profits as it was approaching a critical resistance zone. However, it has now surpassed the resistance zone and is likely to continue its upward momentum. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oil-india-ongc-share-price-jump-5-percent-today-what-is-fuelling-the-rally-stmp-2659131-2025-01-03",
      "headline": "Oil India, ONGC shares jump 5% today. What's fuelling the rally?The rally can be attributed to global policy measures aimed at economic revival, which investors believe could boost fuel demand and enhance earnings for upstream oil companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jai-corp-stock-price-52-week-low-today-check-key-details-capital-reduction-proposal-stmp-2659116-2025-01-03",
      "headline": "Explained: Why Jai Corp share price hit 52-week low todayThe steep decline in Jai Corp's share price over two sessions stems from a significant capital reduction proposal involving Urban Infrastructure Holdings Private Limited (UIHPL), where Jai Corp holds a 32% equity stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-tax-saving-tips-for-young-professionals-in-2025-investment-planning-health-insurance-2659101-2025-01-03",
      "headline": "5 tax-saving tips for young professionals in 2025Proactive financial planning helps young professionals save taxes, build wealth, and reach goals with strategies like early planning, goal-based investing, and health insurance, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-600-points-3-reasons-behind-stock-market-volatility-2659096-2025-01-03",
      "headline": "Sensex tumbles 600 points: 3 reasons behind stock market volatilityThe downturn highlights the persistent volatility on Dalal Street, with investors uncertain about the short-term market trajectory. While auto and IT stocks had propelled a rally just a day ago, profit booking amid prevailing uncertainty appears to have weighed heavily on sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/leo-dry-fruits-and-spices-ipo-last-day-check-price-band-gmp-today-stmp-2659089-2025-01-03",
      "headline": "Leo Dry Fruits and Spices IPO: Check price band, GMP today  Leo Dry Fruits and Spices IPO last day: The initial public offering (IPO) of Leo Dry Fruits and Spices will close for bidding on Friday after having opened for subscription on January 1, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-5-top-expectations-of-senior-citizens-enhanced-savings-better-deductions-for-medical-costs-2659086-2025-01-03",
      "headline": "Budget 2025: 5 top expectations of senior citizens Budget 2025 can ease senior citizens' burdens with higher tax exemptions, simpler processes, and targeted benefits for financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dmart-share-price-avenue-supermarts-stock-jumps-13-percent-in-early-trade-should-you-buy-stmp-2659058-2025-01-03",
      "headline": "DMart share price jumps 14% in early trade: Should you buy?DMart share price: The stock, which closed at Rs 3,617.75 in the previous session, rose to a high of Rs 4,165.00 during intraday trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-drops-over-400-points-nifty-slips-below-24100-in-early-trade-2659048-2025-01-03",
      "headline": "Sensex drops 400 points; Nifty slips below 24,100 in early tradeThe S&P BSE Sensex lost 452.52 points to 79,491.29, while the NSE Nifty50 was down by 93.25 points to 24,095.40 as of 9:42 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kabeer-biswas-founder-dunzo-exit-quick-commerce-startup-reliance-retail-battles-cash-crisis-report-2659043-2025-01-03",
      "headline": " Kabeer Biswas may call it quits as Dunzo battles cash crisis: Report The Bengaluru-based quick commerce platform has faced a challenging period over the last 12–18 months, marked by cash flow issues and difficulties in raising fresh funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-allotment-status-online-step-by-step-guide-latest-gmp-listing-date-2659030-2025-01-03",
      "headline": "Indo Farm Equipment IPO: Check allotment status, GMP and listing dateIndo Farm IPO allotment status:: Investors who wish to check Indo Farm Equipment IPO allotment can do so by visiting the Bombay Stock Exchange (BSE) website and the registrar's online portal, which is Mas Services Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-evasion-can-unregistered-small-businesses-b2c-receive-gst-notices-2658821-2025-01-03",
      "headline": "Can unregistered small businesses receive GST notices?The annual turnover threshold for GST registration is Rs 40 lakh for businesses supplying goods and Rs 20 lakh for service providers. Businesses below these limits are exempt, but exceeding them triggers registration and compliance requirements."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/situation-in-china-not-unusual-health-ministry-urges-calm-amid-hmpv-outbreak-scare-2659820-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Situation in China not unusual: Health Ministry urges calm amid HMPV spread scareThe Health Ministry highlighted that India's robust surveillance systems and healthcare resources are well-equipped to handle respiratory illnesses, including those caused by the Human Metapneumovirus (HMPV). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-sydney-knock-critics-x-factor-attack-test-cricket-2659751-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maverick Sydney Test knock shows why Rishabh Pant shouldn't be tamedRishabh Pant's electrifying 33-ball 61 on Day 2 of the Sydney Test was a masterclass in counter-attacking cricket, reigniting India's hopes of retaining the Border-Gavaskar Trophy. With audacious stroke play and fearless intent, Pant reminded his critics that he cannot be tamed.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/journalist-mukesh-chandrakar-murder-in-chhattisgarh-new-twist-key-accused-ritesh-identified-as-his-paternal-cousin-2659721-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Twist in journalist's murder: Key accused identified as Mukesh Chandrakar's cousinMukesh Chandrakar, a 28-year-old journalist known for his hard-hitting investigative reports, recently exposed alleged corruption in a Rs 120-crore road construction project. He was found dead in a property belonging to Suresh Chandrakar, who was named in the corruption report. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/shiv-sena-ubt-saamana-praise-maharashtra-cm-devendra-fadnavis-sharad-pawar-ncp-reunion-hopes-calls-2659725-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saamana praises Fadnavis, Pawars to bury hatchet; what's going on in Maharashtra?After days of calls for reunion rumblings in the NCP, Shiv Sena (UBT)'s mouthpiece Saamana praised Maharashtra CM Devendra Fadnavis, saying, \"Congratulations, Deva Bhau\" for his efforts to eliminate Naxalites in the state. Is something changing in Maharashtra politics?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/chinese-chatter-intensifies-on-hmpv-as-new-respiratory-infections-surge-opinion-2659732-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chinese chatter intensifies on HMPV as new respiratory infections surgeVarious reports in the Chinese media highlight how the emergency departments, infectious disease units, fever clinics, and infusion rooms at different children's hospitals in the country are packed with people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-truck-accident-soldiers-injured-jammu-kashmir-bandipore-2659695-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "4 soldiers killed after Army truck rolls down hill in Jammu and KashmirAn Army truck lost control while negotiating a sharp curve and rolled down a hill in Jammu and Kashmir's Bandipore district, killing four soldiers and injuring three others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sunil-gavaskar-mumbai-ranji-trophy-interview-2659823-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma should play for Mumbai in Ranji Trophy: Sunil GavaskarBorder Gavaskar Trophy, IND vs AUS: In an exclusive interview with India Today, Sunil Gavaskar said that Rohit Sharma should play for Mumbai in the Ranji Trophy to regain his lost touch with the bat in hand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/princes-william-and-harrys-ex-nannys-stepson-among-new-orleans-attack-victims-2659825-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Princes William and Harry's ex-nanny's stepson among New Orleans attack victimsPrince William and his wife, Catherine, have expressed their deep sorrow following the death of Edward Pettifer, a 31-year-old British man with close ties to the royal family, in a New Year's Day terror attack in New Orleans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/will-2025-smash-box-office-with-superstars-taking-over-cinemas-trade-analysts-weigh-in-cinematic-saturday-2659602-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With Raja Saabs returning to cinemas, will 2025 be the Sikandar at box office?The Indian film industry is poised for a significant year in 2025 with a star-studded lineup, aiming to draw audiences back to theatres post-pandemic. With major releases across languages, the industry hopes for a pan-India success and increased footfall in cinemas. Trade experts Girish Johar and Ramesh Bala share their insights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prashant-kishor-hunger-strike-luxury-vanity-van-bihar-students-protest-bpsc-exam-jan-suraaj-2659645-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "As Prashant Kishor sits on indefinite fast, his luxury vanity van feeds frenzyAmid Prashant Kishor's fast-unto-death, photos of his luxury vanity van parked at the site of the protest at Patna's Gandhi Maidan have gone viral, sparking buzz on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bengaluru-court-grants-bail-to-atul-subhass-wife-in-laws-in-his-suicide-case-2659788-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie suicide case: Atul Subhash's wife, in-laws get bailBengaluru techie Atul Subhash died by suicide on December 9 after alleging harassment by his wife Nikita Singhania and her family, including his mother-in-law. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/moon-flanked-by-venus-and-saturn-in-stunning-alignment-over-india-in-rare-celestial-event-2659804-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Moon flanked by Venus and Saturn in stunning alignment over IndiaShortly after sunset, the southwestern horizon is playing host to the stunning planetary conjunction, offering skywatchers a breathtaking view of these three celestial bodies converging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-and-dhanashree-verma-unfollow-each-other-spark-divorce-rumours-2659769-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yuzvendra Chahal and Dhanashree Verma unfollow each other, spark divorce rumoursChahal and Dhanashree's rumored split has left fans stunned. Reports of divorce, fuelled by their Instagram activity and deleted posts, signal an end to their once-adored love story. Neither has addressed the speculation, keeping fans guessing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-delhi-assembly-election-first-list-of-candidates-released-parvesh-sharma-kailash-gahlot-2659658-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi: BJP pits Parvesh Verma against Arvind Kejriwal, Kailash Gahlot gets ticketBJP candidate list Delhi polls: BJP veteran Ramesh Bidhuri will contest against Delhi Chief Minister Atishi in Kalkaji as the saffron party released its first list of 29 candidates for the Delhi elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-cm-pinarayi-vijayan-sanatana-dharma-remark-row-social-reformer-narayan-guru-ezhava-explained-2659361-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why South's second Sanatana Dharma row has reformer Narayana Guru at the centreKerala CM Pinarayi Vijayan's comments on Sanatana Dharma have ignited a fresh debate, with social reformer and saint, Narayana Guru, at the centre. Known for his teachings of equality and social harmony, why is the 19th-century reformer at the heart of southern India's second Sanatana Dharma row?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-kalyan-thane-airhostess-digital-arrest-cyber-crime-2659682-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Air hostess duped of Rs 10 lakh after being threatened with arrest in fake caseA Maharashtra-based air hostess was duped of Rs 9.93 lakh by fraudsters who falsely claimed she was linked to a money-laundering case and coerced her into transferring the money under the pretext of avoiding arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/loneliness-is-not-just-bad-for-your-mental-health-it-also-causes-infections-2659338-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Loneliness is not just bad for your mental health, it also causes infectionsNew research reveals that staying socially connected not only benefits mental health but may also protect against diseases like heart disease and diabetes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-politics-business-entertainment-441-03-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-health-minister-veena-george-concerns-around-hmpv-outbreak-china-advises-caution-2659770-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No cause for concern, but be cautious: Kerala Health Minister on China HMPV scareKerala Health Minister Veena Goerge said that there are no reports of any viruses that are likely to become a pandemic or spread very quickly to other areas in China at this time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/lionel-messi-george-soros-ralph-lauren-to-receive-highest-us-civilian-honour-2659735-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lionel Messi, George Soros, Ralph Lauren to receive highest US civilian honourSoccer superstar Lionel Messi, fashion designer Ralph Lauren, and left-wing philanthropist George Soros are among the 19 honourees who will receive the Presidential Medal of Freedom."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/rapper-nicki-minaj-faces-lawsuit-alleging-assault-emotional-distress-2659812-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rapper Nicki Minaj faces lawsuit alleging assault, emotional distressRapper Nicki Minaj is embroiled in a lawsuit filed by a former employee, Brandon Garrett, who alleges assault and emotional distress. The incident reportedly occurred backstage in Detroit, leading to Garrett's dismissal from her tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-uttar-pradesh-us-model-cyber-crime-fake-profile-social-media-dating-app-arrested-blackmail-extortion-2659624-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi man poses as US model on dating app, defrauds hundreds of womenA 23-year-old man from Delhi was arrested for blackmailing women aged 18 to 30 by pretending to be a US-based model on social media and extorting money from them with intimate photos and videos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/kumbh-mela-origins-of-the-worlds-biggest-oldest-festival-2659448-2025-01-03?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Kumbh Mela: Origins of the world's biggest and oldest festivalDiscover the fascinating origins of Kumbh Mela, the world's largest religious gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-hits-back-at-misinformed-elon-musk-on-child-abuse-grooming-gangs-2659538-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk links Keir Starmer to Pakistani 'rape gangs', UK hits backElon Musk has been severely critical of the UK government's handling of young girls' sexual exploitation across several towns and cities in England more than a decade ago, in many cases involving gangs of Pakistani-origin men."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/rapper-nicki-minaj-faces-lawsuit-alleging-assault-emotional-distress-2659812-2025-01-04",
      "headline": "Rapper Nicki Minaj faces lawsuit alleging assault, emotional distressRapper Nicki Minaj is embroiled in a lawsuit filed by a former employee, Brandon Garrett, who alleges assault and emotional distress. The incident reportedly occurred backstage in Detroit, leading to Garrett's dismissal from her tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/rupali-ganguly-not-exiting-anupama-to-continue-as-lead-sources-2659818-2025-01-04",
      "headline": "Rupali Ganguly not exiting Anupama, to continue as lead: SourcesRupali Ganguly will not be leaving the popular TV show Anupamaa, contrary to recent rumours. Sources confirm she remains committed to her role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-game-changer-andhra-pradesh-government-approves-ticket-hikes-extra-shows-2659807-2025-01-04",
      "headline": "Ram Charan's Game Changer ticket prices hiked, special shows in Andhra PradeshThe Andhra Pradesh government has authorized a significant increase in ticket prices for the film Game Changer during the Sankranti festival. The decision includes special permissions for additional shows to maximize audience turnout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-proposes-global-indian-music-festivals-to-pm-modi-2659787-2025-01-04",
      "headline": "Diljit Dosanjh proposes global Indian music festivals to PM ModiPunjabi singer Diljit Dosanjh recently met PM Modi, discussing India's potential to host music festivals bigger than Coachella. They shared visions for elevating India's cultural scene globally."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-harbhajan-singh-dressing-room-leak-india-vs-australia-2659831-2025-01-04",
      "headline": "Who is your source? Harbhajan slams fan for blaming Rohit SharmaBorder Gavaskar Trophy, IND vs AUS: Harbhajan Singh slammed a fan for blaming Rohit Sharma over the dressing room leaks after the Boxing Day Test which India lost by 184 runs at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-continue-domination-over-pakistan-after-record-total-at-newlands-2659829-2025-01-04",
      "headline": "South Africa continue domination over Pakistan after record total at NewlandsSouth Africa's commanding 615-run total, powered by Rickelton's 259 and Verreynne's century, left Pakistan reeling at 20/3 by stumps on Day 2 in Cape Town. The hosts are just six wickets away from enforcing a follow-on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sunil-gavaskar-mumbai-ranji-trophy-interview-2659823-2025-01-04",
      "headline": "Rohit Sharma should play for Mumbai in Ranji Trophy: Sunil GavaskarBorder Gavaskar Trophy, IND vs AUS: In an exclusive interview with India Today, Sunil Gavaskar said that Rohit Sharma should play for Mumbai in the Ranji Trophy to regain his lost touch with the bat in hand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shivam-dube-and-his-wife-blessed-with-baby-girl-our-hearts-grew-bigger-2659822-2025-01-04",
      "headline": "Shivam Dube and his wife blessed with baby girl: Our hearts grew biggerShivam Dube and his wife celebrate the arrival of their baby girl, Mehwish Shivam Dube, on January 3, 2025. The cricketer's announcement has received warm wishes from fans, marking a joyous new chapter in the couple's life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-dani-olmo-pau-victor-request-2659821-2025-01-04",
      "headline": "Barcelona lose request to keep playing Dani Olmo and Pau VictorDani Olmo and Pau Victor won't play for Barcelona in the second half of the season in the LaLiga. The Spanish football federation and LaLiga, in a joint statement, rejected the request. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-5th-test-how-will-rain-and-pitch-impact-day-3-proceedings-in-sydney-2659816-2025-01-04",
      "headline": "AUS vs IND 5th Test: How will rain and pitch impact Day 3 proceedings in SydneyThe Sydney pitch continues to test batters with uneven bounce and seam movement. As Day 3 unfolds, India's lead of 145 looms large, with a target above 200 likely to challenge Australia on this tricky surface."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devajit-saikia-bcci-secretary-prabhtej-bhatia-2659814-2025-01-04",
      "headline": "Devajit Saikia likely to be elected unopposed as BCCI secretaryDevajit Saikia submitted his nomination for the position of BCCI secretary on Saturday, while Prabhtej Bhatia filed his application for the treasurer role. Both officials are the sole candidates for their respective positions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-sydney-pitch-not-ideal-for-test-cricket-sunil-gavaskar-2659806-2025-01-04",
      "headline": "Sydney pitch not ideal for Test cricket: Sunil GavaskarFormer India captain Sunil Gavaskar said the green pitch in the ongoing fifth Test at the Sydney Cricket Ground is not ideal for playing international red-ball cricket. After 11 wickets fell on day one, day two saw an additional 15 wickets tumble. India, having bowled out Australia for 181, took a slender four-run first-innings lead and reached 141/6 at stumps, extending their overall lead to 145."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-sunil-gavaskar-india-vs-australia-sydney-test-exclusive-2659805-2025-01-04",
      "headline": "Without Bumrah, India will find it difficult to win SCG Test: Sunil GavaskarBorder Gavaskar Trophy, IND vs AUS: Sunil Gavaskar said that India would find it tough to win the New Year's Test at the Sydney Cricket Ground if Jasprit Bumrah doesn't return to bowl for them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-future-in-test-cricket-depends-on-indian-selectors-sunil-gavaskar-2659801-2025-01-04",
      "headline": "Virat Kohli's future in Test cricket depends on Indian selectors: Sunil GavaskarAs Virat Kohli's struggles in Test cricket continue, Sunil Gavaskar emphasises that the decision about his future lies with the selectors, urging them to focus on players who will be available for the 2027 World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-rishabh-pant-61-sydney-day-2-2659799-2025-01-04",
      "headline": "India wouldn't even have reached 100 on Day 2 without Pant's 61: Sunil Gavaskar Batting great Sunil Gavaskar reckons India would not even have reached 100 without Rishabh Pant's spectacular 33-ball-61 on Day 2 of the Sydney Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devajit-saikia-bcci-secretary-prabhtej-bhatia-2659814-2025-01-04",
      "headline": "Devajit Saikia likely to be elected unopposed as BCCI secretaryDevajit Saikia submitted his nomination for the position of BCCI secretary on Saturday, while Prabhtej Bhatia filed his application for the treasurer role. Both officials are the sole candidates for their respective positions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-sydney-pitch-not-ideal-for-test-cricket-sunil-gavaskar-2659806-2025-01-04",
      "headline": "Sydney pitch not ideal for Test cricket: Sunil GavaskarFormer India captain Sunil Gavaskar said the green pitch in the ongoing fifth Test at the Sydney Cricket Ground is not ideal for playing international red-ball cricket. After 11 wickets fell on day one, day two saw an additional 15 wickets tumble. India, having bowled out Australia for 181, took a slender four-run first-innings lead and reached 141/6 at stumps, extending their overall lead to 145."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-sunil-gavaskar-india-vs-australia-sydney-test-exclusive-2659805-2025-01-04",
      "headline": "Without Bumrah, India will find it difficult to win SCG Test: Sunil GavaskarBorder Gavaskar Trophy, IND vs AUS: Sunil Gavaskar said that India would find it tough to win the New Year's Test at the Sydney Cricket Ground if Jasprit Bumrah doesn't return to bowl for them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-future-in-test-cricket-depends-on-indian-selectors-sunil-gavaskar-2659801-2025-01-04",
      "headline": "Virat Kohli's future in Test cricket depends on Indian selectors: Sunil GavaskarAs Virat Kohli's struggles in Test cricket continue, Sunil Gavaskar emphasises that the decision about his future lies with the selectors, urging them to focus on players who will be available for the 2027 World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-rishabh-pant-61-sydney-day-2-2659799-2025-01-04",
      "headline": "India wouldn't even have reached 100 on Day 2 without Pant's 61: Sunil Gavaskar Batting great Sunil Gavaskar reckons India would not even have reached 100 without Rishabh Pant's spectacular 33-ball-61 on Day 2 of the Sydney Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-sanjay-manjrekar-county-cricket-sydney-test-2659785-2025-01-04",
      "headline": "Virat Kohli, Rohit Sharma should play county cricket: Manjrekar Border Gavaskar Trophy, IND vs AUS: Sanjay Manjrekar said that Virat Kohli and Rohit Sharma should play county cricket to make a strong case for themselves before the Test series against England later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-out-of-manchester-united-trip-to-liverpool-illness-2659782-2025-01-04",
      "headline": "Marcus Rashford out of Manchester United's trip to Liverpool with illnessManchester United forward Marcus Rashford will miss Sunday's Premier League clash against leaders Liverpool at Anfield because of illness, head coach Ruben Amorim said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-and-dhanashree-verma-unfollow-each-other-spark-divorce-rumours-2659769-2025-01-04",
      "headline": "Yuzvendra Chahal and Dhanashree Verma unfollow each other, spark divorce rumoursChahal and Dhanashree's rumored split has left fans stunned. Reports of divorce, fuelled by their Instagram activity and deleted posts, signal an end to their once-adored love story. Neither has addressed the speculation, keeping fans guessing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prasidh-krishna-credits-bowling-coach-morne-morkel-after-three-scalps-at-scg-2659756-2025-01-04",
      "headline": "Prasidh Krishna credits bowling coach Morne Morkel after three scalps at SCGPrasidh Krishna's adaptability and crucial scalps at SCG kept India in contention against Australia. The pacer credited bowling coach Morne Morkel's guidance and shared how tactical adjustments during lunch helped him fine-tune his performance on a challenging track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-sydney-knock-critics-x-factor-attack-test-cricket-2659751-2025-01-04",
      "headline": "Maverick Sydney Test knock shows why Rishabh Pant shouldn't be tamedRishabh Pant's electrifying 33-ball 61 on Day 2 of the Sydney Test was a masterclass in counter-attacking cricket, reigniting India's hopes of retaining the Border-Gavaskar Trophy. With audacious stroke play and fearless intent, Pant reminded his critics that he cannot be tamed.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sydney-test-border-gavaskar-trophy-india-vs-australia-highest-run-chase-2659749-2025-01-04",
      "headline": "What is the highest successful run-chase in Sydney Tests?Border Gavaskar Trophy, IND vs AUS: India are leading by 145 runs in the second innings at Stumps on Day 2 of the New Year's Test, but how much do they need to make sure that Australia are out of the game completely?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sydney-test-sunil-gavaskar-slams-double-standards-after-15-wicket-day-2659745-2025-01-04",
      "headline": "AUS vs IND: Sunil Gavaskar slams double standards after 15-wicket day at SCGFormer India captain Sunil Gavaskar slammed Australian and English cricketers following the dramatic fall of 15 wickets on Day 2 of the Sydney Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharmas-mai-kahin-nahi-jaara-remark-leaves-irfan-in-splits-2659743-2025-01-04",
      "headline": "Watch: Rohit Sharma's 'I am not going anywhere' remark leaves Irfan in splitsRohit Sharma shut down retirement rumours with humour and honesty, declaring, \"Main kahin nahi jaa raha.\" His candid remarks on stepping down for form and prioritising the team left fans, Irfan Pathan, and Jatin Sapru in splits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-sydney-knock-critics-x-factor-attack-test-cricket-2659751-2025-01-04",
      "headline": "Maverick Sydney Test knock shows why Rishabh Pant shouldn't be tamedRishabh Pant's electrifying 33-ball 61 on Day 2 of the Sydney Test was a masterclass in counter-attacking cricket, reigniting India's hopes of retaining the Border-Gavaskar Trophy. With audacious stroke play and fearless intent, Pant reminded his critics that he cannot be tamed.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sydney-test-border-gavaskar-trophy-india-vs-australia-highest-run-chase-2659749-2025-01-04",
      "headline": "What is the highest successful run-chase in Sydney Tests?Border Gavaskar Trophy, IND vs AUS: India are leading by 145 runs in the second innings at Stumps on Day 2 of the New Year's Test, but how much do they need to make sure that Australia are out of the game completely?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sydney-test-sunil-gavaskar-slams-double-standards-after-15-wicket-day-2659745-2025-01-04",
      "headline": "AUS vs IND: Sunil Gavaskar slams double standards after 15-wicket day at SCGFormer India captain Sunil Gavaskar slammed Australian and English cricketers following the dramatic fall of 15 wickets on Day 2 of the Sydney Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharmas-mai-kahin-nahi-jaara-remark-leaves-irfan-in-splits-2659743-2025-01-04",
      "headline": "Watch: Rohit Sharma's 'I am not going anywhere' remark leaves Irfan in splitsRohit Sharma shut down retirement rumours with humour and honesty, declaring, \"Main kahin nahi jaa raha.\" His candid remarks on stepping down for form and prioritising the team left fans, Irfan Pathan, and Jatin Sapru in splits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-andrew-mcdonald-surprised-sydney-2659726-2025-01-04",
      "headline": "Rishabh Pant's knock in first innings surprised us, says Andrew McDonaldBorder Gavaskar Trophy, AUS vs IND: Andrew McDonald said that Rishabh Pant's knock in the first innings surprised him, but he wasn't taken aback by the 61-run knock in the second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-sydney-test-day-2-andrew-mcdonald-press-conference-2659720-2025-01-04",
      "headline": "India would need new plan if Jasprit Bumrah is not there on Day 3: Australia coachAustralia coach Andrew McDonald said the Indian team would have to come up with a new plan if Jasprit Bumrah does not participate any further in the ongoing Sydney Test. Responding to Jasprit Bumrah's niggle, McDonald said, \"He is a threat any time. And, yeah, if he isn't there, then India would have to come up with a new plan.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-pak-ryan-rickleton-scores-fastest-double-ton-for-south-africa-in-17-years-2659719-2025-01-04",
      "headline": "SA vs PAK: Ryan Rickleton scores fastest double ton for South Africa in 17 yearsRyan Rickelton's stunning knock in Cape Town made him South Africa's fastest double-centurion in 17 years. Opening for the first time, he showcased brilliance, resilience, and flair, cementing his place among cricket's elite with a historic knock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-prasidh-krishna-sydney-test-variable-bounce-scg-2659709-2025-01-04",
      "headline": " Prasidh Krishna explains how SCG's variable bounce will help India India pacer Prasidh Krishna believes the unpredictable nature of the SCG pitch will keep India in contention, as the variable bounce is likely to make batting difficult for Australia in the fourth innings."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}