{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-rate-cut-rbi-action-indian-economy-stock-market-impact-3-things-to-know-2696174-2025-03-20",
      "headline": "Will US Fed's rate pause derail RBI's liquidity easing plans?With the US Fed on hold, will RBI ease further? After cutting the repo rate to 6.25% last month, the first in nearly five years, markets are watching for the central bank's next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-it-stocks-rising-today-reason-infosys-wipro-hcltech-tcs-us-fed-interest-decision-2696166-2025-03-20",
      "headline": "Infosys, TCS, HCLTech gain up to 2%: Why are IT stocks rising today?IT sector stocks showcased strong performance in early trade with the Nifty IT index surging 1.56% as of 10 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tvs-motor-share-price-rising-company-board-interim-dividend-record-date-2696163-2025-03-20",
      "headline": "TVS Motor shares rise as board to consider interim dividend today. Check detailsTVS Motor shares were trading marginally higher in early trade as investors await today's board meeting to consider an interim dividend for FY25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-falls-reports-regulatory-scrutiny-ev-scooter-registrations-mismatch-2696157-2025-03-20",
      "headline": "Ola Electric share price falls after reports of regulatory scrutiny. Details hereOla Electric shares were trading 1.49% lower at Rs 53.02 on the Bombay Stock Exchange (BS) at 9:53 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-jumps-500-points-nifty-gains-momentum-what-investors-can-expect-2696154-2025-03-20",
      "headline": "Sensex jumps 500 points: Why stock market is rising todayBSE, NSE today: By 10:52 am, the S&P BSE Sensex was up 396.37 points at 75,845.42, while the NSE Nifty50 jumped 126.30 points to 23,033.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-nearly-400-points-nifty-hits-23000-it-stocks-rebound-2696134-2025-03-20",
      "headline": "Sensex, Nifty rally in early trade as US Fed holds rates; IT stocks lead chargeThe S&P BSE Sensex gained 415.38 points to 75,864.43, while the NSE Nifty50 added 116.55 to 23,024.15 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-likely-to-fall-today-after-fresh-regulatory-probe-over-vehicle-registrations-2696132-2025-03-20",
      "headline": "Ola Electric shares likely to be in focus today. Here's whyOla Electric Mobility's share price is down 38% this year, over 40% since listing, and 13% in a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-nse-bse-opening-today-march-20-will-dalal-street-react-to-us-fed-interest-rate-decision-2696115-2025-03-20",
      "headline": "Sensex, Nifty opening today: Will market react to US Fed interest rate decision?Sensex, Nifty today: Dalal Street is expected to react to the US Federal Reserve's decision to keep interest rates unchanged while maintaining its projection for rate cuts later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-march-20-wipro-ceat-hyundai-adani-enterprises-dmart-trent-hyundai-motor-2696105-2025-03-20",
      "headline": "Stocks to watch on March 20: Wipro, CEAT, Hyundai, Adani EnterprisesIn today's trading session, shares of Adani Enterprises, Wipro, Raymond, DMart, Trent, Hyundai Motor, NHPC, and others will be in focus due to key developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-keeps-interest-rates-unchanged-key-takeaways-from-the-meeting-inflation-trump-tariff-growth-2696097-2025-03-20",
      "headline": "US Fed keeps interest rates unchanged: Key takeaways from the meetingThe Federal Open Market Committee (FOMC) voted to keep interest rates unchanged, maintaining its benchmark rate in the range of 4.25-4.50%. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ripple-ceo-claims-us-sec-to-drop-appeal-against-crypto-firm-glbs-2695970-2025-03-19",
      "headline": "Ripple CEO claims US SEC to drop appeal against crypto firmRipple CEO, the company behind XRP, announced on X that the US Securities and Exchange Commission will drop its appeal against Ripple Labs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-higher-ahead-of-fed-announcement-glbs-2695949-2025-03-19",
      "headline": "Wall Street drifts higher ahead of Fed announcementUS stocks showed marginal gains on Wednesday morning as Wall Street waits for the Federal Reserve's announcement."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/officer-on-duty-netflix-kunchacko-boban-film-2696201-2025-03-20",
      "headline": "Officer on Duty on OTT: Story, cast and all we know about Kunchako Boban's filmMalayalam film Officer on Duty, featuring Kunchacko Boban, received rave reviews from critics and audiences alike.  The film is streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lisa-ray-accuses-air-india-of-refusing-medical-waiver-for-her-92-year-old-father-2696193-2025-03-20",
      "headline": "Where is the empathy? Actor slams Air India after father denied medical waiverActor Lisa Ray called out Air India for denying a medical waiver to her 92-year-old father despite a doctor's certificate. The airline responded, saying they would review the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-on-hema-malini-advice-on-love-and-romance-after-divorce-2696172-2025-03-20",
      "headline": "We all want that feeling: Esha Deol on Hema Malini's advice on love and romanceActor Esha Deol shared Hema Malini's advice on romance and financial independence, stressing the importance of self-identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-nadaaniyan-perfect-punishment-saif-ali-khan-attacker-comedian-2696149-2025-03-20",
      "headline": "Ibrahim's Nadaaniyan, a 'perfect punishment' for Saif's attacker, says comedianStandup comedian Pranit More mocked Ibrahim Ali Khan's Nadaaniyan, saying Saif Ali Khan's attacker should be punished by watching it twice. He also joked about Khushi Kapoor ruining co-stars' images."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-review-a-nightmarish-show-so-brilliant-it-haunts-you-2696050-2025-03-20",
      "headline": "Adolescence review: A nightmarish show so brilliant, it haunts youReleased-Fri Mar 14, 2025'Adolescence' is set in a UK town and yet the story doesn't feel distant, unlikely or alien. The new Netflix miniseries is here to stay with its heart-wrenching and mind-numbingly honest performances and narrative. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-trailer-mohanlal-savour-stephen-nedumpally-khureshi-abraam-prithviraj-sukumaran-drama-2696131-2025-03-20",
      "headline": "L2 Empuraan trailer: Mohanlal rises again as saviour in Prithviraj's explosive dramaThe much-awaited trailer of director Prithviraj Sukumaran's L2: Empuraan was released in the early hours of March 20. The under four-minute trailer highlights Mohanlal's return as the saviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-release-date-salman-khan-2696127-2025-03-20",
      "headline": "Salman Khan's Sikandar skips Friday, set for a rare Sunday release like Tiger 3Salman Khan's Sikandar will release on March 30, a Sunday, breaking the usual Friday trend. Directed by AR Murugadoss, the film also stars Rashmika Mandanna and Kajal Aggarwal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-murugadoss-teases-sikandars-surprise-element-compares-it-to-aamir-khans-ghajini-2696118-2025-03-20",
      "headline": "AR Murugadoss teases Sikandar's 'surprise element', compares it to Aamir's GhajiniDirector AR Murugadoss teases Sikandar's emotional core, comparing it to Ghajini. He hints at a surprise element in the Salman Khan-starrer, releasing on March 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-solo-trek-odisha-deomali-trailer-littered-2696087-2025-03-20",
      "headline": "SS Rajamouli treks solo at Odisha's highest peak, calls out public for litteringFilmmaker SS Rajamouli went on a solo trek on the Deomali trail, the highest peak in Odisha. He highlighted the littered trail and urged the citizens to carry back their waste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/victoria-beckhams-stunning-wedding-dress-for-nicole-brydon-bloom-unveiled-glbs-2696074-2025-03-20",
      "headline": "Victoria Beckham's stunning wedding dress for Nicole Brydon Bloom unveiledVictoria Beckham crafted a custom lace wedding dress for Nicole Brydon Bloom, featuring hand-sewn floral details. The gown debuted at Bloom and Justin Theroux's beach wedding, showcasing Beckham's timeless design aesthetic.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/punisher-returns-in-daredevil-born-again-for-explosive-showdown-glbs-2696073-2025-03-20",
      "headline": "Punisher returns in 'Daredevil: Born Again' for explosive showdownFrank Castle, aka the Punisher, returns in Daredevil: Born Again, sparking a tense confrontation with Matt Murdock amid an ongoing murder investigation. Meanwhile, new suspects emerge in White Tiger's death.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/why-heather-thomas-left-hollywood-the-stalker-nightmare-that-drove-her-away-glbs-2696066-2025-03-20",
      "headline": "Why Heather Thomas left Hollywood: The stalker nightmare that drove her awayHeather Thomas left Hollywood after enduring stalkers, break-ins, and death threats. She revealed the harrowing experiences that forced her into hiding and the challenges women face in the entertainment industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kelly-clarkson-returns-to-talk-show-after-two-week-absence-heres-why-glbs-2696072-2025-03-20",
      "headline": "Kelly Clarkson returns to talk show after two-week absence – Here's whyKelly Clarkson returned to The Kelly Clarkson Show after a two-week absence due to a personal issue. Guest hosts covered for her, and she is now preparing for her Las Vegas residency.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/severance-season-2-finale-release-date-runtime-what-to-expect-glbs-2694912-2025-03-17",
      "headline": "Severance Season 2 Finale: Release date, runtime & what to expectThe Severance Season 2 finale airs March 20 on Apple TV+. With its sci-fi corporate thriller concept and gripping plot, the show remains a fan favorite. Season 3 is already in development.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kevin-hart-becomes-worlds-highest-paid-comedian-in-2024-earning-81-million-glbs-2695472-2025-03-18",
      "headline": "Kevin Hart becomes World's highest-paid comedian in 2024, earning $81 millionKevin Hart became the world's highest-paid comedian in 2024, earning $81 million. His diversified portfolio—including films, streaming series, stand-up, and endorsements—helped him surpass stars like Jerry Seinfeld, Tom Cruise, and Hugh Jackman.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/taylor-swift-teases-reputation-era-fans-decode-snake-necklace-at-iheart-awards-2025-glbs-2695486-2025-03-18",
      "headline": "Taylor Swift teases Reputation era? Fans decode snake necklace at iHeart Awards 2025Taylor Swift made a surprise virtual appearance at the iHeartRadio Music Awards 2025, sparking speculation about Reputation (Taylor's Version) after wearing a snake choker, a nod to her iconic 2017 album.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mariah-carey-and-anderson-paak-dating-iheartradio-music-awards-appearance-sparks-rumours-glbs-2695495-2025-03-18",
      "headline": "Mariah Carey and Anderson .Paak Dating? iHeartRadio Music awards appearance sparks rumoursMariah Carey and Anderson .Paak reignite dating rumours after attending the 2025 iHeartRadio Music Awards together. Meanwhile, Mariah's speech references her past with Tommy Mottola, sparking further discussion about her early career struggles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-wick-ballerina-trailer-ana-de-armas-faces-off-keanu-reeves-2696002-2025-03-19",
      "headline": "John Wick Ballerina trailer: Ana de Armas faces off Keanu ReevesThe second trailer of the highly anticipated John Wick spin-off, Ballerina, is here. And it promises loads of action and thrill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-ajay-devgn-link-up-rumour-weird-respect-admiration-2695985-2025-03-19",
      "headline": "Esha Deol on link-up rumours with Ajay Devgn: That was so weirdEsha Deol discussed past link-up rumours, including those with Ajay Devgn. She said it was weird and said their bond was more about respect and admiration for each other."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-meerut-woman-muskan-rastogi-killed-husband-lover-help-mislead-holi-texts-posing-as-him-2696184-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP woman who killed husband misled his family by sending texts posing as himThe Meerut woman, who allegedly killed her husband with the help of her lover, misled the family of the victim by sending texts from his phone posing as him. She sent Holi greetings to her husband's sister and also spoke to her regarding plans for the festival."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-student-in-us-accused-of-hamas-ties-detained-set-to-be-deported-trump-crackdown-2696106-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian student in US detained, faces deportation over alleged Hamas tiesThe Donald Trump administration has detained an Indian national and postdoctoral fellow, Badar Khan Suri, over allegations of spreading antisemitism and having ties to Hamas. Suri's plea said that he was being targeted because of his wife's Palestinian origins."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-woman-body-tied-to-rock-found-in-canal-strangled-friend-seemapuri-2696194-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman strangled by friend, body tied to a rock, dumped in Delhi canalThe body of the woman, named Komal, was found in the Chhawla canal in Delhi's Seemapuri on March 17, five days since she went missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elon-musk-ai-chatbot-grok-india-abuses-hindi-slang-2696141-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's AI bot Grok under Centre's scrutiny over use of Hindi slang: SourcesThe Information and Technology Ministry has expressed concerns with X over the use of such provocative language by Grok and will look into the factors leading to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/obc-quota-abused-muslims-west-bengal-will-conduct-fresh-survey-mamata-banerjee-reservation-2696177-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Was OBC quota abused for Muslims? Bengal says will conduct fresh surveyThe West Bengal government told the Supreme Court it would conduct a fresh OBC survey in three weeks. Controversy erupted over the inclusion of several Muslim communities, with the High Court noting religion seemed the sole criterion. The Mamata Banerjee-led government now faces scrutiny over its next move."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/varanasi-woman-new-boyfriend-kills-ex-lover-up-murder-cctv-arrested-2696142-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Month-long plan, murder on camera: UP woman kills ex-lover with boyfriend's helpCCTV footage showed the accused on a motorcycle, chasing victim Diljit, who was on a scooter on the night of Holi. Rajkumar then opened fire and killed Diljit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/conservationist-behind-pm-modis-project-cheetah-found-dead-in-saudi-flat-2696200-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Conservationist behind PM Modi's Project Cheetah found dead in Saudi flatVincent van der Merwe was in charge of getting the cheetahs brought from South Africa and Namibia acclimatised to Indian conditions. Despite the challenges and legal barriers involved in re-introducing the African cheetahs to Kuno National Park, he also expressed strong faith in the project."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-feels-he-rules-the-world-there-a-ketamine-drug-link-depression-trump-administration-space-x-special-k-2695865-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk feels he rules the world. Is there a ketamine drug link?Tesla boss Elon Musk seems to be on a mission to conquer the world, and even Mars. But his odd-hour rants, alleged Nazi salute and chainsaw act have raised eyebrows. Some now wonder if this has to do with ketamine, which he takes for his depression treatment. This is what ketamine is, and what its overuse could lead to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lisa-ray-accuses-air-india-of-refusing-medical-waiver-for-her-92-year-old-father-2696193-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where is the empathy? Actor slams Air India after father denied medical waiverActor Lisa Ray called out Air India for denying a medical waiver to her 92-year-old father despite a doctor's certificate. The airline responded, saying they would review the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-white-house-tammy-bruce-spy-chief-tulsi-gabbard-minorities-violence-remarks-bangladesh-welcome-2696084-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US responds after Bangladesh slams Tulsi Gabbard over minority persecution remarkAmid a controversy over US spy chief Tulsi Gabbard's remarks on minority persecution in Bangladesh, the White House appeared to tone down its criticism of Dhaka, saying it welcomed measures by the Muhammad Yunus-led interim government to ensure the safety of all."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-ground-operations-gaza-airstrikes-idf-ceasefire-hamas-hostages-2696100-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel begins ground assault in Gaza, captures key corridor: This is last warningGround operations in central and southern Gaza came a day after Israel launched aerial bombardment of the strip, reportedly killing over 400 people and shattering a two-month-old ceasefire deal with Hamas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/story/bcci-champions-trophy-indian-team-cash-reward-2696185-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BCCI honours Champions Trophy-winning Indian team with cash reward of Rs 58 croreThe Board of Control for Cricket in India has announced a cash prize of Rs 58 crore for the Indian team that recently won the Champions Trophy after beating New Zealand in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/india-textile-art-india-art-fair-india-design-id-2695631-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rise or resurgence? Textile art in India goes mainstreamKnown fashion labels like Tarun Tahiliani, Pero and Anavila at art and home decor exhibitions? It certainly says something about the rise...errr... resurgence of textile art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/mamata-nod-five-years-late-yet-why-bengal-will-cheer-ongc-oil-project-2695340-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mamata nod five years late, yet why Bengal will cheer ONGC oil projectThe mega oil drilling in Ashoknagar in North 24 Parganas promises to give the state's energy sector a big boost by unlocking the potential of long-identified reserves\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-detained-punjab-haryana-bulldozer-protest-sites-jagjit-dallewal-2696181-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "500-700 farmers detained in Punjab, bulldozers in Haryana to clear barricadesThe Punjab police detained the top leadership behind the farmer protests while uprooting the dharnas at both Shambhu and Khanauri border protest sites. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-thinks-india-may-cut-tariffs-but-keeps-reciprocal-duties-threat-alive-2696173-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump thinks India may cut tariffs, but keeps reciprocal duties threat aliveDonald Trump's recent remarks on matching India's tariffs came amid ongoing negotiations, with India denying any commitments and reportedly seeking time until September 2025 to address the US concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-release-date-salman-khan-2696127-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's Sikandar skips Friday, set for a rare Sunday release like Tiger 3Salman Khan's Sikandar will release on March 30, a Sunday, breaking the usual Friday trend. Directed by AR Murugadoss, the film also stars Rashmika Mandanna and Kajal Aggarwal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-oral-health-crisis-why-millions-suffer-from-preventable-dental-diseases-tooth-decay-gum-disease-2696175-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's oral health crisis: Why millions suffer from preventable dental diseasesDoctors believe that a lack of awareness, inadequate preventive measures, and limited access to affordable dental care are certain challenges that need to be addressed urgently to lower this burden of oral diseases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-sanju-samson-captaincy-rajasthan-royals-2696191-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Riyan Parag to captain Rajasthan in 1st 3 games, injury concern for Sanju SamsonIPL 2025: Sanju Samson on Thursday, March 20, confirmed he will not lead Rajasthan Royals in the first three games of the season. Riyan Parag has been named their stand-in captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-solo-trek-odisha-deomali-trailer-littered-2696087-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SS Rajamouli treks solo at Odisha's highest peak, calls out public for litteringFilmmaker SS Rajamouli went on a solo trek on the Deomali trail, the highest peak in Odisha. He highlighted the littered trail and urged the citizens to carry back their waste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-narine-kkr-mvp-multiverse-mumbai-indians-2696169-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL Multiverse: What if Sunil Narine became Mumbai's MVP instead of Kolkata?Sunil Narine is considered as Mr. KKR when it comes to the IPL as he has helped them win 3 titles. But what would have happened if MI had outbid KKR in 2012 to win the services of the mystery spinner?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-mohammad-kaif-biopic-lion-2696156-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hardik Pandya faced mental torture, fought fiercely: Kaif calls for biopicIPL 2025: Former cricketer Mohammad Kaif praised Hardik Pandya for battling the odds and making a strong comeback after facing harsh criticism. After winning the Men's T20 World Cup last year, Hardik helped India win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-violence-police-maharashtra-cyber-cell-no-cloth-religious-text-burnt-online-objectionable-posts-identified-crackdown-2696139-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nagpur violence: Cops say no religious text burnt, crackdown on provocative postsPolice have said no cloth with religious text was burnt during a right-wing agitation in Nagpur on March 17 and that over 140 objectionable online posts have been identified for inciting communal unrest in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-nadaaniyan-perfect-punishment-saif-ali-khan-attacker-comedian-2696149-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ibrahim's Nadaaniyan, a 'perfect punishment' for Saif's attacker, says comedianStandup comedian Pranit More mocked Ibrahim Ali Khan's Nadaaniyan, saying Saif Ali Khan's attacker should be punished by watching it twice. He also joked about Khushi Kapoor ruining co-stars' images."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/officer-on-duty-netflix-kunchacko-boban-film-2696201-2025-03-20",
      "headline": "Officer on Duty on OTT: Story, cast and all we know about Kunchako Boban's filmMalayalam film Officer on Duty, featuring Kunchacko Boban, received rave reviews from critics and audiences alike.  The film is streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lisa-ray-accuses-air-india-of-refusing-medical-waiver-for-her-92-year-old-father-2696193-2025-03-20",
      "headline": "Where is the empathy? Actor slams Air India after father denied medical waiverActor Lisa Ray called out Air India for denying a medical waiver to her 92-year-old father despite a doctor's certificate. The airline responded, saying they would review the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-on-hema-malini-advice-on-love-and-romance-after-divorce-2696172-2025-03-20",
      "headline": "We all want that feeling: Esha Deol on Hema Malini's advice on love and romanceActor Esha Deol shared Hema Malini's advice on romance and financial independence, stressing the importance of self-identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-nadaaniyan-perfect-punishment-saif-ali-khan-attacker-comedian-2696149-2025-03-20",
      "headline": "Ibrahim's Nadaaniyan, a 'perfect punishment' for Saif's attacker, says comedianStandup comedian Pranit More mocked Ibrahim Ali Khan's Nadaaniyan, saying Saif Ali Khan's attacker should be punished by watching it twice. He also joked about Khushi Kapoor ruining co-stars' images."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-sanju-samson-captaincy-rajasthan-royals-2696191-2025-03-20",
      "headline": "Riyan Parag to captain Rajasthan in 1st 3 games, injury concern for Sanju SamsonIPL 2025: Sanju Samson on Thursday, March 20, confirmed he will not lead Rajasthan Royals in the first three games of the season. Riyan Parag has been named their stand-in captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/story/bcci-champions-trophy-indian-team-cash-reward-2696185-2025-03-20",
      "headline": "BCCI honours Champions Trophy-winning Indian team with cash reward of Rs 58 croreThe Board of Control for Cricket in India has announced a cash prize of Rs 58 crore for the Indian team that recently won the Champions Trophy after beating New Zealand in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-narine-kkr-mvp-multiverse-mumbai-indians-2696169-2025-03-20",
      "headline": "IPL Multiverse: What if Sunil Narine became Mumbai's MVP instead of Kolkata?Sunil Narine is considered as Mr. KKR when it comes to the IPL as he has helped them win 3 titles. But what would have happened if MI had outbid KKR in 2012 to win the services of the mystery spinner?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-freedom-no-discrimination-title-2696167-2025-03-20",
      "headline": "KKR eye fourth title with 'freedom and no discrimination' philosophyIPL 2025: Kolkata Knight Riders (KKR) will defend their title as they get set to face Rajat Patidar's Royal Challengers Bengaluru (RCB) in the tournament opener on Saturday at the Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-mohammad-kaif-biopic-lion-2696156-2025-03-20",
      "headline": "Hardik Pandya faced mental torture, fought fiercely: Kaif calls for biopicIPL 2025: Former cricketer Mohammad Kaif praised Hardik Pandya for battling the odds and making a strong comeback after facing harsh criticism. After winning the Men's T20 World Cup last year, Hardik helped India win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreya-ghoshal-disha-patani-karan-aujla-opening-ceremony-2696128-2025-03-20",
      "headline": "Shreya Ghoshal, Disha Patani, Karan Aujla to light up opening ceremonyShreya Ghoshal, Disha Patani, and Karan Aujla will perform in the opening ceremony of the IPL 2025 before the clash between Kolkata Knight Riders and Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/swiss-open-2025-kidambi-srikanth-hs-prannoy-isharani-2696114-2025-03-20",
      "headline": "Kidambi Srikanth ousts HS Prannoy, Isharani Barua pulls off major upsetSwiss Open 2025: Kidambi Srikanth advanced to the second round after beating compatriot HS Prannoy while World No.78 Isharani Barua got the better of Aakarshi Kashyap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-robin-uthappa-csk-fastest-wicketkeeper-2696096-2025-03-20",
      "headline": "Dhoni still has the fastest hands in the world as a wicketkeeper: UthappaIPL 2025: Robin Uthappa said that MS Dhoni is amongst the best wicketkeepers in the world even at the age of 43 and one could expect glimpses of brilliance from the former CSK captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-curtain-raiser-18th-for-virat-last-for-msd-sledging-room-s2-ep-81-2696042-2025-03-20",
      "headline": "Is IPL more vibes than cricket? | Sledging Room, S2, Ep 81The new season of the Indian Premier League is upon us, and it is set to start on March 21. With games set to come at us thick and fast, we at the Sledging Room thought that this was the best time to shift to a new and updated studio to bring you the best moments of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/clemson-nearing-contract-extension-for-head-coach-brad-brownell-glbs-2696058-2025-03-19",
      "headline": "Clemson Nearing contract extension for head coach Brad BrownellClemson is reportedly finalizing a deal to extend Brad Brownell's tenure, keeping the longtime head coach at the helm as the Tigers aim to build on recent success in the ACC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/juju-watkins-hannah-hidalgo-lead-ap-womens-all-america-team-glbs-2696055-2025-03-19",
      "headline": "JuJu Watkins, Hannah Hidalgo lead AP Women's All-America teamUSC's JuJu Watkins and Notre Dame's Hannah Hidalgo headline the AP All-America squad, joined by Paige Bueckers, Lauren Betts, and Madison Booker in a star-studded lineup of elite talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/swiss-open-2025-kidambi-srikanth-hs-prannoy-isharani-2696114-2025-03-20",
      "headline": "Kidambi Srikanth ousts HS Prannoy, Isharani Barua pulls off major upsetSwiss Open 2025: Kidambi Srikanth advanced to the second round after beating compatriot HS Prannoy while World No.78 Isharani Barua got the better of Aakarshi Kashyap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-robin-uthappa-csk-fastest-wicketkeeper-2696096-2025-03-20",
      "headline": "Dhoni still has the fastest hands in the world as a wicketkeeper: UthappaIPL 2025: Robin Uthappa said that MS Dhoni is amongst the best wicketkeepers in the world even at the age of 43 and one could expect glimpses of brilliance from the former CSK captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-curtain-raiser-18th-for-virat-last-for-msd-sledging-room-s2-ep-81-2696042-2025-03-20",
      "headline": "Is IPL more vibes than cricket? | Sledging Room, S2, Ep 81The new season of the Indian Premier League is upon us, and it is set to start on March 21. With games set to come at us thick and fast, we at the Sledging Room thought that this was the best time to shift to a new and updated studio to bring you the best moments of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/clemson-nearing-contract-extension-for-head-coach-brad-brownell-glbs-2696058-2025-03-19",
      "headline": "Clemson Nearing contract extension for head coach Brad BrownellClemson is reportedly finalizing a deal to extend Brad Brownell's tenure, keeping the longtime head coach at the helm as the Tigers aim to build on recent success in the ACC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/juju-watkins-hannah-hidalgo-lead-ap-womens-all-america-team-glbs-2696055-2025-03-19",
      "headline": "JuJu Watkins, Hannah Hidalgo lead AP Women's All-America teamUSC's JuJu Watkins and Notre Dame's Hannah Hidalgo headline the AP All-America squad, joined by Paige Bueckers, Lauren Betts, and Madison Booker in a star-studded lineup of elite talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/can-ai-crack-march-madness-code-one-disruptor-bets-1-million-on-yes-glbs-2696046-2025-03-19",
      "headline": "Can AI crack March Madness code? one disruptor bets $1 Million on 'Yes'A Houston-based innovator is wagering big on AI's predictive power, investing $1 million in an algorithm-driven bracket to outsmart the competition in this year's NCAA tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfljalen-milroe-impresses-at-pro-day-blazes-40-with-steelers-watching-closely-glbs-2696044-2025-03-19",
      "headline": "Jalen Milroe impresses at Pro Day, blazes 40 with Steelers watching closelyAlabama quarterback Jalen Milroe turned heads with his blazing 40-yard dash at pro day, showcasing elite speed as Pittsburgh Steelers scouts watched closely ahead of the NFL Draft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nhl-set-for-cba-talks-weighs-next-all-star-game-plans-glbs-2696040-2025-03-19",
      "headline": "NHL set for CBA Talks, weighs next All-Star game plansAs the NHL prepares for labor discussions, league officials and players' representatives will also consider potential changes to the next All-Star Game, aiming to enhance the fan experience and competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-cavaliers-eye-12th-straight-road-win-against-kings-glbs-2696037-2025-03-19",
      "headline": "NBA: Cavaliers eye 12th straight road win against KingsCleveland heads to Sacramento riding an 11-game road winning streak, aiming to extend their dominance away from home. The Kings, however, look to defend their turf in a crucial matchup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-vikings-confirm-jj-mccarthy-as-quarterback-glbs-2696036-2025-03-19",
      "headline": "NFL: Vikings confirm JJ McCarthy as quarterbackThe Minnesota Vikings will begin the upcoming season with JJ McCarthy as their quarterback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-to-book-chennai-super-kings-ipl-ticket-booking-2025-2696035-2025-03-19",
      "headline": "Chennai Super Kings IPL Ticket Booking 2025: Date, Price List, How to BookIPL Ticket Booking 2025, Chennai Super Kings: Tickets for CSK's match against Mumbai Indians were sold inside a few minutes of being released on March 19. Here's where you can buy your match tickets for the home games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tokyo-boy-snags-shohei-ohtanis-first-homer-of-the-season-glbs-2696031-2025-03-19",
      "headline": "Tokyo Boy Snags Shohei Ohtani's First Homer of the SeasonA lucky 10-year-old fan in Tokyo walked away with a piece of baseball history after catching Shohei Ohtani's first home run of the year, an unforgettable moment for Japan's young fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kabaddi-world-cup-controversy-england-2696026-2025-03-19",
      "headline": "Kabaddi's global body declares World Cup in UK 'unauthorised'The International Kabaddi Federation has declared that the World Cup being held in London is not an \"authorised\" event and asked the sport's Indian apex body to take action against the 'Indian' team that is participating in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-vikings-confirm-jj-mccarthy-as-quarterback-glbs-2696036-2025-03-19",
      "headline": "NFL: Vikings confirm JJ McCarthy as quarterbackThe Minnesota Vikings will begin the upcoming season with JJ McCarthy as their quarterback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-to-book-chennai-super-kings-ipl-ticket-booking-2025-2696035-2025-03-19",
      "headline": "Chennai Super Kings IPL Ticket Booking 2025: Date, Price List, How to BookIPL Ticket Booking 2025, Chennai Super Kings: Tickets for CSK's match against Mumbai Indians were sold inside a few minutes of being released on March 19. Here's where you can buy your match tickets for the home games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tokyo-boy-snags-shohei-ohtanis-first-homer-of-the-season-glbs-2696031-2025-03-19",
      "headline": "Tokyo Boy Snags Shohei Ohtani's First Homer of the SeasonA lucky 10-year-old fan in Tokyo walked away with a piece of baseball history after catching Shohei Ohtani's first home run of the year, an unforgettable moment for Japan's young fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kabaddi-world-cup-controversy-england-2696026-2025-03-19",
      "headline": "Kabaddi's global body declares World Cup in UK 'unauthorised'The International Kabaddi Federation has declared that the World Cup being held in London is not an \"authorised\" event and asked the sport's Indian apex body to take action against the 'Indian' team that is participating in the tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-mavericks-struggle-with-injury-crisis-risk-falling-below-nba-roster-limit-glbs-2696022-2025-03-19",
      "headline": "NBA: Mavericks struggle with injury crisis, risk falling below NBA roster limitThe Dallas Mavericks are facing serious injury crises, leaving the team dangerously close to violating the NBA roster requirements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-gujarat-titans-2696021-2025-03-19",
      "headline": "Not chasing elusive 300: Shubman Gill firm on GT's brand in IPL 2025Gujarat Titans are not chasing after the 300-run mark like some of the other teams in the Indian Premier League, said captain Shubman Gill ahead of the new season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lavar-ball-gets-emotional-as-he-opens-up-about-leg-amputation-glbs-2696004-2025-03-19",
      "headline": "LaVar Ball gets emotional as he opens up about leg amputationAmerican Businessman LaVar Ball, the father of NBA stars Lonzo and LaMelo Ball, spoke on his recent right leg amputation due to complications from diabetes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-history-lalit-modi-creator-bcci-2695989-2025-03-19",
      "headline": "The IPL story, Part 1: Power, politics, and cricket in its origin sagaThe Indian Premier League's origin story is one of power, politics, and ambition, driven by Lalit Modi's vision. From political maneuvering to the league's explosive rise, it set the stage for a saga of success and scandal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-maldives-sunil-chhetri-comeback-international-friendly-2695984-2025-03-19",
      "headline": "Ageless Sunil Chhetri shines as India maul Maldives 3-0 in friendlySunil Chhetri marked his international return with India's 3-0 win over Maldives, contributing to a dominant performance and showing signs of his old brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-exclusive-captains-meeting-mumbai-saliva-ban-2695974-2025-03-19",
      "headline": "IPL captains' meet: Saliva ban on agenda, BCCI leaves decision to skippersIPL 2025: The Board of Control for Cricket in India has allowed the captains of the 10 teams to discuss and decide if the saliva ban should be lifted. Cricketers have been banned from using saliva to maintain the shine of the ball since Covid-19 pandemic. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-is-exhausted-says-steve-kerr-as-back-injury-raises-concern-glbs-2695978-2025-03-19",
      "headline": "NBA: Stephen Curry is exhausted, says Steve Kerr as back injury raises concernGolden State Warriors guard Stephen Curry is battling with both fatigue and a back injury that raises concern for the Warriors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-narine-open-batting-kkr-team-2695973-2025-03-19",
      "headline": "Sunil Narine hints at rekindling love affair with opener's slotKKR talisman Sunil Narine wants to open the innings for his franchise once again. Speaking ahead of the opener, Narine has hoped that he would open alongside Quinton de Kock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-schedule-fixtures-dates-2695950-2025-03-19",
      "headline": "Chennai Super Kings IPL 2025 Complete Schedule: Fixtures, Venues, Match DatesChennai Super Kings IPL 2025 Full Schedule, CSK Squad: The Ruturaj Gaikwad-led team finished 5th in the last season's competition. Will they be able to better their position with a revamped squad?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suresh-raina-on-ms-dhoni-ad-shoots-helicopter-2695946-2025-03-19",
      "headline": "MS Dhoni and I would cancel ad shoots to join CSK camp early: Suresh RainaIPL 2025: Suresh Raina highlighted how MS Dhoni had begun training for the IPL 2025 season as early as February, recalling their pre-season routines from his own time as a Super Kings player. Raina backed Dhoni's helicopters to land as frequently as ever in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-maldives-today-football-match-live-score-updates-sunil-chhetri-2695882-2025-03-19",
      "headline": "India vs Maldives, Highlights: Chhetri, Bheke Colaco hand hosts 3-0 winIndia vs Maldives, football Full Time: Sunil Chhetri scores on comeback as India beat Maldives 3-0 in Shillong on Wednesday, March 19."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-cobrin-bosch-psl-snub-reason-mumbai-indians-2695812-2025-03-19",
      "headline": "Did not mean to disrespect PSL: Corbin Bosch explains snub decisionCorbin Bosch clarified his decision to withdraw from PSL 2025 to join Mumbai Indians in IPL 2025, citing career prospects and global exposure as key factors."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}