{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/wipro-share-price-4-percent-rise-q1-results-revenue-guideline-2757688-2025-07-18",
      "headline": "Explained: Why Wipro shares gained as much as 4% todayThe fourth-largest IT services company in India posted an 11% jump in net profit and a 0.8% rise in revenue—both slightly ahead of market expectations, according to estimates compiled by LSEG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-fd-or-mf-edelweiss-radhika-gupta-shares-3-golden-rules-before-you-invest-2757663-2025-07-18",
      "headline": "Stocks, FD or MF? Edelweiss' Radhika Gupta shares 3 golden rules before you investBefore you begin investing, know how saving and investing are different. Saving keeps your money handy for emergencies or short-term plans, while investing helps it grow for bigger future goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-axis-bank-results-weak-banking-shares-falls-2757662-2025-07-18",
      "headline": "Sensex tumbles over 600 points: Why is stock market falling today?The 30-share BSE Sensex tumbled 644.99 points to 81,614.25 around 12:19 pm, while the NSE Nifty 50 fell 191.30 points to 24,920.15. Losses were broad-based, with most of the major sectoral indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-online-filing-live-are-you-eligible-and-what-has-changed-income-tax-2757598-2025-07-18",
      "headline": "ITR-2 online filing live: Know who can file, new changes and other detailsThis year, the ITR-2 form has a few important changes that every taxpayer should know. You now have to report your long-term capital gains separately for periods before and after July 23, 2024, as new indexation and tax rules apply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-teasing-new-solo-music-instagram-comeback-fans-think-so-2758172-2025-07-19",
      "headline": "Is BTS' Jungkook teasing new solo music in cryptic Instagram post? Fans think soBTS member Jungkook made a surprising return to Instagram, unveiling his new handle during a live session with fellow bandmates RM and V. The singer shared his first post under the new username, leaving fans buzzing with speculation about a possible music comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-injured-during-shoot-of-next-release-king-while-attempting-action-sequence-sources-2758171-2025-07-19",
      "headline": "Shah Rukh Khan sustains injury on King sets while filming action sequence: SourcesShah Rukh Khan recently sustained a minor back injury during the shoot of his upcoming film 'King', causing a delay in the production schedule with filming now set to resume in September. Despite the setback, SRK is recuperating well in the UK with his family, and fans remain eager for the film's release featuring a star-studded cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/junior-review-kireeti-reddy-sreeleela-film-is-a-jack-of-all-but-king-of-none-2758167-2025-07-19",
      "headline": "Junior review: Kireeti Reddy's film is a jack of all but king of noneRelease Date:Sat Jul 19, 2025'Junior' film review: This bilingual family drama stars debutant Kireeti Reddy in the lead alongside Genelia Deshmukh and V Ravichandran. While the film showcases all aspects required in a commercial film, there is a sense of half-baked-ness in the final product."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-elli-avram-spark-love-in-dreamy-new-track-chandaniyan-2758159-2025-07-19",
      "headline": "Ashish Chanchlani, Elli AvRam spark love in dreamy new track Chandaniyan. WatchAshish Chanchlani and Elli AvRam charm audiences with 'Chandaniyan', a romantic track that beautifully portrays the joy and pain of loving from afar. Their undeniable chemistry in the music video has sparked fan rumours of a real-life romance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/blue-dragon-series-awards-winners-full-list-iu-ju-ji-hoon-when-life-give-you-tangerines-2758155-2025-07-19",
      "headline": "Blue Dragon Series Awards: IU, Ju Ji Hoon, When Life Gives You... win top prizesKorean stars IU, Park Bo Gum, Hyeri, and Choo Young Woo were among the biggest winners at the 2025 Blue Dragon Series Awards. Check the full list of winners here."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sangeeta-bijlani-pune-farmhouse-vandalised-police-launch-probe-after-complaint-2758138-2025-07-19",
      "headline": "Sangeeta Bijlani's Pune farmhouse vandalised, police launch probe after complaintBollywood actor Sangeeta Bijlani's farmhouse on the outskirts of Pune was recently broken into and vandalised. The intruders caused extensive damage, leaving the upper floor of the property completely ransacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-actor-fish-venkat-dies-of-kidney-failure-at-53-2758143-2025-07-19",
      "headline": "Telugu actor Fish Venkat dies of kidney failure at 53Telugu actor Fish Venkat died at 53 after battling severe kidney failure. Known for his unique Telangana accent and memorable roles, his loss has been deeply felt by fans and colleagues alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-gupta-praises-saiyaara-ahaan-panday-aneet-padda-yrf-no-promo-strategy-can-we-learn-our-lesson-2758132-2025-07-19",
      "headline": "Sanjay Gupta praises YRF's no-promo strategy for Saiyaara: Can we learn our lessonSaiyaara's unconventional promotional strategy, avoiding typical media appearances, has sparked praise and discussion in Bollywood, especially from filmmaker Sanjay Gupta. The film's impressive Rs 20 crore Day 1 collection highlighted a successful shift towards content-focused marketing in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-undergoes-neck-angioplasty-daughter-sunaina-shares-update-2758121-2025-07-19",
      "headline": "Rakesh Roshan undergoes neck angioplasty, daughter Sunaina confirms recoveryVeteran filmmaker Rakesh Roshan, father of actor Hrithik Roshan, is on the road to recovery after undergoing a neck angioplasty. His daughter, Sunaina Roshan, has assured well-wishers that there is no cause for concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-2-promo-smriti-iranis-tulsi-virani-returns-to-shanti-niketan-2758104-2025-07-19",
      "headline": "Kyunki Saas Bhi Kabhi… 2 promo: Smriti Irani's Tulsi Virani returns to Shanti NiketanStar Plus is all set to bring back the beloved 'Kyunki Saas Bhi Kabhi Bahu Thi' with Smriti Irani reprising her iconic role as Tulsi Virani. The show will premiere on July 29 at 10:30 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanvi-the-great-box-office-day-1-anupam-kher-film-slow-start-earns-rs-40-lakh-2758093-2025-07-19",
      "headline": "Tanvi The Great box office Day 1: Slow start for Anupam Kher film, earns Rs 40 lakhAnupam Kher returned to direction with 'Tanvi The Great,' a film exploring autism and the Indian Army, but it received a lukewarm box office response despite critical acclaim abroad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-1-smashing-start-for-ahaan-panday-aneet-padda-mohit-suri-film-opens-at-rs-20-crore-2758085-2025-07-19",
      "headline": "Saiyaara box office Day 1: Smashing start for Ahaan-Aneet, film opens at Rs 21 croreMohit Suri's 'Saiyaara' has made a smashing debut at the Indian box office, breaking records with a Rs 21.25 crore opening day collection. The romantic drama featuring newcomer Ahaan Panday and Aneet Padda has struck a chord with audiences, setting a new benchmark for debut-led films in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-in-viral-jewellery-ad-with-prakash-varma-internet-is-stunned-2758080-2025-07-19",
      "headline": "Mohanlal embraces femininity in viral jewellery ad, internet is stunnedMohanlal showcased his unmatched versatility in a jewellery advertisement, captivating audiences with expressive eyes and graceful gestures. The ad, also featuring his 'Thudarum' co-star Prakash Varma, has received the internet's nod of approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-cinema-mid-year-box-office-report-tamil-telugu-malayalam-kannada-hits-misses-cinematic-saturday-2757249-2025-07-19",
      "headline": "South mid-year box office 2025: Malayalam-Tamil hold fort, Telugu-Kannada in crisisThe first half of 2025 brought contrasting fortunes for South Indian cinema with Malayalam and Tamil films performing well despite setbacks. Telugu and Kannada industries faced difficulties, but a strong lineup of big releases in the second half offers hope for recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-magic-man-2-review-the-alchemy-of-the-self-2757953-2025-07-18",
      "headline": "Magic Man 2 review: Jackson Wang's alchemy of the selfMagic Man 2 review: Jackson Wang's new album is an emotional map from chaos to clarity. 'Magic Man 2' is the work of a man who has lived, lost, and decided to tell the story in his own voice, on his own terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-abir-gulaal-boycott-and-censorship-reaction-so-much-hate-2757892-2025-07-18",
      "headline": "So much hate: Vaani Kapoor reacts to boycott and censorship after Abir Gulaal banActor Vaani Kapoor's recently spoke about film censorship and cancel culture in India. She expressed concerns about artistic freedom and the boycott trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-nayanthara-shoot-for-anil-ravipudis-film-in-kerala-video-leaks-online-2757957-2025-07-18",
      "headline": "Chiranjeevi, Nayanthara shoot for Anil Ravipudi film in Kerala, video goes viralA video from the sets of Anil Ravipudi's upcoming film, featuring Chiranjeevi and Nayanthara, is going viral on social media. The clip shows the stars filming a wedding scene in Kerala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-the-odyssey-imax-70mm-tickets-sell-out-a-year-before-its-2026-release-2757799-2025-07-18",
      "headline": "The Odyssey sets new record, Christopher Nolan's epic sells out a year in advanceDirector Christopher Nolan's 'The Odyssey' tickets for IMAX 70mm screenings sold out within an hour, a year before release. This unprecedented demand highlights the film's epic scale and Nolan's strong box-office pull. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-teams-up-with-director-joshiy-for-his-next-calls-it-dream-come-true-2757939-2025-07-18",
      "headline": "Unni Mukundan teams up with director Joshiy for his next, calls it dream come trueMalayalam cinema enthusiasts have a reason to rejoice as Unni Mukundan collaborates with legendary director Joshiy for a fresh action entertainer. This special project marks a significant milestone announced on Joshiy's birthday."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-federation-of-indian-pilots-sues-wall-street-journal-reuters-over-air-india-crash-claims-2758154-2025-07-19",
      "headline": "Pilots' body sends notice to WSJ, Reuters over Air India reports, seeks apologyThe Federation of Indian Pilots has filed a legal notice against The Wall Street Journal and Reuters for speculative reports on the Air India crash. The reports have been criticised for causing undue distress and damaging reputations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/conversion-racket-mastermind-chhangur-baba-rss-affiliated-outfit-member-2758123-2025-07-19",
      "headline": "Chhangur Baba presented himself as RSS body member, used PM's pic on letterheadDuring meetings with officials and political leaders, Chhangur Baba, the alleged mastermind of the religious conversion racket, used to name-drop several prominent RSS functionaries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/greater-noida-sharda-university-student-dies-by-suicide-blames-harassment-by-teachers-in-note-2758160-2025-07-19",
      "headline": "Can't live like this: Noida student dies by suicide, blames torture by teachersThe student, a resident of Gurugram who was discovered hanging in her room at the girls' hostel, mentioned two faculty members from the dental department in her suicide note."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-invokes-goddess-kali-bengal-rally-mahua-moitra-dhoklas-assembly-elections-2758198-2025-07-19",
      "headline": "She doesn't eat dhoklas: Mahua Moitra jabs PM for invoking Goddess KaliThe Prime Minister, who addressed a rally in Durgapur, on Friday began his speech by greeting the crowd in Bengali and invoking the goddesses Kali and Durga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-dharmasthala-case-whistleblower-temple-murders-missing-women-mass-graves-sowjanya-rape-investigation-2757900-2025-07-19",
      "headline": "Who's the mystery Dharmasthala whistleblower seeking justice for the deadThreatened he would be killed, he silently burned and buried the bodies of hundreds of women that he says had marks pointing to sexual assault and murder. He fled, but guilt didn't let him rest in peace. He returned to dig up evidence at Dharmasthala, a popular pilgrimage place in Karnataka, and shock the world. Who's the mystery whistleblower in the Dharmasthala mass-graves case?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/puri-minor-girl-petrol-set-on-fire-miscreants-odisha-deputy-cm-balasore-college-student-2758183-2025-07-19",
      "headline": "15-year-old Puri girl doused with petrol, set on fire. Naveen Patnaik blasts BJPThe incident comes on the heels of the death of a college student who self-immolated herself after complaining of sexual harassment by a professor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-injured-during-shoot-of-next-release-king-while-attempting-action-sequence-sources-2758171-2025-07-19",
      "headline": "Shah Rukh Khan sustains injury on King sets while filming action sequence: SourcesShah Rukh Khan recently sustained a minor back injury during the shoot of his upcoming film 'King', causing a delay in the production schedule with filming now set to resume in September. Despite the setback, SRK is recuperating well in the UK with his family, and fans remain eager for the film's release featuring a star-studded cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-us-branding-pahalgam-perpetrator-trf-a-global-terror-outfit-is-a-message-to-pakistan-2757806-2025-07-18",
      "headline": "By naming TRF global terror outfit, US is sending a message to PakistanThe Resistance Front (TRF), responsible for numerous terror strikes in Kashmir, is directed by the Pakistani military and intelligence, with its leadership and training pads based in Pakistan\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/brands-cash-in-on-viral-andy-byron-kristin-cabot-kiss-cam-coldplay-concert-video-2758199-2025-07-19",
      "headline": "Brands cash in on viral Andy Byron–Kristin Cabot 'kiss cam' moment at Coldplay concertSeveral global brands turned the viral 'kiss cam' moment of Astronomer CEO Andy Byron and HR head Kristin Cabot at a Coldplay concert into witty ad campaigns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-vs-pakistan-legends-cricket-match-wcl-priyanka-chaturvedi-pahalgam-attack-2758166-2025-07-19",
      "headline": "Don't have Pahalgam attackers yet, but...: Priyanka Chaturvedi on Pak matchIn a hard-hitting post, Rajya Sabha MP Priyanka Chaturvedi reminded the Centre and BCCI of its 'no-engagement' stance with Pakistan following the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sex-tape-scandal-thailand-ms-golf-extorted-millions-monks-seized-files-clergy-heres-what-happened-2757877-2025-07-19",
      "headline": "Sex, tapes and scandal: How Ms Golf extorted millions from Thai monksIn Thailand, a woman known as 'Ms Golf' had sex with at least nine monks and extorted money from them using those photos and videos, earning millions. Police seized over 80,000 such files and linked the blackmail to several temples. The scandal has led to multiple defrockings and sparked a national outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/shubhanshu-shukla-didnt-just-orbit-earth-he-elevated-india-space-mission-in-the-world-2758103-2025-07-19",
      "headline": "Shux didn't just orbit Earth. He elevated India's orbit in the worldGroup Captain Shubhanshu Shukla's space mission marks India's bold stride in soft diplomacy, blending science, global partnerships, and cultural pride to position the nation as a trusted space collaborator."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/speeding-car-accident-kills-two-injures-two-near-sardar-patel-school-bhavnagar-2758184-2025-07-19",
      "headline": "Video: SUV driven by man runs over 2 in Gujarat, cop father turns him inAn SUV driven by the son of a local crime branch policeman ploughed into pedestrians, killing two and critically injuring two others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sohail-khan-kudo-world-cup-silver-india-exclusive-golden-boy-2758078-2025-07-19",
      "headline": "The Silent Fighter: How Sohail Khan put India on the Kudo World MapIn an exclusive interview, Madhya Pradesh's Sohail Khan reflects on his remarkable journey - becoming the first Indian male to reach a Kudo World Cup final, carrying not just a silver medal but also placing India on the global map of a sport still struggling for recognition back home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sangeeta-bijlani-pune-farmhouse-vandalised-police-launch-probe-after-complaint-2758138-2025-07-19",
      "headline": "Sangeeta Bijlani's Pune farmhouse vandalised, police launch probe after complaintBollywood actor Sangeeta Bijlani's farmhouse on the outskirts of Pune was recently broken into and vandalised. The intruders caused extensive damage, leaving the upper floor of the property completely ransacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-gupta-praises-saiyaara-ahaan-panday-aneet-padda-yrf-no-promo-strategy-can-we-learn-our-lesson-2758132-2025-07-19",
      "headline": "Sanjay Gupta praises YRF's no-promo strategy for Saiyaara: Can we learn our lessonSaiyaara's unconventional promotional strategy, avoiding typical media appearances, has sparked praise and discussion in Bollywood, especially from filmmaker Sanjay Gupta. The film's impressive Rs 20 crore Day 1 collection highlighted a successful shift towards content-focused marketing in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-506-18-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-in-danger-as-bcci-boycotts-acc-meeting-in-dhaka-2758105-2025-07-19",
      "headline": "Asia Cup 2025 in limbo as India refuses to attend meet in BangladeshThe ACC meeting is scheduled to be held on July 24 in Dhaka. The decision of the BCCI stems from the strained political relations between India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/do-microgreens-deserve-a-place-on-your-plate-2757729-2025-07-19",
      "headline": "Do microgreens deserve a place on your plate?Microgreens have become a buzzword in the food industry. They are highly nutritious and easy to grow at home. But are they too good to be true?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-cinema-mid-year-box-office-report-tamil-telugu-malayalam-kannada-hits-misses-cinematic-saturday-2757249-2025-07-19",
      "headline": "South mid-year box office 2025: Malayalam-Tamil hold fort, Telugu-Kannada in crisisThe first half of 2025 brought contrasting fortunes for South Indian cinema with Malayalam and Tamil films performing well despite setbacks. Telugu and Kannada industries faced difficulties, but a strong lineup of big releases in the second half offers hope for recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-accuses-uddhav-thackeray-betraying-devendra-fadnavis-2019-maharashtra-assembly-elections-2758039-2025-07-19",
      "headline": "50 calls from Fadnavis, no reply: Eknath Shinde rips into Uddhav for ditching BJPEknath Shinde accused Uddhav Thackeray of betraying Devendra Fadnavis and the BJP alliance in the 2019 assembly elections. The allegations highlight ongoing political tensions within Maharashtra's Shiv Sena factions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-upholds-life-sentence-allows-pardon-plea-shubha-forced-marriage-murder-2758136-2025-07-19",
      "headline": "Top court cites social constraint, allows woman to seek pardon for killing fianceThe Supreme Court observed that a reformative approach must be adopted for women who commit crimes under compelling social circumstances and allowed a murder convict to seek Governor's pardon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-uk-maldives-from-july-23-to-26-trade-pact-boosting-bilaterial-ties-in-focus-2758116-2025-07-19",
      "headline": "PM to visit UK next week to sign trade pact, 1st trip to Maldives after standoffPrime Minister Narendra Modi will undertake a two-nation tour to the UK and Maldives, signing a landmark free trade agreement with the UK and serving as Chief Guest at the Maldives' 60th National Day celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shah-rukh-khan-injured-during-shoot-of-next-release-king-while-attempting-action-sequence-sources-2758171-2025-07-19",
      "headline": "Shah Rukh Khan sustains injury on King sets while filming action sequence: SourcesShah Rukh Khan recently sustained a minor back injury during the shoot of his upcoming film 'King', causing a delay in the production schedule with filming now set to resume in September. Despite the setback, SRK is recuperating well in the UK with his family, and fans remain eager for the film's release featuring a star-studded cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/junior-review-kireeti-reddy-sreeleela-film-is-a-jack-of-all-but-king-of-none-2758167-2025-07-19",
      "headline": "Junior review: Kireeti Reddy's film is a jack of all but king of noneRelease Date:Sat Jul 19, 2025'Junior' film review: This bilingual family drama stars debutant Kireeti Reddy in the lead alongside Genelia Deshmukh and V Ravichandran. While the film showcases all aspects required in a commercial film, there is a sense of half-baked-ness in the final product."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/ranbir-kapoor-sweats-it-out-at-pickle-ball-match-in-bandra-avoids-paps-video-2758168-2025-07-19",
      "headline": "Ranbir Kapoor sweats it out at pickle ball match in Bandra, avoids paps. VideoRanbir Kapoor was seen on Saturday, July 19, exiting a school premises in Bandra after a heated pickleball session. Dressed in an athleisure - white jacket and blue headband, the actor seemed to have wrapped up an intense game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-elli-avram-spark-love-in-dreamy-new-track-chandaniyan-2758159-2025-07-19",
      "headline": "Ashish Chanchlani, Elli AvRam spark love in dreamy new track Chandaniyan. WatchAshish Chanchlani and Elli AvRam charm audiences with 'Chandaniyan', a romantic track that beautifully portrays the joy and pain of loving from afar. Their undeniable chemistry in the music video has sparked fan rumours of a real-life romance. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/farhan-ahmed-rehan-ahmed-hattrick-t20-blast-2758209-2025-07-19",
      "headline": "Watch: England spinner's 17-year-old brother lights up T20 Blast with hat-trickFarhan Ahmed took a hat-trick and a five-wicket haul in Nottinghamshire's win over Lancashire in the T20 Blast match on Friday at Trent Bridge in Nottingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-england-vs-india-manchester-test-greg-chappell-2758170-2025-07-19",
      "headline": "Shubman Gill will face his biggest examination in Manchester: Greg ChappellENG vs IND: Greg Chappell said that Shubman Gill will face his biggest challenge of his captaincy stint in the fourth Test against England, starting July 23 at Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kane-williamson-on-shubman-gills-captaincy-2758165-2025-07-19",
      "headline": "Gill was always captaincy material, he's wise beyond his years: WilliamsonNew Zealand batter Kane Williamson has revealed that Shubman Gill always showed sparks of captaincy from a young age and is a lot wiser for his age. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-the-hundred-county-cricket-clubs-england-2758149-2025-07-19",
      "headline": "Will IPL money rescue financially struggling England cricket clubs?The IPL owners recently invested in several teams in The Hundred, but can it solve the financial issues of the smaller teams in England's county cricket? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-opts-out-of-county-stint-with-yorkshire-due-to-personal-reasons-2758147-2025-07-19",
      "headline": "Ruturaj Gaikwad opts out of county stint with Yorkshire due to personal reasonsIndia and Maharashtra batter Ruturaj Gaikwad has opted out of his maiden county stint with Yorkshire due to personal reasons. He has been out of action ever since his elbow injury in the Indian Premier League 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-birthday-wish-reply-palash-muchhal-2758135-2025-07-19",
      "headline": "Mandhana sends hearts with adorable reply on Palash Muchhal's birthday wishSmriti Mandhana celebrated her 29th birthday on Friday, and Palash Mucchal shared an adorable birthday wish for her. Mandhana is currently participating in the ODI series against England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-t20i-series-squads-salman-agha-litton-das-2758118-2025-07-19",
      "headline": "Bangladesh vs Pakistan T20I series: Squads and all you need to knowBAN vs PAK: Litton Das' Bangladesh and Salman Ali Agha's Pakistan's will be up against each other in a three-match T20I series in Mirpur, starting July 20. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-and-kl-rahul-added-to-lords-honours-board-after-3rd-test-heroics-2758115-2025-07-19",
      "headline": "Bumrah and KL Rahul added to Lord's honours board after 3rd Test heroicsIndia fast bowler Jasprit Bumrah and batter KL Rahul were added to the Lord's honours board after their stellar performances in the third Test of the ongoing series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-in-danger-as-bcci-boycotts-acc-meeting-in-dhaka-2758105-2025-07-19",
      "headline": "Asia Cup 2025 in limbo as India refuses to attend meet in BangladeshThe ACC meeting is scheduled to be held on July 24 in Dhaka. The decision of the BCCI stems from the strained political relations between India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-mohammed-siraj-workload-comparison-2758089-2025-07-19",
      "headline": "Jasprit Bumrah gets rest for his workload, Mohammed Siraj deserves same careWhile Jasprit Bumrah's workload is being managed with precision, Mohammed Siraj has quietly become Indian cricket's most tireless workhorse—and it's time he got the same care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-names-jasprit-bumrahs-replacement-for-4th-test-2758088-2025-07-19",
      "headline": "ENG vs IND: Ajinkya Rahane names Jasprit Bumrah's ideal replacement for 4th TestIndia batter Ajinkya Rahane has named the ideal replacement for Jasprit Bumrah for the fourth Test against England set to begin from July 23 at Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-t20i-series-squads-salman-agha-litton-das-2758118-2025-07-19",
      "headline": "Bangladesh vs Pakistan T20I series: Squads and all you need to knowBAN vs PAK: Litton Das' Bangladesh and Salman Ali Agha's Pakistan's will be up against each other in a three-match T20I series in Mirpur, starting July 20. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-and-kl-rahul-added-to-lords-honours-board-after-3rd-test-heroics-2758115-2025-07-19",
      "headline": "Bumrah and KL Rahul added to Lord's honours board after 3rd Test heroicsIndia fast bowler Jasprit Bumrah and batter KL Rahul were added to the Lord's honours board after their stellar performances in the third Test of the ongoing series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-in-danger-as-bcci-boycotts-acc-meeting-in-dhaka-2758105-2025-07-19",
      "headline": "Asia Cup 2025 in limbo as India refuses to attend meet in BangladeshThe ACC meeting is scheduled to be held on July 24 in Dhaka. The decision of the BCCI stems from the strained political relations between India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-mohammed-siraj-workload-comparison-2758089-2025-07-19",
      "headline": "Jasprit Bumrah gets rest for his workload, Mohammed Siraj deserves same careWhile Jasprit Bumrah's workload is being managed with precision, Mohammed Siraj has quietly become Indian cricket's most tireless workhorse—and it's time he got the same care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-names-jasprit-bumrahs-replacement-for-4th-test-2758088-2025-07-19",
      "headline": "ENG vs IND: Ajinkya Rahane names Jasprit Bumrah's ideal replacement for 4th TestIndia batter Ajinkya Rahane has named the ideal replacement for Jasprit Bumrah for the fourth Test against England set to begin from July 23 at Old Trafford in Manchester. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}