{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/3-it-stocks-could-deliver-quick-gains-in-short-term-tata-technologies-tech-mahindra-coforge-2592171-2024-09-02",
      "headline": "These 3 IT stocks could deliver quick gains in short term. Check hereTech Mahindra is one of the 3 IT stocks that is currently showing a strong bullish trend, visible across both its daily and weekly charts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-likely-to-increase-budget-allocation-for-agriculture-sector-union-cabinet-meet-september-2-2592103-2024-09-02",
      "headline": "Government to increase budget allocation for agriculture sector: ReportThe Union Cabinet may also discuss merging various agricultural schemes into a more streamlined approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gala-precision-engineering-ipo-opens-bidding-subscribe-skip-good-bad-expert-view-gmp-today-2592076-2024-09-02",
      "headline": "Gala Precision Engineering IPO opens for bidding: Subscribe or skip? Gala Precision Engineering Limited, established in February 2009, focusses on manufacturing precision components like disc and strip springs (DSS), coil and spiral springs (CSS), and specialised fastening solutions (SFS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-shares-up-109-percent-from-march-low-hold-sell-buy-investors-outlook-expert-views-2592060-2024-09-02",
      "headline": "Suzlon Energy shares up 109% from March low: What's best move for investors?In the past year, Suzlon Energy shares have delivered a return of 193%, and over the past two years, the gain has been a remarkable 909%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eco-mobility-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2592042-2024-09-02",
      "headline": "ECO Mobility IPO allotment: Step-by-step guide to check statusECO Mobility IPO allotment: Investors who applied for ECO Mobility Limited IPO can check their allotment status online via the BSE website or through Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-all-time-high-driven-by-a-rally-in-auto-stocks-hero-bajaj-mahindra-2592020-2024-09-02",
      "headline": "Sensex, Nifty hit all-time high driven by a rally in IT and auto stocksThe S&P BSE Sensex added 155.32 points to 82,521.09, while the NSE Nifty50 gained 77.20 points to 25,313.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-gas-cylinder-price-delhi-mumbai-chennai-increase-new-rate-2591614-2024-09-01",
      "headline": "Commercial LPG cylinders to get costlier from today, price hiked by Rs 39The price of commercial LPG cylinders has been increased nationwide, with a Rs 39 hike in Delhi for a 19 kg cylinder, now priced at Rs 1,691.50 as of September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-fall-shaktikanta-das-rbi-government-spending-lok-sabha-elections-2591540-2024-08-31",
      "headline": "Lok Sabha polls, reduced spending: RBI Governor's reasons for Q1 GDP fallIndia's GDP growth slowed to 6.7 per cent in the April-June quarter, down from 8.2 per cent a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-and-isg-partner-to-bring-ondc-seller-app-at-global-fintech-fest-2024-2591461-2024-08-31",
      "headline": "JP Morgan and ISG partner to bring ONDC seller app at Global Fintech Fest 2024The partnership creates a 'one stop shop' solution for digital commerce by leveraging ISG's ONDC tech stack, powered by its ecosystem partner Protean, and the banking capabilities of JP Morgan in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-over-12-percent-today-what-should-investors-do-2590857-2024-08-30",
      "headline": " Paytm shares rise over 12% today: What should investors do?This rise in shares comes amid important developments within the company, including the recent sale of its entertainment ticketing business to online food aggregator Zomato for Rs 2,048 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simplified-pension-application-form-launched-for-retiring-government-employees-2590843-2024-08-30",
      "headline": "Simplified pension form launched for retiring government staff. Check detailsThe new form consolidates nine separate forms into a single, unified Form 6A. It also offers the option to download the ePPO, ensuring a seamless transition from employment to retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-investors-q1-gdp-data-rvnl-share-price-2590815-2024-08-30",
      "headline": "Sensex, Nifty end higher as investors await Q1 GDP data; RVNL up 4%The S&P BSE Sensex rose 231.16 points to 82,365.77, while the NSE NIfty50 settled 83.95 higher at 25,235.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-growth-preview-data-what-to-watch-out-for-outlook-expectations-2590803-2024-08-30",
      "headline": "India Q1 GDP growth preview: What to watch out for Analysts predict growth in the range of 6%-7.1% for Q1 FY25, compared with 7.8% in the previous quarter (Q4 FY24). Rating agencies and financial institutions have varying expectations for Q1 GDP growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-shares-surge-5-cross-rs-600-whats-behind-the-rally-2590746-2024-08-30",
      "headline": "RVNL shares cross Rs 600 mark after jumping 5%. What's behind the rally?Shares of this multibagger railway PSU have sharply corrected over the past month but are still up over 230% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-shares-issue-what-is-it-and-how-does-it-benefit-investors-2590685-2024-08-30",
      "headline": "Reliance bonus issue: What is it and how will it benefit shareholders?A bonus issue, also known as a bonus share issue, occurs when a company distributes additional shares to its existing shareholders at no cost to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-global-fintech-fest-jan-dhan-yojana-pivotal-in-boosting-financial-inclusion-women-empowerment-2590680-2024-08-30",
      "headline": "'Jan Dhan Yojana pivotal in boosting financial inclusion': PM ModiSpeaking at the Global Fintech Fest (GFF), he mentioned how the scheme has been a game-changer in ensuring that banking services reach every corner of the country."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/caste-census-welfare-needs-electoral-purposes-rss-2592150-2024-09-02",
      "headline": "Caste census sensitive issue, shouldn't be used for electoral purposes: RSSThe RSS said the caste census is useful for addressing the welfare needs of people, but cautioned against using it for campaigning and electoral purposes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-raps-centre-on-bulldozer-action-no-demolition-even-if-persons-convicted-2592111-2024-09-02",
      "headline": "Supreme Court on bulldozer action: No demolition even if person is convictedThe Supreme Court questioned how a house could be demolished solely because someone is accused or even convicted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/netflix-content-head-summoned-by-controversy-ic-814-the-kandahar-hijack-government-sources-2592065-2024-09-02",
      "headline": "Netflix India content head summoned over 'IC 814' row: Government sources'IC 814: The Kandahar Hijack', which dramatises the 1999 hijacking of Indian Airlines Flight 814, sparked controversy on social media over Hindu 'names' of two of the hijackers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/enforcement-directorate-aap-mla-amanatullah-khan-delhi-waqf-board-2591998-2024-09-02",
      "headline": "AAP's Amanatullah Khan arrested by ED after 6 hours of questioningAAP MLA Amanatullah Khan news: Enforcement Directorate officials arrived at AAP MLA Amanatullah Khan's house early on Monday morning and questioned him for six hours before arresting him in a money laundering case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/netflix-series-ic-814-the-kandahar-hijack-controversy-terrorists-hindu-names-anubhav-sinha-kangana-ranaut-emergency-2592130-2024-09-02",
      "headline": "Should Anubhav Sinha have highlighted real names of IC 814 terrorists?Chief, Doctor, Burger, Bhola and Shankar were the codenames used by the five hijackers of IC 814 in 1999. Anubhav Sinha's web series, 'IC 814: The Kandahar Hijack', also uses those aliases. This has sparked a massive controversy, with Sinha being blamed for not revealing that the five were Muslim terrorists. Couldn't the real names have been highlighted in the Netflix series, and what is the way out now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-grants-bail-aap-vijay-nair-delhi-liquor-policy-case-2592117-2024-09-02",
      "headline": "Ex-AAP office-bearer Vijay Nair gets bail, Supreme Court says he deserves itAfter former Delhi Deputy Chief Minister Manish Sisodia and BRS leader K Kavitha, the Supreme Court granted bail to AAP ex-communication incharge and businessman Vijay Nair in the Delhi liquor policy case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/1-soldier-injured-as-terrorists-attack-army-base-in-jammu-and-kashmir-2592075-2024-09-02",
      "headline": "Terrorists attack army base in Jammu and Kashmir, soldier injuredThe attack took place near the sentry post in the camp, which is manned by the 36 Infrantry Brigade. A search operation has been launched in the area for the terrorists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/international-students-limited-to-work-24-hours-week-impact-financials-negative-impact-studies-2592128-2024-09-02",
      "headline": "Canada's 24-hour work limit to strain finances of Indian studentsIndian students in Canada, the largest group of international students, will face financial strain due to a new rule restricting off-campus work to 24 hours a week. This rule, which takes effect this month, would make it difficult for students to cover living costs in cities like Toronto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-lot-of-my-self-worth-depends-on-peoples-opinion-exclusive-2592163-2024-09-02",
      "headline": "Ananya Panday: Lot of my self-worth depends on people's opinion | ExclusiveActor Ananya Panday, in an exclusive interview with IndiaToday.in, said she continues to place a lot of importance on people's opinions when it comes to work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-ic-814-controversy-distortion-of-historical-facts-2592066-2024-09-02",
      "headline": "Kangana Ranaut on 'IC 814' row: Freedom for communists, none for nationalistsKangana Ranaut voiced her frustration with the current state of content regulation on OTT platforms, specifically targeting the Netflix series 'IC 814: The Kandahar Hijack'. The release of her film 'Emergency' has also been postponed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-pulls-out-of-indias-davis-cup-tie-against-sweden-due-to-back-injury-2592161-2024-09-02",
      "headline": "Sumit Nagal pulls out of India's Davis Cup tie against Sweden due to back injuryIndia's highest-ranked tennis player Sumit Nagal pulled out of the Davis Cup tie against Sweden due to a back injury. Nagal recently crashed out in the US Open 2024 first round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/anand-mahindra-gift-car-armless-archer-sheetal-devi-in-2025-paris-paralympics-2592158-2024-09-02",
      "headline": "Anand Mahindra to gift car to armless archer Sheetal Devi, but in 2025. Here's why Industrialist Anand Mahindra applauded armless archer Sheetal Devi for her exceptional performance at the Paris Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/strange-sound-heard-from-inside-sunita-williamss-starliner-spacecraft-2592070-2024-09-02",
      "headline": "Strange sound heard from inside Sunita Williams's StarlinerIn a recorded conversation, Wilmore described the noise as a repetitive, pulsating sound reminiscent of submarine sonar or tapping from outside the spacecraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-trinamool-congress-boycott-news-channel-mamata-banerjee-rg-kar-kolkata-doctor-rape-murder-2592071-2024-09-02",
      "headline": "Trinamool boycotts 3 TV channels for 'anti-Bengal agenda driven propaganda'Mamata Banerjee's party has decided to boycott three news channels over alleged anti-Bengal propaganda amid criticism of the state government's handling of the Kolkata rape-murder case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-breaks-silence-on-emergency-postponement-says-disappointed-with-country-2592068-2024-09-02",
      "headline": "Kangana Ranaut says 'disappointed with country' after 'Emergency' gets postponedIn an interview recently, Kangana Ranaut expressed her disappointment with the censor board for revoking the certificate given to 'Emergency' following petitions against the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-are-indians-lacking-iron-the-nutrient-needed-for-oxygen-flow-2592081-2024-09-02",
      "headline": "Why are Indians lacking iron, the nutrient needed for oxygen flow?Nutrition-related illnesses are rapidly increasing worldwide. A study has shown that Indians are deficient in several micronutrients, particularly, iron."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-trinamool-congress-leader-atish-sarkar-threat-kolkata-doctor-murder-protest-2592099-2024-09-02",
      "headline": "Trinamool suspends party leader for threatening protesters in KolkataAtish Sarkar, a Trinamool Congress leader, has been suspended from the party for one year after he threatened protesters demanding justice for a Kolkata doctor's rape and murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-bahraich-forest-department-officials-using-teddy-dolls-in-children-urine-to-catch-wolves-2592098-2024-09-02",
      "headline": "Dolls soaked in children's urine used to capture killer wolves in UP's BahraichThe forest department is using brightly coloured \"teddy dolls\" as a false bait. These dolls have been strategically placed near the riverbanks, close to the wolves' resting dens, and are being soaked in children's urine to simulate the natural human scent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-telangana-rains-flooding-weather-forecast-met-alert-trains-cancelled-pm-modi-2591982-2024-09-02",
      "headline": "Andhra, Telangana rain fury: 19 dead, schools shut, 140 trains cancelledAs incessant rain in Andhra Pradesh and Telangana caused severe flooding, property damage, and loss of lives, Prime Minister Narendra Modi spoke to Chief Ministers of both states and assured them of full support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/thar-roxx-vs-thar-this-is-how-mahindra-is-planning-to-limit-the-impact-on-3-door-volumes-2592162-2024-09-02",
      "headline": "Thar Roxx vs Thar: This is how Mahindra is planning to limit the impact on 3-door volumesMahindra has a total capacity of 9,500 units per month for the Thar Roxx 5-door and the Thar 3-door."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympic-games-paris-2024-day-5-live-updates-india-sumit-antil-nitesh-kumar-sheetal-devi-2592077-2024-09-02",
      "headline": "Paralympics 2024 Day 5 Live: Yogesh wins silver in men's discus throw finalParalympics 2024 Day 5 Live: Shooters Nihal Singh and Amir Bhat start off India's day well with strong performances in the qualification round. Yogesh Kathuniya wins silver in men's discus throw F56. Earlier Nitha Sre and Sivarajan Solaimalai finished fourth in the mixed doubles SH6 category in para badminton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/former-miss-south-africa-contestant-faced-xenophobia-wins-miss-universe-with-nigerian-nationality-2592133-2024-09-02",
      "headline": "South African beauty queen crowned Miss Universe Nigeria amid nationality rowChidimma Adetshina's Nigerian heritage attracted vicious xenophobic attacks and sparked controversy when she was announced as a Miss South Africa finalist in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-granddaughter-navya-nanda-joins-iim-ahmedabad-for-mba-2591999-2024-09-02",
      "headline": "Big B's granddaughter Navya Nanda joins IIM AhmedabadAmitabh Bachchan and Jaya Bachchan's granddaughter, Navya Naveli Nanda, enrolled in the MBA program at the Indian Institute of Management (IIM) in Ahmedabad. Navya posted a bunch of pictures from the campus and shared her excitement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-lot-of-my-self-worth-depends-on-peoples-opinion-exclusive-2592163-2024-09-02",
      "headline": "Ananya Panday: Lot of my self-worth depends on people's opinion | ExclusiveActor Ananya Panday, in an exclusive interview with IndiaToday.in, said she continues to place a lot of importance on people's opinions when it comes to work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bts-rm-and-megan-thee-stallion-collaboration-confirmed-2592152-2024-09-02",
      "headline": "BTS' RM and Megan Thee Stallion's collaboration confirmed. DetailsBTS leader and rapper RM (Kim Namjoon) will be collaborating for the upcoming single 'Neva Play' with American rapper Megan Thee Stallion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-opens-up-about-struggles-with-meaningful-relationships-2592142-2024-09-02",
      "headline": "Actor Zeenat Aman opens up about struggles with meaningful relationshipsVeteran Bollywood actor Zeenat Aman, in her latest Instagram post, confessed that she didn't have 'too many' meaningful relationships in her life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/celebrating-keanu-reeves-on-his-60th-birthday-eternal-internet-darling-2592132-2024-09-02",
      "headline": "Celebrating Keanu Reeves: The eternal internet darlingHollywood star Keanu Reeves turned 60 on Monday, September 2. And what better day to celebrate the brand Keanu Reeves that the internet has come to love, than today? "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-pulls-out-of-indias-davis-cup-tie-against-sweden-due-to-back-injury-2592161-2024-09-02",
      "headline": "Sumit Nagal pulls out of India's Davis Cup tie against Sweden due to back injuryIndia's highest-ranked tennis player Sumit Nagal pulled out of the Davis Cup tie against Sweden due to a back injury. Nagal recently crashed out in the US Open 2024 first round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-schedule-day-8-order-of-play-bopanna-sinner-and-swiatek-in-action-2592134-2024-09-02",
      "headline": "US Open Schedule, Day 8 Order of Play: Bopanna, Sinner and Swiatek in action Day 8 of the US Open will witness high-intensity tennis action. Women's and men's singles No. 1 Iga Swiatek and Jannik Sinner will be in action at Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-form-pakistan-vs-bangladesh-test-series-2592100-2024-09-02",
      "headline": "64 runs in 4 innings: Babar Azam's form vs BAN worrying a sign for PakistanPAK vs BAN, 2nd Test: Babar Azam's woeful run in Test cricket continued after he got out for 11 in Pakistan's final innings in the 2nd Test. Babar aggregated a total of just 64 runs from 4 innings in this Test series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shubman-gills-clean-hit-in-whites-during-practice-session-at-pca-stadium-2592097-2024-09-02",
      "headline": "Watch: Shubman Gill's clean hit in whites during practice session at PCA stadiumShubman Gill has been sweating it out in the nets at his home ground in Mohali before the Duleep Trophy and the upcoming home Test season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-liverpool-exit-win-vs-manchester-united-2592084-2024-09-02",
      "headline": "Salah confirms Liverpool exit after 3-0 win vs Manchester UnitedLiverpool talisman Mohamed Salah confirmed that 2024-25 was going to be his final season at the club. Salah's comments came after Liverpool beat Manchester United 3-0 at the Old Trafford on Sunday, September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympic-games-paris-2024-day-5-live-updates-india-sumit-antil-nitesh-kumar-sheetal-devi-2592077-2024-09-02",
      "headline": "Paralympics 2024 Day 5 Live: Yogesh starts strong in discus finalParalympics 2024 Day 5 Live: Shooters Nihal Singh and Amir Bhat start off India's day well with strong performances in the qualification round. At the moment Yogesh Kathuniya is competing in the final of men's discus throw F56. Nitha Sre and Sivarajan Solaimalai finish fourth in the mixed doubles SH6 category in para badminton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ollie-pope-aims-to-learn-and-move-on-after-poor-outings-as-england-captain-2592079-2024-09-02",
      "headline": "Ollie Pope aims to 'learn and move on' after poor outings as England captainOllie Pope admitted his lack of runs in the ongoing series between England and Sri Lanka. However, the captain aimed to block the outside noise and score runs in the 3rd Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-cheteshwar-pujara-ajinkya-rahane-2592058-2024-09-02",
      "headline": "Dinesh Karthik picks Pujara-Rahane's replacement for Border Gavaskar TrophyFormer India wicketkeeper batter Dinesh Karthik named potential replacements of Cheteshwar Pujara and Ajinkya Rahane in the upcoming Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-2024-shuttler-murugesan-beats-ramadass-to-fight-for-gold-in-final-2592052-2024-09-02",
      "headline": "Paralympics 2024: Shuttler Murugesan beats Ramadass to fight for gold in finalIndian para shuttler Thulasimathi Murugesan stormed into the final of Women's SU-5 event as she beat her Indian compatriot Manisha Ramadass in the semi-final"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sheetal-devi-paralympics-2024-jules-konde-piers-morgan-erik-solheim-2592034-2024-09-02",
      "headline": "Sheetal Devi is toast of the world: Armless archer's Paralympics heroics go viralIndia's Para Archer Sheetal Devi has left social media swooning with her grace at the ongoing Paralympics in Paris. She has garnered praise from several eminent personalities around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ollie-pope-aims-to-learn-and-move-on-after-poor-outings-as-england-captain-2592079-2024-09-02",
      "headline": "Ollie Pope aims to 'learn and move on' after poor outings as England captainOllie Pope admitted his lack of runs in the ongoing series between England and Sri Lanka. However, the captain aimed to block the outside noise and score runs in the 3rd Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-cheteshwar-pujara-ajinkya-rahane-2592058-2024-09-02",
      "headline": "Dinesh Karthik picks Pujara-Rahane's replacement for Border Gavaskar TrophyFormer India wicketkeeper batter Dinesh Karthik named potential replacements of Cheteshwar Pujara and Ajinkya Rahane in the upcoming Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-2024-shuttler-murugesan-beats-ramadass-to-fight-for-gold-in-final-2592052-2024-09-02",
      "headline": "Paralympics 2024: Shuttler Murugesan beats Ramadass to fight for gold in finalIndian para shuttler Thulasimathi Murugesan stormed into the final of Women's SU-5 event as she beat her Indian compatriot Manisha Ramadass in the semi-final"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sheetal-devi-paralympics-2024-jules-konde-piers-morgan-erik-solheim-2592034-2024-09-02",
      "headline": "Sheetal Devi is toast of the world: Armless archer's Paralympics heroics go viralIndia's Para Archer Sheetal Devi has left social media swooning with her grace at the ongoing Paralympics in Paris. She has garnered praise from several eminent personalities around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/tiafoe-becomes-1st-american-man-to-reach-3-consecutive-us-open-quarters-since-2008-2592018-2024-09-02",
      "headline": "Tiafoe becomes 1st American man to reach 3 consecutive US Open quarters since 2008Frances Tiafoe became the first American man to reach 3 US Open quarter-finals on the trot. He beat Australia's Alexei Popyrin 6-4, 7-6(3), 2-6, 6-3 in Round of 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-day-5-full-schedule-medal-events-sumit-antil-sheetal-devi-nitesh-kumar-2592015-2024-09-02",
      "headline": "Paralympics Day 5 Schedule: Sumit Antil, archer Sheetal in focus on busy MondaySeveral medal events are lined up for India on Day 5 of the Paralympic Games in Paris as they aim to add more medals to their tally. Para-Badminton stars will be expected to make a massive contribution with seven medal events lined up in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/armless-archer-matt-stutzman-ends-wait-for-paralympics-gold-at-41-2592006-2024-09-02",
      "headline": "Armless archer Matt Stutzman ends wait for Paralympics gold at 41USA's armless archer Matt Stutzman won a gold medal at the Paralympics 2024. He also created a new record by scoring 149 out of 150 points possible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexander-zverev-us-open-2024-brandon-nakashima-aryna-sabalenka-elise-mertens-2591992-2024-09-02",
      "headline": "US Open: Alexander Zverev edges past Nakashima, Sabalenka eases into quarterfinalsAlexander Zverev qualified to the quarter-final of the US Open men's singles beating Brandon Nakashima by 3-6, 6-1,6-2, 6-2. Aryna Sabalenka also eased into quarter-finals with straight sets win over Elise Mertens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-mens-doubles-rohan-bopanna-matthew-ebden-maximo-gonzalez-andres-molteni-2591981-2024-09-02",
      "headline": "US Open: Rohan Bopanna-Matthew Ebden crash out of men's doubles in pre-quarters Rohan Bopanna crashed out of the US Open men's doubles event along with partner Matthew Ebden with straight sets loss against Maximo Gonzalez and Andrés Molteni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-coco-gauff-shock-exit-emma-navarro-pre-quarters-2591974-2024-09-02",
      "headline": "Defending champion Coco Gauff makes shock exit in pre-quartersUS Open 2024: Defending champion Coco Gauff failed to make her way through to the quarterfinals of the women's singles after losing to Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-night-street-race-naga-chaitanya-exclusive-interview-2591971-2024-09-02",
      "headline": "Naga Chaitanya flaunts love for motorsports at Chennai night street raceTelugu film superstar Naga Chaitanya, speaking to India Today, said he was thrilled to witness Chennai hosting the night street race. The owner of Hyderabad Blackbirds in the Indian Racing Festival, the actor called for more such initiatives across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-nishad-kumar-silver-high-jump-2nd-medal-tokyo-2591969-2024-09-02",
      "headline": "Nishad Kumar wins silver in men's high jump, his 2nd medal at the Games Paris Paralympics: Nishad Kumar, 24, won a silver medal in the men's high jump T47 event, finishing behind America's Roderick Townsend. It was Nishad's second Paralympic medal after his silver in the same event in Tokyo in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-mens-doubles-rohan-bopanna-matthew-ebden-maximo-gonzalez-andres-molteni-2591981-2024-09-02",
      "headline": "US Open: Rohan Bopanna-Matthew Ebden crash out of men's doubles in pre-quarters Rohan Bopanna crashed out of the US Open men's doubles event along with partner Matthew Ebden with straight sets loss against Maximo Gonzalez and Andrés Molteni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-coco-gauff-shock-exit-emma-navarro-pre-quarters-2591974-2024-09-02",
      "headline": "Defending champion Coco Gauff makes shock exit in pre-quartersUS Open 2024: Defending champion Coco Gauff failed to make her way through to the quarterfinals of the women's singles after losing to Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-night-street-race-naga-chaitanya-exclusive-interview-2591971-2024-09-02",
      "headline": "Naga Chaitanya flaunts love for motorsports at Chennai night street raceTelugu film superstar Naga Chaitanya, speaking to India Today, said he was thrilled to witness Chennai hosting the night street race. The owner of Hyderabad Blackbirds in the Indian Racing Festival, the actor called for more such initiatives across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-nishad-kumar-silver-high-jump-2nd-medal-tokyo-2591969-2024-09-02",
      "headline": "Nishad Kumar wins silver in men's high jump, his 2nd medal at the Games Paris Paralympics: Nishad Kumar, 24, won a silver medal in the men's high jump T47 event, finishing behind America's Roderick Townsend. It was Nishad's second Paralympic medal after his silver in the same event in Tokyo in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-badminton-wrap-iit-graduate-nitesh-ias-officer-suhas-finals-2591968-2024-09-02",
      "headline": "IIT graduate Nitesh, IAS officer Suhas storm into badminton finalsSuhas Yathiraj and Nitesh Kumar led India's charge in badminton at the Paris Paralympics on Sunday, September 1. The duo reached the finals of their respective categories to secure a medal in the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-taylor-fritz-knocks-casper-ruud-out-with-dominating-win-in-quarters-2591967-2024-09-02",
      "headline": "Taylor Fritz knocks Casper Ruud out with dominating win in pre-quarters US Open 2024: Taylor Fritz made his way into the quarters after beating Norway's Casper Ruud in four sets on Sunday at the Louis Armstrong Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-grigor-dimitrov-storms-into-quarters-thriller-vs-andrey-rublev-2591965-2024-09-02",
      "headline": "Grigor Dimitrov storms into quarters after thriller vs Andrey RublevUS Open 2024: Grigor Dimitrov fended off Andrey Rublev in a thrilling five-setter and secured his berth in the quarterfinal of the men's singles at Flushing Meadows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gus-atkinson-after-honours-board-double-at-lords-will-take-a-while-to-sink-in-2591963-2024-09-02",
      "headline": "Will take a while to sink in: Atkinson after Lord's Honours board double ENG vs SL: Gus Atkinson had a dream outing in the Lord's Test against Sri Lanka after he scored a hundred and picked up a five-wicket haul at the Lord's Cricket Ground. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}