{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-fall-early-trade-it-stock-infosys-tcs-fall-2840254-2025-12-23",
      "headline": "Sensex, Nifty open slighly lower in early trade as IT stocks fallThe S&P BSE Sensex was down 58.36 points at 85,509.12 around 9:22 am, while the NSE Nifty50 slipped 20.20 points to 26,152.20. Most broader market indices also traded marginally lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kisan-diwas-2025-government-schemes-for-farmers-full-list-2840242-2025-12-23",
      "headline": "National Farmers Day 2025: Top 10 schemes supporting farmers across IndiaOn National Farmers Day 2025, it is important to understand the key central government schemes that continue to support farmers with income support, insurance, credit, infrastructure and technology. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/ksh-international-ipo-debut-gmp-negative-listing-price-bse-nse-december-2025-2840225-2025-12-23",
      "headline": "KSH International IPO listing: GMP shows weak debut. Check expected share priceKSH International Limited was subscribed 0.87 times by the end of bidding period. This weak demand is reflected in the grey market premium, which points to a discounted debut on listing day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-has-the-income-tax-department-set-up-a-24x7-control-room-in-maharashtra-2840076-2025-12-22",
      "headline": "Why has the Income Tax Department set up a 24x7 control room in Maharashtra?Citizens have been encouraged to share information related to the use of black money, cash distribution, valuables or other forms of inducement used for election campaigning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gaming-wallet-loads-travel-spends-what-changes-for-icici-credit-card-users-in-2026-2839946-2025-12-22",
      "headline": "Gaming to travel spends: What changes for ICICI credit card users in 2026ICICI Bank credit cards are changing in 2026, reshaping how users spend on gaming, travel and lifestyle purchases as new fees and capped rewards come into play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-high-rally-it-auto-metal-stocks-future-fed-rate-cut-2839875-2025-12-22",
      "headline": "Sensex ends 638 points higher, Nifty above 26,100; Trent up 4%The S&P BSE Sensex was up 638.12 points to close at 85,567.48, while the NSE Nifty50 added 206 points to end at 26,172.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bank-locker-shortage-in-india-why-getting-a-locker-is-becoming-difficult-2839846-2025-12-22",
      "headline": "Trying to get a bank locker? Here's why you may be turned awayIndia currently has around 60 lakh bank lockers, while demand is projected to rise to nearly 6 crore by 2030, according to industry estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cochin-shipyard-share-price-jumps-over-6-percent-why-is-it-rising-today-2839817-2025-12-22",
      "headline": "Cochin Shipyard share price jumps over 6%. Why is it rising today?The stock was trading around Rs 1,645, up over 6% on the Bombay Stock Exchange at around 2:04 pm, and touched intraday highs above Rs 1,653.50 during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-safe-returns-this-post-office-scheme-can-earn-you-up-to-rs-2-lakh-in-interest-2839805-2025-12-22",
      "headline": "Want safe returns? This post office scheme can earn you up to Rs 2 lakh in interestSafe investments often mean modest returns, but that is not always the case. With the right amount and tenure, some secure schemes can generate meaningful interest over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-salary-expectations-pay-hike-expectations-timeline-2839803-2025-12-22",
      "headline": "8th Pay Commission: What next pay hike may look like for government employeesThe 8th Pay Commission signals higher pay, but history suggests patience may be required before revised salaries and arrears actually reach employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-new-zealand-fta-women-led-trade-deal-zero-duty-exports-services-student-visas-investment-piyush-goyal-explained-2839797-2025-12-22",
      "headline": "First women-led FTA: 3 specialities of India's free trade deal with New ZealandNegotiations for the India–New Zealand Free Trade Agreement were formally launched on March 16, 2025, during discussions between Commerce and Industry Minister Piyush Goyal and New Zealand's Trade and Investment Minister Todd McClay. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-income-tax-refund-why-you-may-not-get-interest-despite-the-delay-2839763-2025-12-22",
      "headline": "Waiting for your income tax refund? Why you may not get interest despite the delayWaiting for an income tax refund can be frustrating, especially when the money is stuck for weeks. While the law promises interest on delayed refunds, not every taxpayer is entitled to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-new-zealand-sign-landmark-free-trade-deal-to-focus-on-innovation-investment-and-shared-opportunities-2839733-2025-12-22",
      "headline": "India, New Zealand sign free trade deal to focus on innovation, investmentThe agreement, described by both sides as ambitious and mutually beneficial, is expected to enhance market access, promote investment flows, strengthen strategic cooperation, and create new opportunities for businesses, farmers, MSMEs, innovators, students and youth across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-price-record-high-key-levels-good-time-to-buy-or-not-2839717-2025-12-22",
      "headline": "Gold hits record high again. Should you buy at these levels?In the domestic market, MCX gold futures are consolidating near lifetime highs around Rs 1,35,400 per 10 grams. Prices continue to hold a rising channel, suggesting strong underlying demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-groww-share-price-gained-today-jefferies-buy-rating-target-price-rs-180-2839709-2025-12-22",
      "headline": "Explained: Why Groww share price gained 6% todayGroww share price: The rally in the stock comes after a strong move last week as well. Groww shares had already risen about 13% on Friday, and Monday marked the third straight session of gains for the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/shriram-finance-share-price-jumps-4-percent-today-why-is-stock-rising-explained-2839700-2025-12-22",
      "headline": "Shriram Finance share price jumps 4% today. Here's why it's gainingThe stock moved higher after global brokerage MUFG raised its target price on Shriram Finance, citing the strong strategic impact of its recent deal and the potential for a re-rating."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-why-is-it-rising-today-adrs-explained-2839678-2025-12-22",
      "headline": "Infosys shares rise 3% today. Why is the IT giant's stock price rising?Shares in the Bengaluru-based software services firm were up 2.18% on the Bombay Stock Exchange (BSE) at 10:10 am to trade at Rs 1,674.50, reflecting stronger sentiment after the company addressed market speculation linked to sharp ADR moves last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-women-led-iphone-plant-hires-30000-staff-in-record-india-hiring-2839669-2025-12-22",
      "headline": "Foxconn's new women-led iPhone plant in India hires 30,000 staff: ReportThe workers receive free accommodation, subsidised meals, and earn an average salary of around Rs 18,000 per month, among the highest for women in blue-collar manufacturing roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rising-today-sensex-jumps-500-points-key-reasons-explained-2839656-2025-12-22",
      "headline": "Sensex jumps over 500 points: Why is stock market rising today?The Sensex was trading at 85,434.75, up 505.39 points at 9:31 am, while the NSE Nifty50 rose 166.50 points to 26,132.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-372-points-higher-nifty-above-26000-infosys-jumps-3-percent-2839653-2025-12-22",
      "headline": "Sensex opens 372 points higher, Nifty above 26,000; Infosys jumps 3%The S&P BSE Sensex was up 491.74 points to 85,421.10, while the NSE Nifty50 added 157.75 points to 26,124.15 as of 9:29 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-director-dominic-arun-discusses-films-unexpected-success-shares-update-on-part-2-2840249-2025-12-23",
      "headline": "Lokah director discusses film's 'unexpected' success, shares update on Part 2 Director Dominic Arun reflected on the box office impact of Lokah Chapter 1: Chandra, confirmed scripting progress for the next installment, and addressed the creative pressures following the film's success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-zendaya-enjoy-traitors-live-with-his-family-in-london-see-pics-2840235-2025-12-23",
      "headline": "Tom Holland, Zendaya enjoy Traitors Live with his family in London. See pics Tom Holland and Zendaya recently attended The Traitors: Live Experience in London on Sunday with family and close friends. Tom's brother Sam shared moments from the event on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-returns-mumbai-after-hyderabad-mobbing-incident-husband-raj-nidimoru-2840218-2025-12-23",
      "headline": "Raj Nidimoru picks up Samantha at Mumbai airport days after mobbing incident. Watch Samantha Ruth Prabhu arrived in Mumbai, where filmmaker Raj Nidimoru picked her up following a recent incident in Hyderabad where she was mobbed by fans during a public appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-daughter-aaradhya-jet-off-for-new-year-holiday-in-style-2840221-2025-12-23",
      "headline": "Aishwarya, Abhishek, and Aaradhya jet off for New Year holiday in style. Watch Bollywood couple Aishwarya Rai and Abhishek Bachchan were recently seen at Mumbai airport with their daughter Aaradhya. The sighting comes days after the family attended Aaradhya's school event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-dhurandhar-friday-that-rewrote-ranveer-singhs-story-2840054-2025-12-23",
      "headline": "The Dhurandhar Friday that rewrote Ranveer Singh's story Dhurandhar has altered the box office rhythm of Hindi cinema and rewritten Ranveer Singh's career narrative. The actor who was being written-off for overexposure and misfires, seems to have reclaimed credibility and stardom by stepping back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-shares-emotional-birthday-note-for-ahaan-panday-seen-my-dad-mum-trust-you-deeply-2840208-2025-12-23",
      "headline": "Seen my dad, mum trust you deeply: Aneet shares emotional birthday note for Ahaan Actor Aneet Panday celebrated her Saiyaara co-star Ahaan Panday's birthday with an emotional post. She shared rare personal photos and a touching note reflecting on Ahaan's impact both on and off-screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-dhurandhar-and-animal-belong-to-the-rgv-school-of-cinema-2839921-2025-12-23",
      "headline": "Do Dhurandhar and Animal belong to the RGV school of cinema? As Dhurandhar and Animal divide audiences, the focus shifts from controversy to craft and to Ram Gopal Varma's influence on the thought process driving both films, and not just what they show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-gushes-over-vijay-deverakondas-rowdy-janardhana-reveal-what-an-actor-2840204-2025-12-23",
      "headline": "What an actor: Rashmika gushes over Vijay Deverakonda's Rowdy Janardhana reveal Rashmika Mandanna's enthusiastic social media reactions to Vijay Deverakonda's upcoming film Rowdy Janardhana have drawn significant attention, fuelling anticipation for the movie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-day-18-ranveer-singh-film-sets-sight-on-rs-1000-crore-2840201-2025-12-23",
      "headline": "Dhurandhar box office day 18: Ranveer Singh film eyes Rs 1,000 crore globally Ranveer Singh's action film Dhurandhar has crossed Rs 850 crore worldwide, surpassing Kantara: A Legend Chapter – 1. The film is poised to overtake Animal in the list of top-grossing Indian films and eventually touch the Rs 1,000 crore mark."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-in-avatar-fire-ash-viral-memes-say-yes-but-heres-the-truth-2840197-2025-12-23",
      "headline": "Govinda in Avatar: Fire & Ash? Viral memes say yes, but here's the truth AI-powered videos and images of Bollywood actor Govinda's fictitious cameo in James Cameron's 'Avatar: Fire and Ash' have gone viral. This has sparked online discussion about the origins of the meme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-oona-chaplin-granddaughter-charlie-chaplin-nearly-changed-her-name-2840193-2025-12-23",
      "headline": "Charlie Chaplin's granddaughter Oona nearly changed her name, says it's tricky Oona Chaplin, who stars as the antagonist Varang in 'Avatar: Fire and Ash', recently discussed her experience as Charlie Chaplin's granddaughter. The actor said she has considered a name change as it's tricky to feel undeserving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/enrique-iglesias-and-anna-kournikova-welcome-baby-no-4-my-sunshine-2840191-2025-12-23",
      "headline": "Enrique Iglesias, Anna Kournikova welcome baby No 4: My sunshine Pop singer Enrique Iglesias and his partner Anna Kournikova announced the arrival of their fourth baby in a joint Instagram post. The couple kept details private while sharing a heartfelt message with fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-steps-out-with-sons-saba-azad-in-festive-ethnic-looks-video-2840167-2025-12-22",
      "headline": "Hrithik Roshan steps out with sons, Saba Azad in festive ethnic looks. Video Hrithik Roshan was seen with Saba Azad and his sons at his cousin Eshaan Roshan's pre-wedding ceremony in Mumbai, joined by close family as celebrations began ahead of the wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-exos-long-awaited-return-at-mmas-a-bittersweet-moment-for-exo-ls-2840163-2025-12-22",
      "headline": "K-pop group EXO's long-awaited return at MMAs: A bittersweet moment for EXO-Ls After an eight-year hiatus, K-pop legends EXO made a grand return to the Melon Music Awards. Their comeback marks a hopeful new chapter as they gear up to release their eighth album, Reverxe, in January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nawazuddin-siddiqui-raat-akeli-hai-bansal-murders-sequel-dominates-netflix-2840141-2025-12-22",
      "headline": "Nawazuddin Siddiqui's Raat Akeli Hai sequel dominates Netflix Raat Akeli Hai: The Bansal Murders, a fictional crime thriller inspired by social events, premiered on Netflix on December 19, 2025, and has quickly gained popularity, reaching the number one position on the platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rowdy-janardhana-1980s-action-drama-december-2026-release-2840106-2025-12-22",
      "headline": "Rowdy Janardhana glimpse: Vijay Deverakonda goes raw and ruthless in his next The first look and title announcement for Vijay Deverakonda's next film has been unveiled. Titled Rowdy Janardhana, the film is set for a December 2026 release across multiple languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-odyssey-trailer-matt-damon-leads-christopher-nolan-epic-tom-holland-anne-hathaway-homer-2840090-2025-12-22",
      "headline": "The Odyssey trailer: A myth reborn in Christopher Nolan's cinematic universe Universal has revealed the first trailer for Christopher Nolan's adaptation of Homer's classic tale, featuring Matt Damon as Odysseus. The Odyssey promises sweeping visuals, a celebrated ensemble, and a fresh take from the acclaimed director, with the film set for release on July 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shararat-choreographer-vijay-ganguly-tamannaah-bhatia-was-never-considered-for-dhurandhar-song-2840075-2025-12-22",
      "headline": "Choreographer Vijay Ganguly: Tamannaah was never considered for Dhurandhar song Choreographer Vijay Ganguly has addressed recent reports about Tamannaah Bhatia's supposed rejection from the Shararat song in Dhurandhar, stating she was never considered due to her significant star power and explaining the creative rationale behind the casting decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farrhana-bhatt-recalls-being-targeted-after-shredding-neelam-giri-letter-2840084-2025-12-22",
      "headline": "Farrhana Bhatt recalls being targeted after shredding Neelam Giri's letter Bigg Boss 19 first runner-up Farrhana Bhatt addressed the controversial letter-shredding task on Farah Khan's vlog, saying she stayed calm because she believed her decision was right."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-zealand-foreign-minister-winston-peters-oppose-india-trade-pact-issue-on-dairy-immigration-2839975-2025-12-22",
      "headline": "Neither free nor fair: New Zealand Foreign Minister opposes FTA with IndiaNew Zealand Foreign Minister Winston Peters said his party was \"regrettably opposed\" to the trade agreement with India, arguing that it makes \"serious concessions\" on immigration and investment while failing to secure meaningful gains for New Zealand's key export sectors, especially dairy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-cbi-weaponised-not-a-single-case-against-bjp-rahul-gandhi-germany-2840205-2025-12-23",
      "headline": "India's poll machinery flawed: Rahul Gandhi escalates 'vote chori' claim abroadWhile addressing an event in Germany, Rahul Gandhi alleged that the Enforcement Directorate (ED) and Central Bureau of Investigation (CBI) were being used by the BJP to target political opponents while sparing those aligned with the ruling party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-osman-hadi-killing-benifit-for-radicals-islamists-jamaat-e-islami-shibir-anti-india-yunus-ncp-radicals-2840073-2025-12-23",
      "headline": "Who gains from Osman Hadi's killing ahead of polls? It's not BNP or Awami LeagueSharif Osman Hadi, spokesperson of Inquilab Mancha and candidate for Dhaka-8 seat, was murdered, plunging Bangladesh into chaos. But who gains from Hadi's killing ahead of the February election? Is it the now-banned Awami League or the BNP that has fielded a heavyweight in Dhaka-8? Or is it Jamaat Shibir?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/javed-akhtar-nitish-kumar-bihar-chief-minister-woman-pull-down-hijab-controversy-apology-hindu-woman-ghoonghat-dare-exclusive-interview-rajdeep-sardesai-2840226-2025-12-23",
      "headline": "Would Nitish Kumar have dared to pull up Hindu woman's ghoonghat: Javed AkhtarVeteran lyricist and screenwriter Javed Akhtar slammed Bihar Chief Minister Nitish Kumar, saying if the latter has even an iota of decency, he should apologise for pulling down a woman's hijab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-dhurandhar-friday-that-rewrote-ranveer-singhs-story-2840054-2025-12-23",
      "headline": "The Dhurandhar Friday that rewrote Ranveer Singh's storyDhurandhar has altered the box office rhythm of Hindi cinema and rewritten Ranveer Singh's career narrative. The actor who was being written-off for overexposure and misfires, seems to have reclaimed credibility and stardom by stepping back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajya-sabha-elections-2026-key-seats-vacant-india-political-power-balance-2840147-2025-12-22",
      "headline": "Will 2026 Rajya Sabha battle for 75 seats reshape India's politics?Seventy-five Rajya Sabha seats across several states, including key figures from both ruling and opposition parties, will fall vacant throughout 2026, setting the stage for significant changes in India's upper house of Parliament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/think-melania-steams-her-undergarments-trump-shocks-crowd-with-untimely-rant-north-carolina-rally-2840091-2025-12-22",
      "headline": "Think she steams them: Trump's in-depth description of Melania's undergarmentsUS President Donald Trump made the remarks while recounting the August 2022 FBI raid at his Mar-a-Lago residence in Palm Beach, Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-ahmed-india-u19-improper-conduct-asia-cup-final-2840178-2025-12-23",
      "headline": "U19 Asia Cup final: Ex-Pakistan captain accuses Indian boys of improper conductFormer Pakistan captain and current coach Sarfaraz Ahmed accused the Indian team of improper conduct during the U-19 Asia Cup final on Sunday, December 21. The fierce contest saw Pakistan secure their second Asia Cup title with a big win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/awami-league-hadi-killing-violence-sheikh-hasina-party-members-bangladesh-elections-2840047-2025-12-22",
      "headline": "Awami League members killed without reason: Hasina's party leaders in BangladeshAn Awami League leader, whose father was a freedom fighter, broke down talking to India Today TV recounting the ordeal: \"Almost a year and two months ago, our house was attacked, and he was attacked as well, despite having sacrificed everything for the country. They are doing mob justice in the name of Allah.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-class-battleship-golden-fleet-glbs-2840195-2025-12-23",
      "headline": "Trump unveils new class of Golden Fleet battleships named after himselfDonald Trump announced plans for a new \"Trump-class\" of massive battleships under a Golden Fleet plan, starting with two nuclear-capable vessels aimed at restoring US naval dominance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/sambhal-uttar-pradesh-chopped-into-pieces-stuffed-in-bag-up-woman-kills-husband-with-lover-arrested-2840234-2025-12-23",
      "headline": "Chopped into pieces, stuffed in bag: UP woman kills husband with loverA woman in Uttar Pradesh's Sambhal reported her husband missing. Twenty-seven days later, police recovered a decomposed torso bearing a 'Rahul' tattoo, alerting them that something was amiss -- and ultimately helping crack a gruesome murder case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-doj-jeffrey-epstein-suicide-video-glbs-2840190-2025-12-23",
      "headline": "Justice Department releases alleged Epstein suicide attempt video, then removes itThe chilling 12-second video shows a white-haired man wearing an orange jumpsuit kneeling at the base of a bunk bed and appearing to struggle violently. A timestamp on the footage reads 4:29 am on August 10, 2019, roughly two hours before Jeffrey Epstein was found unresponsive in his cell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-dhurandhar-and-animal-belong-to-the-rgv-school-of-cinema-2839921-2025-12-23",
      "headline": "Do Dhurandhar and Animal belong to the RGV school of cinema?As Dhurandhar and Animal divide audiences, the focus shifts from controversy to craft and to Ram Gopal Varma's influence on the thought process driving both films, and not just what they show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/burqa-clad-men-rob-navi-mumbai-jewellery-shop-at-gunpoint-heist-caught-on-cctv-2840231-2025-12-23",
      "headline": "Burqa-clad men rob Navi Mumbai jewellery shop at gunpoint, heist caught on CCTVA daring daylight robbery in Navi Mumbai has left locals shaken as armed men disguised in burqas made off with gold jewellery from a busy shop. The swift and bold crime has raised serious concerns about security in Maharashtra's commercial areas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-aqi-no-respite-as-air-quality-crosses-severe-mark-winter-chill-smog-fog-2840223-2025-12-23",
      "headline": "No respite for Delhi as air quality crosses severe mark amid winter chillNearly 30 monitoring stations across the city are recording readings in the severe range, with some locations crossing the severe-plus mark of 450, according to the Central Pollution Control Board (CPCB). Anand Vihar topped the list at 466."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-h-1b-updates-india-visa-interview-delays-leave-indian-professionals-in-the-lurch-immigration-attorneys-2839965-2025-12-22",
      "headline": "Biggest mess, say US attorneys, as H-1B delay grounds hundreds of Indian techiesScores of H-1B visa-holding Indian professionals are finding themselves stranded away from their job sites and families after visiting India for visa renewals. Thousands are stranded because of the abrupt cancellation of visa interviews. American immigration attorneys have called it the \"biggest mess\" they have ever seen. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-india-t20-world-cup-speak-with-bat-rediscover-form-2840217-2025-12-23",
      "headline": "Time to speak with the bat: Suryakumar Yadav needs restraint off the fieldOnce a T20I nightmare for bowlers, Suryakumar Yadav now looks ordinary, his words louder than his shots. If India are to defend their World Cup title, the captain must rediscover his old language. Fewer statements, more runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/your-christmas-tree-can-make-you-sick-yes-you-read-that-right-2839998-2025-12-23",
      "headline": "Your Christmas tree can make you sick. Yes, you read that right'Tis the season of joy, merry-making, and maybe some sniffles too. So, when your festive Christmas tree goes up, and you come down with sneezes and wheezes, it may be more than just a coincidence. You might want to keep an eye on your tree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-claims-harassment-in-own-flat-by-society-members-internet-has-questions-2840052-2025-12-22",
      "headline": "Woman's stand against moral policing in Bengaluru flat wins Internet's praiseA young woman faced alleged moral policing and trespass by her housing society members, which led her to take legal action demanding removal of involved board members and filing civil suits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-man-dipu-chandra-das-lynching-shocking-details-colleagues-handed-him-over-to-islamists-2839729-2025-12-22",
      "headline": "Dipu Chandra Das's colleagues betrayed him, joined Bangladesh Islamist lynch mobJust a timely call could have saved the life of 27-year-old Hindu man Dipu Chandra Das, who was lynched by Islamists in Bangladesh. Investigators and reports have revealed that Das was forced to resign by his factory colleagues and handed over to the mob that broke into the factory to drag him out. He was brutally beaten to death and his body was set on fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/winter-desert-saudi-arabia-turns-white-nation-snowfall-climate-change-global-warming-global-weather-uae-2839703-2025-12-22",
      "headline": "Why is Saudi Arabia witnessing rare snowfall? Science explainedThe unusual episode once again underlined how climate change is harbouring unusual weather in regions that are far from prepared to handle it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-self-deportation-incentive-increased-3000-free-travel-cbp-one-app-glbs-2840188-2025-12-23",
      "headline": "US triples bonus to $3,000 for migrants who sign up for self-deportationA statement released by the Department of Homeland Security on Monday said undocumented migrants who register to self-deport before December 31 will be eligible for the cash incentive, government-funded travel to their home countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/hyderabad-police-arrest-wife-two-others-murder-logistics-manager-vj-ashok-2840200-2025-12-23",
      "headline": "Woman claims husband died of heart attack, injuries expose murder plotThe victim was identified as VJ Ashok, a 45-year-old logistics manager. According to the police, Ashok's wife, J Purnima (36), had an extra-marital affair with Paleti Mahesh (22), a construction worker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-fda-approves-novo-nordisk-weight-loss-pill-wegovy-boosting-race-against-eli-lilly-2840207-2025-12-23",
      "headline": "US regulator approves pill version of weight loss drug WegovyThe US FDA has approved Novo Nordisk's new oral weight-loss pill, marking a significant step in obesity treatment and intensifying competition with Eli Lilly. This development could transform patient access and boost Novo's market position in the US."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/axar-patel-india-t20-captain-monty-panesar-t20-world-cup-gautam-gambhir-all-rounder-2840243-2025-12-23",
      "headline": "Axar Patel to become India's next T20I captain? Former England spinner predicts Monty Panesar believes Axar Patel could be India's next T20I captain after 2026. With Shubman Gill dropped from T20 World Cup and Axar reinstated as vice-captain, the leadership succession debate has gathered momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amit-mishra-warns-rishabh-pant-to-modify-game-or-risk-getting-dropped-2840222-2025-12-23",
      "headline": "Pant needs to modify his game or risk getting dropped from team: Amit Mishra Former India spinner Amit Mishra has called on Rishabh Pant to change his batting style to maintain his place in the Indian Test team. Pant's recent poor form and stubborn approach could lead to him being dropped if not addressed, feels Mishra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-india-t20-world-cup-speak-with-bat-rediscover-form-2840217-2025-12-23",
      "headline": "Time to speak with the bat: Suryakumar Yadav needs restraint off the field Once a T20I nightmare for bowlers, Suryakumar Yadav now looks ordinary, his words louder than his shots. If India are to defend their World Cup title, the captain must rediscover his old language. Fewer statements, more runs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-suryakumar-yadav-shubman-gill-cases-different-mohammed-kaif-2840206-2025-12-23",
      "headline": "Shubman Gill and Suyakumar Yadav's T20 World Cup cases are different: Mohammed Kaif Mohammed Kaif believes Suryakumar Yadav and Shubman Gill cannot be judged equally in T20s. According to Kaif, proven match-winners deserve extended backing, even during lean phases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rasmus-hojlund-napoli-italian-cup-manchester-united-dig-social-media-post-2840202-2025-12-23",
      "headline": "Rasmus Hojlund aims subtle dig at Manchester United after Napoli's Italian Cup win Rasmus Hojlund's Instagram post stole headlines after Napoli lifted the Italian Super Cup. The Dane's pointed caption only deepened the contrast between his revival in Italy and Manchester United's ongoing struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-india-squad-shubman-gill-snub-drs-opinion-2840171-2025-12-23",
      "headline": "DRS: What's next for Shubman Gill after his T20 World Cup 2026 snub? Shubman Gill's snub from the T20 World Cup 2026 squad shocked everyone as the 26-year-old now faces the question of what he needs to do next following this call from the selectors. The DRS panel weighs in on how the Indian ODI and Test captain needs to respond to the setback to come back stronger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-man-for-big-moments-dinesh-karthik-praise-vijay-hazare-trophy-2840199-2025-12-23",
      "headline": "Virat Kohli is a man for the big moments: Dinesh Karthik heaps praise on India star Dinesh Karthik has pulled back the curtain on Virat Kohli the person, not just the cricketer. From fierce competitiveness to a love for big moments, Karthik explained why Kohli is built for greatness.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-australia-squad-pat-cummins-nathan-lyon-out-vs-england-melbourne-boxing-day-test-2840196-2025-12-23",
      "headline": "Australia rest Pat Cummins and Nathan Lyon for Boxing Day Test Australia will walk into the Boxing Day Test without Pat Cummins and Nathan Lyon. With the Ashes already secured, selectors have turned to Todd Murphy and Jhye Richardson to reshape the squad for the fourth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-ahmed-india-u19-improper-conduct-asia-cup-final-2840178-2025-12-23",
      "headline": "U19 Asia Cup final: Ex-Pakistan captain accuses Indian boys of improper conduct Former Pakistan captain and current coach Sarfaraz Ahmed accused the Indian team of improper conduct during the U-19 Asia Cup final on Sunday, December 21. The fierce contest saw Pakistan secure their second Asia Cup title with a big win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-review-india-u19-asia-cup-final-pakistan-2840172-2025-12-22",
      "headline": "India U19 team faces review after Asia Cup final debacle vs Pakistan: Report U19 Asia Cup final: India's disastrous loss against Pakistan in the summit clash of the U19 Asia Cup seems to have drawn the ire of the Indian Cricket Board. According to a Cricbuzz report, BCCI has asked for a performance review from the team management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-rinku-sanju-samson-ishan-kishan-2840168-2025-12-22",
      "headline": "These are the heroes: DK's video on Kishan, Samson and Rinku wins hearts Former India cricketer Dinesh Karthik posted a short video on Instagram reacting to the selections of Rinku Singh, Ishan Kishan and Sanju Samson in India's T20 World Cup 2026 squad. The video won hearts across the internet for the unbridled joy in Karthik's face."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-mumbai-vijay-hazare-trophy-first-two-matches-2840162-2025-12-22",
      "headline": "Rohit Sharma to be available for Mumbai's first two VHT ties: ReportFormer India captain Rohit Sharma is expected to be available for selection for the first two matches of the Vijay Hazare Trophy for Mumbai, according to a latest report from PTI. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/rajdeep-sardesai-on-odisha-athletes-train-horror-18-wrestlers-forced-near-toilets-ytvd-2840160-2025-12-22",
      "headline": "Odisha athletes' train ordeal: 18 wrestlers made to sit near toilet in freezing coldIn this 'Image of the Day' segment on News Today, watch this shocking story of wrestlers, including 10 boys and 8 girls, who were forced to sit near a toilet on a train in freezing cold as they were travelling to the National School Wrestling Championship in Uttar Pradesh without confirmed tickets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-shubman-gill-jitesh-sharma-axed-t20-world-cup-2026-2840140-2025-12-22",
      "headline": "Indian cricket is a strange place: Gill's T20 World Cup snub stuns UthappaRobin Uthappa expressed his disbelief in seeing Shubman Gill being axed from the Indian squad for the T20 World Cup 2026. Gill and Jitesh Sharma were snubbed with Ishan Kishan and Rinku Singh coming into the mix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-england-ashes-mentality-australia-0-3-deficit-2840121-2025-12-22",
      "headline": "Is England's winless Ashes run in Australia down to mentality? McGrath reactsGlenn McGrath feels that England's winless run in Australia during Ashes is down to mentality. The Aussies have already blanked England in the first three Tests to regain the Ashes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-women-domestic-cricketers-pay-rise-hike-christmas-2840118-2025-12-22",
      "headline": "BCCI announces 2.5x pay hike for domestic women's cricketersThe Indian Cricket Board has given a major pay hike to women's cricketers in the domestic structure. According to the new proposal, women's players will get an appraisal of 2.5 times their current match fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kazuyoshi-miura-extends-football-career-fukushima-united-58-defying-retirement-norms-2840083-2025-12-22",
      "headline": "King Kazu lives on: 58-year-old Miura set for 41st season as pro footballerVeteran Japanese striker Kazuyoshi Miura, known as \"King Kazu,\" is reportedly preparing to sign for Fukushima United on loan, marking his 41st year in professional football. Miura's career began in 1986. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-omitted-india-2026-t20-world-cup-squad-2840062-2025-12-22",
      "headline": "Jaiswal should have made it to T20 World Cup squad: Ex-India batterFormer cricketer Aakash Chopra feels that Yashasvi Jaiswal should have been picked in the T20 World Cup 2026 squad. Jaiswal continues to be excluded from the format despite showing good form for India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/odisha-athletes-forced-to-travel-near-train-toilets-state-negligence-exposed-ytvd-2840059-2025-12-22",
      "headline": "Odisha Athletes Forced to Travel Near Train Toilets: State Negligence ExposedIn a shocking incident of administrative negligence, 18 young athletes from Odisha were forced to travel in inhumane conditions to participate in the National School Wrestling Championship in Uttar Pradesh. The contingent, comprising 10 boys and 8 girls, had to travel in a general coach near the train washrooms in biting cold due to the lack of confirmed tickets. The report highlights the apathy of the State Department, which allegedly failed to make adequate travel arrangements for the budding sportspersons. As per the transcript, the athletes were 'forced to travel, in the biting cold, next to the washroom in the train'. The incident has sparked outrage over the treatment of future sporting heroes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/train-horror-young-athletes-forced-to-travel-near-toilets-miss-match-due-to-unconfirmed-tickets-ytvd-2840056-2025-12-22",
      "headline": "Train Horror: Young Athletes Forced to Travel Near Toilets, Miss Match Due to Unconfirmed TicketsIn a shocking account of administrative apathy, an unidentified speaker details the harrowing journey of a group of children traveling for a sports event. The speaker reveals that the young athletes were forced to board trains without confirmed tickets for both legs of their journey. Due to the lack of reserved seating, the children were reportedly crammed with up to five people per seat or forced to sit near the train toilets, referred to as the 'Latin side'. The mismanagement resulted in the team reaching their destination after the match had already concluded. The speaker claims to have video evidence of the ordeal, highlighting the severe negligence regarding the safety and dignity of the young players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-england-coach-committed-despite-ashes-defeat-2840038-2025-12-22",
      "headline": "Despite Ashes humbling, Brendon McCullum desperate to carry on as England coachBrendon McCullum insists he remains the right man to take England forward despite presiding over another grim chapter in their Ashes history in Australia, but concedes he does not know whether he will still be in charge of the Test side when next summer begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-jemimah-rodrigues-new-wpl-captain-video-2840022-2025-12-22",
      "headline": "Jemimah Rodrigues as captain? DC keep fans on their toes with suspenseful videoDelhi Capitals sparked speculation about naming Jemimah Rodrigues as their new WPL captain after releasing a cryptic teaser video ahead of a December 23 announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-struggles-andrew-strauss-calls-systemic-cricket-reforms-2839993-2025-12-22",
      "headline": "Sacking Stokes, McCullum not the answer: Strauss warns England after Ashes lossAndrew Strauss calls for deeper reforms within England cricket rather than the dismissal of Brendon McCullum and Ben Stokes, as  their struggles in Australia continue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-final-hours-with-father-cancer-battle-tribute-2839990-2025-12-22",
      "headline": "Michael Vaughan's father dies after England great rushes home from AshesFormer England captain Michael Vaughan shared the news of his father's death, revealing how he managed to return home from Australia to spend precious final hours with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/krishnappa-gowtham-retires-karnataka-all-rounder-14-year-domestic-cricket-career-2839968-2025-12-22",
      "headline": "IPL star and domestic stalwart Krishnappa Gowtham retires from cricketKrishnappa Gowtham has announced his retirement from all forms of cricket, drawing the curtain on a notable career across India's domestic circuit and the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-jharkhand-vijay-hazare-trophy-2025-2839978-2025-12-22",
      "headline": "After T20 World Cup selection, Ishan Kishan named Jharkhand's VHT captainAfter the selection for India's T20 World Cup squad, Ishan Kishan will continue leading Jharkhand, this time in the Vijayu Hazare Trophy. Kishan played a vital role in Jharkhand's Syed Mushtaq Ali Trophy win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-visits-simhachalam-temple-after-win-sri-lanka-2839929-2025-12-22",
      "headline": "Prayer time: India Women visit Vizag's Lakshmi Narasimha Swamy temple after 1st T20IAfter a dominant eight-wicket win over Sri Lanka in the first Women's T20I, the Indian women's team visited Vizag's Simhachalam temple to seek blessings as they began the series with authority and momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-icc-uniform-drs-ashes-2025-controversy-2839915-2025-12-22",
      "headline": "After Ashes snicko controversy, Mitchell Starc tells ICC to pay for uniform DRS systemMitchell Starc has called for the ICC to fund for a uniform DRS system in international cricket after controversy erupted during the Ashes 2025 series during the Adelaide Test. The match saw multiple instances where the snicko failed to give the correct decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-jemimah-rodrigues-praises-trolls-india-sri-lanka-2839872-2025-12-22",
      "headline": "Crazy biceps: Jemimah Rodrigues subtly hits back at Smriti Mandhana's trollsIND vs SL, 1st Women's T20I: Jemimah Rodrigues congratulated Smriti Mandhana on reaching 4000 T20I runs while subtly responding to trolls commenting on the left-handed batter's appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/reporters-diary-of-lionel-messis-india-tour-delhi-leg-2839850-2025-12-22",
      "headline": "Spanish chants, VIP boos and Ronaldo fan jibes: Reporter's diary from Lionel Messi tourThe Delhi leg of Lionel Messi's India tour had it all, from passionate fans to celebrity sightings. Here's a reporter's firsthand account of the third and final instalment of Messi's historic tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trolls-england-ashes-series-defeat-in-australia-2839834-2025-12-22",
      "headline": "Rohit Sharma joins the Aussies, trolls England after Ashes humiliationRohit Sharma trolled England following their Ashes series loss in Australia. England lost the third Test in Adelaide by 82 runs, which resulted in fourth successive Ashes series loss in Australia."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}