{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-srikanth-odela-the-paradise-shooting-begins-40-day-schedule-in-hyderabad-2747647-2025-06-28",
      "headline": "Nani begins shooting for Srikanth Odela's The Paradise, 40-day schedule underwayActor Nani and director Srikanth Odela's upcoming film, 'The Paradise', has gone on floors. A 40-day schedule in Hyderabad is currently underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaanta-laga-music-director-harry-anand-on-shefali-jariwala-death-2747632-2025-06-28",
      "headline": "My heart sank: Kaanta Laga music director Harry Anand on Shefali Jariwala's deathMusic director Harry Anand, who launched Shefali Jariwala in Kaanta Laga, expressed deep shock over her sudden death. In an exclusive chat, he recalled their iconic collaboration and the memories they shared from the early 2000s remix era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidya-balan-slams-pretentious-cinema-says-shah-rukh-khan-romance-worked-because-of-emotion-2747591-2025-06-28",
      "headline": "Vidya Balan slams pretentious cinema, says SRK's romance worked because of emotionActor Vidya Balan criticised the growing disconnect in today's filmmaking, saying many new directors lack an understanding of Indian storytelling. She praised Shah Rukh Khan for winning hearts through emotional scenes, not just his iconic romantic pose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-celebrates-35-years-of-days-of-thunder-supports-brad-pitts-f1-release-2747572-2025-06-28",
      "headline": "Tom Cruise celebrates 35 years of Days of Thunder, supports Brad Pitt's F1 releaseActor Tom Cruise celebrated 35 years of 'Days of Thunder' while sharing a series of nostalgic photos on X. He also supported the release of Brad Pitt's new racing film 'F1'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/hindustani-bhau-remembers-shefali-jariwala-phone-nahi-bajega-2747610-2025-06-28",
      "headline": "Emotional Hindustani Bhau remembers Shefali Jariwala: Phone nahi bajegaPopular content creator Hindustani Bhau visited Cooper Hospital where Shefali Jariwala's body was brought for postmortem. While leaving the hospital, he addressed the media and got emotional as he remembered Shefali, who used to tie him Rakhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-2025-mid-year-box-office-chhaava-won-sikandar-lost-any-lessons-learnt-2747601-2025-06-28",
      "headline": "Bollywood 2025 mid-year box office: Chhaava won, Sikandar lost - any lessons learnt?The first half of 2025 has been a reality check for Bollywood. While 'Chhaava' emerged as a runaway success, along with 'Sitaare Zameen Par', which is still running in theatres - proving that emotionally grounded storytelling still works, big-ticket spectacles like 'Sikandar' failed to strike a chord with audiences. The question is - has the industry finally started listening, or is it still betting on outdated formulas and star power?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-slams-diljit-dosanjh-in-border-2-2747546-2025-06-28",
      "headline": "Rupali Ganguly slams Diljit Dosanjh, praises Border 2 makers for dropping himRupali Ganguly indirectly criticised Diljit Dosanjh for his involvement in 'Border 2', calling it disheartening and praising the makers for allegedly removing him. However, sources close to the production have denied any plans to replace the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-latest-picture-fauji-set-leaked-fans-reminded-of-his-look-from-mirchi-2747578-2025-06-28",
      "headline": "Prabhas's pic from his new film Fauji leaked, fans reminded of Mirchi lookA new picture of Prabhas, which appears to be from the sets of his upcoming film, 'Fauji', is doing the rounds on the internet. Excited fans commented that they were reminded of the actor's look from the hit film, 'Mirchi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-old-clip-goes-viral-2747542-2025-06-28",
      "headline": "Want to be known as Kaanta Laga girl till I die: Shefali Jariwala's old clip goes viralActor Shefali Jariwala became an overnight sensation in the early 2000s after the release of her music video 'Kaanta Laga'. She later appeared in Salman Khan's film 'Mujhse Shaadi Karogi'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/shefali-jariwala-husband-parag-tyagi-requests-paps-to-stop-with-folded-hands-2747550-2025-06-28",
      "headline": "Please mat karo: Shefali Jariwala's husband requests paps with folded handsShefali Jariwala reportedly died of a cardiac arrest last night. Her body was brought to Cooper Hospital for postmortem. Shefali's husband, Parag Tyagi, was photographed as he arrived at the hospital. He was seen requesting the media with folded hands. \"Please, mat karo,\" the actor was heard telling the paparazzi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-confirms-andaz-apna-apna-2-talks-about-collaborating-with-shah-rukh-khan-salman-2747519-2025-06-28",
      "headline": "Aamir Khan confirms Andaz Apna Apna 2, talks about collaborating with SRK, SalmanAamir Khan has confirmed that 'Andaz Apna Apna 2' is in development. He also expressed interest in collaborating with Shah Rukh Khan and Salman Khan in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dies-at-42-kannada-debut-puneeth-rajkumar-film-hudugaru-2747520-2025-06-28",
      "headline": "Shefali Jariwala dies at 42: Actor made Kannada debut in Puneeth Rajkumar's filmTelevision actor and model Shefali Jariwala died at the age of 42 at her Andheri residence on Friday night. She made her South debut with a special song in late Puneeth Rajkumar's Kannada film, 'Hudugaru'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-a-look-back-at-the-life-and-career-of-the-kaanta-laga-fame-actor-2747490-2025-06-28",
      "headline": "Shefali Jariwala: A look back at the life and career of the Kaanta Laga fame actor'Kaanta Laga' and 'Bigg Boss 13' fame Shefali Jariwala died late Friday night. The 42-year-old was also part of other Indian reality shows and films. Here's all about her life and career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-box-office-collection-day-1-vishnu-manchu-film-outperforms-maa-f1-in-india-2747497-2025-06-28",
      "headline": "Kannappa box office Day 1: Vishnu Manchu's film outperforms Maa, F1 in IndiaVishnu Manchu's 'Kannappa' received positive reviews from critics and audiences alike upon its release on June 27. The film has outperformed Kajol's 'Maa' and Brad Pitt's 'F1' in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-shefali-jariwala-husband-parag-tyagi-all-you-need-to-know-actor-2747487-2025-06-28",
      "headline": "Who is Parag Tyagi? All you need to know about Shefali Jariwala's husbandActor and model Shefali Jariwala, best known for the 'Kaanta Laga' music video, died at her Mumbai home on Friday night. She was 42. She was married to actor Parag Tyagi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-cause-not-clear-mumbai-police-official-statement-on-kaanta-laga-girl-sudden-passing-2747481-2025-06-28",
      "headline": "Cause of Shefali Jariwala's death not clear: Mumbai PoliceActor Shefali Jariwala was found dead at her residence in Mumbai on Friday night. The Mumbai Police later released a statement clarifying that a forensic team was still at her residence, and they have started investigating the case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-to-lead-world-largest-independence-day-parade-new-york-august-2747478-2025-06-28",
      "headline": "Vijay Deverakonda, Rashmika Mandanna to lead largest India Day parade in New YorkVijay Deverakonda and Rashmika Mandanna are the grand marshals to lead the world's largest India Day parade in New York on August 17. The two confirmed their presence with personalised video messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-kaanta-laga-fame-death-fan-tribute-reaction-2747471-2025-06-28",
      "headline": "Shefali Jariwala dies at 42: Tributes pour in from grieving fansActor Shefali Jariwala, best known for her wildly popular song 'Kaanta Laga', has died. Heartbroken fans remembered her on social media and shared heartfelt tributes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/50-cent-criticises-zohran-mamdani-millionaire-tax-hike-new-york-2747457-2025-06-28",
      "headline": "50 Cent slams Mamdani's millionaire tax plan in NYC: Will pay to send him outRapper 50 Cent has lashed out at NYC's Democratic mayor pick Zohran Mamdani's proposed tax increase on millionaires in the city. The dispute highlights tensions around tax policies, targeting the wealthy in the city."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-terror-camps-rebuilding-occupied-kashmir-is-army-operation-sindoor-2747622-2025-06-28",
      "headline": "Pakistan rebuilding terror camps, launchpads destroyed in Op SindoorPakistan, in coordination with its Army, ISI, and government agencies, is reportedly rebuilding and upgrading terrorist launchpads and camps destroyed during India's Operation Sindoor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/padma-shri-awardee-monk-kartik-maharaj-rape-charge-west-bengal-woman-2747559-2025-06-28",
      "headline": "Bengal woman accuses Padma awardee monk of raping her 12 times in 6 monthsThe woman alleged that Kartik Maharaj, a monk of the Bharat Sevashram Sangha, took her to an ashram in Murshidabad, promising her a teaching job at a school."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-kanimozhi-language-row-tamil-amit-shah-hindi-english-not-enemy-2747581-2025-06-28",
      "headline": "Let North Indians learn Tamil: Kanimozhi on Amit Shah's 'Hindi not foe' remarkDMK MP Kanimozhi responded to Union Home Minister Amit Shah's assertion that Hindi is not an enemy of any language by asserting the same for Tamil, urging North Indians to learn South Indian languages. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/prada-finally-gives-kolhapuris-their-due-2747569-2025-06-28",
      "headline": "Prada finally gives Kolhapuris their duePrada has finally admitted it drew inspiration from India's iconic Kolhapuri chappals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/siddharth-shukla-sanjay-kapur-and-the-alarming-rise-of-heart-attacks-among-the-young-2747613-2025-06-28",
      "headline": "From Shefali Jariwala to Sidharth Shukla: 11 young stars lost to heart attacksWhile Shefali Jariwala's post-mortem is still underway, initial reports suggest that the 42-year-old actor may have suffered a massive heart attack on Friday night. Here's a look at other such instances when young, seemingly healthy hearts gave out too soon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chaos-as-sukanta-majumdar-joins-bjp-protest-against-kolkata-law-student-gang-rape-2747638-2025-06-28",
      "headline": "Chaos as BJP protests Kolkata college gangrape, Bengal unit chief detainedA 24-year-old South Calcutta Law College student alleged she was gang-raped on June 25 after she rejected a marriage proposal from the main accused, 31-year-old Monojit Mishra, a TMC associate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rain-monsoon-weather-heavy-moderate-orange-alert-imd-prediction-forecast-2747629-2025-06-28",
      "headline": "Delhi's wait for monsoon ends? Heavy rain lashes capital, orange alert issuedHeavy rain accompanied by thunderstorms and gusty winds hit the national capital on Saturday evening, and more showers are expected, likely marking the onset of the monsoon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/security-guard-of-kolkata-law-college-arrested-in-gang-rape-case-4-people-caught-so-far-2747511-2025-06-28",
      "headline": "Kolkata gang-rape: College guard, who ignored woman's pleas, 4th to be arrestedA security guard of the South Kolkata Law College has been arrested in connection with the gang-rape of a first-year law student, marking the fourth arrest in the incident amid massive outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-a-look-back-at-the-life-and-career-of-the-kaanta-laga-fame-actor-2747490-2025-06-28",
      "headline": "Shefali Jariwala: A look back at the life and career of the Kaanta Laga fame actor'Kaanta Laga' and 'Bigg Boss 13' fame Shefali Jariwala died late Friday night. The 42-year-old was also part of other Indian reality shows and films. Here's all about her life and career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/13-pakistani-soldiers-killed-in-suicide-attack-news-agency-afp-2747595-2025-06-28",
      "headline": "13 soldiers killed, 10 injured as suicide bomber rams military convoy in PakResponsibility for the suicide bombing was claimed by the suicide unit of the Hafiz Gul Bahadur group, a faction aligned with the Pakistan Taliban (TTP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shefali-jariwala-death-live-updates-bigg-boss-fame-kaanta-laga-girl-dies-at-42-due-to-cardiac-arrest-hospital-visuals-husband-parag-tyagi-pics-2747434-2025-06-28",
      "headline": "Shefali Jariwala death: Postmortem done, family to take her body home soonShefali Jariwala Death News: Actor Shefali Jariwala, popular as the 'Kaanta Laga Girl', died on Friday night at her residence in Mumbai. While the family has not yet disclosed the reason behind her death, it is believed that she died of a cardiac arrest. She was reportedly brought to the hospital, where the doctors declared her dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/youtuber-kanika-devrani-drugged-robbed-on-brahmaputra-mail-viral-video-2747606-2025-06-28",
      "headline": "YouTuber says she was drugged, robbed on train, claims police refused to helpYouTuber claims she was drugged, robbed on Brahmaputra Mail; says rail staff allowed a stranger without a ticket into the coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parag-jain-1989-batch-ips-officer-who-played-key-role-in-op-sindoor-is-new-research-and-analysis-wing-chief-2747605-2025-06-28",
      "headline": "Parag Jain, IPS officer who played key role in Op Sindoor, is new R&AW chiefParag Jain, a 1989-batch Punjab cadre IPS officer, will take over as R&AW chief from July 1, bringing decades of intelligence and counter-terror experience to India's external spy agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaanta-laga-music-director-harry-anand-on-shefali-jariwala-death-2747632-2025-06-28",
      "headline": "My heart sank: Kaanta Laga music director Harry Anand on Shefali Jariwala's deathMusic director Harry Anand, who launched Shefali Jariwala in Kaanta Laga, expressed deep shock over her sudden death. In an exclusive chat, he recalled their iconic collaboration and the memories they shared from the early 2000s remix era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-birmingham-test-rest-analysis-impact-2747469-2025-06-28",
      "headline": "No Bumrah, no glory? Can India win a Test in England without their ace?England vs India: With Jasprit Bumrah likely to miss the second Test of the Anderson-Tendulkar Trophy, India's already daunting challenge in England has become even more formidable. We explore whether India can win overseas without their pace spearhead and what the numbers, history, and selection options reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-2025-mid-year-box-office-chhaava-won-sikandar-lost-any-lessons-learnt-2747601-2025-06-28",
      "headline": "Bollywood 2025 mid-year box office: Chhaava won, Sikandar lost - any lessons learnt?The first half of 2025 has been a reality check for Bollywood. While 'Chhaava' emerged as a runaway success, along with 'Sitaare Zameen Par', which is still running in theatres - proving that emotionally grounded storytelling still works, big-ticket spectacles like 'Sikandar' failed to strike a chord with audiences. The question is - has the industry finally started listening, or is it still betting on outdated formulas and star power?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-500-27-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/dutch-researchers-redesign-dreaded-gynaec-tool-speculum-after-185-years-2747641-2025-06-28",
      "headline": "Dutch researchers redesign speculum, gynaec medical tool unchanged for 185 yearsA Dutch team of researchers from TU Delft has redesigned the vaginal speculum after centuries of discomfort with the old metal duckbill design. Lilium, their flower-shaped, soft rubber alternative, aims to make gynaecological exams less painful, more patient-friendly, and even offers better visibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-india-pakistan-war-nuclear-threat-trade-mediation-2747411-2025-06-28",
      "headline": "'Cancel all deals, they are at war': Trump repeats claim on India-Pak conflictDonald Trump claimed he averted a nuclear war between India and Pakistan by threatening to cancel all trade deals unless both sides ceased fighting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/isro-wake-up-celebrate-astronaut-shubhanshu-shukla-axiom-4-mission-2747427-2025-06-28",
      "headline": "Wake up Isro! You forgot to celebrate your own astronautIndia celebrated its latest space hero, but Isro's silence stole the spotlight. The agency's muted media play risks dulling the pride of a nation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-condemns-viral-celebration-video-ahmedabad-plane-crash-2747421-2025-06-28",
      "headline": "Air India venture fires 4 staffers over viral office party video days after crashAISATS has expressed regret over a viral office celebration video allegedly shot after the AI 171 crash and has dismissed four senior executives involved. The tragic Air India crash in Ahmedabad claimed 270 lives.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-schools-zumba-dance-sessions-muslim-organisations-object-2747495-2025-06-28",
      "headline": "Kerala introduces Zumba in schools, Muslim outfits don't dance to its tuneThe Kerala education department has introduced Zumba in schools. However, several Muslim organisations have objected to girls and boys 'dancing together wearing minimal clothes'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-bahraich-minors-kill-youth-iphone-to-make-reels-social-media-2747592-2025-06-28",
      "headline": "Minors slit man's throat, crush head with stone to steal iPhone to make reelsThe incident happened on June 20 when the victim, who lived in Bengaluru, came to his hometown to attend a wedding. His body was found with his throat slit the next day."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-on-verge-of-joining-bradman-dravid-and-lara-2747639-2025-06-28",
      "headline": "ENG vs IND: Rishabh Pant on verge of joining Bradman, Dravid and Lara in elite listIndia wicketkeeper batter Rishabh Pant is on the verge of joining Sir Don Bradman, Rahul Dravid and Brian Lara in an elite list during the second Test against England set to begin from July 2 at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-team-changes-kuldeep-jadeja-2747597-2025-06-28",
      "headline": "Kuldeep for Jadeja: Haddin asks Gill to make bold move in 2nd TestBrad Haddin believes that Shubman Gill, as a captain, has to take more bold moves to ensure they remain in the five-match series against England. One such move he suggested was to bring in Kuldeep Yadav for Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-play-in-2nd-test-vs-india-englands-managing-director-reveals-2747600-2025-06-28",
      "headline": "Will Jofra Archer play in 2nd Test vs India? England's managing director revealsEngland and Wales Cricket Board (ECB) managing director Rob Key recently gave an update on Jofra Archer's availability for the second Test against India in Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rameshbabu-praggnanandhaa-chess-players-ranking-d-gukesh-viswanathan-anand-2747585-2025-06-28",
      "headline": "This one felt special: Praggnanandhaa after overtaking D GukeshRameshbabu Praggnanandhaa has become India's highest-ranked chess player after his win at the UzChess Cup Masters. He overtook D Gukesh for the position and said that it was a special feeling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-roston-chase-demands-penalty-for-umpires-controversial-decisions-2747566-2025-06-28",
      "headline": "Roston Chase demands penalty for umpires after contentious calls in 1st TestWest Indies captain Roston Chase demanded penalty for umpires after several controversial decisions went against his team during the first Test against Australai in Barbados."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-batting-abhishek-nayar-rohit-sharma-2747537-2025-06-28",
      "headline": "The KL Rahul comeback: Are India reaping rewards of Abhishek Nayar's work?India batter KL Rahul has regained form with a century in the England Test series. Former India batting coach Abhishek Nayar reveals how he played a crucial role in revamping his technique and mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heinrich-klaasen-mlc-2025-quits-captaincy-seattle-orcas-matthhew-mott-sacked-2747526-2025-06-28",
      "headline": "Klaasen quits Seattle Orcas captaincy midway through MLC 2025, coach Mott sackedHeinrich Klaasen has stepped down from his role as captain of the Seattle Orcas to focus on his batting. Coach Matthew Mott has been sacked from his role by the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-2nd-test-prabath-jayasuriya-pathum-nissanka-colombo-2747529-2025-06-28",
      "headline": "Prabath Jayasuriya spins Sri Lanka to innings victory over Bangladesh in 2nd TestSri Lanka beat Bangladesh by an innings and 78 runs in the second and final Test and won the series by 1-0. Prabath Jayasuriya picked up his 12th five-wicket haul on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/najmul-hossain-shanto-quits-as-bangladesh-test-captain-2747523-2025-06-28",
      "headline": "Shanto quits as Bangladesh's Test skipper after Sri Lanka series defeatDespite a brilliant performance in the Sri Lanka Test series, Najmul Hossain Shanto has decided to step down as Bangladesh's Test captain. Shanto believes it is not ideal to have separate captains in red ball and white ball formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raphinha-hails-nico-williams-barcelona-transfer-signing-2747505-2025-06-28",
      "headline": "Player of highest quality: Raphinha hails Williams amid Barcelona moveRaphinha remains unfazed at Nico Williams' possible signing for Barcelona and wants to continue putting his team first. He will welcome the Spaniard if he follows a similar approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-batting-abhishek-nayar-rohit-sharma-2747537-2025-06-28",
      "headline": "The KL Rahul comeback: Are India reaping rewards of Abhishek Nayar's work?India batter KL Rahul has regained form with a century in the England Test series. Former India batting coach Abhishek Nayar reveals how he played a crucial role in revamping his technique and mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heinrich-klaasen-mlc-2025-quits-captaincy-seattle-orcas-matthhew-mott-sacked-2747526-2025-06-28",
      "headline": "Klaasen quits Seattle Orcas captaincy midway through MLC 2025, coach Mott sackedHeinrich Klaasen has stepped down from his role as captain of the Seattle Orcas to focus on his batting. Coach Matthew Mott has been sacked from his role by the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-2nd-test-prabath-jayasuriya-pathum-nissanka-colombo-2747529-2025-06-28",
      "headline": "Prabath Jayasuriya spins Sri Lanka to innings victory over Bangladesh in 2nd TestSri Lanka beat Bangladesh by an innings and 78 runs in the second and final Test and won the series by 1-0. Prabath Jayasuriya picked up his 12th five-wicket haul on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/najmul-hossain-shanto-quits-as-bangladesh-test-captain-2747523-2025-06-28",
      "headline": "Shanto quits as Bangladesh's Test skipper after Sri Lanka series defeatDespite a brilliant performance in the Sri Lanka Test series, Najmul Hossain Shanto has decided to step down as Bangladesh's Test captain. Shanto believes it is not ideal to have separate captains in red ball and white ball formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raphinha-hails-nico-williams-barcelona-transfer-signing-2747505-2025-06-28",
      "headline": "Player of highest quality: Raphinha hails Williams amid Barcelona moveRaphinha remains unfazed at Nico Williams' possible signing for Barcelona and wants to continue putting his team first. He will welcome the Spaniard if he follows a similar approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-arshdeep-singh-practice-session-edgbaston-2747499-2025-06-28",
      "headline": "Arshdeep trains hard as Bumrah skips ahead of Edgbaston TestIndia vs England: Arshdeep Singh had an intensive training session ahead of the second Test at Edgbaston. His potential debut depends on Jasprit Bumrah's fitness and selection decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-returns-australia-second-test-west-indies-grenada-2747484-2025-06-28",
      "headline": "Steve Smith begins batting, hopes to prove fitness for Grenada TestSteve Smith is already eyeing his return to Test cricket after copping an injury during the World Test Championship final. He could possibly make his return in the second Test against the West Indies in Grenada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/olivier-giroud-lille-transfer-lafc-contract-termination-report-2747470-2025-06-28",
      "headline": "Olivier Giroud set to sign for Lille after terminating LAFC deal: ReportOlivier Giroud is reportedly set to make his return to France, with Lille set to be his new club. With just six months left on his current deal with LAFC, the club have decided to end his contract early to facilitate the move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-shamar-joseph-ian-healy-controversy-latest-news-2747472-2025-06-28",
      "headline": "Curtly Ambrose dig fired up Shamar Joseph: Roston ChaseShamar Joseph responded spectacularly to Curtly Ambrose's criticism with a 9-wicket haul. His fiery performance gave West Indies hope against Australia and sparked debate over on-field sledging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-birmingham-test-rest-analysis-impact-2747469-2025-06-28",
      "headline": "No Bumrah, no glory? Can India win a Test in England without their ace?England vs India: With Jasprit Bumrah likely to miss the second Test of the Anderson-Tendulkar Trophy, India's already daunting challenge in England has become even more formidable. We explore whether India can win overseas without their pace spearhead and what the numbers, history, and selection options reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-inter-miami-fifa-club-world-cup-attendance-usa-2024-2747454-2025-06-28",
      "headline": "Real Madrid, Inter Miami amongst biggest crowd pullers in Club World CupReal Madrid and Inter Miami are attracting the largest crowds at the FIFA Club World Cup in the USA. The high attendance highlights growing interest in the sport in North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-west-indies-1st-test-match-report-josh-hazlewood-shamar-joseph-2747439-2025-06-28",
      "headline": "Ruthless Australia crush West Indies to take 1-0 lead in Test seriesAustralia defeated West Indies by 159 runs in the opening Test match. Hazlewood's five-wicket haul was key to Australia's commanding victory on a challenging pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/night-of-champions-preview-match-card-livesteaming-details-riyadh-2747402-2025-06-28",
      "headline": "WWE Night of Champions 2025: Preview, Match card, livestreaming details and moreThe WWE Night Of Champions is all set to capture the imagination of the fans on Saturday, June 28. Here's a look at all you need to know about the Premium Live Event set to take place at the Kingdom Arena in Riyadh, Saudi Arabia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-birmingham-test-rest-analysis-impact-2747469-2025-06-28",
      "headline": "No Bumrah, no glory? Can India win a Test in England without their ace?England vs India: With Jasprit Bumrah likely to miss the second Test of the Anderson-Tendulkar Trophy, India's already daunting challenge in England has become even more formidable. We explore whether India can win overseas without their pace spearhead and what the numbers, history, and selection options reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-inter-miami-fifa-club-world-cup-attendance-usa-2024-2747454-2025-06-28",
      "headline": "Real Madrid, Inter Miami amongst biggest crowd pullers in Club World CupReal Madrid and Inter Miami are attracting the largest crowds at the FIFA Club World Cup in the USA. The high attendance highlights growing interest in the sport in North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-west-indies-1st-test-match-report-josh-hazlewood-shamar-joseph-2747439-2025-06-28",
      "headline": "Ruthless Australia crush West Indies to take 1-0 lead in Test seriesAustralia defeated West Indies by 159 runs in the opening Test match. Hazlewood's five-wicket haul was key to Australia's commanding victory on a challenging pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/night-of-champions-preview-match-card-livesteaming-details-riyadh-2747402-2025-06-28",
      "headline": "WWE Night of Champions 2025: Preview, Match card, livestreaming details and moreThe WWE Night Of Champions is all set to capture the imagination of the fans on Saturday, June 28. Here's a look at all you need to know about the Premium Live Event set to take place at the Kingdom Arena in Riyadh, Saudi Arabia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-aryna-sabalenka-coco-gauff-dance-off-french-open-viral-video-2747397-2025-06-27",
      "headline": "Aryna Sabalenka and Coco Gauff dance off French Open feud ahead of WimbledonAfter their tense French Open final, Aryna Sabalenka and Coco Gauff were spotted dancing together in a TikTok video at Wimbledon, suggesting the rivalry has softened just in time for the year's third Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-priyank-panchal-interview-gujarat-2747391-2025-06-27",
      "headline": "Competitive Jasprit Bumrah had the spark and vibe to represent India: Priyank PanchalFormer Gujarat batter Priyank Panchal, in an exclusive interview, said that Jasprit Bumrah always had the spark and vibe to represent India from his early days. Bumrah played a big role in Gujarat's Ranji Trophy title-winning campaign in 2016-17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-u19-vs-india-u19-vaibhav-suryavanshi-runs-ayush-mhatre-hove-2747375-2025-06-27",
      "headline": "IPL star Vaibhav Suryavanshi smashes 19-balll 48 against England U-19sAt just 14, Vaibhav Suryavanshi showcased his explosive talent once again, smashing a 19-ball 48 to power India U-19 to a dominant win over England, continuing his dream run from the IPL to international youth cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-mercedes-interest-red-bull-toto-wolff-2747352-2025-06-27",
      "headline": "Max Verstappen to Mercedes? Toto Wolff confirms interest in signing Red Bull starMercedes team principal Toto Wolff has confirmed that they're interested in signing Max Verstappen for next season. Verstappen has been heavily linked with an exit from Red Bull, despite having a contract until 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/lalit-upadhyay-retirement-indian-mens-team-harmanpreet-singh-2747344-2025-06-27",
      "headline": "Lalit Upadhyay says he wanted to retire at peak: Didn't want to drag myselfLalit Upadhyay said that he wanted to retire at the peak of his career and didn't want to drag himself in the sport for long. Upadhyay is a two-time bronze medallist for India at the Olympics and was a vital cog in the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-revises-two-new-balls-rule-odi-cricket-balance-reverse-swing-2747341-2025-06-27",
      "headline": "ICC revises two-ball rule in ODIs: What's the change and why is it important?The ICC has revised the two-new-balls rule in ODIs to address the imbalance favouring batters. This move aims to bring back reverse swing and enhance bowling impact in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-praggnanandhaa-top-ranked-india-player-uzchess-cup-masters-2747325-2025-06-27",
      "headline": "Praggnanandhaa becomes India's top-ranked player with UzChess Cup Masters winR Praggnanandhaa reached a historic milestone when he became the No. 1-ranked Indian chess player in the live rankings. Praggnanandhaa achieved the feat by winning the UzChess Cup Masters by beating Uzbekistan's Nodirbek Abdusattorov"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-dewald-brevis-keshav-maharaj-2747317-2025-06-27",
      "headline": "Dewald Brevis set for debut in Keshav Maharaj-led new-look XIZimbabwe (ZIM) vs South Africa (SA), 1st Test: Keshav Maharaj will lead a new-look XI in the series opener against Zimbabwe. Batting stars Dewald Brevis and Lhuan-dre Pretorius are set to make their debuts on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-3rd-day-colombo-test-report-kamindu-mendis-2747308-2025-06-27",
      "headline": "Sri Lanka close in on series win as Bangladesh collapse under spin pressureSri Lanka's spin dominance and batting grit put them on the verge of an innings victory over Bangladesh in Colombo, with just four wickets separating them from a commanding series sweep at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-warns-fans-fakes-quotes-fact-check-verify-2747171-2025-06-27",
      "headline": "Sunil Gavaskar warns fans on fakes quotes attributed to himSunil Gavaskar has warned fans about websites and individual accounts misusing his name by attributing fake quotes. He implored that the fans always verify and fact-check such information before believing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-premier-league-up-warriorz-jon-lewis-leaves-after-three-years-2747285-2025-06-27",
      "headline": "WPL: UP Warriorz part ways with Jon Lewis after three-year associationUP Warriorz have announced that head coach Jon Lewis has left the role on Friday, June 27. Lewis guided the Warriorz to the play-offs in his first season in charge of the franchise.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}