{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-ends-over-400-points-lower-nifty-falls-as-it-stocks-tumble-2666288-2025-01-17",
      "headline": "Sensex ends over 400 points lower, Nifty falls as IT stocks tumbleThe S&P BSE Sensex ended 423.49 points lower at the closing bell, whil the NSE Nifty50 settled 108.60 points lower at 23,203.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-time-when-will-it-start-timeline-benefits-central-government-employees-salary-hike-2666276-2025-01-17",
      "headline": "How long before 8th Pay Commission benefits reach central government employees?The 7th Pay Commission took around 22 months from its formation to the implementation of its recommendations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-artificial-intelligence-the-new-wolf-of-wall-street-2666190-2025-01-17",
      "headline": "Is artificial intelligence the new wolf of Wall Street?A recent Bloomberg Intelligence report stated that major Wall Street banks, including Citigroup, JPMorgan, and Goldman Sachs, may slash up to 200,000 jobs in the coming 3-5 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bad-credit-here-is-how-you-can-still-secure-emergency-funds-2666242-2025-01-17",
      "headline": "Bad credit? Here's how you can still secure emergency fundsThough bad credit limits borrowing options and raises interest rates, some lenders still offer loans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-epf-to-nps-transfer-possible-check-the-details-here-2666218-2025-01-17",
      "headline": "Is EPF to NPS transfer possible? Check the details hereThe decision to transfer EPF to NPS must align with your financial goals, liquidity needs, and risk appetite. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-salary-hike-how-much-salary-increase-can-government-employees-expect-fitment-factor-2666199-2025-01-17",
      "headline": "8th Pay Commission: How much salary increase can government employees expect?Union Minister Ashwini Vaishnaw confirmed the decision and said that the commission would be formed soon to revise the pay structure for central government employees and pensioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-on-india-gdp-growth-strong-momentum-or-slowdown-in-fy26-2666164-2025-01-17",
      "headline": "Will India's growth story gain momentum or slow down in FY26?India's GDP, which clocked a stellar 9.7% in FY22 before settling at 7% in FY23 and 8.2% in FY24, has been on a roller-coaster ride."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/axis-bank-shares-price-fall-6-percent-to-hit-52-week-low-why-q3-results-should-you-buy-2666114-2025-01-17",
      "headline": "Axis Bank shares drop 6% to hit 52-week low. Should you buy? Axis Bank share price: The stock closed at Rs 1,040.20 in the previous session, opened at Rs 1,006.95 on Friday and slid further to Rs 974.45 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-what-is-fitment-factor-that-determines-salary-hike-2666112-2025-01-17",
      "headline": "8th Pay Commission: What is fitment factor that determines salary hikeThe salary and pension hikes under the 8th Pay Commission will be calculated by applying the fitment factor to the existing basic pay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-rises-over-2-after-q3-results-good-time-to-buy-2666104-2025-01-17",
      "headline": "Reliance share price rises over 2% after Q3 results. Should you buy now? Reliance's share price was up 1.44% to Rs 1,287 at 10:51 am on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-share-price-down-today-overnight-adrs-q3-results-key-reasons-future-outlook-2666088-2025-01-17",
      "headline": "Explained: Why Infosys share price tumbled over 5% after strong Q3 resultsInfosys stock was down 5.40% at Rs 1,822.10 on the BSE at 10:15 a.m. The company's shares had hit a day's low of Rs 1,815.85. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-today-check-key-details-sensex-nifty-q3-results-infosys-axis-bank-2666080-2025-01-17",
      "headline": "Sensex drops 750 points. Why did stock market fall in early trade?Stock market down today: The fall in IT stocks was a result of Infosys' shares falling over 5.3% after the company reported its Q3 results yesterday. The drop, however, came as a surprise as the company raised its revenue forecast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-drops-400-points-markets-tank-as-it-stocks-fall-infosys-falls-4-percent-q3-results-2666065-2025-01-17",
      "headline": "Sensex drops 400 points: Markets tank as IT stocks fall; Infosys down 5%Stock market today: The S&P BSE Sensex was down 430.02 points to 76,612.80, while the NSE Nifty50 tumbled 121.05 points to 23,190.75 as of 9:22 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-plans-to-make-cryptocurrency-national-priority-bitcoin-price-cryptocurrency-report-2666053-2025-01-17",
      "headline": "Donald Trump plans to make cryptocurrency a national priority: ReportThe order will designate cryptocurrency as a national imperative, encouraging government agencies to collaborate with the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-shares-in-focus-today-good-q3-results-5-things-investors-need-to-know-net-profit-2666043-2025-01-17",
      "headline": "RIL shares in focus today post Q3 results: 5 things investors need to know RIL posted a 12% year-on-year (YoY) increase in consolidated net profit to a record Rs 21,930 crore for the third quarter of financial year 2024-25 (FY25)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-approved-pensions-see-big-jump-ups-benefits-what-you-need-to-know-2666039-2025-01-17",
      "headline": "8th Pay Commission: Will pensions see a big jump? Here's what you need to knowThe Union Cabinet approved the 8th Pay Commission on Thursday to revise the salaries of central government employees and pensioners. Union Minister Ashwini Vaishnaw announced the decision and said that the commission will likely be established soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/8-key-expectations-from-budget-2025-tax-reforms-simplified-gst-clarity-on-cryptos-increased-standard-deduction-2665786-2025-01-16",
      "headline": "8 key expectations from Budget 2025With Budget 2025 approaching, people are expecting key reforms like simpler taxes and relief for the middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-tomatoes-to-tiramisu-india-most-delivered-items-in-2024-2665761-2025-01-16",
      "headline": "From tomatoes to tiramisu: India's most delivered items in 2024India's 2024 delivery trends reveal rising demand for food, fashion, and documents, as per Borzo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q3-results-consolidated-net-profit-jumps-11-percent-fy25-revenue-guidance-2665722-2025-01-16",
      "headline": "Infosys Q3 Results: Net profit surges 11% to Rs 6,806 crore, revenue up 8%Infosys Q3 Results: The Bengaluru-based tech giant also revised its revenue guidance for the current fiscal year upward to 4.5%-5%, signaling optimism in its growth trajectory despite global economic uncertainties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-psu-banks-shine-global-cues-boost-sentiment-2665713-2025-01-16",
      "headline": "Sensex, Nifty close higher as PSU banks shine; global cues boost sentimentThe S&P BSE Sensex gained 318.74 points to close at 77,042.82, while the NSE Nifty50 added 98.60 points to end at 23,311.80."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/saif-ali-khan-knife-attack-doctors-briefing-fortunate-lucky-missed-spine-icu-room-health-recovery-hospital-2666160-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan walked into hospital like a tiger, escaped big spine injury: Doctors Live UpdatesDoctors said that even though Saif was in a state of shock and covered in blood, \"he walked in like a tiger.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/taimur-ali-khan-not-ibrahim-ali-khan-accompanied-saif-ali-khan-to-hospital-doctor-2666180-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Taimur, not Ibrahim, accompanied Saif Ali Khan to the hospitalActor Saif Ali Khan was taken to the hospital on Thursday after he suffered stab wounds following a burglary attempt at his house. The actor was accompanied by his son, Taimur Ali Khan to the hospital. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-bjp-poll-promise-rs-500-subsidy-lpg-cylinders-rs-2500-for-women-2666240-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rs 21,000 for pregnant women, Rs 500 LPG subsidy: BJP's promises for DelhiDelhi election BJP manifesto: JP Nadda announced Rs 2,500 per month for women voters. It is being seen as a bid to counter the AAP's Mahila Samman Yojana, promising Rs 2,100 to women beneficiaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/abdul-kadir-bawla-murder-malabar-hills-mumtaz-begum-tukojirao-holkar-iii-muhammad-ali-jinnah-murder-shook-colonial-india-2666130-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When a murder over a courtesan shook the Raj, toppled a raja 100 years agoThe killing of young businessman Abdul Kadir Bawla in Bombay's Malabar Hill 100 years ago, considered the most sensational murder in the British Raj, shook the empire in India. Bawla was with his companion Mumtaz Begum, a courtesan who had escaped the zenana of the princely state of Indore. The probe led to the toppling of a king."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/the-roshans-review-netflix-hrithik-roshan-rakesh-roshan-rajesh-roshan-2666239-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Roshans review: Netflix series is a starry nostalgia that overlooks flawsReleased-Fri Jan 17, 2025Netflix's The Roshans explores the cinematic legacy of one of Bollywood's most iconic families across three generations. While it offers nostalgia, captivating interviews, and musical brilliance, the docu-series avoids delving into the family's missteps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-irfan-pathan-virat-kohli-team-hotel-bcci-guidelines-discipline-2666249-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not talking about Virat Kohli: Irfan Pathan clarifies massive team hotel claimFormer India fast bowler Irfan Pathan clarified that he was not referring to Virat Kohli when he claimed that not all Indian players stayed together in the team hotel during their tour of Australia. The BCCI issued a stringent 10-point disciplinary guideline for the senior men's national team after the disastrous tour of Australia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attacker-new-cctv-footage-video-scarf-covering-face-climbing-stairs-apartment-bandra-home-2666188-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New CCTV clip shows Saif Ali Khan's attacker entering building, face coveredSaif Ali Khan attack: The intruder was again captured on the CCTV at 2.33 am climbing down the stairs calmly. This time his face was clearly visible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/michelle-obama-to-skip-donald-trump-inauguration-break-tradition-barack-obama-divorce-racism-feud-2666204-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Michelle Obama opts out of Trump swearing-in. 'Divorce' has nothing to do with itFormer First Lady Michelle Obama won't be attending Donald Trump's inauguration. It echoes a previous break with tradition when Trump refused to attend Joe Biden's swearing-in over baseless claims that the presidential election was stolen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/emergency-review-kangana-ranaut-indira-gandhi-crash-course-2666166-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Emergency review: Kangana Ranaut delivers a rushed crash course on Indira GandhiReleased-Fri Jan 17, 2025Emergency movie review: Kangana Ranaut's film Emergency briefly touches on the 1975 Emergency while attempting to provide a crash course on Indira Gandhi's life, but struggles to delve deeply into key historical events and character motivations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-aryna-sabalenka-alcaraz-djokovic-live-updates-2666008-2025-01-17?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 6 Live Updates: Novak Djokovic through to pre-quarters, Pegula vs Danilovic underwayAustralian Open 2025 Day 6 Live Updates: Novak Djokovic defeated 26th seed Tomas Machac in straight sets. Coco Gauff eased into the fourth round, beating Leylah Fernandez. It was heartbreak for Naomi Osaka as she was forced to retire after an injury and forfeit her match against Bencic. Osaka had lost the first set in an intense tiebreaker before injury struck. Carlos Alcaraz overcame the Nuno Borges test in 4 sets to progress to the next round of the Australian Open. Alexander Zverev, on the other hand, dominated the UK's Jacob Fearnley to book his spot in the next round as well. Naomi Osaka's third round clash against Bencic is underway. Earlier, Aryna Sabalenka and Rohan Bopanna won their respective matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/paatal-lok-2-review-jaideep-ahlawat-ishwak-singh-tillotama-shome-2666083-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Paatal Lok 2 review: Jaideep Ahlawat show enters a risky, unexplored territoryReleased-Fri Jan 17, 2025Paatal Lok 2 review: Jaideep Ahlawat returns as Hathi Ram Chaudhary after five years with the second season of Paatal Lok. While the rawness and murkiness are restrained, the season ventures into some risky territory. Read the full review here."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-time-when-will-it-start-timeline-benefits-central-government-employees-salary-hike-2666276-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How long before 8th Pay Commission benefits reach central government employees?The 7th Pay Commission took around 22 months from its formation to the implementation of its recommendations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-e-vitara-unveiled-at-bharat-mobility-global-expo-2025-over-500km-range-adas-on-offer-2666227-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maruti enters India's EV space with e Vitara, over 500km range confirmedThe e-VITARA will be available with two battery pack options: a 49kWh and a 61kWh variant. The larger 61kWh battery pack will deliver a range of over 500km.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-stabbed-health-updates-attacker-spotted-police-massive-search-operation-2666090-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan attacker recced Shah Rukh Khan's house, cops suspect: SourcesSaif Ali Khan attack: The CCTV footage recovered from Shah Rukh Khan's house showed that the person's height and build closely resembles the suspect seen in the footage obtained from Saif's flat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/antony-blinken-final-press-conference-gaza-israel-journalist-confront-heckle-ceasefire-deal-2666251-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Journalist bodily removed for heckling 'criminal Blinken' at final briefingThe briefing, which occurred a day after Qatar announced a ceasefire deal between Israel Hamas, saw independent journalist Sam Husseini and Grayzone News editor Max Blumenthal tearing into Antony Blinken."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-caste-census-survey-contrasts-rahul-gandhi-siddaramaiah-shivakumar-vokkaliga-lingayat-2665799-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi's caste con-census in KarnatakaWhile Congress leader Rahul Gandhi has been seeking a pan-India caste census, the party high command prevented the tabling of a caste survey report, commissioned a decade ago, in party-ruled Karnataka. The Congress must have discovered that political rhetoric could become too hot to handle in reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/azaad-review-ajay-devgn-rasha-thadani-amaan-devgan-film-is-too-sweet-to-leave-an-impact-2666128-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Azaad review: Boredom screams louder than the horse's neigh in Rasha-Amaan's filmReleased-Fri Jan 17, 2025Azaad movie review: In Azaad, Rasha Thadani and Amaan Devgan look promising with their debut performance, but that's not enough. This Abhishek Kapoor film looks extremely one-toned, and relies heavily on anthropomorphism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mark-zuckerberg-blames-sheryl-sandberg-meta-culture-issues-dei-policies-trump-meeting-2666174-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zuckerberg blamed Sheryl Sandberg for Meta's culture in Trump meeting: ReportThe report comes as Meta, which owns platforms like Facebook and Instagram, announced that it was ending its fact-checking and its diversity, equity and inclusion (DEI) programs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-breaks-silence-on-people-seeking-ban-on-emergency-in-punjab-complete-harassment-2666225-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Complete harassment: Kangana Ranaut on people seeking ban on Emergency in Punjab Actor Kangana Ranaut reacted to Shiromani Gurdwara Parbandhak Committee's (SGPC) protests against screening her film Emergency in Punjab. She shared a note on X calling the move 'complete harassment'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/suchir-balaji-mother-claims-he-had-documents-against-openai-2666250-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'They Killed Him': Suchir Balaji's mother claims he had documents against OpenAISuchir Balaji was found dead in his San Francisco apartment in November, shortly after he had turned a whistleblower against AI-giant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deva-trailer-review-shahid-kapoor-brings-the-kaminey-thrill-back-in-this-cop-drama-2666247-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Deva trailer review: Shahid Kapoor brings Kaminey thrill back in this cop dramaShahid Kapoor plays a cop who wants 'full freedom' in Deva. The trailer of the film hit the screens on Friday, adding to the anticipation around its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-launches-temporary-store-at-maha-kumbh-mela-to-serve-pilgrims-and-tourists-2666246-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blinkit launches temporary store at Maha Kumbh Mela to serve pilgrims and tourists Items that are available at the Maha Kumbh Mela Blinkit store include pooja essentials, milk, curd, fruits, vegetables, towels, blankets, bedsheets, and even Triveni Sangam Jal bottles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-artificial-intelligence-the-new-wolf-of-wall-street-2666190-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is artificial intelligence the new wolf of Wall Street?A recent Bloomberg Intelligence report stated that major Wall Street banks, including Citigroup, JPMorgan, and Goldman Sachs, may slash up to 200,000 jobs in the coming 3-5 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-pradesh-couple-hosts-630-dish-feast-for-son-in-laws-first-sankranti-2666176-2025-01-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andhra couple hosts 630-dish feast for son-in-law's first SankrantiIn a grand gesture, a couple from Andhra Pradesh hosted a feast with 630 dishes for their son-in-law on their first Sankranti festival after marriage. Similarly, another couple from Yanam, Puducherry, prepared a dinner with 470 varieties for their son-in-law. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-saif-ali-khan-stab-attack-home-during-deva-trailer-launch-2666294-2025-01-17",
      "headline": "Shahid Kapoor on attack on Saif: Shocked by what happened in such personal spaceActor Saif Ali Khan was attacked by an intruder in his home, leading to multiple stab wounds. Shahid Kapoor expressed shock and concern, and said everyone is praying for Saif's speedy recovery at the trailer launch of his new film Deva."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-political-thriller-diplomat-to-release-in-march-2666265-2025-01-17",
      "headline": "John Abraham's political thriller Diplomat to release in MarchBollywood star John Abraham will be seen playing a high-ranking official in the political thriller Diplomat. The film releases in cinemas this March. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deva-trailer-review-shahid-kapoor-brings-the-kaminey-thrill-back-in-this-cop-drama-2666247-2025-01-17",
      "headline": "Deva trailer review: Shahid Kapoor brings Kaminey thrill back in this cop dramaShahid Kapoor plays a cop who wants 'full freedom' in Deva. The trailer of the film hit the screens on Friday, adding to the anticipation around its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/the-roshans-review-netflix-hrithik-roshan-rakesh-roshan-rajesh-roshan-2666239-2025-01-17",
      "headline": "The Roshans review: Netflix series is a starry nostalgia that overlooks flawsReleased-Fri Jan 17, 2025Netflix's The Roshans explores the cinematic legacy of one of Bollywood's most iconic families across three generations. While it offers nostalgia, captivating interviews, and musical brilliance, the docu-series avoids delving into the family's missteps."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-belinda-bencic-gesture-naomi-osaka-australian-open-injury-2666275-2025-01-17",
      "headline": "Get well soon mama: Bencic's special gesture after Osaka's painful exitAustralian Open: Belinda Bencic gave a special signature on the camera with a heartfelt message after Naomi Osaka retired midway from her Round 3 match on Friday due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-karun-nair-hopes-india-comeback-vijay-hazare-trophy-2666267-2025-01-17",
      "headline": "Karun Nair hopeful of India comeback after Vijay Hazare Trophy heroicsVidarbha captain Karun Nair is hopeful of a comeback to the Indian men's cricket team after his sensational run with the bat in the ongoing Vijay Hazare Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-erling-haaland-signs-10-year-deal-with-manchester-city-2666252-2025-01-17",
      "headline": "Premier League: Erling Haaland signs historic 10-year deal with Manchester CityErling Haaland has extended his stay with Manchester City until 2034 as he has signed a new 10-year deal with the club on Friday, January 17. Haaland played a pivotal role in City's success over the past few seasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-irfan-pathan-virat-kohli-team-hotel-bcci-guidelines-discipline-2666249-2025-01-17",
      "headline": "Not talking about Virat Kohli: Irfan Pathan clarifies massive team hotel claimFormer India fast bowler Irfan Pathan clarified that he was not referring to Virat Kohli when he claimed that not all Indian players stayed together in the team hotel during their tour of Australia. The BCCI issued a stringent 10-point disciplinary guideline for the senior men's national team after the disastrous tour of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-naomi-osaka-injury-retires-aryna-sabalenka-fourth-round-2666205-2025-01-17",
      "headline": "Naomi Osaka's campaign cut short by injury, Aryna Sabalenka into 4th roundAustralian Open 2025: Defending champion Aryna Sabalenka overcame a shaky contest to progress to the fourth round. Meanwhile, two-time champion Naomi Osaka retired midway through her third-round match due to an injury on Friday, January 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-australia-vs-england-3rd-odi-report-ashleigh-gardner-alana-king-hobart-2666182-2025-01-17",
      "headline": "Women's Ashes: Gardner, King shine as Australia sweep England in ODIs, take 6-0 leadAshleigh Gardner's maiden hundred and Alana King's 5-wicket haul helped Australia defeat England by 86 runs to win the 3rd ODI and sweep the series on Friday, January 17. Australia have taken a 6-0 lead in the Women's Ashes as England hope to hang by a thread. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-khel-ratna-award-d-gukesh-national-sports-day-president-murmu-2666163-2025-01-17",
      "headline": "Watch: Manu Bhaker, D Gukesh receive Khel Ratna award from PresidentOlympic medallists Manu Bhaker, Harmanpreet Singh, Paralympian Praveen Kumar and world chess champion D Gukesh recieved the Khel Ratna Award, India's highest sporting honour, from President Droupadi Murmu on National Sports Day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-carlos-alcaraz-alexander-zverev-progress-to-round-4-melbourne-2666162-2025-01-17",
      "headline": "Australian Open: Carlos Alcaraz overcomes Borges test in 4 sets, Zverev advancesCarlos Alcaraz overcame a stern test from Nuno Borges in 4 sets, while Alexander Zverev dominated Jacob Fearnley to reach the 4th round of the Australian Open 2025 on Friday, January 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-test-multan-fog-delay-visuals-covers-2666143-2025-01-17",
      "headline": "PAK vs WI: No rain, but dense fog delays start of play in Multan Test matchPakistan vs West Indies, 1st Test: The first session on Day 1 of the series opener was washed out due to dense fog in Multan. The toss was delayed due to poor visibility at the Multan Cricket Stadium on Friday, January 17. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aakash-chopra-provides-simple-solution-to-dressing-room-leaks-in-indian-cricket-2666138-2025-01-17",
      "headline": "Aakash Chopra provides simple solution to leaks in Indian cricketThe Indian cricket team has been plagued with multiple leaks in the past two months. As confidential BCCI updates continue to be reported by the media, Aakash Chopra has has found a unique solution to the problem.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-australia-vs-england-3rd-odi-report-ashleigh-gardner-alana-king-hobart-2666182-2025-01-17",
      "headline": "Women's Ashes: Gardner, King shine as Australia sweep England in ODIs, take 6-0 leadAshleigh Gardner's maiden hundred and Alana King's 5-wicket haul helped Australia defeat England by 86 runs to win the 3rd ODI and sweep the series on Friday, January 17. Australia have taken a 6-0 lead in the Women's Ashes as England hope to hang by a thread. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-khel-ratna-award-d-gukesh-national-sports-day-president-murmu-2666163-2025-01-17",
      "headline": "Watch: Manu Bhaker, D Gukesh receive Khel Ratna award from PresidentOlympic medallists Manu Bhaker, Harmanpreet Singh, Paralympian Praveen Kumar and world chess champion D Gukesh recieved the Khel Ratna Award, India's highest sporting honour, from President Droupadi Murmu on National Sports Day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-carlos-alcaraz-alexander-zverev-progress-to-round-4-melbourne-2666162-2025-01-17",
      "headline": "Australian Open: Carlos Alcaraz overcomes Borges test in 4 sets, Zverev advancesCarlos Alcaraz overcame a stern test from Nuno Borges in 4 sets, while Alexander Zverev dominated Jacob Fearnley to reach the 4th round of the Australian Open 2025 on Friday, January 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-test-multan-fog-delay-visuals-covers-2666143-2025-01-17",
      "headline": "PAK vs WI: No rain, but dense fog delays start of play in Multan Test matchPakistan vs West Indies, 1st Test: The first session on Day 1 of the series opener was washed out due to dense fog in Multan. The toss was delayed due to poor visibility at the Multan Cricket Stadium on Friday, January 17. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aakash-chopra-provides-simple-solution-to-dressing-room-leaks-in-indian-cricket-2666138-2025-01-17",
      "headline": "Aakash Chopra provides simple solution to leaks in Indian cricketThe Indian cricket team has been plagued with multiple leaks in the past two months. As confidential BCCI updates continue to be reported by the media, Aakash Chopra has has found a unique solution to the problem.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ufc-star-jiri-prochazka-wins-hearts-with-special-gesture-for-fan-battling-cancer-2666105-2025-01-17",
      "headline": "UFC star Jiri Prochazka wins hearts with special gesture for fan battling cancerFormer UFC light heavyweight champion Jiri Prochazka won hearts as he decided to shave his head in support of his fan who is battling cervical cancer. Jiri also claimed that he is flying her in for the UFC 311 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-indian-team-dressing-room-leaks-greg-chappell-gambhir-rohit-2666100-2025-01-17",
      "headline": "Dressing room has crashed: Harbhajan compares current team to Chappell eraFormer India spinner Harbhajan Singh has likened the current Indian dressing room to one in the Greg Chappell era. Harbhajan has questioned the number of leaks from the Indian camp and has alleged that the dressing room is broken."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-boss-ruben-amorim-to-be-cautious-with-hero-amad-diallo-praise-2666092-2025-01-17",
      "headline": "Manchester United boss Ruben Amorim to be 'cautious' with hero Amad Diallo praiseManchester United boss Ruben Amorim has claimed that he will be cautious with the praise he would give to Amad Diallo after his hat-trick against Southampton on Thursday, January 16. Amad's hat-trick helped United claim a much-needed win at Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-open-paula-badosa-stefanos-tsitsipas-fight-argument-2666086-2025-01-17",
      "headline": "Paula Badosa snaps at boyfriend Stefanos Tsitsipas for asking her to calm downSpain's Paula Badosa lost her cool at boyfriend Stefanos Tsitsipas in the middle of her Round 3 match in the Australian Open. Badosa snapped at Tsitsipas who was trying to calm her down during the second set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-great-pam-shriver-reveals-her-grand-slam-trophies-were-stolen-after-la-fires-2666084-2025-01-17",
      "headline": "Tennis great reveals her Grand Slam trophies were stolen after LA firesTennis great and multi-time grand slam winner Pam Shriver has revealed that several of her trophies were stolen after the Los Angeles fires. Shriver had stored the trophies in her car, which got stolen from the front of a hotel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-hardik-pandya-practice-together-before-champions-trophy-ind-vs-eng-2666058-2025-01-17",
      "headline": "Rohit Sharma, Hardik Pandya practice together before Champions TrophyRohit Sharma and Hardik Pandya were seen practising together in Mumbai. The duo were seen in Mumbai Indians' nets just days out of the white-ball series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-rohan-bopanna-shuai-zhang-win-first-round-melbourne-2666057-2025-01-17",
      "headline": "Australian Open: Rohan Bopanna-Shuai Zhang secure safe passage into Round 2India's Rohan Bopanna and his Chinese partner Shuai Zhang produced a clinical performance to secure a safe passage into the second round of the mixed doubles in the Australian Open 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-vs-southampton-match-report-amad-diallo-2666047-2025-01-17",
      "headline": "Amad Diallo hat-trick helps Man United clinch comeback win over SouthamptonPremier League: An under-par Manchester United were rescued by Amad Diallo's late hat-trick on Thursday. United clinched a comeback win over last-placed Southampton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-great-pam-shriver-reveals-her-grand-slam-trophies-were-stolen-after-la-fires-2666084-2025-01-17",
      "headline": "Tennis great reveals her Grand Slam trophies were stolen after LA firesTennis great and multi-time grand slam winner Pam Shriver has revealed that several of her trophies were stolen after the Los Angeles fires. Shriver had stored the trophies in her car, which got stolen from the front of a hotel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-hardik-pandya-practice-together-before-champions-trophy-ind-vs-eng-2666058-2025-01-17",
      "headline": "Rohit Sharma, Hardik Pandya practice together before Champions TrophyRohit Sharma and Hardik Pandya were seen practising together in Mumbai. The duo were seen in Mumbai Indians' nets just days out of the white-ball series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-rohan-bopanna-shuai-zhang-win-first-round-melbourne-2666057-2025-01-17",
      "headline": "Australian Open: Rohan Bopanna-Shuai Zhang secure safe passage into Round 2India's Rohan Bopanna and his Chinese partner Shuai Zhang produced a clinical performance to secure a safe passage into the second round of the mixed doubles in the Australian Open 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-vs-southampton-match-report-amad-diallo-2666047-2025-01-17",
      "headline": "Amad Diallo hat-trick helps Man United clinch comeback win over SouthamptonPremier League: An under-par Manchester United were rescued by Amad Diallo's late hat-trick on Thursday. United clinched a comeback win over last-placed Southampton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-neymar-can-no-longer-play-at-the-level-we-are-used-to-al-hilal-boss-jorge-jesus-2666048-2025-01-17",
      "headline": "Neymar can no longer play at the level we are used to: Al-Hilal boss Jorge JesusAl-Hilal boss Jorge Jesus revealed that Neymar Jr. hasn't been registered for the Saudi Pro League this season and claimed that the Brazilian cannot compete any more at the level they are playing at the moment. Neymar has struggled with injuries since his move to Al-Hilal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-t20i-series-team-camp-kolkata-3-days-2666031-2025-01-17",
      "headline": "India to hold 3-day camp at Eden Gardens before T20I series vs EnglandThe Indian T20I team is set to hold a 3-day camp at the Eden Gardens. The team will arrive in Kolkata on Saturday, January 18 and sharpen their skills before their series opener vs England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-pcb-stadiums-karachi-lahore-renovation-under-construction-journalists-not-allowed-2666027-2025-01-17",
      "headline": "As D-Day approaches, PCB restricts movement near under-construction stadiumsChampions Trophy: As deadline-day approaches, the Pakistan Cricket Board has restricted movements near the under-construction stadiums of Karachi and Gaddafi. The move from the PCB comes after multiple vloggers posted video footage of the ongoing work on the stadiums."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}