{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-imposes-three-year-tariff-on-select-steel-products-to-curb-cheap-imports-mainly-from-china-2844293-2025-12-30",
      "headline": "India imposes 3-year steel tariffs, targets cheap China importsIndia has imposed higher import duties on select steel products after trade regulators flagged a sharp rise in low-priced imports hurting domestic steelmakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-worlds-4th-largest-economy-on-track-to-overtake-germany-by-2030-says-government-2844234-2025-12-30",
      "headline": "India becomes 4th-largest economy by overtaking Japan, set to pip Germany by 2030India's real GDP grew 8.2 per cent in Q2 of 2025-26, driven by strong domestic consumption, urban demand, and structural reforms, the Centre said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-treating-bonuses-as-permanent-income-can-backfire-on-your-finances-2844139-2025-12-30",
      "headline": "Why treating bonuses as permanent income can backfire on your financesMany people see bonuses as extra money and quickly adjust their spending or investments. But treating variable income as permanent can quietly strain finances and create stress later, even when salaries remain unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-asks-chipmakers-to-use-at-least-50-local-equipment-report-2844068-2025-12-30",
      "headline": "China asks chipmakers to use at least 50% local equipment: ReportLarge public investments are supporting this push. Through the government-backed \"Big Fund\", China has poured hundreds of billions of yuan into the sector, including a major new funding phase launched in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-marginally-lower-as-fii-outflows-weigh-on-investors-2843994-2025-12-30",
      "headline": "Sensex, Nifty end marginally lower as FII outflows weigh on investorsThe S&P BSE Sensex lost 20.46 points to close at 84,675.08, while the NSE Nifty50 was down by just 3.25 points to end at 25,938.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/home-buying-india-expensive-when-to-buy-turn-property-into-wealth-2843975-2025-12-30",
      "headline": "Home buying with purpose: Simple steps to turn property into wealthAcross metro cities and several tier-2 cities, residential prices have moved up steadily over the last decade. Land prices have increased, construction costs are higher, and most new housing supply is coming in the mid to premium segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/richest-indian-mukesh-ambani-biggest-wealth-gainer-2025-india-billionaires-bloomberg-list-2843917-2025-12-30",
      "headline": "These Indian billionaires added the most wealth in 2025According to the Bloomberg Billionaires Index, Mukesh Ambani was the biggest wealth gainer among Indian billionaires in 2025. Ambani added $16.50 billion to his net worth during the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-year-2026-5-easy-personal-finance-tips-for-better-money-control-2843903-2025-12-30",
      "headline": "New Year 2026: 5 easy personal finance tips for better money controlWith rising costs and busy lives, managing money can feel overwhelming. As 2026 begins, these easy personal finance tips can help you stay organised and confident about your money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/last-date-for-revised-itr-is-tomorrow-december-31-will-the-deadline-be-extended-2843864-2025-12-30",
      "headline": "Last date for revised ITR is tomorrow, December 31: Will the deadline be extended?There is only one day left to file a revised ITR for the current assessment year. With growing pressure on taxpayers and professionals, many are now wondering whether the Income Tax Department will extend the revised ITR deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tonino-lamborghini-residences-launch-al-marjan-island-bollywood-luxury-living-2843866-2025-12-30",
      "headline": "BNW unveils Tonino Lamborghini Residences in Ras Al KhaimahBNW Developments introduced the first Tonino Lamborghini Residences in Ras Al Khaimah with a launch attended by celebrities and industry stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/only-1-day-left-for-pan-aadhaar-linking-deadline-of-december-31-are-you-legally-exempt-2843833-2025-12-30",
      "headline": "Only 1 day left for PAN–Aadhaar linking deadline: Are you legally exempt?With December 31 just a day away, taxpayers are running out of time to link PAN with Aadhaar. For most people, the process is mandatory, but some individuals are legally exempt from this requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-hikes-pilot-allowances-after-rostering-chaos-flight-cancellations-2843803-2025-12-30",
      "headline": "IndiGo hikes pilot allowances after rostering chaos, flight cancellationsThe revised allowances will come into effect from January 1 and apply across multiple categories, including domestic layover, night operations, deadhead travel and a newly introduced tail-swap allowance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-lifetime-highs-china-new-rule-january-supply-tightens-market-factor-behind-record-rally-2843779-2025-12-30",
      "headline": "Explained: Silver's record rally and the China connectionDespite a recent dip, silver is still up more than 150% for the year. Silver prices recently climbed to around $82.5 an ounce, or roughly Rs 254,000 per kg, marking a lifetime high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-copper-metal-rally-beats-equities-stock-market-2025-key-reasons-explained-2843759-2025-12-30",
      "headline": "Why gold, silver and copper left stocks behind in 2025In a year defined by uncertainty, metals quietly did the heavy lifting, reminding investors that when confidence fades and supply tightens, tangible assets often speak louder than forecasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-opens-130-points-lower-nifty-below-26000-tata-steel-down-1-percent-2843731-2025-12-30",
      "headline": "Sensex opens 130 points lower, Nifty below 26,000; Tata Steel down 1%The S&P BSE Sensex was down by 113.64 points to 84,581.90, while the NSE Nifty50 lost 29.60 points to 25,912.50 as of 9:36 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-today-why-silver-rates-are-falling-what-investors-should-know-india-2843725-2025-12-30",
      "headline": "Silver prices today: Why are rates falling and what should investors knowSilver fell 8.7% in a single day, marking its biggest one-day fall since August 2020. This sharp drop cleared some excess heat from a rally that had turned very steep in recent weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-rates-today-fall-after-record-rally-price-outlook-india-what-should-investors-know-mcx-2843715-2025-12-30",
      "headline": "Gold, silver rates: Are prices rising or falling today?Gold and silver have seen a very strong rally this year. The sharp rise in silver prices has been driven by supply limits, low stock levels, and strong demand from both industry and investors, while gold has seen a surge due to safe haven demand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-rial-collapse-protests-central-bank-chief-resigns-inflation-rise-glbs-2843696-2025-12-30",
      "headline": "Protests erupt in Iran as currency hits record low, central bank chief quitsIran's largest protests in three years erupted after the rial plunged to a record low, driving up prices, forcing the central bank chief's resignation and intensifying anger over inflation and economic mismanagement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-banking-sector-shows-stability-bad-loans-fall-to-multi-decade-low-report-2843512-2025-12-29",
      "headline": "Indian banking sector shows stability, bad loans fall to multi-decade low: ReportIndia's banking sector has shown resilience in 2025, with strong growth, improved asset quality, and attention to emerging climate risks, according to a recent Reserve Bank of India report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-crude-oil-imports-rise-in-december-as-delhi-continues-buying-from-moscow-2843511-2025-12-29",
      "headline": "India's crude oil imports rise in December as Delhi continues buying from MoscowIndia's Russian oil imports are poised to top 1 million barrels per day in December, defying expectations for a sharp decline as refiners have resumed buying from non-sanctioned entities offering deep discounts."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dragon-fame-ashwath-marimuthu-in-talks-to-direct-rajinikanths-thalaivar-173-report-2844181-2025-12-31",
      "headline": "Dragon fame Ashwath Marimuthu in talks to direct Rajinikanth's Thalaivar 173: Report With several directors having narrated scripts over the past few months, reports now suggest that Dragon director Ashwath Marimuthu has emerged as the frontrunner to helm Rajinikanth's next film, tentatively titled Thalaivar 173."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/golden-sparrow-most-watched-tamil-song-youtube-2025-2844033-2025-12-30",
      "headline": "Golden Sparrow emerges as YouTube's most-watched Tamil track of 2025 The song Golden Sparrow from Dhanush's Nilavukku En Mel Ennadi Kobam emerged as the most-viewed Tamil song on YouTube in 2025. GV Prakash shared the update on X and thanked his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-finale-trailer-epic-ending-sets-stage-for-ultimate-vecna-showdown-2844286-2025-12-30",
      "headline": "Stranger Things 5 finale trailer: Epic ending sets stage for ultimate Vecna showdown The Stranger Things Season 5 finale titled The Rightside Up will release on December 31, streaming on Netflix and screening in theatres. The final episode promises an epic showdown as Eleven prepares to face Vecna and the fate of Hawkins hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-love-and-war-delay-leaves-ramayana-team-disappointed-2844262-2025-12-30",
      "headline": "Ranbir Kapoor's Love and War delay leaves Ramayana team disappointed: Report Ranbir Kapoor's Love and War, directed by Sanjay Leela Bhansali, has reportedly been delayed with its release now likely in August or September 2026. The extended shoot has also impacted the timeline of Ramayana, leaving some members of the team disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avengers-doomsday-teaser-chris-hemsworth-god-of-thunder-invokes-odin-before-war-2844199-2025-12-30",
      "headline": "Avengers Doomsday teaser: Chris Hemsworth's God of Thunder, invokes Odin before war Chris Hemswotrth is set to return as the God of Thunder, Thor in Marvel's Avengers: Doomsday: The film also features actor Chris Evans in a pivotal role.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-in-talks-to-lead-don-3-after-ranveer-singh-exit-2844198-2025-12-30",
      "headline": "Hrithik Roshan in talks to lead Don 3 after Ranveer Singh's exit: Report Hrithik Roshan has reportedly emerged as a strong contender to lead Don 3 after Ranveer Singh's reported exit from the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-sends-condolences-to-mohanlal-after-mother-santhakumari-death-2844159-2025-12-30",
      "headline": "Kamal Haasan sends condolences to Mohanlal after mother Santhakumari's death Kamal Haasan expressed condolences to Mohanlal after the death of his mother, Santhakumari, at the age of 90. Haasan assured Mohanlal of his friends' unwavering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-hiddleston-returns-loki-avengers-doomsday-fresh-marvel-storyline-2844121-2025-12-30",
      "headline": "Tom Hiddleston opens up about Loki's role in Avengers: Doomsday Tom Hiddleston reveals insights into his enduring connection with Loki and shares details about his upcoming projects, including the highly anticipated Avengers: Doomsday and his return to The Night Manager."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-most-disturbing-moment-nearly-didnt-happen-actor-naseem-shares-why-2844168-2025-12-30",
      "headline": "Dhurandhar's most disturbing moment nearly didn't happen, actor Naseem shares why Actor Naseem shared that he initially refused to perform Dhurandhar's disturbing assault scene with Ranveer Singh due to fear and nervousness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-honours-dharmendra-at-ikkis-screening-wears-late-father-iconic-shirt-2844071-2025-12-30",
      "headline": "Bobby Deol honours Dharmendra at Ikkis screening, wears late father's iconic shirt Actor Bobby Deol attended the screening of 'Ikkis' with his wife Tanya, paying an emotional tribute to Dharmendra by wearing his late father's white, plant-printed shirt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rashmika-mandanna-celebrates-9-years-in-cinema-with-a-heartfelt-note-2844082-2025-12-30",
      "headline": "Rashmika Mandanna celebrates 9 years in cinema with a heartfelt note: Full of joy Rashmika Mandanna celebrated nine years in cinema with an emotional note thanking her fans for their constant love and support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/malcolm-in-the-middle-revival-trailer-original-cast-hulu-disneyplus-2844064-2025-12-30",
      "headline": "Malcolm in the Middle revival trailer reunites Frankie Muniz, Bryan Cranston Hulu and Disney+ announce the revival of Malcolm in the Middle, unveiling a trailer and confirming the original cast's return for a special four-part event set to premiere in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/teja-sajja-not-exiting-jai-hanuman-team-shuts-down-baseless-rumours-2844039-2025-12-30",
      "headline": "Teja Sajja not exiting Jai Hanuman, team shuts down baseless rumours Speculation around Teja Sajja's upcoming projects has been put to rest after an official clarification from his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-coogler-recalls-scrapped-black-panther-2-story-about-tchalla-and-his-son-2844031-2025-12-30",
      "headline": "Ryan Coogler recalls scrapped Black Panther 2 story about T'Challa and his son Director Ryan Coogler revealed that the original 'Black Panther' (2018) sequel would have centred on T'Challa, his son, and the ancient \"Ritual of 8,\" with an in-progress attack by Namor. Coogler admitted he loved that initial script deeply."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-alleged-paid-negative-pr-campaign-against-her-ap-dhillon-2844053-2025-12-30",
      "headline": "Tara Sutaria calls out alleged paid negative PR campaign against her and AP Dhillon Tara Sutaria has accused unnamed parties of running a paid negative PR campaign against her and AP Dhillon. The incident highlights growing concerns over organised online harassment and influencer accountability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-tops-google-india-2025-most-searched-films-rooted-storytelling-2843951-2025-12-30",
      "headline": "Kantara Chapter 1 records strong search volume on Google India in 2025 Rishab Shetty's Kantara Chapter 1 made a strong impact in 2025, with Indian audiences searching for the film in large numbers, as shown by Google India's Year Ender list. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-sharma-fatima-sana-celebs-get-emotional-after-watching-dharmendra-in-ikkis-2844052-2025-12-30",
      "headline": "Anil Sharma, Fatima Sana, celebs get emotional after watching Dharmendra in Ikkis The makers of Dharmendra's last film 'Ikkis' hosted a star-studded screening to honour the veteran actor's legacy. After the show, several celebrities praised the film and celebrated Dharmendra's remarkable body of work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-celebrates-30th-birthday-livestream-reunion-military-service-completion-2844036-2025-12-30",
      "headline": "BTS celebrates V's birthday with rooftop madness and gym sessions The members of BTS marked V's 30th birthday with a series of livestreams from HYBE's rooftop and gym, delighting fans worldwide as they reunited following their military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-malti-chahar-clears-air-on-amaal-mallik-dating-rumours-2844034-2025-12-30",
      "headline": "BB19's Malti Chahar clears air on Amaal Mallik dating rumours: No relationship ever Bigg Boss 19 fame Malti Chahar has clarified that she never dated singer Amaal Mallik and that they met only once before the show."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-imposes-three-year-tariff-on-select-steel-products-to-curb-cheap-imports-mainly-from-china-2844293-2025-12-30",
      "headline": "India imposes 3-year steel tariffs, targets cheap China importsIndia has imposed higher import duties on select steel products after trade regulators flagged a sharp rise in low-priced imports hurting domestic steelmakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shipment-didnt-include-weapons-uae-rejects-saudis-claim-urges-restraint-amid-tensions-after-yemen-blast-2844188-2025-12-30",
      "headline": "Yemen bombed over 'arms shipment': Saudi-UAE tensions explained in 10 pointsSaudi Arabia bombed Yemen's port city of Mukalla on Tuesday, saying it was targeting a shipment of weapons from the United Arab Emirates allegedly meant for separatist forces within Yemen. Quick to rebut the claim, the UAE clarified that the shipment neither carried any weapons nor was it intended for any Yemeni group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-sanctions-iran-venezuela-drone-missile-trade-glbs-2844298-2025-12-31",
      "headline": "US issues fresh sanctions related to Iran and Venezuela over drone, missile tradeAccording to US officials, those sanctioned include a Venezuelan company and its chairman, accused of purchasing Iranian-made drones. The list also names three Iranian men allegedly involved in efforts to acquire chemicals used in ballistic missile production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-worlds-4th-largest-economy-on-track-to-overtake-germany-by-2030-says-government-2844234-2025-12-30",
      "headline": "India becomes 4th-largest economy by overtaking Japan, set to pip Germany by 2030India's real GDP grew 8.2 per cent in Q2 of 2025-26, driven by strong domestic consumption, urban demand, and structural reforms, the Centre said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-uae-relations-yemen-port-bombing-abu-dhabi-riyadh-reaction-crisis-iran-missile-east-israel-houthi-2844219-2025-12-30",
      "headline": "Leave Yemen in 24 hours: Why Saudi Arabia warned brother UAE with bombsSaudi Arabia issued a stark warning to its brother nation, the UAE, as it launched an airstrike on Yemen's Mukalla port. Riyadh said it targeted weapons shipped from the UAE meant for a separatist outfit, and the Saudi-backed Yemenese regime issued a 24-hour ultimatum for Abu Dhabi's forces to leave Yemen. What has made the two Arab powerhouses take on one another?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/siddaramaiah-aims-karnataka-longest-serving-chief-minister-surpassing-devaraj-urs-2844288-2025-12-31",
      "headline": "Natti chicken feast planned as Siddaramaiah closes in on record Karnataka CM tenureWith a week to go, Siddaramaiah is poised to break Devaraj Urs's record and cement his legacy as Karnataka's longest-serving chief minister.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-board-exams-2026-datesheet-revised-class-10-12-exams-new-dates-2844022-2025-12-30",
      "headline": "CBSE reschedules Class 10, 12 board exams set for March 3. Check revised datesThe CBSE Class 10 and Class 12 exams earlier set for March 3, 2026, have been rescheduled due to administrative reasons, while all other exam dates remain unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eam-jaishankar-to-visit-dhaka-tomorrow-to-attend-ex-bangladesh-pm-khaleda-zias-funeral-2844073-2025-12-30",
      "headline": "Jaishankar to attend Khaleda Zia's funeral amid strained ties with BangladeshThe act is seen as New Delhi's outreach to Dhaka at a time when India's relationship with its South Asian ally has plunged, ever since Sheikh Hasina was ousted in a student uprising last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-vande-bharat-sleeper-aces-180-kmph-trial-water-test-proves-ride-stability-2844294-2025-12-31",
      "headline": "Video: Vande Bharat Sleeper train aces 180 kmph trial, water test shows stabilityThe test was conducted under the supervision of the Commissioner of Railway Safety, and a demonstration of ride stability using glasses of water – remaining steady even at top speed – highlighted the train's technological sophistication, Railway Minister Ashwini Vaishnaw said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jfks-granddaughter-tatiana-schlossberg-dies-at-35-after-leukemia-battle-glbs-2844299-2025-12-31",
      "headline": "JFK's granddaughter Tatiana Schlossberg dies at 35 after leukemia battleTatiana Schlossberg, journalist and granddaughter of John F. Kennedy, has died at 35 after battling a rare form of acute myeloid leukemia, her family and the JFK Library said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hindu-garment-worker-shot-by-colleague-inside-bangladesh-factory-third-such-killing-in-2-weeks-2844010-2025-12-30",
      "headline": "Hindu worker shot by colleague in Bangladesh factory, 3rd such killing in 2 weeksA Hindu garment factory security guard was killed inside a factory in Bangladesh's Mymensingh district after a colleague allegedly fired a government-issued shotgun during duty hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-and-robert-vadra-son-raihan-vadra-to-get-engaged-to-longtime-girlfriend-aviva-beg-sources-2843842-2025-12-30",
      "headline": "Priyanka Gandhi's son Raihan Vadra to get engaged to girlfriend Aviva BaigRaihan Vadra, son of Priyanka Gandhi Vadra and Robert Vadra, is set to get engaged to Aviva Baig in a private family event in Rajasthan. The ceremony is planned for early January 2026, keeping the celebrations intimate and away from public attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/plan-new-year-eve-better-gig-workers-from-zomato-blinkit-swiggy-and-other-apps-are-going-on-strike-2843312-2025-12-29",
      "headline": "Gig workers from Zomato, Blinkit, Swiggy and other apps are going on strikeDelivery workers across major platforms including Zomato, Swiggy, Blinkit, Zepto and Amazon are planning a strike on December 31. The strike is being held to highlight growing concerns of  workers around low pay, weak job security and safety risks in India's gig economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/find-everything-your-baby-needs-this-holiday-season-on-amazons-everyday-essentials-2842500-2025-12-27",
      "headline": "Find everything your baby needs this holiday season on Amazon's Everyday EssentialsAs part of the New Year selections, the specially curated New Year Store —available until 31 December 2025—brings up to 50% off across a wide selection of everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protest-tehran-rial-value-2025-mullahs-must-leave-anti-khamenei-unrest-us-trump-sanctions-impact-2843861-2025-12-30",
      "headline": "Mullahs must leave: Massive protests break out in Iran. Is there a Trump angle?Iran is witnessing its largest unrest in three years. Chants of \"mullahs must leave\" and \"death to the dictator\" have echoed across major Iranian cities as protesters clashed with security forces of the Ayatollah Ali Khamenei-led theocratic regime. The eruption of anger and turmoil has been fuelled by a collapsing rial, record inflation and years of sanctions, amid renewed American pressure under US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-h1b-update-indias-h1b-visa-push-driven-by-remittance-money-nikki-haleys-son-at-it-again-2843997-2025-12-30",
      "headline": "India's H-1B push driven by remittance greed: Nikki Haley's son at it againNalin Haley, son of Indian-origin Republican leader Nikki Haley, has once again spoken against the H-1B visa programme, used by Indian techies. In a recent post on X, he argued that India's recent request to the US to resolve H-1B visa delays was driven by the government's eye on the remittance money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-pot-one-sailor-life-aboard-insv-kaundiya-shows-india-voyage-back-maritime-history-indian-ocean-muscat-oman-ship-pics-2844222-2025-12-30",
      "headline": "One pot, one sailor: Life aboard INSV Kaundiya revives India's maritime legacyINSV Kaundinya's maiden voyage from Porbandar to Muscat is recreating ancient Indian seafaring, with sailors living under austere conditions, rationing water stored in earthen pots and sleeping on open decks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-sri-lanka-women-5th-t20i-india-outclass-sri-lanka-clean-sweep-g-kamalini-debut-2844270-2025-12-30",
      "headline": "5th WT20I: India thump Sri Lanka to complete 5-0 clean sweep, ends 2025 with a bangWith the final game of the series, Sri Lanka finally decided to wake up and put up their best performance in the series. But India proved to be too good for them as they went on to take the win by XX runs to complete the 5-0 series whitewash in Thiruvananthapuram on Tuesday, December 30. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shilpa-shetty-goa-club-bastian-operates-despite-grave-violations-even-after-birch-fire-2844037-2025-12-30",
      "headline": "VIP treatment? Shilpa Shetty's Goa club runs despite violations even after Birch fireIndia Today TV has learnt that Shilpa Shetty's Bastian is running illegally amid Coastal Regulation Zone (CRZ) violations in Goa. Despite an earlier demolition order, the Goa Coastal Zone Management Authority (GCZMA) has granted further time. Not many other club owners have been so fortunate since the Birch fire incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-leaders-chickens-neck-threat-nagaland-minister-temjen-imna-along-2844056-2025-12-30",
      "headline": "Know more on cutting necks: Naga minister's warning over Chicken's Neck threatNagaland minister Temjen Imna Along's warning comes at a time when radical elements in Bangladesh have raked up politics over India's strategically crucial Chicken's Neck, which connects the country to the Northeast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-finale-trailer-epic-ending-sets-stage-for-ultimate-vecna-showdown-2844286-2025-12-30",
      "headline": "Stranger Things 5 finale trailer: Epic ending sets stage for ultimate Vecna showdownThe Stranger Things Season 5 finale titled The Rightside Up will release on December 31, streaming on Netflix and screening in theatres. The final episode promises an epic showdown as Eleven prepares to face Vecna and the fate of Hawkins hangs in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sunny-leones-new-year-event-in-mathura-cancelled-after-seers-religious-groups-object-2843989-2025-12-30",
      "headline": "'Mathura is a divine land': Sunny Leone's New Year event cancelled as seers objectActor Sunny Leone's New Year 2026 event, planned at a restaurant in Uttar Pradesh's Mathura, was cancelled after strong objections from seers and religious organisations, who said such a programme was inappropriate for the holy city of Braj Bhumi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-retired-railway-employee-starved-to-death-disabled-daughter-held-captive-mahoba-2843878-2025-12-30",
      "headline": "UP man starved to death, daughter a bag of bones: Servants' greed fuels horrorRetired railway employee Om Prakash Singh Rathore, 70, died of starvation and neglect, while his mentally-challenged daughter, Rashmi was found in a skeletal condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/the-aravallis-remained-the-mughals-unfinished-conquest-but-how-2843581-2025-12-29",
      "headline": "The Aravallis remained the Mughals' unfinished conquest. But how?When the Rajputs turned the Aravallis into a battleground, it left the Mughals with unfinished business. Despite conquering large parts of Hindustan, the Mughals failed to secure decisive or lasting gains in this mountain belt. Even the Delhi Sultanate had faced similar resistance.\r\nThe Aravallis served as natural barriers for anyone moving from north to south into Rajasthan, or from east to west across the region. Maharana Pratap, Rana Raj Singh, and Veer Durgadas Rathore, drew their strength from the toughest terrain in India.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-selfie-india-women-sri-lanka-5-0-t20i-series-2844285-2025-12-30",
      "headline": "Jemimah selfie, debutants lifting trophy: India sign off in style after Sri Lanka sweep Jemimah Rodrigues took her signature selfie and the debutants Kamalini and Vaishanavi Sharma lifted the trophy for the side as India celebrated their 5-0 series win over Sri Lanka in style on Tuesday, December 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-bronze-world-blitz-championship-indian-chess-2844277-2025-12-30",
      "headline": "Carlsen reaches World blitz C'ships final after turnaround, Erigaisi gets bronze Arjun Erigaisi's remarkable World Blitz campaign ended with a semifinal loss to Nodirbek Abdusattorov, earning the Indian Grandmaster a historic double bronze. Magnus Carlsen set up a final showdown with Abdusattorov after overcoming Fabiano Caruana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-sri-lanka-women-5th-t20i-india-outclass-sri-lanka-clean-sweep-g-kamalini-debut-2844270-2025-12-30",
      "headline": "5th WT20I: India thump Sri Lanka to complete 5-0 clean sweep, ends 2025 with a bang With the final game of the series, Sri Lanka finally decided to wake up and put up their best performance in the series. But India proved to be too good for them as they went on to take the win by XX runs to complete the 5-0 series whitewash in Thiruvananthapuram on Tuesday, December 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-perth-scorchers-vs-sydney-thunder-uber-taxi-2844235-2025-12-30",
      "headline": "BBL: Taxi breaks down, Perth Scorchers players arrive at stadium by pushing Uber BBL: Hilarious scenes unfolded on Tuesday after some of the Perth Scorchers players got stuck on their way to the stadium. While travelling to the stadium, their Uber broke down, but they managed to revive the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-phillips-super-smash-switch-hit-video-2844196-2025-12-30",
      "headline": "Watch: Glenn Phillips turns left hander, stuns fans with mega sixes New Zealand batter Glenn Phillips stunned the crowd by turning into a left-hander. Playing in the Super Smash, Phillips slam-banged his way to an unbeaten 90 runs off just 48 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-retirement-ashes-2025-26-michael-clarke-scg-test-2844194-2025-12-30",
      "headline": "How Usman Khawaja should retire after 5th Ashes Test? Ex-Australia captain reveals plan Michael Clarke has tipped Usman Khawaja to retire from cricket after the SCG Test. Clarke is hoping that Khawaja can sign off on a high by scoring a hundred in front of his home crowd in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-fumbles-chess-pieces-defeat-world-blitz-championship-2025-watch-video-2844152-2025-12-30",
      "headline": "Watch: Magnus loses cool again, board fumble leads to defeat at World Blitz C'ship Magnus Carlsen suffered a bizarre loss at the World Blitz Championship after fumbling his pieces with seconds left, leading to defeat against Haik Martirosyan in Doha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sl-5th-wt20i-kamalini-debut-smriti-mandhana-rested-2844147-2025-12-30",
      "headline": "IND vs SL: Smriti Mandhana rested for final T20I, India hand G Kamalini debut India have decided to rest Smriti Mandhana for the final T20I of the series against Sri Lanka. They have handed the young prodigy G Kamalini her debut for the match in Trivandrum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lasith-malinga-sri-lanka-coaching-staff-bowling-consultant-t20-world-cup-2026-2844114-2025-12-30",
      "headline": "Lasith Malinga joins Sri Lanka's coaching staff ahead of T20 World Cup 2026 Lasith Malinga has been appointed Sri Lanka's fast-bowling consultant as part of their preparations for the ICC Men's T20 World Cup 2026, bringing vast white-ball and coaching experience to the setup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-sl-w-5th-t20-live-score-india-women-sri-lanka-women-match-2844086-2025-12-30",
      "headline": "5th Women's T20I Highlights: India complete 5-0 sweep with 15-run win India Women vs Sri Lanka Women Highlights: A commanding performance from the bowlers and a brilliant fifty from Harmanpreet Kaur was enough as India complete the 5-0 sweep over Sri Lanka to head into the new year with a big win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-khushi-mukherjee-suryakumar-yadav-message-2844063-2025-12-30",
      "headline": "Suryakumar Yadav used to message me a lot: Actor makes explosive claimActor Khushi Mukherjee has gone viral on social media after making a bombshell claim involving the India T20I captain. Mukherjee has claimed that Suryakumar Yadav used to message her frequently in the past. However, she has denied any romantic involvement with a cricketer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/oman-names-jatinder-singh-captain-2026-icc-t20-world-cup-squad-2844057-2025-12-30",
      "headline": "T20 World Cup 2026: Oman name Jatinder Singh as captain, leave out veteran KaleemOman's most experienced player, Jatinder Singh, will captain the national team at the 2026 ICC Men's T20 World Cup after missing the previous edition. The squad features five changes from the Asia Cup, with veteran Aamir Kaleem omitted despite recent strong performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-greg-chappell-column-ashes-2844051-2025-12-30",
      "headline": "Australia, England are disregarding Ashes, disrespecting Test cricket: ChappellAshes: Legendary Greg Chappell has lashed out at the Australia and England teams after the Boxing Day Test match failed to last two days. In a scathing column, Chappell has written that both teams are disrespecting the legacy of Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ellyse-perry-withdraws-wpl-2026-replaces-rcb-annabel-sutherland-2844035-2025-12-30",
      "headline": "Ellyse Perry withdraws from WPL 2026 in big blow for Royal Challengers BengaluruEllyse Perry has withdrawn from the Women's Premier League 2026 due to personal reasons, with Sayali Satghare named as her replacement. USA pacer Tara Norris and Australian all-rounder Annabel Sutherland have also pulled out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-brisbane-heat-exit-early-knee-injury-t20-world-cup-2844030-2025-12-30",
      "headline": "Shaheen Shah Afridi returns home from BBL with knee injury ahead of T20 World CupPakistan's Shaheen Shah Afridi will return home from the Big Bash League after suffering a knee cartilage injury while fielding for Brisbane Heat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-eden-gardens-pitch-rating-satisfactory-india-south-africa-test-series-2844023-2025-12-30",
      "headline": "ICC agrees with Gautam Gambhir's assessment, spares Kolkata pitch a poor ratingThe ICC rated the Eden Gardens pitch as 'satisfactory' despite criticism following India's Test defeat to South Africa. The decision contrasted with the Melbourne Cricket Ground receiving an 'unsatisfactory' rating, underlining differing pitch standards in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-olympic-association-launches-first-national-athletes-forum-strengthen-governance-2844011-2025-12-30",
      "headline": "Indian Olympic Association to host first athlete-led forum in Ahmedabad on Jan 10The Indian Olympic Association will convene its inaugural National Athletes' Forum on 10 January in Ahmedabad. The event aims to give athletes a direct role in shaping sports governance, with a focus on athlete rights, welfare, and policy reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-maiden-t20-century-wellington-super-smash-wpl-mumbai-indians-2844005-2025-12-30",
      "headline": "Sensational Amelia Kerr warms up for WPL 2026 with maiden T20 centuryMumbai Indians' Amelia Kerr warmed up for WPL 2026 in emphatic fashion, smashing her maiden T20 century to lead Wellington to a 49-run win against Auckland and underline her all-round value ahead of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-noosa-trip-drinking-row-investigation-clean-chit-2844008-2025-12-30",
      "headline": "Ashes: England players cleared as investigation into excessive drinking row endsAccording to a report from the Daily Mail, the England players have been given a clean chit as the investigation into the excessive drinking row has come to an end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-hockey-pay-dispute-senior-players-threaten-boycott-over-reduced-daily-allowance-2843956-2025-12-30",
      "headline": "Pakistan hockey players threaten FIH Pro League boycott as pay dispute continuesSenior Pakistan hockey players have threatened to boycott the upcoming fixtures in Australia, citing significant discrepancies in daily allowances paid for the recent Argentina leg of the FIH Pro League. The dispute centers on a gap between the amount promised and the amount received, with federation and board officials citing conflicting policies and funding restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/barcelona-president-joan-laporta-accused-of-fraud-ordered-to-appear-in-court-report-2843954-2025-12-30",
      "headline": "Barcelona president Joan Laporta accused of fraud, summoned to court: ReportFC Barcelona president Joan Laporta has been ordered to appear in court after being accused of fraud, according to a report by Spanish daily AS, placing renewed legal scrutiny on the club's senior leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-t20-world-cup-wpl-records-2026-goals-2843936-2025-12-30",
      "headline": "Smriti Mandhana sets sights on T20 World Cup, WPL after record-breaking 2025Smriti Mandhana is gearing up for a packed T20 roadmap toward 2026, regaining form against Sri Lanka while eyeing the WPL and T20 World Cup after a record-breaking year when she completed 10,000 runs in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australian-coach-accountable-steve-smith-side-batting-mcg-failure-hayden-2843938-2025-12-30",
      "headline": "Ashes: Australian batting coach held accountable for Steve Smith's side's MCG failureFormer Australia opener Matthew Hayden has slammed the national team's batting coach following the heavy Ashes defeat at the MCG, questioning both coaching accountability and the technical preparedness of Australia's top-order batters as scrutiny intensifies ahead of upcoming Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-renuka-singh-rise-icc-rankings-after-india-sri-lanka-t20i-series-2843920-2025-12-30",
      "headline": "Shafali Verma, Renuka Singh gain big in ICC T20I rankings after Trivandrum heroicsShafali Verma and Renuka Singh have made significant jumps in the ICC Women's rankings after performing brilliantly in the Trivandrum leg of the T20I series against Sri Lanka. Shafali is the leading run-scorer of the series while Renuka took a four-wicket haul in the third T20I. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-no-game-management-irresponsible-harschelle-gibbs-sa20-pretoria-capitals-2843915-2025-12-30",
      "headline": "Brevis shows no game management: Proteas legend slams star's SA20 failuresHerschelle Gibbs questioned Dewald Brevis' game awareness after another SA20 failure. With the T20 World Cup 2026 approaching fast, the young batter's form is becoming a growing concern for South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-test-retirement-unnatural-robin-uthappa-claim-2843900-2025-12-30",
      "headline": "Rohit, Kohli's Test retirements felt unnatural: Ex-batter's explosive claimRobin Uthappa questioned the timing of Virat Kohli and Rohit Sharma's Test retirements. The former India batter feels the exits did not appear natural and believes the full truth may emerge later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-2025-best-india-player-ashwin-odi-debut-x-factor-batter-2843888-2025-12-30",
      "headline": "Abhishek Sharma was India's best in 2025: Ashwin urges ODI debut for batterRavichandran Ashwin believes Abhishek Sharma has been India's best performer of 2025. The former spinner also backed the explosive opener for an ODI debut after his game-changing impact in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-best-women-cricket-team-ashleigh-gardner-india-limited-overs-series-2843869-2025-12-30",
      "headline": "Australia still best team in women's cricket: Gardner ahead of India seriesStar all-rounder Ashleigh Gardner believes Australia remain the \"best team in the world\" despite no longer holding the T20 or ODI World Cup titles, and is confident the side will respond strongly when they renew their rivalry with India in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-white-ball-squads-josh-tongue-maiden-t20i-callup-sri-lanka-tour-2026-2843852-2025-12-30",
      "headline": "After MCG heroics, Josh Tongue named in England provisional squad for T20 World CupJosh Tongue has been included in England's T20I sqaud for the Sri Lanka tour and the provisional squad for the T20 World Cup. Tongue took a five-wicket haul in Melbourne as England recently beat Australia in an away Test for the first time since 2011. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-tirupati-temple-visit-t20-world-cup-2025-form-comeback-2843824-2025-12-30",
      "headline": "Watch: Captain Suryakumar visits Tirupati with wife before T20 World CupIndia's T20 captain Suryakumar Yadav visited Tirupati temple seeking blessings ahead of the T20 World Cup. His recent batting struggles add pressure as he prepares for crucial upcoming series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}