{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wazirx-transfers-175-million-dollars-in-cypto-to-240000-lakh-wallets-many-linked-to-china-2622077-2024-10-23",
      "headline": "WazirX transfers $175 million in cypto to 2.40 lakh wallets, many linked to ChinaDespite WazirX's public claim of ending their contract with Liminal after the hack, they continued using Liminal's services for several months. Liminal also criticised WazirX for lacking transparency, contrasting it with Radiant Capital, which handled a similar incident more openly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fiis-indian-markets-exodus-china-stimulus-dalal-street-diwali-sparkle-2621958-2024-10-23",
      "headline": "Foreign investors exiting India. Is China stealing Dalal Street's Diwali sparkle?As Diwali approaches, foreign investors are betting on China's stimulus while pulling away from India. What does this mass FII exodus mean for the Indian stock market? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-erase-gains-volatility-dalal-street-2621863-2024-10-23",
      "headline": "Sensex, Nifty erase gains to end lower as volatility disrupts Dalal StreetThe S&P BSE Sensex ended 138.74 points lower at 80,081.98, while the NSE Nifty50 fell 36.60 points to 24,435.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-share-price-gains-today-brokerages-optimistic-about-growth-2621850-2024-10-23",
      "headline": "Hyundai Motor shares gain after weak listing. When is the right time to buy? Hyundai Motor India share price: Despite Hyundai Motor India's underwhelming market listing, several brokerages remain optimistic about the long-term prospects of the automaker, pointing to solid growth potential, both in domestic and export markets"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-gmp-rises-on-final-day-check-subscription-details-2621797-2024-10-23",
      "headline": "Waaree Energies IPO: GMP rises on final day, check subscription details Waaree Energies IPO: The grey market premium (GMP) for Waaree Energies suggests a potential listing gain of nearly 95%, with the company commanding a premium of Rs 1,415 in the unofficial market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-today-11-percent-increase-q2-results-npci-approval-upi-explained-2621757-2024-10-23",
      "headline": "Explained: Why Paytm share price surged over 11% todayPaytm stock price: At around 1:18 pm, shares of the company were trading 10:12% higher at Rs 756.85. The development comes a day after the company reported its Q2 results, following which shares tumbled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coforge-share-price-12-percent-jump-q2fy25-results-explained-2621673-2024-10-23",
      "headline": "Explained: Why Coforge share price jumped 12% after Q2 results Coforge share price: The IT firm's stock gained sharply in early trade a day after it reported Q2FY25 financial results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-recovery-early-trade-5-dip-q2fy25-results-should-you-buy-or-sell-2621667-2024-10-23",
      "headline": "Zomato shares recover after falling 5% after Q2 results. Should you buy? Zomato share price: The early selloff was driven by mixed brokerage insights, despite an overall bullish outlook on the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-in-green-early-trade-zomato-paytm-bajaj-finance-2621653-2024-10-23",
      "headline": "Sensex, Nifty gain in early trade; Zomato jumps 2%, Paytm gains 5%The S&P BSE Sensex was up 162.52 points to 80,383.24 at 9:57 am, while the NSE Nifty50 rose 46.45 points to trade at 24,518.55."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-new-upi-onboard-approval-national-payments-corporation-of-india-one97-communications-2621562-2024-10-23",
      "headline": "Paytm gets approval from National Payments Corporation to onboard new UPI usersThe approval is subject to adherence to all NPCI procedural guidelines and circulars, including guidelines and circulars issued specifically on risk management, brand guidelines for app and QR, multi-bank guidelines, among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-disney-mega-media-merger-approved-competition-commission-of-india-published-report-2621353-2024-10-22",
      "headline": "Reliance-Disney merger approved, parties agree not to bundle cricket ad slotsA detailed order approving the mega media assets merger of Reliance Industries and Walt Disney was published by the Competition Commission of India on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-projection-for-india-holds-gdp-growth-steady-at-7-percent-for-fy25-65-percent-for-fy26-2621332-2024-10-22",
      "headline": "IMF holds India's GDP growth steady at 7% for FY25, 6.5% for FY26The International Monetary Fund (IMF) suggests that the initial demand surge following the pandemic is now easing, with the economy returning to a more normal state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-ai-might-replace-you-survey-will-change-your-mind-adecco-global-workforce-of-future-2024-2621289-2024-10-22",
      "headline": "Worried AI might replace you? This survey will change your mindThe latest findings from Adecco Group's 'Global Workforce of the Future 2024' report offer a contrasting view of how artificial intelligence (AI) is influencing workplaces, compared to common perceptions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/not-just-smog-but-onions-too-will-leave-you-teary-eyed-this-diwali-2621250-2024-10-22",
      "headline": "Not just smog but onions too will leave you teary-eyed this DiwaliOnions are currently selling for Rs 60-80 per kg in retail markets, and the impact of weather disruptions is likely to keep prices elevated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-q2-results-net-profit-jumps-389-percent-to-rs-176-crore-revenue-jumps-rs-4799-crore-2621199-2024-10-22",
      "headline": "Zomato Q2 results: Profit soars 389% to Rs 176 crore, revenue jumps 68%Zomato Q2 results: The strong bottom-line performance can be attributed to rising food delivery margins and the quick commerce segment, which is nearing break-even. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-crashes-over-900-points-nifty-drops-below-crucial-support-level-2621167-2024-10-22",
      "headline": "Sensex crashes over 900 points, Nifty drops below crucial support levelThe S&P BSE Sensex lost 930.55 points to end at 80,220.72, while the NSE Nifty50 was down 309 points to close at 24,472.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-meltdown-today-sensex-down-930-points-nifty-plunges-s-2621159-2024-10-22",
      "headline": "Stock market meltdown: Why Sensex tanked over 900 points todayStock market today: At the closing bell, Sensex plunged 930.55 points to 80,220.72, while the Nifty fell 309 points to 24,472.10. The sharp decline wiped out over Rs 9 lakh crore in the BSE's market capitalisation, leaving many investors reeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/has-adar-poonawalla-hit-bulls-eye-with-dharma-productions-acquisition-50-percent-stake-karan-johar-2621119-2024-10-22",
      "headline": "Has Adar Poonawalla hit bull's eye with Dharma Productions acquisition?Dharma Productions, established in 1976 by producer Yash Johar and now overseen by his son Karan Johar, has played a significant role in shaping Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-cleared-investigation-no-action-resignation-government-sources-2621050-2024-10-22",
      "headline": "Opposition's charge against Sebi chief false: Government sourcesSerious allegations of conflict of interest and financial misconduct were levelled against the Sebi chief by US short-seller Hindenburg Research and the Congress party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambuja-cement-acquires-orient-cements-for-rs-8100-crore-details-here-2621030-2024-10-22",
      "headline": "Ambuja Cement acquires Orient Cements for Rs 8,100 crore. Details here Ambuja Cement aims to increase its cement production capacity to 100 million tonnes per annum (MTPA) by FY25, with the acquisition adding about 30 MTPA to its total."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/welcome-lac-border-agreement-pm-modi-xi-jinping-bilateral-talks-india-china-2621980-2024-10-23",
      "headline": "PM meets Xi, welcomes border agreement: Peace at border should be our priorityPM Modi and Chinese President Xi Jinping reviewed the state of bilateral relations from a strategic and long-term perspective during the first talks held in five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/terror-attack-turkish-aerospace-industries-tusas-dead-injured-2622022-2024-10-23",
      "headline": "4 killed as gunmen set off explosives, breach Turkish aerospace HQ near AnkaraTurkish Aerospace Industries, where the attack occurred, is one of Turkey's most important defence and aviation companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-sheikh-hasina-party-awami-league-chhatra-league-anti-terror-law-2622108-2024-10-23",
      "headline": "Bangladesh bans student wing of Sheikh Hasina's party under anti-terror lawThe Bangladesh interim government announced this decision while citing the involvement of the student body in violent attacks on the student protests that led to the ouster of Sheikh Hasina's government in August. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/uddhav-sena-congress-sharad-pawar-ncp-maharashtra-assembly-polls-2622005-2024-10-23",
      "headline": "Uddhav Sena, Congress, Sharad Pawar's party to contest 85 seats eachUddhav Thackeray's Shiv Sena, Congress, and Sharad Pawar's Nationalist Congress Party (NCP) will be contesting elections on 85 seats each. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/video/on-camera-terror-attack-in-turkey-gunmen-seen-on-street-explosion-heard-2622071-2024-10-23",
      "headline": "Turkey terror attack caught on camera, gunmen seen on street, explosion heardFootage from local media showed thick smoke and a large fire engulfing the site in Kahramankazan, about 40 kilometres north of Ankara. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-two-gangsters-expose-justin-trudeau-game-india-ripudaman-singh-malik-khalistani-terrorist-hardeep-singh-nijjar-2621974-2024-10-23",
      "headline": "Two Canadian gangsters plead guilty, expose Trudeau's dirty gameTwo gangsters in Canada admitted to killing Ripudaman Singh Malik, and exposed Canadian Prime Minister Justin Trudeau's game against India over the killing of Hardeep Singh Nijjar. Malik was Nijjar's bitter rival, and the latter's killing in 2023 is believed to be a revenge attack for the former's murder in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-wayanad-by-election-candidate-priyanka-gandhi-vadra-opponents-navya-haridas-sathyan-mokeri-2621758-2024-10-23",
      "headline": "In poll debut, Priyanka Gandhi faces accidental politician, veteran CommunistMarking her electoral debut, Congress general secretary Priyanka Gandhi Vadra filed her nomination papers for the Lok Sabha by-election in Kerala's Wayanad. It will be a three-cornered contest with BJP's Navya Haridas and CPI's Sathyan Mokeri taking on Priyanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/babita-phogat-rejects-sakshi-malik-claims-wrestlers-protest-brij-bhushan-singh-wfi-chief-post-2621942-2024-10-23",
      "headline": "Babita Phogat rejects Sakshi Malik's claims: Needed my name to release her bookBabita Phogat accused Sakshi Malik of fabricating claims, and denied having any agenda behind the wrestler protests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-xi-jinping-bilateral-meet-putin-glue-india-china-border-deal-2621972-2024-10-23",
      "headline": "Putin the 'glue' as India, China reach Ladakh border truce?An image of PM Modi showing a thumbs-up with Vladimir Putin and Xi Jinping by his side was one of the lasting images from the private dinner hosted for Brics leaders in Kazan. It indicated a growing camaraderie among the leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/eminem-champions-kamala-harris-barack-obama-raps-detroit-rally-us-presidential-election-2621881-2024-10-23",
      "headline": "Eminem 'the real Slim Shady' stands with Harris as Obama spits out rap verseEminem endorsed Kamala Harris for the upcoming US presidential election. \"I think Vice President Harris supports a future for this country where freedoms are protected,\" the US rapper said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-blasts-centre-as-air-quality-worsens-in-delhi-pollution-stubble-burning-penalty-mechanism-environment-act-2621699-2024-10-23",
      "headline": "Will take you to task: Supreme Court blasts Centre as Delhi air quality worsensDelhi pollution: The Centre assured the Supreme Court that rules would be finalised within 10 days and the Environmental Protection Act would be made fully operational."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fiis-indian-markets-exodus-china-stimulus-dalal-street-diwali-sparkle-2621958-2024-10-23",
      "headline": "Foreign investors exiting India. Is China stealing Dalal Street's Diwali sparkle?As Diwali approaches, foreign investors are betting on China's stimulus while pulling away from India. What does this mass FII exodus mean for the Indian stock market? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/bengaluru-rain-building-collapse-2621971-2024-10-23",
      "headline": "Bengaluru's day of chaos: Floods, floating fridges, and deadly building collapseBengaluru streets were flooded, with some residents even seen fishing in the waterlogged roads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2022-the-gangs-of-punjab-and-their-global-web-2621990-2024-10-23",
      "headline": "From the India Today archives (2022) | The gangs of Punjab and their global webWith Lawrence Bishnoi in the news for alleged threats against Salman Khan and the killing of Maharashtra ex-inister Baba Siddique a look back at the growing menace of Punjab's gang culture"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/hoax-bomb-threats-to-indigo-air-india-akasa-air-vistara-airlines-centre-slams-x-for-not-sharing-datat-2621773-2024-10-23",
      "headline": "Centre rebukes X in meet over bomb threats to flights: Amounts to abetting crimeThe Centre came down heavily on the officials of X for not sharing the details of the suspicious accounts that were allegedly involved in issuing hoax bomb threats to airlines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/if-you-ditch-makeup-forever-like-pamela-anderson-this-is-what-it-will-do-to-your-skin-2621747-2024-10-23",
      "headline": "If you ditch makeup forever like Pamela Anderson, this is what it will do to your skinThose who love makeup know how real the obsession is, but are you planning to say goodbye to it forever? Find out from the experts if this is a good move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-brics-summit-2024-russia-terrorism-vladimir-putin-xi-jinping-2621849-2024-10-23",
      "headline": "Dialogue, not war, says PM at Brics, warns against double standards on terrorPM Modi called for reforms in global institutions and also called for collective action against terrorism and radicalisation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-sheikh-hasina-resignation-letter-protest-dhaka-president-shahabuddin-claim-evidence-2621675-2024-10-23",
      "headline": "Why Hasina letter mystery is fuelling a storm in BangladeshThe mystery over former Bangladesh Prime Minister Sheikh Hasina's resignation letter has fuelled a fresh storm in Bangladesh. Protesters are back on the streets and demanding the ouster of President Mohammed Shahabuddin. This is why Hasina's letter is important, and why Shahabuddin is in the crosshairs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-david-warner-retirement-u-turn-marnus-labuschagne-2622037-2024-10-23",
      "headline": "Don't know if David Warner was serious or joking about return: Marnus LabuschagneMarnus Labuschagne is uncertain about David Warner's intention to return for the upcoming Border-Gavaskar Trophy. Warner, who retired earlier this year, has expressed readiness to play if needed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-speeding-cars-are-helping-the-push-for-clean-energy-2622011-2024-10-23",
      "headline": "How speeding cars are helping the push for clean energyAlong with solar panels, an NHAI-BPCL project uses turbines run by the wind as cars whiz past on a highway to power a fuel station and an EV charging point"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/e-coli-outbreak-linked-to-mcdonalds-burgers-raises-alarm-in-us-what-is-it-2621869-2024-10-23",
      "headline": "What is the E. Coli outbreak linked to McDonald's burgers?This foodborne illness has once again brought food safety practices into the spotlight, particularly in the fast-food industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-border-agreement-lac-diplomatic-military-victory-modi-xi-jinping-meet-2621678-2024-10-23",
      "headline": "'Back to 2020 situation': Why China border deal is huge victory for IndiaIndia-China border latest news: China had maintained a dogged stance of not agreeing to India's status quo demand for four years, making the victory sweeter - not only diplomatically but militarily as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-mother-indira-bhaduri-abhishek-bachchan-hospitalised-bhopal-death-hoax-2621946-2024-10-23",
      "headline": "Actor Jaya Bachchan's mother Indira Bhaduri hospitalised in BhopalActor and MP Jaya Bachchan's mother is receiving treatment at a hospital in Bhopal. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/remo-dsouza-lizelle-cheating-claims-forgery-false-picture-rdepl-dance-plus-2622091-2024-10-23",
      "headline": "Director Remo D'Souza, wife on cheating claims: False picture is being paintedFilm director and choreographer Remo D'Souza and his wife Lizelle responded to the cheating allegations through a statement on social media. The couple faced accusations of defrauding a dance troupe of Rs 11.96 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/aditi-rao-hydari-dimple-kapdia-akshay-kumar-celebs-mami-2622072-2024-10-23",
      "headline": "Pics: Aditi Rao Hydari, Dimple Kapdia, Akshay Kumar, celebs at MAMIFrom Akshay Kumar to Aditi Rao Hydari, several stars attended the MAMI festival on Day 5 in Mumbai. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/love-hurts-trailer-ke-huay-quan-trades-real-estate-for-combat-in-1st-film-as-lead-2622027-2024-10-23",
      "headline": "Love Hurts trailer: Ke Huay Quan trades real estate for combat in 1st film as leadKe Huy Quan will take the spotlight in Love Hurts, an action-comedy featuring a stellar cast. The film will showcase his martial arts and comedic skills in a thrilling narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoor-first-south-asian-global-ambassador-dior-paris-fashion-week-2622032-2024-10-23",
      "headline": "Actor Sonam Kapoor named first South Asian global ambassador for DiorBollywood actor Sonam Kapoor has been appointed as Dior's brand ambassador. She expressed her honour of being associated with the French luxury fashion house. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rachin-ravindra-admires-sachin-and-kohlis-memorabilia-at-cricket-museum-in-pune-2622092-2024-10-23",
      "headline": "Rachin Ravindra admires Sachin and Kohli's memorabilia at cricket museum in PuneNew Zealand players visited the famous Blades of Glory Museum at Sahakar Nagar in Pune. Rachin Ravindra posed with Sachin and Kohli's memorabilia at cricket museum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-will-take-confidence-from-1st-test-win-for-pune-clash-tom-latham-2622078-2024-10-23",
      "headline": "New Zealand will take confidence from 1st Test win for Pune clash: Tom LathamTom Latham, while addressing the press conference, said that New Zealand won't be resting on their 1st Test win and rather will just take confidence from it as they head into the 2nd Test.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-germany-hockey-coach-craig-fulton-missed-penalty-corners-firepower-new-delhi-2622076-2024-10-23",
      "headline": "India coach Fulton rues failed penalty corners in 0-2 loss to GermanyIndia's hockey team suffered a 0-2 defeat against world champions Germany in the first Test, despite creating multiple scoring opportunities. Coach Craig Fulton emphasised the need to improve finishing and consistency as the team looks ahead to future competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-fc-barcelona-thibaut-courtois-injury-uncertain-rodrygo-la-liga-2622066-2024-10-23",
      "headline": "After Rodrygo, Real Madrid's Courtois unlikely for El Clasico with injuryReal Madrid's thrilling 5-2 win over Borussia Dortmund was overshadowed by injuries to key players Thibaut Courtois and Rodrygo Goes, raising doubts about their availability for the crucial El Clásico clash against Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-breaks-world-records-for-highest-t20i-score-vs-gambia-sikandar-raza-tadiwanashe-marumani-2622061-2024-10-23",
      "headline": "Zimbabwe shatter record books with belligerent batting display vs Gambia: Top StatsZimbabwe shattered record books during their Group B fixture of the ICC Mens T20 World Cup Sub Regional Africa Qualifier vs Gambia as they registered the highest score in T20Is along with several other records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-3rd-test-all-you-need-to-know-about-series-decider-weather-pitch-playing-xi-2622044-2024-10-23",
      "headline": "Pakistan vs England 3rd Test: All you need to know about series deciderPakistan is set to host England for the 3rd and final Test in Rawalpindi on October 24, Thursday. Here is all you need to know about the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-jasprit-bumrah-no-rest-choice-fully-fit-pune-test-aakash-chopra-2622043-2024-10-23",
      "headline": "No reason to rest Jasprit Bumrah in Pune Test: Aakash ChopraAakash Chopra urged India to play Jasprit Bumrah in the Pune Test against New Zealand, despite workload concerns, if he's fully fit. Resting him for future series, Chopra argued, would not be a wise decision for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-david-warner-retirement-u-turn-marnus-labuschagne-2622037-2024-10-23",
      "headline": "Don't know if David Warner was serious or joking about return: Marnus LabuschagneMarnus Labuschagne is uncertain about David Warner's intention to return for the upcoming Border-Gavaskar Trophy. Warner, who retired earlier this year, has expressed readiness to play if needed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-mayank-yadav-mohammed-shami-aus-vs-ind-border-gavaskar-trophy-2024-25-2622029-2024-10-23",
      "headline": "Brett Lee backs Mayank Yadav's selection for Australia tour in Shami's absenceFormer Australia fast bowler Brett Lee has backed Mayank Yadav to get selected for the five-match Test series vs Australia as Mohammed Shami continues to recover from his injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-recalls-mcg-magic-with-virat-kohli-vs-pak-a-game-like-no-other-2622023-2024-10-23",
      "headline": "Hardik Pandya recalls 'MCG magic' with Virat Kohli vs PAK: A Game like no otherHardik Pandya took to his Instagram story to relive the 'Melbourne magic' on the two-year anniversary of India's historic win vs Pakistan in ICC T20 World Cup 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-jose-mourinho-best-for-manchester-united-city-ffp-charges-fenerbache-2622013-2024-10-23",
      "headline": "Mourinho takes FFP dig at City, refreshes love-affair with UnitedAhead of Fenerbahçe's Europa League clash with Manchester United, José Mourinho praised his former club and took a jab at Manchester City's Financial Fair Play investigation, while discussing both teams' struggles in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-jasprit-bumrah-no-rest-choice-fully-fit-pune-test-aakash-chopra-2622043-2024-10-23",
      "headline": "No reason to rest Jasprit Bumrah in Pune Test: Aakash ChopraAakash Chopra urged India to play Jasprit Bumrah in the Pune Test against New Zealand, despite workload concerns, if he's fully fit. Resting him for future series, Chopra argued, would not be a wise decision for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-david-warner-retirement-u-turn-marnus-labuschagne-2622037-2024-10-23",
      "headline": "Don't know if David Warner was serious or joking about return: Marnus LabuschagneMarnus Labuschagne is uncertain about David Warner's intention to return for the upcoming Border-Gavaskar Trophy. Warner, who retired earlier this year, has expressed readiness to play if needed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-mayank-yadav-mohammed-shami-aus-vs-ind-border-gavaskar-trophy-2024-25-2622029-2024-10-23",
      "headline": "Brett Lee backs Mayank Yadav's selection for Australia tour in Shami's absenceFormer Australia fast bowler Brett Lee has backed Mayank Yadav to get selected for the five-match Test series vs Australia as Mohammed Shami continues to recover from his injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-recalls-mcg-magic-with-virat-kohli-vs-pak-a-game-like-no-other-2622023-2024-10-23",
      "headline": "Hardik Pandya recalls 'MCG magic' with Virat Kohli vs PAK: A Game like no otherHardik Pandya took to his Instagram story to relive the 'Melbourne magic' on the two-year anniversary of India's historic win vs Pakistan in ICC T20 World Cup 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-jose-mourinho-best-for-manchester-united-city-ffp-charges-fenerbache-2622013-2024-10-23",
      "headline": "Mourinho takes FFP dig at City, refreshes love-affair with UnitedAhead of Fenerbahçe's Europa League clash with Manchester United, José Mourinho praised his former club and took a jab at Manchester City's Financial Fair Play investigation, while discussing both teams' struggles in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-score-highest-t20i-total-of-344-vs-gambia-2622010-2024-10-23",
      "headline": "Sikandar Raza's 33-ball 100 helps Zimbabwe post highest T20I score of 344 vs GambiaZimbabwe captain Sikandar Raza helped his team post the highest T20I score ever as he scored a breathtaking 33-ball hundred helping Zimbabwe post 344/4 in 20 overs vs Gambia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australian-player-retires-mid-innings-after-childs-birth-returns-to-win-match-2621989-2024-10-23",
      "headline": "Australian player retires mid-innings after child's birth, returns to win matchHilton Cartwright balanced cricket and family in dramatic fashion, leaving mid-innings to attend the birth of his second child before returning to score 65 runs and help Western Australia secure a six-wicket win in the Sheffield Shield match against Tasmania."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-germany-hockey-varun-kumar-sanjay-rana-drag-flicker-harmanpreet-singh-new-delhi-2621978-2024-10-23",
      "headline": "India ready to try Varun and Sanjay plans against Germany: HarmanpreetDespite a 2-0 loss to Germany, India hockey captain Harmanpreet Singh confirmed that the team remains focused on experimenting with strategies and lineups against Germany, preparing for upcoming major tournaments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-bengal-vs-kerala-bcci-request-rescheduling-cyclone-dana-alert-2621963-2024-10-23",
      "headline": "Bengal asks BCCI to defer Ranji trophy clash due to cyclone DanaAs Cyclone Dana threatens West Bengal, the Cricket Association of Bengal (CAB) has requested the BCCI to reschedule their crucial Ranji Trophy clash against Kerala on October 26 due to safety concerns and potential weather disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-aus-vs-ind-border-gavaskar-trophy-2024-25-2621953-2024-10-23",
      "headline": "Brett Lee warns Australia of 'powerhouse' India: They don't want to bow downFormer Australia fast bowler Brett Lee has warned Australia of India ahead of the highly anticipated Border Gavaskar Trophy 2024-25 saying that they know to win from every situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-ben-stokes-vs-brendon-mccullum-captain-coach-face-off-in-six-hitting-contest-in-rawalpindi-2621951-2024-10-23",
      "headline": "Ben Stokes vs Brendon McCullum: Captain-coach face-off in six-hitting contestBen Stokes and Brendon McCullum, two of Test cricket's biggest six-hitters, engaged in a fun six-hitting challenge during England's final practice in Rawalpindi. McCullum stole the show by smashing a delivery into the stands, reminding every one of his explosive batting prowess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tom-latham-fingers-crossed-kane-williamson-return-pune-test-2621933-2024-10-23",
      "headline": "Tom Latham has 'fingers crossed' for Kane Williamson's New Zealand returnNew Zealand captain Tom Latham remains optimistic about Kane Williamson's return, despite the star batter being ruled out of the Pune Test. Williamson is recovering steadily from his groin strain injury, providing hope for his comeback later in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-sa-mehidy-hasan-miraz-jaker-ali-kagiso-rabada-keshav-maharaj-2621928-2024-10-23",
      "headline": "BAN vs SA: Mehidy, Jaker keep Bangladesh afloat amid Rabada, Maharaj's mayhemBangladesh have managed to keep themselves in the game in the first Test against South Africa as they were 283/7 leading by 81 runs with Mehidy Hasan Miraz (87*) and Jaker Ali (58*) at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-aus-vs-ind-border-gavaskar-trophy-2024-25-2621953-2024-10-23",
      "headline": "Brett Lee warns Australia of 'powerhouse' India: They don't want to bow downFormer Australia fast bowler Brett Lee has warned Australia of India ahead of the highly anticipated Border Gavaskar Trophy 2024-25 saying that they know to win from every situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-ben-stokes-vs-brendon-mccullum-captain-coach-face-off-in-six-hitting-contest-in-rawalpindi-2621951-2024-10-23",
      "headline": "Ben Stokes vs Brendon McCullum: Captain-coach face-off in six-hitting contestBen Stokes and Brendon McCullum, two of Test cricket's biggest six-hitters, engaged in a fun six-hitting challenge during England's final practice in Rawalpindi. McCullum stole the show by smashing a delivery into the stands, reminding every one of his explosive batting prowess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tom-latham-fingers-crossed-kane-williamson-return-pune-test-2621933-2024-10-23",
      "headline": "Tom Latham has 'fingers crossed' for Kane Williamson's New Zealand returnNew Zealand captain Tom Latham remains optimistic about Kane Williamson's return, despite the star batter being ruled out of the Pune Test. Williamson is recovering steadily from his groin strain injury, providing hope for his comeback later in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-sa-mehidy-hasan-miraz-jaker-ali-kagiso-rabada-keshav-maharaj-2621928-2024-10-23",
      "headline": "BAN vs SA: Mehidy, Jaker keep Bangladesh afloat amid Rabada, Maharaj's mayhemBangladesh have managed to keep themselves in the game in the first Test against South Africa as they were 283/7 leading by 81 runs with Mehidy Hasan Miraz (87*) and Jaker Ali (58*) at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-have-4-spinners-in-line-up-tom-latham-ready-for-spin-test-vs-india-pune-2621922-2024-10-23",
      "headline": "New Zealand have 4 spinners in line-up: Tom Latham ready for 'spin Test' vs IndiaTom Latham said that the New Zealand team is ready for the spin Test in Pune in the 2nd Test vs India. However, he admitted that the team wouldn't go into the contest with a preconceived idea about the pitch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-germany-report-harmanpreet-singh-major-dhyan-chand-stadium-new-delhi-2621905-2024-10-23",
      "headline": "IND vs GER: Wasteful India beaten 2-0 by Germany in hockey's return to DelhiThe Indian team were left to rue their missed chances as Germany won at the Major Dhyan Chand stadium 2-0 to take the lead in the 2-Test series on October 23, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-rodrygo-injury-scare-el-clasico-barcelona-uefa-champions-league-ancelotti-2621876-2024-10-23",
      "headline": "Madrid face Rodrygo injury scare ahead of El Clasico clash vs BarcelonaDespite Real Madrid's thrilling 5-2 Champions League comeback win over Borussia Dortmund, Rodrygo Goes suffered a muscle strain, raising concerns over his availability for the highly anticipated El Clásico clash against FC Barcelona."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}