{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-678-points-higher-nifty-above-24900-tata-motors-stock-falls-4-percent-2741492-2025-06-16",
      "headline": "Sensex ends 678 points higher, Nifty above 24,900; Tata Motors falls 4%The S&P BSE Sensex added 677.75 points to close at 81,796.15, while the NSE Nifty50 gained 227.90 points to end at 24,946.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/omaxe-shares-surge-new-amritsar-township-project-launch-2741486-2025-06-16",
      "headline": "Omaxe shares jump 14% on launch of New Amritsar township projectThe surge in Omaxe's share price can be attributed to the company's announcement of a new integrated township project named New Amritsar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-flight-crash-impact-aviation-sector-boeing-safety-787-dreamliner-experts-2741445-2025-06-16",
      "headline": "Air India plane crash: Will it have a negative impact on the aviation industry?The crash brought Boeing's safety record back under the scanner. Experts added that this could trigger deeper global regulatory scrutiny of Boeing's production and maintenance standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bajaj-finance-share-price-really-down-90-percent-or-not-explained-2741422-2025-06-16",
      "headline": "Are Bajaj Finance shares really down 90% today?Bajaj Finance shares have not crashed. What investors are seeing is a temporary adjustment due to a stock split and bonus issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/think-youre-exempt-from-filing-itr-your-lifestyle-may-say-otherwise-2741372-2025-06-16",
      "headline": "Think you're exempt from filing ITR? Your lifestyle may say otherwiseIt is no longer just about how much you earn. If your lifestyle tells a different story, the taxman is likely paying attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-arun-srinivas-new-meta-head-india-salary-education-work-experience-facebook-2741325-2025-06-16",
      "headline": "Who is Arun Srinivas, new India head of Meta?Arun Srinivas joined Meta (formerly Facebook) in September 2020. Arun Srinivas started his career in the fast-moving consumer goods (FMCG) space, joining Reebok in 1996."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/data-scientist-linkedin-post-on-middle-class-spending-money-management-sparks-debate-2741324-2025-06-16",
      "headline": "We trapped ourselves: Data scientist's post on middle class spending sparks debateIs the middle class a victim of the system or just bad at managing money? A Mumbai-based data scientist sparks debate with a provocative take."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rising-today-despite-crude-oil-tensions-iran-israel-key-reasons-explained-2741319-2025-06-16",
      "headline": "Sensex rises 600 points despite Israel-Iran tensions. What's fuelling the rally?On Monday morning, both benchmark indices opened firm despite geopolitical concerns, with the BSE Sensex rising 170.94 points to 81,289.54 and the NSE Nifty50 gaining 62.90 points to trade at 24,781.50 as of 10:19 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-ships-97-of-india-made-iphones-to-us-to-dodge-trumps-china-tariffs-2741307-2025-06-16",
      "headline": "Foxconn ships 97% of India-made iPhones to US to dodge Trump's China tariffsThe numbers show that Apple has shifted its export focus from a mix of countries to mainly serving the U.S. market. Earlier, Indian exports were sent to places like the Netherlands, the Czech Republic, and the UK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-shares-fall-jaguar-land-rover-cuts-2026-ebit-margin-2741302-2025-06-16",
      "headline": "Tata Motors shares sink over 5% today. What's behind the sharp decline?The decline was primarily driven by a downward revision in Jaguar Land Rover's (JLR) earnings before interest and taxes (EBIT) margin forecast for the fiscal year 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-rise-israel-iran-tensions-safe-haven-demand-fed-policy-impact-2741287-2025-06-16",
      "headline": "Gold price rises amid Israel-Iran tensions: Should you buy now or wait?Gold prices are rising again as global tensions heat up and markets turn cautious. With rates inching higher, should you be buying gold or waiting it out?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-178-points-higher-nifty-above-24700-power-grid-gains-over-1-percent-2741277-2025-06-16",
      "headline": "Sensex, Nifty open higher as IT stocks rally amid Israel-Iran conflictThe S&P BSE Sensex was up by 257.49 points to 81,376.09, while the NSE Nifty50 gained 83.20 points to 24,803.55 as of 9:29 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-responds-to-love-jihad-claims-pk-backlash-2741688-2025-06-16",
      "headline": "Aamir Khan responds to love jihad claims and PK backlashActor Aamir Khan finally addressed the controversy surrounding his 2014 film 'PK'. In an interview, he refuted claims that the film promoted 'love jihad'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-dev-opens-up-about-brother-mukul-dev-death-2741616-2025-06-16",
      "headline": "He felt lonely: Rahul Dev opens up about brother Mukul Dev's deathActor Rahul Dev revealed the reason behind his brother Mukul Dev's untimely death. He stated that he had lost the will to live following the death of their parents, and that his divorce further contributed to his emotional decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-on-loneliness-magic-man-2-and-why-india-on-his-radar-2741610-2025-06-16",
      "headline": "Jackson Wang on loneliness, Magic Man 2, and why India's on his radarJackson Wang, the Hong Kong-born singer and entrepreneur, is set to release his new album 'Magic Man 2' on July 18 and hopes to include India in his upcoming world tour. In an interview with India Today, he shared candid insights on independence, honesty, and his deep connection with fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-to-train-your-dragon-roars-in-india-earns-rs-14-crore-on-opening-weekend-2741597-2025-06-16",
      "headline": "How to Train Your Dragon roars in India, earns Rs 14 crore on opening weekend'How to Train Your Dragon' clocked the biggest opening weekend in India for the franchise to date. The film earned Rs 14 crore in India on its first weekend at the box office. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govindas-wife-sunita-ahuja-visits-kal-bhairav-temple-2741589-2025-06-16",
      "headline": "Govinda's wife Sunita visits Kal Bhairav temple in Ujjain on her 57th birthdayGovinda's wife, Sunita Ahuja, celebrated her 57th birthday by offering prayers at Kal Bhairav temple in Ujjain, Madhya Pradhesh. In the video circulated on the social media Sunita can be seen sitting inside the temple premises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-watches-kannappa-vishnu-manchu-expresses-gratitude-2741581-2025-06-16",
      "headline": "Encouraged, humbled, grateful: Vishnu Manchu on Rajinikanth's reaction to KannappaTamil superstar Rajinikanth was all praise for Vishnu Manchu's 'Kannappa'. The latter shared an emotional post on X, recalling Thalaivar's reaction after watching the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sagarika-ghatge-reveals-sons-face-2741569-2025-06-16",
      "headline": "Actor Sagarika Ghatge reveals son's face in emotional Father's Day postActor Sagarika Ghatge pens a long note for her husband, cricketer Zaheer Khan, on social media to celebrate Father's Day. The actor reveals her son Fatehsinh Khan's face in the post. The couple welcomed their son in April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/first-copy-trailer-munawar-faruqui-plays-piracy-kingpin-in-nostalgic-series-2741553-2025-06-16",
      "headline": "First Copy trailer: Munawar Faruqui plays piracy kingpin in nostalgic seriesThe trailer of Munawar Faruqui-starrer 'First Copy' released on Monday. In the series, the stand-up-comedian-turned-actor plays the role of a piracy kingpin. 'First Copy' will stream on OTT from June 20.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raveena-tandon-boards-air-india-flight-days-after-crash-shares-moving-note-2741535-2025-06-16",
      "headline": "Raveena Tandon boards Air India flight days after crash, shares moving noteActor Raveena Tandon shared her emotional experience on an Air India flight that she boarded days after the tragic plane crash in Ahmedabad. She praised the strength and silent resilience of the crew and passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kamal-haasan-congratulates-abhishek-banerjee-for-stolen-meets-films-team-2741544-2025-06-16",
      "headline": "Kamal Haasan congratulates Abhishek Banerjee for Stolen, meets film's teamActor Abhishek Banerjee is receiving widespread praise for his powerful role in the thriller 'Stolen', which recently earned a special accolade from the legendary Kamal Haasan during a meeting in Chennai. The film premiered on Prime Video on June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-blushes-vijay-deverakonda-viral-video-kuberaa-pre-release-event-2741536-2025-06-16",
      "headline": "Rashmika blushes when asked about Vijay Deverakonda in viral videoActor Rashmika Mandanna was seen blushing when anchor Suma Kanakala said Vijay Deverakonda's name at the pre-release event of her upcoming film, 'Kuberaa'. The video is now going viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/adnan-sami-meets-jackson-wang-roshan-residence-2741521-2025-06-16",
      "headline": "Adnan Sami catches up with old pals, meets Jackson Wang at Hrithik Roshan's homeSinger Adnan Sami recently met K-pop star Jackson Wang at a dinner hosted by actor Hrithik Roshan. The singer also met old friends, singer Salim Merchant and music composer Pritam. Jackson Wang is currently in India for the promotion of his latest album, 'MAGIC MAN 2'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-trailer-kay-kay-menon-and-team-to-fight-cyber-terrorism-this-time-2741499-2025-06-16",
      "headline": "Special Ops 2 trailer: Kay Kay Menon and team to fight cyber terrorism this timeThe trailer of Kay Kay Menon-starrer 'Special Ops 2' finally released on Monday. In the latest season, Kay Kay Menon as Himmat Singh will be seen leading the fight against cyberterrorismc and artificial intelligence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-gratitude-note-for-fans-who-visit-him-outside-jalsa-despite-heavy-rain-2741441-2025-06-16",
      "headline": "Big B's gratitude note for fans who visit him outside Jalsa despite heavy rainAmitabh Bachchan expressed gratitude to his fans who gathered outside his residence, Jalsa, braving heavy rain just to catch a glimpse of him. The veteran actor shared emotional words and photos on his blog, humbly stating that he bows down to their unwavering love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/blackpink-comeback-jisoo-hints-at-new-music-2741463-2025-06-16",
      "headline": "Is BLACKPINK planning a comeback? Jisoo hints at 'something amazing'The K-pop girl band member Jisoo revealed in a recent interview that BLACKPINK is planning a comeback with the 'DEADLINE' tour. After a three-year hiatus, they are back with their first group album."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-makers-say-they-shot-for-16-18-hours-amid-8-hour-shift-debate-2741481-2025-06-16",
      "headline": "Prabhas's Raja Saab makers say they shot for 16-18 hours amid 8-hour shift debateAt the teaser launch of Prabhas's 'The Raja Saab', the makers revealed their gruelling 16 to 18-hour workdays to deliver the film's high-quality output. The film will release in theatres on December 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/preity-zinta-shares-pictures-of-twins-fathers-day-2741438-2025-06-16",
      "headline": "Preity Zinta's twins hold hands on Father's Day family stroll picActor Preity Zinta shared a Father's Day post on social media, featuring her husband Gene Goodenough and their kids Jai and Gia.  The photo featured her kids holding hands as they took stroll in a picturesque location.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-naga-chaitanyas-ye-maaya-chesave-to-re-release-in-theatres-in-july-2741459-2025-06-16",
      "headline": "Samantha, Naga Chaitanya's Ye Maaya Chesave to re-release in theatres in JulySamantha and Naga Chaitanya's 'Ye Maaya Chesave' is set to re-release in theatres next month. The film marks its 15th anniversary this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soundarya-sharma-housefull-5-female-actors-bollywood-2741421-2025-06-16",
      "headline": "Soundarya Sharma on changing landscape in Bollywood: Old stereotypes are fadingSoundarya Sharma expressed her gratitude for a role in 'Housefull 5' and reflected on the changing landscape for female actors in Bollywood. She emphasised the importance of versatility in her career."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-israel-bombs-iranian-state-media-headquarters-during-live-broadcast-2741676-2025-06-16",
      "headline": "Video: Israel bombs Iranian state TV headquarters, forces anchor to take coverAn anchor who was reading out news in her live broadcast was forced to run for cover as Israel bombed the headquarters of the IRIB, an Iranian state TV, in Tehran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/first-batch-of-indians-to-cross-over-to-armenia-as-evacuation-from-iran-begins-say-government-sourcesglbs-2741741-2025-06-16",
      "headline": "First batch of Indians leaves Iran, heads to Armenia: Govt sourcesAmid the Israel-Iran war, India has begun evacuating its citizens from Iran. Government sources say the first group will cross into Armenia tonight. Iran has allowed land travel to nearby countries after shutting down its airspace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/anti-terror-watchdog-fatf-condemns-pahalgam-attack-says-couldnt-have-happened-without-money-movement-2741590-2025-06-16",
      "headline": "FATF condemns Pahalgam attack, says it couldn't have occurred without moneyStrongly condemning the Pahalgam terror attack, the FATF highlighted Pakistan's terror financing routes and said that such attacks could not have happened without the movement of money."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-pm-netanyahu-says-killing-irans-supreme-leader-ayotallah-khamenei-would-end-conflict-2741730-2025-06-16",
      "headline": "Netanyahu says killing Iran's Supreme Leader Ayotallah Khamenei would end conflictIsraeli PM Netanyahu defended attacks on Iran and added that killing Iran's Supreme Leader, Ayatollah Ali Khamenei, would end the conflict between the two countries. He warned of the global threat from Iran's nuclear ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-air-india-plane-crash-miracle-survivor-vishwas-kumar-ramesh-new-video-2741518-2025-06-16",
      "headline": "Stunning video shows miracle Air India crash survivor emerging from infernoA new video of last week's Air India plane crash in Ahmedabad, which killed 270 people, shows the miracle survivor, Viswashkumar Ramesh, emerging from the crash site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-not-winning-this-war-should-talk-before-its-too-late-trump-backs-israel-at-g7-2741691-2025-06-16",
      "headline": "Iran not winning war, should talk before it's too late: Trump backs Israel at G7Ahead of the G7 summit in Canada, Donald Trump refused to back a statement urging Israel-Iran de-escalation, strongly supported Israel's actions, and called for Russia's return to the alliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/first-pic-of-weapon-used-to-kill-raja-raghuvanshi-in-meghalaya-honeymoon-murder-case-2741563-2025-06-16",
      "headline": "Weapon used to kill Raja Raghuvanshi in Meghalaya honeymoon murder recoveredA machete used in the murder of Indore-based Raja Raghuvanshi, who died while honeymooning in Meghalaya, has been found from the crime spot. Raja's wife, Sonam, her lover and three accused are currently in police custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-has-right-to-self-defence-iran-cant-have-nukes-say-g7-leaders-in-draft-statement-sources-2741646-2025-06-16",
      "headline": "G7 leaders say Israel has right to self-defence, Iran can't have nukes: SourcesAs the Israel-Iran conflict escalates, the G7 leaders have asserted that Tel Aviv has the right to defend itself while Tehran cannot have nuclear weapons, sources said, citing a draft statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/exclusive-cctv-footage-shows-twist-bengaluru-rapido-bike-rider-assaulting-woman-case-complainant-hit-him-first-with-lunch-bag-2741540-2025-06-16",
      "headline": "New CCTV clip shows woman attacking Rapido driver detained for slapping herCCTV footage accessed exclusively by India Today shows that the woman, who was hit by a Rapido bike rider in Bengaluru, hit him first after what looks like an argument. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/why-maga-is-not-going-gaga-about-trump-backing-israel-tel-aviv-tehran-attacks-charlie-kirk-tucker-carlson-2741559-2025-06-16",
      "headline": "Why MAGA isn't going gaga about Trump backing IsraelIsrael's attack on Iran, and the US's involvement in the conflict, has seemingly created a rift within the Republican camp, pitting the party's age-old support for Israel and hostility toward Iran against the MAGA base's growing fear of being dragged into another foreign war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-latest-updates-several-killed-injured-in-israel-tehran-under-attack-operation-rising-lion-netanyahu-khomeini-2740933-2025-06-15",
      "headline": "Live: Tehran preparing for most intense missile attack on Israeli soil in history, says Iranian mediaIsrael-Iran Conflict Live Updates: Israel continued its military strikes on Iran on the fourth day, bombing the headquarters of the Iranian state TV on Monday. Both sides inflicted losses in the exchange of missiles, with at least eight people being killed in Israel. Meanwhile, US President Donald Trump has come out in full support of Israel during the G7 summit in Canada and said that \"Iran was not winning this war\". Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-cyprus-silver-clutch-purse-cyprus-president-cyprus-first-lady-2741629-2025-06-16",
      "headline": "PM Modi gifts Andhra-made silver clutch purse to Cyprus first ladyThe purse originates from Andhra Pradesh and is a beautiful combination of traditional metalwork and modern style. It also contains a semi-precious stone in the middle. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-bans-bike-taxis-x-users-joke-rapido-uber-moto-offers-bike-parcel-rides-drivers-urge-siddaramaiah-to-intervene-2741682-2025-06-16",
      "headline": "Become a parcel, get delivered: X users after Karnataka bans bike taxiAfter the ban on bike taxis in the state ordered by the Karnataka High Court came into effect today, X users joked that platforms like Rapido are now offering \"bike parcel\" rides. While the government began cracking down, drivers urged Siddaramaiah, Rahul Gandhi to intervene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-dreamliner-hong-kong-delhi-flight-technical-snag-after-take-off-2741498-2025-06-16",
      "headline": "Don't want to continue: Audio of Air India Dreamliner that returned to Hong KongThe Air India flight AI 315 returned to Hong Kong after nearly 90 minutes of take-off after a technical glitch was reportedly detected in the aircraft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mayday-dreamliner-black-box-flaps-aviation-terms-heard-since-air-india-171-ahmedabad-crash-explained-2741538-2025-06-16",
      "headline": "RAT, Mayday, CVR: Breaking down aviation terms you've heard since Air India crashSince the fatal June 12 crash of Air India Flight 171, terms like RAT, CVR, and Mayday have filled coverage of the air crash. The Boeing 787 Dreamliner went down seconds after take-off, a rare and catastrophic failure. As investigators pore over flight data and debris, here's a quick explainer to make sense of the aviation jargon everywhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/journalist-executed-by-saudi-arabia-after-7-years-over-anti-royal-tweet-say-activists-2741584-2025-06-16",
      "headline": "Saudi journalist executed after 7 years in jail over posts against royal familyTurki Al-Jasser, a Saudi journalist who was in jail for the past seven years following his arrest over social media posts alleging corruption by the royal family, was executed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/message-turkey-why-pm-modi-first-operation-sindoor-trip-cyprus-eu-trade-cooperation-energy-india-pak-explained-2741434-2025-06-16",
      "headline": "Message for Turkey? Why Modi's first post-Op Sindoor trip is to CyprusPrime Minister Modi's first post-Operation Sindoor visit to Cyprus could be a strategic message amid deepening Turkey-Pakistan ties. After the April 22 terror attack, Cyprus backed India and vowed to raise the issue of cross-border terrorism at the EU level, highlighting a growing alignment which now extends to trade, energy, and EU cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/bali-thailand-vietnam-now-philippines-is-southeast-asia-indias-new-backyard-2739636-2025-06-16",
      "headline": "Bali, Thailand, Vietnam, now Philippines: Is Southeast Asia India's new backyard?Visa relaxations make a destination more attractive for hassle-free travel. With the Philippines now visa-free for Indians, can we expect an influx of Indian tourists to the country?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/anti-ageing-market-can-we-really-reverse-our-biological-age-and-promote-longevity-2741360-2025-06-16",
      "headline": "Longevity unlocked: Can we really reverse our biological age?The global anti-ageing market is rapidly expanding with a growing demand for personalised and scientific approaches. India is gradually shifting focus from visible ageing signs to deeper biological health for longevity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/mumbai-rains-waterlogging-local-train-services-air-india-advisory-2741565-2025-06-16",
      "headline": "Mumbai roads waterlogged as heavy rain pounds city, orange alert issuedContinuous rainfall has been reported across Mumbai and its suburbs for the past two hours. However, no major waterlogging has been reported so far in the city and local train services are also running on time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/five-medical-emergencies-that-strike-at-will-how-to-respond-swiftly-correctly-2740411-2025-06-13",
      "headline": "Five medical emergencies that strike at will: How to respond swiftly, correctlyWhat to do if a road accident victim needs help, a child swallows an object or an elderly person falls in the bathroom?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-from-close-allies-to-enemies-how-nations-that-supported-each-other-became-archrivals-explained-2741543-2025-06-16",
      "headline": "Once allies, now archrivals: The fallout between Iran and IsraelIsrael's first open offensive on Iran marks a dramatic turn in a long, complex history. Before Iran's 1979 revolution, the two were close allies, trading arms, oil, and intelligence. The Shah saw Israel as a key partner against Arab rivals. But the Islamic Republic's rise, proxy wars, and nuclear ambitions turned friendship into enmity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/up-woman-points-gun-petrol-pump-attendant-during-argument-2741461-2025-06-16",
      "headline": "Video: Woman pulls out gun on UP petrol pump attendant after heated argumentA video from Uttar Pradesh's Hardoi district went viral showing a girl pointing a revolver at a petrol pump salesman during a dispute over refuelling. Police registered a case, detained the girl and her father, and seized the weapon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/stealth-wars-will-pakistans-j-35-kaan-jet-deals-to-counter-india-spark-new-arms-race-in-asia-2741074-2025-06-15",
      "headline": "Stealth wars: Will Pakistan's J-35, KAAN jet deals to counter India spark new arms race in Asia?The arms purchase spree comes on the heels of Operation Sindoor, which underlined India's military might and exposed Pakistan's air defence\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/digvesh-rathi-video-viral-5-wickets-in-5-balls-2741739-2025-06-16",
      "headline": "5 wickets in 5 balls: Digvesh Rathi has Sanjeev Goenka hooked even after IPLDigvesh Rathi took five wickets in five balls in a local game, showcasing his exceptional talent. The owner of Lucknow Super Giants, Sanjeev Goenka, reacted after being mesmerised by Rathi's brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ayan-raj-scores-unbeaten-327-runs-inspired-by-vaibhav-suryavanshi-2741717-2025-06-16",
      "headline": "Inspired by Vaibhav Suryavanshi, his 13-year-old friend smashes 327 in 134 ballsThirteen-year-old Ayan Raj scored an unbeaten 327 runs in a district cricket match. Raj revealed that he used to play with Vaibhav Suryavanshi when he was younger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-bowling-virat-kohli-vs-sachin-tendulkar-2741716-2025-06-16",
      "headline": "Virat Kohli or Sachin Tendulkar: Who challenged James Anderson more?James Anderson shared his experiences bowling to Indian legends Virat Kohli and Sachin Tendulkar. The former England pacer highlighted how Kohli's game evolved, making him tougher to dismiss over time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vinicius-jr-racial-abuse-fans-jailed-2741708-2025-06-16",
      "headline": "Madrid court jails 4 radical fans for racially abusing Vinicius JrFour individuals received suspended sentences for a racist hate crime targeting Vinicius Jr. The court imposed fines, bans, and ordered an educational programme to promote equality and prevent discrimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhaka-court-travel-ban-shakib-al-hasan-corruption-stock-market-embezzlement-2741701-2025-06-16",
      "headline": "Dhaka court imposes travel ban on Shakib Al Hasan amid corruption caseA court in Dhaka has imposed a travel ban on former Awami League lawmaker and cricketer-turned-politician Shakib Al Hasan, along with 15 others, in connection with a corruption case. Shakib has not played competitive cricket since the Pakistan Super League in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-1st-test-headingley-pitch-report-2741679-2025-06-16",
      "headline": "ENG vs IND, 1st Test pitch report: Expect true wicket over 5 days, says curatorThe Headingley pitch curator expects a balanced match in the 1st Test between India and England. He hopes that the series opener would last for a full 5 days instead of 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-shardul-thakur-vs-nitish-reddy-all-rounder-harbhajan-singh-2741670-2025-06-16",
      "headline": "Shardul Thakur vs Nitish Reddy: Harbhajan Singh picks his choice for England TestsSenior campaigner Shardul Thakur returns to the Test fold for the upcoming five-match series in England. He will compete for a spot in the XI with Nitish Kumar Reddy, who shone in his maiden Test series in Australia earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-eng-vs-ind-bbl-draft-2741667-2025-06-16",
      "headline": "T20 World Cup in mind, Archer enters BBL draft with full availabilityJofra Archer has registered in the BBL for a full season in the run up to the T20 World Cup 2026. The BBL is expected to collide with the Ashes this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-karun-nair-interview-r-ashwin-2741638-2025-06-16",
      "headline": "Karun Nair: I should have celebrated my 300 moreKarun Nair has been recalled to the Indian Test team after eight years. Karun looks back at his journey as a cricketer and says that he should have celebrated his milestones more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-t20i-future-aaqib-javed-2741626-2025-06-16",
      "headline": "End of Babar Azam in T20I cricket? Aqib Javed clears air around star batter's futureBabar Azam has not played for Pakistan in the T20I format since December 2024. Babar, along with Mohammad Rizwan and Shaheen Afridi, will not be considered for the upcoming T20I series in the West Indies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ball-tampering-accusation-tnpl-madurai-panthers-dindigul-dragons-controversy-2741570-2025-06-16",
      "headline": "R Ashwin accused of ball-tampering with chemically-treated towels in TNPL: ReportTNPL 2025: R Ashwin and his team, the Dindigul Dragons, have been accused of using towels to alter the condition of the ball during their match against the Madurai Panthers on Saturday in Salem. The Madurai franchise has submitted a formal complaint to the league organisers, alleging ball tampering by Dindigul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-shardul-thakur-vs-nitish-reddy-all-rounder-harbhajan-singh-2741670-2025-06-16",
      "headline": "Shardul Thakur vs Nitish Reddy: Harbhajan Singh picks his choice for England TestsSenior campaigner Shardul Thakur returns to the Test fold for the upcoming five-match series in England. He will compete for a spot in the XI with Nitish Kumar Reddy, who shone in his maiden Test series in Australia earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-eng-vs-ind-bbl-draft-2741667-2025-06-16",
      "headline": "T20 World Cup in mind, Archer enters BBL draft with full availabilityJofra Archer has registered in the BBL for a full season in the run up to the T20 World Cup 2026. The BBL is expected to collide with the Ashes this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-karun-nair-interview-r-ashwin-2741638-2025-06-16",
      "headline": "Karun Nair: I should have celebrated my 300 moreKarun Nair has been recalled to the Indian Test team after eight years. Karun looks back at his journey as a cricketer and says that he should have celebrated his milestones more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-t20i-future-aaqib-javed-2741626-2025-06-16",
      "headline": "End of Babar Azam in T20I cricket? Aqib Javed clears air around star batter's futureBabar Azam has not played for Pakistan in the T20I format since December 2024. Babar, along with Mohammad Rizwan and Shaheen Afridi, will not be considered for the upcoming T20I series in the West Indies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ball-tampering-accusation-tnpl-madurai-panthers-dindigul-dragons-controversy-2741570-2025-06-16",
      "headline": "R Ashwin accused of ball-tampering with chemically-treated towels in TNPL: ReportTNPL 2025: R Ashwin and his team, the Dindigul Dragons, have been accused of using towels to alter the condition of the ball during their match against the Madurai Panthers on Saturday in Salem. The Madurai franchise has submitted a formal complaint to the league organisers, alleging ball tampering by Dindigul."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}