{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-forcefully-lays-off-700-trainees-in-mysuru-report-2676257-2025-02-07",
      "headline": "Infosys 'forcefully' lays off 700 trainees in Mysuru: ReportMost of the affected recruits were from the engineering batch of 2022, who were onboarded after a wait of about 2.25 years, said sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-after-volatile-session-fmcg-energy-drag-rbi-mpc-2676251-2025-02-07",
      "headline": "Sensex, Nifty end lower after volatile session; FMCG, energy drag marketThe S&P BSE Sensex fell by 197.97 points to end at 77,860.19, while the NSE Nifty50 declined by 43.40 points to close at 23,559.95. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-500-points-after-rbi-mpc-announcement-625-percent-why-is-stock-market-falling-today-2676229-2025-02-07",
      "headline": "Sensex tanks 500 points after RBI MPC: Why is stock market falling todayThe S&P BSE Sensex was down by 539.72 points to 77,516.79, while the NSE Nifty50 declined by 147.50 points to 23,455.60 as of 2:43 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/activate-uan-to-avail-epfo-eli-scheme-benefits-before-february-15-check-details-2676213-2025-02-07",
      "headline": "Activate UAN to avail EPFO's ELI scheme benefits before February 15. Check detailsEPFO ELI: UAN or Universal Account Number is a unique 12-digit number allotted by EPFO which is necessary for managing provident fund accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mohini-mohan-dutta-rs-500-crore-surprise-in-ratan-tata-will-2676202-2025-02-07",
      "headline": "Who is Mohini Mohan Dutta? Rs 500 crore surprise in Ratan Tata's willRatan Tata also left behind a share for his siblings, his butler Subbiah and German Shepherd Tito have also been provided for in his will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-introduces-bankin-domain-for-indian-banks-to-tackle-financial-fraud-2676141-2025-02-07",
      "headline": "RBI introduces 'bank.in' domain for Indian banks to tackle financial fraudThe move aims to tackle growing financial fraud and cybercrime, prevent malicious activities, and strengthen the country's financial ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/after-5-years-rbi-cut-key-lending-rate-by-25-basis-points-to-625-2676083-2025-02-07",
      "headline": "After 5 years, RBI cut key lending rate by 25 basis points to 6.25%This marks the first rate cut since 2020 and the first policy decision under Governor Malhotra's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-home-loans-to-get-cheaper-as-rbi-cuts-rates-25-basis-points-625-percent-check-details-2676080-2025-02-07",
      "headline": "Home loans to get cheaper as RBI cuts rates. Check detailsThe RBI MPC reduced key lending rates by 25 basis points to 6.25%, the first rate cut in nearly five years under the leadership of newly appointed RBI Governor Sanjay Malhotra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-rate-interest-repo-cut-25-basis-points-625-per-cent-first-time-since-2020-2676071-2025-02-07",
      "headline": "RBI reduces key lending rate by 25 basis points to 6.25%The rate cut announced by the committee is the first since 2020. This was also the first policy meeting of Sanjay Malhotra as RBI Governor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-markets-opening-sensex-nifty-flat-as-investors-await-rbi-policy-decision-itc-down-2-percent-2676061-2025-02-07",
      "headline": "Stock markets open flat as investors await RBI policy decision; ITC down 2%The S&P BSE Sensex was down by 23.98 points to 78,034.18, while the NSE Nifty50 lost 7 points to 23,596.35 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-upi-services-unavailable-on-this-date-get-details-here-2675839-2025-02-06",
      "headline": "HDFC Bank UPI services unavailable on this date. Get details hereDuring the downtime, the UPI transactions on HDFC Bank's current and savings accounts and RuPay credit cards will be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06",
      "headline": "Zomato to be Eternal? Deepinder Goyal says company name change cleared by boardThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/default-on-personal-loan-check-consequences-impact-on-credit-score-hefty-penalty-legal-notice-2675670-2025-02-06",
      "headline": "What if you default on personal loan? Check consequencesPersonal loan default consequences: Banks or lenders impose hefty penalties, or late fee charges in case of a missed EMI amount. They may even impose higher interest charges and additional charges for collection efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-redeem-credit-card-points-check-2-simple-ways-online-banking-customer-service-helpline-2675748-2025-02-06",
      "headline": "Want to redeem credit card points? Check these 2 simple ways How to redeem credit card points: The number of credit card points one earns depends on the type of card, whether basic or premium, and the amount spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-sharply-as-dalal-street-remains-edgy-ahead-of-rbis-rate-decision-2675724-2025-02-06",
      "headline": "Sensex, Nifty fall sharply as D-Street remains edgy ahead of RBI's rate decisionThe S&P BSE Sensex closed 213.12 points lower at 78,058.16 and the NSE Nifty50 settled 92.95 points lower at 23,603.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-income-tax-regime-maximum-deductions-savings-calculations-explained-2675707-2025-02-06",
      "headline": "How much can you save with maximum deductions under old income tax regime?Old tax regime: What if someone earning above Rs 12.75 lakh annually chooses the old regime and claims the maximum deductions? Will it result in tax savings? This article explores the key deductions available under the old income tax regime and the maximum amount one can claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-should-you-choose-for-income-above-rs-12-lakh-2675644-2025-02-06",
      "headline": "Old vs New tax regime: Which one should you choose for income above Rs 12.75 lakh?Old vs New tax regime: What if you earn more than Rs 12.75 lakh? Should you pick the new tax regime for lower rates or stick to the old one for deductions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-what-is-it-and-how-will-it-help-taxpayers-2675626-2025-02-06",
      "headline": "New Income Tax Bill: What is it and how will it help taxpayers?In order to make the Income Tax Act 1961 more concise and simpler, the government is introducing a new income tax bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/union-cabinet-likely-to-approve-new-income-tax-bill-tomorrow-2675611-2025-02-06",
      "headline": "Union Cabinet likely to approve new Income Tax Bill tomorrowThe Union Cabinet is expected to clear the new Income Tax Bill tomorrow, paving the way for its introduction in the Lok Sabha"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maryade-prashne-when-and-where-watch-the-malayalam-revenge-drama-prime-video-stmp-2676264-2025-02-07",
      "headline": "Maryade Prashne OTT release: When and where to watch the revenge dramaThe revenge family drama Maryade Prashne, which released in November last year, is now available to stream on a major OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-prosenjit-chatterjee-jeet-saswata-chatterjee-parambrata-chattopadhyay-2676206-2025-02-07",
      "headline": "How Netflix pulled most unexpected casting coup with Khakee The Bengal ChapterNetflix has orchestrated a major casting coup by bringing together top stars of Bengali cinema for its upcoming crime thriller, Khakee: The Bengal Chapter. The show promises to showcase the industry's talent and diversity in a groundbreaking way."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-shreds-elvish-yadav-for-trolling-bigg-boss-18-finalist-chum-darang-2676258-2025-02-07",
      "headline": "Internet shreds Elvish Yadav for trolling Bigg Boss 18 finalist Chum DarangSocial media users have slammed YouTuber contestant Elvish Yadav for making inappropriate remarks about Bigg Boss 18 finalist and actor Chum Darang's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bada-naam-karenge-review-sooraj-barjatya-ott-debut-palash-vaswani-sony-liv-2676217-2025-02-07",
      "headline": "Bada Naam Karenge review: Sweet, familiar and full of sanskaarsReleased-Fri Feb 07, 2025Bada Naam Karenge is a classic Rajshri Productions love story with sweet romance, catchy music, and family drama. While it evokes nostalgia, its simple plot and dated gender roles may not resonate with all. Strong performances and a heartfelt message make it a warm, fulfilling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/from-romance-to-revenge-k-drama-star-park-hyung-sik-buried-hearts-2676222-2025-02-07",
      "headline": "From romance to revenge, K-drama star Park Hyung-sik can do it allThere are not many South Korean stars who can boast of having a diverse filmography like Park Hyung-sik. In today's installment of our Weekly K-Fix, we take a quick look at the artiste's short but illustrious career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-greatest-rivalry-india-vs-pakistan-review-reliving-cricket-golden-era-and-its-heroes-2676210-2025-02-07",
      "headline": "The Greatest Rivalry India vs Pakistan: Reliving cricket's golden era and its heroes  Released-Fri Feb 07, 2025The Greatest Rivalry India vs Pakistan review: A new Netflix docu-series revives the legendary India vs Pakistan cricket rivalry, exploring its intense history and iconic players with insights from cricket legends and journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-netflixs-the-trauma-code-a-breakout-hit-surpassing-squid-game-2-2676127-2025-02-07",
      "headline": "What makes Netflix's The Trauma Code a breakout hit surpassing Squid Game 2The Trauma Code: Heroes on Call has taken Netflix by storm, surpassing Squid Game Season 2 on the global chart. This medical drama captivates with its blend of intense medical scenarios, hospital politics, and humour, offering a fresh take on the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-long-note-on-bianca-censori-invisible-dress-grammy-controversy-2675906-2025-02-06",
      "headline": "Kanye West on Bianca Censori's nude dress controversy: Wife is so brave and hotKanye West defends his wife Bianca Censori's controversial invisible dress at the Grammy 2025, sharing a long note on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-sets-the-record-straight-on-55-kg-weight-loss-no-ozempic-just-hard-work-2675851-2025-02-06",
      "headline": "Ram Kapoor on 55 kg weight loss: No Ozempic, just hard workRam Kapoor's 55 kg weight loss has sparked widespread speculation about the methods he used. However, Kapoor clarified on social media that his transformation was achieved through hard work and dedication, dismissing the use of shortcuts like Ozempic or surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-season-2-review-equal-parts-dramatic-and-delectably-exciting-netflix-series-2675638-2025-02-06",
      "headline": "The Night Agent Season 2 review: Equal parts dramatic and delectably excitingReleased-Thu Jan 23, 2025In The Night Agent Season 2 on Netflix, a spy recruited by the most secretive body of the FBI, gets entangled in the mysteries of state secrets and in-house traitors. Peter Sutherland is back to save his country from falling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-on-ott-when-where-to-watch-nithya-menen-ravi-mohan-film-2675609-2025-02-06",
      "headline": "Kadhalikka Neramillai on OTT: When and where to watch Nithya Menen, Ravi Mohan filmNithya Menen and Ravi Mohan's Kadhalikka Neramillai is reportedly gearing up for its OTT debut on Netflix. The film was earlier released in theatres during the Pongal festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shiv-sena-mp-milind-deoras-woke-dig-at-grammys-for-not-honouring-zakir-hussain-2675559-2025-02-06",
      "headline": "Milind Deora's 'woke' dig at Grammys for not honouring tabla icon Zakir HussainShiv Sena leader and Member of Parliament Milind Deora took a dig at the Grammys for omitting Tabla maestro Zakir Hussain's name from their In Memoriam segment. Zakir Hussain, who died in December 2024, was a four-time Grammy winner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-kendrick-lamar-biggest-fight-rap-history-grammys-2025-2675551-2025-02-06",
      "headline": "Kendrick Lamar vs Drake: Did the Grammys settle the 'battle rap'?Rappers Kendrick Lamar and Drake's feud spans over a decade, with diss tracks, accusations, and a lawsuit. From collaborations to lyrical attacks, here's a full breakdown of their ongoing rap battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jisoo-of-blackpink-working-in-newtopia-gave-me-a-lot-of-confidence-2675539-2025-02-06",
      "headline": "Jisoo of BLACKPINK: Working in Newtopia gave me a lot of confidence The highly anticipated K-drama, Newtopia, featuring Park Jeong-min and BLACKPINK's Jisoo, debuts on February 7, 2025, blending a zombie apocalypse with a poignant love story. Jisoo opens up on her character and the differences between herself and Young-joo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-and-ar-rahman-perform-urvasi-urvasi-in-chennai-leave-fans-ecstatic-2675531-2025-02-06",
      "headline": "Ed Sheeran, AR Rahman perform Urvasi Urvasi in Chennai, fans ecstaticEd Sheeran's Chennai concert took an unforgettable turn when AR Rahman joined him on stage. The duo's surprise performance left the audience thrilled. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-us-on-february-12-13-bilateral-meeting-with-president-trump-2676333-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM to visit US on February 12-13, hold bilateral with Trump amid tariff threatPM Modi's visit, which will happen within the first month of Donald Trump assuming office, comes amid the President's tariff threats and the deportation of illegal Indian immigrants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-lieutenant-governor-orders-probe-aam-aadmi-party-operation-lotus-charge-bjp-assembly-elections-results-arvind-kejriwal-2676189-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal gets anti-graft body's notice: Submit proof of 'Op Lotus' chargeThe development, which comes a day before counting of votes in Delhi, took place as the Lt Governor directed the ACB to probe AAP's 'Operation Lotus' charge against the BJP."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/illegal-indian-migrants-deportation-us-donald-trump-crackdown-2676324-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "487 more illegal Indian migrants to be deported from US soon: GovernmentA US military aircraft carrying 104 deported migrants, largely from Haryana and Punjab, landed in Amritsar on January 5, marking the first large-scale deportation under President Donald Trump's administration.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-infiltrators-indian-line-of-control-killed-army-foiled-attack-2676192-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak attack foiled, 7 infiltrators killed along LoC, 3 were army regulars: SourcesSources said the Indian Army ambushed Pakistan's Border Action Team (BAT) while it was attempting to attack a forward post in the Krishna Ghati sector in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/pm-modi-congress-jawaharlal-nehru-freedom-of-speech-first-amendment-constitution-2676115-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a troubled Nehru got Constitution amended to restrict free speechIt was in 1951 that India's first Prime Minister, Jawaharlal Nehru, amended the Constitution for the first time, because the \"Constitution came in the way\" of urgent social changes. A look at what led to the first amendment of the Constitution, which curtailed the absolute freedom of speech."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-consulate-seattle-on-visa-denial-to-indian-american-politician-kshama-sawant-2676218-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trespass: Indian consulate as politician Kshama Sawant protests visa refusalThe Indian Consulate in Seattle on Friday said that the Consulate faced a law and order situation after certain individuals tried to enter the Consulate premises without authorisation after office hours. The incident happened over the visa denial to Indian-American politician Kshama Sawant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mohini-mohan-dutta-rs-500-crore-surprise-in-ratan-tata-will-2676202-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Mohini Mohan Dutta? Rs 500 crore surprise in Ratan Tata's willRatan Tata also left behind a share for his siblings, his butler Subbiah and German Shepherd Tito have also been provided for in his will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-supriya-sule-sanjay-raut-india-bloc-maharashtra-elections-discrepancy-voters-adult-population-election-commission-2676169-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How more voters in Maharashtra than voting population, Rahul Gandhi asks poll bodyRahul Gandhi, addressing a press briefing with Sanjay Raut and Supriya Sule, claimed in the five months between the Lok Sabha and Assembly polls, 39 lakh new voters were added in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/badass-ravi-kumar-review-xpose-universe-himesh-reshammiya-2676281-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Badass Ravi Kumar review: Logic optional but patience essentialReleased-Fri Feb 07, 2025Himesh Reshammiya's Badass Ravi Kumar is an action-packed film where logic takes a backseat, but entertainment is paramount. The movie features Ravi Kumar avenging personal losses and fighting global enemies with style and melodrama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-forcefully-lays-off-700-trainees-in-mysuru-report-2676257-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Infosys 'forcefully' lays off 700 trainees in Mysuru: ReportMost of the affected recruits were from the engineering batch of 2022, who were onboarded after a wait of about 2.25 years, said sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shreyas-iyer-odi-spot-admission-pundit-reaction-virat-kohli-2676087-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Iyer's ODI spot admission baffles pundits as line-up change looms in 2nd ODIIndia vs England: Shreyas Iyer revealed after the first ODI that he was not originally part of the playing XI in Nagpur. He stated that he replaced Virat Kohli in the India lineup after the batter suffered a knee injury. Iyer's admission baffled Akash Chopra.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-5-year-old-slips-in-front-of-car-in-parking-lot-fatally-run-over-2676248-2025-02-07?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: 5-year-old slips in front of car in parking lot, fatally run overA 5-year-old boy died after he was crushed by an SUV in a parking lot of a residential society in the CIDCO area of Maharashtra's Nashik, police said on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-prosenjit-chatterjee-jeet-saswata-chatterjee-parambrata-chattopadhyay-2676206-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Netflix pulled most unexpected casting coup with Khakee The Bengal ChapterNetflix has orchestrated a major casting coup by bringing together top stars of Bengali cinema for its upcoming crime thriller, Khakee: The Bengal Chapter. The show promises to showcase the industry's talent and diversity in a groundbreaking way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-claims-votes-polled-per-booth-data-not-uploaded-election-commission-delhi-2676255-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Booth-wise vote data not uploaded by poll panel: Arvind Kejriwal ahead of resultsArvind Kejriwal accused the Election Commission of refusing to publish polling data, prompting AAP to launch a website with Form 17C records for transparency in Delhi Assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-shivpuri-mirage-fighter-jet-crash-injured-pilot-communicates-2676021-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Injured Air Force pilot radios in after crash: 'Joshi, Jadhav bol raha hun'An Indian Air Force Mirage-2000 fighter jet crashed in Madhya Pradesh's Shivpuri district due to a system malfunction. Both pilots ejected safely with minor injuries. A viral video captured one pilot reporting the crash to Gwalior Airbase.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williamss-return-could-delay-isro-astronauts-maiden-space-flight-2676191-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian astronaut's flight may be delayed to bring back Sunita WilliamsSpaceX is having issues with the batteries of the newly christened Dragon spacecraft, forcing it to look for new options. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/exclusive-new-hyundai-venue-launch-in-india-in-q4-2025-2676301-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Exclusive | New Hyundai Venue launch in India in Q4 2025The Hyundai Venue rivals the likes of the Maruti Suzuki Brezza, Tata Nexon, Kia Sonet, Kia Syros, Mahindra XUV 3XO and Skoda Kylaq."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-diplomat-teaser-john-abraham-is-master-of-persuasion-in-gripping-diplomacy-tale-2676177-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Diplomat teaser: John Abraham is master of persuasion in diplomatic thrillerThe Diplomat teaser: John Abraham will be seen in a different role in The Diplomat, where intellect triumphs over brawn. The film, based on true events, highlights the art of diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/meet-kalpit-veerwal-who-turned-his-jee-main-record-into-an-edtech-success-story-2676254-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "He was first to get 360/360 in JEE Main in 2017, a record. What is he doing now?Kalpit Veerwal had become the first student to score 360/360 in JEE Main, back in 2017. But he didn't even go for placements at IIT Bombay. Here's what he is doing now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/loveyapa-movie-review-junaid-khan-wonderfully-elevates-a-well-intentioned-romantic-comedy-2675936-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Loveyapa review: Junaid Khan wonderfully elevates a well-intentioned rom-comReleased-Fri Feb 07, 2025Director Advait Chandan's Loveyapa addresses the relevant problems of the generation - body-shaming, social media manipulation, gas-lighting, and deep-fakes. Junaid Khan makes an effortless big screen debut with the right story at the right time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-nitishs-jobs-pitch-is-a-masterstroke-in-bihar-assembly-election-year-2675723-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Nitish's jobs pitch is a masterstroke in Bihar assembly election yearWith 'Rozgar Matlab Nitish Sarkar' banners, the state's longest-serving CM crafts a strategy to steal principal rival Tejashwi Yadav's thunder and stay at the helm of power\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jeet-adani-diva-shah-steal-the-show-with-bhangra-at-pre-wedding-celebrations-video-2676140-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Jeet Adani, Diva Shah steal the show with Bhangra at pre-wedding celebrationsJeet Adani will get married to Diva Jaimin Shah, daughter of a Surat-based businessman, today.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-greatest-rivalry-india-vs-pakistan-review-reliving-cricket-golden-era-and-its-heroes-2676210-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Greatest Rivalry India vs Pakistan: Reliving cricket's golden era and its heroes  Released-Fri Feb 07, 2025The Greatest Rivalry India vs Pakistan review: A new Netflix docu-series revives the legendary India vs Pakistan cricket rivalry, exploring its intense history and iconic players with insights from cricket legends and journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/social-network-star-jesse-eisenberg-says-mark-zuckerberg-is-obsessed-with-power-2676303-2025-02-07",
      "headline": "Social Network star Jesse Eisenberg says Mark Zuckerberg is 'obsessed with power'Social Network star Jesse Eisenberg, who appeared in the David Fincher-directed movie based on Facebook CEO Mark Zuckerberg, recently slammed the businessperson as someone who is obsessed with 'power and avarice.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-social-media-criticism-and-staying-grounded-exclusive-2676299-2025-02-07",
      "headline": "Exclusive: Naga Chaitanya on social media criticism and staying groundedNaga Chaitanya talks about staying grounded, handling social media criticism, and why relevance matters in changing times. He embraces criticism, calling it essential for growth in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maryade-prashne-when-and-where-watch-the-malayalam-revenge-drama-prime-video-stmp-2676264-2025-02-07",
      "headline": "Maryade Prashne OTT release: When and where to watch the revenge dramaThe revenge family drama Maryade Prashne, which released in November last year, is now available to stream on a major OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/badass-ravi-kumar-review-xpose-universe-himesh-reshammiya-2676281-2025-02-07",
      "headline": "Badass Ravi Kumar review: Logic optional but patience essentialReleased-Fri Feb 07, 2025Himesh Reshammiya's Badass Ravi Kumar is an action-packed film where logic takes a backseat, but entertainment is paramount. The movie features Ravi Kumar avenging personal losses and fighting global enemies with style and melodrama."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rcbs-sports-forward-nation-report-a-key-milestone-in-indias-sports-development-2676349-2025-02-07",
      "headline": "RCB's Sports Forward Nation report: A key milestone in India's sports developmentRoyal Challengers Bengaluru's Sports Forward Nation report is a key policy that has been prepared to highlight the sporting development and how the 2036 Olympics bid by India will enhance the growth of Indian sports using certain parameters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shreyas-iyers-return-perfect-example-for-seniors-to-play-domestic-cricket-sanjay-manjrekar-2676338-2025-02-07",
      "headline": "Iyer's return perfect example for seniors to play domestic cricket: ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar praised Shreyas Iyer for his marvellous half-century on ODI comeback after six months mentioning the impact of domestic cricket on his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-second-test-day-two-alex-carey-hundred-galle-2676311-2025-02-07",
      "headline": "Alex Carey becomes 2nd Australian wicketkeeper to hit Test hundred in AsiaAlex Carey became the second Australian wicketkeeper after Adam Gilchrist to hit a Test hundred in Asia on Day 2 of the ongoing match in Galle. Carey got to his hundred with a boundary as Australia stamped their authority on the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-1st-odi-yashasvi-jaiswal-teased-by-teammates-after-sensational-catch-to-dismiss-duckett-2676276-2025-02-07",
      "headline": "Watch: Yashasvi Jaiswal gets teased by teammates after sensational catch in 1st ODIYoung India opener Yashasvi Jaiswal was teased by his teammates following his sensational catch in the first ODI against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-shafali-verma-indian-odi-team-omission-training-2676268-2025-02-07",
      "headline": "My father suffered a heart attack days before my ODI team omission: Shafali VermaShafali Verma opened up on the difficult period she had to endure over the past few months as her father suffered a heart attack days before she was dropped from the India ODI team. Shafali is aiming to make a comeback to the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa20-expansion-indian-cricketers-allan-donald-2676259-2025-02-07",
      "headline": "SA20 will grow if more Indian cricketers play: Allan Donald hints at league expansionSouth African great Allan Donald believes more participation from Indian cricketers will boost the SA20 league. MI Cape Town will take on defending champions Sunrisers Eastern Cape in Saturday's final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-steve-smith-36th-test-century-galle-gets-level-with-joe-root-and-rahul-dravid-2676242-2025-02-07",
      "headline": "Steve Smith slams 36th Test hundred, levels with Joe Root and India legendStar Australia batter Steve Smith scored his 36th Test century on Day 2 of the second Test against Sri Lanka in Galle. He became the joint fifth-highest century maker in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-shreyas-iyer-champions-trophy-ricky-ponting-2676241-2025-02-07",
      "headline": "Surprised Shreyas has been out of India team in last few years: PontingRicky Ponting admitted that he was a bit surprised to see Shreyas Iyer not being a part of the Indian team over the last few years. Ponting also tipped Shreyas to be a key player for India during their Champions Trophy matches in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/virgil-van-dijk-dismisses-liverpool-contract-extension-rumour-2676225-2025-02-07",
      "headline": "Virgil van Dijk dismisses Liverpool contract extension rumour: I have no ideaVirgil van Dijk dismissed reports of his contract extension at Liverpool after a stunning performance against Tottenham in the Carabao Cup semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/atif-aslam-champions-trophy-anthem-icc-watch-video-pakistan-2676219-2025-02-07",
      "headline": "Atif Aslam adds to Champions Trophy hype, sings official anthemThe International Cricket Council (ICC) announced the release of the ICC Men's Champions Trophy 2025 official song, Jeeto Baazi Khel Ke, by renowned Pakistani singer Atif Aslam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-steve-smith-australia-leading-test-run-scorer-in-asia-2676196-2025-02-07",
      "headline": "Steve Smith becomes Australia's leading Test run-scorer in AsiaStar Australian batter Steve Smith became Australia's highest Test run scorer in the Asian subcontinent on day two of the second Test against Sri Lanka in Galle on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-steve-smith-36th-test-century-galle-gets-level-with-joe-root-and-rahul-dravid-2676242-2025-02-07",
      "headline": "Steve Smith slams 36th Test hundred, levels with Joe Root and India legendStar Australia batter Steve Smith scored his 36th Test century on Day 2 of the second Test against Sri Lanka in Galle. He became the joint fifth-highest century maker in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-shreyas-iyer-champions-trophy-ricky-ponting-2676241-2025-02-07",
      "headline": "Surprised Shreyas has been out of India team in last few years: PontingRicky Ponting admitted that he was a bit surprised to see Shreyas Iyer not being a part of the Indian team over the last few years. Ponting also tipped Shreyas to be a key player for India during their Champions Trophy matches in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/virgil-van-dijk-dismisses-liverpool-contract-extension-rumour-2676225-2025-02-07",
      "headline": "Virgil van Dijk dismisses Liverpool contract extension rumour: I have no ideaVirgil van Dijk dismissed reports of his contract extension at Liverpool after a stunning performance against Tottenham in the Carabao Cup semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/atif-aslam-champions-trophy-anthem-icc-watch-video-pakistan-2676219-2025-02-07",
      "headline": "Atif Aslam adds to Champions Trophy hype, sings official anthemThe International Cricket Council (ICC) announced the release of the ICC Men's Champions Trophy 2025 official song, Jeeto Baazi Khel Ke, by renowned Pakistani singer Atif Aslam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-steve-smith-australia-leading-test-run-scorer-in-asia-2676196-2025-02-07",
      "headline": "Steve Smith becomes Australia's leading Test run-scorer in AsiaStar Australian batter Steve Smith became Australia's highest Test run scorer in the Asian subcontinent on day two of the second Test against Sri Lanka in Galle on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-india-vs-england-fan-disappointed-batter-nagpur-odi-miss-watch-2676195-2025-02-07",
      "headline": "Watch: Virat Kohli fan left disappointed after batter's Nagpur ODI missIndia secured a four-wicket win over England in Nagpur, but Virat Kohli's absence due to a knee injury left fans disappointed. Shreyas Iyer's last-minute inclusion proved vital, raising selection debates ahead of Kohli's expected return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-board-update-saim-ayub-injury-new-zealand-tour-2676176-2025-02-07",
      "headline": "Pakistan Cricket Board issues crucial fitness update on injured Saim AyubThe Pakistan Cricket Board (PCB) has announced that opener Saim Ayub is making good progress in his recovery from a right ankle injury and will continue his rehabilitation in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ruben-amorim-manchester-united-winter-signings-big-risk-patrick-drogu-premier-league-2676156-2025-02-07",
      "headline": "Amorim admits major risk after Manchester United make only 2 January signingsManchester United manager Ruben Amorim admitted limiting January signings to just two players was a \"big risk,\" prioritising long-term stability over quick fixes, despite United's struggles and a growing injury crisis, including Lisandro Martínez's latest setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-is-leader-of-franchise-cricket-and-sa20-can-only-learn-from-them-graeme-smith-2676138-2025-02-07",
      "headline": "IPL is leader of franchise cricket and SA20 can learn from them: Graeme SmithSA20 commissioner Graeme Smith has committed to making it the world's second-best league, saying that the IPL remains the best league in franchise cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-anil-kumble-10-wickets-26-years-february-7-india-vs-pakistan-1999-2676114-2025-02-07",
      "headline": "When Anil Kumble stunned Pakistan with historic 10-wicket haulFebruary 7, 1999: India legend Anil Kumble emulated England off-spinner Jim Laker with a perfect 10-wicket haul in an inning against Pakistan in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-shreyas-iyer-confidence-set-the-tone-zaheer-khan-nagpur-2676109-2025-02-07",
      "headline": "Shreyas Iyer's confidence set the tone for India's Nagpur ODI: Zaheer KhanZaheer Khan hailed Shreyas Iyer's fearless knock in the Nagpur ODI, praising his confidence and resilience in India's chase. His aggressive innings played a key role in India's victory and strengthened his case for the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-special-general-meeting-on-march-1-to-elect-joint-secretary-2676103-2025-02-07",
      "headline": "BCCI convenes Special General Meeting on March 1 to elect joint secretaryThe Board of Control for Cricket in India (BCCI) has called a special general meeting (SGM) to nominate a new joint secretary. The SGM will be conducted in Mumbai on March 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-is-leader-of-franchise-cricket-and-sa20-can-only-learn-from-them-graeme-smith-2676138-2025-02-07",
      "headline": "IPL is leader of franchise cricket and SA20 can learn from them: Graeme SmithSA20 commissioner Graeme Smith has committed to making it the world's second-best league, saying that the IPL remains the best league in franchise cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-anil-kumble-10-wickets-26-years-february-7-india-vs-pakistan-1999-2676114-2025-02-07",
      "headline": "When Anil Kumble stunned Pakistan with historic 10-wicket haulFebruary 7, 1999: India legend Anil Kumble emulated England off-spinner Jim Laker with a perfect 10-wicket haul in an inning against Pakistan in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-shreyas-iyer-confidence-set-the-tone-zaheer-khan-nagpur-2676109-2025-02-07",
      "headline": "Shreyas Iyer's confidence set the tone for India's Nagpur ODI: Zaheer KhanZaheer Khan hailed Shreyas Iyer's fearless knock in the Nagpur ODI, praising his confidence and resilience in India's chase. His aggressive innings played a key role in India's victory and strengthened his case for the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-special-general-meeting-on-march-1-to-elect-joint-secretary-2676103-2025-02-07",
      "headline": "BCCI convenes Special General Meeting on March 1 to elect joint secretaryThe Board of Control for Cricket in India (BCCI) has called a special general meeting (SGM) to nominate a new joint secretary. The SGM will be conducted in Mumbai on March 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shreyas-iyer-odi-spot-admission-pundit-reaction-virat-kohli-2676087-2025-02-07",
      "headline": "Shreyas Iyer's ODI spot admission baffles pundits as line-up change looms in 2nd ODIIndia vs England: Shreyas Iyer revealed after the first ODI that he was not originally part of the playing XI in Nagpur. He stated that he replaced Virat Kohli in the India lineup after the batter suffered a knee injury. Iyer's admission baffled Akash Chopra.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-carabao-cup-final-newcastle-united-after-tottenham-hotspur-win-2676059-2025-02-07",
      "headline": "Liverpool set up final against Newcastle United after thrashing SpursLiverpool booked their way to Wembley and a League Cup final against Newcastle United after defeating a lethargic Tottenham Hotspur 4-0 at Anfield on Thursday, and 4-1 on aggregate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aston-villa-premier-league-transer-news-winners-of-market-marcus-rahsford-marco-asensio-2676056-2025-02-07",
      "headline": "January Transfer Window: Are Aston Villa the true winners of the market?Aston Villa's ambitious January transfer window has seen them bring in high-profile yet inconsistent stars like Marcus Rashford and Marco Asensio. While the signings promise excitement, their success hinges on whether these players can rediscover their best form."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}