{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/why-family-offices-are-crucial-to-indias-viksit-bharat-by-2047-dream-2690899-2025-03-08",
      "headline": "Why family offices are crucial to India's 'Viksit Bharat by 2047' dream?At the India Today Conclave 2025, Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, discussed the growing role of family offices in India's journey towards becoming a developed economy by 2047. In a session titled \"A Case for Tomorrow\", moderated by Siddharth Zarabi, Shroff explained why family offices are vital for India's economic expansion and how they can contribute to achieving a Rs 30 trillion GDP target in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-gold-card-visas-not-worth-it-for-wealthy-indian-investors-rishabh-shroff-partner-law-firm-cyril-amarchand-mangaldas-2690874-2025-03-08",
      "headline": "US Gold Card visa expensive, not worth it for Indians: Top law firm bossRishabh Shroff, partner at Cyril Amarchand Mangaldas, said Donald Trump's $5 million US Gold Card visa does not make sense for Indians as cheaper alternatives are available. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indias-ultra-rich-top-1-percent-seeking-new-homes-abroad-rishabh-shroff-explains-2690872-2025-03-08",
      "headline": "Why are the richest 1% leaving India? Law firm boss Rishabh Shroff explains Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, shared insights into the rising trend of high-net-worth individuals (HNWIs) acquiring foreign passports and moving their wealth abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pay-is-based-on-capability-not-gender-avarna-jain-on-pay-gap-in-music-industry-2690861-2025-03-08",
      "headline": "Pay is based on capability, not gender: Avarna Jain on pay gap in music industryAt the India Today Conclave 2025, Avarna Jain, Vice Chairperson of Saregama, spoke about the role of women in the workforce and addressed the long-debated issue of pay parity in the music and entertainment industry. She stated that in creative fields, women are leading the way, and pay is determined by ability and capability, not gender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/place-of-tv-will-never-be-taken-away-anu-ranjan-on-otts-replacing-tv-2690829-2025-03-08",
      "headline": "Place of TV will never be taken away: Anu Ranjan on OTTs replacing TVAnu Ranjan, President of The Indian Television Academy, said that television will remain relevant despite the rise of OTT platforms at the India Today Conclave 2025. She explained that while digital streaming services are growing, they cannot replace television, mainly due to affordability and accessibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-today-conclave-2025-women-leaders-on-breaking-barriers-challenges-and-leadership-2690741-2025-03-08",
      "headline": "Conclave 2025: Women leaders on breaking barriers, challenges and leadershipAt the India Today Conclave 2025, Namita Thapar, Executive Director of Emcure Pharmaceuticals, stated that businesses should be evaluated based on numbers, not gender. Speaking at the session \"Breaking Barriers and Building Legacies,\" Thapar stressed that success in business depends on financial results, not whether a man or woman runs it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-see-best-week-of-2025-after-massive-correction-what-dalal-street-investors-can-expect-next-2690794-2025-03-08",
      "headline": "Dalal Street logs best week of 2025. Will positive momentum continue?After a long spell of selling, investors on Dalal Street have finally got some relief. But does this mean the worst is over? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/businesses-should-be-judged-on-numbers-not-genders-namita-thapar-2690743-2025-03-08",
      "headline": "Businesses should be judged by numbers, not gender: Namita Thapar International Women's Day: Namita Thapar, Executive Director of Emcure Pharmaceuticals, highlighted how financial results remain the key factor in business success, regardless of whether a man or a woman runs the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/women-investors-are-putting-in-more-money-in-mutual-funds-than-men-phonepe-wealth-report-2690737-2025-03-08",
      "headline": "Women investors outpacing men in mutual fund investments: ReportThere's a common belief that women prefer safer investments, but the data challenges that view. More women are actively investing in mutual funds and surpassing men in key areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-money-deadlines-you-can-not-miss-in-march-2025-2690529-2025-03-07",
      "headline": "These 3 money deadlines you can't miss in March 2025If you want to secure better returns, deposit in these special fixed deposits, which are available only for a limited period. The last date for investing in these schemes is March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rents-are-increasing-faster-than-salary-in-bengaluru-details-here-2690496-2025-03-07",
      "headline": "Bengaluru's housing rent crisis triggers online debate. Details hereA recent social media post has ignited debate over Bengaluru's soaring rents, with users sharing how housing costs are outpacing salaries and making city living unaffordable.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adtech-new-delhi-unveils-adtechhonours-to-recognise-marketing-tech-innovation-2690472-2025-03-07",
      "headline": "ad:tech New Delhi unveils ad:techHonours to recognise marketing tech innovationHeld on March 6 at Yashobhoomi, in collaboration with the International Advertising Association (IAA) India Chapter, this event brought together industry leaders to honour the innovators shaping the future of tech-driven marketing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/women-day-why-women-investors-outshine-men-in-long-term-wealth-building-stock-market-2690419-2025-03-07",
      "headline": "How women investors are winning the race on Dalal StreetWomen are proving to be more disciplined investors, staying invested for longer periods and making better financial decisions. Their patience and careful approach often lead to higher returns compared to men. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sebi-issues-warning-to-nestle-over-breach-of-insider-trading-regulations-2690402-2025-03-07",
      "headline": "Sebi warns Nestle over breach of insider trading regulations: ReportThe Indian arm of Swiss food giant Nestle said its compliance officer received an administrative warning letter from the Securities and Exchange Board of India (Sebi) on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multiple-pans-can-attract-rs-10000-fine-here-is-how-to-avoid-2690378-2025-03-07",
      "headline": "Multiple PANs can attract Rs 10,000 fine. Here's how to avoid  Holding multiple PANs can complicate tax filings and financial transactions as different transactions are recorded under different PANs, resulting in errors, incorrect tax calculations, and possible scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-end-flat-as-us-tariff-uncertainty-keeps-markets-on-edge-ril-shares-2690377-2025-03-07",
      "headline": "Sensex, Nifty end flat as US tariff uncertainty keeps market on edgeThe S&P BSE Sensex was down 7.51 points to end at 74,332.58, while the NSE Nifty50 added 7.80 points to close at 22,552.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-establishes-us-strategic-bitcoin-reserve-all-you-need-to-know-2690295-2025-03-07",
      "headline": "Donald Trump's US Strategic Bitcoin Reserve. All you need to know With this executive order, President Trump reinforces his commitment to make the US the 'crypto capital of the world.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-incorporating-in-india-is-the-best-decision-for-startups-in-2025-kunal-bahl-snapdeal-2690291-2025-03-07",
      "headline": "Explained: Why incorporating in India is the best decision for startups in 2025 Kunal Bahl, co-founder and former CEO of Snapdeal, believes that incorporating in India offers multiple advantages, including better funding opportunities, tax benefits, and easier compliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-tax-benefits-under-section-80c-check-these-5-options-ppf-ssy-nsc-2690227-2025-03-07",
      "headline": "Looking for tax benefits under Section 80C? Check these 5 optionsThe contributions made to the Public Provident Fund qualify for tax deductions under Section 80C and the interest earned, along with the maturity amount, is tax-free."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-shares-gain-after-prolonged-correction-check-brokerage-views-and-target-price-2690225-2025-03-07",
      "headline": "Reliance share price jumps 3% today. Good time to buy stock?Reliance stock price: The company's stock was up 3.41% to Rs 1,251.80 on the Bombay Stock Exchange (BSE) at 11:56 am. However, it is still down over 20% compared to its 52-week high of Rs 1,608.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-epfo-3-0-all-you-need-to-know-2690187-2025-03-07",
      "headline": "What is EPFO 3.0? 5 key things you can expect While inaugurating EPFO's Telangana zonal office and regional office in Hyderabad, Union Labour Minister Mansukh Mandaviya mentioned that the upgraded system will bring EPFO's services closer to a banking experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/race-against-time-whats-india-doing-to-deal-with-us-reciprocal-tariffs-2690185-2025-03-07",
      "headline": "Race against time: What's India doing to deal with US reciprocal tariffs?With US reciprocal tariffs kicking in on April 2, the government is reportedly considering tariff cuts on key imports while companies across sectors engage with American partners to safeguard their businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-zepto-to-raise-commissions-as-quick-commerce-battle-intensifies-report-2690173-2025-03-07",
      "headline": "Blinkit, Zepto to raise commissions as quick commerce battle intensifies: ReportZepto has been steadily hiking commissions for both users and brands, focusing on unit economics, while Blinkit is rolling out a variable commission model. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/veteran-investor-shankar-sharma-cautions-investors-for-bull-run-end-2025-2689953-2025-03-07",
      "headline": "Is the bull market dead? Ace investor Shankar Sharma cautions investors for 2025When questioned if small investors can bear losses like experienced traders, Sharma said that all successful investors once started small but grew by overcoming challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-news-from-gccs-hiring-set-to-outpace-it-firms-for-second-year-in-a-row-india-jobs-2690154-2025-03-07",
      "headline": "Good news from GCCs: Hiring set to outpace IT firms for second year in a rowWith global businesses continuing to expand their operations in India, GCCs (Global capability centres) are expected to play a bigger role in the job market, as per experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-lower-as-it-stocks-drag-market-in-early-trade-infosys-down-2-percent-2690138-2025-03-07",
      "headline": "Sensex, Nifty open lower as IT stocks drag market in early trade; Infosys down 2%The S&P BSE Sensex fell 206.29 points to 74,133.80, while the NSE Nifty50 lost 63.30 points to 22,481.40 as of 9:17 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-tumble-tariff-uncertainty-clobbers-markets-nasdaq-crashes-2690127-2025-03-07",
      "headline": "Tariff uncertainty clobbers US markets, Nasdaq crashes 10%, S&P slidesStocks fell even though President Trump offered a one-month reprieve from his 25% tariffs on many goods imported from Mexico and Canada. That's unlike the bounce stocks got the prior day from his giving a one-month exemption specifically for automakers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-to-monitor-negotiations-before-taking-a-call-on-us-tariffs-finance-minister-nirmala-sitharaman-2690125-2025-03-07",
      "headline": "India to monitor negotiations before taking a call on US tariffs: Finance MinisterFinance Minister Nirmala Sitharaman said that Commerce Minister Piyush Goyal is currently in the United States for discussions, and India will wait for the outcome before taking a stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lt-introduces-new-policy-one-day-paid-menstrual-leave-for-women-employees-chairman-s-n-subrahmanyan-2690119-2025-03-07",
      "headline": "L&T introduces one-day paid menstrual leave for women employeesThe announcement was made by Chairman and Managing Director S N Subrahmanyan during an event held to mark International Women's Day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-prices-fall-5-percent-crypto-after-donald-trump-orders-us-strategic-reserve-2690108-2025-03-07",
      "headline": "Bitcoin prices fall 5% after Donald Trump orders US strategic reserveBitcoin prices dropped over 5% a day before Donald Trump is set to meet with top executives from the cryptocurrency industry at the White House. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loans-under-under-scanner-as-rbi-plans-stricter-norms-for-banks-lenders-report-2689913-2025-03-06",
      "headline": "Gold loans under scanner as RBI plans stricter norms for lenders: ReportThe RBI wants banks and non-banking financial companies (NBFCs) to conduct deeper background checks on borrowers and verify the ownership of the gold being pledged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-will-central-government-employees-receive-good-news-before-holi-2689886-2025-03-06",
      "headline": "DA hike? Will central government employees receive good news before Holi?The government reviews DA twice a year; the January hike is announced around Holi, while July revision is around Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-special-fixed-deposits-offering-up-to-805-percent-interest-check-details-2689853-2025-03-06",
      "headline": "5 special fixed deposits offering up to 8.05% interest. Check details  These fixed deposits are available only for a limited period, with the last date for investing in these schemes being March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-rises-600-points-nifty-nears-22550-as-auto-and-metal-stocks-rally-2689848-2025-03-06",
      "headline": "Sensex rises 600 points, Nifty nears 22,550 as auto and metal stocks rallyThe S&P BSE Sensex gained 609.86 points to close at 74,340.09, while the NSE Nifty50 added 207.40 points to end at 22,544.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/britannia-industries-ceo-and-executive-director-rajneet-singh-kohli-resigns-2689836-2025-03-06",
      "headline": "Britannia Industries CEO Rajneet Singh Kohli resignsKohli submitted his resignation on March 5, 2025, and the Board of Directors has taken note of it through a circular resolution passed on March 6, 2025. He will be relieved from his duties at the close of business hours on March 14, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/you-do-not-need-employer-permission-for-these-epf-account-changes-name-date-of-birth-nationality-2689806-2025-03-06",
      "headline": "You don't need employer's permission for these EPF account changesIf your UAN is already linked to Aadhaar, you can update personal details like name, date of birth, gender, nationality, parents' names, marital status, spouse's name, date of joining, and date of leaving, all without submitting any documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-recovers-500-points-why-is-stock-market-gaining-despite-early-losses-auto-fmcg-banking-2689816-2025-03-06",
      "headline": "Sensex gains 600 points: Why is stock market rising despite early losses?Stock market gains: The S&P BSE Sensex was up 475.17 points to 74,205.40, while the NSE Nifty50 added 171.30 points to 22,508.60 as of 2:20 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-mandates-10-day-office-attendance-track-compliance-report-2689796-2025-03-06",
      "headline": "Infosys mandates 10-day office attendance, to track compliance: ReportInfosys has informed its technology workforce that a new system will track attendance and limit the number of work-from-home (WFH) days they can apply for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indian-jewellery-exporters-worried-over-us-reciprocal-tariffs-2689741-2025-03-06",
      "headline": "Indian jewellers worry as Trump's reciprocal tariffs spark job loss fears: ReportKey Indian exports to the US include cut and polished diamonds, studded gold jewellery, plain gold jewellery, lab-grown diamonds, and silver jewellery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rally-for-second-straight-day-is-dalal-street-gearing-up-for-a-strong-bull-run-2689764-2025-03-06",
      "headline": "Sensex, Nifty rally for 2nd straight day: Is D-Street ready for a bull run?The two-day recovery rally on Dalal Street, though encouraging, comes amid global uncertainty, particularly concerns over a possible trade war. While some experts remain cautious about calling this a full-fledged market recovery, they acknowledge that conditions are improving for a potential uptrend."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-sings-senorita-on-mumbai-street-ahead-of-lollapalooza-india-2025-2690957-2025-03-08",
      "headline": "Viral: Shawn Mendes sings Senorita on Mumbai street ahead of concertCanadian singer Shawn Mendes, who is currently in India, performed his hit song Senorita on a Mumbai street on Saturday, much to the delight of his fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/zahan-kapoor-on-legacy-black-warrant-and-carving-his-own-path-watch-video-india-today-conclave-2025-2690902-2025-03-08",
      "headline": "Zahan Kapoor on legacy, Black Warrant, and carving his own path. Watch"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zahan-kapoor-black-warrant-kapoor-family-ranbir-kapoor-india-today-conclave-2690795-2025-03-08",
      "headline": "Zahan Kapoor reflects on celebrityhood, Kapoor legacy and Black Warrant's successActor Zahan Kapoor opened up about his career, his latest Netflix show, Black Warrant, his famous cousins, and more, at the India Today Conclave 2025 held in New Delhi on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mindy-kaling-reacts-to-criticism-of-meghan-markle-with-love-meghan-2690838-2025-03-08",
      "headline": "Mindy Kaling reacts to criticism of Meghan Markle's With Love, MeghanActor and creator Mindy Kaling has finally reacted to the criticism of Meghan Markle's lifestyle series, With Love, Meghan. The show premiered on Netflix on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-electric-state-review-russo-brothers-dystopian-film-sparks-and-fizzles-out-2690796-2025-03-08",
      "headline": "The Electric State review: Russo Brothers' dystopian film sparks and fizzles outReleased-Fri Mar 14, 2025The Netflix film, 'The Electric State' falls short of entertainment. The chemistry between Millie Bobbie Brown and Chris Pratt looks awkward, while the bots don't do enough to keep the excitement alive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-x-reviews-internet-shreds-ibrahim-ali-khan-khushi-kapoor-film-calls-it-trashy-2690816-2025-03-08",
      "headline": "Nadaaniyan X reviews: Internet shreds Ibrahim-Khushi's film, calls it trashyNadaaniyan, starring Ibrahim Ali Khan and Khushi Kapoor, debuts on Netflix to widespread criticism, with viewers and critics alike branding it 'unbearable' and 'trashy'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ruby-review-a-debut-album-thats-ambitious-polished-and-unapologetically-jennie-2690749-2025-03-08",
      "headline": "Ruby review: A debut album that's ambitious, polished, and unapologetically Jennie Blackpink's Jennie's debut solo album, Ruby, is a bold exploration of her musical identity, featuring 15 tracks that delve into themes of empowerment and self-discovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-with-love-meghan-renewed-for-season-2-amid-criticism-2690736-2025-03-08",
      "headline": "Meghan Markle's With Love, Meghan renewed for season 2 amid criticismThe Duchess of Sussex, Meghan Markle, has announced a second season of her Netflix series, With Love, Meghan. The show premiered on the OTT giant on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/armaan-malik-kritika-malik-son-zaid-diagnosed-with-rickets-dont-curse-children-payal-malik-2690728-2025-03-08",
      "headline": "BB OTT 3 fame Kritika-Armaan Malik's son Zaid diagnosed with ricketsBigg Boss OTT 3 fame Kritika Malik and husband Armaan Malik's son, Zaid has been diagnosed with rickets. The news was shared by Armaan's first wife, Payal Malik, in her latest vlog. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/neena-gupta-tvf-phulera-ka-panchayati-raj-exposes-proxy-politics-in-rural-india-2690697-2025-03-08",
      "headline": "Neena Gupta's 'Phulera Ka Panchayati Raj' exposes proxy politics in rural IndiaTVF's new series 'Phulera Ka Panchayati Raj' exposed the problem of proxy politics in rural India. In collaboration with the popular series, Panchayat, the series starring Neena Gupta, Faisal Malik, and others is currently trending at No 1 on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pritam-defends-blackpink-jennie-plagiarism-controversy-minor-similarities-statement-rocky-aur-rani-kii-prem-kahaani-alia-bhatt-2690676-2025-03-08",
      "headline": "Pritam defends Blackpink's Jennie amid plagiarism row: Minor similarities happenMusic composer Pritam recently shared a statement and defended Blackpink's Jennie amid plagiarism claims after her recently released teaser looked similar to Alia Bhatt's theme song from Rocky Aur Rani Kii Prem Kahaani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mobland-trailer-out-tom-hardy-pierce-brosnan-helen-mirren-guy-ritchie-jiohotstar-2690587-2025-03-07",
      "headline": "Mobland trailer: Tom Hardy, Pierce Brosnan headline Guy Ritchie's new crime showMobland, the much-awaited crime series by Guy Ritchie, is all set for its grand premiere on JioHotstar this March. Featuring stars like Tom Hardy and Helen Mirren, the show explores the dark world of international crime syndicates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/rishab-sharma-on-starting-his-own-clothing-brand-popularising-sitar-2690428-2025-03-07",
      "headline": "Rishab Sharma on popularising Sitar, starting his own clothing brandRenowned 26-year-old sitar player Rishab Rikhiram Sharma blends classical and modern music. Trained under Ravi Shankar, he performs globally, including at the White House. Known for his mehendi-adorned hands, he also creates music for mental health. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-rick-hoffman-entry-as-louis-litt-means-for-suits-la-2690452-2025-03-07",
      "headline": "What Rick Hoffman's entry as Louis Litt means for Suits LAActor Rick Hoffman will be reprising his iconic character, Louis Litt, from 'Suits', in one of the upcoming episodes of 'Suits LA'. The news comes days after the show received bad reviews for lacking excitement like the original one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/why-sitrarist-rishab-sharma-wears-mehndi-for-every-performance-india-today-conclave-2025-2690388-2025-03-07",
      "headline": "Why sitarist Rishab Sharma wears mehndi for every performanceSitarist Rishab Sharma embraces mehndi as part of his stage presence, blending tradition with innovation. The young sitarist shares how he enhances performance aesthetics while breaking stereotypes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sitarist-rishab-sharma-india-today-conclave-2025-mehendi-viral-white-house-performance-2690355-2025-03-07",
      "headline": "Sitarist Rishab Sharma: Said no to performing at White House initiallyRenowned sitarist and internet sensation Rishab Sharma opened up about performing at the White House, choosing the sitar over guitar, and more, during his appearance at India Today Conclave 2025 in New Delhi on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-shibani-akhtar-pulled-her-by-the-ear-dabba-cartel-india-today-conclave-2025-2690249-2025-03-07",
      "headline": "Shabana Azmi says Shibani Akhtar 'pulled her by the ear' to join Dabba CartelShabana Azmi revealed at the India Today Conclave 2025 that Shibani Akhtar \"pulled her by the ear\" to make her join Dabba Cartel. Shibani always envisioned her as part of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/shabana-azmi-on-dabba-cartel-rise-of-ott-and-feminism-in-cinema-watch-video-india-today-conclave-2025-2690292-2025-03-07",
      "headline": "Shabana Azmi on Dabba Cartel, rise of OTT, and feminism in cinema. VideoAt the India Today Conclave 2025, Shabana Azmi spoke about her role in Dabba Cartel, emphasising that 'power can be quiet'. Co-creator Shibani Akhtar revealed that the concept was built around the idea of a \"Shabana Azmi drug cartel\" from the outset. The series presents a compelling narrative of women coming together in solidarity within a crime drama, with Azmi's nuanced and quiet yet powerful performance serving as its anchor. Her portrayal marks a significant thematic shift in Indian storytelling. Jyotika also shared her experience and connection to her character, highlighting how the roles reflect real-life struggles faced by women, as well as themes of feminism and women's emancipation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jyotika-dabba-cartel-working-with-shabana-azmi-at-india-today-conclave-2025-2690319-2025-03-07",
      "headline": "Jyotika on working with Shabana Azmi in Dabba Cartel: She was a friend to usActor Jyotika was recently seen in the newly-released show Dabba Cartel. At India Today Conclave 2025, she spoke about her character in the crime drama, her camaraderie with Shabana Azmi and what drew her to Dabba Cartel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/shabana-azmi-jyotika-shibani-dandekar-open-up-about-making-dabba-cartel-2690307-2025-03-07",
      "headline": "Shabana Azmi, Jyotika and Shibani Dandekar open up about making Dabba Cartel. PicsDabba Cartel actors Shabana Azmi, Jyotika and creator Shibani Dandekar graced the India Today Conclave 2025 on Friday, where they shared their experience of creating the Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-sweet-dreams-sensuous-song-miguel-watch-video-2690277-2025-03-07",
      "headline": "BTS J-hope's Sweet Dreams is a sensuous song brought alive by Miguel's vocalsBTS member J-hope has released a new song called Sweet Dreams, which also features the American artiste Miguel. Check out the music video inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-review-gajraj-rao-renuka-shahane-prime-video-2690232-2025-03-07",
      "headline": "Dupahiya review: A wholesome watch for your next relaxed weekendReleased-Fri Mar 07, 2025Dupahiya review: This Prime Video series is a charming small-town comedy with endearing performances, witty dialogues, and social themes. While it drags at times, its humour and heart make it a delightful, easy watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/my-view/story/k-drama-star-lee-min-ho-overrated-when-the-stars-gossip-2690224-2025-03-07",
      "headline": "Unpopular opinion: Korean star Lee Min-ho is overratedSouth Korean star Lee Min-ho is a beloved actor. But he is certainly not the most talented or versatile artiste out there. Min-ho is currently seen in the show, When the Stars Gossip, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-review-ram-madhvani-jallianwala-bagh-massacre-sonyliv-2690223-2025-03-07",
      "headline": "The Waking of a Nation review: Ram Madhvani's sincere attempt leaves little impactReleased-Thu Mar 06, 2025The Waking of a Nation review: Director Ram Madhvani's show explores the Jallianwala Bagh Massacre over six episodes. The show is streaming on SonyLIV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-goes-shopping-in-mumbai-colaba-ahead-of-lollapalooza-2690168-2025-03-07",
      "headline": "Singer Shawn Mendes shops in Mumbai's Colaba, goes unnoticed by fansSinger Shawn Mendes has arrived in Mumbai to perform at the Lollapalooza. His casual shopping spree in a vest and flip-flops has caught fans' attention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/friends-actor-stephen-park-on-toxic-environment-on-friends-set-became-race-conscious-2689896-2025-03-06",
      "headline": "Friends actor recalls 'toxic environment' on set: I had become so race-consciousActor Stephen Park shared his negative experiences on the set of Friends, highlighting racial insensitivity. He recalled an incident involving an assistant director's offensive remarks towards fellow actor James Hong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ayesha-khan-bigg-boss-17-faints-shooting-video-goes-viral-2689854-2025-03-06",
      "headline": "BB 17's Ayesha Khan faints while shooting, video goes viralBigg Boss 17 fae Ayesha Khan fainted on the sets of her upcoming project. Reportedly, the incident took place on Kapil Sharma's Kis Kisko Pyaar Karun set. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/nora-fatehi-jason-durelo-teache-kelly-clarkson-snake-hook-step-watch-2689838-2025-03-06",
      "headline": "Nora Fatehi, Jason Durelo teach Kelly Clarkson Snake hook step. WatchKelly Clarkson welcomed Nora Fatehi and Jason Derulo on her talk show, where they showcased their latest hit, Snake, and even taught Kelly the hook step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lisa-kudrow-no-good-deed-netflix-ray-romano-2689833-2025-03-06",
      "headline": "Lisa Kudrow's No Good Deed: This dark comedy could have been darker and funnierLisa Kudrow and Ray Romano are beloved comedic actors. And they deserved better treatment than Netflix's No Good Deed, which is fine at best. The series is currently streaming on the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-review-you-are-neither-fancy-nor-rich-enough-for-markles-show-2689801-2025-03-06",
      "headline": "With Love, Meghan review: You are neither fancy nor rich enough for Markle's show Released-Wed Mar 05, 2025With Love, Meghan could have been a lovely show about cooking and lifestyle, but it becomes a window into Markle's pretentiousness. It can't do away with its elitism, the one thing that Markle stood against during her stint at the royal palace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-cancels-noah-centineo-led-the-recruit-after-2-seasons-2689740-2025-03-06",
      "headline": "Netflix cancels Noah Centineo-led The Recruit after 2 seasonsStreaming giant Netflix has cancelled actor Noah Centineo-starrer The Recruit after only two seasons. The news was recently confirmed by the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-review-charlie-cox-vincent-donofrio-jon-bernthal-jiohotstar-2689718-2025-03-06",
      "headline": "Daredevil Born Again review: An uneven but triumphant return of Hell's Kitchen's devilReleased-Wed Mar 05, 2025Matt Murdock is back as Hell's Kitchen's favourite vigilante in Marvel Studios' Daredevil Born Again. The show had its two-episode premiere on March 5 and can be streamed on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ali-fazal-rakht-brahmand-physical-training-learns-ancient-martial-arts-2689730-2025-03-06",
      "headline": "Ali Fazal trains 7 hours a day for Rakht Brahmand, learns ancient martial artsAli Fazal undergoes 7-hour daily training, learning martial arts and perfecting diction for Rakht Brahmand. He calls the process \"demanding but rewarding.\" The series also stars Samantha Ruth Prabhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/bigg-boss-17s-anurag-dobhal-gets-engaged-to-girlfriend-ritika-2689700-2025-03-06",
      "headline": "Bigg Boss 17's Anurag Dobhal gets engaged to girlfriend RitikaBigg Boss 17's Anurag Dobhal got engaged to his girlfriend Ritika Chauhan. The vlogger shared pictures on Instagram on March 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhavan-nayanthara-siddharth-netflix-film-test-to-premiere-on-april-4-2689695-2025-03-06",
      "headline": "Madhavan, Nayanthara, Siddharth's Netflix film Test to premiere on April 4Madhavan, Nayanthara, and Siddharth star in Test, a Tamil Netflix film exploring life's biggest challenges beyond cricket. Directed by S. Sashikanth, it will stream from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-breaks-down-remembering-singer-says-cannnot-fully-accept-2689598-2025-03-06",
      "headline": "Liam Payne's girlfriend breaks down remembering singer, says 'can't fully accept'One Direction singer Liam Payne's untimely demise has left his girlfriend Kate Cassidy grappling with grief. In a heartfelt interview, she talked about her struggles and healing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-parambrata-jokes-about-playing-a-cop-ahead-of-khakee-the-bengal-chapter-neeraj-pandey-2689496-2025-03-05",
      "headline": "Actor Parambrata jokes about playing a cop ahead of Khakee: The Bengal ChapterActor Parambrata Chattopadhyay recently joked about playing a police officer ahead of his Netflix series, Khakee: The Bengal Chapter. The actor even shared reasons behind nodding to feature in the political drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-trailer-out-neeraj-pandey-netflix-show-2689461-2025-03-05",
      "headline": "Khakee The Bengal Chapter trailer: Neeraj Pandey show dives into politics, crimeThe trailer for Khakee The Bengal Chapter was unveiled on March 5. The show promises a riveting series filled with action, drama, and political intrigue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-member-wonwoo-to-enlist-in-military-in-april-3-2689393-2025-03-05",
      "headline": "K-pop group SEVENTEEN member Wonwoo to enlist in military in AprilSEVENTEEN's Wonwoo is set to begin his mandatory military service in April, as confirmed by Pledis Entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-2025-shawn-mendes-louis-tomlinson-to-make-india-debut-2689363-2025-03-05",
      "headline": "Lollapalooza 2025: Shawn Mendes, Louis Tomlinson to make India debutLollapalooza India is making a grand return in 2025 at Mumbai's Mahalaxmi Racecourse. With an eclectic lineup featuring Green Day, Shawn Mendes, and more, this festival promises an unforgettable musical experience."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-uttar-pradesh-chief-minister-political-future-bjp-gorakhpur-delhi-2691019-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not a successor, just a Yogi: UP Chief Minister Adityanath on political futureIndia Today Conclave: Uttar Pradesh Chief Minister Yogi Adityanath spoke about his political future and expressed his wish to make his way to Gorakhpur eventually."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-dead-injured-kuki-members-clash-forces-kangpokpi-curfew-2690947-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 dead, 27 security personnel hurt in Manipur as Kukis clash with forces: SourcesThe clashes occurred as locals defied Union Home Minister Amit Shah's directive for the free movement of all vehicles across Manipur starting today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-group-vice-chairperson-kalli-purie-address-stage-aaj-tak-ai-popstars-aishan-ruh-2691000-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AI Popstars: Kalli Purie reveals India Today Group's big innovation at Conclave '25India Today Vice Chairperson Kalli Purie unveiled India's first AI-generated pop stars, Aishan and Ruh, at the India Today Conclave 2025, highlighting them as a fusion of technology, art, and entertainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihars-nalanda-was-oxford-cambridge-and-nasa-of-its-day-william-dalrymple-2690972-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar's Nalanda was Harvard, Oxbridge, Nasa of its day: William DalrympleIndia Today Conclave: Historian William Dalrymple spoke about the intellectual exchange of India with the rest of the world. He pointed out that at the heart of this was the Nalanda University in Bihar, which Dalrymple described as the \"Harvard, Oxbridge, Nasa of its day\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-2025/story/meet-aishan-and-ruh-india-today-group-unveils-ai-popstars-by-stage-aaj-tak-at-conclave-2025-2690880-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India Today Group unveils AI popstars by Stage Aaj Tak at Conclave 2025 At India Today Conclave 2025, the India Today Group's Stage Aaj Tak introduced two AI popstars — Aishan and Ruh — with an aim to blend technology and culture for times when AI is increasingly going to play a key role in our lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-chief-minister-yogi-adityanath-assembly-election-2027-bjp-up-assembly-india-today-conclave-2691027-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "80:20 battle: Yogi Adityanath predicts landslide win for BJP in 2027 UP pollsUttar Pradesh Chief Minister Yogi Adityanath, speaking at the India Today Conclave 2025, predicted an \"80:20 battle\" in the 2027 assembly elections, asserting that the BJP and its allies will secure over 80 per cent of the seats. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bmw-passenger-urinating-pune-junction-viral-video-one-detained-bhartiya-nyaya-sanhita-2690983-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man gets out of BMW, urinates at traffic stop in PuneOne person was detained after a viral video showed a youth urinating at a Pune traffic junction from a BMW. The main accused is absconding, and police suspect both were intoxicated.\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-conclave-2025-up-has-best-treatment-for-such-people-says-yogi-adityanth-on-those-idolising-aurangzeb-2691005-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No civilised Muslim names his son after Aurangzeb: Yogi AdityanathMaharashtra Samajwadi Party leader Abu Azmi stirred a row with his statement when he said that Aurangzeb was not cruel and was religiously tolerant, drawing flak from BJP and Yogi Adityanath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gene-hackman-lived-with-wife-corpse-for-a-week-2690917-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Gene Hackman lived with wife's corpse for a week, say officialsThe late Gene Hackman reportedly lived with his wife Betsy's dead body for a week, before he succumbed to heart disease. The medical officials have now disclosed why that was. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/israeli-tourist-homestay-owner-raped-in-karnataka-koppal-male-friend-drowned-body-found-case-2690696-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israeli tourist, homestay host raped in Hampi, male friend's body found in canalThree male companions, who were with the women, were assaulted and then thrown into a canal near Hampi in Karnataka. While two of them managed to come out of the waters, the body of another was recovered this morning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-stampede-priority-was-to-keep-crowd-of-8-crore-safe-yogi-adityanath-india-today-conclave-2690985-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumbh stampede unfortunate, focus was safety of 8 crore devotees: Yogi AdityanathAt the India Today Conclave, Uttar Pradesh Chief Minister Yogi Adityanath spoke in detail about the stampede that took place at the Kumbh on the day of Mauni Amavasya and the subsequent steps his government took to ensure the safety and security of cores of devotees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indias-ultra-rich-top-1-percent-seeking-new-homes-abroad-rishabh-shroff-explains-2690872-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why are the richest 1% leaving India? Law firm boss Rishabh Shroff explains Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, shared insights into the rising trend of high-net-worth individuals (HNWIs) acquiring foreign passports and moving their wealth abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shahid-kapoor-and-kareena-kapoor-hug-interact-at-iifa-event-video-2690820-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Geet and Aditya reunite: Kareena, Shahid Kapoor hug at IIFA event. WatchActors Shahid Kapoor and Kareena Kapoor were seen interacting with each other at IIFA Awards event ahead of the grand night. The two had famously shared screen space in the Imtiaz Ali directorial, Jab We Met. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/pfizer-covid-vaccine-rushed-to-market-led-to-reproductive-damages-dr-naomi-wolf-2690943-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pfizer Covid vaccine rushed to market, led to reproductive damages: Dr Naomi WolfWolf, who stated that she is not vaccinated against Covid-19, claimed that live birth rates have dropped by 13-20%, attributing the decline to adverse effects of the vaccines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/india-today-conclave-2025-nara-lokesh-spotlight-andhra-pradesh-from-it-to-ai-2690748-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana has Hyderabad, what do you have? Nara Lokesh's 'Deewar' style replySpeaking at the India Today Conclave, Andhra Pradesh IT and Human Resources Minister Minister Nara Lokesh said Chief Minister Chandrababu Naidu was the competitive advantage that their state had.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-world-championship-win-parents-india-today-conclave-2690846-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "D Gukesh on success, stability: Glad my parents don't have to worry about moneyWorld Champion D Gukesh dedicated his title win to his parents, saying that they don't have to think about money anymore. Gukesh's parents played a big role in shaping his career and his Championship win over Ding Liren. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/lalit-modi-acquires-vanuatu-citizenship-all-about-pacific-island-nation-2690875-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lalit Modi acquires Vanuatu citizenship: All about Pacific island nationVanuatu, a tropical paradise in the Pacific, has drawn global attention after former IPL chief Lalit Modi acquired its citizenship. The country is known for its Citizenship-by-Investment (CBI) program, often called the 'golden passport' scheme, which offers fast-track citizenship to foreign investors. Here's all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-458-07-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mrityunjay-mahakumbh-not-mrityu-kumbh-yogi-adityanath-india-today-conclave-2690978-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Critics said Mrityu Kumbh, devotees showed it's Mrityunjay Kumbh: Yogi AdityanathIndia Today Conclave: Yogi Adityanath said that the massive turnout of devotees at the Maha Kumbh silenced those who had made negative remarks about the religious gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/historian-william-dalrymple-ancient-trade-route-silk-road-history-marginalised-rome-trade-relations-2690963-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, not China, centre of ancient trade: William Dalrymple debunks popular historyIndia was the centre of ancient trade, not China, historian William Dalrymple said, debunking popular historical claims at the India Today Conclave."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-hands-over-command-of-space-station-to-russian-cosmonaut-2690910-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Homecoming soon: Sunita Williams hands over command of Space StationWilliams now turns her attention to her return to Earth with fellow crewmates Nick Hague and Butch Wilmore from Nasa and Roscosmos cosmonaut Aleksandr Gorbunov. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-new-tattoo-t20-world-cup-2026-india-today-conclave-2690952-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Win T20 World Cup 2026, get a new tattoo: Suryakumar Yadav reveals wife's challengeSurykumar Yadav revealed that his wife told him to get a new tattoo after doing something special in the T20 World Cup 2026. Suryakumar is the current T20I captain of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-final-shubman-gill-2690922-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma to retire after Champions Trophy? Here's what Shubman Gill saidIndia vice-captain Shubman Gill has reacted to Rohit Sharma's retirement rumours. At the pre-final press conference, Gill said that Rohit is yet to discuss his ODI retirement with the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/walter-andersen-american-author-rss-bp-relation-debate-global-outreach-india-today-conclave-2690942-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS encourages debate, but leadership's decision final: Author Walter AndersenIndia Today Conclave: American academic and author Walter K Andersen examines the evolution of the RSS, its ideological framework, and its relationship with the ruling BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-pic-ahead-of-iifa-event-fan-reactions-viral-2690964-2025-03-08",
      "headline": "SRK's pic ahead of IIFA event grabs fans' attention: Ageing like fine wineSuperstar Shah Rukh Khan is currently in Pink City Jaipur for the IIFA event. The actor looked dapper in his latest photo, which was shared by his manager, Pooja Dadlani, on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-sings-senorita-on-mumbai-street-ahead-of-lollapalooza-india-2025-2690957-2025-03-08",
      "headline": "Viral: Shawn Mendes sings Senorita on Mumbai street ahead of concertCanadian singer Shawn Mendes, who is currently in India, performed his hit song Senorita on a Mumbai street on Saturday, much to the delight of his fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gene-hackman-lived-with-wife-corpse-for-a-week-2690917-2025-03-08",
      "headline": "Actor Gene Hackman lived with wife's corpse for a week, say officialsThe late Gene Hackman reportedly lived with his wife Betsy's dead body for a week, before he succumbed to heart disease. The medical officials have now disclosed why that was. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/pics-zahan-kapoor-on-surname-theatre-background-and-grandfather-shashi-kapoor-india-today-conclave-2025-2690898-2025-03-08",
      "headline": "Zahan Kapoor on his surname, theatre background, and grandfather Shashi Kapoor. PicsZahan Kapoor, on day two of India Today Conclave 2025, reflected on the weight of his surname, his deep-rooted connection to theatre, and the lasting legacy of his grandfather, Shashi Kapoor."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rcb-knocked-out-of-wpl-2025-up-warriorz-vs-royal-challengers-bengaluru-2691029-2025-03-08",
      "headline": "WPL: Royal Challengers Bengaluru face early exit after 12-run loss vs UP WarriorzRoyal Challengers Bengaluru got knocked out of the Women's Premier League 2025 following their 12-run loss against UP Warriorz in Match 18. RCB are languishing on the last spot on the points table with two wins from seven matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-mitchell-santner-varun-chakravarthy-virat-kohli-2691015-2025-03-08",
      "headline": "IND vs NZ: Mitchell Santner wary of Virat, Varun threat before finalNew Zealand captain Mitchell Santner is wary of the threat opposition spinner Varun Chakravarthy possesses in the final of the Champions Trophy. Santner confirmed that the team would be watching the replays very closely before the summit clash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-suryakumar-yadav-jokes-about-heated-face-off-with-virat-kohli-from-ipl-2020-2691009-2025-03-08",
      "headline": "Suryakumar Yadav jokes about heated face-off with Virat Kohli from IPL 2020Star India batter Suryakumar Yadav recalled his heated face-off with Virat Kohli from the Indian Premier League 2020. Suryakumar played a match-winning innings of 79* (43) for Mumbai Indians (MI) against Royal Challengers Bengaluru (RCB) during Match 48 of the season and even had a heated moment with Kohli during his innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-mitchell-santner-ind-vs-nz-final-india-vs-new-zealand-final-2691007-2025-03-08",
      "headline": "Mitchell Santner ready for an all-out spin battle to become 3rd time lucky vs IndiaNew Zealand captain Mitchell Santner is ready for the spin challenge against India in the all-important final of the ICC Champions Trophy 2025 on Sunday, March 9. The Kiwi skipper is expecting to be third time lucky against India in an ICC event final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wpl-2025-rcb-vs-upw-georgia-voll-2691003-2025-03-08",
      "headline": "RCB vs UPW: Georgia Voll equals record as Warriorz hit highest total in WPL historyUP Warriorz's Georgia Voll put in an incredible show to equal the best-ever individual score in the WPL history. Voll's exceptional show of batting helped UPW register the biggest total in the competition's history.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-final-predicted-playing-xi-matt-henry-india-vs-new-zealand-2690995-2025-03-08",
      "headline": "IND vs NZ final predicted XIs: Will four spinners script another ICC triumph?India and New Zealand are set to lock horns in the final of the ICC Champions Trophy 2025. The two teams will have a lot to ponder about before finalising their Playing XI for the all-important clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-ajit-agarkar-2690981-2025-03-08",
      "headline": "Ajit Agarkar to discuss Rohit Sharma's future after Champions Trophy finalChief selector Ajit Agarkar is set to meet India captain Rohit Sharma after the conclusion of the Champions Trophy.  According to sources privy to the matter, they are going to discuss Rohit's future in the ODI team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-t20-world-cup-victory-broke-the-jinx-were-now-hungry-to-win-more-shubman-gill-2690979-2025-03-08",
      "headline": "T20 World Cup victory broke the jinx, we're now hungry to win more: Shubman GillIndia vice captain Shubman Gill said that the T20 World Cup 2024 victory broke the knockout jinx of the team, and they are now they're hungry to add more titles to their cabinet. India are set to lock horns in the final of the ICC Champions Trophy 2025 against New Zealand on Sunday, March 9 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-suryakumar-yadav-on-t20-world-cup-catch-2690967-2025-03-08",
      "headline": "I watch my T20 World Cup 2024 final catch every day: Suryakumar YadavIndia's T20I captain Suryakumar Yadav revealed that he watches his T20 World Cup catch every day. Suryakumar Yadav took a sensational catch at long off in the final to help India beat South Africa and clinch their second T20 World Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-corbin-bosch-peshawar-zalmi-psl-2690960-2025-03-08",
      "headline": "IPL or PSL? Mumbai Indians new man Corbin Bosch signs up for both leaguesMumbai Indians' new man Corbin Bosch finds himself in a tricky spot as the South African all-rounder has signed up for the IPL 2025 and PSL 2025. Bosch came in as a replacement signing for MI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-new-tattoo-t20-world-cup-2026-india-today-conclave-2690952-2025-03-08",
      "headline": "Win T20 World Cup 2026, get a new tattoo: Suryakumar Yadav reveals wife's challengeSurykumar Yadav revealed that his wife told him to get a new tattoo after doing something special in the T20 World Cup 2026. Suryakumar is the current T20I captain of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-ajit-agarkar-2690981-2025-03-08",
      "headline": "Ajit Agarkar to discuss Rohit Sharma's future after Champions Trophy finalChief selector Ajit Agarkar is set to meet India captain Rohit Sharma after the conclusion of the Champions Trophy.  According to sources privy to the matter, they are going to discuss Rohit's future in the ODI team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-t20-world-cup-victory-broke-the-jinx-were-now-hungry-to-win-more-shubman-gill-2690979-2025-03-08",
      "headline": "T20 World Cup victory broke the jinx, we're now hungry to win more: Shubman GillIndia vice captain Shubman Gill said that the T20 World Cup 2024 victory broke the knockout jinx of the team, and they are now they're hungry to add more titles to their cabinet. India are set to lock horns in the final of the ICC Champions Trophy 2025 against New Zealand on Sunday, March 9 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-suryakumar-yadav-on-t20-world-cup-catch-2690967-2025-03-08",
      "headline": "I watch my T20 World Cup 2024 final catch every day: Suryakumar YadavIndia's T20I captain Suryakumar Yadav revealed that he watches his T20 World Cup catch every day. Suryakumar Yadav took a sensational catch at long off in the final to help India beat South Africa and clinch their second T20 World Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-corbin-bosch-peshawar-zalmi-psl-2690960-2025-03-08",
      "headline": "IPL or PSL? Mumbai Indians new man Corbin Bosch signs up for both leaguesMumbai Indians' new man Corbin Bosch finds himself in a tricky spot as the South African all-rounder has signed up for the IPL 2025 and PSL 2025. Bosch came in as a replacement signing for MI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-new-tattoo-t20-world-cup-2026-india-today-conclave-2690952-2025-03-08",
      "headline": "Win T20 World Cup 2026, get a new tattoo: Suryakumar Yadav reveals wife's challengeSurykumar Yadav revealed that his wife told him to get a new tattoo after doing something special in the T20 World Cup 2026. Suryakumar is the current T20I captain of the Indian team. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}