{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonarika-bhadoria-husband-vikas-parashar-announce-pegnancy-first-child-2787063-2025-09-14",
      "headline": "Devon Ke Dev... actor Sonarika Bhadoria, husband Vikas Parashar announce pregnancyTelevision actor Sonarika Bhadoria is expecting her first child with husband Vikas Parashar. The couple announced the news in a special social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-teja-sajja-film-sees-growth-inches-close-to-rs-30-crore-2787050-2025-09-14",
      "headline": "Mirai box office Day 2: Teja Sajja film sees growth, inches close to Rs 30 croreActor Teja Sajja's film 'Mirai' roared at the box office. After witnessing a phenomenal opening, the film refused to slow down in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-praises-15-old-singer-jonas-conner-urges-not-to-exploit-similar-indian-talent-2787042-2025-09-14",
      "headline": "Salman Khan praises 15-year-old singer, urges not to exploit similar Indian talentSalman Khan is in awe of 15-year-old singer Jonas Conner. In a heartfelt social media post, the superstar praised the youngster and requested people to encourage and not exploit similar talents in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-mk-stalin-honour-ilaiyaraaja-in-grand-ceremony-call-for-bharat-ratna-2787019-2025-09-14",
      "headline": "Rajinikanth, Stalin honour Ilaiyaraaja in grand ceremony, call for Bharat RatnaRajinikanth, Tamil Nadu chief minister MK Stalin, and Kamal Haasan, among others, honoured Ilaiyaraaja at a grand event in Chennai. They urged the government to honour the maestro with Bharat Ratna."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-to-release-in-india-government-fact-checks-reports-2787008-2025-09-14",
      "headline": "Fawad Khan's Abir Gulaal to release in India? Government fact checks reportsAmid several reports confirming Fawad Khan and Vaani Kapoor's 'Abir Gulaal' India release, the government fact-checked the reports and called it fake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-enjoy-romantic-drive-in-hummer-viral-pics-2786988-2025-09-14",
      "headline": "Ranveer Singh-Deepika Padukone enjoy romantic drive in new Hummer, pics go viralRanveer Singh and Deepika Padukone were recently seen taking a drive in their luxury electric car. A video from their outing has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-season-9-vijay-sethupathi-host-october-5-premiere-2786894-2025-09-13",
      "headline": "Bigg Boss Tamil 9 to premiere soon, Vijay Sethupathi's show gets launch date'Bigg Boss Tamil' Season 9 will begin in October, with Vijay Sethupathi resuming hosting duties. The official channel has released a new poster announcing the premiere date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zayed-khan-backs-india-unbeatable-ahead-asia-cup-2025-match-pakistan-2786871-2025-09-13",
      "headline": "Zayed Khan backs India as unbeatable ahead of Asia Cup 2025 clash with PakistanActor Zayed Khan voiced his support for India ahead of the Asia Cup 2025, calling the team unbeatable and highlighting the value of India-Pakistan clashes in fostering sportsmanship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-husband-vicky-jain-injured-accident-gets-45-stitches-2786847-2025-09-13",
      "headline": "Ankita Lokhande's husband Vicky Jain injured in accident, gets 45 stitchesActor Ankita Lokhande's husband Vicky Jain was hospitalised after a glass injury left him with 45 stitches. Ankita stayed by his side as he recovered in Mumbai.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karishma-sharma-recounts-train-mishap-after-discharge-2786830-2025-09-13",
      "headline": "Actor Karishma Sharma recounts train mishap after dischargeActor Karishma Sharma recalled her traumatic Mumbai train accident, shared a health update, and urged commuters to stay calm and avoid panic.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-film-release-26-september-2025-neeraj-ghaywan-ishaan-khatter-janhvi-kapoor-vishal-jethwa-karan-johar-2786776-2025-09-13",
      "headline": "Homebound: Janhvi Kapoor, Ishaan Khatter and Vishal's film gets global release dateAfter winning appreciation and standing ovations at various International film festivals, Karan Johar's 'Homebound' is set for a theatrical release. The movie stars Janhvi Kapoor, Vishal Jethwa, and Ishaan Khatter in key roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-father-defends-jagdish-patani-firing-bareilly-home-khushboo-remarks-premanand-maharaj-2786784-2025-09-13",
      "headline": "After firing at home, Disha Patani's father defends Khushboo's remarks on saintDisha Patani's father, Jagdish Patani, recently spoke about the firing incident at his Bareilly home. He even defended his daughter, Khusboo's remarks, which were connected to spiritual leader Premanand Ji Maharaj."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/requiem-for-hate-economy-box-office-bombing-of-the-bengal-files-tells-us-vivek-agnihotri-udaipur-files-2786741-2025-09-13",
      "headline": "Requiem for hate economy? What the box office bombing of Bengal Files tells usPropaganda-driven \"files\" franchise has hit a wall. With Bengal and Udaipur both flopping spectacularly, India's audience seems done subsidising the hate economy wrapped as cinematic history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-supports-anurag-kashyap-nishaanchi-before-release-poster-vedika-pinto-sonakshi-sinha-2786720-2025-09-13",
      "headline": "Salman Khan supports Anurag Kashyap's Nishaanchi before release, praises posterSalman Khan recently extended his luck to Anurag Kashyap's upcoming film 'Nishaanchi'. He shared a video along with a heartfelt note for the entire team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-20-farah-khan-schools-kunickaa-sadanand-baseer-ali-weekend-ka-vaar-salman-khan-2786701-2025-09-13",
      "headline": "Bigg Boss 19 episode 20: Farah Khan schools Kunickaa, Baseer in fiery exchangeFilmmaker-producer Farah Khan took Kunickaa Sadanand to task for taking puris off Zeeshan Quadri's plate, and also pulled up Baseer Ali for questioning the calibre of the housemates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-software-engineer-delhi-fails-answer-rs-50-lakh-question-can-you-2786686-2025-09-13",
      "headline": "KBC 17: Software engineer from Delhi fails to answer Rs 50 lakh question. Can you?In the latest episode of 'Bigg Boss 17', a software engineer from Delhi failed to answer a Rs 50 lakh question on Emerald Capital. Would you like to take your chance? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-punjab-to-goa-how-bollywood-keeps-recycling-state-stereotypes-param-sundari-2786548-2025-09-13",
      "headline": "From Punjab to Kerala, how Bollywood keeps recycling state stereotypesBollywood reduces India's states to punchlines, mustard fields, paan stains, lungi dances. In this week's Cinematic Saturday, we will discuss why audiences deserve better representation on screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-day-1-teja-sajja-film-opens-strong-beats-hanuman-record-2786658-2025-09-13",
      "headline": "Mirai box office Day 1: Teja Sajja's film opens strong, beats HanuMan recordTeja Sajja's 'Mirai' made a strong debut on September 12, 2025. The film earned Rs 12 crore on its first day across all languages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhruv-rathee-criticises-vivek-agnihotri-screening-adult-rated-bengal-files-children-2786631-2025-09-13",
      "headline": "Dhruv Rathee criticises Vivek Agnihotri for showing The Bengal Files to childrenYouTuber Dhruv Rathee calls out filmmaker Vivek Agnihotri for showing the A-rated film The Bengal Files to children, raising concerns about exposure to violent content."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-preview-dubai-pitch-predicted-xis-2786977-2025-09-14",
      "headline": "Lopsided battle, heightened tensions: India, Pakistan set to reignite rivalrySuper Sunday brings more than a cricket match: it's India vs Pakistan, a clash steeped in history, rivalry, and the pressure of politics and form. Here's your complete match preview: conditions, analysis, and predicted line-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-prime-minister-narendra-modi-spared-china-xi-jinping-the-new-villain-in-donald-trumps-latest-tariff-post-2786985-2025-09-14",
      "headline": "India spared, China the new villain in Trump's latest tariff postAfter months of berating India as Moscow's enabler, Donald Trump has found a bigger villain in Beijing. In shifting his fury eastward, he spares New Delhi – but only to keep it from slipping deeper into Russia's embrace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/anti-immigration-protest-london-150000-rally-tommy-robinson-elon-musk-keir-starmer-2787020-2025-09-14",
      "headline": "Give our country back: How anti-immigration tsunami swept LondonOver 150,000 people joined far-right activist Tommy Robinson's anti-immigration rally in central London, promoting nationalist slogans, \"great replacement\" rhetoric, and opposition to migration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/noida/story/greater-noida-tragedy-mother-son-jump-13th-floor-ace-city-suicide-note-2787074-2025-09-14",
      "headline": "Don't want to trouble you: Woman, special needs son jump off 13th floor in NoidaA 37-year-old woman, Sakshi Chawla, and her specially-abled 11-year-old son Daksh died by suicide after jumping from the 13th floor of a building in Greater Noida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/youth-lead-movements-jp-movement-to-nepal-gen-z-bangladesh-protests-rebel-instagram-reels-tiktok-videos-2786897-2025-09-14",
      "headline": "Why there's rebellion in Gen Z DNAThat Gen Z protesters toppled the Oli government in Nepal shouldn't be surprising. From Bhagat Singh to Che Guevara, the face of rebellions has almost always been the young. But why do the young rebel, and what is it that drives them to the streets?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/london-anti-immigration-rally-elon-musk-warns-britain-destruction-immigration-violence-political-change-2786978-2025-09-14",
      "headline": "Violence is coming: Elon Musk's fightback call at London anti-immigration rallyElon Musk, addressing a far-right anti-immigration rally in London, warned that \"violence is coming\" if uncontrolled migration continues, and called for a regime change in the UK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/new-nepal-pm-sushila-karki-first-address-gen-z-protests-martyrs-economy-parliament-power-handover-2787049-2025-09-14",
      "headline": "Those killed in Gen Z protests to be declared martyrs: New Nepal PM's 1st addressNew Nepal Prime Minister Sushila Karki, vowing to serve only as a six-month caretaker after the Gen Z-led ouster of KP Sharma Oli, called for unity to rebuild the financially strained nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-on-india-pak-match-money-more-important-than-lives-of-26-people-2787017-2025-09-14",
      "headline": "India-Pak match ad revenue price of 26 lives? Asaduddin Owaisi taunts BJPThe India-Pakistan Asia Cup showdown is no longer just about cricket – it has become a lightning rod for grief, nationalism, and political one-upmanship, with leaders from Asaduddin Owaisi to Arvind Kejriwal and Uddhav Thackeray demanding answers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-2-indian-athletes-kushare-high-jump-gulveer-singh-10k-final-2787035-2025-09-14",
      "headline": "World Championship: Men's 100m takes centre stage, India's Gulveer in actionThe World Athletics Championships is set for its showpiece event – the men's 100m final. The top names of the current generation are participating, and it is expected to be a riveting encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/interviews/story/zorawar-kalra-interview-anything-but-father-jiggs-kalra-parenting-food-family-2787009-2025-09-14",
      "headline": "Like father, unlike father: Zorawar Kalra on family, food, and fatherhood his wayWe convince restaurateur Zorawar Kalra to take a rare pause from work to talk about marriage, growing up under his legendary father Jiggs Kalra, parenting, food at home, and fitness... basically, Anything But work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flight-makes-emergency-landing-in-lucknow-mp-dimple-yadav-among-151-on-board-all-safe-2787034-2025-09-14",
      "headline": "IndiGo pilot slams brakes right before takeoff in Lucknow; 151 passengers safeAn IndiGo flight from Lucknow to Delhi, carrying 151 passengers, including Samajwadi Party MP Dimple Yadav, aborted takeoff after failing to lift off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-you-can-easily-buy-a-gun-in-the-us-and-why-you-cant-in-india-2787016-2025-09-14",
      "headline": "Why you can easily buy a gun in the US and why you can't in IndiaBoth owe their origin to the British colonisers, but in different ways. While America enshrined the right to bear arms in its Constitution, India inherited strict gun control from colonial-era laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-cricket-rivalry-boosts-pakistan-tissue-industry-economy-2786984-2025-09-14",
      "headline": "Cancel it? No. Pakistan needs cricket beatings from IndiaIndia vs Pakistan isn't just cricket—it's humiliation as public service, therapy via sixes, and a spectacle where one side brings tears, the other brings tissues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-is-tommy-robinson-far-right-activist-behind-londons-massive-rally-glbs-2786960-2025-09-14",
      "headline": "Who is Tommy Robinson? Far-right activist behind London anti-immigration rallyOver 100,000 joined Tommy Robinson's Unite the Kingdom rally in London, one of the UK's largest right-wing protests, with police reporting scuffles, assaults and counter-demonstrations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-pakistan-copy-india-spin-playbook-dubai-clash-2787027-2025-09-14",
      "headline": "Asia Cup 2025: Pakistan flips through India's spin playbook ahead of Dubai clashAsia Cup 2025: Pakistan appear to be following India's spin-heavy blueprint, with both teams' star spinners set to play a key role in what promises to be a high-stakes, spin-dominated encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-hits-back-at-trump-100-per-cent-tariff-call-india-sanctions-russia-ukraine-war-2786934-2025-09-13",
      "headline": "China hits back at Trump's 100% tariff call, says it doesn't plot or join warsChina's dig at the US came just hours after President Donald Trump urged Nato members to halt Russian oil purchases and impose sanctions of up to 100 per cent on China, one of Moscow's biggest buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/noida-family-spends-36-hours-in-panic-as-cobra-hides-inside-ceiling-light-viral-video-2787040-2025-09-14",
      "headline": "Noida family spends 36 hours in panic as cobra hides inside ceiling light. Video viralA Noida family endured 36 hours of fear after a cobra coiled itself inside their kitchen ceiling light. The reptile was finally rescued and released at the Okhla Bird Sanctuary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-522-12-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepals-interim-pm-sushila-karki-takes-charge-cabinet-expansion-likely-today-2787037-2025-09-14",
      "headline": "India-Nepal border reopens as Sushila Karki takes charge after days of violenceSushila Karki arrived at her new office at 11 am, taking charge in the building of the Home Ministry, which has been designated as the Prime Minister's office."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-to-release-in-india-government-fact-checks-reports-2787008-2025-09-14",
      "headline": "Fawad Khan's Abir Gulaal to release in India? Government fact checks reportsAmid several reports confirming Fawad Khan and Vaani Kapoor's 'Abir Gulaal' India release, the government fact-checked the reports and called it fake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-are-india-playing-pakistan-in-asia-cup-2786973-2025-09-14",
      "headline": "Profit vs patriotism: Why are India playing Pakistan in Asia Cup?Asia Cup 2025: The Indian government has allowed the India vs Pakistan clash to go ahead despite the aftermath of the Pahalgam terror attack. Yet for families who lost loved ones in Pahalgam, for soldiers on the border, cricket between the two arch-rivals falls beyond any iota of logic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rjd-to-contest-all-243-seats-in-bihar-assembly-polls-tejashwi-yadav-amid-mahagathbandhan-seat-sharing-deadlock-watch-video-2786987-2025-09-14",
      "headline": "RJD to contest all 243 seats: Tejashwi Yadav amid Bihar Mahagathbandhan deadlockRJD leader Tejashwi Prasad Yadav has said that he intends to contest all 243 assembly seats in the upcoming Bihar elections. This declaration sharpens the ongoing seat-sharing impasse within the Mahagathbandhan, and could raise serious tensions with his alliance partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-silver-tsunami-how-india-can-support-its-seniors-as-60-plus-population-soars-2786391-2025-09-14",
      "headline": "The Silver Tsunami: How India can support its seniors as 60-plus population soarsIndia is approaching a demographic shift with over 300 million seniors by 2050. This surge demands urgent improvements in elder care, technology use, and financial planning to ensure dignity and support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-kuldeep-yadav-fakhar-zaman-spin-struggles-2787071-2025-09-14",
      "headline": "Facing Kuldeep Yadav, you'll feel the heat: Uthappa on Fakhar Zaman's spin strugglesFormer India cricketer Robin Uthappa predicts Pakistan's Fakhar Zaman will struggle against Kuldeep Yadav's spin in Asia Cup 2025. This battle could prove decisive in the high-stakes India-Pakistan group match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shubman-gill-virat-kohli-ind-vs-pak-dubai-2787018-2025-09-14",
      "headline": "Asia Cup: With King Kohli absent, Prince Gill must rise to the occasion vs PakistanWith Virat Kohli absent from the Asia Cup 2025, Shubman Gill faces his first T20I test against Pakistan. As vice-captain, his form and temperament could shape India's chances in the high-voltage Dubai showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-poor-form-ind-vs-pak-2786955-2025-09-14",
      "headline": "Birthday battle for Suryakumar Yadav: Can India skipper rise against Pakistan?Asia Cup 2025: Suryakumar Yadav will enter India's much-awaited clash against Pakistan with a forgettable record against the arch-rivals. Will the India captain rise to the occasion in the biggest match of his captaincy tenure so far on his birthday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-hype-viewership-number-surprise-2787047-2025-09-14",
      "headline": "India vs Pakistan: A cricketing mismatch, but one Asia Cup number could shock us allIndia might dominate on the field, Pakistan might struggle to keep up, but in the aftermath of the Pahalgam terror attack and Operation Sindoor, the real uncertainty of this Asia Cup isn't the scoreline. It could be the numbers off the screens—how many actually tune in to watch the rivalry unfold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hong-kong-open-final-livestreaming-satwiksairaj-chirag-lakshya-sen-2787046-2025-09-14",
      "headline": "Hong Kong Open: Livestreaming details for Satwik-Chirag and Lakshya Sen's finalIndia's top badminton players Satwiksairaj Rankireddy–Chirag Shetty and Lakshya Sen have reached the finals at the Hong Kong Open. Here's where and when you can watch them play their summit clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-livestreaming-pitch-report-probable-11-match-details-2787043-2025-09-14",
      "headline": "IND vs PAK, Asia Cup 2025: Live streaming, where to watch, start time and moreAsia Cup 2025: India and Pakistan renew their fierce rivalry in Sunday's Asia Cup clash. With India looking dominant and Pakistan eyeing an upset, the high-stakes Group A encounter promises fireworks on and off the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-2-indian-athletes-kushare-high-jump-gulveer-singh-10k-final-2787035-2025-09-14",
      "headline": "World Championship: Men's 100m takes centre stage, India's Gulveer in actionThe World Athletics Championships is set for its showpiece event – the men's 100m final. The top names of the current generation are participating, and it is expected to be a riveting encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-pakistan-copy-india-spin-playbook-dubai-clash-2787027-2025-09-14",
      "headline": "Asia Cup 2025: Pakistan flips through India's spin playbook ahead of Dubai clashAsia Cup 2025: Pakistan appear to be following India's spin-heavy blueprint, with both teams' star spinners set to play a key role in what promises to be a high-stakes, spin-dominated encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-ashwin-will-arshdeep-singh-play-2787022-2025-09-14",
      "headline": "Arshdeep Singh snub should make bowlers angry: R AshwinIndia's top fast bowler Arshdeep Singh did not play the team's Asia Cup opener vs UAE. It is likely that he sits out the match vs Pakistan as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-livestreaming-pitch-report-probable-11-match-details-2787043-2025-09-14",
      "headline": "IND vs PAK, Asia Cup 2025: Live streaming, where to watch, start time and moreAsia Cup 2025: India and Pakistan renew their fierce rivalry in Sunday's Asia Cup clash. With India looking dominant and Pakistan eyeing an upset, the high-stakes Group A encounter promises fireworks on and off the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-2-indian-athletes-kushare-high-jump-gulveer-singh-10k-final-2787035-2025-09-14",
      "headline": "World Championship: Men's 100m takes centre stage, India's Gulveer in actionThe World Athletics Championships is set for its showpiece event – the men's 100m final. The top names of the current generation are participating, and it is expected to be a riveting encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-pakistan-copy-india-spin-playbook-dubai-clash-2787027-2025-09-14",
      "headline": "Asia Cup 2025: Pakistan flips through India's spin playbook ahead of Dubai clashAsia Cup 2025: Pakistan appear to be following India's spin-heavy blueprint, with both teams' star spinners set to play a key role in what promises to be a high-stakes, spin-dominated encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-ashwin-will-arshdeep-singh-play-2787022-2025-09-14",
      "headline": "Arshdeep Singh snub should make bowlers angry: R AshwinIndia's top fast bowler Arshdeep Singh did not play the team's Asia Cup opener vs UAE. It is likely that he sits out the match vs Pakistan as well."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}