{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-world-richest-larry-elisson-oracle-open-ai-partnership-2785501-2025-09-11",
      "headline": "World's richest race: Elon Musk reclaims No.1 spot from Larry EllisonElon Musk has largely remained at the top of the global wealth chart since first claiming the position in 2021. Though he was overtaken briefly by LVMH's Bernard Arnault in 2021 and by Amazon founder Jeff Bezos in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-above-24950-eternal-adani-ports-among-top-gainers-2785464-2025-09-11",
      "headline": "Sensex, Nifty gain after flat opening amid US rate cut optimismThe S&P BSE Sensex gained over 100 points after a flat start, while the NSE Nifty50 briefly crossed the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-dev-accelerator-shringar-house-of-mangalsutra-ipo-subscription-profit-gmp-today-2785445-2025-09-11",
      "headline": "3 IPOs in focus: Urban Company leads, but where's the bigger listing gain?Urban Company's was fully subscribed within a few hours, indicating high demand. Alongside Urban Company, two other IPOs, Dev Accelerator and Shringar House of Mangalsutra, are also open for bidding this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-larry-ellison-surpasses-elon-musk-to-become-worlds-richest-person-2785281-2025-09-10",
      "headline": "Oracle's Larry Ellison surpasses Elon Musk to become world's richest personEllison's net worth jumped by an unprecedented $101 billion in a single day after Oracle Corp. delivered blowout quarterly results, sparking a record surge in its stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-20s-to-retirement-how-bonds-strengthen-your-finances-2785155-2025-09-10",
      "headline": "From 20s to retirement: How bonds strengthen your financesBonds don't grab headlines like stocks, but they quietly strengthen your finances across life stages. From building discipline in your 20s to ensuring stability in retirement, they remain a steady anchor for wealth creation. Here's how they work for you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-crypto-regulation-document-government-no-plans-legal-report-2785132-2025-09-10",
      "headline": "Document shows India resisting complete crypto regulation: ReportWhile some countries like Japan and Australia are developing frameworks to regulate digital assets carefully, India remains cautious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-extend-gains-on-us-trade-deal-hopes-and-fed-cut-buzz-2785124-2025-09-10",
      "headline": "Sensex, Nifty extend gains on US trade deal hopes and Fed rate cut buzzThe NSE Nifty 50 climbed 104.50 points to close at 24,973.10, while the BSE Sensex added 323.83 points, ending at 81,425.15. The Nifty has now gained for six straight sessions, with the Sensex rising in five of the last six trading days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/festive-season-stocks-that-you-should-add-to-your-portfolio-mahindra-nykaa-swiggy-maruti-dixon-2785106-2025-09-10",
      "headline": "Festive season stocks that you should add to your portfolioWith people ready to spend on home appliances, beauty products, lifestyle goods, and automobiles, investors are now looking for stocks that could benefit from this surge in demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-credit-score-falling-here-is-how-to-fix-it-2785104-2025-09-10",
      "headline": "Is your credit score falling? Here's how to fix itHas your credit score recently taken a hit? You're not alone. Many people discover a drop only when applying for a loan or credit card. The good news is, most reasons are easy to fix with a few smart steps."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saiyaara-ott-release-confirmed-ahaan-panday-aneet-padda-love-story-stream-netflix-2785550-2025-09-11",
      "headline": "Saiyaara OTT release confirmed: Ahaan-Aneet's love story to stream on NetflixThe cat is out of the box, and the moment is here that some of us have been waiting for. Mohit Suri's 'Saiyaara' is ready to stream on OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-dismisses-social-media-ban-fears-india-nepal-protests-2785521-2025-09-11",
      "headline": "Ram Gopal Varma rejects social media ban fears in IndiaRam Gopal Varma asserts that a social media ban like Nepal's is improbable in India. He cites government hesitance as a major deterrent against such actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kishwer-merchant-calls-bigg-boss-19-boring-fans-react-2785488-2025-09-11",
      "headline": "Kishwer Merchant calls Bigg Boss 19 boring, fans hit backKishwer Merchant has called Bigg Boss 19 boring, sparking a fierce debate among fans who defend the current season as better than her own. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-greets-bows-elderly-fan-us-concert-dedicates-saturday-saturday-chilvary-fans-praise-viral-video-2785490-2025-09-11",
      "headline": "Badshah wins hearts after bowing to elderly fan, dedicating song at US concertSinger-rapper Badshah's adorable gesture for an elderly fan at the US concert has left fans praising him. A video from the concert has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanishaa-mukerji-recalls-memory-loss-near-fatal-accident-debut-film-shoot-ssssshhh-2785457-2025-09-11",
      "headline": "Tanishaa Mukerji recalls memory loss after near-fatal accident on debut film shootActor Tanishaa Mukerji recalled her near-fatal accident on debut film 'Ssssshhh....' shoot. She revealed suffering from a concussion and memory loss. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/selena-gomez-wedding-plans-benny-blanco-reveals-her-ring-bearer-2785444-2025-09-11",
      "headline": "Selena Gomez blushes talking about wedding with Benny Blanco, reveals ring bearerActor Selena Gomez recently revealed details about her wedding plans with fiance Benny Blanco, teasing that the preparations were going well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-jugnuma-premiere-viral-moment-with-anurag-kashyap-jaideep-ahllawat-vijay-varma-2785441-2025-09-11",
      "headline": "Manoj Bajpayee in splits as Jaideep, Anurag touch his feet at Jugnuma screeningActor Manoj Bajpayee found himself in a humorous situation at 'Jugnuma's' premiere. Jaideep Ahlawat, Anurag Kashyap, Vijay Varma and others playfully touched Bajpayee's feet and left him embarrassed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-battle-of-galwan-ladakh-shoot-colonel-b-santosh-babu-2785434-2025-09-11",
      "headline": "Salman Khan looks ripped in military uniform at Battle of Galwan shoot. See picA new picture of Salman Khan from the 'Battle of Galwan' shoot in Ladakh has emerged, showcasing his physical transformation for the role of Colonel B Santosh Babu. The film is directed by Apoorva Lakhia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-recalls-govinda-flirted-with-co-stars-only-sonali-bendre-was-spared-2785231-2025-09-10",
      "headline": "Sunita Ahuja recalls Govinda flirted with co-stars: Only Sonali Bendre was sparedSunita Ahuja appeared as a guest judge on 'Pati Patni Aur Panga' and shared fun insights about her actor-husband Govinda. She revealed Govinda flirted with many co-actors but never with Sonali Bendre, adding a nostalgic touch to the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-mohini-was-forced-to-do-intimate-scene-in-kanmani-despite-discomfort-2785279-2025-09-10",
      "headline": "Actor Mohini says she was forced to do intimate scene in Kanmani despite discomfortActor Mohini revealed she was forced to perform intimate scenes in 'Kanmani' without her consent. She admitted that she was pressureised to shoot a swimsuit scene despite her discomfort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-youth-review-song-joong-ki-returns-with-slow-burn-k-drama-not-for-everyone-2785291-2025-09-10",
      "headline": "My Youth review: Song Joong-ki returns with slow burn K-drama not for everyoneRelease Date:Fri Sep 05, 2025'My Youth' is a slow-burn romance K-drama starring Song Joong-ki and Chun Woo-hee. The series blends nostalgia with intimate storytelling, offering a soothing watch for romance fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/modern-family-star-eric-stonestreet-marries-his-longtime-partner-lindsay-schweitzer-2785270-2025-09-10",
      "headline": "Modern Family star Eric Stonestreet marries his longtime partner Lindsay SchweitzerEric Stonestreet, famed for his role in 'Modern Family', is married to his long-time girlfriend Lindsay Schweitzer in an intimate ceremony at their Kansas City home. The couple shared joyous moments on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauri-pradhan-reunites-former-actress-mayoori-kango-google-executive-2785262-2025-09-10",
      "headline": "Gauri Pradhan reunites with ex-actor friend, now industry head at Google IndiaGauri Pradhan recently met her long-time friend Mayoori Kango, now a Google India executive. Their reunion highlights Mayoori's journey from Bollywood to a successful corporate career, demonstrating significant transitions in her professional life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-congratulates-sivakarthikeyan-for-madharaasi-excellent-action-loved-it-2785250-2025-09-10",
      "headline": "Rajinikanth congratulates Sivakarthikeyan for Madharaasi: Excellent action, loved itTamil actor Sivakarthikeyan, whose latest film 'Madhaarasi' is currently running in theatres, shared the special message he got from his idol Rajinikanth on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anuparna-roy-venice-film-festival-win-indian-identity-palestine-comment-2785199-2025-09-10",
      "headline": "Director Anuparna Roy stands by Palestine remarks: Doesn't make me less IndianAnuparna Roy's debut film 'Songs of Forgotten Trees' won Best Director at the Venice Film Festival, marking a proud moment for Indian cinema. The young filmmaker shared her challenging journey and heartfelt gratitude towards the support from industry stalwarts like Anurag Kashyap and fellow Bollywood colleagues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maheep-kapoor-bhavna-panday-bijuria-dance-karan-johar-varun-dhawan-janhvi-kapoor-2785208-2025-09-10",
      "headline": "Maheep, Bhavana say no to Bijuria dance, KJo turns to Varun-Janhvi for tipsFilmmaker Karan Johar shared a video of Maheep Kapoor and Bhavana Pandey declining to dance to 'Bijuria'. The request was made in an Instagram post termed 'reluctant nepo moms'. The post also referenced Varun Dhawan and Janhvi Kapoor for potential dance lessons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kunickaa-sadanand-son-ayaan-says-relationship-with-kumar-sanu-was-toxic-2785107-2025-09-10",
      "headline": "Kunickaa Sadanand's son Ayaan says her relationship with Kumar Sanu was very toxicActor Ayaan Lall opened up about his mother Kunickaa Sadanand's relationship with singer Kumar Sanu. He clarified the timeline and describes the relationship as toxic, shedding light on her post-divorce life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-a-beginners-guide-to-the-world-class-anime-hit-2785076-2025-09-10",
      "headline": "Demon Slayer Infinity Castle: A beginner's guide to the world-class anime hitWith 'Demon Slayer: Infinity Castle' releasing soon, fans in India can catch up by watching just a few key episodes instead of the entire series. The film has already set records with advance bookings and early morning screenings, promising an exciting experience for anime lovers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehbaz-badesha-bigg-boss-19-entry-low-key-tv-nepotism-moment-2784940-2025-09-10",
      "headline": "Is Shehbaz Badesha's entry into Bigg Boss 19 a low-key TV nepotism moment?Shehbaz Badesha, brother of actor Shehnaaz Gill, is the first wild card contestant of 'Bigg Boss 19'. He made a brief appearance in the reality show's 13th season to support his sister. But does he deserve to be in this season?"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/netanyahu-israel-hamas-strikes-qatar-terrorism-911-response-doha-attack-2785485-2025-09-11",
      "headline": "Netanyahu invokes 9/11 to defend Doha strike: We did exactly what US didIsraeli Prime Minister Benjamin Netanyahu defends recent military actions in Doha, likening them to US measures after September 11. His remarks stress the need for nations to confront terrorism or let Israel do so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-shot-dead-moment-of-gun-attack-video-viral-screams-panic-utah-manhunt-shooter-2785458-2025-09-11",
      "headline": "Gunshot, screams, panic: Video captures moment Charlie Kirk was shot deadCharlie Kirk, founder of Turning Point USA, was answering a question about gun violence when a single gunshot rang out. As he abruptly slumped in his seat, chaos broke out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/have-very-good-impression-of-modi-ji-says-nepals-ex-chief-justice-sushila-karki-glbs-2785403-2025-09-11",
      "headline": "Have very good impression of Modi Ji, says Nepal's ex-Chief Justice Sushila KarkiFormer Chief Justice Sushila Karki accepted Nepal's interim PM role after Gen-Z protests ousted the government, vowing to honor slain youth, rebuild Nepal, and strengthen India ties while praising PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/surprising-shallow-ill-informed-india-slams-switzerlands-remarks-on-minorities-glbs-2785298-2025-09-10",
      "headline": "We can help you address racism: India schools Switzerland over minority remarkKshitij Tyagi's remarks came a day after Switzerland called on India to \"take effective measures to protect the minorities and uphold the rights to the freedom of expression and the freedom of the media.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-an-obesity-doctor-and-i-know-weight-loss-management-tricks-beyond-calories-gym-sleep-2785112-2025-09-11",
      "headline": "I'm an obesity doctor and here's my realistic, guilt-free guide to weight lossIn this DocYard column, renowned bariatric surgeon Dr. Muffazal Ladkawala explains the actual reason behind obesity and how small habits and the right mindset can help one manage weight amid a busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-calls-joe-biden-2024-re-election-bid-an-act-of-recklessness-glbs-2785401-2025-09-11",
      "headline": "Biden was driven by ego for 2024 re-election bid: Kamala Harris's bombshellIn her upcoming memoir 107 Days, former US Vice President Kamala Harris delivers her sharpest critique of Joe Biden, calling his 2024 re-election bid \"reckless\" and driven by ego rather than duty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/tejasvi-manoj-kid-of-the-year-2025-shield-seniors-online-safety-elderly-2785508-2025-09-11",
      "headline": "Meet Tejasvi Manoj, 17-year-old Indian-origin girl named TIME's Kid of the YearTejasvi Manoj, an Indian origin girl recognised as TIME's Kid of the Year 2025, created Shield Seniors to help older adults navigate online safely."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-opium-capital-poppy-cultivation-balochistan-afghan-farmers-taliban-ban-2022-terror-funding-global-heroin-market-2785171-2025-09-11",
      "headline": "How Pakistan has become opium capital of the world with Afghan expertiseSprawling poppy fields in Pakistan's Balochistan have overtaken those in Afghanistan, which produced 80% of the world's opium. The Taliban's 2022 ban on poppy farming in Afghanistan pushed cultivators into Pakistan. With Afghan expertise and share-croppers, Pakistan has become the world's new opium hub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-moves-family-greece-serbian-protests-political-tensions-2785413-2025-09-11",
      "headline": "Novak Djokovic shifts family to Greece as Serbian protests intensify: ReportsNovak Djokovic has quietly relocated his family to Greece amid growing political pressure in Serbia. This move follows his open support for student protests and signals increasing tensions with the Serbian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shivam-dube-bowling-india-vs-uae-ipl-impact-player-rule-2785494-2025-09-11",
      "headline": "How Shivam Dube is taking on IPL's all-rounder killer ruleThe IPL's 'all-rounder killer' rule has clipped his bowling wings, but with backing from the Indian team management, Shivam Dube is finding room to work on his secondary skill. In the Asia Cup opener against the UAE, Dube took three wickets in an encouraging two-over spell in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-shot-dead-utah-campus-event-turning-point-usa-founder-2785433-2025-09-11",
      "headline": "Charlie Kirk: Proud dropout, political provocateur and Trump confidanteCharlie Kirk made his name sparring with college students in open-air debates on issues ranging from transgender rights to climate policy. Trump valued the popular podcaster as an adviser with a strong feel for the Republican youth base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/physiotherapists-not-doctors-cant-use-dr-prefix-governments-health-authority-2785380-2025-09-10",
      "headline": "Physiotherapists not doctors, can't use 'Dr' prefix: Government's health authorityThe Directorate General of Health Services said that physiotherapists are not trained as medical doctors and should not present themselves as such."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-singapore-plane-passengers-deboard-faulty-air-conditioning-delhi-airport-2785438-2025-09-11",
      "headline": "Seated for 2 hours, passengers deplaned from Air India flight due to faulty ACThe Boeing 787-9 Dreamliner aircraft was scheduled to depart from Delhi at 11 pm on Wednesday night. The passengers were seated for almost two hours before being asked to deboard the plane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-motherhood-off-limits-for-women-facing-mental-health-problems-depression-anxiety-2785178-2025-09-11",
      "headline": "Is motherhood off-limits for women facing mental health issues?Is your mental health condition casting a major question mark over your desire to become a mother? Perhaps this article will help you come to a conclusion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-condemns-violation-of-brotherly-states-sovereignty-pm-tells-qatari-emir-slams-israeli-attack-on-doha-2785288-2025-09-10",
      "headline": "Violation of sovereignty: In call with Qatar's Emir, PM condemns strikes on DohaQatar is a key US ally and a mediator in the Gaza peace talks. The attacks on Doha took place at a time when several Hamas leaders were in the city to participate in the US-backed ceasefire talks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-admits-picking-iphone-air-over-17-pro-is-hard-reveals-who-its-thinnest-iphone-is-for-2785487-2025-09-11",
      "headline": "Apple admits picking iPhone Air over 17 Pro is hard, reveals who its thinnest iPhone is forApple has introduced a new twist to its iPhone line-up this year by launching the iPhone 17 Pro alongside an all-new model called the iPhone Air. The company is openly suggesting that it wants buyers to face a real dilemma, whether to pick the powerful Pro or the ultra-thin Air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/turning-point-usa-founder-charlie-kirk-shot-at-utah-valley-university-event-glbs-2785397-2025-09-11",
      "headline": "Trump ally Charlie Kirk shot dead on stage; door-to-door search for assassinCharlie Kirk, founder of Turning Point USA and staunch Trump ally, was shot dead at a Utah campus event. He was known for fiery Christian nationalist rhetoric and mobilising young conservatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-works-on-laptop-movie-theatre-reddit-debates-toxic-work-culture-bangalore-work-life-balance-2785509-2025-09-11",
      "headline": "Reddit debates toxic work culture after Bengaluru woman types away in theatreAddressing the \"chaotic\" work culture in the Karnataka capital, the user wrote on the subreddit r/Bangalore: \"Only in Bangalore! Went to watch Lokah movie and a woman in the row ahead opened her laptop and started working like she's in office, typing away, in a theatre.\"  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gwalior-cook-earning-rs-10000-finds-rs-40-crore-transactions-in-his-name-after-income-tax-notice-2785472-2025-09-11",
      "headline": "Cook earning Rs 10,000 forced into legal battle after Rs 40 crore tax noticeRavindra Singh Chauhan, a dhaba cook from Gwalior earning Rs 10,000 a month, was stunned to learn that transactions worth over Rs 40 crore had been carried out through a company and bank account opened in his name without his knowledge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-wishes-mohan-bhagwat-75th-birthday-calls-him-symbol-of-harmony-societal-change-writes-op-ed-tribute-retirement-speculations-2785511-2025-09-11",
      "headline": "Symbol of harmony, societal change: PM praises Mohan Bhagwat on 75th birthdayPrime Minister Narendra Modi marked RSS chief Mohan Bhagwat's 75th birthday with praise for his lifelong service and dedication to harmony, also writing an op-ed on his leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/new-iphone-is-here-and-it-is-time-again-for-the-holy-war-android-iphone-17-iphone-air-apple-google-pixel-2785192-2025-09-10",
      "headline": "iPhone 17 is here and it's time to discuss the great smartphone scamWhether you're Team Apple or Team Android, you're all suckers in this grand smartphone scam. These devices promise connection but deliver isolation: one notification at a time. So next time you pull out your precious gadget, remember: it's not a status symbol, it's a shiny leash."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wrestlemania-43-saudi-arabia-2027-first-event-outside-us-2785419-2025-09-11",
      "headline": "WrestleMania may debut outside USA, Saudi Arabia tipped as 2027 hosts: ReportWrestleMania 43 is reportedly confirmed to be held in Saudi Arabia in 2027, marking the first time the event moves outside the United States. This move highlights Saudi Arabia's growing influence in global sports and entertainment but raises questions on WWE's fanbase balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/games-against-top-teams-like-india-help-build-confidence-uae-coach-lalchand-rajput-2785553-2025-09-11",
      "headline": "Games against top teams like India help build confidence: UAE coach Lalchand RajputUAE head coach Lalchand Rajput believes that games against top teams like India will help in raising their own standards. This comes after India secured a crushing win over the UAE in their opening game at the Asia Cup 2025 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-rally-hong-kong-open-quarterfinals-2785527-2025-09-11",
      "headline": "Satwik-Chirag survives another scare, advances to quarterfinal of Hong Kong OpenSatwiksairaj Rankireddy and Chirag Shetty overcame a tough challenge from Thailand to enter the Hong Kong Open quarterfinals. They took an hour and three minutes to win the match 18-21, 21-15, 21-11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-omar-marmoush-injury-manchester-derby-knee-injury-2785518-2025-09-11",
      "headline": "Premier League: Man City's Omar Marmoush ruled out of Manchester derbyOmar Marmoush will miss the Manchester derby due to a knee injury sustained on international duty. This setback deepens Manchester City's injury woes ahead of a crucial Premier League clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-lalchand-rajput-uae-overawed-india-star-players-2785505-2025-09-11",
      "headline": "Asia Cup 2025: UAE head coach admits batters were overawed by India starsUAE head coach Lalchand Rajput admitted his batters were overawed by India's stars after a nine-wicket defeat in the Asia Cup 2025 opener. He said the experience against world-class spinners will be a key learning step for his young side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shivam-dube-bowling-india-vs-uae-ipl-impact-player-rule-2785494-2025-09-11",
      "headline": "How Shivam Dube is taking on IPL's all-rounder killer ruleThe IPL's 'all-rounder killer' rule has clipped his bowling wings, but with backing from the Indian team management, Shivam Dube is finding room to work on his secondary skill. In the Asia Cup opener against the UAE, Dube took three wickets in an encouraging two-over spell in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-moves-family-greece-serbian-protests-political-tensions-2785413-2025-09-11",
      "headline": "Novak Djokovic shifts family to Greece as Serbian protests intensify: ReportsNovak Djokovic has quietly relocated his family to Greece amid growing political pressure in Serbia. This move follows his open support for student protests and signals increasing tensions with the Serbian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shivam-dube-gautam-gambhir-message-ind-vs-pak-2785453-2025-09-11",
      "headline": "Asia Cup 2025: Shivam Dube recalls Gautam Gambhir's message ahead of IND vs PAK clashAsia Cup 2025: Shivam Dube highlights Gautam Gambhir's philosophy that every game for India is a chance to do something miraculous. Despite criticism on the Asia Cup's competitiveness, the team remains focused on playing each match with pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-england-by-14-runs-in-rain-affected-cardiff-t20i-brevis-shines-2785451-2025-09-11",
      "headline": "After huge SA20 auction, South Africa edge past England in rain-marred 1st T20ISouth Africa defeated England by 14 runs in a rain-affected first T20I at Cardiff on Wednesday. The win came just after the record-breaking SA20 auction where Dewald Brevis shattered records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-hong-kong-asia-cup-2024-group-b-clash-abu-dhabi-preview-2784980-2025-09-11",
      "headline": "Riding on hat-trick win, Bangladesh look for clinical start vs Hong KongBangladesh face Hong Kong in a crucial Asia Cup Group B clash in Abu Dhabi. Hong Kong will be looking to bounce back from their defeat to Afghanistan, while the Tigers aim for a winning start at the Sheikh Zayed Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-moves-family-greece-serbian-protests-political-tensions-2785413-2025-09-11",
      "headline": "Novak Djokovic shifts family to Greece as Serbian protests intensify: ReportsNovak Djokovic has quietly relocated his family to Greece amid growing political pressure in Serbia. This move follows his open support for student protests and signals increasing tensions with the Serbian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shivam-dube-gautam-gambhir-message-ind-vs-pak-2785453-2025-09-11",
      "headline": "Asia Cup 2025: Shivam Dube recalls Gautam Gambhir's message ahead of IND vs PAK clashAsia Cup 2025: Shivam Dube highlights Gautam Gambhir's philosophy that every game for India is a chance to do something miraculous. Despite criticism on the Asia Cup's competitiveness, the team remains focused on playing each match with pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-england-by-14-runs-in-rain-affected-cardiff-t20i-brevis-shines-2785451-2025-09-11",
      "headline": "After huge SA20 auction, South Africa edge past England in rain-marred 1st T20ISouth Africa defeated England by 14 runs in a rain-affected first T20I at Cardiff on Wednesday. The win came just after the record-breaking SA20 auction where Dewald Brevis shattered records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-hong-kong-asia-cup-2024-group-b-clash-abu-dhabi-preview-2784980-2025-09-11",
      "headline": "Riding on hat-trick win, Bangladesh look for clinical start vs Hong KongBangladesh face Hong Kong in a crucial Asia Cup Group B clash in Abu Dhabi. Hong Kong will be looking to bounce back from their defeat to Afghanistan, while the Tigers aim for a winning start at the Sheikh Zayed Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}