{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/federal-reserve-chief-jerome-powell-says-wont-quit-donald-trump-fed-interest-rate-cooling-inflation-2630065-2024-11-08",
      "headline": "Won't resign as US Federal Reserve chief even if Trump asked me to: Jerome PowellSpeaking at a press conference following the latest meeting of the rate-setting Federal Open Market Committee, Jerome Powell was asked if he would step down from central bank leadership if asked by Donald Trump, who repeatedly attacked him in his first term as president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/stocks-rally-as-investors-await-federal-reserves-rate-decision-2629927-2024-11-07",
      "headline": "Stocks rally as investors await Federal Reserve's rate decisionAsian shares recovered as US stocks hit records amid speculations on Trump's presidency and the Fed's rate decision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/jet-airways-retail-shareholders-liquidation-order-wipeout-share-price-2629770-2024-11-07",
      "headline": "Jet Airways retail shareholders stare at total loss after liquidation orderJet Airways' stock, which had hit a 5% lower circuit following the court's decision, closed at Rs 34.04 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharan-hegdes-1-club-lays-off-15-of-workforce-amid-ai-driven-cost-cuts-2629750-2024-11-07",
      "headline": "Sharan Hegde lays off 15% of 1% Club's employees, cites AI-driven cost cutsSharan Hegde, the founder and CEO of 1% Club, confirmed in a LinkedIn post that he has laid off 15% of the company's workforce. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-donald-trump-fuelled-rally-us-fed-rate-decision-2629713-2024-11-07",
      "headline": "Sensex, Nifty erase Trump-fuelled gains as focus shifts to Fed rate decisionThe S&P BSE Sensex ended 836.34 points to 79,541.79 at the closing bell, while the NSE Nifty50 tumbled 284.70 points to settle at 24,199.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-share-price-down-8-percent-net-profit-revenue-jump-q2fy25-results-2629634-2024-11-07",
      "headline": "Trent share price falls 8% despite 47% rise in Q2 net profit. Here's whyTrent share price: By 1:33 pm, the stock was down 7.49%, trading at Rs 6,432.55 on the Bombay Stock Exchange (BSE).\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-net-worth-rises-26-billion-in-a-day-after-donald-trumps-election-victory-2629597-2024-11-07",
      "headline": "Elon Musk's net worth rises $26 billion in a day after Donald Trump's election victoryThe boost came as Tesla's shares climbed 14.75% to $288.53 during after-hours trading, with Trump's pro-business policies seen as a favorable backdrop for Tesla and Musk's ventures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jet-airways-liquidation-supreme-court-non-implementation-resolution-plan-bankrupt-2629587-2024-11-07",
      "headline": "Jet Airways grounded for good as Supreme Court orders liquidationThe Supreme Court noted that five years had passed since the plan was approved, and there had been no significant progress in reviving the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-gains-2-straight-sessions-q2-results-msci-smallcap-index-2629563-2024-11-07",
      "headline": "Ola Electric share price gains after 2 straight sessions. Here's whyOla Electric share price: The uptick in the stock price is attributed to Ola Electric's recent inclusion in the MSCI Small Cap Index."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-down-again-stock-market-crash-donald-trump-us-election-euphoria-fades-fed-rate-decision-2629524-2024-11-07",
      "headline": "Sensex drops 900 points as Trump euphoria fades, focus shifts to Fed rate decisionStock market today: Sensex and Nifty fell sharply during Thursday's intraday trading session as investors turned cautious ahead of the US Federal Reserve's rate decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-7-2024-precious-metals-witness-dip-on-mcx-latest-rates-2629504-2024-11-07",
      "headline": "Gold, silver price today, November 7, 2024: Precious metals witness dip on MCXGold Price Today November 7, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hindalco-share-price-decline-6-percent-us-based-subsidiary-novelis-q2-profit-decline-2629502-2024-11-07",
      "headline": "Explained: Why Hindalco share price fell over 6% todayAt 10:25 am, Hindalco's share price was down 6.50%, trading at Rs 662.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-donald-trump-victory-speech-stance-on-renewable-energy-stocks-slide-2629491-2024-11-07",
      "headline": "US elections: Why renewable energy stocks tumbled after Donald Trump's win In his victory speech following the 2024 US presidential election, Donald Trump pledged to halt renewable energy projects from his first day in office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apollo-hospitals-share-price-6-percent-gain-q2fy25-results-net-profit-revenue-2629484-2024-11-07",
      "headline": "Explained: Why Apollo Hospitals share price jumped 6% todayIn Q2FY25, Apollo Hospitals reported a 63% year-on-year (YoY) increase in net profit, reaching Rs 379 crore, mainly driven by growth in its hospital business. This is up from Rs 233 crore in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-fed-rate-decision-apollo-hospitals-2629481-2024-11-07",
      "headline": "Sensex, Nifty open lower ahead of Fed rate decision; Apollo Hospitals jumps 6%The S&P BSE Sensex was down 107.15 points to 80,270.98 at 9:21 am, while the NSE Nifty50 fell 47.25 points to trade at 24,436.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-markets-sp-500-dow-jones-open-at-record-high-as-donald-trump-wins-elections-tesla-shares-jump-13-percent-2629293-2024-11-06",
      "headline": "S&P 500, Dow open at record high as Donald Trump wins; Tesla shares jump 13%The S&P 500 and Dow Jones surged, with the Dow gaining 628.5 points, or 1.49%, to reach 42,850.4 at the open, while the S&P 500 rose 82.1 points, or 1.42%, to 5,864.89. The Nasdaq Composite also climbed, adding 333.6 points, or 1.81%, to start at 18,772.76."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trump-20-impact-on-indias-economy-trade-and-foreign-investment-2629194-2024-11-06",
      "headline": "Trump 2.0: Impact on India's economy, trade and foreign investmentA second Trump term could alter India's economy, affecting trade tariffs and investment flows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-tesla-share-price-surges-12-percent-donald-trump-win-elon-musk-2629245-2024-11-06",
      "headline": "US elections: Tesla shares surge over 12% as Donald Trump winsThe sharp gains in Tesla shares were largely driven by investor sentiment around CEO Elon Musk's vocal support for Donald Trump throughout his campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-ipo-day-2-latest-gmp-subscription-details-price-band-key-dates-2629166-2024-11-06",
      "headline": "Sagility India IPO Day 2: Check Latest GMP, subscription details and moreSagility India IPO: Leading brokerages such as Nirmal Bang, BP Equities, Marwadi Shares & Finance Ltd, Ventura Securities Ltd, and Canara Bank have given a \"Subscribe\" rating for the IPO, citing Sagility's strong financial performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/tesla-shares-rise-12-after-trumps-victory-2629117-2024-11-06",
      "headline": "Tesla shares rise 12% after Trump's victoryPost Donald Trump's US election win with Elon Musk's backing, Tesla shares saw a 12% pre-market climb."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-receives-fresh-threat-message-for-salman-khan-from-lawrence-bishnoi-gang-cites-a-song-songwriter-killed-2630061-2024-11-08",
      "headline": "Salman Khan gets fresh threat over song naming Lawrence BishnoiThe message from the Bishnoi gang warned of severe consequences for a songwriter over a song that allegedly links Salman Khan with the jailed gangster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-news-kishtwar-terrorist-attack-village-defence-guards-killed-kidnap-kashmir-tigers-2630043-2024-11-08",
      "headline": "2 village defence guards kidnapped, killed by terrorists in J&K's KishtwarThe dead were identified as Nazir Ahmed and Kuldeep Kumar, both residents of Ohli Kuntwara village. Their bodies are yet to be recovered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-today-responds-canada-ban-on-jaishankar-press-conference-video-2630046-2024-11-08",
      "headline": "We remain undeterred: Australian outlet on Canada's ban after Jaishankar presserAustralia Today, banned by Canada for airing S Jaishankar's press conference, asserted its resolve to uphold transparency, accuracy, and the right to report impactful stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-donald-trump-susie-wiles-profile-first-woman-white-house-chief-of-staff-2630048-2024-11-08",
      "headline": "Who is Susie Wiles, Trump's pick for first woman White House chief of staffThe daughter of National Football League (NFL) player and sports broadcaster Pat Summerall, Susie Wiles began her political career in the Washington House of New York Representative Jack Kemp in the 1970s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/at-59-shah-rukh-khan-quit-smoking-does-age-matter-when-kicking-the-butt-2629651-2024-11-08",
      "headline": "At 59, Shah Rukh Khan quit smoking. Does age matter when kicking the butt?During a recent Q&A session with fans on his 59th birthday, SRK revealed that he's finally quit smoking. But does it still count when you give it up so late in life?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/joe-biden-donald-trump-republican-democrat-kamala-harris-white-house-2629990-2024-11-07",
      "headline": "Biden assures peaceful transfer of power in 1st address after Trump's victoryOutgoing US President Joe Biden said he congratulated Republican leader Donald Trump on his victory in the presidential election and vowed a peaceful transfer of power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-plea-against-ban-salman-rushdie-book-the-satanic-verses-banned-by-rajiv-gandhi-does-not-exist-2629893-2024-11-07",
      "headline": "Notification banning Salman Rushdie's 'The Satanic Verses' doesn't exist: CourtA bench of the Delhi High Court closed the proceedings on a petition challenging the Centre's decision to ban the import of Salman Rushdie's controversial novel, The Satanic Verses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-aligarh-muslim-university-minority-status-article-30-constitution-government-funding-educational-institution-2630040-2024-11-08",
      "headline": "Supreme Court verdict today on Aligarh Muslim University's minority status The government, opposing minority status, argued that the institute, being a centrally funded national university, cannot claim such status. Those who oppose it submitted that Article 30 protects its minority character despite the central funding. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/goa-tourism-down-how-sindhudurg-can-be-the-answer-to-all-goa-problems-2628287-2024-11-07",
      "headline": "Goa tourism down, how Sindhudurg can be the answer to all Goa problemsSindhudurg is a destination for leisurely escapes, yet it shares Goa's stunning views of both beaches and mountains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/federal-reserve-chief-jerome-powell-says-wont-quit-donald-trump-fed-interest-rate-cooling-inflation-2630065-2024-11-08",
      "headline": "Won't resign as US Federal Reserve chief even if Trump asked me to: Jerome PowellSpeaking at a press conference following the latest meeting of the rate-setting Federal Open Market Committee, Jerome Powell was asked if he would step down from central bank leadership if asked by Donald Trump, who repeatedly attacked him in his first term as president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-fighting-wayanad-bypoll-with-jamaat-e-islami-support-kerala-pinarayi-vijayan-2630039-2024-11-08",
      "headline": "Priyanka Gandhi fighting bypoll with Jamaat-e-Islami support: Pinarayi VijayanKerala Chief Minister Pinarayi Vijayan claimed that Jamaat-e-Islami's support for Priyanka Gandhi in Wayanad revealed the Congress party's true stance on secularism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/ian-bremmer-political-scientist-elon-musk-campaign-funds-donald-trump-us-election-kamala-harris-2630016-2024-11-07",
      "headline": "Single best political bet: Ian Bremmer on Elon Musk's huge Trump campaign fundsElon Musk will prioritise having a technology policy under the Trump administration and AI is a \"big advantage\" for the US on the global stage, political scientist Ian Bremmer said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/chhath-celebrations-across-the-world-bihar-chief-minister-nitish-kumar-joins-pooja-in-patna-2630066-2024-11-08",
      "headline": "Chhath festivities across the world, Nitish Kumar joins celebrations in PatnaDevotees thronged rivers and lakes in India and abroad to celebrate the Chhath festival with full fervour. Bihar Chief Minister Nitish Kumar joined the celebrations at his home in Patna. Also, Indians living in countries like US and Australia also took part in the pooja held at nearby water bodies and made offerings to the Sun god and Chhathi Maiya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/four-must-do-destinations-on-the-indian-gravy-train-2629720-2024-11-07",
      "headline": "Four must-do destinations on the Indian gravy trainINDIA TODAY SPICE puts together some exciting new food and drink experiences from around the country\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/poonam-mahajan-suspects-conspiracy-in-father-pramod-mahajans-death-demands-probe-2630038-2024-11-08",
      "headline": "Poonam Mahajan suspects conspiracy in father Pramod Mahajan's death, demands probeFormer BJP MP Poonam Mahajan said that the shootout that led to her father Pramod Mahajan's death may have been driven by ulterior motives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-t20is-arshdeep-singh-avesh-khan-ipl-2025-auction-durban-2630047-2024-11-08",
      "headline": "Arshdeep Singh, Avesh Khan look to make it big before IPL auctionSA vs IND: Arshdeep Singh, Avesh Khan, Jitesh Sharma and Vijaykumar Vyshak will be looking to make an impact when the T20I series between India and South Africa starts on Friday, November 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-wears-mother-bhavana-pandey-rohit-bal-salwar-suit-21-years-ago-2630024-2024-11-08",
      "headline": "Ananya Panday wears mother's custom Rohit Bal outfit from 21 years agoAnanya Panday paid homage to late designer Rohit Bal by wearing a custom outfit he created for her mother, Bhavana Pandey, 21 years ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-names-campaign-manager-susie-wiles-as-white-house-chief-of-staff-2630035-2024-11-08",
      "headline": "Trump picks Susie Wiles as White House Chief of Staff, 1st woman to hold postAfter helping engineer Donald Trump's sweeping victory in the presidential race, Susie Wiles has been named as the White House chief of staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/liam-payne-death-case-argentinian-prosecutors-charged-2630057-2024-11-08",
      "headline": "3 arrested in connection with death of ex-One Director star Liam Payne Prosecutor Andrés Madrea charged the three suspects, whose identities were not revealed, with the crimes of \"abandonment of a person followed by death\" and \"supplying and facilitating the use of narcotics,\" the prosecutor's office said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/yamuna-toxic-waters-devotees-in-delhi-at-risk-during-chhath-puja-pollution-levels-lab-testing-2630013-2024-11-07",
      "headline": "Deep dive into Yamuna's toxic water and how it put Chhath devotees at riskTo understand the risk posed by the highly polluted river Yamuna, an India Today team collected water samples from three key locations — Wazirabad, ITO Barrage, and Kalindi Kunj — to examine the river's water quality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-inspiration-pan-india-films-missed-working-with-him-magadheera-ss-rajamouli-2630051-2024-11-08",
      "headline": "Suriya was my inspiration to make pan-India films: SS RajamouliSS Rajamouli was the chief guest for the pre-release event of Kanguva in Hyderabad on November 7. At the gathering, the RRR director called Suriya his inspiration for making pan-India films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-surya-ghar-yojana-solar-revolution-sweeping-india-ground-report-2629924-2024-11-07",
      "headline": "How well the PM Surya Ghar Yojana, a solar revolution, is faring across IndiaIndia Today TV team spoke to consumers who have installed solar panels in UP's Lucknow and Ghaziabad, Chhattisgarh's Raipur, Rajasthan's Jaipur, and Madhya Pradesh's Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/desire-to-restore-ties-putin-congratulates-trump-on-us-poll-victory-calls-him-brave-2630027-2024-11-08",
      "headline": "Restoring ties needs attention: Putin wishes Trump, calls him 'brave'Russian President Vladimir Putin said that the desire to restore relations with Russia and facilitate the end of the Ukrainian crisis deserves attention as he congratulated Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/tv-actor-nitin-chauhaan-known-for-dadagiri-and-splitsvilla-dies-at-35-2630029-2024-11-08",
      "headline": "TV actor Nitin Chauhaan, known for Crime Patrol and Splitsvilla, dies at 35Television actor Nitin Chauhaan, 35, died on Thursday in Mumbai. Known for winning Dadagiri 2, Nitin also appeared in shows like MTV Splitsvilla 5, Crime Patrol, and Tera Yaar Hoon Main."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-ektaa-kapoor-questions-vivian-dsena-arrogance-rajat-dalal-salman-khan-rohit-shetty-weekend-ka-vaar-2630070-2024-11-08",
      "headline": "BB 18 Day 31: Ektaa Kapoor questions Vivian Dsena's arrogance on Shukravaar Ka VaarThe upcoming episode of Bigg Boss 18 will feature TV czarina Ektaa Kapoor giving a reality check to the contestant. A promo of her segment while schooling Vivian Dsena and Rajat Dalal has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-breakfast-date-in-mumbai-new-zealand-test-series-2630075-2024-11-08",
      "headline": "Pics: Anushka Sharma-Virat Kohli enjoy breakfast date in MumbaiAnushka Sharma and Virat Kohli recently enjoyed a breakfast date in Mumbai. Pictures of the two from the outing have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/danish-aslam-reunite-imran-khan-after-break-ke-baad-2629971-2024-11-08",
      "headline": "Exclusive: Break Ke Baad director Danish Aslam confirms working with Imran KhanDirector Danish Aslam, who made his debut with Break Ke Baad, is set to reunite with actor Imran Khan. While he did not divulge details, he confirmed that a collaboration is on the cards, and it's a work in progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ishaan-khatter-asks-paps-if-they-use-trackers-as-they-photograph-him-with-girlfriend-2630071-2024-11-08",
      "headline": "Ishaan Khatter asks paps if they use trackers as they photograph him with girlfriendIshaan Khatter and his girlfriend Chandini Baiz were seen together in Mumbai. Ishaan joked with the paparazzi about how they always track his movements. The actor keeps his relationship out of the public eye."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-1st-t20i-predicted-xis-ramandeep-singh-debut-durban-2630067-2024-11-08",
      "headline": "SA vs IND, 1st T20I Predicted XI: Will Ramandeep make his debut?India's T20I series opener against South Africa may see debut opportunities for fresh faces like Ramandeep Singh and Vijaykumar Vyshak. Both players impressed in the IPL and domestic circuits, earning their call-ups for a promising international debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-england-t20is-alzarri-joseph-two-match-ban-shai-hope-spat-2630060-2024-11-08",
      "headline": "WI vs ENG: Alzarri Joseph handed 2-match ban after Shai Hope on-field spatAlzarri Joseph has been handed a 2-match suspension by Cricket West Indies after his on-field spat with ODI captain Shai Hope. Joseph had walked off the field during the 3rd ODI against England after a spat with Hope. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wta-finals-iga-swiatek-knocked-out-gauff-vs-sabalenka-set-for-semis-2630056-2024-11-08",
      "headline": "WTA Finals: Iga Swiatek knocked out, Gauff vs Sabalenka set for semisDefending champion Iga Swiatek's journey in the WTA Finals ended as Barbora Krejcikova defeated Coco Gauff, securing her own place in the semifinals. Swiatek's hopes were dashed despite a dominant win against Daria Kasatkina earlier in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-t20is-arshdeep-singh-avesh-khan-ipl-2025-auction-durban-2630047-2024-11-08",
      "headline": "Arshdeep Singh, Avesh Khan look to make it big before IPL auctionSA vs IND: Arshdeep Singh, Avesh Khan, Jitesh Sharma and Vijaykumar Vyshak will be looking to make an impact when the T20I series between India and South Africa starts on Friday, November 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-amad-hits-brace-as-manchester-united-down-paok-tottenham-beaten-2630044-2024-11-08",
      "headline": "Europa League: Amad hits brace as Manchester United down PAOK, Tottenham beatenManchester United secured a 2-0 victory over PAOK, marking their first Europa League win this season. Meanwhile, Tottenham's unbeaten run ended with a 3-2 loss to Galatasaray, and Lazio claimed the top spot with a win against Porto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/multan-pitch-for-1st-pakistan-vs-england-test-rated-satisfactory-2630012-2024-11-07",
      "headline": "Multan pitch for 1st Pakistan vs England Test rated 'satisfactory'PAK vs ENG: The ICC rated the pitch for the first Test in Multan where England beat Pakistan by an innings and 47 runs. England put up a huge score of 823 for seven after Harry Brook's 317. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-prank-sachin-tendulkar-first-interaction-yuvraj-singh-irfan-pathan-watch-2630011-2024-11-07",
      "headline": "Watch: Kohli recalls hilarious first interaction with Sachin Tendulkar India's star batter Virat Kohli recently shared a nostalgic and hilarious memory of his first interaction with Sachin Tendulkar, revealing how seniors like Irfan Pathan and Harbhajan Singh orchestrated a playful prank that left him both embarrassed and amused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-2nd-odi-live-streaming-adelaide-babar-azam-2630001-2024-11-07",
      "headline": "Australia vs Pakistan 2nd ODI: When and where to watch? AUS vs PAK: Pat Cummins' Australia and Mohammad Rizwan's Pakistan will be up against each other in the second ODI of the three-match series on Thursday, November 8 at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fk-crvena-zvezda-dig-at-real-madrid-watch-fc-barcelona-scored-two-meme-2629985-2024-11-07",
      "headline": "FK Crvena zvezda take sly dig at Real Madrid after 5-2 loss to BarcelonaAfter scoring twice against Barcelona in a Champions League clash, Serbian club FK Crvena zvezda took a jab at Real Madrid on social media, highlighting Madrid's recent struggles against their arch-rivals and fueling online banter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-pitch-rating-india-vs-bangladesh-kanpur-new-zealand-test-series-2629980-2024-11-07",
      "headline": "ICC reveals pitch rating for India's home Tests, Kanpur outfield unsatisfactoryThe outfield at the Green Park Stadium in Kanpur, which hosted the second Test between India and Bangladesh in October was rated 'unsatisfactory'. Two days of play were washed out due to wet outfield at the venue. All three pitches that were used for the New Zealand series received a 'satisfactory' rating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/multan-pitch-for-1st-pakistan-vs-england-test-rated-satisfactory-2630012-2024-11-07",
      "headline": "Multan pitch for 1st Pakistan vs England Test rated 'satisfactory'PAK vs ENG: The ICC rated the pitch for the first Test in Multan where England beat Pakistan by an innings and 47 runs. England put up a huge score of 823 for seven after Harry Brook's 317. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-prank-sachin-tendulkar-first-interaction-yuvraj-singh-irfan-pathan-watch-2630011-2024-11-07",
      "headline": "Watch: Kohli recalls hilarious first interaction with Sachin Tendulkar India's star batter Virat Kohli recently shared a nostalgic and hilarious memory of his first interaction with Sachin Tendulkar, revealing how seniors like Irfan Pathan and Harbhajan Singh orchestrated a playful prank that left him both embarrassed and amused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-2nd-odi-live-streaming-adelaide-babar-azam-2630001-2024-11-07",
      "headline": "Australia vs Pakistan 2nd ODI: When and where to watch? AUS vs PAK: Pat Cummins' Australia and Mohammad Rizwan's Pakistan will be up against each other in the second ODI of the three-match series on Thursday, November 8 at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fk-crvena-zvezda-dig-at-real-madrid-watch-fc-barcelona-scored-two-meme-2629985-2024-11-07",
      "headline": "FK Crvena zvezda take sly dig at Real Madrid after 5-2 loss to BarcelonaAfter scoring twice against Barcelona in a Champions League clash, Serbian club FK Crvena zvezda took a jab at Real Madrid on social media, highlighting Madrid's recent struggles against their arch-rivals and fueling online banter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-pitch-rating-india-vs-bangladesh-kanpur-new-zealand-test-series-2629980-2024-11-07",
      "headline": "ICC reveals pitch rating for India's home Tests, Kanpur outfield unsatisfactoryThe outfield at the Green Park Stadium in Kanpur, which hosted the second Test between India and Bangladesh in October was rated 'unsatisfactory'. Two days of play were washed out due to wet outfield at the venue. All three pitches that were used for the New Zealand series received a 'satisfactory' rating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-aiden-markram-not-t20-world-cup-final-rematch-excited-for-series-2629968-2024-11-07",
      "headline": "South Africa not looking at India series as T20 World Cup rematch: MarkramSouth Africa's captain Aiden Markram emphasised that the upcoming T20I series against India won't be viewed as a rematch of the 2024 T20 World Cup final, with no revenge plans in mind as both teams prepare for the November 8 opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-mega-auction-south-africa-vs-india-t20i-series-aiden-markram-2629965-2024-11-07",
      "headline": "IPL auction not motivation for South Africa players in T20Is vs India: Aiden MakramSouth Africa vs India: Captain Aiden Markram said he would be happy if the Proteas stars performed well and attracted the attention of owners and scouts in the lead-up to the IPL mega auction. India and South Africa will play a 4-match T20I series, starting November 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pcb-india-uae-hybrid-model-2629941-2024-11-07",
      "headline": "India likely to play in UAE, PCB ready for Hybrid ModelThe Pakistan Cricket Board (PCB) said that it is ready to make changes to the schedule of the Champions Trophy to be held next year. India are likely to play their matches in Dubai or Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grand-masters-arjun-erigaisi-world-rankings-2629928-2024-11-07",
      "headline": "Arjun Erigaisi rises to World No. 2 in live ratings, only behind Magnus CarlsenArjun Erigaisi moved his way up to No.2 in the rankings after beating Alexey Sarana in the third round of the Chennai Grand Masters 2024 on Thursday, November 7, in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-sneh-rana-issy-wong-mumbai-indians-delhi-capitals-2629898-2024-11-07",
      "headline": "From Sneh Rana to Issy Wong: Top talking points from WPL RetentionsWPL 2025 Retention: The five teams participating in the upcoming edition of the WPL named their list of retained and released players. Gujarat Giants released two of their most senior players and will go into the auction with a purse of INR 4.40 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-france-squad-snubbed-nations-league-didier-deschamps-one-off-decision-2629897-2024-11-07",
      "headline": "Mbappe left out of France's Nations League squad by coach DeschampsFrance captain Kylian Mbappe was shockingly omitted from Didier Deschamps' squad for the upcoming UEFA Nations League matches against Italy and Israel, despite expressing eagerness to join, marking his fourth consecutive absence from the national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-mega-auction-james-anderson-register-reveals-reason-2629895-2024-11-07",
      "headline": "James Anderson reveals why he registered for IPL auction: 'I can still play' IPL 2025 mega auction: James Anderson, 42, expressed interest to feature in the Indian Premier League for the first time in his career. The former England pacer has registered for the auction at a base price of Rs 1.25 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-t20is-livestreaming-all-you-need-to-know-suryakumar-yadav-aiden-markram-2629864-2024-11-07",
      "headline": "South Africa vs India T20Is: Live Streaming, Schedule and all you need to knowIndia's T20I squad, led by Suryakumar Yadav, prepares for an intense four-match series against South Africa, starting November 8, aiming to extend their T20 dominance as both sides anticipate a rematch of the thrilling T20 World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-sneh-rana-issy-wong-mumbai-indians-delhi-capitals-2629898-2024-11-07",
      "headline": "From Sneh Rana to Issy Wong: Top talking points from WPL RetentionsWPL 2025 Retention: The five teams participating in the upcoming edition of the WPL named their list of retained and released players. Gujarat Giants released two of their most senior players and will go into the auction with a purse of INR 4.40 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-france-squad-snubbed-nations-league-didier-deschamps-one-off-decision-2629897-2024-11-07",
      "headline": "Mbappe left out of France's Nations League squad by coach DeschampsFrance captain Kylian Mbappe was shockingly omitted from Didier Deschamps' squad for the upcoming UEFA Nations League matches against Italy and Israel, despite expressing eagerness to join, marking his fourth consecutive absence from the national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-mega-auction-james-anderson-register-reveals-reason-2629895-2024-11-07",
      "headline": "James Anderson reveals why he registered for IPL auction: 'I can still play' IPL 2025 mega auction: James Anderson, 42, expressed interest to feature in the Indian Premier League for the first time in his career. The former England pacer has registered for the auction at a base price of Rs 1.25 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-t20is-livestreaming-all-you-need-to-know-suryakumar-yadav-aiden-markram-2629864-2024-11-07",
      "headline": "South Africa vs India T20Is: Live Streaming, Schedule and all you need to knowIndia's T20I squad, led by Suryakumar Yadav, prepares for an intense four-match series against South Africa, starting November 8, aiming to extend their T20 dominance as both sides anticipate a rematch of the thrilling T20 World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-new-management-team-sporting-beyond-social-media-statement-2629851-2024-11-07",
      "headline": "Virat Kohli announces new management team: 'They share my love for sport'India cricketer Virat Kohli announced his association with a new management team, Sporting Beyond. The superstar batter said the new team shares his love for the sport and his values of integrity and transparency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-suryakumar-yadav-test-comeback-will-happen-by-itself-border-gavaskar-trophy-2629802-2024-11-07",
      "headline": "Suryakumar not overthinking about Test comeback: Will happen by itselfSuryakumar Yadav expressed patience about his Test comeback, focusing on T20I responsibilities as India heads into their series against South Africa, while the Test squad prepares for the Border-Gavaskar Trophy clash with Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-retention-mumbai-indians-royal-challengers-bengaluru-delhi-capitals-2629746-2024-11-07",
      "headline": "WPL 2025 Retention Full List: MI release hat-trick hero, RCB retain winning sideWPL 2025 Retention: Mumbai Indians released England's Issy Wong, who holds the record for becoming the first bowler in the history of the tournament to take a hat-trick. Gujarat Giants released six players and have the highest purse. Royal Challengers Bengaluru also let go six players, incuding Nadine de Klerk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-champions-trophy-2025-schedule-pakistan-cricket-board-bcci-icc-2629791-2024-11-07",
      "headline": "ICC to release Champions Trophy 2025 schedule on November 11: ReportThe International Cricket Council (ICC) is likely to announce the schedule for the ICC Champions Trophy 2025 on November 11 as a special delegation is set to visit Lahore."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}