{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-2073-points-up-nifty-above-25700-adani-ports-gains-10-percent-nse-bse-rally-2862420-2026-02-03",
      "headline": "Sensex ends 2,000 points higher: Here's why the stock market jumped todayThe S&P BSE Sensex added 2,072.67 points to close at 83,739.13, while the NSE Nifty50 rallied 639.15 points to end at 25,727.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-and-silver-etfs-surge-again-after-three-day-slump-what-changed-today-2862386-2026-02-03",
      "headline": "Gold and silver ETFs surge again after three-day slump. What changed today?Gold and silver may stay volatile in the near term, but today's bounce shows investors are still willing to buy dips. Whether the recovery holds will depend on global cues and key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/where-to-invest-after-india-us-trade-deal-stock-market-portfolio-sector-benefit-trading-advice-2862330-2026-02-03",
      "headline": "Did you miss the India-US trade deal stock market rally? Here's what to doEarly signs of the rally were visible even before Indian markets opened. Gift Nifty jumped more than 700 points after the trade deal announcement, signalling a strong start for Dalal Street."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/commodities/story/india-us-trade-deal-crude-oil-import-changes-russia-venezuela-explained-2862295-2026-02-03",
      "headline": "India–US trade deal and the big oil question: What's changing for India?India became one of the largest buyers of discounted Russian crude after 2022, a trend that helped reduce its import bill. US President Donald Trump's announcement indicates that these purchases will eventually decline, but the immediate impact is expected to be limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-welcomed-by-experts-but-fine-print-matters-2862223-2026-02-03",
      "headline": "India–US trade deal announced, but why the fine print remains crucialUS President Donald Trump called the changes \"effective immediately\" on Truth Social, and Prime Minister Narendra Modi confirmed the development shortly afterward. Yet the absence of the actual agreement means much of the deal is being read between the lines rather than from a published document. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-gold-rates-today-india-rise-after-india-us-trade-deal-mcx-prices-outlook-2862220-2026-02-03",
      "headline": "Silver, gold rates today: Why prices are rising after recent crashOn the Multi Commodity Exchange, silver prices jumped sharply, while gold also posted strong gains in early trade. MCX silver was trading around Rs 2,53,792 per kg, up Rs 17,531 or 7.42% as of 10 am. MCX gold was near Rs 1,49,101 per 10 grams, higher by Rs 5,110 or 3.55%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-enterprises-reliance-jio-financials-bajaj-top-gainers-india-us-trade-deal-2862208-2026-02-03",
      "headline": "Adani Enterprises stock surges 10% on India–US trade deal. Check top gainersThe India–US trade deal has supercharged sentiment, lifting Adani stocks and other heavyweights sharply. Here's a look at the top gainers as markets rally hard after the landmark announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-us-trade-deal-what-it-means-for-share-market-sensex-nifty-rupee-gdp-economy-2862197-2026-02-03",
      "headline": "India-US trade deal: Why it's good news for Sensex, Nifty and the rupeeThe India–US trade deal lifts a long-standing weight off investors' shoulders, giving the Sensex, Nifty and the rupee a cleaner runway. With clarity finally restored, the market's next leg higher suddenly looks more believable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-nifty-rally-nse-bse-up-india-us-trade-deal-which-sector-gain-2862189-2026-02-03",
      "headline": "Sensex jumps 2,500 points: 3 reasons why the stock market is rising today?The S&P BSE Sensex jumped 2,271.45 points to 83,937.54, while the NSE Nifty50 climbed 691.70 points to 25,780.10 as of 9:28 am. The sharp rise came as investors reacted to clarity on the India-US trade agreement, which had remained delayed for months and was seen as a key reason behind recent market weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-did-india-really-commit-500-billion-budget-allocation-quetion-trump-modi-2862183-2026-02-03",
      "headline": "Did India really commit $500 billion to the US, or is the number just big talk?While US President Donald Trump laid out the figure in public, the Indian government has so far not specified what such a commitment involves, raising questions over its scale, timing and credibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-2300-points-higher-nifty-up-700-points-as-markets-react-to-india-us-trade-deal-2862180-2026-02-03",
      "headline": "Sensex jumps 2,300 points, Nifty surges as markets cheer India–US trade dealThe India–US trade deal has given the Sensex and Nifty their strongest tailwind in months, setting the stage for what could become a far more extended market surge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-trading-setup-stock-markets-today-open-higher-india-us-trade-deal-2862163-2026-02-03",
      "headline": "Sensex, Nifty today: Will stock market open higher on India-US trade deal?Early signals from the Gift Nifty point to a strong opening. Gift Nifty futures were trading at around 26,190 points at 8:26 am. This suggests that the Nifty 50 index could open nearly 4.5% higher than Monday's closing level of 25,088.4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/capital-gains-tax-on-share-buybacks-budget-2026-explained-good-for-small-investors-2862108-2026-02-03",
      "headline": "Capital gains tax on share buybacks is good for small investors. Here's whyThe government has shifted buyback taxation to a capital gains framework, while tightening rules for promoters who were seen as misusing buybacks as a tax-saving tool."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-finalised-pm-modi-trump-call-tariffs-cut-18-percent-2862114-2026-02-03",
      "headline": "US, India seal trade deal after PM-Trump call: 5 things that changed overnightInstead of leaving the details to official statements, US President Donald Trump chose to spell out the trade deal himself, framing it as a result of personal diplomacy and immediate action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-speaks-to-great-friend-pm-modi-announces-trade-deal-with-india-charge-tariffs-from-25-to-18-2862067-2026-02-02",
      "headline": "Trump announces India trade deal, cuts tariffs to 18% after call with PM ModiAlso shedding light on the much-awaited US-India trade deal, which had faced several roadblocks with New Delhi adamant about not opening its agriculture sector to Washington, Trump said that an agreement is finally on the cards. Trump said he lowered the reciprocal tariffs following discussions with PM Modi, describing the move as a gesture of \"friendship and respect.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-7-key-takeaways-for-individual-taxpayers-2861880-2026-02-02",
      "headline": "Budget 2026: 7 key takeaways for individual taxpayersThe Union Budget 2026 may not have changed income tax rates, but it brings several practical updates that affect how individuals file returns, disclose income and deal with compliance. From easier timelines to simpler rules, here are the key takeaways taxpayers should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/etf-investment-gone-wrong-silver-price-crash-gold-fall-what-investors-should-do-portfolio-down-2861873-2026-02-02",
      "headline": "Silver ETF takes a hit: Down Rs 2 lakh, what should investors do now?On the Multi Commodity Exchange (MCX), silver prices have dropped sharply from their record peak, while gold has also seen a strong correction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-slides-after-record-highs-drops-nearly-rs-17000-what-should-investors-do-2861840-2026-02-02",
      "headline": "Silver prices crash Rs 17,000 today. More correction ahead?After touching record highs in recent weeks, silver prices have cooled sharply. The metal has slipped by nearly Rs 17,000, prompting investors to pause and reassess whether this fall is a buying opportunity or a sign to stay cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-944-points-higher-nifty-above-25000-ril-up-nse-bse-rally-2861837-2026-02-02",
      "headline": "Sensex ends 944 points higher: Why stock market rose today?The S&P BSE Sensex rallied 943.52 points to close at 81,666.46, while the NSE Nifty50 added 262.95 points to end at 25,088.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-stronger-banks-to-easier-credit-who-stands-to-gain-from-budget-2026-2861797-2026-02-02",
      "headline": "From stronger banks to easier credit: Who stands to gain from Budget 2026?A key announcement in the Budget was the proposal to set up a High-Level Committee on Banking for Viksit Bharat. The committee will undertake a comprehensive review of the sector and suggest reforms to align it with India's next stage of economic growth."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-sai-pallavi-replacing-deepika-padukone-as-sum-80-in-kalki-2-makers-clarify-2862357-2026-02-03",
      "headline": "Is Sai Pallavi replacing Deepika Padukone as SUM-80 in Kalki 2? Makers clarify The makers of Kalki 2898 AD 2 have addressed speculations around Sai Pallavi replacing Deepika Padukone in the film. The film also features Prabhas, Amitabh Bachchan, and Kamal Haasan in key roles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mumbai-police-legal-action-unauthorized-drone-dhurandhar-2-fort-shoot-2862352-2026-02-03",
      "headline": "Mumbai Police register case against Dhurandhar 2 team over unauthorised drone use Mumbai Police have filed a case against the location manager of the film Dhurandhar 2 after the crew used a drone without proper authorisation in the high-security Fort area, leading to an FIR under Section 223 of the IPC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-will-take-time-to-get-over-120-bahadur-failure-mother-honey-irani-2862350-2026-02-03",
      "headline": "Farhan Akhtar will take time to get over 120 Bahadur failure: Mother Honey Irani Farhan Akhtar's mother, Honey Irani, talked about how he's coping with the box office failure of 120 Bahadur. She also commented on his plans to make Jee Le Zaraa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/medha-rana-border-2-shares-how-she-handles-trolls-varun-dhawan-simply-cant-please-everybody-2862346-2026-02-03",
      "headline": "Border 2 actor Medha Rana on online trolling: You simply can't please everybody In an exclusive interview with India Today, actor Medha Rana opened up about dealing with trolls and criticism, sharing that she leans on Varun Dhawan's advice to let her work speak louder than anything else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-recalls-telling-masaba-she-didnt-fit-the-hindi-film-heroine-image-2862335-2026-02-03",
      "headline": "Neena Gupta recalls telling Masaba she didn't fit the Hindi film heroine image Neena Gupta shared that daughter Masaba Gupta once aspired to be a traditional Bollywood heroine but was given an honest reality check about industry standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/is-dhurandhar-the-revenge-teaser-the-same-as-post-credit-scene-explained-2862324-2026-02-03",
      "headline": "Is Dhurandhar: The Revenge teaser same as 1st film's post-credit scene? Explained Dhurandhar: The Revenge teaser has sparked debate online, with fans pointing out that it's the same post-credit scene already seen in theatres and on OTT. But is there anything new?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-multiple-vanity-vans-end-credits-netflix-2862297-2026-02-03",
      "headline": "Did Dhurandhar's end credits confirm Ranveer Singh's multiple vanity vans? Dhurandhar's end credits have fans spotting multiple vans linked to Ranveer Singh. This discovery has sparked fresh debate over the actor's on-set arrangements and immersive acting style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/prince-narula-reveals-why-he-took-up-the-50-reality-show-reacts-to-mentor-row-2862292-2026-02-03",
      "headline": "Prince Narula reveals why he took up The 50, reacts to 'mentor' row Prince Narula, who is currently participating in The 50, opened up about his decision to participate in the reality show with his wife, Yuvika Chaudhary. He also reacted to several fans questioning his decision to participate in a show with contestants whom he had mentored at one point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/man-claiming-to-be-pakistani-says-dhurandhar-felt-nostalgic-not-anti-pakistan-2862283-2026-02-03",
      "headline": "Dhurandhar felt like a Pakistani made it: Social media user claiming to be from Pak A man claiming to be Pakistani has said that director Aditya Dhar's Dhurandhar felt nostalgic. He also praised the accuracy of Urdu and Karachi vibes in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lisa-ray-celebrates-25-years-of-kasoor-calls-it-a-turning-point-in-her-career-2862308-2026-02-03",
      "headline": "Lisa Ray celebrates 25 years of Kasoor, calls it a turning point in her career Lisa Ray celebrated 25 years of Kasoor, reflecting on how the film empowered her with a strong, emotionally complex role that defied Bollywood norms of the time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-box-office-collection-rs-281-crore-11-days-republic-day-growth-2862216-2026-02-03",
      "headline": "Border 2 box office Day 11: Sunny's film crosses Rs 280 crore mark despite Monday dip Sunny Deol's 'Border 2' has crossed Rs 281 crore at the box office in its first 11 days, maintaining robust earnings despite a notable decline on its second Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-honours-sanitation-worker-padma-for-honesty-returning-gold-ornaments-2862271-2026-02-03",
      "headline": "Rajinikanth honours frontline worker Padma, gifts her gold chain. See pics Actor Rajinikanth honoured Padma, a sanitation worker in Chennai, with a gold chain after she returned 45 sovereigns of lost gold, recognising her integrity and service. Photos of Rajinikanth with her family went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoors-ramayana-to-be-unveiled-on-ram-navami-at-gateway-of-india-report-2862294-2026-02-03",
      "headline": "Ranbir Kapoor's Ramayana to be unveiled on Ram Navami at Gateway of India: Report Ranbir Kapoor's Ramayana will unveil its first character looks at a grand Ram Navami event at Mumbai's Gateway of India, with cast and political leaders expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-the-revenge-teaser-ranveer-singh-back-hamza-with-more-gore-and-chaos-aditya-dhar-2862290-2026-02-03",
      "headline": "Dhurandhar 2 teaser: Ranveer Singh is back as Hamza with more gore and chaos Dhurandhar: The Revenge teaser promises Ranveer Singh in a darker, deadlier avatar. The spy-action thriller, sequel to Dhurandhar, is scheduled to release on March 19, 2026, in multiple Indian languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-day-2-highlights-prince-narula-admits-roadies-bias-rajat-dalal-digvijay-singh-clash-2862260-2026-02-03",
      "headline": "The 50 Day 2 highlights: Prince admits Roadies bias; Rajat Dalal, Digvijay clash The 50 turned explosive on Day 2 as Prince Narula admitted to favouring certain Roadies contestants. Meanwhile, Rajat Dalal and Digvijay Singh got into a violent altercation during the task, and Nikki Tamboli reignited her rivalry with Arya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-2-stream-on-jiohotstar-music-rights-change-hands-t-series-saregama-2862256-2026-02-03",
      "headline": "Dhurandhar 2: JioHotstar acquires streaming rights, music label changes JioHotstar has acquired the streaming rights for Ranveer Singh's 'Dhurandhar: The Revenge.' Other than OTT, there has been a shift in music labels as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kim-kardashian-lewis-hamilton-dating-rumours-paris-appearance-2862235-2026-02-03",
      "headline": "Kim Kardashian, Lewis Hamilton spark dating rumours with joint Paris arrival Kim Kardashian and Lewis Hamilton made a joint appearance in Paris, fuelling speculation about a potential romance as they were photographed arriving at a hotel following reports of a private getaway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-recalls-father-harivansh-rai-bachchan-in-a-poetic-note-on-life-and-struggle-2862229-2026-02-03",
      "headline": "Big B recalls father Harivansh Rai Bachchan in a poetic note on life and struggle Amitabh Bachchan shared a late-night reflective note on life and struggle, recalling words of wisdom from his father Harivansh Rai Bachchan and drawing parallels with poet Firaq Gorakhpuri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-reunite-nelson-dilipkumar-dark-comedy-46-years-2862207-2026-02-03",
      "headline": "Rajinikanth, Kamal Haasan's film to be directed by Nelson, promo shoot soon: Report Tamil cinema icons Rajinikanth and Kamal Haasan are set to join forces in a new project directed by Nelson Dilipkumar, with a special promotional shoot expected to commence in the coming week. An official announcement is expected."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chaos-lok-sabha-rahul-gandhi-barred-speaking-rule-violation-china-article-ex-army-chief-papers-yaar-2862361-2026-02-03",
      "headline": "Lok Sabha chaos as Rahul Gandhi speech stopped over ex-Army chief memoir mentionThe Lok Sabha witnessed chaos as Leader of Opposition Rahul Gandhi was stopped from continuing his speech on the President's address, sparking protests and heated exchanges. The incident highlighted tensions over parliamentary rules and India-China relations amid a sharp political confrontation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/heard-nothing-from-india-on-halting-russian-oil-buys-kremlin-on-trumps-us-india-trade-deal-remarks-2862423-2026-02-03",
      "headline": "Heard nothing from India on stopping oil buys: Russia on Trump trade deal commentsThe statement came a day after US President Donald Trump announced a trade deal with India that would result in the imposition of significantly reduced tariffs of 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-trump-tariffs-envoy-sergio-gor-role-2862363-2026-02-03",
      "headline": "The DJ who changed the tone: Sergio Gor and India-US resetSergio Gor took charge as US envoy on a chilly January 12 morning. His goal was to return the warmth that has shaped India-US ties for decades. And, he seems to have delivered within a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-what-is-this-yaar-lok-sabha-schools-mp-amid-lok-sabha-chaos-2862382-2026-02-03",
      "headline": "What is this yaar? Lok Sabha Chair raps Congress MPLok Sabha proceedings resumed today a stormy note, with tempers running high over Congress MP Rahul Gandhi's bid to cite excerpts from former Army chief General MM Naravane's unpublished memoir. \r\n\r\nAmid the din, Speaker Krishna Prasad Tenneti pulled up a member for using the word \"yaar\" during the heated exchange, reminding MPs to maintain parliamentary decorum. \r\n\r\nHe stressed that such expressions were unacceptable when addressing the Chair and urged members to confine their remarks to the discussion on the Motion of Thanks to the President's Address."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galwan-clash-rahul-gandhi-wrong-on-tanks-in-doklam-rechin-la-naravane-book-india-china-bhutan-border-2020-2862307-2026-02-03",
      "headline": "Why Rahul Gandhi is right about Doklam area and 2020, wrong about Doklam tanksHandcrafted ByOur Editors Leader of Opposition Rahul Gandhi cited an incident of \"four Chinese tanks advancing towards Indian positions\", saying it was at Doklam in 2020. He was referring to an article based on an unpublished book by ex-Army Chief Gen MM Naravane (Retd). While the Congress leader was correct about the year, when Doklam area also saw Chinese military advance as part of the broader tensions along the LAC, he was wrong about the location. The tank movement was at Rechin La, and not Doklam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-on-india-us-trade-deal-pm-modi-compromised-under-trump-pressure-epstein-files-link-2862364-2026-02-03",
      "headline": "PM is compromised, sold the nation: Rahul Gandhi's big charge on US trade dealRahul Gandhi hit out at the Central government over the US trade deal, claiming that the deal was signed under pressure from Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-2073-points-up-nifty-above-25700-adani-ports-gains-10-percent-nse-bse-rally-2862420-2026-02-03",
      "headline": "Sensex ends 2,000 points higher: Here's why the stock market jumped todayThe S&P BSE Sensex added 2,072.67 points to close at 83,739.13, while the NSE Nifty50 rallied 639.15 points to end at 25,727.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-tariffs-india-donald-trump-proof-sanctions-threat-canada-south-korea-agreement-2862299-2026-02-03",
      "headline": "Is Trump's US-India trade deal even Trump-proof?President Donald Trump announced that the US and India had agreed to a trade deal wherein tariffs on Indian exports to the US would drop from 50% to 18%. Is any agreement with the US even Trump-proof? Trump acts on whims and fancies, and countries like South Korea, the UK and Canada have seen that trade agreements don't mean much when it comes to sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-the-revenge-teaser-ranveer-singh-back-hamza-with-more-gore-and-chaos-aditya-dhar-2862290-2026-02-03",
      "headline": "Dhurandhar 2 teaser: Ranveer Singh is back as Hamza with more gore and chaosDhurandhar: The Revenge teaser promises Ranveer Singh in a darker, deadlier avatar. The spy-action thriller, sequel to Dhurandhar, is scheduled to release on March 19, 2026, in multiple Indian languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-budget-session-live-updates-lok-sabha-naravane-memoir-pm-modi-rahul-gandhi-2862184-2026-02-03",
      "headline": "Live: 8 'unruly' Opposition MPs suspended as Rahul Gandhi barred from speaking in Lok SabhaParliament Session Live Updates: The Lok Sabha resumed proceedings on Tuesday after Monday's session was disrupted over Rahul Gandhi's reference to the former Army Chief's unpublished memoir. Chaotic scenes were witnessed as BJP members, including Home Minister Amit Shah and Defence Minister Rajnath Singh, objected, arguing that only formally published material could be quoted in the House. Stay tuned to inditatoday.in to get all the latest updates on the Parliament session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/duty-free-still-out-of-reach-why-a-waived-cancer-drug-costs-rs-1-crore-2862379-2026-02-03",
      "headline": "Duty-free, still out of reach: Why a 'waived' cancer drug costs Rs 1 croreFor patients staring at a life-or-death choice, duty-free does not mean affordable—and hope remains priced like a luxury.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-compromise-on-farmers-interests-buying-venezuelan-oil-also-on-table-govt-sources-on-india-us-trade-deal-2862339-2026-02-03",
      "headline": "No compromise on farmers, will buy Venezuelan oil: Govt sources on US trade pactAfter a phone call with Prime Minister Narendra Modi on Monday, President Donald Trump announced that India and the US agreed to a trade deal under which Washington will cut reciprocal tariffs on Indian goods to 18 per cent from the current 25 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-how-pm-modi-got-trump-reduce-tariffs-2862286-2026-02-03",
      "headline": "No noise, no Nobel support: How PM got Trump to blink on tariffs and trade dealHandcrafted ByOur Editors Trump tariffs: PM Modi, without any confrontation or provocation, let patience do the heavy lifting. Eventually, the US's loudest dealmaker blinked, without PM Modi having to say a word or resorting to massaging Trump's ego."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-tariffs-donald-trump-change-of-heart-pm-modi-2862353-2026-02-03",
      "headline": "What's behind Trump's change of heart for India?Donald Trump's abrupt shift from tariff threats and sharp criticism of India to warm praise for Prime Minister Narendra Modi and a reduced-tariff trade deal has surprised diplomatic and trade circles. What's behind Trump's change of heart for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-bearded-beginning-the-rebels-roots-and-rationalist-roar-part-20-345-03-02-2026",
      "headline": "Time, Tide & Tamil Part 20 | Bearded Beginning: Rebel's Roots And Rationalist RoarI have not just been reading, researching, writing and speaking on Periyar from my early years, but in the process internalised and imbibed him impulsively, instinctively and now I fear, irrevocably. He has got under my skin and settled in my system so pervasively I almost feel I am growing a beard."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-lok-sabha-uproar-unpublished-former-general-naravane-memoir-india-china-border-rule-349-2862155-2026-02-03",
      "headline": "Ex-Army chief's memoir and Rule 349: Why Rahul Gandhi was stopped by SpeakerSpeaker Om Birla referred to Rule 349 to bar Rahul Gandhi from making any references to magazine article that quotes former Army Chief General MM Naravane's yet-to-be published book. But what exactly does Rule 349 entail?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/us-uk-women-are-being-secretly-filmed-with-smart-glasses-you-could-be-next-india-2862007-2026-02-03",
      "headline": "Women are being secretly filmed with smart glasses. You could be next!Women's safety has hit a new low, with technology designed for convenience now being turned into tools of harassment. Case in point: smart glasses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-us-trade-deal-live-updates-trump-slash-tariffs-18-percent-glbs-2862099-2026-02-02",
      "headline": "Live: PM agreed to Trump's terms under pressure, says Rahul Gandhi on trade dealIndia-US Trade Deal Live Updates: US President Donald Trump has announced a cut in tariffs on Indian goods from 25 per cent to 18 per cent after speaking with Prime Minister Narendra Modi, signalling an easing of strained ties. PM Modi welcomed the move, saying \"Made in India\" products would now face lower tariffs and thanked Trump for the decision. The US President said the cut followed PM's request and reflected friendship and respect. Trump also said a long-pending India-US trade deal is now close, despite earlier disagreements, especially over agriculture. He added that PM had agreed to reduce purchases of Russian oil and shift imports towards the US and Venezuela. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/stanford-university-meal-plan-controversy-students-pretend-to-be-jain-to-skip-usd-7944-fees-2862190-2026-02-03",
      "headline": "Stanford students fake Jain beliefs to dodge mandatory meal plan, says studentStanford University faces scrutiny after unverified claims emerged that some students allegedly misuse Jain dietary exemptions to evade the school's costly mandatory meal plans. The allegations have sparked an online debate over religious accommodations, student trust, and the rising cost of campus dining at elite universities.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/balochistan-unrest-suicide-attacks-women-asifa-mengal-trend-female-bla-fighters-bombers-fidayee-2861989-2026-02-03",
      "headline": "Why Baloch women are taking up arms, raining death on Pak forcesBaloch women fighters played a key role in the BLA's recent coordinated attacks across Balochistan. The involvement of women in the Baloch armed movement is part of the broader trend. After peaceful protests over enforced disappearances and exploitations failed, with men jailed or killed, the once-silent Baloch women are picking up arms, and even turning suicide bombers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/niagra-falls-frozen-extreme-winter-polar-vortex-arctic-temperatures-climate-change-winter-2026-usa-canada-india-2862270-2026-02-03",
      "headline": "Why has Niagara Falls frozen? Breathtaking ice cliffs take overTourists braved sub-zero temperatures to witness partially frozen cascades, ice-encrusted trees, and misty vapours creating an otherworldly scene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/boss-asks-gen-z-employee-to-come-to-office-for-online-meeting-their-reply-is-viral-2862238-2026-02-03",
      "headline": "Boss asks Gen Z employee to come to office for online meeting, reply goes viralA Gen Z employee refused to appear at the office at 6:30 am for a virtual meeting despite their boss's strict warning. Their response to the boss's threat went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-likely-to-hear-bengal-sir-plea-tomorrow-mamata-banerjee-to-appear-eci-2862320-2026-02-03",
      "headline": "Mamata Banerjee may appear before Supreme Court tomorrow if SIR case is listedWest Bengal Chief Minister Mamata Banerjee is set to appear before the Supreme Court to challenge the Special Intensive Revision of electoral rolls in the state. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/whatsapp-meta-data-privacy-market-dominance-abuse-nclat-penalty-supreme-court-2862269-2026-02-03",
      "headline": "Can't play with India's right to privacy, Supreme Court warns WhatsApp, MetaThe Supreme Court has issued a strong warning to WhatsApp and Meta against sharing user data for commercial gains and voiced concern that privacy policies drafted by tech giants are \"so cleverly worded that ordinary citizens cannot grasp\" their real consequences."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-trolls-pakistan-over-t20-world-cup-stand-waiting-for-their-u-turn-2861957-2026-02-03",
      "headline": "Gavaskar trolls Pakistan over T20 World Cup stand: Waiting for their U-turn T20 World Cup: Legendary Sunil Gavaskar has trolled Pakistan over their stand of boycotting India in the T20 World Cup 2026. Gavaskar said that he is awaiting a U-turn that Pakistani players are infamously known for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-pakistan-boycott-threat-india-match-icc-sanctions-2862045-2026-02-03",
      "headline": "T20 World Cup boycott row: What Pakistan risks by forfeiting India match T20 World Cup 2026: Pakistan could face severe sanctions if it goes ahead and forfeits their match against India. While Pakistan has confirmed participation in the tournament, its refusal to face India in Sri Lanka has opened the door to possible ICC sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-eliminator-delhi-capitals-vs-gujarat-giants-preview-livestreaming-tv-channel-2862310-2026-02-03",
      "headline": "WPL 2026 Eliminator: Gujarat chase first final against Jemimah's Capitals Delhi Capitals and Gujarat Giants collide in a do-or-die WPL 2026 Eliminator in Vadodara. With a final spot at stake, recent thrillers suggest another nerve-shredding finish awaits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-injury-not-playing-world-cup-2862289-2026-02-03",
      "headline": "Tests over T20? Cummins says he did not want to risk himself for World Cup Australia fast bowler Pat Cummins has broken his silence on missing the T20 World Cup. Cummins has explained why he did not want to risk himself in the world tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-karim-benzema-saudi-pro-league-controversy-al-nassr-pif-al-hilal-transfer-favouritism-2862273-2026-02-03",
      "headline": "Karim Benzema joins Al Hilal: How the transfer caused a Ronaldo riot in Saudi Benzema's move to Al-Hilal and Ronaldo's protest have exposed cracks in Saudi football's power balance. What began as squad building has spiralled into a league-wide debate on fairness, control and ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-womens-team-wpl-kasi-viswanathan-2862261-2026-02-03",
      "headline": "CSK in WPL? Team to start investing in women's cricket, reveals CEO Chennai Super Kings are set to invest in women's cricket, confirmed the team's CEO Kasi Viswanathan. Till now, CSK has stayed away from investing in women's cricket despite the advent of the WPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-squad-pakistan-2862185-2026-02-03",
      "headline": "Despite thrashing vs Pakistan, Ponting backs Australia to reach top 4 in T20 WC T20 World Cup: Former cricketer Ricky Ponting has backed Australia to reach the semi-final of the T20 World Cup. Ponting has shown confidence in the side, despite the team getting battered by Pakistan in the 3-match T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ishan-kishan-rohit-sharma-viral-video-2-sloggers-india-vs-new-zealand-2862172-2026-02-03",
      "headline": "Watch: Ishan Kishan cracks up revisiting old viral clip with Rohit Sharma Ishan Kishan burst into laughter revisiting an old viral clip with Rohit Sharma, joking about how three missed matches turned into two lost years. The throwback landed just as his red-hot form reignited his T20 World Cup push."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-suryakumar-yadav-comeback-timely-rise-india-vs-new-zealand-2862149-2026-02-03",
      "headline": "Sky turns blue again: Suryakumar Yadav's timely rise ahead of T20 World Cup India's T20I captain Suryakumar Yadav was enduring horrendous form in the lead-up to the upcoming T20 World Cup 2026. However, just 1 month ahead of the tournament, the sky has turned blue once again for the India skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-fancode-media-broadcast-partner-beats-jio-hotstar-bidding-war-2862129-2026-02-03",
      "headline": "ISL picks FanCode over JioHotstar: Value drops from Rs 1.68 cr to Rs 9.5 lakh FanCode has announced as the new broadcast partner of the Indian Super League after beating JioStar in the bidding war. The deal finally clears the way for the delayed ISL season to restart on February 14.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-vs-india-boycott-full-drama-no-logic-harbhajan-singh-reacts-2862127-2026-02-03",
      "headline": "Pakistan pulling off a drama with India boycott in T20 World Cup: HarbhajanHarbhajan Singh has torn into Pakistan's India-match boycott call, calling it staged drama. The former spinner challenged the PCB to hold its nerve and avoid another familiar U-turn at the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-al-nassr-vs-al-riyadh-saudi-pro-league-pif-controversy-strike-karim-benzema-2862126-2026-02-03",
      "headline": "Why did Ronaldo not play in Al Nassr vs Al Riyadh? Controversy explainedCristiano Ronaldo's unexplained absence from Al Nassr's league clash has ignited strike rumours and exposed growing tensions behind the scenes. At stake is not fitness, but power, ambition, and his future in Saudi football itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-chaudhary-clears-usman-tariq-bowling-action-controversy-australia-series-2862087-2026-02-02",
      "headline": "Legal or illegal? Indian umpire gives verdict on Usman Tariq's bowling actionFormer umpire Anil Chaudhary has declared Usman Tariq's bowling action legal after scrutiny in the Australia series. The decision comes amid debates sparked by Cameron Green's on-field gestures and previous suspicions in the Pakistan Super League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-recall-kamindu-mendis-drop-dhananjaya-de-silva-t20-world-cup-2026-2862078-2026-02-02",
      "headline": "Sri Lanka back Kamindu Mendis for T20 World Cup, Dhananjaya de Silva dropped from squadSri Lanka have recalled Kamindu Mendis to their T20 World Cup squad despite his modest returns in the format, while the co-hosts have opted to leave out veteran all-rounder Dhananjaya de Silva."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usa-t20-world-cup-2026-warm-up-india-a-tilak-varma-retun-n-jagadeesan-century-2862062-2026-02-02",
      "headline": "USA send T20 World Cup warning with strong show against India A in warm-up gameUSA delivered a strong performance against India A in the T20 World Cup 2026 warm-up match. Tilak Varma's fitness return and Ravi Bishnoi's performance were the major positives for India in the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-kerala-cricket-association-investigates-inflated-water-prices-thiruvananthapuram-t20i-2862047-2026-02-02",
      "headline": "IND vs NZ: KCA acts on inflated water prices during Thiruvananthapuram T20IKerala Cricket Association has launched an investigation into inflated water prices for fans during the India vs New Zealand fifth T20I in Thiruvananthapuram. Several videos and posts circulating on social media showed spectators being charged above the permitted rates at certain sections of the Greenfield International stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-2026-australia-vs-england-semi-final-preview-2862018-2026-02-02",
      "headline": "AUS vs ENG, U19 World Cup semi-final Live Streaming: When and where to watchU19 World Cup: Australia and England are all set to face each other in the first semi-final of the tournament on Tuesday, February 3 in Bulawayo. Both teams are unbeaten, having won all their five matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-withdraws-rotterdam-open-after-australian-open-win-2862017-2026-02-02",
      "headline": "Carlos Alcaraz withdraws from Rotterdam Open hours after maiden Australian Open titleCarlos Alcaraz withdrew from the ABN AMRO Open in Rotterdam on Monday, just hours after clinching his maiden Australian Open title. The Spaniard, who lifted the trophy at the ATP 500 event last season, will not return to defend his crown at the indoor hard-court tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-t20-world-cup-boycott-revenue-loss-icc-broadcasters-2862002-2026-02-02",
      "headline": "No India-Pakistan game in T20 World Cup may cause USD 250 million losses to ICCNo India-Pakistan match in the T20 World Cup 2026, scheduled to be played in Colombo, could cause significant financial losses to ICC to the tune of USD 250 million, according to estimates. The Pakistan government has asked its team not to participate in the India fixture but play the entire tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mustafizur-ipl-ouster-t20-world-cup-turmoil-ex-icc-official-2862001-2026-02-02",
      "headline": "BCCI's handling of Mustafizur saga sparked T20 World Cup crisis: ex-ICC officialFormer International Cricket Council (ICC) Head of Communications Sami-ul-Hasan Burney on Monday said the BCCI could have avoided the current T20 World Cup turmoil by handling Bangladesh pacer Mustafizur Rahman's IPL exit with greater discretion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-wicketkeeper-nafay-stumping-controversy-third-t20i-australia-2862000-2026-02-02",
      "headline": "Umpiring blunder? Pakistan keeper makes foolish stumping error, but gets luckyPakistan wicketkeeper Khawaja Nafay made a controversial stumping to dismiss Cooper Connolly off Mohammad Nawaz. On Sunday, Pakistan beat Australia by 111 runs to sweep the T20I series 3-0."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-injury-comeback-scores-38-india-a-usa-t20-world-cup-warm-up-2861983-2026-02-02",
      "headline": "T20 World Cup warm-up: Tilak Varma's brisk 38 sparks hopes of swift comebackTilak Varma returned to competitive cricket after recovering from an abdominal injury. His strong performance raises hopes for India in the upcoming T20 World Cup but sparks selection challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/meg-lanning-return-wpl-2027-after-tough-up-warriorz-season-2861970-2026-02-02",
      "headline": "Meg Lanning, fuelled with fire, confirms WPL 2027 return after horror seasonMeg Lanning has confirmed her return to the Women's Premier League in 2027 after a difficult season with UP Warriorz. Her comeback signals a strong desire to compete and lead despite recent challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mary-kom-apology-ex-husband-remarks-controversy-2861969-2026-02-02",
      "headline": "Mary Kom apologises for 'didn't earn a single rupee' dig at ex-husband OnlerIndian boxing icon Mary Kom has issued a public apology after her remarks about ex-husband K Onler Kom on a television chat show sparked backlash on social media. The comments were made during an emotional discussion about her personal life and have kept the six-time world champion in the spotlight in recent weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mohsin-naqvi-troublemaker-india-boycott-icc-asia-cup-controversy-2861798-2026-02-02",
      "headline": "Is Mohsin Naqvi now cricket's troublemaker-in-chief?From handshake rows to World Cup boycotts, Mohsin Naqvi has kept cricket on edge. His confrontations with India have turned administration into spectacle, dragging the game into politics instead of letting it breathe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-team-leaves-for-sri-lanka-icc-t20-world-cup-boycott-india-match-2861935-2026-02-02",
      "headline": "Pakistan travel to Sri Lanka for T20 World Cup 2026 amid India boycott stancePakistan cricket team has left for Sri Lanka to participate in the ICC T20 World Cup 2026 after their government denied them permission to play against India. This boycott raises concerns from the ICC and may affect Pakistan's cricketing future globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/parthiv-patel-criticises-pakistan-slow-chase-u19-world-cup-india-2861933-2026-02-02",
      "headline": "Suspicious or just strange? Parthiv Patel baffled by Pakistan U19's tactics vs IndiaU19 World Cup: Parthiv Patel said that he was surprised with Pakistan's approach and their lack of intent to qualify for the semis when they played in the Super 6 clash against India on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-boycott-india-icc-punishment-ehsan-mani-2861928-2026-02-02",
      "headline": "ICC can't punish Pakistan for boycotting India at T20 World Cup: Ex-chairmanFormer International Cricket Council chairman Ehsan Mani has said the ICC cannot punish Pakistan for boycotting its marquee ICC Men's T20 World Cup group-stage match against India, arguing that the decision was taken on government instructions and therefore leaves little scope for sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-breaks-kohli-t20i-fifty-record-pakistan-whitewash-australia-3-0-2861876-2026-02-02",
      "headline": "Babar Azam breaks Virat Kohli's record, bounces back to form ahead of T20 World CupBabar Azam broke Virat Kohli's record for most T20I fifties as Pakistan dominated Australia in a 3-0 series whitewash. Pakistan have warmed up in style for the upcoming T20 World Cup by defeating Australia."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}