{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-54-points-higher-nifty-above-25100-eternal-rises-1-percent-2787372-2025-09-15",
      "headline": "Sensex opens 54 points higher, Nifty above 25,100; Eternal rises 1%The S&P BSE Sensex was up by 57.17 points to 81,961.87, while the NSE Nifty50 added 5.35 points to 25,119.35 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-allotment-check-status-gmp-listing-date-profit-shares-rise-market-debut-2787348-2025-09-15",
      "headline": "Urban Company IPO allotment out today: Check status as GMP jumps ahead of debutUrban Comapny IPO allotment follows a strong response, with bidding exceeding 100 times during the three-day subscription period from September 10 to 12, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-20-reforms-big-win-for-every-citizen-finance-minister-nirmala-sitharaman-2787197-2025-09-14",
      "headline": "Tax reforms for rising Bharat: GST 2.0 big win for citizens, says Nirmala SitharamanThe Union Finance Minister said that GST reforms will be implemented much ahead of Prime Minister Narendra Modi's instructions of launching them before Deepavali festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-collection-day-3-teja-sajja-film-nears-rs-50-crore-solid-first-weekend-in-india-2787387-2025-09-15",
      "headline": "Mirai box office Day 3: Teja Sajja film nears Rs 50 crore after solid 1st weekendTeja Sajja's 'Mirai' made a strong impact at the Indian box office during its first weekend. The fantasy action adventure is poised to cross the Rs 50 crore nett mark, showcasing rising audience interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/john-oliver-emmy-speech-censored-twice-during-live-broadcast-2787380-2025-09-15",
      "headline": "John Oliver's Emmy speech censored twice during live broadcastJohn Oliver was censored twice during his short, 15-second Emmy acceptance speech on live TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jake-gyllenhaal-surprises-youngest-emmy-nominee-owen-cooper-lucky-duck-gift-2787360-2025-09-15",
      "headline": "Owen Cooper overjoyed as Jake Gyllenhaal surprises him before Emmys 2025Jake Gyllenhaal surprised 15-year-old actor Owen Cooper before the 2025 Emmys. Cooper, the youngest ever nominee for Outstanding Supporting Actor in a Limited Series or Movie, received a special gift from his \"number one\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stephen-graham-signs-off-emmy-speech-with-namaste-after-adolescence-win-2787365-2025-09-15",
      "headline": "Stephen Graham signs off Emmy speech with a Namaste after Adolescence winStephen Graham, actor and co-creator of 'Adolescence', signed off his thank-you speech with \"Namaste\" after winning Best Lead Actor in a Limited or Anthology Series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/stephen-colbert-wins-best-talk-series-at-emmys-2025-2-months-after-cancellation-2787361-2025-09-15",
      "headline": "Anyone hiring, Stephen Colbert quips, gets standing ovation for Talk Series EmmyStephen Colbert signed off with laughs and tears at the 77th Emmys as 'The Late Show' finally scores its first Emmy after ten years. Even with the show's curtain call looming, Colbert promises one last joyride, celebrating a decade of sharp wit, real talk, and unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/noah-wyle-wins-lead-actor-emmy-for-the-pitt-britt-lower-takes-best-drama-actress-prize-for-severance-2787353-2025-09-15",
      "headline": "Emmys 2025: Noah Wyle wins Best Actor for The Pitt, Britt Lower for SeveranceNoah Wyle won Outstanding Lead Actor in a Drama Series for his performance in 'The Pitt', while Britt Lower bagged Outstanding Lead Actress in a Drama Series for her role in 'Severance'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-second-runner-up-tiff-2025-neeraj-ghaywan-indian-film-2787343-2025-09-15",
      "headline": "Homebound is 2nd runner-up at Toronto Film fest, director Neeraj Ghaywan thrilledDirector Neeraj Ghaywan's 'Homebound' secured second runner-up in the International People's Choice category at TIFF 2025. The film received a standing ovation at its North American premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/go-birds-free-palestine-hannah-einbinder-fiery-emmy-moment-2787334-2025-09-15",
      "headline": "Go Birds, f*** ICE, free Palestine: Hannah Einbinder's fiery Emmy momentAt the Emmy Awards 2025, actor Hannah Einbinder used her win to spotlight Gaza and immigrant rights in the US. Read her full speech highlights here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/emmy-awards-2025-red-carpet-sydney-sweeney-pedro-pascal-adam-brody-red-ca-2787333-2025-09-15",
      "headline": "Emmy Awards 2025: Sydney Sweeney, Pedro Pascal and more dazzle on the red carpetThe 77th Emmy Awards brought together television's biggest stars for a night filled with excitement, nervous anticipation, and major wins. Held at the Peacock Theater in Los Angeles, the evening blended glamour, celebration, and a few history-making moments as stars from the year's most popular shows took centre stage. Here are the top moments from Emmy 2025's red carpet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/owen-cooper-15-makes-history-as-youngest-male-actor-to-win-emmy-for-role-in-adolescence-2787329-2025-09-15",
      "headline": "Owen Cooper, 15, makes history as youngest male actor to win EmmyAt just 15, Owen Cooper became the youngest male acting winner in Emmy history with his Adolescence role. Here's a look at other young Emmy record-holders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmys-awards-2025-the-studio-severance-dominate-first-wins-2787324-2025-09-15",
      "headline": "Emmy Awards 2025: The Studio dominates with 11 wins, Adolescence takes 6The 77th Primetime Emmy Awards kicked off with Apple TV+ frontrunners 'The Studio' and 'Adolescence' leading the charge. Check the winners here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/77th-primetime-emmy-awards-live-updates-severance-the-penguin-the-white-lotus-2787278-2025-09-14",
      "headline": "Emmys 2025 Live: Noah Wyle's The Pitt wins Outstanding Drama Series77th Emmy Awards: The 2025 Primetime Emmy Awards, celebrating the best of American TV, are happening in Los Angeles on September 15 (IST). This year, HBO Max's 'The Pitt' and Netflix's 'Adolescence' are ruling the list. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/morgan-wallen-dedicates-song-to-late-charlie-kirks-family-at-edmonton-concert-glbs-2787309-2025-09-15",
      "headline": "Morgan Wallen dedicates song to late Charlie Kirk's family at Edmonton concertCountry singer Morgan Wallen paid tribute to Erika Kirk, widow of activist Charlie Kirk, during his Edmonton concert, dedicating a song just days after the tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-double-eviction-nagma-mirajkar-natalia-janoszek-exit-wild-card-entries-2787279-2025-09-14",
      "headline": "Bigg Boss 19: Nagma Mirajkar, Natalia Janoszek out in first double evictionBigg Boss 19 sees its first elimination this season as Nagma Mirajkar and Natalia Janoszek leave the house in a double eviction. After their  new wild-card entries are expected in the Bigg Boss house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-asks-fans-send-love-charlie-kirk-family-2787234-2025-09-14",
      "headline": "Coldplay's Chris Martin asks fans to send love to Charlie Kirk's familyColdplay's Chris Martin paid tribute to Charlie Kirk at Wembley after the conservative activist was shot dead during an event in Utah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/liam-hemsworth-gabriella-brooks-get-engaged-after-6-years-dating-2787224-2025-09-14",
      "headline": "Liam Hemsworth, Gabriella Brooks get engaged after 6 years of dating'The Witcher' star Liam Hemsworth is engaged to model Gabriella Brooks. The couple, together since 2019, confirmed it with an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cocktail-2-shahid-kapoor-rashmika-mandanna-kriti-sanon-start-shoot-2787207-2025-09-14",
      "headline": "Cocktail 2: Shahid Kapoor, Rashmika Mandanna, Kriti Sanon start shootShahid Kapoor shared a selfie on Instagram to announce 'Cocktail 2' shooting with Kriti Sanon and Rashmika Mandanna, sparking excitement for the highly anticipated sequel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-reacts-india-vs-pakistan-clash-cannot-blame-cricketers-playing-2787194-2025-09-14",
      "headline": "Suniel Shetty reacts to India vs Pakistan clash:  Cannot blame cricketers for playingSuniel Shetty urged fairness towards cricketers amid boycott calls for India-Pakistan Asia Cup clash in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/o-romeo-vishal-bharadwaj-film-shahid-kapoor-triptii-dimri-valentine-day-2026-2787160-2025-09-14",
      "headline": "O' Romeo: Vishal Bharadwaj's film with Shahid, Triptii set for Valentine's 2026Vishal Bhardwaj's upcoming film starring Shahid Kapoor and Triptii Dimri is titled 'O'Romeo. The film has finally got a release date. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-suryakumar-yadav-handshake-salman-agha-2787310-2025-09-15",
      "headline": "Beyond the scorecard: How Suryakumar Yadav's handshake snub stung PakistanAsia Cup 2025, IND vs PAK: Suryakumar Yadav's handshake snub set the tone, his bold statements amplified it, and Pakistan's decision to skip the post-match ceremony underlined just how deeply they were stung. India's commanding display, coupled with their skipper's defiance, delivered a double blow to Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/chandramouli-nagamallaiah-texas-beheading-donald-trump-reacts-illegal-cuban-immigrant-2787325-2025-09-15",
      "headline": "Time for being soft on illegal immigrants over: Trump on Indian man's beheadingIn a strongly worded statement on his Truth Social platform, Donald Trump said Chandra Nagamallaiah was \"brutally beheaded\" by an \"illegal alien from Cuba who should never have been in our country\". He described the victim as a \"well respected person in Dallas\" and promised that the accused would be prosecuted to the fullest extent of the law."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-russia-strategic-partnership-grows-despite-us-tariffs-2787283-2025-09-14",
      "headline": "Attempts to break India-Russia ties destined to fail: Moscow amid Trump pressureThe Russian Foreign Ministry praised India for standing firm against constant pressure from the US and Nato to stop purchasing oil from Russia, and for continuing its commitments despite threats, warning that any attempt to disturb the ties is \"destined to fail.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/telangana-heavy-rain-floods-hyderabad-roads-three-missing-in-parsigutta-and-nampally-drains-2787368-2025-09-15",
      "headline": "Hyderabad roads turn into rivers, traffic crawls amid heavy rain; 3 missingHeavy rain lashed Hyderabad, flooding roads and disrupting traffic on Sunday night. Several were reported missing, prompting a major search. Siddipet recorded 245.5 mm of rain while several Hyderabad localities crossed 120 mm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/stephen-colbert-wins-best-talk-series-at-emmys-2025-2-months-after-cancellation-2787361-2025-09-15",
      "headline": "Anyone hiring, Stephen Colbert quips, gets standing ovation for Talk Series EmmyStephen Colbert signed off with laughs and tears at the 77th Emmys as 'The Late Show' finally scores its first Emmy after ten years. Even with the show's curtain call looming, Colbert promises one last joyride, celebrating a decade of sharp wit, real talk, and unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-act-supreme-court-interim-order-three-key-issues-validity-2787332-2025-09-15",
      "headline": "Supreme Court's interim order on validity of Waqf Act today. The case so farOn May 22, a bench led by Chief Justice of India BR Gavai reserved the interim order after hearing arguments from the two sides -- lawyers appearing for those challenging the amended waqf law, and Solicitor General Tushar Mehta, representing the Centre -- for three straight days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-national-anthem-controversy-2787337-2025-09-15",
      "headline": "Asia Cup: DJ plays 'Jalebi Baby' instead of Pak national anthem, video is viralPakistan players and fans were left baffled after the DJ at the Dubai International Stadium played jalebi baby instead of the country's national anthem. This is the not the first time that a goof-up like this happened in an international event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-monorail-breaks-down-again-17-rescued-weeks-after-last-major-glitch-2787373-2025-09-15",
      "headline": "Mumbai Monorail breaks down again, 17 rescued weeks after last major glitchAccording to the Mumbai Metropolitan Region Development Authority (MMRDA), 17 passengers were evacuated safely at 7.45 am after the train stopped mid-ride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-suryakumar-journalist-handshake-snub-dubai-2787305-2025-09-15",
      "headline": "Few things bigger than sportsman spirit: Suryakumar defends handshake snubAsia Cup 2025: India captain Suryakumar Yadav defended his decision not to shake hands with Pakistan players during their group-stage match in Dubai. He was responding to a journalist who asked whether refusing the gesture was against sportsman's spirit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maoist-commander-with-rs-1-crore-bounty-2-others-killed-in-encounter-with-forces-in-jharkhand-2787362-2025-09-15",
      "headline": "Maoist commander with Rs 1 crore bounty, 2 others killed in encounter in JharkhandA top CPI (Maoist) commander carrying a Rs 1 crore bounty and two other senior rebels were killed in a joint security operation in Jharkhand's Hazaribagh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/be-very-careful-donald-trump-warns-israel-days-after-doha-strike-glbs-2787331-2025-09-15",
      "headline": "Qatar a great US ally, Israel has to be very careful: Trump after Doha strikesPresident Donald Trump sent a clear message to Israel and warned it to be \"very careful\" about how it handles Qatar. The Republican leader also called Qatar \"a great ally\" of the United States.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/owen-cooper-15-makes-history-as-youngest-male-actor-to-win-emmy-for-role-in-adolescence-2787329-2025-09-15",
      "headline": "Owen Cooper, 15, makes history as youngest male actor to win EmmyAt just 15, Owen Cooper became the youngest male acting winner in Emmy history with his Adolescence role. Here's a look at other young Emmy record-holders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/finance-ministry-official-navjot-singh-killed-wife-critical-after-bmw-hits-their-bike-in-delhi-2787284-2025-09-14",
      "headline": "Finance ministry official killed, wife critical after BMW hits their bike in DelhiThe finance ministry official and his wife were returning home after visiting Bangla Sahib Gurdwara when their bike was hit by a BMW."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-woman-beats-husband-with-slippers-outside-court-says-he-gave-triple-talaq-2787347-2025-09-15",
      "headline": "UP woman beats husband with slippers outside court, says he gave triple talaqThe woman assaulted her husband with slippers after he abused and beat her outside a court in UP's Rampur. The video of the incident later went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2024-gen-z-and-the-new-terms-of-engagement-2786447-2025-09-12",
      "headline": "From the India Today archives (2024) | Gen Z and the new terms of engagementThey overturned power in Bangladesh last year and have just pulled off a reset in Nepal. How Generation Z thinks and works"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/emmy-awards-2025-red-carpet-sydney-sweeney-pedro-pascal-adam-brody-red-ca-2787333-2025-09-15",
      "headline": "Emmy Awards 2025: Sydney Sweeney, Pedro Pascal and more dazzle on the red carpetThe 77th Emmy Awards brought together television's biggest stars for a night filled with excitement, nervous anticipation, and major wins. Held at the Peacock Theater in Los Angeles, the evening blended glamour, celebration, and a few history-making moments as stars from the year's most popular shows took centre stage. Here are the top moments from Emmy 2025's red carpet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-skips-post-match-ceremony-after-india-captain-handshake-snub-2787286-2025-09-15",
      "headline": "After handshake snub, Pakistan captain skips post-match presentation ceremonyAsia Cup 2025: Pakistan captain Salman Agha skipped the post-match presentation following his team's loss to India in Dubai on Sunday, after Indian captain Suryakumar Yadav avoided the customary pre-match handshake."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/techie-at-tcs-refuses-to-resign-shares-ordeal-in-viral-reddit-post-2787184-2025-09-14",
      "headline": "Techie at TCS refuses to resign, shares ordeal in viral postA TCS techie recounted in a now viral Reddit post how the company's HR department pressured him to resign. Despite threats of a bad review, he said he chose to stay strong and not quit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ready-to-impose-more-sanctions-on-russia-but-eu-needs-to-toughen-up-their-sanctions-trump-glbs-2787321-2025-09-15",
      "headline": "Ready to impose sanctions on Russia, but EU needs to toughen up their sanctions: TrumpUnited States President Donald Trump has asserted that he is willing to impose more sanctions on Russia, but Europe has to act in a way that is commensurate with what Washington is doing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-second-runner-up-tiff-2025-neeraj-ghaywan-indian-film-2787343-2025-09-15",
      "headline": "Homebound is 2nd runner-up at Toronto Film fest, director Neeraj Ghaywan thrilledDirector Neeraj Ghaywan's 'Homebound' secured second runner-up in the International People's Choice category at TIFF 2025. The film received a standing ovation at its North American premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/from-solar-lamps-to-machine-tools-two-aurangabad-engineers-shaping-lives-2786869-2025-09-15",
      "headline": "From solar lamps to machine tools: Two engineers changing lives in AurangabadOn Engineer's Day, the journeys of Aurangabad's Deepti Korde and Mayur Hiwarkar stand out. From building enterprises with limited means to creating jobs and empowering communities, their work shows how engineering is not only about machines and technology but also about solving everyday problems and building possibilities for others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmys-awards-2025-the-studio-severance-dominate-first-wins-2787324-2025-09-15",
      "headline": "Emmy Awards 2025: The Studio dominates with 11 wins, Adolescence takes 6The 77th Primetime Emmy Awards kicked off with Apple TV+ frontrunners 'The Studio' and 'Adolescence' leading the charge. Check the winners here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/britain-will-never-surrender-to-far-right-protesters-who-use-flag-as-cover-for-violence-says-keir-starmer-2787221-2025-09-14",
      "headline": "Won't surrender to far-right protesters: Keir Starmer on anti-immigration rallyPrime Minister Keir Starmer said the English flag \"represents our diverse country,\" adding that he would not tolerate citizens being targeted for their \"background or the colour of their skin.\""
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-harbhajan-singh-national-celebration-2787370-2025-09-15",
      "headline": "Every time India beats Pakistan, a moment of national celebration: Harbhajan SinghIndia secured a commanding victory over Pakistan in the Asia Cup 2025 match in Dubai. The win highlighted the strength of India's young players and their spin attack amidst political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-asia-cup-india-vs-pakistan-2787356-2025-09-15",
      "headline": "Kuldeep Yadav, the predator who got more lethal without his partnerKuldeep Yadav delivered a stunning bowling performance against Pakistan in the Asia Cup. His lethal spin once again showed what India miss when they do not carry him in the playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-suryakumar-yadav-handshake-salman-agha-2787310-2025-09-15",
      "headline": "Beyond the scorecard: How Suryakumar Yadav's handshake snub stung PakistanAsia Cup 2025, IND vs PAK: Suryakumar Yadav's handshake snub set the tone, his bold statements amplified it, and Pakistan's decision to skip the post-match ceremony underlined just how deeply they were stung. India's commanding display, coupled with their skipper's defiance, delivered a double blow to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-national-anthem-controversy-2787337-2025-09-15",
      "headline": "Asia Cup: DJ plays 'Jalebi Baby' instead of Pak national anthem, video is viralPakistan players and fans were left baffled after the DJ at the Dubai International Stadium played jalebi baby instead of the country's national anthem. This is the not the first time that a goof-up like this happened in an international event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-sunil-gavaskar-india-aggressive-t20-approach-template-win-pakistan-2787336-2025-09-15",
      "headline": "Asia Cup 2025: Gavaskar hails India's ultra-aggressive template after win vs PakistanSunil Gavaskar praised India's attacking cricket approach after their commanding Asia Cup win over Pakistan. The victory signals a new aggressive template for India's T20 strategy and sends a strong message to cricketing rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-3-pole-vault-steeplechase-long-jump-2787330-2025-09-15",
      "headline": "World Athletics Day 3 schedule: How and what to watch on September 15The World Athletics Championships moves into day 3 with key finals including men's pole vault and women's steeplechase. While Parul Chaudhary (women's 3000m steeplechase) failed to make the final, all eyes will be on Murali Sreeshankar (men's long jump) later on Monday. Here's how you can watch the Day 3 action live in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-3-live-results-parul-chaudhary-mondo-duplantis-2787327-2025-09-15",
      "headline": "Day 3 Live: Parul finishes 9th, photo-finish in men's marathonWorld Athletics Championships Day 3 Live Updates: India's Parul Chaudhary is in action in her women's 3000m steeplechase event. Later in the day, Mondo Duplantis is set to take the stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-absent-india-refuses-handshake-asia-cup-2025-2787306-2025-09-15",
      "headline": "Why did Salman Agha skip post-match presentation vs India? Pakistan coach revealsPakistan captain Salman Agha did not attend the post-match presentation after India refused to shake hands. The incident highlighted ongoing tensions amid the Asia Cup 2025 clash in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-on-indias-win-over-pakistan-in-asia-cup-2025-2787311-2025-09-15",
      "headline": "India sent a message to entire world with dominant win over Pakistan: GavaskarLegendary batter Sunil Gavaskar has said that India are making a strong statement for the rest of the cricketing world with their back-to-back resounding victories in the Asia Cup 2025. India hammered Pakistan by seven wickets in their second fixture of the continental tournament and continued their dominance over arch-rivals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/harbhajan-singh-calls-pakistan-clueless-india-vs-pakistan-asia-cup-2025-2787307-2025-09-15",
      "headline": "India showed how to play T20, clueless Pakistan no match for us: Harbhajan SinghFormer India spinner Harbhajan Singh feels Pakistan is no match for India after their crushing seven-wicket defeat against the Men in Blue in the Asia Cup 2025. India chased down the target of 129 in 15.5 overs against the arch-rivals and dedicated their resounding victory to the victims of the Pahalgam terrorist attack and the Indian armed forces,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-suryakumar-journalist-handshake-snub-dubai-2787305-2025-09-15",
      "headline": "Few things bigger than sportsman spirit: Suryakumar defends handshake snubAsia Cup 2025: India captain Suryakumar Yadav defended his decision not to shake hands with Pakistan players during their group-stage match in Dubai. He was responding to a journalist who asked whether refusing the gesture was against sportsman's spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-3-live-results-parul-chaudhary-mondo-duplantis-2787327-2025-09-15",
      "headline": "Day 3 Live: Parul finishes 9th, photo-finish in men's marathonWorld Athletics Championships Day 3 Live Updates: India's Parul Chaudhary is in action in her women's 3000m steeplechase event. Later in the day, Mondo Duplantis is set to take the stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-absent-india-refuses-handshake-asia-cup-2025-2787306-2025-09-15",
      "headline": "Why did Salman Agha skip post-match presentation vs India? Pakistan coach revealsPakistan captain Salman Agha did not attend the post-match presentation after India refused to shake hands. The incident highlighted ongoing tensions amid the Asia Cup 2025 clash in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-on-indias-win-over-pakistan-in-asia-cup-2025-2787311-2025-09-15",
      "headline": "India sent a message to entire world with dominant win over Pakistan: GavaskarLegendary batter Sunil Gavaskar has said that India are making a strong statement for the rest of the cricketing world with their back-to-back resounding victories in the Asia Cup 2025. India hammered Pakistan by seven wickets in their second fixture of the continental tournament and continued their dominance over arch-rivals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/harbhajan-singh-calls-pakistan-clueless-india-vs-pakistan-asia-cup-2025-2787307-2025-09-15",
      "headline": "India showed how to play T20, clueless Pakistan no match for us: Harbhajan SinghFormer India spinner Harbhajan Singh feels Pakistan is no match for India after their crushing seven-wicket defeat against the Men in Blue in the Asia Cup 2025. India chased down the target of 129 in 15.5 overs against the arch-rivals and dedicated their resounding victory to the victims of the Pahalgam terrorist attack and the Indian armed forces,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-suryakumar-journalist-handshake-snub-dubai-2787305-2025-09-15",
      "headline": "Few things bigger than sportsman spirit: Suryakumar defends handshake snubAsia Cup 2025: India captain Suryakumar Yadav defended his decision not to shake hands with Pakistan players during their group-stage match in Dubai. He was responding to a journalist who asked whether refusing the gesture was against sportsman's spirit."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}