{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-hurting-us-economy-jobs-inflation-data-explained-2765799-2025-08-04",
      "headline": "Is Donald Trump's tariff blitz killing the American Dream?With inflation rising and global backlash mounting, data suggests Trump's tariff blitz is straining the American economy, casting doubt on his promise to 'make it great again'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-160-points-higher-nifty-above-24600-bel-up-1-2765783-2025-08-04",
      "headline": "Sensex opens 160 points higher, Nifty above 24,600; BEL up 1%The S&P BSE Sensex added 229.73 points to 80,829.64, while the NSE Nifty50 rose 81.55 points to 24,646.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-price-band-rs-139-147-details-august-7-opening-date-rs-3600-crore-2765781-2025-08-04",
      "headline": "JSW Cement IPO price band announced. Check other detailsJSW Cement's IPO includes a fresh issue of 10.88 crore shares worth Rs 1,600 crore and an offer for sale of 13.61 crore shares worth Rs 2,000 crore. The company had initially aimed to raise Rs 4,000 crore, but later reduced the issue size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-august-meeting-rate-cut-decision-us-tariff-worry-inflation-july-governor-sanjay-malhotra-2765771-2025-08-04",
      "headline": "RBI MPC begins today: Will US tariffs trigger a rate cut?The RBI's August MPC is meeting after cutting interest rates by 100 basis points across its last three policy meetings. The policy stance has remained 'neutral'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-allotment-today-out-check-your-status-gmp-listing-date-august-6-gains-expected-profit-2765763-2025-08-04",
      "headline": "NSDL IPO allotment today: Check your status, GMP and listing dateInvestors who applied for NSDL shares can check their allotment status either on the BSE website or the website of the registrar, MUFG Intime India Private Limited (Link Intime)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-for-wedding-why-borrowing-for-the-big-day-needs-rethinking-wedding-budget-planning-wedding-loan-interest-rates-2765508-2025-08-03",
      "headline": "Personal loan for wedding? Why borrowing for the big day needs rethinkingA wedding is a beautiful milestone, but is it worth starting your new life under a mountain of debt? With the rising trend of using personal loans to fund lavish celebrations, it's time to rethink the cost of saying \"I do.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-donald-trump-25-percent-tariff-pressure-tactic-farm-dairy-2765184-2025-08-02",
      "headline": "Explained: Why India shouldn't lose sleep over Trump's 25% tariffsIndia shouldn't trade its future for short-term calm. Trump's tariff move is more noise than policy. Staying firm now will protect India's strength and choices in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-he-may-consider-giving-tariff-revenue-dividends-to-citizens-2765106-2025-08-02",
      "headline": "May consider dividends to citizens: Trump on tariff revenue disbursal plansTrump has signed a new executive order that imposes fresh import tariffs on goods from 69 countries and the European Union, which will come into effect on August 7."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/loan-fraud-case-ed-issues-lookout-notice-against-anil-ambani-2764968-2025-08-01",
      "headline": "Loan fraud case: ED issues lookout notice against Anil AmbaniA lookout circular has been issued against Anil Ambani at the request of the Enforcement Directorate (ED), preventing him from travelling abroad without court permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vandana-vasudevan-on-how-tech-is-reshaping-daily-life-2764868-2025-08-01",
      "headline": "Vandana Vasudevan on how tech is reshaping daily lifeSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan explains how this shift is changing daily routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/otp-please-the-double-edged-sword-of-digital-living-vandana-vasudevan-2764846-2025-08-01",
      "headline": "OTP Please! The double-edged sword of digital living: Vandana VasudevanSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan tells how tech has changed how we live, making travel easier for the disabled, food more accessible, and work more flexible. But she warns of fading community bonds, unhealthy habits, and insecure gig jobs. Tech must support life, not replace human connection."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reaches-hyderabad-with-daughter-malti-for-ssmb-29-shoot-amid-strike-2765782-2025-08-04",
      "headline": "Priyanka Chopra reaches Hyderabad with daughter Malti for SSMB 29 shoot amid strikePriyanka Chopra has returned to Hyderabad with her daughter to join the shoot of SS Rajamouli's upcoming film 'SSMB 29' starring Mahesh Babu. Meanwhile, the Telugu Film Industry Employees' Federation has called for a strike from August 4, halting film shoots over wage hike demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chief-of-war-review-emotionally-enriching-raw-storytelling-on-war-jason-mamoa-show-2765721-2025-08-04",
      "headline": "Chief of War review: Emotionally enriching and raw storytelling on war, destructionRelease Date:Fri Aug 01, 2025Chief of War review: 'Chief of War', available for streaming on Apple TV + is backed by actor Jason Mamoa. Is the epic-drama series worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-playful-request-to-wife-gauri-khan-after-national-film-award-win-jawan-brag-about-me-2765767-2025-08-04",
      "headline": "Brag about me to me: SRK's playful request to wife Gauri after National Award winShah Rukh Khan's maiden National Award for Best Actor for 'Jawan' has sparked joyous family celebrations marked by heartfelt and witty exchanges on social media. He playfully asked his wife, Gauri Khan, to 'brag about him' at family dinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/adoor-gopalakrishnan-remark-women-sc-st-filmmakers-controversy-kerala-film-event-2765766-2025-08-04",
      "headline": "Adoor Gopalakrishnan's remark on women, SC filmmakers gets minister's counterLegendary filmmaker Adoor Gopalakrishnan stirred a row by saying that the Rs 1.5 crore funding being provided by Kerala to women directors could lead to corruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tollywood-strike-halts-film-shootings-employees-demand-30-percent-pay-hike-2765760-2025-08-04",
      "headline": "Telugu film shootings halted due to workers' strike demanding salary hikeFilm productions in the Telugu industry came to a halt from Monday, August 4. Telugu film workers called for a strike as employees demanded a 30 per cent pay rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-shashi-tharoor-national-award-win-witty-reply-2765741-2025-08-04",
      "headline": "SRK does a Shashi Tharoor while thanking politician for his National Award winShah Rukh Khan's National Award win for 'Jawan' prompted a witty exchange with Shashi Tharoor. This was SRK's first-ever National Award in 33 years of acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/loni-anderson-wkrp-in-cincinnati-star-dies-at-79-after-prolonged-illness-glbs-2765734-2025-08-04",
      "headline": "TV icon Loni Anderson dies at 79 after prolonged illnessLoni Anderson, beloved WKRP in Cincinnati star, died at 79 in Los Angeles after a long illness. She was known for her Emmy-nominated role and Hollywood legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhanush-slams-ai-version-of-raanjhanaa-says-stripped-the-film-of-its-very-soul-2765727-2025-08-04",
      "headline": "Dhanush slams AI version of Raanjhanaa, says 'stripped the film of its very soul'Dhanush criticised the unauthorised AI-altered re-release of Raanjhanaa and said the new ending removed the soul of the film and was released despite his objections, raising serious concerns about the use of artificial intelligence in creative work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mahavatar-narasimha-continues-unstoppable-run-mints-rs-50-crore-in-hindi-2765657-2025-08-03",
      "headline": "Mahavatar Narasimha continues unstoppable run, mints Rs 50 crore in HindiFilmmaker Ashwin Kumar's 'Mahavatar Narsimha', an animated film, is continuing to engage audiences in theatres despite stiff competition. The film hit the Rs 50 crore-mark nett in Hindi on its second Saturday at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ramayana-limited-artificial-intelligence-series-2765643-2025-08-03",
      "headline": "Not just 2-part film, Ramayana is now available as an AI series'Ramayana' is being remade into a limited series using Artificial Intelligence (AI). The trailer for the series was released a few days ago and the first episode is now available for viewing. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-on-beauty-treatments-easy-to-judge-people-in-media-glare-2765642-2025-08-03",
      "headline": "Tamannaah on beauty procedures: Easy to judge people in media glareActor Tamannaah Bhatia opened up about beauty treatments amongst celebrities in the Indian film industry. In a conversation with The Lallantop, she said it is very easy to talk about people who are in the media glare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-33-years-in-cinema-thank-you-note-thanks-family-director-critics-2765652-2025-08-03",
      "headline": "Your harshest words sharpen me: Ajith Kumar to critics after 33 years in cinemaAjith Kumar marks 33 years in the film industry with gratitude and resilience. He shares insights on overcoming challenges in cinema and motor racing while thanking fans and family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-addresses-abdul-razzaq-marriage-rumours-media-speculation-2765602-2025-08-03",
      "headline": "Tamannaah Bhatia reacts to wedding rumours with Pak cricketer Abdul RazzaqActor Tamannaah Bhatia addressed marriage rumours with Pakistani cricketer Abdul Razzaq that made headlines in 2020. She said that the Internet got them married for a brief time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-actor-aneet-padda-linkedin-profile-garners-praise-from-fans-looks-like-one-of-us-2765583-2025-08-03",
      "headline": "Looks like one of us: Aneet Padda's LinkedIn profile garners praise from fansSocial media users came across the LinkedIn profile of actor Aneet Padda as her film 'Saiyaara' breaks records at the box office. The profile reveals that Padda studied Political Science at Delhi University's Jesus and Mary College. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-househelp-missing-minors-mumbai-police-search-vakola-disappearance-2765580-2025-08-03",
      "headline": "Ankita Lokhande appeals to public after house-help's daughter goes missingActor Ankita Lokhande appealed for help after her house-help's daughter and friend disappeared. She stated that an FIR has been registered by the Mumbai police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-on-aaj-ki-raat-fame-mothers-tell-me-toddlers-eat-listening-to-the-song-2765561-2025-08-03",
      "headline": "Tamannaah on Aaj Ki Raat's fame: Mothers tell me toddlers eat listening to the songActor Tammannah Bhatia talked about the recognition that came with her hit dance number 'Aaj Ki Raat' from 'Stree 2'. She said in an exclusive with The Lallantop that several mothers told her that their child would eat food only if they heard the song.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-praises-dhadak-2-social-issues-mainstream-cinema-raj-kapoor-bimal-roy-2765562-2025-08-03",
      "headline": "Dhadak 2 is punch in the gut, Raj Kapoor, Bimal Roy used to do this: Anurag KashyapAnurag Kashyap likend 'Dhadak 2' to films by Raj Kapoor and Bimal Roy, highlighting its social relevance in an Instagram post. He appreciated the cast and crew of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-flags-fake-instagram-profile-impersonating-her-cook-dilip-warns-action-2765520-2025-08-03",
      "headline": "Farah Khan flags fake Instagram profile impersonating her cook Dilip, warns actionFilmmaker Farah Khan, on Sunday, issued a warning against a fake Instagram account impersonating her cook Dilip. The account falsely claimed to be a blogger and used Khan's name.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-box-office-collection-33-crore-three-days-2765529-2025-08-03",
      "headline": "Kingdom box office Day 3: Vijay Deverakonda's film sees mild recovery on SaturdayActor Vijay Deverakonda's film 'Kingdom' crossed Rs 30 crore nett in India in three days. The film features a star-studded cast and is directed by Gowtam Tinnanuri of 'Jersey' fame."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/not-acceptable-top-trump-aide-accuses-india-of-financing-russias-war-in-ukraine-glbs-2765714-2025-08-04",
      "headline": "Not acceptable: Top Trump aide accuses India of financing Russia's war in UkraineStephen Miller, one of Trump's most influential advisors, said that Trump clearly believes India should stop buying oil from Russia. He stated that it is not acceptable for India to continue financing the war by purchasing Russian oil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-balasore-student-self-immolation-suicide-arrested-abvp-police-case-2765768-2025-08-04",
      "headline": "ABVP leader among two arrested in Odisha student's self-immolation caseABVP Odisha joint secretary and another person have been arrested in connection with the self-immolation of a 20-year-old student after her college failed to act on her sexual harassment complaint against a teacher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-politician-kamal-haasan-neet-education-weapon-to-break-shackles-dictatorship-sanatan-2765800-2025-08-04",
      "headline": "Education only weapon to break shackles of dictatorship, Sanatan: Kamal HassanActor and Makkal Needhi Maiam chief Kamal Haasan called education the only weapon to break the shackles of dictatorship and Sanatan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-day-5-drama-all-four-results-possible-weather-2765709-2025-08-04",
      "headline": "Final day, final Test: England need 35, India 4 wickets and 4 results possibleEngland vs India: England need just 35 runs, India only four wickets, and as this unforgettable five-Test saga builds towards its crescendo, all four outcomes — win, loss, draw, or tie — remain tantalisingly on the table. A dramatic finale awaits, fitting for a series that has defied logic and thrilled at every turn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-shashi-tharoor-national-award-win-witty-reply-2765741-2025-08-04",
      "headline": "SRK does a Shashi Tharoor while thanking politician for his National Award winShah Rukh Khan's National Award win for 'Jawan' prompted a witty exchange with Shashi Tharoor. This was SRK's first-ever National Award in 33 years of acting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-mamata-banerjee-delhi-police-called-bengali-bangladeshi-language-bjp-retorts-2765695-2025-08-03",
      "headline": "Trinamool claims Delhi Police called Bengali a Bangladeshi language, BJP retortsWest Bengal Chief Minister Mamata Banerjee shared a letter written by the Lodhi Colony Police Station and was addressed to the Banga Bhawan in Delhi with the subject line reading, \"Translation of documents containing text written in Bangladeshi language\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shashi-tharoor-missing-virat-kohli-in-england-2765703-2025-08-03",
      "headline": "Shashi Tharoor missing Virat Kohli in England: Too late to call him out of retirement?Congress MP Shashi Tharoor said that he's missing Virat Kohli in the ongoing Test series in England after India's poor bowling performance on Day 4 of the fifth Test at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-congress-rahul-gandhi-gaurav-gogoi-president-bjp-himanta-biswa-sarma-vidhan-sabha-election-2026-2765595-2025-08-04",
      "headline": "Can Rahul's Babbar Sher Gaurav Gogoi win Assam from Himanta?By bringing in Gaurav Gogoi as its Assam unit president, the Congress is planning to put up a big fight against the BJP in the 2026 Assembly polls. Will the plan, with a definite Rahul Gandhi imprint, help the Congress win Assam from Himanta Biswa Sarma and BJP, or will it be just fireworks with little gain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/adoor-gopalakrishnan-remark-women-sc-st-filmmakers-controversy-kerala-film-event-2765766-2025-08-04",
      "headline": "Adoor Gopalakrishnan's remark on women, SC filmmakers gets minister's counterLegendary filmmaker Adoor Gopalakrishnan stirred a row by saying that the Rs 1.5 crore funding being provided by Kerala to women directors could lead to corruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-august-meeting-rate-cut-decision-us-tariff-worry-inflation-july-governor-sanjay-malhotra-2765771-2025-08-04",
      "headline": "RBI MPC begins today: Will US tariffs trigger a rate cut?The RBI's August MPC is meeting after cutting interest rates by 100 basis points across its last three policy meetings. The policy stance has remained 'neutral'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mukhtar-ansaris-son-umar-ansari-arrested-for-forging-document-to-claim-fathers-property-in-uttar-pradesh-2765761-2025-08-04",
      "headline": "Mukhtar Ansari's son arrested for forging document to claim father's propertyUmar Ansari, son of late gangster-turned-politician Mukhtar Ansari, allegedly submitted forged documents bearing fake signatures of his absconding mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-weather-report-london-rain-prediction-2765762-2025-08-04",
      "headline": "Oval Test Day 5 weather report: Will rain be the villain in London drama?The England vs India Test series reached a dramatic pause on Day 4 at the Oval with rain and bad light halting play early. The weather forecast for Day 5 suggests rain to be on the horizon, adding uncertainty to the thrilling series finale."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/fuel-trucks-enter-gaza-first-time-five-months-israel-chokes-food-aid-supply-2765743-2025-08-04",
      "headline": "Fuel trucks enter Gaza for first time in 5 months as Israel chokes aid supplyThe relaxation by Israel came amid reports of fuel shortages hindering operations of hospitals and fears of an emerging famine in Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tollywood-strike-halts-film-shootings-employees-demand-30-percent-pay-hike-2765760-2025-08-04",
      "headline": "Telugu film shootings halted due to workers' strike demanding salary hikeFilm productions in the Telugu industry came to a halt from Monday, August 4. Telugu film workers called for a strike as employees demanded a 30 per cent pay rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/68-migrants-die-boat-sinks-off-yemen-coast-dangerous-migration-route-glbs-2765719-2025-08-04",
      "headline": "68 refugees and migrants die as boat sinks off Yemen, dozens missingSeventy-four people remain missing after a boat carrying 154 passengers sank off Yemen's coast in the Arabian Sea. Local media reported that rescue teams continue to search for bodies and any possible survivors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-playful-request-to-wife-gauri-khan-after-national-film-award-win-jawan-brag-about-me-2765767-2025-08-04",
      "headline": "Brag about me to me: SRK's playful request to wife Gauri after National Award winShah Rukh Khan's maiden National Award for Best Actor for 'Jawan' has sparked joyous family celebrations marked by heartfelt and witty exchanges on social media. He playfully asked his wife, Gauri Khan, to 'brag about him' at family dinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-conditions-heavy-roller-ollie-pope-shubman-gill-2765798-2025-08-04",
      "headline": "Curious case of the heavy roller: How it can affect Day 5 of the Oval TestThe Oval Test is set for a tense final day with England needing 35 runs and India requiring four wickets. The use of the heavy roller could influence the pitch, adding intrigue to the match's outcome."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-man-killed-genitals-cut-off-body-dumped-in-dam-over-witchcraft-suspicion-2765738-2025-08-04",
      "headline": "Odisha man killed, genitals cut off, body dumped in dam over witchcraft suspicionThe villagers allegedly throttled the man to death, cut off his private part and dumped the body in the nearby Harabhangi Dam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-bedminster-golf-club-civilian-plane-violates-tfr-zone-norad-fighter-jets-flares-airspace-incursion-2765754-2025-08-04",
      "headline": "Fighter jets scrambled as plane breaches no-fly zone over Trump's golf clubMilitary jets scrambled to intercept the civilian plane and used flares to alert the pilot, who was then escorted out of the area. It was the second such incursion on Sunday and one of five unauthorised entries into the restricted airspace over the weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/a-healing-touch-for-the-terror-stricken-in-jk-2765651-2025-08-03",
      "headline": "A healing touch for the terror-stricken in J&KLieutenant governor Manoj Sinha launches a mission to bring relief to thousands of families left broken by terrorism\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhanush-slams-ai-version-of-raanjhanaa-says-stripped-the-film-of-its-very-soul-2765727-2025-08-04",
      "headline": "Dhanush slams AI version of Raanjhanaa, says 'stripped the film of its very soul'Dhanush criticised the unauthorised AI-altered re-release of Raanjhanaa and said the new ending removed the soul of the film and was released despite his objections, raising serious concerns about the use of artificial intelligence in creative work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-woman-lover-arrested-after-family-of-four-to-die-by-suicide-2765742-2025-08-04",
      "headline": "Woman, lover arrested after family of four to die by suicide in Madhya PradeshFour members of a family, Manohar Lodhi (45), his mother Phoolrani (70), daughter Shivani (18) and his 16-year-old son, died by suicide on the night of July 25-26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/just-ending-5-wars-trump-repeats-india-pak-ceasefire-claim-despite-new-delhis-fact-check-glbs-2765731-2025-08-04",
      "headline": "Trump repeats India-Pakistan ceasefire claim despite New Delhi's fact-checkUS President Donald Trump again claims credit for mediating five conflicts, including the India-Pakistan ceasefire. However, India denies any third-party role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reaches-hyderabad-with-daughter-malti-for-ssmb-29-shoot-amid-strike-2765782-2025-08-04",
      "headline": "Priyanka Chopra reaches Hyderabad with daughter Malti for SSMB 29 shoot amid strikePriyanka Chopra has returned to Hyderabad with her daughter to join the shoot of SS Rajamouli's upcoming film 'SSMB 29' starring Mahesh Babu. Meanwhile, the Telugu Film Industry Employees' Federation has called for a strike from August 4, halting film shoots over wage hike demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chief-of-war-review-emotionally-enriching-raw-storytelling-on-war-jason-mamoa-show-2765721-2025-08-04",
      "headline": "Chief of War review: Emotionally enriching and raw storytelling on war, destructionRelease Date:Fri Aug 01, 2025Chief of War review: 'Chief of War', available for streaming on Apple TV + is backed by actor Jason Mamoa. Is the epic-drama series worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-playful-request-to-wife-gauri-khan-after-national-film-award-win-jawan-brag-about-me-2765767-2025-08-04",
      "headline": "Brag about me to me: SRK's playful request to wife Gauri after National Award winShah Rukh Khan's maiden National Award for Best Actor for 'Jawan' has sparked joyous family celebrations marked by heartfelt and witty exchanges on social media. He playfully asked his wife, Gauri Khan, to 'brag about him' at family dinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tollywood-strike-halts-film-shootings-employees-demand-30-percent-pay-hike-2765760-2025-08-04",
      "headline": "Telugu film shootings halted due to workers' strike demanding salary hikeFilm productions in the Telugu industry came to a halt from Monday, August 4. Telugu film workers called for a strike as employees demanded a 30 per cent pay rise."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-conditions-heavy-roller-ollie-pope-shubman-gill-2765798-2025-08-04",
      "headline": "Curious case of the heavy roller: How it can affect Day 5 of the Oval TestThe Oval Test is set for a tense final day with England needing 35 runs and India requiring four wickets. The use of the heavy roller could influence the pitch, adding intrigue to the match's outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-5-weather-report-london-rain-prediction-2765762-2025-08-04",
      "headline": "Oval Test Day 5 weather report: Will rain be the villain in London drama?The England vs India Test series reached a dramatic pause on Day 4 at the Oval with rain and bad light halting play early. The weather forecast for Day 5 suggests rain to be on the horizon, adding uncertainty to the thrilling series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-chris-woakes-injured-batting-joe-root-2765744-2025-08-04",
      "headline": "Like Rishabh Pant, Chris Woakes ready to put his body on the line: Joe RootInjured seamer Chris Woakes will bat if needed on the final day of the fifth Test match of the series, said Joe Root. Woakes, who was injured on Day 1 of the 5th Test, was believed to be out of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-calls-mohammed-siraj-a-real-warrior-2765712-2025-08-04",
      "headline": "Mohammed Siraj is a real warrior, he gives his everything for India: Joe RootStar England batter Joe Root hailed Mohammed Siraj for his lion-hearted bowling performance in the ongoing fifth Test against England at the Oval and called him a true warrior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-day-5-drama-all-four-results-possible-weather-2765709-2025-08-04",
      "headline": "Final day, final Test: England need 35, India 4 wickets and 4 results possibleEngland vs India: England need just 35 runs, India only four wickets, and as this unforgettable five-Test saga builds towards its crescendo, all four outcomes — win, loss, draw, or tie — remain tantalisingly on the table. A dramatic finale awaits, fitting for a series that has defied logic and thrilled at every turn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-bowling-coach-morne-morkel-praises-mohammed-siraj-leader-oval-test-2765711-2025-08-04",
      "headline": "Recognition of Siraj thrills bowling coach Morkel: His actions drive the groupIndia's bowling coach Morne Morkel said he was pleased that natural leader Mohammed Siraj was finally receiving the recognition he deserves, praising the pacer's unwavering commitment and consistency throughout the five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-4-stumps-rain-lazy-decision-debate-2765710-2025-08-03",
      "headline": "Lazy decision? Early stumps on Day 4 of Oval Test sparks debateOval Test: Play was called off early on Day 4 due to bad light and a passing shower. England needed 35 runs and India were pushing for four more wickets when wet weather pushed the fifth and final Test into Day 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-prasidh-krishna-india-fightback-england-final-test-oval-2765708-2025-08-03",
      "headline": "Tired legs, aching body: Prasidh Krishna and Mohammed Siraj defy odds at OvalMohammed Siraj and Prasidh Krishna delivered exceptional bowling spells to revive India's chances in the final Test at The Oval. Their resilience sparked a thrilling comeback, stirring hope amid tough odds and intense pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shashi-tharoor-missing-virat-kohli-in-england-2765703-2025-08-03",
      "headline": "Shashi Tharoor missing Virat Kohli in England: Too late to call him out of retirement?Congress MP Shashi Tharoor said that he's missing Virat Kohli in the ongoing Test series in England after India's poor bowling performance on Day 4 of the fifth Test at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-day-4-cliffhanger-score-2765700-2025-08-03",
      "headline": "Oval Test cliffhanger fittingly heads into Day 5 with series still on the lineThe Oval Test between India and England extends to a dramatic fifth day after rain played spoilsport in a thrilling final session on Sunday. England need 35 runs to break Indian hearts and win the series 3-1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-surpasses-kumar-sangakkara-with-39th-test-century-2765690-2025-08-03",
      "headline": "ENG vs IND: Joe Root surpasses Kumar Sangakkara with 39th Test century at OvalStar England batter Joe Root surpassed Kumar Sangakkara with his 39th Test century on Day 4 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-4-stumps-rain-lazy-decision-debate-2765710-2025-08-03",
      "headline": "Lazy decision? Early stumps on Day 4 of Oval Test sparks debateOval Test: Play was called off early on Day 4 due to bad light and a passing shower. England needed 35 runs and India were pushing for four more wickets when wet weather pushed the fifth and final Test into Day 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-prasidh-krishna-india-fightback-england-final-test-oval-2765708-2025-08-03",
      "headline": "Tired legs, aching body: Prasidh Krishna and Mohammed Siraj defy odds at OvalMohammed Siraj and Prasidh Krishna delivered exceptional bowling spells to revive India's chances in the final Test at The Oval. Their resilience sparked a thrilling comeback, stirring hope amid tough odds and intense pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shashi-tharoor-missing-virat-kohli-in-england-2765703-2025-08-03",
      "headline": "Shashi Tharoor missing Virat Kohli in England: Too late to call him out of retirement?Congress MP Shashi Tharoor said that he's missing Virat Kohli in the ongoing Test series in England after India's poor bowling performance on Day 4 of the fifth Test at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-day-4-cliffhanger-score-2765700-2025-08-03",
      "headline": "Oval Test cliffhanger fittingly heads into Day 5 with series still on the lineThe Oval Test between India and England extends to a dramatic fifth day after rain played spoilsport in a thrilling final session on Sunday. England need 35 runs to break Indian hearts and win the series 3-1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-surpasses-kumar-sangakkara-with-39th-test-century-2765690-2025-08-03",
      "headline": "ENG vs IND: Joe Root surpasses Kumar Sangakkara with 39th Test century at OvalStar England batter Joe Root surpassed Kumar Sangakkara with his 39th Test century on Day 4 of the fifth Test against England at the Oval."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}