{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-meeting-expectations-today-ipo-investment-fpis-reforms-min-amount-stock-market-dalal-street-2786234-2025-09-12",
      "headline": "Sebi meeting today: What can stock market investors expect from meeting?The Securities and Exchange Board of India (Sebi) is expected to approve a set of reforms that aim to make the market more attractive for businesses and investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armanis-will-outlines-gradual-sale-or-ipo-of-fashion-empire-2786214-2025-09-12",
      "headline": "Giorgio Armani's will outlines gradual sale or IPO of fashion empireThe late Giorgio Armani has left behind more than just a fashion empire. His will reveals a carefully crafted plan for the future of his company. Here's what it says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-highs-3-key-reasons-behind-the-rally-2786181-2025-09-12",
      "headline": "Gold hits record highs. 3 key reasons behind the rallyThe shine of gold is brighter than ever. Prices have soared to record levels, with global and domestic markets witnessing a strong rally. So, what's driving this rise? Three major factors are at play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-seniors-can-unlock-rs-15-lakh-a-month-from-their-home-explains-expert-2786140-2025-09-12",
      "headline": "How seniors can unlock Rs 1.5 lakh a month from their home, explains expertRising medical bills and everyday expenses often strain retirees who have no pension. But for those who own a house, there's a way out. An expert says reverse mortgage can turn property into a monthly pension of Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-income-reporting-to-form-selection-7-key-checks-every-taxpayer-should-make-before-filing-itr-2786109-2025-09-12",
      "headline": "From income reporting to form selection: 7 must-do ITR stepsThis article outlines the key things taxpayers in India need to remember while filing their income tax return for the current assessment year, with a focus on accuracy, compliance, and timely processing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-shares-rally-2-percent-after-record-rs-18000-crore-buyback-will-investors-benefit-2786106-2025-09-12",
      "headline": "Infosys shares up 2% on record buyback plan. Will existing shareholders benefit?Infosys shares climbed over 2% after the IT firm announced a Rs 18,000 crore buyback, the largest in its history. The offer, priced at a 19% premium, could benefit existing shareholders, though experts caution on execution challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-update-which-sectors-to-invest-auto-hotels-hospitals-fmcg-it-2786079-2025-09-12",
      "headline": "Dalal Street momentum: Top sectors to invest in todayExperts believe that from Q3 onwards, earnings should improve due to GST rationalisation and income tax cuts, which will start paying off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vacation-loans-india-gen-z-tier-2-cities-travel-debt-2786055-2025-09-12",
      "headline": "Thinking of borrowing for your next foreign trip? Here's why you shouldn'tA surge in Indians borrowing for foreign trips raises financial concerns. CoinSwitch's founder offers insights into prudent financial practices to prevent potential debt accumulation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-25000-infosys-jumps-2-2786047-2025-09-12",
      "headline": "Markets open higher on Fed rate cut optimism; Infosys leads gainsThe S&P BSE Sensex was up 211.13 points to 81,759.86 at 9:16 am, while the NSE Nifty50 rose 66.665 points to trade at 25,072.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-xirr-investment-metric-true-portfolio-returns-timing-impact-2786038-2025-09-12",
      "headline": "Explained: Why SIP investors on trading apps must check XIRR, not just returnsIn SIPs, investments enter the market at different times. Some stay for years, others only months. Absolute returns treat them alike, distorting the picture. XIRR offers a more accurate measure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-closes-high-demand-investor-caution-gmp-listing-date-2786036-2025-09-12",
      "headline": "Urban Company IPO closes today. Is it a risky bet as GMP soars on last day?Urban Company's initial public offering ends its bidding phase today after strong investor interest and rising grey market premiums."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-touches-new-lifetime-high-of-rs-113-lakh-per-10-grams-in-delhi-2785898-2025-09-11",
      "headline": "Gold touches new lifetime high of Rs 1.13 lakh per 10 grams in DelhiGold prices surged to a new lifetime high of Rs 1,13,100 per 10 grams in Delhi on Thursday. The yellow metal has gained over 43% this year. Experts attribute the surge to central bank buying, exchange-traded funds inflows, and geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zupee-lays-off-30-percent-of-staff-as-it-adapts-to-india-online-gaming-act-2785826-2025-09-11",
      "headline": "Zupee lays off 30% of staff as it adapts to India's Online Gaming ActZupee has rolled out a comprehensive relief package for employees affected by the layoffs. The support plan includes financial assistance beyond the standard notice period, with extra compensation based on years of service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/will-diwali-light-up-dalal-street-for-investors-2785768-2025-09-11",
      "headline": "Will Diwali light up Dalal Street for investors?While the festival is often seen as a time for good fortune, experts say the stock market doesn't necessarily follow festive trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-slides-to-all-time-low-as-us-tariffs-bite-2785745-2025-09-11",
      "headline": "Rupee slides to all-time low as US tariffs biteThe Indian rupee hit a record low of 88.44 against the US dollar on Thursday, pressured by US tariffs and heavy foreign investor outflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-nifty50-longest-winning-streak-us-india-trade-optimism-oil-gas-gains-2785730-2025-09-11",
      "headline": "Sensex, Nifty extend gains amid optimism over US-India trade dealThe NSE Nifty50 rose by 32.40 points to close at 25,005.5, while the BSE Sensex increased by 123.58 points, settling at 81,548.73."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-switch-now-allowed-but-rules-apply-unified-pension-scheme-national-pension-scheme-2785701-2025-09-11",
      "headline": "UPS to NPS switch now allowed, but rules applyCentral government employees who opted for the UPS can now switch back to the NPS, the government has announced. However, this flexibility comes with specific rules and conditions that employees must follow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phone-buying-loan-rbi-new-lone-mobile-lock-small-lenders-bajaj-finance-emi-2785683-2025-09-11",
      "headline": "Buying a phone on loan? Non-payment may lock your deviceCurrently, over one-third of consumer electronics, including mobile phones, are purchased on small-ticket loans in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-pay-income-tax-with-credit-card-all-you-need-to-know-2785649-2025-09-11",
      "headline": "Should you pay income tax with credit card? All you need to knowAs the tax filing deadline approaches, many taxpayers scramble to pay their dues. While net banking and UPI are common, using a credit card is also an option, but it comes with costs and benefits you should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-even-small-income-slips-can-trigger-big-tax-notices-explains-tax-advisor-2785585-2025-09-11",
      "headline": "Why even small income slips can trigger big tax notices, explains tax advisorThink a small slip in your tax return won't matter? Think again. Even missing Rs 5,000 bank interest has invited income tax notices. A tax advisor breaks down why AIS mismatches are a growing headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-in-limbo-why-so-many-employees-struggle-to-access-their-savings-2785558-2025-09-11",
      "headline": "PF crisis: What makes withdrawing your own money so difficultFor decades, the Provident Fund has been seen as a loyal companion, quietly growing with every paycheque, waiting to support employees in tough times or after retirement. But when the time comes to withdraw it, many workers discover that accessing their savings is anything but simple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/looking-to-invest-in-it-stocks-here-are-the-top-picks-2785577-2025-09-11",
      "headline": "Looking to invest in IT stocks? Here are the top picksDespite recent concerns around tariffs announced by US President Donald Trump in April, experts remain positive on the IT sector's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-world-richest-larry-elisson-oracle-open-ai-partnership-2785501-2025-09-11",
      "headline": "World's richest race: Elon Musk reclaims No.1 spot from Larry EllisonElon Musk has largely remained at the top of the global wealth chart since first claiming the position in 2021. Though he was overtaken briefly by LVMH's Bernard Arnault in 2021 and by Amazon founder Jeff Bezos in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-above-24950-eternal-adani-ports-among-top-gainers-2785464-2025-09-11",
      "headline": "Sensex, Nifty gain after flat opening amid US rate cut optimismThe S&P BSE Sensex gained over 100 points after a flat start, while the NSE Nifty50 briefly crossed the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-dev-accelerator-shringar-house-of-mangalsutra-ipo-subscription-profit-gmp-today-2785445-2025-09-11",
      "headline": "3 IPOs in focus: Urban Company leads, but where's the bigger listing gain?Urban Company's was fully subscribed within a few hours, indicating high demand. Alongside Urban Company, two other IPOs, Dev Accelerator and Shringar House of Mangalsutra, are also open for bidding this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-larry-ellison-surpasses-elon-musk-to-become-worlds-richest-person-2785281-2025-09-10",
      "headline": "Oracle's Larry Ellison surpasses Elon Musk to become world's richest personEllison's net worth jumped by an unprecedented $101 billion in a single day after Oracle Corp. delivered blowout quarterly results, sparking a record surge in its stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-20s-to-retirement-how-bonds-strengthen-your-finances-2785155-2025-09-10",
      "headline": "From 20s to retirement: How bonds strengthen your financesBonds don't grab headlines like stocks, but they quietly strengthen your finances across life stages. From building discipline in your 20s to ensuring stability in retirement, they remain a steady anchor for wealth creation. Here's how they work for you."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/requiem-for-hate-economy-box-office-bombing-of-the-bengal-files-tells-us-vivek-agnihotri-udaipur-files-2786741-2025-09-13",
      "headline": "Requiem for hate economy? What the box office bombing of Bengal Files tells usPropaganda-driven \"files\" franchise has hit a wall. With Bengal and Udaipur both flopping spectacularly, India's audience seems done subsidising the hate economy wrapped as cinematic history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-supports-anurag-kashyap-nishaanchi-before-release-poster-vedika-pinto-sonakshi-sinha-2786720-2025-09-13",
      "headline": "Salman Khan supports Anurag Kashyap's Nishaanchi before release, praises posterSalman Khan recently extended his luck to Anurag Kashyap's upcoming film 'Nishaanchi'. He shared a video along with a heartfelt note for the entire team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-20-farah-khan-schools-kunickaa-sadanand-baseer-ali-weekend-ka-vaar-salman-khan-2786701-2025-09-13",
      "headline": "Bigg Boss 19 episode 20: Farah Khan schools Kunickaa, Baseer in fiery exchangeFilmmaker-producer Farah Khan took Kunickaa Sadanand to task for taking puris off Zeeshan Quadri's plate, and also pulled up Baseer Ali for questioning the calibre of the housemates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-software-engineer-delhi-fails-answer-rs-50-lakh-question-can-you-2786686-2025-09-13",
      "headline": "KBC 17: Software engineer from Delhi fails to answer Rs 50 lakh question. Can you?In the latest episode of 'Bigg Boss 17', a software engineer from Delhi failed to answer a Rs 50 lakh question on Emerald Capital. Would you like to take your chance? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-punjab-to-goa-how-bollywood-keeps-recycling-state-stereotypes-param-sundari-2786548-2025-09-13",
      "headline": "From Punjab to Kerala, how Bollywood keeps recycling state stereotypesBollywood reduces India's states to punchlines, mustard fields, paan stains, lungi dances. In this week's Cinematic Saturday, we will discuss why audiences deserve better representation on screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-day-1-teja-sajja-film-opens-strong-beats-hanuman-record-2786658-2025-09-13",
      "headline": "Mirai box office Day 1: Teja Sajja's film opens strong, beats HanuMan recordTeja Sajja's 'Mirai' made a strong debut on September 12, 2025. The film earned Rs 12 crore on its first day across all languages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhruv-rathee-criticises-vivek-agnihotri-screening-adult-rated-bengal-files-children-2786631-2025-09-13",
      "headline": "Dhruv Rathee criticises Vivek Agnihotri for showing The Bengal Files to childrenYouTuber Dhruv Rathee calls out filmmaker Vivek Agnihotri for showing the A-rated film The Bengal Files to children, raising concerns about exposure to violent content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parasakthi-release-pongal-sivakarthikeyan-face-clash-thalapathy-vijay-jana-nayagan-2786617-2025-09-13",
      "headline": "Parasakthi release set for Pongal, Sivakarthikeyan to face Vijay's Jana NayaganDirector Sudha Kongara's Parasakthi, featuring Sivakarthikeyan, is set for a Pongal 2026 release and will face a box office clash with Thalapathy Vijay's Jana Nayagan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-homebound-earns-standing-ovation-at-tiff-2025-premiere-janhvi-kapoor-ishaan-khatter-vishal-jethwa-2786610-2025-09-13",
      "headline": "Karan Johar's Homebound earns standing ovation at TIFF 2025 premiere. WatchKaran Johar's 'Homebound', directed by Neeraj Ghaywan, received a standing ovation at the 50th Toronto International Film Festival. The film stars Ishaan Khatter, Janhvi Kapoor, and Vishal Jethwa in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-releases-new-album-play-dance-pop-track-symmetry-out-now-2786455-2025-09-12",
      "headline": "Ed Sheeran releases new album Play, dance-pop track Symmetry out nowEd Sheeran recently released his new album 'Play' featuring Indian and Persian musical influences. The album offers collaborations with producers and musicians from across the globe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/do-you-wanna-partner-review-tamannaah-bhatia-diana-penty-craft-beer-startup-2785961-2025-09-12",
      "headline": "Do You Wanna Partner review: Tamannaah-Diana's beer drama is almost brew-tifulRelease Date:Fri Sep 12, 2025Do You Wanna Partner series review: Tamannaah Bhatia stars as Shikha, a woman reinventing herself through a craft beer startup. The series explores female ambition, jugaad, and fierce competition in a male-dominated industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-sufi-motiwala-says-outdated-stereotypes-of-lgbtq-characters-fuel-societal-stigma-2786451-2025-09-12",
      "headline": "Sufi Motiwala says outdated stereotypes of LGBTQ characters fuel societal stigmaInfluencer-turned-actor Sufi Motiwala expressed that there are hardly any projects being created where LGBTQIA artistes can tell their own stories. In an exclusive chat with India Today, he also discussed his acting debut in 'Do You Wanna Partner'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-gets-emotional-over-kantara-1-song-making-rishab-shetty-shows-love-2786453-2025-09-12",
      "headline": "Diljit Dosanjh gets emotional over Kantara 1 song-making, Rishab Shetty shows loveDiljit Dosanjh just treated fans to a rare, behind-the-scenes peek from 'Kantara: Chapter 1', sharing a warm and heartfelt video with actor-director Rishab Shetty. Shetty, overwhelmed with love, reacted to the post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-diana-penty-recalls-deepika-padukone-calm-force-wishes-cocktail-2-team-success-2786425-2025-09-12",
      "headline": "Diana Penty recalls Deepika Padukone as calm force, wishes Cocktail 2 team successDiana Penty recalls her debut film experience with Deepika Padukone as supportive and reassuring. She looks forward to Cocktail 2 and wishes the new cast success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rgv-praises-mirai-for-hollywood-level-vfx-compared-it-to-baahubali-2786388-2025-09-12",
      "headline": "RGV praises Teja Sajja's Mirai for Hollywood-level VFX, compares it to BaahubaliDirector Ram Gopal Varma has praised Teja Sajja's fantasy-action thriller Mirai for its outstanding VFX and narrative. The film is being hailed as an industry hit, drawing comparisons to Baahubali and setting new standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diana-penty-reflects-ageism-in-bollywood-women-playing-mothers-in-their-30s-2786340-2025-09-12",
      "headline": "Diana Penty reflects on ageism in Bollywood, women playing mothers in their 30sActor Diana Penty addressed the trend of women playing mothers in films during their 30s. She reflected on her approach to navigating the industry norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/77th-primetime-emmy-awards-when-and-where-to-watch-nominations-and-presenters-2786379-2025-09-12",
      "headline": "77th Primetime Emmy Awards: When and where to watch, nominations and presentersGet ready to binge on awards! From star-studded presenters to binge-worthy nominations, here's everything you need to know about this year's Emmy magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-sonu-nigam-dance-bijuria-song-sunny-sanskari-ki-tulsi-kumari-youtube-fan-fest-viral-video-2786315-2025-09-12",
      "headline": "Varun Dhawan, Sonu Nigam dance to Bijuria at YouTube fan fest. Video goes viralActor Varun Dhawan and singer Sonu Nigam performed at the YouTube Fan Fest on the song 'Bijuria' from 'Sunny Sanskari Ki Tulsi Kumari.' \r\nA video of their performance is being widely shared on social media."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/i-urge-all-outfits-to-embark-on-path-of-peace-to-secure-your-childrens-future-pm-modi-in-manipur-2786730-2025-09-13",
      "headline": "Choose peace to secure your children's future, PM Modi tells Manipur groupsPrime Minister Narendra Modi, during his first visit to Manipur since the 2023 ethnic violence, urged all groups to choose peace to secure their children's future. He laid the foundation stone for projects worth Rs 7,000 crore and highlighted major investments to boost road, rail, and air connectivity in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-families-of-those-displaced-due-to-unrest-in-manipurs-churachandpur-2786708-2025-09-13",
      "headline": "PM braves rain, meets Manipur violence victims in 1st visit since 2023 unrestThe Prime Minister, who took a 65 km road trip from Imphal due to heavy rain, interacted with those displaced from their homes in Churachandpur, the epicentre of the violence that left 260 people dead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sikh-woman-raped-by-two-men-in-uk-park-oldbury-told-go-back-to-your-country-racial-attack-hate-crime-sikh-community-abroad-2786721-2025-09-13",
      "headline": "Go back to your country, Sikh woman told after being raped in UKPolice are hunting two white men. One is described as heavy-built with a shaven head, wearing a dark sweatshirt and gloves. The second wore a grey top with a silver zip."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/ground-report/story/nepal-protests-ground-report-shops-reopen-cars-return-to-roads-as-nepal-picks-up-pieces-2786677-2025-09-13",
      "headline": "Ground Report: Shops reopen, cars back on roads as Nepal picks up piecesSpeaking to India Today, several citizens expressed their demand for a corruption-free government and voiced hope that the new administration will deliver justice and stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-operation-sindoor-pahalgam-attack-calls-to-boycott-india-pakistan-asia-cup-match-dubai-unites-nation-2786641-2025-09-13",
      "headline": "After Op Sindoor, calls to boycott India-Pak match unite nationAfter the Pahalgam attack and Operation Sindoor, outrage over India facing Pakistan in the Asia Cup has snowballed. From veterans and political leaders to celebrities and common citizens, voices on social media are uniting in calls for a complete boycott of the high-voltage match on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/big-deal-to-impose-tariffs-on-india-causes-rift-with-them-says-trump-2786493-2025-09-12",
      "headline": "Big deal to impose tariffs on India, causes rift with them, says TrumpUS President Donald Trump said imposing a 50 percent tariff on India for buying Russian oil \"causes a rift\" between the two countries, while reiterating his claims of resolving global conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-first-visit-manipur-strife-torn-churachandpur-kuki-imphal-meitei-visit-project-inauguration-2786399-2025-09-13",
      "headline": "Focus Churachandpur: Why PM Modi's hills area visit is crucialPrime Minister Narendra Modi is visiting Manipur for the first time since ethnic clashes began in 2023. His focus is Churachandpur, the conflict's epicentre, where he will initiate projects worth Rs 7,300 crore. While Imphal shows signs of stability, Kukis in Churachandpur remain sceptical about the government's promises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/iphone-air-first-look-modestly-compact-surprisingly-powerful-and-refreshingly-optimistic-2786661-2025-09-13",
      "headline": "iPhone Air First Look: Modestly compact, surprisingly powerful and refreshingly optimisticMeet iPhone Air, Apple's thinnest iPhone ever. We spent some time with it during the September 9 Awe-Dropping iPhone 17 series launch event, and here is what we think about it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mallikarjun-kharge-calls-pm-modis-manipur-visit-tokenism-says-three-hour-stop-insult-to-victims-of-kuki-meitei-ethnic-violence-2786683-2025-09-13",
      "headline": "3-hour pit stop not compassion: Mallikarjun Kharge's dig at PM on Manipur visitIn a sharp post on X, Congress President Mallikarjun Kharge accused Prime Minister Modi of ignoring Manipur's suffering for over 860 days, pointing out that he had made 46 foreign trips since the violence began but never visited the state to console victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/erika-kirk-praises-police-after-arrest-of-suspect-in-charlie-kirks-fatal-shooting-glbs-2786593-2025-09-13",
      "headline": "He gave his life for me, our nation, children: Charlie Kirk's wife in 1st statementErika Kirk, widow of Charlie Kirk, delivered an emotional first statement, thanking police and first responders for their bravery and swift action after her husband's fatal shooting at Utah Valley University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championship-2025-indians-to-watch-out-for-neeraj-chopra-animesh-kujur-2786694-2025-09-13",
      "headline": "Five Indian athletes to watch at World Athletics Championships 2025 in TokyoThe World Athletics Championships kicked off on Saturday, September 13. Nineteen Indian athletes are participating in the competition, and here are five you should watch out for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/pickleball-the-chic-new-playground-for-friendships-and-power-networking-2786165-2025-09-13",
      "headline": "Pickleball, the chic new playground for friendships and power networkingWondering why so many people around you are suddenly talking about pickleball? It's because the courts have turned into some of the coolest hangout spots in town, where friendships brew one game at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/russia-kamchatka-earthquake-massive-magnitude-71-jolts-what-is-happening-ring-of-fire-tsunami-warning-2786632-2025-09-13",
      "headline": "Ring of Fire: Why Russia's Kamchatka shook with 7.1 magnitude quakeThe quake, which occurred at a shallow depth of around 10–20 kilometres beneath the seabed, was recorded at approximately 10:37 am local time, with the epicentre situated just offshore from this remote and rugged stretch of Far Eastern Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/from-punjab-to-goa-how-bollywood-keeps-recycling-state-stereotypes-param-sundari-2786548-2025-09-13",
      "headline": "From Punjab to Kerala, how Bollywood keeps recycling state stereotypesBollywood reduces India's states to punchlines, mustard fields, paan stains, lungi dances. In this week's Cinematic Saturday, we will discuss why audiences deserve better representation on screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-522-12-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-match-asia-cup-opposition-slams-modi-government-pahalgam-attack-2786722-2025-09-13",
      "headline": "This is hypocrisy: Opposition leaders slam Centre over India-Pak Asia Cup clashUddhav Thackeray and Arvind Kejriwal tore into the Modi government over India's September 14 Asia Cup clash with Pakistan, citing the recent Pahalgam terror attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/india-doctor-production-highest-rural-healthcare-access-challenges-2786392-2025-09-13",
      "headline": "India produces one of the largest numbers of doctors in the world, yet it's not enoughIndia now produces over 1.8 lakh doctors annually, leading global charts. However, rural healthcare access remains limited, creating ongoing challenges despite growing numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/cross-border-infiltration-next-big-challenge-to-indian-internal-security-2786636-2025-09-13",
      "headline": "Cross-border infiltration: The next big challenge to India's internal securityCross-border infiltration has emerged as India's most pressing internal security threat, with demographic shifts, political exploitation and economic strains turning a regional concern into a national crisis demanding urgent action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/video-utah-governor-gets-emotional-while-remembering-charlie-kirk-glbs-2786495-2025-09-12",
      "headline": "It was one of us: Utah governor hoped Charlie Kirk shooter was not from USUtah governor Spencer Cox said he had prayed that Charlie Kirk's shooter, identified as 22-year-old Tyler Robinson, a Utah resident, 'wouldn't be one of us'. His remarks, seen as targeted towards immigrants, faced severe criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/g7-finance-ministers-discuss-tariffs-possible-sanctions-to-increase-pressure-on-russia-glbs-2786586-2025-09-13",
      "headline": "US now turns up heat on G7 partners to sanction India and ChinaDuring a call with G7 finance ministers on Friday, US Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer pressed allies to match Washington's tariff measures, warning that only a unified approach cutting off Russia's energy revenues could bring an end to the war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-141-other-nations-vote-in-favour-of-un-resolution-backing-palestine-statehood-2786542-2025-09-12",
      "headline": "In big move, India votes in favour of Palestine's statehood at UNIndia's vote marks a shift from its recent position on Gaza. In the past three years, New Delhi abstained four times from UN resolutions calling for a ceasefire, drawing criticism for avoiding direct calls to halt hostilities. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-why-india-playing-pakistan-anurag-thakur-ind-vs-pak-2786712-2025-09-13",
      "headline": "Why is India playing Pakistan in Asia Cup 2025? Ex-Sports Minister explainsThe former Sports Minister, Anurag Thakur explained why India will play Pakistan in the ongoing Asia Cup 2025 tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sri-lanka-charith-asalanka-downplays-bangladesh-rivarly-2786703-2025-09-13",
      "headline": "Asia Cup 2025: Bangladesh rivalry is one for the fans, says Sri Lanka captainSri Lanka captain Charith Asalanka plays down fan-driven rivalry ahead of Asia Cup opener against Bangladesh. The focus remains on basics and execution despite recent losses and heated past encounters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championship-2025-indians-to-watch-out-for-neeraj-chopra-animesh-kujur-2786694-2025-09-13",
      "headline": "Five Indian athletes to watch at World Athletics Championships 2025 in TokyoThe World Athletics Championships kicked off on Saturday, September 13. Nineteen Indian athletes are participating in the competition, and here are five you should watch out for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pacer-renuka-singh-fitness-tests-for-odi-series-australia-world-cup-2786675-2025-09-13",
      "headline": "Renuka Singh has cleared all tests: India coach shares update before Australia ODIsIND-W vs AUS-W: India pacer Renuka Singh has cleared all fitness tests and returned to the national side after a stress fracture layoff, ahead of the three-match ODI series against Australia starting September 14. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/unknown-40-year-old-english-cricketer-investigated-spiking-sexual-assault-2786669-2025-09-13",
      "headline": "40-year-old English cricket figure investigated for sexual assault, spiking: ReportA prominent English cricket figure is under police investigation for spiking two women and alleged sexual assault. The case adds to recent misconduct concerns within English cricket and ongoing safeguarding scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-harleen-deol-parents-watch-india-mullanpur-odi-series-2786651-2025-09-13",
      "headline": "Harleen thrilled as dream of parents watching her in India colours comes trueIND-W vs AUS-W: Harleen Deol is overjoyed as her parents will watch her play for India for the first time during the upcoming ODI series in Mullanpur, New Chandigarh. The series also serves as crucial preparation for the World Cup, making the occasion even more special.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-harry-brook-warns-rivals-t20-world-cup-record-breaking-win-south-africa-2786646-2025-09-13",
      "headline": "Harry Brook fires warning to rivals after record-breaking win vs South AfricaEngland captain Harry Brook hailed his team's record-breaking 146-run victory over South Africa. The impressive win boosts England's confidence ahead of the T20 World Cup but raises questions on South Africa's bowling strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-sanjay-manjrekar-spin-heavy-bowling-unit-challenge-2786642-2025-09-13",
      "headline": "IND vs PAK: Pakistan's spin-heavy bowling attack might trouble India, says ManjrekarFormer cricketer Sanjay Manjrekar highlights Pakistan's spin-heavy strategy in the Asia Cup 2025. This fresh approach could test India's batting strength in the high-profile rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-reach-first-final-2025-hong-kong-open-2786638-2025-09-13",
      "headline": "Satwik-Chirag races to Hong Kong Open final with dominant win in semisSatwiksairaj Rankireddy and Chirag Shetty stormed into their first final of 2025, defeating Taiwan's Chen Cheng Kuan and Lin Bing-Wei in straight games at the Hong Kong Open. The Asian Games champions ended a run of five semi-final exits, booking a summit clash spot and boosting India's title hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-asia-cup-2025-win-oman-haris-strike-rate-performance-2786616-2025-09-13",
      "headline": "Pakistan batters under pressure with strike-rate? Mohammad Haris opens upMohammad Haris responded to Mike Hesson's strike-rate remarks by stressing Pakistan's proven batting record across conditions, while reaffirming the team's aggressive approach. He returned to form with a 66 against Oman, earning Player of the Match as Pakistan sealed a 93-run victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-harry-brook-warns-rivals-t20-world-cup-record-breaking-win-south-africa-2786646-2025-09-13",
      "headline": "Harry Brook fires warning to rivals after record-breaking win vs South AfricaEngland captain Harry Brook hailed his team's record-breaking 146-run victory over South Africa. The impressive win boosts England's confidence ahead of the T20 World Cup but raises questions on South Africa's bowling strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-sanjay-manjrekar-spin-heavy-bowling-unit-challenge-2786642-2025-09-13",
      "headline": "IND vs PAK: Pakistan's spin-heavy bowling attack might trouble India, says ManjrekarFormer cricketer Sanjay Manjrekar highlights Pakistan's spin-heavy strategy in the Asia Cup 2025. This fresh approach could test India's batting strength in the high-profile rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-reach-first-final-2025-hong-kong-open-2786638-2025-09-13",
      "headline": "Satwik-Chirag races to Hong Kong Open final with dominant win in semisSatwiksairaj Rankireddy and Chirag Shetty stormed into their first final of 2025, defeating Taiwan's Chen Cheng Kuan and Lin Bing-Wei in straight games at the Hong Kong Open. The Asian Games champions ended a run of five semi-final exits, booking a summit clash spot and boosting India's title hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-asia-cup-2025-win-oman-haris-strike-rate-performance-2786616-2025-09-13",
      "headline": "Pakistan batters under pressure with strike-rate? Mohammad Haris opens upMohammad Haris responded to Mike Hesson's strike-rate remarks by stressing Pakistan's proven batting record across conditions, while reaffirming the team's aggressive approach. He returned to form with a 66 against Oman, earning Player of the Match as Pakistan sealed a 93-run victory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}