{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bangladesh-economy-adani-power-supply-cut-explainer-power-development-board-2626922-2024-11-02",
      "headline": "Explained: How Adani Power's supply cut impacts crisis-hit Bangladesh economyAdani Power's supply cut to Bangladesh intensifies existing economic challenges, raising concerns about energy security and financial stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-power-plant-bangladesh-electricity-supply-cut-unpaid-bills-gautam-adani-2626866-2024-11-02",
      "headline": "Adani Power cuts half of Bangladesh electricity supply over unpaid duesThe power reduction comes at a challenging time for Bangladesh, which reported a shortfall of over 1,600 megawatts (MW) overnight. The 1,496 MW Adani plant is currently generating just 700 MW from one of its two units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-samvat-2081-stock-market-sensex-nifty-key-stocks-strategies-2626541-2024-11-01",
      "headline": "Muhurat Trading 2024: Markets end on strong note; all sectoral indices in greenMuhurat Trading 2024 has concluded, marking the arrival of Samvat 2081. The session, which took place from 6:00 PM to 7:00 PM, ended on a strong note, with the Sensex surging 335 points and the Nifty closing at 24,300. Investors actively participated, reflecting the festive spirit of the Hindu New Year through token investments aimed at attracting prosperity. All the sectoral indices ended the session in green, with M&M, ONGC, Adani Ports and BEL emerging as the top gainers. On the other hand, the top losers were Dr Reddy's, HCLTech, Britannia, Tech Mahindra and Adani Enterprises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-timings-strategies-tips-stock-picks-and-key-details-2626384-2024-11-01",
      "headline": "Muhurat Trading 2024: Check timings, stock recommendations, all key detailsMuhurat Trading today: The pre-opening session will begin at 5:45 PM, and all intraday positions will be automatically squared off 15 minutes before the session's close, necessitating careful planning for same-day trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-top-stock-picks-trading-strategies-expert-insights-key-levels-timing-2626371-2024-11-01",
      "headline": "Muhurat trading 2024: Check stock picks, trading strategy and expert insightsMuhurat trading is not just a unique market session; it's a cherished tradition where investors make token investments to invoke the blessings of Goddess Lakshmi, the goddess of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bibek-debroy-dies-aged-69-visionary-economist-policy-reformer-author-2626283-2024-11-01",
      "headline": "Bibek Debroy dies at 69: A visionary economist and policy reformer Bibek Debroy's life was marked by significant contributions to economic policy and classical literature, shaping India's intellectual landscape and leaving a lasting impact on future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/19-kg-lpg-commercial-gas-cylinder-price-hike-delhi-mumbai-chennai-kolkata-new-rate-2626197-2024-11-01",
      "headline": "19 kg LPG commercial cylinders to get costlier from today. Check pricesThe prices of 19-kg commercial LPG cylinders have been revised across the country, including in metro cities like Delhi, Mumbai, Kolkata, and Chennai, effective November 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-550-points-lower-nifty-dips-as-it-stocks-slide-2626082-2024-10-31",
      "headline": "Sensex ends over 550 points lower, Nifty dips as IT stocks slideThe S&P BSE Sensex dropped by 553.12 points to close at 79,389.06, while the NSE Nifty50 fell 135.50 points, settling at 24,205.35. Broader market indices also declined as volatility weighed on investor sentiment across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-share-price-gain-10-percent-today-usfda-approval-goa-facility-stock-benefit-explained-2625958-2024-10-31",
      "headline": "Explained: Why Cipla share price surged up to 10% todayCipla share price: The stock rose by 9.88% to reach a day high of Rs 1,557.45 on the Bombay Stock Exchange (BSE).  At 10:41 am, shares of Cipla were up 8.24% at Rs 1,534.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-nbfc-hdfc-bank-arm-files-for-rs-12500-crore-ipo-check-details-2625953-2024-10-31",
      "headline": "HDFC Bank's HDB Financial files Rs 12,500 crore IPO. Check detailsHDFC Bank, holding a 94.6% stake in HDB Financial, will sell shares worth up to Rs 10,000 crore, while HDB Financial plans to issue fresh shares totalling Rs 2,500 crore, as outlined in the filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-openig-dalal-street-sensex-nifty-fall-fii-outflow-weak-q2-results-overvaluation-2625947-2024-10-31",
      "headline": "Diwali fireworks missing from Dalal Street as Sensex, Nifty fall The S&P BSE Sensex was down 199.13 points to 79,743.05 at 10:07 am, while the NSE Nifty50 fell 126 points to 24,340.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-diwali-celebration-drone-show-noida-headquarters-ceo-vijay-shekhar-sharma-2625873-2024-10-31",
      "headline": "Paytm lights up Noida skies with dazzling Diwali drone showPaytm celebrated Diwali with a dazzling drone show at its Noida headquarters, featuring messages like \"Happy Diwali\" and \"Paytm karo\" in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-snap-two-day-rally-dull-q2-earnings-disrupy-momentum-2625669-2024-10-30",
      "headline": "Sensex, Nifty snap 2-day rally as dull Q2 earnings disrupt momentum The BSE Sensex fell 0.5% to close at 79,966, while the NSE Nifty 50 index declined by the same margin to 24,350, as market sentiment weakened due to ongoing foreign selling and lacklustre corporate earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-2024-stocks-to-buy-recmmendations-stoxbox-strong-fundamentals-share-price-trends-2625626-2024-10-30",
      "headline": "StoxBox's Diwali picks: 5 stocks to light up your portfolioGet ready to brighten your portfolio this Diwali with these five promising stocks that are expected to deliver strong future performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-market-value-down-122-billion-dollars-since-july-32-percent-tumble-decoded-2625551-2024-10-30",
      "headline": "Falling behind in AI race has cost Samsung $122 billion: Report Samsung has lost $122 billion in market value since July, a tumble of 32% that makes it the largest decline among global chipmakers this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elcid-share-price-692535-percent-rise-india-most-expensive-stock-surpassing-mrf-2625536-2024-10-30",
      "headline": " Elcid's 66,92,535% surge makes it India's most expensive stock, surpassing MRFElcid Investments, based in Mumbai, is a non-banking financial company (NBFC) with a strong connection to Asian Paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-ports-share-price-top-gainers-nifty50-q2-results-2625465-2024-10-30",
      "headline": "Adani Enterprises, Adani Ports: Why Adani stocks are gaining todayAdani Enterprises shares rose 4.42% to Rs 2,974.50 on the National Stock Exchange (NSE) at 11:41 am, while APSEZ saw a 2.62% lift to Rs 1,408.65. All other Adani Group companies also traded in the green, supported by these positive cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-brings-102-tonnes-of-gold-from-bank-of-england-home-on-dhanteras-2625444-2024-10-30",
      "headline": "RBI's 102-tonne gold haul this Dhanteras: What's behind the move?The RBI recently relocated 102 tonnes of gold from the Bank of England's vaults to secure facilities within India as it now hold a total of 855 tonnes in reserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-today-gains-despite-disappointing-q2-results-2625446-2024-10-30",
      "headline": "Explained: Why Maruti Suzuki share price gained over 2% despite weak Q2 resultsMaruti Suzuki's quarterly report revealed a 17% year-on-year decline in net profit to Rs 3,103 crore, falling short of market expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-q2-earnings-diwali-adani-stocks-bel-2625435-2024-10-30",
      "headline": "Sensex, Nifty in red as Q2 earnings dampen Diwali spirit; Adani stocks gainThe NSE Nifty 50 dropped 0.24% to 24,411.9 points, while the BSE Sensex declined 0.28% to 80,142.11 by 9:57 am. Seven out of the 13 major sectors showed losses, while small-cap and mid-cap indices performed better, rising 1% and 0.5%, respectively. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-canada-standoff-allegation-against-top-leader-modi-cabinet-justin-trudeau-2627011-2024-11-02",
      "headline": "India summons Canadian official over allegations against Union Home MinisterThe government on Saturday said the Canadian officials \"deliberately leaked unfounded insinuations to international media to discredit India and influence other nations\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-sanctions-19-indian-companies-for-aiding-russias-war-against-ukraine-2627041-2024-11-02",
      "headline": "US sanctions 19 Indian companies for 'aiding Russia's war' against UkraineThe United States imposed sanctions on nearly 400 entities and individuals, including 19 Indian companies, for \"aiding Russia's war in Ukraine\" by supplying critical technologies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/shaina-nc-slams-maha-vikas-aghadi-arvind-sawant-sexist-remark-maharashtra-polls-2627107-2024-11-02",
      "headline": "Shaina NC seeks MVA's 'official stand' on Uddhav Sena leader's sexist remark Shaina NC questioned why leaders like Priyanka Gandhi and Priyanka Chaturvedi from the MVA had not condemned the sexist remarks made by Arvind Sawant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-polls-2024-india-seat-sharing-deal-hemant-soren-jmm-congress-rjd-cpi-cpm-bjp-2627047-2024-11-02",
      "headline": "INDIA bloc finalises Jharkhand seat-sharing deal, Hemant Soren's JMM gets 43As per the seat-sharing agreement, Jharkhand Mukti Morcha will contest on 43 seats, Congress on 30 and Rashtriya Janata Dal (RJD) on six. While the Left parties have got seats in assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/tarun-tahiliani-pays-moving-tribute-to-rohit-bal-shares-everlasting-memories-exclusive-death-2626943-2024-11-02",
      "headline": "The gift that was Gudda: Tarun Tahiliani shares precious memories with Rohit BalRenowned fashion designer Rohit Bal, fondly called 'Gudda', died on Friday after battling a prolonged illness. He was 63."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-two-report-shubman-gill-rishabh-pant-ajaz-patel-mumbai-2627050-2024-11-02",
      "headline": "IND vs NZ: Gill, Pant and spinners hand India edge on Day 2 of Mumbai TestShubman Gill and Rishabh Pant's incredible partnership and magic from the spinners left India with the advantage at the end of Day 2 of the Mumbai Test on Saturday, November 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-worsens-as-stubble-burning-from-punjab-madhya-pradesh-reaches-seasonal-high-2627076-2024-11-02",
      "headline": "Delhi air quality turns 'hazardous' as farm fires surge in Punjab, Madhya PradeshDelhi's air quality plummeted to hazardous levels, with crop residue burning contributing over 35% to the pollution. The spike, driven by farm fires across Punjab, Haryana, and other states, is escalating the health risks across northern India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/designer-rohit-bal-cremated-delhi-family-fashion-fraternity-bigwigs-attend-last-rites-2627077-2024-11-02",
      "headline": "Rohit Bal cremated in Delhi, fashion fraternity bigwigs attend funeralRohit Bal, known for his flamboyant and rich designs, died on Friday. His funeral was held in Delhi today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-59th-birthday-gauri-khan-suhana-khan-visits-bal-gandharva-rang-mandir-2627116-2024-11-02",
      "headline": "SRK celebrates 59th birthday with family, visits Bal Gandharva Rang MandirBollywood icon Shah Rukh Khan marked his 59th birthday with an intimate family celebration and a visit to the Bal Gandharva Rang Mandir, thrilling fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pappy-yadav-death-treat-case-bihar-police-arrest-man-from-delhi-purnea-sp-says-accused-purchased-sim-from-uae-2627090-2024-11-02",
      "headline": "Man who threatened Bihar MP Pappu Yadav arrested, has no link with any gangAccording to the police, the accused was arrested based on technical surveillance and during interrogation, he confessed to issuing death threats to Purnea MP Pappu Yadav."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/trump-joe-biden-gaffe-stink-kamala-harris-garbage-truck-joe-biden-rally-swing-states-wisconsin-trash-2626591-2024-11-02",
      "headline": "How Trump is using Biden gaffe to raise a stink, seal the electionThe 2024 US presidential election has taken a different turn after US President Joe Biden called Donald Trump's supporters 'garbage'. Trump is trying to use Biden's remarks against Kamala Harris to seal the election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-anil-kumble-ind-vs-nz-wankhede-stadium-ravindra-jadeja-2627112-2024-11-02",
      "headline": "R. Ashwin surpasses Anil Kumble in major list with 3-wicket haul at WankhedeStar India off-spinner Ravichandran Ashwin has become the leading wicket-taker at Wankhede Stadium after his three-wicket haul on Day 2 of the third Test against New Zealand."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-arrested-posing-rss-member-sangh-document-bhajanlal-sharma-jaipur-cmo-2627045-2024-11-02",
      "headline": "Rajasthan man arrested for posing as RSS member, forging Sangh's documentsAccused Kushal Chaudhary was arrested as Chief Minister's Office (CMO) filed a formal complaint after receiving a request to nominate him as the Chairman of the Rajasthan Public Service Commission."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-encounter-anantnag-terrorists-killed-in-encounter-with-security-forces-2626926-2024-11-02",
      "headline": "2 terrorists killed in encounter with security forces in J&K's Anantnag The encounter broke out after security forces initiated an anti-terrorist operation in Jammu and Kashmir's Anantnag district. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-ammunition-cartridge-found-ai-916-dubai-delhi-flight-2626978-2024-11-02",
      "headline": "Ammunition cartridge found on seat pocket of Dubai-Delhi Air India flightThe flight arrived at New Delhi Airport on October 27, and all passengers disembarked safely, an Air India spokesperson said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-bhulaiyaa-2-day-1-box-office-collection-kartik-aaryan-biggest-opener-2626859-2024-11-02",
      "headline": "Bhool Bhulaiyaa 3 box office Day 1: Kartik Aaryan gets his biggest openerBhool Bhulaiyaa 3 saw a great opening at the box office, minted Rs 35.50 crore despite clash with Singham Again. The film also gave actor Kartik Aaryan his biggest opening day collection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-business-politics-entertainment-429-02-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/designer-rohit-bal-dies-heart-ailments-tributes-gudda-kashmiri-pandit-ivanka-trump-wore-his-dress-in-rashtrapati-bhavan-2626759-2024-11-01",
      "headline": "In Rohit Bal's work, history met folklore and melded with fantasyRohit Bal returned to the runway two weeks ago, to tears and applause, after a heart ailment sent him to the hospital last year. He died at the age of 63 this evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-congress-poll-promises-row-shakti-scheme-pm-modi-finances-freebies-gdp-foreign-investment-2626919-2024-11-02",
      "headline": "Is Congress's freebie promises in Karnataka weighing heavily on state finances?The exchange between Congress chief Mallikarjun Kharge and Prime Minister Modi has intensified tensions, following Kharge's call for state units to offer financially viable guarantees amid growing concerns over Karnataka's freebie schemes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-unique-ritual-on-ujjain-ft-cows-walking-over-men-lying-on-ground-2626902-2024-11-02",
      "headline": "Video: Unique ritual in Ujjain ft cows walking over men lying on groundPeople allowed cows to walk over them in Madhya Pradesh's Ujjain as part of the Govardhan Puja on Friday. It is a tradition for people celebrating Govardhan Puja in Ujjain's Bhidadwad district to allow cows to walk over them, as they lay on the ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/are-organic-foods-healthy-or-is-it-all-just-a-pricey-scam-2626288-2024-11-02",
      "headline": "Are organic foods healthy or is it all just a pricey scam?Our goal to eat healthy often leads us to choose organic foods, even though they can come with a hefty price tag. But is paying extra for organic food really worth it?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-crime-branch-extradition-process-begins-bring-back-lawrence-bishnoi-brother-anmol-bishnoi-from-us-2626896-2024-11-02",
      "headline": "Mumbai cops begin process to extradite Lawrence Bishnoi's brother from US: SourcesLast week, the National Investigation Agency (NIA) added Anmol Bishnoi's name to its most-wanted list and announced a reward of Rs 10 lakh for any information leading to his arrest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-girl-raped-murdered-by-uncle-lures-buying-chocolate-andhra-pradesh-2626964-2024-11-02",
      "headline": "Andhra man lures 3-year-old niece with chocolate, rapes, then murders herThe accused, who is the victim's uncle, lives in the same colony as the girl. Tirupati Rural police have lodged a case and an investigation is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/watch-smriti-irani-arjun-rampal-attend-designer-rohit-bals-last-rites-2627121-2024-11-02",
      "headline": "Watch: Smriti Irani, Arjun Rampal attend designer Rohit Bal's last rites"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-59th-birthday-gauri-khan-suhana-khan-visits-bal-gandharva-rang-mandir-2627116-2024-11-02",
      "headline": "SRK celebrates 59th birthday with family, visits Bal Gandharva Rang MandirBollywood icon Shah Rukh Khan marked his 59th birthday with an intimate family celebration and a visit to the Bal Gandharva Rang Mandir, thrilling fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/madhur-bhandarkar-remembers-rohit-bal-2627058-2024-11-02",
      "headline": "Madhur Bhandarkar recalls memories of designer Rohit BalFilmmaker Madhur Bhandarkar recalled his cherished memories of the late designer Rohit Bal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/king-khan-turns-59-daughter-suhana-kamal-haasan-and-others-wish-srk-2627059-2024-11-02",
      "headline": "King Khan turns 59: Daughter Suhana, Kamal Haasan, and others wish SRKBollywood icon Shah Rukh Khan celebrates his 59th birthday today, November 2, with an outpouring of love from fans and fellow celebrities. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-manager-ruud-van-nistelrooy-set-for-premier-league-debut-vs-chelsea-2627123-2024-11-02",
      "headline": "Ruud van Nistelrooy set for Premier League debut vs ChelseaLegendary Manchester United striker Ruud van Nistelrooy will make his Premier League managerial debut on Sunday when the Red Devils host Chelsea at Old Trafford. The former player will coach 3 games before Rueben Amorim takes over the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-shaheen-and-naseem-are-fresh-after-much-needed-rest-salman-ali-agha-2627119-2024-11-02",
      "headline": "Babar, Shaheen and Naseem are fresh after much-needed rest: Salman Ali Agha Salman Ali Agha hailed Babar Azam, Shaheen Afridi and Naseem Shah's return to Pakistan's white-ball side after being rested for the last two Tests vs England at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-anil-kumble-ind-vs-nz-wankhede-stadium-ravindra-jadeja-2627112-2024-11-02",
      "headline": "R. Ashwin surpasses Anil Kumble in major list with 3-wicket haul at WankhedeStar India off-spinner Ravichandran Ashwin has become the leading wicket-taker at Wankhede Stadium after his three-wicket haul on Day 2 of the third Test against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-3rd-test-day-2-shubman-gill-press-conference-video-2627111-2024-11-02",
      "headline": "India one good partnership away from Test win: Shubman GillIndia batter Shubman Gill said that the hosts are just one good partnership away from winning the Mumbai Test match. Gill said that India are desperate to get their hands on the crucial WTC points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-reveals-his-batting-mantra-wih-pant-vs-new-zealand-in-wankhede-2627103-2024-11-02",
      "headline": "Shubman Gill reveals his batting mantra with Pant vs New Zealand in WankhedeShubman Gill revealed his batting mantra with Rishabh Pant during Day 2 of 3rd Test at Wankhede. Gill and Pant shared a 96-run stand as they put India in a commanding position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-picks-nathan-mcsweeney-as-australian-opener-for-india-test-series-2627095-2024-11-02",
      "headline": "Ricky Ponting picks Nathan McSweeney as Australian opener for India Test seriesFormer Australia captain Ricky Ponting has picked Nathan McSweeney to open for Australia in the upcoming five-match Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-shubman-gill-rates-wankhede-knock-as-one-of-best-in-test-cricket-2627089-2024-11-02",
      "headline": "Shubman Gill rates Wankhede knock as one of best in Test cricketIndia better Shubman Gill rated his 90-run innings at Wankhede as one of his best innings in Test cricket. Shubman combined with Rishabh Pant to dig India out of trouble on Day 2 of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravichandran-ashwin-glenn-phillips-ravindra-jadeja-shubman-gill-2627068-2024-11-02",
      "headline": "Ball of the series? R Ashwin's carrom ball outfoxes Glenn PhillipsStar India off-spinner Ravichandran Ashwin used his carrom balls to good effect on Day 2 of the third Test against New Zealand as he scalped three wickets in the day. Is this the best ball of the series?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-two-r-ashwin-daryl-mitchell-catch-wankhede-mumbai-2627070-2024-11-02",
      "headline": "R Ashwin reacts to stunning catch to dismiss Daryl Mitchell: Trusted my handsR Ashwin reacted to his stunning catch to dismiss Daryl Mitchell on Day 2 of the Mumbai Test and claimed that he was trusting his hands to complete the effort in the end. Ashwin returned to the wickets column with a fine bowling effort. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamsons-replacement-will-young-impresses-with-twin-50s-in-wankhede-2627069-2024-11-02",
      "headline": "Kane Williamson's replacement Will Young impresses with twin fifties in WankhedeWill Young walked into New Zealand's playing XI in Kane Williamson's absence and scored 244 runs vs India in 3 Tests. He notched up twin fifties in the 3rd Test at Wankhede. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-shubman-gill-rates-wankhede-knock-as-one-of-best-in-test-cricket-2627089-2024-11-02",
      "headline": "Shubman Gill rates Wankhede knock as one of best in Test cricketIndia better Shubman Gill rated his 90-run innings at Wankhede as one of his best innings in Test cricket. Shubman combined with Rishabh Pant to dig India out of trouble on Day 2 of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravichandran-ashwin-glenn-phillips-ravindra-jadeja-shubman-gill-2627068-2024-11-02",
      "headline": "Ball of the series? R Ashwin's carrom ball outfoxes Glenn PhillipsStar India off-spinner Ravichandran Ashwin used his carrom balls to good effect on Day 2 of the third Test against New Zealand as he scalped three wickets in the day. Is this the best ball of the series?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-two-r-ashwin-daryl-mitchell-catch-wankhede-mumbai-2627070-2024-11-02",
      "headline": "R Ashwin reacts to stunning catch to dismiss Daryl Mitchell: Trusted my handsR Ashwin reacted to his stunning catch to dismiss Daryl Mitchell on Day 2 of the Mumbai Test and claimed that he was trusting his hands to complete the effort in the end. Ashwin returned to the wickets column with a fine bowling effort. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamsons-replacement-will-young-impresses-with-twin-50s-in-wankhede-2627069-2024-11-02",
      "headline": "Kane Williamson's replacement Will Young impresses with twin fifties in WankhedeWill Young walked into New Zealand's playing XI in Kane Williamson's absence and scored 244 runs vs India in 3 Tests. He notched up twin fifties in the 3rd Test at Wankhede. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-key-for-india-in-wankhede-chase-anil-kumble-2627067-2024-11-02",
      "headline": "Yashasvi Jaiswal key for India in Wankhede chase: KumbleYashasvi Jaiswal is going to be key for India in the final innings of the third Test match, said Anil Kumble. India trail by 143 runs in Mumbai on a surface that transformed into a rank-turner late on Day 2 of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-what-is-the-highest-4th-innings-target-ever-chased-at-wankhede-2627054-2024-11-02",
      "headline": "What is the highest 4th innings target ever chased at Wankhede?India will be chasing a target in the final innings of the Mumbai Test match. As the pitch shows signs of turning square, what has been the highest-ever target chased at the Wankhede Stadium?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-two-report-shubman-gill-rishabh-pant-ajaz-patel-mumbai-2627050-2024-11-02",
      "headline": "IND vs NZ: Gill, Pant and spinners hand India edge on Day 2 of Mumbai TestShubman Gill and Rishabh Pant's incredible partnership and magic from the spinners left India with the advantage at the end of Day 2 of the Mumbai Test on Saturday, November 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-prithvi-shaw-does-rigorous-training-amid-fitness-and-weight-concerns-raised-2627049-2024-11-02",
      "headline": "Prithvi Shaw does rigorous training amid fitness and weight concerns raisedPrithvi Shaw posted his rigorous training video amid concerns raised over his weight and fitness. He was dropped from Mumbai's Ranji Trophy squad for round three amid disciplinary and fitness issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-wankhede-chants-ashwin-ashwin-after-india-spinner-takes-stunning-catch-2627036-2024-11-02",
      "headline": "Watch: Wankhede chants 'Ashwin, Ashwin' after India spinner takes stunning catchRavichandran Ashwin thrilled Wankhede with a stunning diving catch to dismiss Daryl Mitchell. Running back from mid-on, he timed his dive perfectly, holding on as the crowd erupted in chants of \"Ashwin, Ashwin,\" celebrating his brilliant effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-r-ashwin-bamboozles-rachin-ravindra-with-ripping-off-spinner-in-mumbai-2627026-2024-11-02",
      "headline": "Watch: Ashwin bamboozles Rachin with ripping off-spinner in MumbaiSenior India off-spinner Ravichandran Ashwin bamboozled Rachin Ravindra with a ripping off-spinner on Saturday, November 2. Ashwin ended his wicket drought in the Mumbai Test with Rachin's wicket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tabraiz-shamsi-hails-indias-passion-for-cricket-during-ind-vs-nz-in-wankhede-2627021-2024-11-02",
      "headline": "Tabraiz Shamsi hails India's 'passion for cricket' during IND vs NZ in WankhedeTabraiz Shamsi praises India's unmatched cricket passion, sharing a glimpse of young players training on multiple pitches near Wankhede Stadium during the IND vs NZ Test. He recalls witnessing kids' dedication from as young as five years old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-mohammed-siraj-rcb-not-retention-explained-2627020-2024-11-02",
      "headline": "RCB think tank explains 'big decision' of not retaining Mohammed SirajIPL 2025: Royal Challengers Bengaluru head coach Andy Flower and director of cricket, Mo Babat, explained why the team opted against retaining Mohammed Siraj, one of India's premier fast bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-wankhede-chants-ashwin-ashwin-after-india-spinner-takes-stunning-catch-2627036-2024-11-02",
      "headline": "Watch: Wankhede chants 'Ashwin, Ashwin' after India spinner takes stunning catchRavichandran Ashwin thrilled Wankhede with a stunning diving catch to dismiss Daryl Mitchell. Running back from mid-on, he timed his dive perfectly, holding on as the crowd erupted in chants of \"Ashwin, Ashwin,\" celebrating his brilliant effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-r-ashwin-bamboozles-rachin-ravindra-with-ripping-off-spinner-in-mumbai-2627026-2024-11-02",
      "headline": "Watch: Ashwin bamboozles Rachin with ripping off-spinner in MumbaiSenior India off-spinner Ravichandran Ashwin bamboozled Rachin Ravindra with a ripping off-spinner on Saturday, November 2. Ashwin ended his wicket drought in the Mumbai Test with Rachin's wicket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tabraiz-shamsi-hails-indias-passion-for-cricket-during-ind-vs-nz-in-wankhede-2627021-2024-11-02",
      "headline": "Tabraiz Shamsi hails India's 'passion for cricket' during IND vs NZ in WankhedeTabraiz Shamsi praises India's unmatched cricket passion, sharing a glimpse of young players training on multiple pitches near Wankhede Stadium during the IND vs NZ Test. He recalls witnessing kids' dedication from as young as five years old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-mohammed-siraj-rcb-not-retention-explained-2627020-2024-11-02",
      "headline": "RCB think tank explains 'big decision' of not retaining Mohammed SirajIPL 2025: Royal Challengers Bengaluru head coach Andy Flower and director of cricket, Mo Babat, explained why the team opted against retaining Mohammed Siraj, one of India's premier fast bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-not-right-person-to-advice-new-manchester-united-boss-ruben-amorim-pep-guardiola-2626986-2024-11-02",
      "headline": "Not right person to advice new Manchester United boss Ruben Amorim: Pep GuardiolaPep Guardiola welcomed Ruben Amorim to the Premier League as the Portuguese tactician became the new head coach of Manchester United on November 1, Friday. Guardiola, however, refrained from giving any advice to Amorim as he feels he isn't the right person for it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sarfaraz-khan-naushad-khan-musheer-khan-wankhede-stadium-mumbai-2626984-2024-11-02",
      "headline": "IND vs NZ: Sarfaraz Khan's father, brother left stunned with his duck in MumbaiSarfaraz Khan's father Naushad and brother Musheer were left shell-shocked after his four-ball duck on Day 2 of the third Test against New Zealand at Wanlkhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-akash-deep-tom-latham-ajaz-patel-shubman-gill-rishabh-pant-2626976-2024-11-02",
      "headline": "Watch: Akash Deep shatters Tom Latham's stumps, gives aggressive send-off in MumbaiIndia fast bowler Akash Deep dismantled Tom Latham's stumps on Day 2 of third Test against New Zealand at Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-sarfaraz-khan-batting-order-criticism-captaincy-mumbai-test-2626965-2024-11-02",
      "headline": "Sarfaraz Khan at No. 8? India's tactics in Mumbai Test slammed by punditsIndia vs New Zealand, 3rd Test: India decided to hold Sarfaraz Khan back and send him at No. 8. The young batter, who hit 150 in the first Test in Bengaluru, was dismissed for a four-ball duck. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}