{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-restricts-defence-dividends-to-boost-weapons-production-glbs-2848409-2026-01-08",
      "headline": "Trump bars defence company payouts until weapons production speeds upTrump and senior Pentagon officials have repeatedly criticised major defence companies for failing to deliver weapons and systems at the pace demanded by modern conflicts. They have argued that lengthy delays and ballooning budgets weaken US military readiness and undermine taxpayer confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/darkest-day-of-my-life-vedanta-group-chairman-anil-agarwals-son-dies-of-cardiac-arrest-at-49-2848407-2026-01-08",
      "headline": "Darkest day of my life: Vedanta's Anil Agarwal's son dies of cardiac arrest at 49Agarwal's post referenced a longstanding pledge made between father and son to support several social priorities, such as food access, education for children, empowering women, and secure employment for young Indians. Agarwal renewed the promise to devote over 75% of group earnings to initiatives that benefit society.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-to-be-presented-on-sunday-february-1-economic-survey-to-be-tabled-on-january-29-2848353-2026-01-07",
      "headline": "Union Budget to be presented on Sunday, Feb 1; Economic Survey on Jan 29This will be only the second time the Union Budget will be presented on a Sunday. In 1999, the Budget was presented on a Sunday for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-jumps-rs-5000-hit-record-high-rs-256-lakh-per-kg-delhi-markets-2848308-2026-01-07",
      "headline": "Silver jumps Rs 5000 to hit record high of Rs 2.56 lakh per kg in Delhi marketsSilver prices jumped by Rs 5,000 to a fresh all-time high of Rs 2.56 lakh per kilogram in the Delhi market, driven by strong safe-haven demand, robust industrial buying and supply concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-insurance-and-policy-reforms-are-in-focus-2848241-2026-01-07",
      "headline": "Budget 2026: Why insurance and policy reforms are in focusAs Budget 2026 approaches, the insurance industry is pushing for structural tax reforms, enhanced retirement security, and measures to improve access to inclusive insurance products, focusing on how policy direction will impact premium financing and sector growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-bros-board-rejects-paramounts-revised-hostile-takeover-bid-says-netflix-deal-will-offer-superior-valu-2848267-2026-01-07",
      "headline": "Netflix offering better value: Warner Bros rejects Paramount's revised hostile bidParamount launched a hostile takeover bid worth USD 108.4 billion for Warner Bros. Discovery on December 8, disrupting Warner Bros' preliminary merger talks with Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-income-tax-recap-and-what-may-change-this-year-relief-focus-area-2848144-2026-01-07",
      "headline": "Budget 2026: Last year's income tax changes and what may be in focus this timeBudget 2025 delivered meaningful relief to a large section of salaried taxpayers, sharply narrowed the gap between the old and new tax regimes, and set the direction for how personal taxation would evolve going forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economy-rebounds-to-74-growth-in-fy26-on-strong-investment-push-2848118-2026-01-07",
      "headline": "India's GDP growth expected at 7.4% in FY26Government measures played an important role in supporting growth. Income tax relief and steps to rationalise GST rates helped shore up consumer demand, even as global conditions remained uncertain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-as-auto-energy-stocks-drag-despite-it-gains-2848100-2026-01-07",
      "headline": "Sensex, Nifty end lower as auto, energy stocks drag despite IT gainsThe S&P BSE Sensex was down by 102.20 points to close at 84,961.14, while the NSE Nifty50 lost 37.95 points to end at 26,140.75. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/airfare-spike-under-scanner-as-government-seeks-data-from-major-airlines-report-2848082-2026-01-07",
      "headline": "Airfare spike under scanner as government seeks data from major airlines: ReportIndia's Directorate General of Civil Aviation, which oversees safety, has written to airlines asking for average fares on each route they operated on, for economy and premium economy seats, over the period December 1-15, according to a report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/employer-not-paying-salary-incentives-bonus-legal-rights-india-law-2848058-2026-01-07",
      "headline": "Employer not paying salary or incentives? Here's what you can doCases of delayed salaries, unpaid incentives and withheld bonuses have become more frequent, especially in young companies and firms facing cash stress. Legal experts say salary and incentives are not favours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sebis-15-rule-sets-a-ceiling-on-broker-growth-explains-zerodhas-nithin-kamath-2848010-2026-01-07",
      "headline": "How Sebi's 15% rule sets a ceiling on broker growth, explains Zerodha's Nithin KamathNithin Kamath said Sebi has fixed a 15% open interest limit for brokers in the derivatives market. This means no single broker is allowed to hold more than 15% of the total market open interest at any given time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-silent-leaks-commissions-explained-2848011-2026-01-07",
      "headline": "The hidden cost quietly eating up to 25% of your mutual fund returnsA study by 1 Finance Research shows that over a 10-year holding period, more than 80% of equity mutual fund schemes leave investors in regular plans at least 25% worse off than those invested in the direct plan of the same scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-prices-drop-over-rs-5000-gold-slips-more-than-rs-1100-check-latest-rates-2847994-2026-01-07",
      "headline": "Silver prices drop over Rs 5,000, gold slips more than Rs 1,100. Check latest ratesAfter a strong rally in recent sessions, gold and silver prices turned lower on Wednesday. Silver saw a fall of more than Rs 5,000, while gold also became cheaper by more than Rs 1,100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-policy-mis-selling-agents-india-irdai-rules-explained-2847979-2026-01-07",
      "headline": "Inside India's insurance mis-selling problem and why it remains hard to fixInsurance mis-selling remains widespread even under regulatory watch. How does it keep slipping past rules, checks, and repeated warnings? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/amazon-pay-launches-fixed-deposit-service-with-returns-of-up-to-8-check-details-2847932-2026-01-07",
      "headline": "Amazon Pay launches fixed deposit service with returns of up to 8%. Check detailsAmazon Pay users can now do more than just pay bills and shop online. The company has launched a fixed deposit service that lets customers invest in FDs through the app, with returns going up to 8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-venezuelas-stock-market-jumped-50-percent-after-us-attack-2847896-2026-01-07",
      "headline": "Explained: Why Venezuela's stock market jumped 50% in a day after the US attackThe benchmark Venezuela IBC Index, which tracks shares traded in Caracas (capital of Venezuela), surged 50% in a single session on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-share-price-up-4-percent-why-jhunjhunwala-stock-is-rising-today-q3-results-brokerage-view-2847858-2026-01-07",
      "headline": "Titan share price up 4%: Why is the Jhunjhunwala stock rising today?The stock opened higher at Rs 4,200.45 compared with the previous close of Rs 4,111.10. During the session, it touched an intraday high of Rs 4282.00 and a low of Rs 4,200.45. The volume-weighted average price stood at Rs 4,254.78."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-184-points-lower-nifty-below-26150-titan-up-3-percent-2847854-2026-01-07",
      "headline": "Sensex opens 184 points lower, Nifty below 26,150; Titan up 3%The S&P BSE Sensex was down by 255.21 points to 84,808.13, while the NSE Nifty50 lost 72.90 points to 26,105.80 as of 9:47 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-today-outlook-2026-right-time-to-buy-sell-hold-2847852-2026-01-07",
      "headline": "Gold and silver rates today: Buy, wait or sell?Gold prices in India were largely steady on January 7, 2026, with only a marginal rise seen across purity levels. As per the latest data, 24K gold was priced at Rs 13,883 per gram, up by Rs 1."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-reacts-to-vicky-kaushal-katrina-kaif-naming-son-vihaan-from-uri-to-real-life-2848398-2026-01-07",
      "headline": "From Uri to real life: Aditya Dhar reacts to Vicky-Katrina naming son Vihaan Filmmaker Aditya Dhar responded warmly to Vicky Kaushal and Katrina Kaif naming their newborn son Vihaan. He noted the coincidence with Kaushal's role as Major Vihaan Shergill in the 2019 film Uri: The Surgical Strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhoot-bangla-akshay-kumar-horror-comedy-film-gets-release-date-2848372-2026-01-07",
      "headline": "Bhooth Bangla: Akshay Kumar's horror-comedy confirms May release. Check date here The makers of Bhooth Bangla, starring Akshay Kumar and Tabu, have announced a new release date for the much-anticipated horror comedy film. It was earlier slated to release on April 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/taskaree-trailer-emraan-hashmi-leads-high-stakes-customs-war-on-smugglers-2848362-2026-01-07",
      "headline": "Taskaree trailer: Emraan Hashmi leads high-stakes customs war on smugglers The trailer for Taskaree: The Smuggler's Web, featuring Emraan Hashmi, is out now. Directed by Neeraj Pandey, the Netflix series is set to premiere on January 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-vs-ranbir-kapoor-who-is-bollywood-true-box-office-dhurandhar-2848276-2026-01-07",
      "headline": "Ranveer Singh vs Ranbir Kapoor: Who is Bollywood's true box office Dhurandhar? A comparative analysis of Ranveer Singh and Ranbir Kapoor's box office performances highlights shifting trends, as Dhurandhar sets new industry benchmarks. Who's leading, who's trailing – let's have a look. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-jana-nayagan-release-postponed-europe-distributor-announces-2848314-2026-01-07",
      "headline": "Vijay's Jana Nayagan release postponed after court setback, new date awaited Amid the censor delay row, Thalapathy Vijay's much-anticipated film Jana Nayagan has been postponed. The film was slated to release on January 9. In an official statement, the makers have confirmed that a new release date will be announced soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/cobra-director-ajay-r-gnanamuthu-backs-thalapathy-vijay-jana-nayagan-amid-censor-delay-row-2848304-2026-01-07",
      "headline": "Cobra director backs Jana Nayagan amid censor delay row: Absolute misuse of power Cobra director Ajay R Gnanamuthu has expressed solidarity with Thalapathy Vijay's Jana Nayagan team following the film's release postponement. He highlighted the efforts of the film crew in an X post and commented on the broader impact of the delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-cancels-40th-birthday-fan-meet-says-toxic-is-his-priority-2848286-2026-01-07",
      "headline": "Yash cancels 40th birthday fan meet, says Toxic is his priority Yash informed his fans there would be no birthday meet this year as he dedicates his attention to finishing the film Toxic: A Fairy Tale for Grown-Ups. In a lengthy note on Instagram, the actor apologised and promised something bigger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-recalls-unsettling-early-days-in-mumbai-living-in-haunted-house-2848287-2026-01-07",
      "headline": "Hema Malini recalls unsettling early days in Mumbai, living in haunted house Hema Malini, famed for her work in Hindi cinema, shared a story from early days in Mumbai, including living in a haunted house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonu-nigam-performs-ghar-kab-aaoge-for-mumbai-police-ahead-of-border-2-release-2848272-2026-01-07",
      "headline": "Sonu Nigam performs Ghar Kab Aaoge for Mumbai Police ahead of Border 2 release Singer Sonu Nigam performed Ghar Kab Aaoge from the upcoming film Border 2 as a tribute to Mumbai Police. The film is set to release across theatres on January 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anil-kapoor-celebrates-43-years-kannada-debut-praises-kgf-kantara-2848234-2026-01-07",
      "headline": "Anil Kapoor marks 43 years of his Kannada debut, lauds Yash and Rishab Shetty Veteran actor Anil Kapoor celebrates 43 years since his Kannada film debut Pallavi Anu Pallavi. He applauds the booming Kannada cinema industry and hints at future collaborations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shruti-pathak-talks-bollywood-music-trends-from-end-of-fixed-voices-for-stars-to-ai-2848242-2026-01-07",
      "headline": "From end of fixed voices for stars to AI: Shruti Pathak talks Bollywood music trends Singer Shruti Pathak opened up the evolving music scene and the dying trend of fixed voices for actors. In an exclusive interview, she highlighted challenges like fading solo female songs and AI taking over creative spaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shark-tank-india-5-aman-gupta-takes-swipe-at-anupam-mittal-asks-about-his-closed-companies-2848223-2026-01-07",
      "headline": "Shark Tank India 5: Aman takes swipe at Anupam, asks about his closed companies A recent episode of Shark Tank India Season 5 featured a tense argument between judges Aman Gupta and Anupam Mittal, sparked by a pitch from Mumbai entrepreneurs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-in-haq-draws-farah-khan-praise-get-ready-to-receive-every-award-2848262-2026-01-07",
      "headline": "Yami Gautam in Haq draws Farah Khan's praise: Get ready to receive every award Yami Gautam continues to receive widespread praise for her performance in Haq, with Farah Khan lauding her work after watching the film on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-andhra-pradesh-government-clears-ticket-price-hike-for-prabhas-film-2848238-2026-01-07",
      "headline": "The Raja Saab: Prabhas film gets Andhra government clearance for ticket price hike Ticket prices for Prabhas' upcoming film The Raja Saab have been increased in Andhra Pradesh, with special premiere tickets set at Rs. 1000 and regular show prices raised for the first ten days after release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/honeymoon-se-hatya-ott-release-when-and-where-to-watch-crime-docuseries-2848188-2026-01-07",
      "headline": "Honeymoon Se Hatya OTT release: When and where to watch crime docuseries Honeymoon Se Hatya, a new docuseries directed by Ajitesh Sharma, will be available to stream on ZEE5. Directed by Ajitesh Sharma, it will be produced by Aditya Pittie and Samar Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sreeleela-opens-up-about-adopting-two-children-at-21-it-was-a-secret-2848185-2026-01-07",
      "headline": "Sreeleela opens up about adopting two children at 21: It was a secret Sreeleela has spoken about adopting two children and explained why she does not consider herself to be a traditional mother. While her adopted children do not live with her, the actor said she keeps visiting them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-digs-at-bigg-boss-19-winner-gaurav-khanna-during-dubai-reunion-2848147-2026-01-07",
      "headline": "Tanya Mittal takes a dig at Bigg Boss 19 winner Gaurav Khanna during Dubai reunion Tanya Mittal reignites rivalry with Bigg Boss 19 winner Gaurav Khanna during Dubai reunion. She shares emotional struggles and reasons for avoiding interviews post-show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vjays-jana-nayagan-censor-row-madras-high-court-reserves-order-2848187-2026-01-07",
      "headline": "Vijay's Jana Nayagan censor row: Madras High Court reserves order The Madras High Court has reserved its orders in the Jana Nayagan certification case after hearing arguments from the CBFC and producer KVN Studios over delays, complaints, and the film's U/A 16+ clearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gwyneth-paltrow-claims-divorce-from-coldplays-chris-martin-cost-her-a-movie-role-2848127-2026-01-07",
      "headline": "Gwyneth Paltrow claims divorce from Coldplay's Chris Martin cost her a movie role Oscar-winning actor Gwyneth Paltrow has spoken openly about the impact her divorce from Chris Martin had on her career. She revealed on a recent podcast that she was dismissed from a film project due to the scrutiny surrounding her personal life."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-russia-tension-venezuela-linked-oil-tanker-seized-atlantic-2848339-2026-01-07",
      "headline": "US, Russia nearing tensions after oil tanker seizure? What just happenedA high-seas seizure of a Russian-flagged oil tanker by US forces has brought Washington and Moscow to the brink of a new diplomatic clash. Russia has called the move illegal, while the US says it was enforcing sanctions linked to Venezuela."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-forces-trying-to-board-venezuela-linked-oil-tanker-from-helicopter-claims-russian-broadcaster-2848259-2026-01-07",
      "headline": "US seizes Russian-flagged oil tanker linked to Venezuela after dramatic chase  Live updatesUS officials had been tracking the tanker across the Atlantic after it evaded a US maritime blockade, refused repeated boarding requests by US Coast Guard personnel, and attempted to evade interdiction by changing flags and registration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-to-be-presented-on-sunday-february-1-economic-survey-to-be-tabled-on-january-29-2848353-2026-01-07",
      "headline": "Union Budget to be presented on Sunday, Feb 1; Economic Survey on Jan 29This will be only the second time the Union Budget will be presented on a Sunday. In 1999, the Budget was presented on a Sunday for the first time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-weather-update-january-8-delhi-fog-tamil-nadu-rain-imd-alert-devendra-tripathi-kisan-tak-mausam-tak-temperatures-in-india-2848273-2026-01-07",
      "headline": "Cold wave to peak: North India to experience freezing conditions tomorrowNorth India faces a severe cold wave and dense fog, disrupting travel in Delhi and Punjab on January 8. Meanwhile, a depression in the Bay of Bengal brings heavy rain warnings for Tamil Nadu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-jana-nayagan-release-postponed-europe-distributor-announces-2848314-2026-01-07",
      "headline": "Vijay's Jana Nayagan release postponed after court setback, new date awaitedAmid the censor delay row, Thalapathy Vijay's much-anticipated film Jana Nayagan has been postponed. The film was slated to release on January 9. In an official statement, the makers have confirmed that a new release date will be announced soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-seizes-russian-flagged-oil-tanker-live-updates-in-atlantic-marinera-2848338-2026-01-07",
      "headline": "Live: Seized vessel Sophia involved in illicit activities, says White HouseUS seizes Russian-flagged oil tanker live updates: The United States has seized a Russian-flagged oil tanker linked to Venezuela in the North Atlantic following a weeks-long pursuit that drew in Russian naval assets and was carried out with the knowledge and approval of the United Kingdom. The seizure of the vessel named Bella 1 has drawn a sharp response from Moscow, with Russia's Transport Ministry saying \"no state has the right to use force against vessels duly registered in other states' jurisdictions.\" Follow indiatoday.in to get all the live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-heaps-insults-nato-allies-us-greenland-annex-denmark-glbs-2848405-2026-01-08",
      "headline": "Trump heaps insults on NATO allies again, says it's nothing without AmericaDonald Trump claimed he had pushed allies to spend as much as 5 per cent of GDP on defence and to pay \"immediately\", portraying the shift as a personal achievement. Trump also asserted that without his involvement, Russia would have already taken control of all of Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-gaza-news-islamabad-may-or-may-not-go-to-palestine-but-hamas-comes-to-gujranwala-pok-lashkar-e-taiba-let-meet-2848090-2026-01-07",
      "headline": "Pak may or may not go to Gaza, but Hamas has come to PakVideos of Hamas leader Naji Zaher allegedly at a Lashkar-e-Taiba terror camp in Pakistan have emerged online. This confirms the growing ties between Hamas and Pakistani terrorist groups and comes even as Islamabad debates whether to send troops to Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-reacts-to-vicky-kaushal-katrina-kaif-naming-son-vihaan-from-uri-to-real-life-2848398-2026-01-07",
      "headline": "From Uri to real life: Aditya Dhar reacts to Vicky-Katrina naming son VihaanFilmmaker Aditya Dhar responded warmly to Vicky Kaushal and Katrina Kaif naming their newborn son Vihaan. He noted the coincidence with Kaushal's role as Major Vihaan Shergill in the 2019 film Uri: The Surgical Strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/darkest-day-of-my-life-vedanta-group-chairman-anil-agarwals-son-dies-of-cardiac-arrest-at-49-2848407-2026-01-08",
      "headline": "Darkest day of my life: Vedanta's Anil Agarwal's son dies of cardiac arrest at 49Agarwal's post referenced a longstanding pledge made between father and son to support several social priorities, such as food access, education for children, empowering women, and secure employment for young Indians. Agarwal renewed the promise to devote over 75% of group earnings to initiatives that benefit society.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-firm-icc-letter-venue-row-t20-world-cup-plea-india-2848297-2026-01-07",
      "headline": "Bangladesh firm on T20 World Cup stance: No cricket at cost of national dignityBangladesh have remained firm on their decision not to play T20 World Cup matches in India, citing security and national humiliation concerns following Mustafizur Rahman's exit from Kolkata Knight Riders, which has escalated tensions with India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/immigration-officer-fatally-shoots-woman-during-minneapolis-crackdown-glbs-2848406-2026-01-08",
      "headline": "US immigration officer fatally shoots woman during Minneapolis crackdownHomeland Security Secretary Kristi Noem, speaking during a visit to Texas, defended the officer's actions and the enforcement operation. She described the incident as an \"act of domestic terrorism\" directed at ICE officers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-bus-rams-into-auto-at-bhubaneswar-junction-driver-killed-on-the-spot-2848400-2026-01-07",
      "headline": "Video: Bus rams into auto at Bhubaneswar traffic junction, driver killed on spotThe crash, captured on video, led to chaos at the site, with the bus driver and conductor fleeing the scene and police launching a search."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-couple-welcome-baby-boy-after-19-years-of-marriage-10-daughters-fatehabad-latest-news-2847931-2026-01-07",
      "headline": "10 daughters and 19 years later, Haryana couple welcomes baby boyThe couple said they had long hoped for a son but never discriminated against their daughters. He said that he raised all his daughters just as he would raise a boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pm-narendra-modi-said-to-me-sir-may-i-see-you-please-donald-trumps-latest-2847934-2026-01-07",
      "headline": "'Sir, may I see you please,' PM Modi said: Trump's latest in his India remarksUS President Donald Trump claimed that Narendra Modi personally approached him over long-pending Apache helicopter deliveries and trade issues, while acknowledging a strong personal rapport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-secretary-of-state-marco-rubios-meet-with-denmark-next-week-after-trumps-greenland-remark-2848366-2026-01-07",
      "headline": "Rubio's meet with Denmark next week after Trump's Greenland remarkNotably, in recent months, Donald Trump has repeatedly stated his intention for the US to control Greenland, citing national security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-vs-ranbir-kapoor-who-is-bollywood-true-box-office-dhurandhar-2848276-2026-01-07",
      "headline": "Ranveer Singh vs Ranbir Kapoor: Who is Bollywood's true box office Dhurandhar?A comparative analysis of Ranveer Singh and Ranbir Kapoor's box office performances highlights shifting trends, as Dhurandhar sets new industry benchmarks. Who's leading, who's trailing – let's have a look. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/deliberately-creating-conditions-for-defaming-jnu-teachers-body-slams-admin-police-for-fir-against-students-2848335-2026-01-07",
      "headline": "Creating conditions for defaming JNU: Teachers' body slams police complaintThe JNU Teachers' Association has accused the university administration and the Delhi Police of deliberately trying to malign Jawaharlal Nehru University by seeking a complaint against students over slogan-raising at a JNUSU event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/can-donald-trump-be-impeached-us-midterm-congress-elections-2848193-2026-01-07",
      "headline": "Can Trump be impeached this year?US President Donald Trump has warned Republicans that if the party fails to get a majority in November's midterm elections this year, he might be impeached. What are the chances?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/30-30-30-rule-helps-professionals-change-careers-faster-2848060-2026-01-07",
      "headline": "Stuck in the wrong job? The 30-30-30 rule could be your way outThe 30-30-30 rule helps career-switchers make consistent progress without burnout. By spending 30 minutes learning, 30 minutes building skills, and 30 minutes networking daily, professionals can prepare for a career transition steadily, realistically, and with far less anxiety than all-or-nothing approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-entry-to-people-wearing-hijab-burqa-mask-at-bihar-jewellery-shops-2848369-2026-01-07",
      "headline": "No entry to people wearing hijab, burqa, mask at Bihar jewellery shopsJewellery shop owners across the state have decided to deny entry to anyone whose face is partially or fully covered — whether by a hijab, niqab, burqa, mask, helmet, muffler or veil — citing security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/shashi-tharoor-meets-kerala-teen-raul-john-aju-building-ai-in-indian-languages-on-vande-bharat-2848269-2026-01-07",
      "headline": "Shashi Tharoor meets Kerala teen building AI in Indian languages on Vande BharatCongress MP Shashi Tharoor met 16-year-old tech innovator Raul John Aju on a Vande Bharat train, discussing the importance of AI that supports India's linguistic diversity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-too-much-join-forces-through-sport-jason-holder-2848284-2026-01-07",
      "headline": "Don't like India-Pakistan cricket beef: Ex-West Indies captain calls for unityJason Holder says the India–Pakistan divide is sad and should not overshadow cricket. The West Indies all-rounder believes sport can play a role in easing political tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-shiv-sena-candidate-haji-saalim-qureshi-stabbed-civic-poll-campaign-mumbai-2848311-2026-01-07",
      "headline": "Shinde Sena candidate Haji Saalim Qureshi stabbed during poll campaign in MumbaiThe incident occurred around 5 pm in the Dnyaneshwar Nagar area of Bandra East, when Qureshi was engaged in door-to-door outreach as part of his campaign for Ward No. 92."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shadab-khan-comeback-leads-pakistan-t20i-win-sri-lanka-2848401-2026-01-07",
      "headline": "Start from zero: Shadab Khan relishes dream comeback with T20 World Cup in sight SL vs PAK, 1st T20I: Shadab Khan marked his T20I comeback with a Player of the Match performance against Sri Lanka, stressing that international returns mean starting from zero and focusing on one step at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-recovery-week-t20-world-cup-2026-plans-on-track-2848399-2026-01-07",
      "headline": "Shaheen Afridi likely to recover within a week, T20 World Cup 2026 plans on track Shaheen Afridi, Pakistan cricket team, knee injury update, Shaheen Afridi rehab, PCB medical team, T20 cricket Pakistan, Pakistan fast bowlers, Shaheen Afridi fitness, Lahore Qalandars, Pakistan cricket news"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-is-a-very-safe-place-telangana-minister-on-bangladesh-security-concerns-ytvd-2848394-2026-01-07",
      "headline": "'India Is A Very Safe Place': Telangana Minister On Bangladesh Security Concerns A Telangana minister and former Indian cricket captain addresses the recent concerns raised by the Bangladesh Cricket Association regarding security for the T20 World Cup in India. Dismissing these apprehensions, the speaker asserts, 'I think India is a very safe place,' and emphasizes that the tournament will proceed in the country with 'no second way.' The interviewee suggests that any decision made by the BCCI would have been discussed with the government, prioritizing the larger interest of security. Referring to the situation as Bangladesh's 'lookout,' the former captain expresses confidence in India's security system. The discussion also briefly touches upon a recent controversy involving a Bangladeshi cricketer. The minister concludes by affirming that the event will go ahead as planned, regardless of the concerns raised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-hans-niemann-joint-leaders-tata-steel-chess-india-rapid-event-2848384-2026-01-07",
      "headline": "Tata Steel Chess: Viswanathan Anand rolls back the years to share Rapid lead on Day 1 Former world champion Viswanathan Anand marked his return with two key wins to end day one tied at the top with Hans Niemann, as Carissa Yip led the women's section with 2.5 points after three rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-aims-to-become-club-owner-football-development-after-retirement-2848390-2026-01-07",
      "headline": "Lionel Messi dismisses coaching interest, prefers club ownership after retirement Lionel Messi expresses a clear preference for club ownership over coaching after his playing career, following a season of record-breaking achievements. The football legend outlines his vision for youth development and continued involvement in football off the pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyanka-patil-comeback-bumrah-inspiration-wpl-2026-rcb-2848327-2026-01-07",
      "headline": "How Jasprit Bumrah inspired Shreyanka Patil to bounce back after injury Indian all-rounder Shreyanka Patil credits Jasprit Bumrah's guidance during her injury-hit layoff for helping her regain confidence as she prepares for a WPL 2026 comeback with RCB against Mumbai Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-century-wicket-india-u19-whitewash-south-africa-benoni-2848313-2026-01-07",
      "headline": "Vaibhav Suryavanshi's heroics with bat and ball leads India-U19 to 3-0 whitewash Vaibhav Suryavanshi led from the front with a century and a wicket as India U-19 crushed South Africa by 233 runs to seal a dominant 3-0 whitewash in the Youth ODI series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-firm-icc-letter-venue-row-t20-world-cup-plea-india-2848297-2026-01-07",
      "headline": "Bangladesh firm on T20 World Cup stance: No cricket at cost of national dignity Bangladesh have remained firm on their decision not to play T20 World Cup matches in India, citing security and national humiliation concerns following Mustafizur Rahman's exit from Kolkata Knight Riders, which has escalated tensions with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-too-much-join-forces-through-sport-jason-holder-2848284-2026-01-07",
      "headline": "Don't like India-Pakistan cricket beef: Ex-West Indies captain calls for unity Jason Holder says the India–Pakistan divide is sad and should not overshadow cricket. The West Indies all-rounder believes sport can play a role in easing political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-must-now-move-on-from-bazball-ashes-michael-vaughan-2848275-2026-01-07",
      "headline": "England must now move on from failed Bazball project after Ashes: Vaughan England must finally move away from their high-risk 'Bazball' approach and return to Test cricket basics after their Ashes defeat, former captain Michael Vaughan said in an interview with Reuters on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-bcci-clearance-fitness-new-zealand-odi-return-2848224-2026-01-07",
      "headline": "Shreyas Iyer declared fit by BCCI, cleared for New Zealand ODI seriesShreyas Iyer has been declared fit for international cricket after receiving clearance from the Board of Control for Cricket in India (BCCI) Centre of Excellence (CoE), removing the final medical hurdle ahead of India's ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-focus-india-odi-series-before-t20-world-cup-daryl-mitchell-2848215-2026-01-07",
      "headline": "New Zealand worried about ODI series vs India, not T20 World Cup: Daryl MitchellNew Zealand are not dwelling on the T20 World Cup, which is still a month away, and are instead focused on the immediate challenge of taking on India's bowlers in the upcoming white-ball series, batter Daryl Mitchell said on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-credits-wpl-mumbai-indians-winning-mindset-2848200-2026-01-07",
      "headline": "Harmanpreet Kaur credits WPL, Mumbai Indians for bringing that winning mindset in herAhead of the Women's Premier League season in Mumbai, players and coaches highlight the transformative impact of the franchise and the WPL on Indian women's cricket, linking domestic professionalism to international triumphs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-consider-ole-solskjaer-carrick-caretaker-managers-report-2848184-2026-01-07",
      "headline": "Solskjaer, Carrick frontrunners for caretaker role at Manchester United: ReportManchester United are weighing up a short-term return to familiar faces, with Ole Gunnar Solskjær and Michael Carrick emerging as the leading contenders to take over as caretaker manager until the end of the season, according to reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yo-yo-honey-singh-to-womens-premier-league-opening-ceremony-navi-mumbai-2848174-2026-01-07",
      "headline": "Yo Yo Honey Singh, Jacqueline Fernandez set to perform in WPL 2026 opening ceremonyYo Yo Honey Singh and Jacqueline Fernandez will headline the WPL 2026 opening ceremony in Navi Mumbai, adding star power and high-energy entertainment ahead of the RCB vs MI season opener on Friday, January 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/renuka-singh-thakur-gujarat-giants-wpl-bowling-key-title-hopes-2848150-2026-01-07",
      "headline": "Gujarat Giants bank on Renuka Singh boost to change fortunesWPL 2026: Fast bowler Renuka Singh, who played the first three seasons for the Royal Challengers Bengaluru (RCB), is now set to represent the Gujarat Titans in the Women's Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kobbie-mainoo-returns-training-manchester-united-ruben-amorim-sacked-2848126-2026-01-07",
      "headline": "Kobbie Mainoo returns to training for Manchester United after Ruben Amorim's sackingKobbie Mainoo returned to training as Manchester United prepares for life after Ruben Amorim. The midfielder could feature against Burnley as Darren Fletcher takes interim charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-mobbed-fans-vadodara-airport-ind-vs-nz-odi-series-2848096-2026-01-07",
      "headline": "Virat Kohli mobbed by fans on arrival at Vadodara ahead of New Zealand ODIs: WatchVirat Kohli received a rousing welcome in Vadodara ahead of India's ODI series against New Zealand. The batting great arrives in red-hot form for his first international outing of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-century-five-countries-india-under-19-youth-odi-2848051-2026-01-07",
      "headline": "New Year, same hunger: Vaibhav Suryavanshi smashes 63-ball hundred in South AfricaIndia vs South Africa, 3rd Youth ODI: Vaibhav Suryavanshi hit a 63-ball hundred, bringing up his first three-figure score on South African soil. The 14-year-old was leading India U19 against South Africa on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-recovery-pakistan-t20-world-cup-salman-ali-agha-2848045-2026-01-07",
      "headline": "Pakistan hopeful of pacer Shaheen Afridi's recovery ahead of T20 World CupPakistan's T20 captain Salman Ali Agha has expressed optimism over Shaheen Shah Afridi's recovery from a knee injury, saying the premier pacer is on track to regain full fitness in time for next month's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-wins-malaysia-open-opening-match-satwik-chirag-strong-doubles-2848038-2026-01-07",
      "headline": "PV Sindhu, Satwik-Chirag make winning starts to 2026 seasonMalaysia Open 2026: PV Sindhu made a winning return to the circuit, beating Chinese Taipei's Sung Shuo Yun in straight games. While third seeds Satwiksairaj Rankireddy and Chirag Shetty eased into the second round in men's doubles, Gayatri Gopichand and Treesa Jolly were knocked out in women's doubles first round on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-clubs-mansukh-mandaviya-mohun-bagan-mispronounced-troll-criticism-watch-video-2848036-2026-01-07",
      "headline": "Mohan Baigan, East Baigan: Sports Minister flubs iconic club namesIndia's Sports Minister mispronouncing Mohun Bagan and East Bengal during an ISL press conference sparked instant backlash. The slip-up overshadowed the league's restart announcement and reopened questions around football awareness at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-vs-ayush-sindhu-vs-nguyen-tricky-opening-round-draw-indians-india-open-2848031-2026-01-07",
      "headline": "India Open: Lakshya vs Ayush in 1st round as Indian shuttlers handed brutal drawLakshya Sen opens his title defence against fellow Indian Ayush Shetty in the first round of the India Open 2026, as Indian shuttlers face a demanding draw on home turf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/angad-vir-singh-bajwa-india-shotgun-shooting-switch-nationality-canada-asian-games-2847999-2026-01-07",
      "headline": "India's Asian Games medallist chooses Canada. Why shooter Angad Bajwa made the switchAsian Games hopeful Angad Vir Singh Bajwa has ended his Indian chapter by switching nationality to Canada. Backed by formal NRAI clearance, the move reflects personal roots abroad and a carefully weighed career decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-england-vs-australia-sydney-test-day-4-jacob-bethell-hundred-2847977-2026-01-07",
      "headline": "SCG Test: Bethell's heroic century delays the inevitable for England on Day 4Jacob Bethell stood between England and defeat for most of Day 4 at the Sydney Cricket Ground, producing a composed maiden Test century in an innings otherwise marked by familiar collapses. The 22-year-old walked off unbeaten on 142 at stumps as England closed on 302 for eight, holding a modest lead of 119 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-bethell-maiden-test-century-ashes-england-vs-australia-scg-2847969-2026-01-07",
      "headline": "Tears in the stands as Jacob Bethell hits maiden Test hundred in SydneyAshes 2025-26: Jacob Bethell's father was moved to tears after his 22-year-old son hit his maiden Test hundred in Sydney on Wednesday. Bethell remained unbeaten on 142 as England went to Stumps on Day 4 of the fifth Test with a 119-run lead and two wickets in hand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-delhi-capitals-captain-interview-wpl-2026-2847946-2026-01-07",
      "headline": "Jemimah Rodrigues faces stern test of acing huge Delhi Capitals captaincy challengeWPL 2026: Jemimah Rodrigues will lead Delhi Capitals for the first time, but she has prior experience of captaining at the domestic level. The youngster has a big task ahead, replacing the legendary Meg Lanning at the Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-batmobile-collection-luxury-cars-private-jet-batcopter-santos-brazil-fifa-world-cup-2847960-2026-01-07",
      "headline": "Neymar lives Batman dream with million-dollar Batmobile, Batcopter and jet flexNeymar has fulfilled a childhood dream by adding a Batmobile to his collection. Parked beside his Batcopter and private jet, the purchase underlines the Brazilian star's flair for the extraordinary off the pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricket-board-denies-icc-ultimatum-t20-world-cup-2026-india-2847950-2026-01-07",
      "headline": "Bangladesh deny claims of ICC ultimatum over not playing T20 World Cup in IndiaThe Bangladesh Cricket Board on Wednesday firmly rejected media reports suggesting it had received an ultimatum from the International Cricket Council regarding Bangladesh's participation in the ICC Men's T20 World Cup 2026, set to be hosted in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-sports-broadcaster-ridhima-pathak-withdraws-bangladesh-premier-league-india-bangladesh-cricket-tensions-2847909-2026-01-07",
      "headline": "Dropped from Bangladesh Premier League? Indian sports presenter clarifies exitIndian sports presenter Ridhima Pathak has clarified her exit from the Bangladesh Premier League, affirming her decision was voluntary amid ongoing India-Bangladesh cricket tensions. Bangladesh banned the broadcast of the IPL 2026 in the country after Mustafizur Rahman's contract was terminated by the BCCI. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}