{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-share-price-listing-at-25-percent-premium-subscribe-or-not-2608518-2024-09-30",
      "headline": "Manba Finance shares list at 25% premium over IPO priceManba Finance IPO listing: Despite making a decent debut on the stock exchanges, the listing fell short of what the GMP had indicated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-slumps-700-points-nifty-falls-below-26000-amid-profit-booking-2608512-2024-09-30",
      "headline": "Sensex slumps 700 points, Nifty falls below 26,000 amid profit bookingThe S&P BSE Sensex was down 685.85 points to 84,886 at 10:14 am, while the NSE Nifty50 fell 191.60 points to 25,987.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-modi-vs-modi-in-godfrey-phillips-family-saga-2608095-2024-09-29",
      "headline": "Modi vs Modi: The succession war brewing at Godfrey PhillipsAs the legal showdown unfolds, it's Modi vs Modi in a gripping battle that tests family bonds and determines the future of Godfrey Phillips India, highlighting ambition, legacy, and loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akriti-chopra-zomato-co-founder-and-chief-people-officer-resigns-2607590-2024-09-27",
      "headline": "Akriti Chopra, Zomato co-founder and Chief People's Officer, resignsIn an email to Zomato CEO Deepinder Goyal, Akriti Chopra announced her decision to resign with immediate effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-draft-paper-drhp-sebi-rs-10000-crore-ofs-promoters-zomato-2607407-2024-09-27",
      "headline": "Swiggy files for Rs 10,000 crore IPO: Here's all you need to knowSwiggy's IPO will consist of two main parts: a fresh issue of equity shares worth Rs 3,750 crore, and an offer for sale (OFS) of 18.52 crore shares by existing stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-once-had-a-rs-10000-note-rbi-1938-know-why-it-was-discontinued-2607398-2024-09-27",
      "headline": "India once had a Rs 10,000 note. Know why it was discontinuedThe history of India's Rs 10,000 note dates back to the pre-independence era. In 1938, the Reserve Bank of India (RBI) issued its first Rs 10,000 note, the largest denomination ever printed in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-check-latest-gmp-subscription-status-allotment-expected-listing-gain-2607230-2024-09-27",
      "headline": "KRN Heat Exchanger IPO: Check latest GMP, subscription status, other detailsKRN Heat Exchanger opened for subscription on September 25 looking to raise Rs 341.95 crore from its public issue, and has already seen bids of over 80 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-wipro-it-stocks-rally-4-percent-accenture-fy25-guidance-boost-2607196-2024-09-27",
      "headline": "Accenture guidance boost lifts Infosys, Wipro; IT stocks rally up to 4%Accenture not only exceeded market expectations for its Q4 results but also raised its revenue guidance for FY25 to a range of 3-6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-record-high-for-6th-straight-session-2607157-2024-09-27",
      "headline": "Sensex, Nifty hit record high for 6th straight sessionThe S&P BSE Sensex added 67.47 points to 85,903.59, while the NSE Nifty50 gained 14.70 points to 26,230.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-hamas-war-lebanon-beirut-airstrike-2608442-2024-09-30",
      "headline": "4 killed in Israeli strike on building in Beirut, 1st attack inside city limits Live UpdatesAs Israel continued to strike Lebanon, the Health Ministry in Beirut claimed that at least 105 people were killed in the attacks in the past 24 hours. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-congress-mallikarjun-kharge-ill-prime-minister-narendra-modi-jammu-and-kashmir-2608505-2024-09-30",
      "headline": "Amit Shah slams Congress chief over remarks on PM: Bitter display of spiteAmit Shah hit out at Congress President Mallikarjun Kharge for his statement about ousting PM Modi before dying, suggesting it reflects the \"hatred and fear\" the Congress has towards the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-strikes-houthis-yemen-hezbollah-lebanon-war-hassan-nasrallah-gaza-palestine-2608417-2024-09-29",
      "headline": "Israel turns up heat on Houthis in Yemen after crippling Hezbollah, 4 deadIsraeli forces have launched aggressive aerial assaults on the Iran-backed militias in the region, including Hezbollah in Lebanon and Houthis in Yemen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bookmyshow-ceo-ashish-hemrajani-summoned-again-black-marketing-coldplay-concert-mumbai-2025-tickets-2608510-2024-09-30",
      "headline": "BookMyShow CEO summoned again over black marketing of Coldplay concert ticketsBookMyShow CEO Ashish Hemrajani has been asked to appear today before the investigating officer to record his statement.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-to-be-honoured-with-dadasaheb-phalke-award-2608499-2024-09-30",
      "headline": "Mithun Chakraborty to be honoured with Dadasaheb Phalke AwardActor Mithun Chakraborty, who made his acting debut with the art house drama Mrigayaa (1976), will soon be honoured with the Dadasaheb Phalke Award. He will receive the award at the 70th National Film Awards ceremony on October 8."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-flood-rain-champaran-bagmati-gandak-imd-forecast-alert-kosi-muzaffarpur-gopalganj-2608467-2024-09-30",
      "headline": "Bihar floods: Schools, power grid inundated, 6 barrages breached in 24 hoursHeavy rain in Nepal's catchment areas has caused many rivers in Bihar to flow at or above danger levels in several bordering districts, affecting thousands of people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-vardhman-group-chief-sp-oswal-duped-of-rs-7-crore-by-cyber-criminals-arrested-in-ludhiana-2608468-2024-09-30",
      "headline": "Industrialist SP Oswal duped of Rs 7 crore by cyber criminals, 2 arrestedA complaint was filed by the Vardhman Group alleging that their CMD SP Oswal was duped by unidentified cyber criminals for Rs 7 crore. Two people were arrested by the Ludhiana Police in connection with the case and efforts are being made to arrest seven other members of the gang."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-wants-wars-no-end-game-jordan-minister-sadafi-escalating-middle-east-tensions-2608490-2024-09-30",
      "headline": "Israel only wants wars, no end game: Jordanian Minister on Middle East tensionsJordan Foreign Minister Ayman Safadi said it took 30 years to convince people that peace is possible but the Israeli govenrment led by Benjamin Netanyahu \"killed\" it.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-passengers-scream-at-mumbai-airport-ground-staff-delayed-flight-viral-video-2608509-2024-09-30",
      "headline": "IndiGo passengers yell at airport ground staff over delayed flight. Video is viralThe viral video showed IndiGo passengers lashing out at female ground staff near the boarding gate. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-minor-boy-gang-raped-in-hapur-bystanders-record-video-2608485-2024-09-30",
      "headline": "Boy, 5, gang-raped in Uttar Pradesh's Hapur, bystanders record videoThe accused took the boy from his home to a nearby field and then gang-raped him. Two goat herders, who were present in the field, recorded a video and also shared it on the internet, the child's family said in its complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/crew-9-mission-docks-space-station-to-return-sunita-williams-from-space-space-x-nasa-elon-musk-2608452-2024-09-30",
      "headline": "SpaceX Crew-9, Sunita Williams' new ride home, arrives at space stationNasa's decision to switch Williams and Wilmore to SpaceX has extended their mission on the ISS by several months. Originally scheduled to return after an eight-day mission, they will now remain on the station until late February."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-floods-deaths-rescue-efforts-missing-people-2608453-2024-09-30",
      "headline": "170 dead in Nepal floods, search ops on for 42 missing peopleNepal Floods News: As many as 4,000 people affected by flood-related incidents have been rescued and relief material has been provided. National highways in Nepal have been blocked since Saturday, with several people trapped due to landslides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-tells-pakistani-fan-borders-made-by-politicians-punjabis-love-all-2608497-2024-09-30",
      "headline": "Diljit Dosanjh tells Pakistani fan: Borders made by politicians, Punjabis love allA video of Diljit Dosanjh interacting with a Pakistani fan at his Manchester concert is being shared widely on the internet. In the video, the singer says for him, India and Pakistan are one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-defence-minister-pakistan-imf-fund-economy-better-relations-shehbaz-sharif-2608450-2024-09-30",
      "headline": "India could have outmatched IMF funds to Pak if ties were better: Rajnath SinghDefence Minister Rajnath Singh accused Pakistan of 'seeking money from other countries to run a terrorist factory on its soil', while the country faces one of the worst economic crises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/ground-report-how-money-is-exchanged-at-lebanon-syria-border-explains-ashraf-wani-2608412-2024-09-29",
      "headline": "Ground Report: How money is exchanged at Lebanon-Syria border: Ashraf WaniAfter violence between Hezbollah and Israel escalated, tens of thousands of people from war-torn Lebanon crossed the border to arrive in Syria. There is an interesting banking system at the Lebanese-Syrian border, India Today's Ashraf Wani explained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/heavy-rain-leptospirosis-disease-punjab-chief-minister-bhagwant-mann-2608511-2024-09-30",
      "headline": "Punjab Chief Minister underwent treatment for leptospirosis: All about itPunjab Chief Minister Bhagwant Mann recently underwent treatment for leptospirosis, a bacterial infection spread through contaminated water."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chief-minister-siddaramaiah-muda-scam-resignation-high-court-lokayukta-police-2608464-2024-09-30",
      "headline": "Won't resign as long as I have people's support: Siddaramaiah on Muda 'scam'Karnataka Chief Minister Siddaramaiah said that he won't be \"scared or intimidated\" by political challenges, amid calls for his resignation by Opposition party after a case was registered him in the MUDA land scam case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tim-walz-jd-vance-vice-president-debate-preparation-strategy-us-election-kamala-harris-donald-trump-2608479-2024-09-30",
      "headline": "Stand-ins and nerves: Tim Walz, JD Vance gear up for big Veep debateAfter Donald Trump's refusal to participate in a second debate with Kamala Harris, the vice-presidential debate is being seen as a crucial moment in the campaign, with both candidates aiming to sway undecided voters in the heartland. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/video/ground-report-beirut-roads-remain-empty-as-israel-continues-to-pound-lebanon-2608415-2024-09-29",
      "headline": "Ground Report: Beirut roads remain empty as Israel continues to pound LebanonA normally bustling South Beirut roads turned quiet and deserted amid the firing of missiles and devastating airstrikes between Israel and Lebanon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/in-pics-nasrallahs-killing-beirut-israeli-airstrike-buildings-sunken-ground-site-2608422-2024-09-29",
      "headline": "In pics: Buildings sunken to ground at site of Nasrallah's killing in BeirutTwo days after the attack in which Hezbollah leader Hassan Nasrallah was assassinated, devastation was witnessed at the site and people were seen offering prayers and paying their respects to Nasrallah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/demolition-rg-kar-hospital-demolition-renovation-seminar-hall-document-kolkata-doctor-rape-murder-2608421-2024-09-29",
      "headline": "Demolition at Kolkata hospital days after doctor's rape, document reveals whyA total of eight people signed the document. Following that, hospital authorities started renovating the area in front of the seminar hall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-eight-haryana-leaders-expelled-six-years-contest-independently-haryana-assembly-polls-2608407-2024-09-29",
      "headline": "BJP expels 8 Haryana leaders for six years over choosing to contest independentlyRanjit Singh Chautala decided to quit the saffron party after he was denied the poll ticket from Rania, the seat he represented in the Assembly when he was an independent MLA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-varun-chakravarthy-t20i-comeback-ipl-kkr-2608454-2024-09-30",
      "headline": "Varun Chakravarthy earns second chance to prove his worth for IndiaIndia vs Bangladesh: Varun Chakravarthy has made a remarkable return to the Indian T20I team for the series against Bangladesh. The 33-year-old mystery spinner's journey back into the squad is a story of perseverance and determination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-reacts-to-srk-vicky-kaushal-dancing-to-oo-antava-at-iifa-2024-2608507-2024-09-30",
      "headline": "Samantha reacts to SRK, Vicky Kaushal dancing to Oo Antava at IIFA 2024Samantha reacted to Shah Rukh Khan and Vicky Kaushal dancing to Oo Antava at IIFA 2024. Sharing a video of the same, she shared her reaction on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/taimur-ali-khan-jeh-twin-inaaya-naumi-kemmu-7th-birthday-bash-2608501-2024-09-30",
      "headline": "Taimur Ali Khan-Jeh twin at cousin Inaaya's 7th birthday bashSoha Ali Khan and Kunal Kemmu's daughter, Inaaya Naumi Kemmu, turned 7 on September 29. A small party was hosted by the couple, attended by Saif Ali Khan and Kareena Kapoor Khan with their kids, Taimur Ali Khan and Jeh, and with others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-tells-pakistani-fan-borders-made-by-politicians-punjabis-love-all-2608497-2024-09-30",
      "headline": "Diljit Dosanjh tells Pakistani fan: Borders made by politicians, Punjabis love allA video of Diljit Dosanjh interacting with a Pakistani fan at his Manchester concert is being shared widely on the internet. In the video, the singer says for him, India and Pakistan are one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-to-be-honoured-with-dadasaheb-phalke-award-2608499-2024-09-30",
      "headline": "Mithun Chakraborty to be honoured with Dadasaheb Phalke AwardActor Mithun Chakraborty, who made his acting debut with the art house drama Mrigayaa (1976), will soon be honoured with the Dadasaheb Phalke Award. He will receive the award at the 70th National Film Awards ceremony on October 8."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}