{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/shefali-jariwala-husband-parag-tyagi-requests-paps-to-stop-with-folded-hands-2747550-2025-06-28",
      "headline": "Please mat karo: Shefali Jariwala's husband requests paps with folded handsShefali Jariwala reportedly died of a cardiac arrest last night. Her body was brought to Cooper Hospital for postmortem. Shefali's husband, Parag Tyagi, was photographed as he arrived at the hospital. He was seen requesting the media with folded hands. \"Please, mat karo,\" the actor was heard telling the paparazzi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-confirms-andaz-apna-apna-2-talks-about-collaborating-with-shah-rukh-khan-salman-2747519-2025-06-28",
      "headline": "Aamir Khan confirms Andaz Apna Apna 2, talks about collaborating with SRK, SalmanAamir Khan has confirmed that 'Andaz Apna Apna 2' is in development. He also expressed interest in collaborating with Shah Rukh Khan and Salman Khan in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dies-at-42-kannada-debut-puneeth-rajkumar-film-hudugaru-2747520-2025-06-28",
      "headline": "Shefali Jariwala dies at 42: Actor made Kannada debut in Puneeth Rajkumar's filmTelevision actor and model Shefali Jariwala died at the age of 42 at her Andheri residence on Friday night. She made her South debut with a special song in late Puneeth Rajkumar's Kannada film, 'Hudugaru'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-a-look-back-at-the-life-and-career-of-the-kaanta-laga-fame-actor-2747490-2025-06-28",
      "headline": "Shefali Jariwala: A look back at the life and career of the Kaanta Laga fame actor'Kaanta Laga' and 'Bigg Boss 13' fame Shefali Jariwala died late Friday night. The 42-year-old was also part of other Indian reality shows and films. Here's all about her life and career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-box-office-collection-day-1-vishnu-manchu-film-outperforms-maa-f1-in-india-2747497-2025-06-28",
      "headline": "Kannappa box office Day 1: Vishnu Manchu's film outperforms Maa, F1 in IndiaVishnu Manchu's 'Kannappa' received positive reviews from critics and audiences alike upon its release on June 27. The film has outperformed Kajol's 'Maa' and Brad Pitt's 'F1' in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-shefali-jariwala-husband-parag-tyagi-all-you-need-to-know-actor-2747487-2025-06-28",
      "headline": "Who is Parag Tyagi? All you need to know about Shefali Jariwala's husbandActor and model Shefali Jariwala, best known for the 'Kaanta Laga' music video, died at her Mumbai home on Friday night. She was 42. She was married to actor Parag Tyagi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-cause-not-clear-mumbai-police-official-statement-on-kaanta-laga-girl-sudden-passing-2747481-2025-06-28",
      "headline": "Cause of Shefali Jariwala's death not clear: Mumbai PoliceActor Shefali Jariwala was found dead at her residence in Mumbai on Friday night. The Mumbai Police later released a statement clarifying that a forensic team was still at her residence, and they have started investigating the case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-to-lead-world-largest-independence-day-parade-new-york-august-2747478-2025-06-28",
      "headline": "Vijay Deverakonda, Rashmika Mandanna to lead largest India Day parade in New YorkVijay Deverakonda and Rashmika Mandanna are the grand marshals to lead the world's largest India Day parade in New York on August 17. The two confirmed their presence with personalised video messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-kaanta-laga-fame-death-fan-tribute-reaction-2747471-2025-06-28",
      "headline": "Shefali Jariwala dies at 42: Tributes pour in from grieving fansActor Shefali Jariwala, best known for her wildly popular song 'Kaanta Laga', has died. Heartbroken fans remembered her on social media and shared heartfelt tributes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/50-cent-criticises-zohran-mamdani-millionaire-tax-hike-new-york-2747457-2025-06-28",
      "headline": "50 Cent slams Mamdani's millionaire tax plan in NYC: Will pay to send him outRapper 50 Cent has lashed out at NYC's Democratic mayor pick Zohran Mamdani's proposed tax increase on millionaires in the city. The dispute highlights tensions around tax policies, targeting the wealthy in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ileana-dcrux-michael-dolan-announce-birth-of-son-keanu-priyanka-chopra-congratulates-2747464-2025-06-28",
      "headline": "Ileana D'Cruz announces birth of son Keanu, Priyanka Chopra wishes parentsIleana D'Cruz and her partner, Michael Dolan, announced the birth of their second child, a baby boy. She shared a photo of the newborn and revealed their son's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dead-news-update-health-condition-struggle-with-depression-epilepsy-2747455-2025-06-28",
      "headline": "When Shefali Jariwala opened up about her struggle with depression, epilepsyShefali Jariwala health: Actor Shefali Jariwala, who died on Friday night, once opened up about her health. She revealed in an interview that she was struggling with epilepsy while growing up, and also battling anxiety and depression. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naa-ninna-bidalare-anant-nags-classic-is-a-battle-between-obsession-and-devotion-2741910-2025-06-28",
      "headline": "Naa Ninna Bidalare: Anant Nag's classic is a battle between obsession and devotion'Naa Ninna Bidalare' is a 1979 Kannada horror film directed by Vijay Reddi. The film stars Padma Bhushan Anant Nag and National Award-winner Lakshmi in lead roles. Referred to as one of the greatest horror films in Kannada cinema, 'Naa Ninna Bidalare' remains a classic till date due to its timeless music and spine-chilling horror. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-last-x-post-for-sidharth-shukla-both-of-whom-died-in-40s-2747440-2025-06-28",
      "headline": "Shefali Jariwala's last X post was for her dost and ex-boyfriend Sidharth ShuklaShefali Jariwala, popular television actor and model, died at her Mumbai home at the age of 42. Her last X post was a tribute to her late friend and former boyfriend Sidharth Shukla on his death anniversary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/sidharth-shukla-shefali-jariwala-cardiac-arrest-deaths-young-celebrities-heart-risk-2747437-2025-06-28",
      "headline": "Sidharth Shukla, Shefali Jariwala die 4 years apart from cardiac arrestActor Shefali Jariwala died of cardiac arrest at 42, nearly four years after Sidharth Shukla died due to the same cause. Their death highlights growing concerns over heart ailments among young Indian celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-dies-42-mika-singh-aly-goni-celebs-mourn-2747429-2025-06-28",
      "headline": "Mika Singh, Aly Goni to Paras Chhabra, celebs mourn Shefali Jariwala's deathActor Shefali Jariwala, known for her 'Bigg Boss 13' stint and the hit 'Kaanta Laga', died at the age of 42 following a cardiac arrest. Her untimely death has left the entertainment industry and fans in shock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/katy-perry-orlando-bloom-break-up-after-almost-a-decade-together-heres-why-glbs-2747410-2025-06-28",
      "headline": "Katy Perry, Orlando Bloom break up after almost a decade together: Here's whyKaty Perry and Orlando Bloom have split after nine years together. Despite a strong bond and a child, growing distance, conflicting careers, and solo appearances triggered the end of their engagement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shefali-jariwala-death-kaanta-laga-actor-cardiac-arrest-2747409-2025-06-28",
      "headline": "Shefali Jariwala of Kaanta Laga fame dies at 42, cardiac arrest reported cause Latest UpdatesKaanta Laga and Bigg Boss 13 fame Shefali Jariwala died at 42, reportedly due to a cardiac arrest late Friday night. She was rushed to the hospital by her husband, Parag Tyagi, but was declared dead.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-on-how-confronting-mahesh-bhatt-for-saaransh-changed-his-life-2747340-2025-06-27",
      "headline": "Exclusive: Anupam Kher on how confronting Mahesh Bhatt for Saaransh changed his lifeVeteran actor Anupam Kher reflected on a defining moment in his career when he was removed from the film 'Saaransh' just days before shooting, His upcoming film 'Metro... In Dino' highlights similar themes of speaking up and connecting with others. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/security-guard-of-kolkata-law-college-arrested-in-gang-rape-case-4-people-caught-so-far-2747511-2025-06-28",
      "headline": "Kolkata law college guard arrested in gang-rape case, he failed to report assaultA security guard of the South Kolkata Law College has been arrested in connection with the gang-rape of a first-year law student, marking the fourth arrest in the incident amid massive outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-a-look-back-at-the-life-and-career-of-the-kaanta-laga-fame-actor-2747490-2025-06-28",
      "headline": "Shefali Jariwala: A look back at the life and career of the Kaanta Laga fame actor'Kaanta Laga' and 'Bigg Boss 13' fame Shefali Jariwala died late Friday night. The 42-year-old was also part of other Indian reality shows and films. Here's all about her life and career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-schools-zumba-dance-sessions-muslim-organisations-object-2747495-2025-06-28",
      "headline": "Kerala introduces Zumba in schools, Muslim outfits don't dance to its tuneThe Kerala education department has introduced Zumba in schools. However, several Muslim organisations have objected to girls and boys 'dancing together wearing minimal clothes'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/isro-wake-up-celebrate-astronaut-shubhanshu-shukla-axiom-4-mission-2747427-2025-06-28",
      "headline": "Wake up Isro! You forgot to celebrate your own astronautIndia celebrated its latest space hero, but Isro's silence stole the spotlight. The agency's muted media play risks dulling the pride of a nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-birmingham-test-rest-analysis-impact-2747469-2025-06-28",
      "headline": "No Bumrah, no glory? Can India win a Test in England without their ace?England vs India: With Jasprit Bumrah likely to miss the second Test of the Anderson-Tendulkar Trophy, India's already daunting challenge in England has become even more formidable. We explore whether India can win overseas without their pace spearhead and what the numbers, history, and selection options reveal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-condemns-viral-celebration-video-ahmedabad-plane-crash-2747421-2025-06-28",
      "headline": "Air India venture fires 4 staffers over viral office party video days after crashAISATS has expressed regret over a viral office celebration video allegedly shot after the AI 171 crash and has dismissed four senior executives involved. The tragic Air India crash in Ahmedabad claimed 270 lives.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/50-cent-criticises-zohran-mamdani-millionaire-tax-hike-new-york-2747457-2025-06-28",
      "headline": "50 Cent slams Mamdani's millionaire tax plan in NYC: Will pay to send him outRapper 50 Cent has lashed out at NYC's Democratic mayor pick Zohran Mamdani's proposed tax increase on millionaires in the city. The dispute highlights tensions around tax policies, targeting the wealthy in the city."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-navsari-miracle-toddler-suv-accident-escapes-unharmed-cctv-video-2747532-2025-06-28",
      "headline": "Miracle in Gujarat: Toddler comes under SUV, escapes without a scratchThe incident could have been fatal if the woman had not reached in time and stopped the vehicle. The 3-year-old child did not sustain even a scratch in the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-confirms-andaz-apna-apna-2-talks-about-collaborating-with-shah-rukh-khan-salman-2747519-2025-06-28",
      "headline": "Aamir Khan confirms Andaz Apna Apna 2, talks about collaborating with SRK, SalmanAamir Khan has confirmed that 'Andaz Apna Apna 2' is in development. He also expressed interest in collaborating with Shah Rukh Khan and Salman Khan in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/cricket-anti-ageing-cream-heartbreaks-india-england-test-series-headingley-loss-2747449-2025-06-28",
      "headline": "An anti-ageing cream called cricketThe Headingley heartbreak, where India lost the Test match after scoring five centuries, takes the author back to his childhood in 1997, when heartbreaks were more the norm than the exception. Only to discover that the child in him is alive and kicking, 28 years of a roller-coaster ride later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shefali-jariwala-death-kaanta-laga-actor-cardiac-arrest-2747409-2025-06-28",
      "headline": "Shefali Jariwala of Kaanta Laga fame dies at 42, cardiac arrest reported cause Latest UpdatesKaanta Laga and Bigg Boss 13 fame Shefali Jariwala died at 42, reportedly due to a cardiac arrest late Friday night. She was rushed to the hospital by her husband, Parag Tyagi, but was declared dead.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/lauren-sanchez-adds-bezos-to-instagram-handle-shares-first-wedding-photo-2747432-2025-06-28",
      "headline": "Lauren Sanchez adds 'Bezos' to Instagram handle, shares first wedding photoLauren Sanchez has officially taken her husband Jeff Bezos' surname, at least on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-condemns-us-president-donald-trump-for-remarks-against-supreme-leader-ayatollah-khamenei-2747446-2025-06-28",
      "headline": "Had no choice but to run to Daddy: Iran uses Trump's new nickname to jab IsraelPlaying on the US President's new nickname, Iran said that Israel had no choice but to 'run to Daddy' to avoid being flattened by its missiles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-india-pakistan-war-nuclear-threat-trade-mediation-2747411-2025-06-28",
      "headline": "'Cancel all deals, they are at war': Trump repeats claim on India-Pak conflictDonald Trump claimed he averted a nuclear war between India and Pakistan by threatening to cancel all trade deals unless both sides ceased fighting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-shefali-jariwala-husband-parag-tyagi-all-you-need-to-know-actor-2747487-2025-06-28",
      "headline": "Who is Parag Tyagi? All you need to know about Shefali Jariwala's husbandActor and model Shefali Jariwala, best known for the 'Kaanta Laga' music video, died at her Mumbai home on Friday night. She was 42. She was married to actor Parag Tyagi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-aryna-sabalenka-coco-gauff-dance-off-french-open-viral-video-2747397-2025-06-27",
      "headline": "Aryna Sabalenka and Coco Gauff dance off French Open feud ahead of WimbledonAfter their tense French Open final, Aryna Sabalenka and Coco Gauff were spotted dancing together in a TikTok video at Wimbledon, suggesting the rivalry has softened just in time for the year's third Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-500-27-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aviation-body-chief-gets-x-category-security-after-threat-intel-amid-crash-probe-2747531-2025-06-28",
      "headline": "Aviation body chief gets X-category security after threat intel amid crash probeThe ministry granted GVG Yugandhar X-category security following an Intelligence Bureau threat report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/fridge-cigarette-diet-coke-can-viral-trend-2747223-2025-06-28",
      "headline": "Gen Z's new cigarette is cold, fizzy, and comes in a canWhat's hot? Fridge cigarette. This is not about smoking but the new way to take some heat off with the help of your Diet Coke can. But experts express concern.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/satya-nadella-wants-ai-to-solve-real-problems-after-microsoft-cuts-6000-jobs-more-layoffs-likely-in-july-2747507-2025-06-28",
      "headline": "Satya Nadella wants AI to solve real problems after Microsoft cuts 6,000 jobsIn a recent interview, Microsoft CEO Satya Nadella emphasised that AI's real test lies in fixing real-world issues, and not just demos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flight-ranchi-tyre-deflation-lucknow-patna-passengers-birsa-munda-airport-2747512-2025-06-28",
      "headline": "IndiGo flight grounded in Ranchi over suspected tyre deflation, flyers deboardedIndiGo grounded its Kolkata-Ranchi-Patna-Lucknow flight at Ranchi's Birsa Munda Airport after the pilot reported a possible front tyre deflation. All passengers were safely deboarded and offered alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-donald-trump-us-russia-ties-stabilising-thanks-ukraine-war-relation-2747479-2025-06-28",
      "headline": "Putin says US-Russia ties stabilising, thanks Trump. US President respondsIn a key development in global politics, Russian President Putin said US-Russia ties are stabilising, praised Donald Trump, and expressed interest in meeting him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/no-ban-on-cng-cars-but-old-diesel-and-petrol-cars-in-delhi-to-be-seized-2747492-2025-06-28",
      "headline": "No ban on CNG cars, but old diesel and petrol cars in Delhi to be seizedStarting July 1, Delhi will crack down on 10-year-old diesel and 15-year-old petrol vehicles to control pollution. 15-year-old CNG cars are excluded for now."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-batting-abhishek-nayar-rohit-sharma-2747537-2025-06-28",
      "headline": "The KL Rahul comeback: Are India reaping rewards of Abhishek Nayar's work?India batter KL Rahul has regained form with a century in the England Test series. Former India batting coach Abhishek Nayar reveals how he played a crucial role in revamping his technique and mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heinrich-klaasen-mlc-2025-quits-captaincy-seattle-orcas-matthhew-mott-sacked-2747526-2025-06-28",
      "headline": "Klaasen quits Seattle Orcas captaincy midway through MLC 2025, coach Mott sackedHeinrich Klaasen has stepped down from his role as captain of the Seattle Orcas to focus on his batting. Coach Matthew Mott has been sacked from his role by the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-2nd-test-prabath-jayasuriya-pathum-nissanka-colombo-2747529-2025-06-28",
      "headline": "Prabath Jayasuriya spins Sri Lanka to innings victory over Bangladesh in 2nd TestSri Lanka beat Bangladesh by an innings and 78 runs in the second and final Test and won the series by 1-0. Prabath Jayasuriya picked up his 12th five-wicket haul on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/najmul-hossain-shanto-quits-as-bangladesh-test-captain-2747523-2025-06-28",
      "headline": "Shanto quits as Bangladesh's Test skipper after Sri Lanka series defeatDespite a brilliant performance in the Sri Lanka Test series, Najmul Hossain Shanto has decided to step down as Bangladesh's Test captain. Shanto believes it is not ideal to have separate captains in red ball and white ball formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raphinha-hails-nico-williams-barcelona-transfer-signing-2747505-2025-06-28",
      "headline": "Player of highest quality: Raphinha hails Williams amid Barcelona moveRaphinha remains unfazed at Nico Williams' possible signing for Barcelona and wants to continue putting his team first. He will welcome the Spaniard if he follows a similar approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-arshdeep-singh-practice-session-edgbaston-2747499-2025-06-28",
      "headline": "Arshdeep trains hard as Bumrah skips ahead of Edgbaston TestIndia vs England: Arshdeep Singh had an intensive training session ahead of the second Test at Edgbaston. His potential debut depends on Jasprit Bumrah's fitness and selection decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-returns-australia-second-test-west-indies-grenada-2747484-2025-06-28",
      "headline": "Steve Smith begins batting, hopes to prove fitness for Grenada TestSteve Smith is already eyeing his return to Test cricket after copping an injury during the World Test Championship final. He could possibly make his return in the second Test against the West Indies in Grenada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/olivier-giroud-lille-transfer-lafc-contract-termination-report-2747470-2025-06-28",
      "headline": "Olivier Giroud set to sign for Lille after terminating LAFC deal: ReportOlivier Giroud is reportedly set to make his return to France, with Lille set to be his new club. With just six months left on his current deal with LAFC, the club have decided to end his contract early to facilitate the move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-shamar-joseph-ian-healy-controversy-latest-news-2747472-2025-06-28",
      "headline": "Curtly Ambrose dig fired up Shamar Joseph: Roston ChaseShamar Joseph responded spectacularly to Curtly Ambrose's criticism with a 9-wicket haul. His fiery performance gave West Indies hope against Australia and sparked debate over on-field sledging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-birmingham-test-rest-analysis-impact-2747469-2025-06-28",
      "headline": "No Bumrah, no glory? Can India win a Test in England without their ace?England vs India: With Jasprit Bumrah likely to miss the second Test of the Anderson-Tendulkar Trophy, India's already daunting challenge in England has become even more formidable. We explore whether India can win overseas without their pace spearhead and what the numbers, history, and selection options reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-inter-miami-fifa-club-world-cup-attendance-usa-2024-2747454-2025-06-28",
      "headline": "Real Madrid, Inter Miami amongst biggest crowd pullers in Club World CupReal Madrid and Inter Miami are attracting the largest crowds at the FIFA Club World Cup in the USA. The high attendance highlights growing interest in the sport in North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-returns-australia-second-test-west-indies-grenada-2747484-2025-06-28",
      "headline": "Steve Smith begins batting, hopes to prove fitness for Grenada TestSteve Smith is already eyeing his return to Test cricket after copping an injury during the World Test Championship final. He could possibly make his return in the second Test against the West Indies in Grenada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/olivier-giroud-lille-transfer-lafc-contract-termination-report-2747470-2025-06-28",
      "headline": "Olivier Giroud set to sign for Lille after terminating LAFC deal: ReportOlivier Giroud is reportedly set to make his return to France, with Lille set to be his new club. With just six months left on his current deal with LAFC, the club have decided to end his contract early to facilitate the move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-shamar-joseph-ian-healy-controversy-latest-news-2747472-2025-06-28",
      "headline": "Curtly Ambrose dig fired up Shamar Joseph: Roston ChaseShamar Joseph responded spectacularly to Curtly Ambrose's criticism with a 9-wicket haul. His fiery performance gave West Indies hope against Australia and sparked debate over on-field sledging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-birmingham-test-rest-analysis-impact-2747469-2025-06-28",
      "headline": "No Bumrah, no glory? Can India win a Test in England without their ace?England vs India: With Jasprit Bumrah likely to miss the second Test of the Anderson-Tendulkar Trophy, India's already daunting challenge in England has become even more formidable. We explore whether India can win overseas without their pace spearhead and what the numbers, history, and selection options reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-inter-miami-fifa-club-world-cup-attendance-usa-2024-2747454-2025-06-28",
      "headline": "Real Madrid, Inter Miami amongst biggest crowd pullers in Club World CupReal Madrid and Inter Miami are attracting the largest crowds at the FIFA Club World Cup in the USA. The high attendance highlights growing interest in the sport in North America."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}