{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-delegation-set-to-visit-india-on-august-25-for-key-trade-discussions-2763066-2025-07-29",
      "headline": "US delegation set to visit India on August 25 for key trade discussionsIndia is asking the US to remove the proposed 26% extra tariff and reduce high duties on Indian steel and aluminium products, which currently face tariffs of up to 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itat-rules-property-transfer-between-spouses-is-valid-for-tax-exemption-2762977-2025-07-29",
      "headline": "Wife pays no income tax after selling two houses gifted by husbandA woman from Mumbai won a court case at the Income Tax Appellate Tribunal (ITAT), which said she did not have to pay income tax after selling two flats worth Rs 6 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-427-points-higher-nifty-above-24800-ril-up-2-percent-2763034-2025-07-29",
      "headline": "Sensex ends 427 points higher; Nifty above 24,800; RIL up 2%The S&P BSE Sensex added 446.93 points to close at 81,337.95, while the NSE Nifty50 gained 140.20 points to end at 24,821.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-tax-when-selling-property-house-section-54-ltcg-long-term-capital-gains-money-tips-personal-finance-2763025-2025-07-29",
      "headline": "Selling your house? Here's how you can save lakhs in taxesSection 54 of the Income Tax Act allows exemption on long-term capital gains earned from the sale of a residential house or plot of land if the profit is reinvested in buying or constructing a new residential property in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-icici-and-4-other-banks-offering-high-fd-rates-check-now-2763008-2025-07-29",
      "headline": "HDFC, ICICI and 4 other banks offering high FD rates. Check nowICICI Bank also offers 6.6% interest, but on a longer tenure, between 2 and 10 years. For senior citizens, the rate is 7.10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-details-size-drhp-issue-size-promoters-peyush-bansal-neha-bansal-2762974-2025-07-29",
      "headline": "Lenskart takes first step towards IPO, files draft with SebiAccording to the draft papers, the IPO will include a fresh issue of shares worth up to Rs 2,150 crore and an offer for sale (OFS) of up to 13.23 crore shares by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanction-hit-nayara-turns-to-rediff-after-microsoft-suspension-report-2762966-2025-07-29",
      "headline": "EU-sanctioned refiner Nayara turns to Rediff after Microsoft suspension: ReportThe shift comes in the wake of fresh European Union sanctions announced on July 18 that targeted Nayara for its links to Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/refiner-nayara-trims-crude-runs-in-wake-of-eu-sanctions-2762964-2025-07-29",
      "headline": "Russia-backed Indian Refiner Nayara trims crude runs in wake of EU sanctionsPrivately-held Nayara, which runs India's third-biggest refinery at the port of Vadinar in the western state of Gujarat, controls nearly 8% of the country's total refining capacity of about 5.2 million bpd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-tax-filing-deadline-getting-extended-again-these-key-itr-utilities-still-pending-2762945-2025-07-29",
      "headline": "Is tax filing deadline getting extended again? These key ITR utilities still pendingThis year, the ITR forms were notified only by the end of May, much later than usual. After that, the utilities were rolled out in phases, and key tools are still missing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-august-1-deadline-trump-tariff-jamieson-greer-piyush-goyal-2762921-2025-07-29",
      "headline": "Will India clinch a US trade deal before August 1? Here's what we knowSpeaking last week, Commerce Minister Piyush Goyal said that there were \"no sticking points\" in the India-US relationship and added that issues like immigration and H-1B visas had not come up in the current trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-expects-more-layoffs-as-it-industry-faces-major-transition-2762890-2025-07-29",
      "headline": "Nasscom expects more layoffs as IT industry faces major transitionThis comes just days after Tata Consultancy Services (TCS), the country's largest IT employer, announced it would cut 2% of its global staff. Around 12,000 mid- and senior-level employees will be let go as the company adjusts its team structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-may-pause-hikes-senior-hiring-after-mass-layoffs-announcement-report-2762869-2025-07-29",
      "headline": "TCS may pause hikes, senior hiring after mass layoffs announcement: ReportTCS shares have dropped nearly 30% over the past year, ranking among the weakest in the Nifty IT index. Shares of the company are down 25% on  year-to-date basis and have fallen nearly 12% in a month.  \r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-wishes-dhurandhar-sanjay-dutt-on-his-birthday-2763094-2025-07-29",
      "headline": "Aditya Dhar wishes Dhurandhar Sanjay Dutt on birthday: You're pure fireDirector Aditya Dhar shared an unseen photo with actor Sanjay Dutt from the sets of 'Dhurandhar' on Tuesday. He extended birthday wishes to the actor in a social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-begins-shoot-in-colombo-for-sri-sri-ravi-shankar-biopic-white-2763161-2025-07-29",
      "headline": "Vikrant Massey begins shoot in Colombo for Sri Sri Ravi Shankar biopic White: Report Vikrant Massey has started shooting for 'White', a biopic on Sri Sri Ravi Shankar. According to sources, the actor is currently on a month-long schedule in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/never-watched-anime-series-naruto-2762989-2025-07-29",
      "headline": "So you've never watched this brilliant anime series called Naruto? Let's fix thatNaruto anime series explained: Discover why this iconic anime series is a true cult classic. We cover Naruto characters, Shonen story arcs, ninja world lore, and everything that made Naruto one of the most influential anime of all time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-spy-thriller-vijay-deverakonda-us-premiere-before-india-release-2763128-2025-07-29",
      "headline": "Not India, Vijay Deverakonda's Kingdom to first release in the US'Kingdom', starring Vijay Deverakonda, is set for a staggered release with the US premiere on July 30 and India following on July 31. Directed by Gowtam Tinnanuri, it also stars Bhagyashri Borse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/a-government-that-acts-anupam-kher-on-operation-mahadev-success-exclusive-2763144-2025-07-29",
      "headline": "A government that acts: Anupam Kher on Operation Mahadev success | ExclusiveIn an exclusive interview with IndiaToday.in, veteran actor Anupam Kher backed the government and Armed Forces after the top Lashkar commander behind the Pahalgam attack was eliminated in Operation Mahadev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hiten-tejwani-gauri-pradhan-kyunki-saas-bhi-kabhi-bahu-thi-reboot-smriti-irani-2763096-2025-07-29",
      "headline": "Hiten Tejwani on returning to Kyunki and reuniting with Smriti IraniHiten Tejwani and Gauri Pradhan return to their iconic roles in the Kyunki Saas Bhi Kabhi Bahu Thi reboot. The show blends its classic legacy with new themes and a fresh generation of characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-on-dharmendra-shabana-azmi-kiss-in-rocky-aur-rani-kii-prem-kahaani-2763011-2025-07-29",
      "headline": "Karan Johar on Dharmendra-Shabana kiss in Rocky aur Rani: I may turn it into a filmKaran Johar called 'Rocky Aur Rani Kii Prem Kahaani' one of his best films, ranking it alongside 'My Name Is Khan' and 'Kuch Kuch Hota Hai'. He also addressed the buzz around Dharmendra and Shabana Azmi's kiss, hinting at a possible film on their love story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-part-1-lord-rama-ranbir-kapoor-invests-in-dneg-most-expensive-film-4000-crore-nitesh-tiwari-2762846-2025-07-29",
      "headline": "Ranbir Kapoor is not just actor in Ramayana, but also an investor in its VFX firmActor Rabir Kapoor has made yet another visionary move in his cinematic career. He has invested in the global VFX giant DNEG, which has done the visual effects of 'Ramayana', according to reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ibrahim-ali-khan-kajol-sarzameen-reduces-indian-army-to-a-prop-and-that-is-its-biggest-failure-2762920-2025-07-29",
      "headline": "Sarzameen reduces Indian Army to a prop and that's its biggest failure'Sarzameen' claims to be an action thriller but turns out to be just a family story with no real focus on the Indian Army. It misses the action, emotion, and respect that people expect in an Army-based film.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/only-murders-in-the-building-season-five-crime-solving-trio-returns-steve-martin-selena-gomez-martin-short-jiohotstar-2763038-2025-07-29",
      "headline": "Only Murders in the Building 5: The crime solving trio returns for a new caseThe fifth season of 'Only Murders In The Building' returns exclusively on JioHotstar from September 9. The upcoming show explores a mysterious death and a dangerous web of secrets in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/naseeruddin-shah-jrd-tata-made-in-india-a-titan-story-series-amazon-mx-player-2762997-2025-07-29",
      "headline": "Naseeruddin Shah brings JRD Tata to life in Made in India-A Titan StoryActor Naseeruddin Shah's look as JRD Tata Was recently unveiled on the legendary industrialist's 121st birth anniversary. Shah plays a pivotal role in the upcoming show - 'Made in India – A Titan Story'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khans-sitaare-zameen-par-to-release-on-youtube-at-rs-100-per-view-2763072-2025-07-29",
      "headline": "Aamir Khan's Sitaare Zameen Par to release on YouTube at Rs 100 per viewAamir Khan has officially announced that 'Sitaare Zameen Par' will stream on YouTube as a pay-per-view from August 1, priced at Rs 100. The film will be available on Khan's YouTube channel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-release-july-31-spy-thriller-family-drama-2763057-2025-07-29",
      "headline": "Vijay Deverakonda's mother silently prays as Anirudh calls Kingdom milestone filmVijay Deverakonda's film 'Kingdom' is set for release on July 31. The film, directed by Gowtam Tinnanuri, tells the story of an undercover spy confronting his crime lord brother. Emotional moments at the pre-release event highlighted family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salaakar-trailer-naveen-kasturia-spy-thriller-is-set-in-dual-timelines-2763027-2025-07-29",
      "headline": "Salaakar trailer: Naveen Kasturia leads spy-thriller set in dual timelinesThe makers of the upcoming spy thriller 'Salaakar' released its trailer today. The series is set in dual timelines and stars Naveen Kasturia in a key role. It will stream from August 8 on JioHotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bandook-review-a-fully-loaded-crime-drama-that-misfires-in-execution-towards-the-end-2763018-2025-07-29",
      "headline": "Bandook review: Fully loaded crime drama that misfires in execution towards the endRelease Date:Tue Jul 29, 2025'Bandook' movie review: Directed by debutant Mahesh Ravikumar, this Kannada crime drama stars newcomer Partha in the lead alongside Gopalkrishna Deshpande, Balaji Manohar, Shwetha Prasad and several others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pride-and-prejudice-netflix-series-first-look-bennet-women-emma-corrin-olivia-colman-jack-lowden-new-cast-joins-2762985-2025-07-29",
      "headline": "Pride and Prejudice series first look shows Bennet women as new cast joinsNetflix's 'Pride and Prejudice' first look shows the Bennet women taking a stroll together in a field. With a cast that blends beloved stars and promising newcomers, the six-part series is not just revisiting Austen's world, it's reimagining it for a new generation of romantics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-returns-when-where-to-watch-cast-and-other-details-2762922-2025-07-29",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi returns: When, where to watch, cast and other detailsThe highly-anticipated reboot of 'Kyunki Saas Bhi Kabhi Bahu Thi' premieres tonight. Here's everything you need to know about the much-loved show - from the star-studded cast to when and where to watch, we list it all before its premiere. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shivaraj-kumar-supports-ramya-social-media-harassment-complaint-2763009-2025-07-29",
      "headline": "Shiva Rajkumar condemns online abuse against Ramya, expresses supportActor Shiva Rajkumar and his wife, Geetha, condemned online harassment against actor-politician Ramya. They emphasised that social media should be used for one's growth and not to hurl abuses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-and-jr-ntr-to-unite-for-war-2-pre-release-event-in-vijayawada-2762960-2025-07-29",
      "headline": "Hrithik Roshan and Jr NTR to attend War 2 pre-release event in VijayawadaActors Hrithik Roshan and Jr NTR will make a joint appearance to promote the much-anticipated film 'War 2'. They will be seen at the film's pre-release event in Vijayawada on August 10. 'War 2' is scheduled for a theatrical release on August 14. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-world-leader-asked-india-to-stop-operation-sindoor-pm-modi-in-parliament-2763195-2025-07-29",
      "headline": "No world leader asked India to stop Operation Sindoor: PM Modi in ParliamentPrime Minister Narendra Modi told the Lok Sabha today that no world leader asked India to stop its counter-terror operation against Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-op-sindoor-debate-lok-sabha-modi-opposition-lok-sabha-rajya-sabha-rahul-gandhi-2762843-2025-07-29",
      "headline": "Live: Indus water treaty was a blunder committed by NehruParliament Session 2025 Live Updates: Parliament on Tueday witnessed yet another heated confrontation as the debate over Operation Sindoor intensified, with the Centre and Opposition trading barbs over the recent conflict between India and Pakistan. Prime Minister Narendra Modi is scheduled to address either House around 7 pm today, marking his entry into the ongoing debate. Union Home Minister Amit Shah led the government's defence in the Lok Sabha, while Defence Minister Rajnath Singh opened the discussion in the Rajya Sabha. On the Opposition front, Congress leaders Rahul Gandhi and Priyanka Gandhi are expected to spearhead the attack, targeting the government's handling of both the India-Pakistan skirmish and Operation Sindoor. The Lok Sabha took up the issue yesterday and the Rajya Sabha debate began today. Stay tuned to IndiaToday.in as we bring you the latest updates. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/say-here-donald-trump-is-liar-rahul-gandhis-dare-over-india-pak-truce-claim-2763115-2025-07-29",
      "headline": "Show Indira's courage, call Trump liar: Rahul Gandhi dares PM on US's truce claimsDuring the Operation Sindoor debate in Parliament, Congress leader Rahul Gandhi launched a sharp attack on the Centre, questioning its handling of India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bas-karo-bahut-maara-hai-pm-says-pak-pleaded-for-ceasefire-after-op-sindoor-2763158-2025-07-29",
      "headline": "Bas karo, bahut maara hai: PM says Pak pleaded for ceasefire after Op SindoorPrime Minister Narendra Modi mocked Pakistan in Parliament during the Operation Sindoor debate and said they pleaded for ceasefire after Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-mla-t-udhayasuriyan-under-fire-for-saying-poda-to-man-questioning-road-conditions-2762823-2025-07-29",
      "headline": "DMK MLA under fire for saying 'poda' to resident questioning road conditionsDuring a state-wide campaign in Tamil Nadu's Kallakurichi, DMK MLA Udhayasuriyan was caught on camera dismissing a local resident with \"poda\" and threatening beatings when questioned about the lack of proper roads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/auspicious-time-needed-terrorists-pm-modi-slams-opposition-for-questioning-op-mahadev-timing-2763182-2025-07-29",
      "headline": "Do we need auspicious time, PM retorts as Oppositon questions Op Mahadev timingPrime Minister Narendra Modi lashed out at the Opposition for questioning the timing of Operation Mahadev, in which all three terrorists involved in the Pahalgam attack were killed, saying they became \"frustrated\" and \"hopeless\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pahalgam-massacre-indias-pain-pakistans-punishment-2763074-2025-07-29",
      "headline": "Pahalgam massacre: India's pain, Pakistan's punishmentWith the terrorist who led the Pahalgam attackers killed by security forces, we revisit the April 22 tragedy that prompted India to exercise hard options against Pakistan"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/rahul-gandhis-table-thump-invites-dont-break-house-property-remark-from-speaker-2763119-2025-07-29",
      "headline": "Rahul Gandhi's table thump invites 'don't break House property' remark from SpeakerCongress leader Rahul Gandhi, while speaking in Lok Sabha, tapped the table, slamming PM Modi, to which Speaker Om Birla said 'don't break this is House's property'.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/india-beats-china-as-top-smartphone-supplier-to-the-us-thanks-to-apples-big-iphone-shift-2763126-2025-07-29",
      "headline": "India beats China as top smartphone supplier to the USIndia has become the largest supplier of smartphones to the US for the first time, overtaking China, and it's Apple that has made this possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-singing-to-paks-tune-acting-as-its-spokespersons-pm-modi-operation-sindoor-debate-2763176-2025-07-29",
      "headline": "Congress singing Pak's tune, acting as its spokesperson: PM's scathing attackPM Modi pointed out that Congress immediately asked for proof after the surgical strikes were conducted. PM said that when Congress couldn't discredit the Army, they changed their tune, claiming they had carried out surgical strikes during their tenure as well. PM highlighted that after India conducted the Balakot air strikes, Congress—just like Pakistan—started asking for photographic evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-butchers-of-pahalgam-hunted-down-killed-explained-five-points-amit-shah-parliament-operation-sindoor-2762947-2025-07-29",
      "headline": "Signal tracking to IB intel, how butchers of Pahalgam hunted down | 5 pointsThe three terrorists killed on Monday in Kashmir were the ones who gunned down 26 people in Pahalgam on April 22, Union Home Minister Amit Shah confirmed in Parliament. This is how the three terrorists were tracked down through tech and human intel, and killed as part of Operation Mahadev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mathura-kulhad-war-video-viral-reminds-internet-baghpat-clash-lassi-shopkeepers-fight-barsana-2763080-2025-07-29",
      "headline": "'Kulhad war' near Mathura temple reminds Internet of Baghpat battle. Watch videoIn what's now being dubbed the \"Kulhad war,\" shopkeepers hurled bricks and beat each other with sticks in broad daylight over a customer dispute - all outside one of Braj's most sacred sites. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dhankhar-dhamaka-the-inside-story-of-what-forced-the-vice-president-out-2763052-2025-07-29",
      "headline": "Dhankhar dhamaka: The inside story of what forced the vice-president outAmong the reasons: an impeachment motion against a judge, purported internal dissent and some power play"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-rajesh-khanna-death-64-unopened-suitcases-were-found-at-his-home-aashirwaad-2762973-2025-07-29",
      "headline": "64 unopened suitcases with gifts were found at Rajesh Khanna's home after deathIn the end, it wasn't just the stardom Rajesh Khanna left behind, but the silence of unopened suitcases. Perhaps also the echoes of a life that longed to connect, yet chose solitude. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindus-distress-sale-village-mob-attack-homes-vandalised-facebook-prophet-post-2763033-2025-07-29",
      "headline": "Bangladesh Hindus resort to distress sale as village ransacked over Prophet postA 17-year-old's alleged Facebook post on Prophet Mohammad has led to back-to-back mob attacks on a Hindu village in northern Bangladesh's Rangpur district. Even after the teen's arrest, at least 15 Hindu homes were ransacked, and families resorted to the distress sale of livestock and foodgrain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rohit-bals-poetry-in-thread-lives-on-through-arjun-rampal-this-couture-season-2763077-2025-07-29",
      "headline": "Rohit Bal's poetry in thread lives on through Arjun Rampal this couture seasonArjun Rampal, in a velvet sherwani closed the show for Rohit Bal at Hyundai India Couture Week 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-delta-pilot-arrested-from-aircraft-on-child-sex-abuse-charges-2762976-2025-07-29",
      "headline": "Indian-origin Delta pilot arrested from aircraft on child sex abuse chargesAccording to an official statement, detectives from the Sheriff's Investigation Division have been working on the case since April 2025, after receiving a report of child sexual abuse. A Ramey arrest warrant was subsequently secured for the suspect, identified as 34-year-old Rustom Bhagwagar of Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/voter-ids-show-pahalgam-attackers-were-pakistanis-amit-shah-hits-out-at-p-chidambaram-for-giving-clean-chit-2762925-2025-07-29",
      "headline": "Pahalgam attackers from Pak, we have proof: Amit Shah attacks P ChidambaramAsserting that India possesses conclusive evidence of the terrorists' identity and origin, Amit Shah said two of the terrorists killed as part of Operation Mahadev had Pakistani voter identity numbers and that even the chocolates recovered from their possession were manufactured in Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/immediate-surrender-to-pak-after-30-minutes-rahul-gandhi-slams-rajnath-singhs-remarks-on-op-sindoor-2763109-2025-07-29",
      "headline": "Tied pilots' hands behind backs: Rahul Gandhi attacks Centre on 'downed' IAF jetThe Congress MP also said that India's Defence Minister revealed to Pakistan that India would not target any of their military bases. Rahul Gandhi claimed that this approach, in turn, restricted the Indian Air Force's operational freedom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/baby-skin-health-risks-cosmetics-child-makeup-products-2763100-2025-07-29",
      "headline": "How makeup on babies can trigger allergies and disrupt hormonesWhat does science say when it comes to applying cosmetic products on babies? Find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-sexual-assault-10-year-old-girl-assaulted-by-drunk-father-narayanpet-bns-pocso-2763051-2025-07-29",
      "headline": "Nanna, please don't: 10-year-old Telangana girl sexually assaulted by drunk fatherA 10-year-old girl in Telangana's Narayanpet district was allegedly sexually assaulted by her inebriated father while alone at home. Locals rescued her after hearing her screams. A case has been registered; the accused is absconding."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-debate-updates-priyanka-gandhi-hits-back-at-amit-shah-over-batla-encounter-remark-2763107-2025-07-29",
      "headline": "Meri maa ke aansu…: Priyanka Gandhi hits back at Amit Shah over Batla remarkHitting back at Amit Shah, Priyanka Gandhi said that her mother had cried when her father was killed by terrorists, and it was because of that pain she witnessed her mother endure that she could stand up for those who lost their loved ones in the Pahalgam terror attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/exclusive-first-pics-of-two-pahalgam-attackers-who-were-killed-in-op-mahadev-2762986-2025-07-29",
      "headline": "First photos of two Pahalgam attackers who were killed in Operation Mahadev Both were Pakistani nationals and were gunned down during a joint forces operation in Srinagar on Monday. Hashim Musa, top Lashkar-e-Taiba (LeT) commander who was named top conspirator and executor of the Pahalgam attack, was also gunned down during the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-wishes-dhurandhar-sanjay-dutt-on-his-birthday-2763094-2025-07-29",
      "headline": "Aditya Dhar wishes Dhurandhar Sanjay Dutt on birthday: You're pure fireDirector Aditya Dhar shared an unseen photo with actor Sanjay Dutt from the sets of 'Dhurandhar' on Tuesday. He extended birthday wishes to the actor in a social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-begins-shoot-in-colombo-for-sri-sri-ravi-shankar-biopic-white-2763161-2025-07-29",
      "headline": "Vikrant Massey begins shoot in Colombo for Sri Sri Ravi Shankar biopic White: Report Vikrant Massey has started shooting for 'White', a biopic on Sri Sri Ravi Shankar. According to sources, the actor is currently on a month-long schedule in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-spy-thriller-vijay-deverakonda-us-premiere-before-india-release-2763128-2025-07-29",
      "headline": "Not India, Vijay Deverakonda's Kingdom to first release in the US'Kingdom', starring Vijay Deverakonda, is set for a staggered release with the US premiere on July 30 and India following on July 31. Directed by Gowtam Tinnanuri, it also stars Bhagyashri Borse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/a-government-that-acts-anupam-kher-on-operation-mahadev-success-exclusive-2763144-2025-07-29",
      "headline": "A government that acts: Anupam Kher on Operation Mahadev success | ExclusiveIn an exclusive interview with IndiaToday.in, veteran actor Anupam Kher backed the government and Armed Forces after the top Lashkar commander behind the Pahalgam attack was eliminated in Operation Mahadev."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taskin-ahmed-bangladesh-pacer-threats-assaults-2763191-2025-07-29",
      "headline": "Taskin Ahmed accused of assault and threats, Bangladesh pacer clarifiesTaskin Ahmed, Bangladesh's premier fast bowler, has been accused of assaulting and threatening his childhood friend. The speedster, meanwhile, released a statement where he denied the accusations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-macau-open-treesa-jolly-gayatri-gopichand-upset-2763184-2025-07-29",
      "headline": "Satwik-Chirag ease into second round, Treesa-Gayatri suffer shock exitTop Indian men's doubles duo Satwiksairaj Rankireddy and Chirag Shetty kicked off their Macau Open Super 300 campaign in style with a dominant straight-game win, even as top-seeded women's pair Treesa Jolly and Gayatri Gopichand suffered a shock first-round exit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-afc-womens-asian-cup-2026-group-draw-japan-chinese-taipei-vietnam-2763172-2025-07-29",
      "headline": "India women's football team clubbed with Japan, Vietnam in Group C of Asian CupIndia have been drawn in Group C with Japan, Chinese Taipei and Vietnam for the AFC Women's Asian Cup 2026. The group stage matches will decide qualification for the 2027 FIFA Women's World Cup in Brazil, heightening competition among the teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/holger-rune-veronika-kudermetova-chat-interaction-2763171-2025-07-29",
      "headline": "I have a husband: Holger Rune playfully shut down by Russian tennis starRussian tennis ace Veronika Kudermetova recently recounted a light-hearted and amusing interaction with Denmark's up-and-coming talent, Holger Rune.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kolkata-knight-riders-part-ways-with-ipl-winning-head-coach-chandrakant-pandit-2763142-2025-07-29",
      "headline": "KKR part ways with IPL-winning head coach Chandrakant PanditKolkata Knight Riders have announced the departure of head coach Chandrakant Pandit after the IPL 2025 season. The franchise aims to rebuild as it searches for a new coach following a disappointing campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-sitanshu-kotak-press-conference-oval-pitch-2763117-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: India batting coach clears the air on argumentENG vs IND: India's batting coach, Sitanshu Kotak, addressed the reported rift between Gautam Gambhir and pitch curator Lee Fortis ahead of the fifth Test, set to begin on July 31 at the Kennington Oval in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-chess-world-cup-win-powered-by-mental-toughness-susan-polgar-2763111-2025-07-29",
      "headline": "Divya Deshmukh's Chess World Cup triumph fuelled by mental toughness: Susan PolgarLegendary Grandmaster Susan Polgar has credited Divya Deshmukh's stunning World Cup victory to her unwavering determination and mental toughness, after the teenager delivered yet another landmark moment for Indian chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-top-10-bwf-rankings-lakshya-sen-unnati-hooda-2763101-2025-07-29",
      "headline": "Satwik-Chirag returns to top 10, Lakshya, Unnati climb up in singlesIn the latest BWF Rankings, India's badminton stars are on the rise again. Satwiksairaj Rankireddy and Chirag Shetty are back into the world's top 10 in men's doubles, while Lakshya Sen moves to No. 17 in men's singles category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-loud-talk-manchester-2763095-2025-07-29",
      "headline": "Why didn't you declare earlier? Gavaskar shuts down England's loud talkENG vs IND: Sunil Gavaskar criticised England's tactics in the fourth Test at Old Trafford in Manchester, where India played out 143 overs in their second innings to save the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-nathan-lyon-jamaica-test-2763058-2025-07-29",
      "headline": "Was disappointed on a number of levels: Lyon on West Indies Test snubWI vs AUS: Nathan Lyon said that he was dejected after being left out of the third Test against the West Indies where the Aussies preferred an all-pace attack. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-chess-world-cup-win-powered-by-mental-toughness-susan-polgar-2763111-2025-07-29",
      "headline": "Divya Deshmukh's Chess World Cup triumph fuelled by mental toughness: Susan PolgarLegendary Grandmaster Susan Polgar has credited Divya Deshmukh's stunning World Cup victory to her unwavering determination and mental toughness, after the teenager delivered yet another landmark moment for Indian chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-top-10-bwf-rankings-lakshya-sen-unnati-hooda-2763101-2025-07-29",
      "headline": "Satwik-Chirag returns to top 10, Lakshya, Unnati climb up in singlesIn the latest BWF Rankings, India's badminton stars are on the rise again. Satwiksairaj Rankireddy and Chirag Shetty are back into the world's top 10 in men's doubles, while Lakshya Sen moves to No. 17 in men's singles category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-gautam-gambhir-oval-pitch-curator-fight-controversy-london-2763097-2025-07-29",
      "headline": "Gambhir vs Oval pitch curator: Real reason why both men had heated argumentThe real reason behind Gautam Gambhir's spat with Oval pitch curator Lee Fortis has been revealed, with the latter giving his thoughts on the incident, which took place on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-loud-talk-manchester-2763095-2025-07-29",
      "headline": "Why didn't you declare earlier? Gavaskar shuts down England's loud talkENG vs IND: Sunil Gavaskar criticised England's tactics in the fourth Test at Old Trafford in Manchester, where India played out 143 overs in their second innings to save the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-nathan-lyon-jamaica-test-2763058-2025-07-29",
      "headline": "Was disappointed on a number of levels: Lyon on West Indies Test snubWI vs AUS: Nathan Lyon said that he was dejected after being left out of the third Test against the West Indies where the Aussies preferred an all-pace attack. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}