{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/no-salary-paid-madhabi-buch-retirement-icici-bank-congress-claim-sebi-hindenburg-2592415-2024-09-02",
      "headline": "No salary paid to Madhabi Buch after retirement: ICICI Bank on Congress's claimMadhabi Buch served as the CEO of ICICI Securities from February 2009 to May 2011. In a statement, the bank said it has not paid any salary or granted any ESOPs to Buch after her retirement, other than her retiral benefits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-9796-percent-of-rs-2000-notes-withdrawn-rs-7261-crore-yet-to-return-2592388-2024-09-02",
      "headline": "RBI: 97.96% of Rs 2,000 notes withdrawn, Rs 7,261 crore yet to returnAs of August 30, 2024, only Rs 7,261 crore worth of these notes remain with the public, according to the data released by RBI on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-gender-specific-co-passenger-seating-for-women-travellers-sees-60-70-percent-rise-in-august-2592369-2024-09-02",
      "headline": "IndiGo's gender-specific seating for women travellers sees 60-70% rise in AugustIndiGo launched this gender-specific seating option in May 2024 as a pilot project, aimed at increasing the comfort and security of women travellers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-approves-rs-3300-crore-semiconductor-unit-kaynes-semicon-pvt-ltd-gujarat-sanand-2592324-2024-09-02",
      "headline": "Government approves Rs 3,300 crore semiconductor unit in Gujarat's SanandThis unit represents India's fifth semiconductor facility and is part of the India Semiconductor Mission (ISM) to build a robust semiconductor ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-cabinet-meeting-approves-rs-13966-crore-boost-for-agriculture-food-security-pm-modi-2592262-2024-09-02",
      "headline": "Union Cabinet approves Rs 13,966 crore boost for agriculture, food securityThe decision was made during a meeting chaired by Prime Minister Narendra Modi, with the goal of supporting farming activities and improving the lives of farmers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-on-record-high-driven-by-gains-in-it-fmcg-stocks-hcl-infosys-2592245-2024-09-02",
      "headline": "Sensex, Nifty close on record high driven by gains in IT and FMCG stocks The S&P BSE Sensex added 194.07 points to close at 82,559.84, while the NSE Nifty50 gained 42.80 points to end at 194.07. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dunzo-cuts-75-percent-of-workforce-layoffs-job-cut-as-reliance-backed-firm-battles-financial-woes-2592209-2024-09-02",
      "headline": "Dunzo cuts 75% of workforce as Reliance-backed firm battles financial woesThe decision to cut jobs comes as part of a larger strategy to manage expenses and generate cash flow, as the company faces increasing pressure to meet its financial obligations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/3-it-stocks-could-deliver-quick-gains-in-short-term-tata-technologies-tech-mahindra-coforge-2592171-2024-09-02",
      "headline": "These 3 IT stocks could deliver quick gains in short term. Check hereTech Mahindra is one of the 3 IT stocks that is currently showing a strong bullish trend, visible across both its daily and weekly charts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-likely-to-increase-budget-allocation-for-agriculture-sector-union-cabinet-meet-september-2-2592103-2024-09-02",
      "headline": "Government to increase budget allocation for agriculture sector: ReportThe Union Cabinet may also discuss merging various agricultural schemes into a more streamlined approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gala-precision-engineering-ipo-opens-bidding-subscribe-skip-good-bad-expert-view-gmp-today-2592076-2024-09-02",
      "headline": "Gala Precision Engineering IPO opens for bidding: Subscribe or skip? Gala Precision Engineering Limited, established in February 2009, focusses on manufacturing precision components like disc and strip springs (DSS), coil and spiral springs (CSS), and specialised fastening solutions (SFS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-shares-up-109-percent-from-march-low-hold-sell-buy-investors-outlook-expert-views-2592060-2024-09-02",
      "headline": "Suzlon Energy shares up 109% from March low: What should investors do? In the past year, Suzlon Energy shares have delivered a return of 193%, and over the past two years, the gain has been a remarkable 909%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eco-mobility-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2592042-2024-09-02",
      "headline": "ECO Mobility IPO allotment: Step-by-step guide to check statusECO Mobility IPO allotment: Investors who applied for ECO Mobility Limited IPO can check their allotment status online via the BSE website or through Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-all-time-high-driven-by-a-rally-in-auto-stocks-hero-bajaj-mahindra-2592020-2024-09-02",
      "headline": "Sensex, Nifty hit all-time high driven by a rally in IT and auto stocksThe S&P BSE Sensex added 155.32 points to 82,521.09, while the NSE Nifty50 gained 77.20 points to 25,313.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-gas-cylinder-price-delhi-mumbai-chennai-increase-new-rate-2591614-2024-09-01",
      "headline": "Commercial LPG cylinders to get costlier from today, price hiked by Rs 39The price of commercial LPG cylinders has been increased nationwide, with a Rs 39 hike in Delhi for a 19 kg cylinder, now priced at Rs 1,691.50 as of September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-fall-shaktikanta-das-rbi-government-spending-lok-sabha-elections-2591540-2024-08-31",
      "headline": "Lok Sabha polls, reduced spending: RBI Governor's reasons for Q1 GDP fallIndia's GDP growth slowed to 6.7 per cent in the April-June quarter, down from 8.2 per cent a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-and-isg-partner-to-bring-ondc-seller-app-at-global-fintech-fest-2024-2591461-2024-08-31",
      "headline": "JP Morgan and ISG partner to bring ONDC seller app at Global Fintech Fest 2024The partnership creates a 'one stop shop' solution for digital commerce by leveraging ISG's ONDC tech stack, powered by its ecosystem partner Protean, and the banking capabilities of JP Morgan in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/paris-paralympics-2024-javelin-sumit-antil-gold-medal-mens-f64-2592525-2024-09-02",
      "headline": "Paris 2024: Record-breaker Sumit Antil makes it back-to-back Paralympics goldsRecord-breaker Sumit Antil made it back-to-back gold medals at the Paralympics with a sensational performance in Paris on September 2, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-congress-aap-alliance-haryana-assembly-elections-arvind-kejriwal-2592530-2024-09-02",
      "headline": "Rahul Gandhi keen on AAP-Congress alliance in Haryana polls: SourcesCongress MP Rahul Gandhi raised the possibility of his party having an alliance with Arvind Kejriwal-led AAP for the October 5 Haryana Assembly polls during the Congress's Central Election Committee (CEC) meeting, sources told India Today TV."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/supreme-court/story/west-bengal-anti-rape-bill-kolkata-rape-murder-trainee-doctor-legal-experts-president-assent-2592561-2024-09-03",
      "headline": "Bengal anti-rape bill constitutionally valid, but needs President's assent: ExpertsLegal experts said the West Bengal government's move to introduce an anti-rape bill in the state Assembly was constitutionally valid, but it will require presidential assent for it to become a law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-india-medal-tally-sumit-antil-nitesh-kumar-2592556-2024-09-03",
      "headline": "India at Paralympics 2024: Sumit Antil, Nitesh Kumar lead medal rush on Day 5It was a fine day for India at the Paris Paralympics on September 2, Monday as Sumit Antil and Nitesh Kumar claimed gold medals. India bagged a total of 8 medals on the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-skincare-therapy-really-improve-your-mental-health-2592200-2024-09-02",
      "headline": "Can skincare therapy really improve your mental health?Skincare is more than just applying a few products on your skin to achieve that flawless glow. It can have a significant impact on your mental well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mla-nitesh-rane-anti-muslims-remark-bjp-tuhin-sinha-maharashtra-2592540-2024-09-03",
      "headline": "BJP on Nitesh Rane's anti-Muslim remarks: 'Such words have no space in public life'Participating in a debate on India Today TV, BJP spokesperson Tuhin Sinha condemned Nitesh Rane's recent remarks where the latter openly threatened the Muslim community."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sandip-ghosh-rg-kar-hospital-trainee-doctor-rape-murder-arrested-cbi-2592447-2024-09-02",
      "headline": "Sandip Ghosh, ex-principal of Kolkata's RG Kar hospital, arrested by CBISandip Ghosh has been arrested by the Central Bureau of Investigation (CBI) for his alleged involvement in the financial irregularities in Kolkata's RG Kar hospital. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-sebi-chief-madhabi-puri-buch-drawing-salary-icici-bank-hindenburg-research-pm-modi-2592271-2024-09-02",
      "headline": "Sebi chief was drawing salary from ICICI, Congress alleges, bank denies claimThe Congress claimed that Madhabi Puri Buch received an income of Rs 16.8 crore from ICICI since joining Sebi in 2017, which is 5.09 times her Sebi income of Rs 3.3 crore during the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranveer-singh-pregnancy-photoshoot-pics-2592354-2024-09-02",
      "headline": "Pics: Deepika's pregnancy shoot with Ranveer is all about that joyDeepika Padukone and Ranveer Singh's pregnancy photoshoot is here. The couple look stunning in the black-and-white images. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-force-mig-29-aircraft-crashes-rajasthan-barmer-pilot-safe-2592509-2024-09-02",
      "headline": "MiG-29 fighter jet crashes in Rajasthan due to technical snag, pilot safeA MiG-29 fighter jet crashed in Rajasthan's Barmer district due to a technical snag. The pilot ejected safely and there were no casualties reported.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-students-wing-suspends-member-sandip-ghosh-aide-trainee-doctor-rape-murder-rg-kar-hospital-2592557-2024-09-03",
      "headline": "Trinamool students' wing suspends member close to RG Kar's ex-principalThe Trinamool Chhatra Parishad suspended its member, who is also an aide of former RG Kar Medical College and Hospital principal Sandip Ghosh, following claims that he was present at the crime scene where the trainee doctor's body was found."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/rs-8k-to-80k-how-young-dogwalkers-are-earning-big-bucks-to-help-busy-pet-parents-2590902-2024-09-02",
      "headline": "Rs 8k to 80k, how young dogwalkers are earning big bucks to help busy pet parentsDogwalkers are making the life of busy pet parents easy, but what is in it for them?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-second-drone-attack-in-imphal-west-another-woman-injured-2592523-2024-09-02",
      "headline": "Second drone attack in two days in Manipur, another woman injuredAt least two explosives were dropped from a drone on Monday evening at Senjam Chirang in which the woman was injured, officials said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-emergency-film-government-sources-religious-sentiments-2592338-2024-09-02",
      "headline": "Religious sentiments can't be hurt: Government sources after 'Emergency' delayedThe film, in which actor-turned-politician Kangana Ranaut is playing the role of former Prime Minister Indira Gandhi, was slated to be released on September 6. However, its release date, deferred several times earlier, has been postponed again. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/faridabad-crime-news-class-12-student-murder-police-arrest-5-people-cattle-smuggler-2592504-2024-09-03",
      "headline": "Class 12th Faridabad student mistaken for cow smuggler, chased for 25 km, killedFive people, identified as cow vigilantes, were arrested on charges of killing a Class 12 student, who was mistaken for a cattle smuggler in Faridabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-16-launch-event-next-week-here-is-how-much-it-could-cost-in-india-2592143-2024-09-02",
      "headline": "iPhone 16 launch next week, here is how much it may cost in IndiaThe iPhone 16 will launch on September 9, so the next big Apple event is not too far away and will take place next week. Here is how much the iPhone 16, Plus, Pro, and Pro Max might cost in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghanistan-suicide-bomber-in-kabul-killed-injured-taliban-2592482-2024-09-02",
      "headline": "Suicide bomber detonates in Kabul; 6 killed, 13 injuredThe blast took place in the southwestern Qala Bakhtiar neighbourhood in Kabul, said Khalid Zadran, spokesman for the Kabul police chief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-suhas-yathiraj-silver-medal-badminton-mens-singles-sl4-category-2592484-2024-09-02",
      "headline": "Suhas Yathiraj gets silver in badminton men's singles SL4 categoryParalympics: India's Suhas Yathiraj got the silver medal in men's singles SL4 in badminton after losing in straight games to Lucas Mazur of France in straight games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-rakesh-kumar-archery-mixed-team-bronze-2592514-2024-09-02",
      "headline": "India's Sheetal Devi, Rakesh Kumar win archery mixed team bronzeParis Paralympics 2024: Sheetal Devi and Rakesh Kumar won the bronze medal in archery in the mixed team compound event after beating Italy on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/vande-bharat-sleeper-express-special-features-ashwini-vaishnaw-2592459-2024-09-02",
      "headline": "Vande Bharat Sleeper Express features promise better comfort, safety, and moreRailway Minister Ashwini Vaishnaw shared a closer look at the features of the Vande Bharat Sleeper Express in an X thread, highlighting its focus on comfort, safety, and advanced design for long-distance travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/firing-at-ap-dhillon-home-canada-lawrence-bishnoi-gang-takes-responsibility-2592297-2024-09-02",
      "headline": "Weeks after music video with Salman Khan, shots fired at AP Dhillon's Canada homeThe Lawrence Bishnoi gang has claimed responsibility for the shooting outside Punjabi singer AP Dhillon's house in Canada. The attack comes weeks after Dhillon released a music video, featuring actor Salman Khan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/is-pn-fueling-sexual-violence-the-link-between-pn-and-rape-first-things-fast-2592424-2024-09-02",
      "headline": "Is porn fueling sexual violence? | The link between porn and rape | First Things FastFollowing the tragic rape and murder of a doctor at Kolkata's RG Kar Hospital, we ask: Is pornography pushing people toward sexual violence? With rising porn consumption in India, are we targeting the wrong cause?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-2024-manisha-ramadass-wins-bronze-womens-singles-su5-badminton-2592444-2024-09-02",
      "headline": "Manisha Ramadass makes history with badminton bronze in Paris India's Manisha Ramadass secured the bronze medal in the women's singles SU5 category at the 2024 Paralympics after beating Denmark's Cathrine Rosengren in straight games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/tv-actor-kamya-panjabi-says-sexual-abuse-doesnt-happen-in-the-television-industry-2592542-2024-09-03",
      "headline": "Actor Kamya Panjabi says 'sexual abuse doesn't happen in the TV industry'Kamya Panjabi asserted that the television industry is free from sexual abuse. Her remarks emphasise the industry's clean reputation and mutual consent in any encounters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-preity-zintas-veer-zaara-to-re-release-in-theatres-on-september-13-2592483-2024-09-02",
      "headline": "SRK, Preity Zinta's 'Veer-Zaara' to re-release in theatres on September 13The beloved Bollywood film, 'Veer-Zaara', is set to make a comeback in theatres on September 13, 2024. Directed by Yash Chopra, this classic romantic drama stars Shah Rukh Khan and Preity Zinta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-vidya-balan-on-bhool-bhulaiyaa-3-set-for-poster-shoot-see-pictures-2592497-2024-09-02",
      "headline": "Pics: Kartik Aaryan, Vidya Balan on 'Bhool Bhulaiyaa 3' set for poster shootActors Kartik Aaryan and Vidya Balan were recently seen on the set of 'Bhool Bhulaiyaa 3' for a poster shoot. The film is set to release this Diwali, with fans eagerly awaiting more details."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-grover-backs-kanganas-emergency-amid-release-delay-says-censorship-is-never-right-shares-post-on-x-2592463-2024-09-02",
      "headline": "Varun Grover backs Kangana's 'Emergency' amid release delay: Censorship is never…Kangana Ranaut's 'Emergency' is currently facing delays and criticism from Sikh organisations while awaiting CBFC clearance. Filmmaker Varun Grover recently voiced support for the film and said that censoring a film is 'never right'. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-jannik-sinner-doping-case-verdict-trust-decision-believe-justice-2592566-2024-09-03",
      "headline": "Nadal sides with Sinner on doping verdict: I believe the decision on himRafael Nadal defended Jannik Sinner, expressing trust in the verdict clearing him of intentional doping. Despite controversy, Sinner's US Open run continues strong, with a Round of 16 clash against Tommy Paul on September 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-rohan-bopanna-into-mixed-doubles-semis-daniil-medvedev-into-quarters-2592558-2024-09-03",
      "headline": "Rohan Bopanna into mixed doubles semis, Daniil Medvedev into quarters US Open: Rohan Bopanna and Aldila Sutjiadi advanced to the mixed doubles semis after beating Matthew Ebden and Barbora Krejcikova on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-india-medal-tally-sumit-antil-nitesh-kumar-2592556-2024-09-03",
      "headline": "India at Paralympics 2024: Sumit Antil, Nitesh Kumar lead medal rush on Day 5It was a fine day for India at the Paris Paralympics on September 2, Monday as Sumit Antil and Nitesh Kumar claimed gold medals. India bagged a total of 8 medals on the day. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-nithya-sre-sivan-bags-bronze-badminton-2592554-2024-09-03",
      "headline": "India's Nithya Sre Sivan bags bronze in badminton SH6 categoryParalympics 2024: Nithya Sri Sivan bagged the bronze medal in badminton in the SH6 category after beating Indonesia's Rina Marlina 21-14, 21-6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-karolina-muchova-knocks-out-jasmine-paolini-jessica-pegula-quarters-2592551-2024-09-03",
      "headline": "Karolina Muchova knocks out Jasmine Paolini, Jessica Pegula in quartersUS Open 2024: Karolina Muchova made her way through to the quarterfinals after beating Jasmine Paolini. Jessica Pegula also secured a comprehensive win over Diana Shnaider. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-badminton-nitesh-kumar-wins-gold-daniel-bethell-2592550-2024-09-03",
      "headline": "Keep fighting for each point: How Nitesh Kumar overcame nemesis Bethell for goldIndia's Nitesh Kumar revealed how he was able to beat his nemesis Daniel Bethell to clinch the gold medal in the badminton men's singles SL3 final on September 2, Monday. Nitesh had never beaten Bethell until Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-pm-narendra-modi-congratulates-sumit-antil-for-defending-javelin-crown-2592547-2024-09-03",
      "headline": "PM Narendra Modi congratulates Sumit Antil for defending javelin crownParis Paralympics: PM Narendra Modi praised javelin thrower Sumit Antil for winning the gold medal in the F64 event on Monday with a best throw of 70.59 metres. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paralympics-nitesh-kumar-yogesh-kathuniya-manisha-ramadass-thulasimathi-murugesan-paris-2592539-2024-09-02",
      "headline": "Paralympics 2024: Nitesh Kumar, Yogesh Kathuniya, Manisha Ramadass, Thulasimathi Murugesan make India proud in Paris Paralympics 2024: Nitesh Kumar won the gold medal in badminton while Manisha Ramadass and Thulasimathi Murugesan bagged bronze and silver respectively. Yogesh Kathuniya won silver in the Men's discus throw F56 event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/paris-paralympics-2024-javelin-sumit-antil-gold-medal-mens-f64-2592525-2024-09-02",
      "headline": "Paris 2024: Record-breaker Sumit Antil makes it back-to-back Paralympics goldsRecord-breaker Sumit Antil made it back-to-back gold medals at the Paralympics with a sensational performance in Paris on September 2, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-rakesh-kumar-archery-mixed-team-bronze-2592514-2024-09-02",
      "headline": "India's Sheetal Devi, Rakesh Kumar win archery mixed team bronzeParis Paralympics 2024: Sheetal Devi and Rakesh Kumar won the bronze medal in archery in the mixed team compound event after beating Italy on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-javelin-final-sumit-antil-breaks-own-record-6911-m-2592507-2024-09-02",
      "headline": "Paralympics 2024: Sumit Antil breaks own record twice in ParisIndia's Sumit Antil has broken his own Paralympics record twice during the Javelin F64 final event on Monday, September 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-pm-narendra-modi-congratulates-sumit-antil-for-defending-javelin-crown-2592547-2024-09-03",
      "headline": "PM Narendra Modi congratulates Sumit Antil for defending javelin crownParis Paralympics: PM Narendra Modi praised javelin thrower Sumit Antil for winning the gold medal in the F64 event on Monday with a best throw of 70.59 metres. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paralympics-nitesh-kumar-yogesh-kathuniya-manisha-ramadass-thulasimathi-murugesan-paris-2592539-2024-09-02",
      "headline": "Paralympics 2024: Nitesh Kumar, Yogesh Kathuniya, Manisha Ramadass, Thulasimathi Murugesan make India proud in Paris Paralympics 2024: Nitesh Kumar won the gold medal in badminton while Manisha Ramadass and Thulasimathi Murugesan bagged bronze and silver respectively. Yogesh Kathuniya won silver in the Men's discus throw F56 event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/paris-paralympics-2024-javelin-sumit-antil-gold-medal-mens-f64-2592525-2024-09-02",
      "headline": "Paris 2024: Record-breaker Sumit Antil makes it back-to-back Paralympics goldsRecord-breaker Sumit Antil made it back-to-back gold medals at the Paralympics with a sensational performance in Paris on September 2, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-rakesh-kumar-archery-mixed-team-bronze-2592514-2024-09-02",
      "headline": "India's Sheetal Devi, Rakesh Kumar win archery mixed team bronzeParis Paralympics 2024: Sheetal Devi and Rakesh Kumar won the bronze medal in archery in the mixed team compound event after beating Italy on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-javelin-final-sumit-antil-breaks-own-record-6911-m-2592507-2024-09-02",
      "headline": "Paralympics 2024: Sumit Antil breaks own record twice in ParisIndia's Sumit Antil has broken his own Paralympics record twice during the Javelin F64 final event on Monday, September 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-suhas-yathiraj-silver-medal-badminton-mens-singles-sl4-category-2592484-2024-09-02",
      "headline": "Suhas Yathiraj gets silver in badminton men's singles SL4 categoryParalympics: India's Suhas Yathiraj got the silver medal in men's singles SL4 in badminton after losing in straight games to Lucas Mazur of France in straight games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-badminton-thulasimathi-murugesan-silver-medal-win-2592496-2024-09-02",
      "headline": "Who is Thulasimathi Murugesan? Veterinary Science student claims historic silverA veterinary science student aiming for greatness in sports, Thulasimathi Murugesan achieved history on Monday, September 2, when she got the silver medal in the Women's Badminton Singles SU5 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-manisha-ramadass-badminton-bronze-medal-paris-su5-2592462-2024-09-02",
      "headline": "Who is Manisha Ramadass? India's first woman with badminton medal Paralympics 2024: 19-year-old Manisha Ramadass won bronze in the SU5 category and became the first Indian woman with a medal in badminton at the quadrennial event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-thulasimathi-murugesan-yang-qiuxia-silver-medal-2592454-2024-09-02",
      "headline": "Paris 2024: Thulasimathi Murugesan gets silver Women's Badminton Singles SU5India's Thulasimathi Murugesan claimed silver in the Women's Badminton Singles SU5 event on Monday, September 2 after losing to China's Yang Qiuxia. Yang, the defending champion, won the match 21-17, 21-10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-2024-manisha-ramadass-wins-bronze-womens-singles-su5-badminton-2592444-2024-09-02",
      "headline": "Manisha Ramadass makes history with badminton bronze in Paris India's Manisha Ramadass secured the bronze medal in the women's singles SU5 category at the 2024 Paralympics after beating Denmark's Cathrine Rosengren in straight games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/gambhirs-india-coaching-start-kl-rahul-lsg-captaincy-jonty-rhodes-viewpoint-2592400-2024-09-02",
      "headline": "Gambhir's India coaching start, KL Rahul LSG captaincy: Jonty Rhodes' viewpointIn an exclusive interaction on the sidelines of the pre-launch event of the Pro Cricket League, Jonty Rhodes talked about Gautam Gambhir's mixed start to life as India coach and the standout feature of KL Rahul's captaincy at LSG. Rhodes will be serving as the brand ambassador of the Pro Cricket League and admitted he will have an eye out to identify some of the top talent in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-nitesh-kumar-yogesh-kathuniya-sachin-tendulkar-message-2592396-2024-09-02",
      "headline": "Made India proud! Sachin Tendulkar's message to Nitesh Kumar, Yogesh KathuniyaSachin Tendulkar sent a heartfelt message to Nitesh Kumar and Yogesh Kathuniya after the duo brought home gold and silver at the Paris Paralympics 2024 on September 2, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/nitesh-kumar-paralympics-gold-medal-video-highlights-2592391-2024-09-02",
      "headline": "Watch: Nitesh Kumar roars, hugs coaches after winning gold in ParisNitesh Kumar let out a massive roar after winning a gold medal in the Paris Paralympics on Monday, September 2. The shuttler hugged his coaches after winning a tricky 3-game final against Great Britain's Daniel Bethell in men's singles SL3.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-2024-manisha-ramadass-wins-bronze-womens-singles-su5-badminton-2592444-2024-09-02",
      "headline": "Manisha Ramadass makes history with badminton bronze in Paris India's Manisha Ramadass secured the bronze medal in the women's singles SU5 category at the 2024 Paralympics after beating Denmark's Cathrine Rosengren in straight games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/gambhirs-india-coaching-start-kl-rahul-lsg-captaincy-jonty-rhodes-viewpoint-2592400-2024-09-02",
      "headline": "Gambhir's India coaching start, KL Rahul LSG captaincy: Jonty Rhodes' viewpointIn an exclusive interaction on the sidelines of the pre-launch event of the Pro Cricket League, Jonty Rhodes talked about Gautam Gambhir's mixed start to life as India coach and the standout feature of KL Rahul's captaincy at LSG. Rhodes will be serving as the brand ambassador of the Pro Cricket League and admitted he will have an eye out to identify some of the top talent in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-nitesh-kumar-yogesh-kathuniya-sachin-tendulkar-message-2592396-2024-09-02",
      "headline": "Made India proud! Sachin Tendulkar's message to Nitesh Kumar, Yogesh KathuniyaSachin Tendulkar sent a heartfelt message to Nitesh Kumar and Yogesh Kathuniya after the duo brought home gold and silver at the Paris Paralympics 2024 on September 2, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/nitesh-kumar-paralympics-gold-medal-video-highlights-2592391-2024-09-02",
      "headline": "Watch: Nitesh Kumar roars, hugs coaches after winning gold in ParisNitesh Kumar let out a massive roar after winning a gold medal in the Paris Paralympics on Monday, September 2. The shuttler hugged his coaches after winning a tricky 3-game final against Great Britain's Daniel Bethell in men's singles SL3.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-hasan-mahmud-reveals-simple-plan-after-5-wicket-haul-pakistan-2592383-2024-09-02",
      "headline": "Hasan Mahmud reveals 'simple' plan after 5-wicket haul vs PakistanPAK vs BAN: Hasan Mahmud finished with figures of 10.4-1-43-5 as Bangladesh are on the cusp of winning their second Test against Pakistan in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-day-4-report-weather-update-litton-das-hasan-mahmud-nahid-rana-babar-azam-2592371-2024-09-02",
      "headline": "Weather lone challenge as Bangladesh inch closer to historic series sweepRain remains the only challenge for Bangladesh in its bid to cleansweep its Test series 2-0 against Pakistan. Bangladesh put themselves in a strong position on Monday, 2 September after they rattled Pakistan with the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-babar-azam-going-to-get-big-runs-very-soon-very-close-jason-gillespie-2592368-2024-09-02",
      "headline": "Babar Azam is going to get big runs very soon: Jason Gillespie PAK vs BAN: Jason Gillespie said that Babar Azam is very close to returning to his very best. Babar has struggled with the bat, failing to score a single half-century in the last one and half years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-sec-begin-title-defence-against-mict-in-opener-final-at-wanderers-2592358-2024-09-02",
      "headline": "SA20: SEC begin title defence against MICT in opener, final at WanderersSEC will begin their SA20 title defence against MICT on January 9, 2025 at the at St George's Park to kickstart season 3 of the tournament. The final will be played at the iconic Wanderers stadium. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}