{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elf-beauty-buys-hailey-biebers-rhode-in-usd-1-billion-deal-2732645-2025-05-29",
      "headline": "Elf beauty buys Hailey Bieber's Rhode in $1 billion dealElf will acquire Rhode for $600 million in cash and $200 million of newly issued shares of Elf Beauty common stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-dharavi-to-get-a-rs-95790-crore-makeover-in-7-years-2732592-2025-05-29",
      "headline": "Mumbai's Dharavi to get a Rs 95,790 crore makeover in 7 yearsThe redevelopment is being led by a special purpose vehicle (SPV), Navbharat Mega Developers Private Limited (NMDPL), formed through a joint venture between the Maharashtra government's Slum Rehabilitation Authority (SRA) and the Adani Group's Dharavi Redevelopment Project Private Limited (DRPPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbai-record-home-deal-usvs-chairperson-picks-up-duplexes-for-rs-639-crore-naman-xana-building-on-worli-sea-face-2732547-2025-05-29",
      "headline": "Mumbai's record home deal: USV's chairperson picks up duplexes for Rs 639 croreThese sea-facing homes are in the high-end 40-storey Naman Xana building on Worli Sea Face, offering stunning views of the Arabian Sea. The duplexes are spread across four floors – from the 32nd to the 35th, covering a total area of 22,572 sq ft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-321-points-higher-nifty-above-24800-indusind-bank-up-over-2-2732495-2025-05-29",
      "headline": "Sensex ends 321 points higher, Nifty above 24,800; IndusInd Bank up over 2%The BSE Sensex ended 320.70 points higher at 81,633.02, while the NSE Nifty50 settled 81.15 points higher at 24,833.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/key-financial-changes-in-june-2025-free-aadhaar-update-epfo-3-0-launch-financial-rule-changes-saving-credit-fd-rates-india-2732474-2025-05-29",
      "headline": "From PF access to free Aadhaar update: 5 key financial changes in June 2025The deadline to update your Aadhaar details online for free is June 14, 2025. Those who fail to update their identity and address proof documents by this date will incur a fee of Rs 25 for updates through the online portal or Rs 50 at physical Aadhaar centres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-1-vs-itr-2-eligibility-for-income-tax-filing-2025-26-budget-changes-which-tax-form-should-salaried-individuals-choose-2732371-2025-05-29",
      "headline": "ITR-1 or ITR-2: Know which form suits your 2025-26 tax filingAn informative guide on choosing between ITR-1 and ITR-2 for salaried individuals, highlighting the eligibility criteria and recent updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extended-for-many-but-not-all-are-you-among-the-exceptions-2732330-2025-05-29",
      "headline": "ITR deadline extended for many, but not all. Are you among the exceptions?While most taxpayers have extra time to file their returns, not everyone's in the safe zone. If audit rules apply to you, your deadline hasn't moved. Does your name fall on the exception list? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-pension-rules-for-psu-employees-key-things-to-know-2732328-2025-05-29",
      "headline": "New pension rules for PSU employees: Key things to knowUnder the newly notified Central Civil Services (Pension) Amendment Rules, 2025, any PSU employee dismissed or removed after absorption due to misconduct could forfeit their PSU-related benefits and pension entitlements earned during their earlier government service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-withdraws-brand-name-of-new-single-malt-whisky-after-objections-2732272-2025-05-29",
      "headline": "Radico Khaitan withdraws brand name of new single-malt whisky after objectionsRadico Khaitan emphasised that the decision was not merely commercial but a mark of respect for public sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-sister-midnight-release-denies-puri-jagannadh-film-rumours-2732635-2025-05-29",
      "headline": "Exclusive: No Puri Jagannadh film with Vijay Sethupathi and Tabu, says Radhika ApteRadhika Apte's 'Sister Midnight' is finally releasing in India after a hiatus. She clarifies false rumours about her upcoming projects while revealing plans to direct a Marathi film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-kajol-support-8-hour-work-shifts-for-new-mothers-film-industry-deepika-padukone-2732634-2025-05-29",
      "headline": "Ajay Devgn and Kajol support 8-hour work shifts for new mothers in film industryAjay Devgn and Kajol support the demand for 8-hour work shifts for new mothers in the film industry, saying the change is being accepted by many. They spoke about it during the trailer launch of their upcoming film 'Maa'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ileana-d-cruz-to-welcome-second-baby-bump-adorable-pic-michael-dolan-koa-phoenix-dolan-2732296-2025-05-29",
      "headline": "Ileana D'Cruz radiates pregnancy glow as she flaunts baby bump in new picActor Ileana D'Cruz is expecting her second child with husband Michael Dolan, whom she married in 2023. She shared a sweet 'bump buddies' photo on Instagram, confirming the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-ranveer-singh-not-producing-any-shaktimaan-series-2732585-2025-05-29",
      "headline": "Exclusive: Ranveer Singh not producing any Shaktimaan seriesRumours suggested that actor Ranveer Singh had acquired the rights to remake 'Shaktimaan' as a series. However, it seems like the rumours were just that - rumours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ai-in-indian-cinema-danish-devgn-supports-kamal-haasan-questions-emotions-2732564-2025-05-29",
      "headline": "Danish Devgn praises AI as friend while Kamal Haasan questions itDanish Devgn embraces AI as a valuable creative tool in filmmaking. Meanwhile, Kamal Haasan expresses concerns about AI's inability to replicate real human emotions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/revisiting-a-korean-odyssey-after-8-years-where-fantasy-fights-real-life-demons-2732378-2025-05-29",
      "headline": "Where fantasy fights real-life demons: Revisiting A Korean Odyssey after 8 years'A Korean Odyssey', a 2017 show, remains powerful today for its timeless mix of fantasy, emotional depth, and social critique. Not just a love story, it explores loneliness, power, and sacrifice with rich characters and stunning visuals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-dedicates-gaddar-award-to-fans-credits-sukumar-and-pushpa-2-makers-2732551-2025-05-29",
      "headline": "Allu Arjun dedicates Gaddar award to fans, credits Sukumar and Pushpa 2 makers'Pushpa' actor Allu Arjun was recently announced as the winner in the Best Actor (Male) category of the inaugural Gaddar Telangana Film Awards. The star actor expressed his gratitude in a post on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-the-royals-actor-udit-arora-reacts-to-show-criticism-bhumi-pednekar-trolling-2732556-2025-05-29",
      "headline": "Exclusive: The Royals actor Udit Arora reacts to show's criticism, Bhumi's trollingActor Udit Arora, who plays Kunal Mehta, Sophia's ex and business partner in 'The Royals', commented on the trolling that Bhumi Pednekar has been facing online for her appearance on the show. In an exclusive interview with India.in, the actor also talked about the series' criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-to-begin-border-2-shooting-with-sunny-deol-in-june-2732545-2025-05-29",
      "headline": "Diljit Dosanjh to begin Border 2 shooting with Sunny Deol in June: ReportDiljit Dosanjh will reportedly begin shooting for 'Border 2' with Sunny Deol from June 10. He will portray the role of war hero Nirmal Jit Singh Sekhon. The film is set for a Republic Day 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-meets-bsf-jawans-in-jk-salutes-their-valour-2732499-2025-05-29",
      "headline": "Let the world see peace: Huma Qureshi meets BSF jawans in J&K, salutes their valourActor Huma Qureshi met BSF jawans in Jammu and Kashmir. She interacted with them and saluted their valour and sacrifices for the country.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-teaser-sidharth-janhvi-in-desi-romance-about-north-meets-south-2732479-2025-05-29",
      "headline": "Param Sundari teaser: Sidharth-Janhvi star in desi romance bridging North and South'Param Sundari' teaser starring Sidharth Malhotra and Janhvi Kapoor was released on May 29. The film is slated to hit the theatres on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-wraps-up-dubbing-for-hari-hara-veera-mallu-2732482-2025-05-29",
      "headline": "Pawan Kalyan wraps up dubbing for Hari Hara Veera MalluTelugu superstar Pawan Kalyan, who is also the Deputy Chief Minister of Andhra Pradesh, wrapped up dubbing for his highly anticipated film 'Hari Hara Veera Mallu', slated to release theatrically on June 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjan-bajwa-recalls-bonding-with-priyanka-chopra-while-filming-fashion-2732435-2025-05-29",
      "headline": "Actor Arjan Bajwa recalls bonding with Priyanka Chopra while filming FashionActor Arjan Bajwa shared that he and Priyanka Chopra connected over personal struggles while shooting for 'Fashion'. He praised her strength, saying she stayed strong even after finding out about her father's cancer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rowoon-to-begin-mandatory-military-service-in-july-agency-confirms-2732403-2025-05-29",
      "headline": "Destined with You star Rowoon to begin mandatory military service in JulySouth Korean actor and former SF9 member Rowoon will begin his mandatory military service on July 21, 2025. According to his agency, FNC Entertainment, he will enter a training camp on that day and serve as an active-duty soldier in the Army. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-screenshot-of-tovino-thomass-chat-shuts-down-rift-rumours-2732461-2025-05-29",
      "headline": "Actor Unni Mukundan shares screenshot of Tovino's chat, shuts down rift rumoursActor Unni Mukundan shared a screenshot of his chat with colleague Tovino Thomas to shut down rumours of rift. This came after the 'Marco' actor's alleged ex-manager accused him of physically assaulting him for praising Tovino's recently released film 'Narivetta'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-hugh-jackmans-ex-wife-deborra-lee-furness-hints-at-betrayal-amid-divorce-2732376-2025-05-29",
      "headline": "Actor Hugh Jackman's ex-wife Deborra-Lee Furness hints at betrayal amid divorceAmid her divorce proceedings with Wolverine star Hugh Jackman, Australian actor Deborra-Lee Furness has expressed compassion for those who have suffered betrayal in a relationship. Deborra said she has now been focussing on personal growth amid separation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maa-trailer-kajol-transforms-into-kaali-to-end-a-demonic-curse-2732437-2025-05-29",
      "headline": "Maa trailer out: Kajol transforms into Kaali to end a demonic curseThe trailer of 'Maa' starring Kajol is out. The film shows the actor transforming into Goddess Kaali to end a demonic curse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-cannes-bts-video-cannes-abhishek-bachchan-tere-bina-song-2732392-2025-05-29",
      "headline": "Aishwarya Rai shares BTS video from Cannes with Abhishek Bachchan's Tere BinaAishwarya Rai Bachchan shared a behind-the-scenes video of her Cannes 2025 red carpet look, featuring a stunning Manish Malhotra saree and special moments with her daughter, Aaradhya. The video was set to the romantic song 'Tere Bina' from 'Guru'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-sooraj-pancholi-recalls-terrible-jail-term-in-kasabs-cell-sleeping-on-newspaper-2732344-2025-05-29",
      "headline": "Sooraj Pancholi recalls terrible jail term in Kasab's cell, sleeping on newspaperActor Sooraj Pancholi recently recalled his terrible time in Mumbai's Arthur Road Jail where he slept on newspapers. He revealed that he was kept in the same cell where Ajmal Kasab was confined."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-hit-airbases-with-brahmos-missiles-before-pak-could-act-admits-shehbaz-sharif-2732562-2025-05-29",
      "headline": "India hit airbases with BrahMos before Pak could act, admits Shehbaz SharifIndia launched around 15 BrahMos missiles and other precision weapons on the night of May 9-10, targeting key Pakistani airbases. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tariffs-never-came-up-in-talks-with-us-until-ceasefire-with-pak-india-on-trump-teams-claim-in-us-court-2732521-2025-05-29",
      "headline": "Tariffs not part of talks: India on Trump team's fresh Pak ceasefire claimThe Ministry of External Affairs clarified its stand after the Donald Trump administration told a court that the threat of tariffs helped the US broker a ceasefire between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-indian-strikes-pak-terror-groups-ramp-up-outreach-propaganda-and-hiring-2732575-2025-05-29",
      "headline": "After Indian strikes, Pak terror groups ramp up outreach, propaganda and hiringPakistan-based Jaish-e-Mohammed and Lashkar-e-Taiba have stepped up their public outreach campaigns on the back of Pakistan's falsely claimed success in the conflict with India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-pbks-rcb-qualifier-1-live-score-rajat-patidar-shreyas-iyer-punjab-vs-bengaluru-match-updates-2732563-2025-05-29",
      "headline": "PBKS vs RCB Live: Advantage Bengaluru as Bhuvneshwar, Dayal dominatePBKS (Punjab) vs RCB (Bengaluru), Qualifier 1 IPL 2025 Live Score Updates: Yash Dayal and Bhuvneshwar Kumar have dominated the opening exchanges in the match. Both Priyansh Arya and Prabhsimran Singh have returned to the dug as Punjab struggle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/jelly-shoes-90s-fashion-trend-rihanna-tania-shroff-2732530-2025-05-29",
      "headline": "Jelly shoes are on a re-run, and Rihanna approves of them tooThe '90s jelly shoes are walking again! While people are still contemplating whether to buy them or not, the trend has already reached celebrities and is now making its way to the mainstream."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/first-year-engineering-student-reportedly-dies-by-suicide-in-ponnampet-kodagu-ktaka-hostel-room-cites-academic-stress-six-backlogs-2732553-2025-05-29",
      "headline": "Karnataka engineering student dies by suicide, note mentions academic pressureA 19-year-old engineering student in Karnataka's Kodagu allegedly died by suicide in her hostel room. Police recovered a note citing academic pressure and multiple backlogs as the reason.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/200-muslim-congress-leaders-resignations-in-dakshina-kannada-over-abdul-raheem-alias-imtiyaz-murder-case-2732659-2025-05-29",
      "headline": "Over 200 Muslim Congress leaders resign in protest of Dakshina Kannada murderOver 200 Muslim Congress leaders resign en masse, accusing the Karnataka government of mishandling the investigation into the murder of Abdul Raheem alias Imtiyaz in Bantwal, Dakshina Kannada district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-is-donald-trump-one-big-beautiful-bill-that-made-elon-musk-quit-doge-2732524-2025-05-29",
      "headline": "What is Trump's One Big Beautiful Bill that caused the billionaire breakup?Trump says it's big and beautiful; Elon Musk says it can't be both. The One Big Beautiful Bill has driven a wedge between two buddies who, until now, were the poster pair for political bromance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/400-person-indian-baraat-turns-wall-street-into-a-wedding-dance-floor-in-new-york-viral-video-2732633-2025-05-29",
      "headline": "400-person Indian baraat turns Wall Street into a wedding dance floor. Watch videoNew York's Wall Street turned into a full-blown wedding dance floor when a 400-person Indian baraat took over the streets of Lower Manhattan.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/moderate-rain-gusty-winds-likely-in-delhi-ncr-over-next-2-hours-orange-alert-issued-2732498-2025-05-29",
      "headline": "Storm, rain, gusty winds bring respite from heat in parts of Delhi-NCRAn orange alert has been issued for the majority of the National Capital Region, while a yellow alert has been sounded for areas in the northwestern and southwestern parts of the NCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/blessing-in-disguise-why-awami-leagues-obaidul-quader-sees-opening-in-bangladesh-turmoil-2732523-2025-05-29",
      "headline": "Why Awami League's Obaidul Quader sees opening in Bangladesh turmoilThe Awami League general secretary, in an exclusive interview, dwells on the state of affairs under the interim government and his vision for the party"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-economy-investment-muhammad-yunus-grameen-bank-tax-exemption-conflict-of-interest-2731970-2025-05-29",
      "headline": "As Yunus fiddles, Bangladesh slides, his Grameen family soarsBangladesh hasn't just seen a rise of Muhammad Yunus, it has seen businesses associated with him switch to top gears. The interim government gave nod to the setting up of Grameen University, allowed Grameen Telecom to operate a mobile wallet, approved manpower export licence for Grameen Employment and reinstated tax-exemption status for Grameen Bank. Though none of the deals are illegal, they have raised a stink."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjees-live-tv-debate-challenge-to-pm-modi-says-political-holi-being-played-2732505-2025-05-29",
      "headline": "Bring your teleprompter: Mamata Banerjee challenges PM Modi to a Live TV debateWest Bengal Chief Minister Mamata Banerjee hit out at PM Modi for trying to 'defame' Bengal at a time when a Trinamool Congress MP is defending the country on the international stage as part of a global delegation on Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-chief-amar-preet-singh-slams-hal-defence-industry-project-timeline-tejas-delay-2732488-2025-05-29",
      "headline": "IAF chief flags delays: We sign contracts despite knowing it won't come on timeSpeaking at a public event, Air Force Chief Amar Preet Singh admitted that 'timeline is a big issue.' His remarks came nearly three months after he publicly expressed displeasure over the delay in the delivery of Tejas Mk1A fighter jets by Hindustan Aeronautics Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-kamal-haasans-rajya-sabha-berth-may-turn-his-political-future-2732510-2025-05-29",
      "headline": "How Kamal Haasan's Rajya Sabha berth may turn his political futureHaasan has always kept the lines between cinema and politics blurred. With Parliament now part of his stage, his next act will be a keener watch"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/singapore-woman-fiery-fight-with-husband-over-colleague-calling-him-baby-viral-video-you-betrayed-me-2732584-2025-05-29",
      "headline": "Singapore woman's fiery fight with husband over colleague calling him baby. Viral videoThe argument centered around a female colleague who called the man \"baby,\" a term of endearment that enraged his wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-qualfier-1-difference-2016-squad-big-name-dependence-vs-pbks-2732438-2025-05-29",
      "headline": "2016 vs 2025: How RCB stand different from their last shot at Qualifier 1RCB return to Qualifier 1 with a transformed squad, sharper strategy, and renewed hunger. Gone are the days of big-name dependence — this team is built on balance, belief, and execution. Will 2025 finally end their trophy drought?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/gujarat-dingucha-family-froze-to-death-while-crossing-into-us-smugglers-jailed-3-years-later-illegal-immigrants-in-america-2732473-2025-05-29",
      "headline": "Gujarat family froze to death while entering US, smugglers jailed 3 years laterTwo human smugglers, including an Indian national, have been sentenced to up to 10 years in the US for their roles in trying to get a family of four from Gujarat's Dingucha illegally into the country, which resulted in their freezing to death. The four, including two children, died in 2022 while trying to cross into the US from Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pawan-khera-slams-shashi-tharoor-over-pm-modi-surgical-strike-congress-takes-veiled-dig-2732423-2025-05-29",
      "headline": "I agree...: After Shashi Tharoor's zealots jab, Pawan Khera's 2018 book reminderThe war of words between Shashi Tharoor and his party has intensified, as senior Congress leader Pawan Khera shared an excerpt from the Lok Sabha MP's book The Paradoxical Prime Minister, in which he called the Modi government 'shameless' for publicising the 2016 surgical strikes for electoral gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-nepal-mount-kangchenjunga-expidition-sikkim-prem-singh-tamang-amit-shah-letter-ban-on-summit-2732346-2025-05-29",
      "headline": "Why summiting of Himalayan peak from Nepal stirred up a storm in SikkimThe scaling of Mount Kanchenjunga, the world's third-highest peak on the India-Nepal border, by a group of mountaineers from the Nepal side has sparked outrage in Sikkim. The Chief Minister of Sikkim, Prem Singh Tamang, has written a letter to the Centre, urging that the matter be taken up with Nepal. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/let-commander-saifullah-kasuri-pahalgam-attack-mastermind-pakistan-rally-talha-saeed-2732353-2025-05-29",
      "headline": "Now, I am famous: LeT commander behind Pahalgam attack at anti-India rallyLeT commander Saifullah Kasuri, accused of masterminding the Pahalgam terror attack, resurfaced at a rally in Pakistan alongside political leaders and wanted terrorists like Hafiz Saeed's son Talha Saeed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/murshidabad-violence-an-example-of-tmc-governments-nirmamta-pm-attacks-mamata-banerjee-in-bengal-2732457-2025-05-29",
      "headline": "PM Modi's 'nirmamta' swipe at Mamata Banerjee over Murshidabad violencePM Modi said Bengal is currently facing multiple crises, with widespread violence and lawlessness tearing at the state's social fabric. He claimed that the people have lost faith in the Trinamool Congress government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/elon-musk-chainsaw-exit-another-donald-trump-buddy-bites-the-dust-2732366-2025-05-29",
      "headline": "Musk's chainsaw exit: Another Trump buddy bites the dustElon Musk joined Trump admin as a so-called special government employee, bringing with him big plans to shred wasteful and fraudulent spending. After 130 days at the helm of DoGE, Musk announced his resignation. His exit from the Trump administration was as predictable as it was dramatic, no surprise there."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-2025-jyoti-yarraji-hurdles-avinash-sable-steeplechase-gold-2732661-2025-05-29",
      "headline": "Jyothi defends 100m hurdles title, Avinash ends 36-year wait for steeplechase goldAsian Athletics Championships: 25-year-old Jyothi Yarraji smashed the Championships record to win gold in women's 100m hurdles. Avinash Sable dominated the 3000m steeplechase to win a gold for India in the event after 36 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-yuzvendra-chahal-rajat-patidar-mullanpur-2732654-2025-05-29",
      "headline": "IPL 2025 Qualifier 1: No Chahal for PBKS, Patidar returns as RCB captainPunjab Kings will be without the services of Yuzvendra Chahal once again for the all-important Qualifier 1 against Royal Challengers Bengaluru. RCB welcomes back Rajat Patidar to the playing XI as the MP batter returns as captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-day-5-jessica-pegula-mirra-andreeva-roland-garros-2732620-2025-05-29",
      "headline": "Jessica Pegula made to sweat, Mirra Andreeva into 3rd roundJessica Pegula was made to work hard in the second set as she defeated Ann Li to progress to the third round. Mirra Andreeva produced some magic to defeat Ashlyn Krueger in straight sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-father-retirement-farewell-speech-viral-barc-2732613-2025-05-29",
      "headline": "Papa is my superman: Suryakumar Yadav's speech at father's retirement goes viralSuryakumar Yadav gave a heartfelt and humorous speech at his father's retirement ceremony. Suryakumar's father, Ashok, retired after a distinguished career as a scientist at the Bhabha Atomic Research Centre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-arshdeep-singh-debut-ricky-ponting-indian-team-management-2732566-2025-05-29",
      "headline": "ENG vs IND: Start with Arshdeep, says Ponting to Indian team managementRicky Ponting said that India should start with Arshdeep Singh during the England tour as the left-arm pacer could prove to be a point of difference. Arshdeep is one of the new faces for the tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-pbks-rcb-qualifier-1-live-score-rajat-patidar-shreyas-iyer-punjab-vs-bengaluru-match-updates-2732563-2025-05-29",
      "headline": "PBKS vs RCB Live: Dayal dismisses Priyansh, gives team terrific startPBKS (Punjab) vs RCB (Bengaluru), Qualifier 1 IPL 2025 Live Score Updates: Yash Dayal has dismissed Priyansh Arya in the second over of the match. Both him and Bhuvneshwar Kumar have found a slight amount of seam early and have not allow Punjab to get off to a good start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-questions-digvesh-rathis-ban-with-ms-dhonis-example-2732541-2025-05-29",
      "headline": "Dhoni barged into ground and wasn't banned, Digvesh should've been spared: SehwagFormer India cricketer-turned commentator Virender Sehwag questioned Digvesh Rathi's suspension, giving MS Dhoni's example from IPL 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-fan-praying-temple-qualifier-1-watch-video-viral-vs-pbks-qualifier-1-2732537-2025-05-29",
      "headline": "Watch: RCB fan prays at temple before Qualifier 1 vs PBKS, video goes viralIPL 2025: An RCB fan's temple visit ahead of the side's crucial Qualifier 1 vs PBKS  has gone viral, capturing the spirit and belief of a loyal fanbase hoping 2025 will finally bring the franchise its long-awaited IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualfier-1-ricky-ponting-no-point-to-prove-delhi-capitals-2732513-2025-05-29",
      "headline": "PBKS coach Ricky Ponting reflects on stellar IPL 2025: No point to proveRicky Ponting insists he has \"nothing to prove\" with Punjab Kings' success in IPL 2025. After years without a title at Delhi Capitals, Ponting says full control and strong leadership at PBKS have made all the difference in his new side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-arshdeep-singh-debut-ricky-ponting-indian-team-management-2732566-2025-05-29",
      "headline": "ENG vs IND: Start with Arshdeep, says Ponting to Indian team managementRicky Ponting said that India should start with Arshdeep Singh during the England tour as the left-arm pacer could prove to be a point of difference. Arshdeep is one of the new faces for the tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-pbks-rcb-qualifier-1-live-score-rajat-patidar-shreyas-iyer-punjab-vs-bengaluru-match-updates-2732563-2025-05-29",
      "headline": "PBKS vs RCB Live: Dayal dismisses Priyansh, gives team terrific startPBKS (Punjab) vs RCB (Bengaluru), Qualifier 1 IPL 2025 Live Score Updates: Yash Dayal has dismissed Priyansh Arya in the second over of the match. Both him and Bhuvneshwar Kumar have found a slight amount of seam early and have not allow Punjab to get off to a good start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-questions-digvesh-rathis-ban-with-ms-dhonis-example-2732541-2025-05-29",
      "headline": "Dhoni barged into ground and wasn't banned, Digvesh should've been spared: SehwagFormer India cricketer-turned commentator Virender Sehwag questioned Digvesh Rathi's suspension, giving MS Dhoni's example from IPL 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-fan-praying-temple-qualifier-1-watch-video-viral-vs-pbks-qualifier-1-2732537-2025-05-29",
      "headline": "Watch: RCB fan prays at temple before Qualifier 1 vs PBKS, video goes viralIPL 2025: An RCB fan's temple visit ahead of the side's crucial Qualifier 1 vs PBKS  has gone viral, capturing the spirit and belief of a loyal fanbase hoping 2025 will finally bring the franchise its long-awaited IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualfier-1-ricky-ponting-no-point-to-prove-delhi-capitals-2732513-2025-05-29",
      "headline": "PBKS coach Ricky Ponting reflects on stellar IPL 2025: No point to proveRicky Ponting insists he has \"nothing to prove\" with Punjab Kings' success in IPL 2025. After years without a title at Delhi Capitals, Ponting says full control and strong leadership at PBKS have made all the difference in his new side."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}