{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-caveat-legal-battle-tata-trusts-whats-next-noel-ratan-2813269-2025-11-04",
      "headline": "Caveat filed, battle begins: What's next for Mehli Mistry and Tata TrustsMistry's three-year term as trustee ended on October 28, 2025. A circular was issued on 23 October seeking approval for his reappointment as a life trustee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-money-in-good-shape-5-financial-vitals-to-check-every-year-2813233-2025-11-04",
      "headline": "Is your money in good shape? 5 financial vitals to check every yearWhen was the last time you checked the health of your finances? Are your savings, investments, and expenses aligned with your goals, or drifting off track? A quick yearly check-up can reveal the answers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/up-government-announces-1-recovery-relief-for-rice-millers-and-farmers-details-here-2813245-2025-11-04",
      "headline": "UP government announces 1% recovery relief for rice millers and farmers. Details hereNearly two lakh employment opportunities are expected to get a boost as rice mills expand their operations. It will also increase competition among millers, making procurement faster and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rare-earth-magnet-production-triple-india-ambition-decoded-2813244-2025-11-04",
      "headline": "Race for the rare earths: Why India is tripling its magnet betIndia's clean-tech future depends on independence in the smallest technologies. Owning magnet manufacturing protects growth, shields jobs, and ensures ambitions are never paused by politics outside the country's borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-20-years-to-11-expert-shares-how-smart-home-loan-hacks-can-save-rs-30-lakh-2813214-2025-11-04",
      "headline": "From 20 years to 11: Expert shares how smart home loan hacks can save Rs 30 lakhTurning a 20-year home loan into an 11-year success story may sound ambitious, but with the right strategy, it's entirely possible. A few simple tweaks, like extra EMIs and gradual step-ups, can help borrowers save up to Rs 30 lakh in interest, says an expert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-europe-on-your-bucket-list-heres-why-now-is-the-best-time-to-visit-2813155-2025-11-04",
      "headline": "Is Europe on your bucket list? Here's why now is the best time to visitAccording to the report, the average travel packages across major European destinations are 25–40% cheaper in the winter months compared to the busy June–August period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-partners-with-india-post-payments-bank-to-offer-doorstep-digital-life-certificate-service-for-pensioners-2813122-2025-11-04",
      "headline": "EPFO partners with IPPB to offer doorstep Digital Life Certificate serviceThe Doorstep Digital Life Certificate service is based on Jeevan Pramaan, a digital certificate that confirms a pensioner's life status using Aadhaar-based biometric verification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-grew-wealth-by-62-percent-since-2000-finds-g20-backed-report-2813116-2025-11-04",
      "headline": "India's top 1% grew wealth by 62% since 2000, finds G20-backed reportThe study warns that inequality worldwide has now reached levels that threaten democratic stability, economic resilience and climate cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/airtel-shares-rise-nearly-3-percent-why-strong-q2-results-buy-or-sell-review-2813106-2025-11-04",
      "headline": "Airtel shares rise 3% after Q2 results. Should you buy or sell?For the second quarter of FY26, Bharti Airtel reported a 73.6% year-on-year increase in consolidated net profit to Rs 6,792 crore, supported by solid growth in both its India and Africa operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hedging-inflation-parallel-gold-correlation-expert-view-common-difference-2813077-2025-11-04",
      "headline": "Does bitcoin hedge against inflation the way gold does?For centuries, gold has been that safe haven, protecting wealth against inflation and systemic shocks. Lately, Bitcoin has joined that category, emerging as an alternative for investors looking to hedge against uncertainty in an increasingly digital world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/nse-to-launch-pre-open-session-for-futures-and-options-segment-check-key-details-timings-2813073-2025-11-04",
      "headline": "NSE to launch pre-open session for F&O segment. Key details traders should knowThe pre-open will run for 15 minutes, from 9:00 am to 9:15 am. The first part of this window is where traders can place, modify, or cancel orders. That phase will close at a random moment between 9:07 and 9:08 am, preventing last-second order manipulation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-consolidate-key-q2-results-shares-up-down-nse-bse-2813050-2025-11-04",
      "headline": "Sensex, Nifty open flat as markets consolidate before key Q2 resultsThe S&P BSE Sensex was down by 123.01 points to 83,855.48, while the NSE Nifty50 lost 53.50 points to 25,710.05 as of 9:33 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aws-openai-amazon-nvidia-gpus-usd-38-billion-deal-chips-ai-race-cloud-computing-business-2813039-2025-11-04",
      "headline": "Amazon, OpenAI sign massive $38 billion deal for Nvidia chipsUnder the deal, AWS will provide OpenAI with access to hundreds of thousands of Nvidia graphics processing units (GPUs), including the latest GB200 and GB300 AI accelerators. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/groww-ipo-review-opening-today-price-band-gmp-subscribe-skip-profit-listing-gains-2813027-2025-11-04",
      "headline": "Groww IPO open for bidding: Should you subscribe? Check GMPThe Rs 6,632.30 crore Groww IPO opens for bidding on November 4 and will close on November 7, 2025. The issue includes a fresh issue worth Rs 1,060 crore and an offer for sale (OFS) of Rs 5,572.30 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-says-ed-has-attached-assets-under-pmla-clarifies-anil-ambani-not-on-board-since-35-years-2812902-2025-11-03",
      "headline": "ED has attached assets under PMLA, Anil Ambani not on board: Reliance InfraThe clarification follows the ED's latest attachment of over 132 acres of land at Dhirubhai Ambani Knowledge City in Navi Mumbai, worth Rs 4,462 crore, in a bank fraud case involving Reliance Communications and related firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/adani-power-bangladesh-opt-for-arbitration-to-settle-payment-dispute-report-2812852-2025-11-03",
      "headline": "Adani Power, Bangladesh opt for arbitration to settle payment dispute: ReportAdani Power stressed that it continues to meet its contractual obligation to supply electricity to Bangladesh and is receiving regular payments to the extent acknowledged by Bangladesh Power Development Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/luxury-in-2026-why-financial-peace-is-the-ultimate-status-symbol-explains-ca-2812804-2025-11-03",
      "headline": "Luxury in 2026: Why financial peace is the ultimate status symbol, explains CALuxury isn't loud any more. In 2026, it's quiet, calm, and deeply personal. As one CA puts it, the ultimate status symbol is not a luxury car or a holiday abroad — it's the peace that comes from financial stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-october-rally-flat-auto-it-fmcg-shares-mahindra-maruti-itc-tcs-2812658-2025-11-03",
      "headline": "Sensex, Nifty take a breather after October's strong rally as markets end flatThe S&P BSE Sensex gained 39.78 points to close at 83,978.49, while the NSE Nifty50 added 41.25 points to end at 25,763.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-vs-groww-which-ipo-is-better-more-profit-details-review-latest-gmp-listing-gains-2812643-2025-11-03",
      "headline": "Lenskart vs Groww: Which IPO offers better value for investors? Lenskart offers exposure to India's growing eyewear market backed by a strong offline and online presence, while Groww provides access to the country's booming retail investment ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-vs-credit-card-emi-which-option-saves-you-more-money-cost-effective-interest-on-credit-card-emi-2812602-2025-11-03",
      "headline": "Personal loan vs credit card EMI: Which option saves you more money?Managing expenses through instalments can be convenient, but it's important to know what you're signing up for. Should you go for a personal loan or a credit card EMI when you need quick funds? Let's find out which one benefits your pocket more."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/afro-tapang-song-praised-prabhudheva-kannada-film-45-2813252-2025-11-04",
      "headline": "Prabhudheva gives shoutout to Shiva Rajkumar, Upendra's Afro Tapang from 45 Renowned choreographer and actor Prabhudheva showered praise on the recently released promotional song 'Afro Tapang' from the upcoming Kannada film '45', starring Shiva Rajkumar, Upendra, and Raj B Shetty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mandira-bedi-donated-entire-ad-fee-to-support-india-womens-cricket-team-2813241-2025-11-04",
      "headline": "When Mandira Bedi donated entire ad fee to support India's Women's cricket team Mandira Bedi, the first woman to host the ICC Cricket World Cup, supported India's women cricketers when they struggled for resources. Her donation to the Women's Cricket Association of India helped fund the team's tour, long before women's cricket gained mainstream recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-leads-billboard-200-the-life-of-a-showgirl-daniel-caesar-demi-lovato-top-10-albums-2813228-2025-11-04",
      "headline": "Taylor Swift's album The Life of a Showgirl rules Billboard 200 again Taylor Swift's latest album marks a notable achievement on the Billboard 200, while new releases from Daniel Caesar, Brandi Carlile, and Demi Lovato make strong debuts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mastiii-4-trailer-review-the-boys-vivek-oberoi-riteish-deshmukh-aftab-shivdasani-return-to-get-a-love-visa-in-adult-comedy-2813227-2025-11-04",
      "headline": "Mastiii 4 trailer: The boys return to get a love visa in adult comedy Vivek Oberoi, Riteish Deshmukh, and Aftab Shivdasani reunite for 'Mastiii 4', directed by Milap Zaveri. The trailer promises double-meaning jokes and wild chaos as the iconic trio returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-govinda-spends-lakhs-on-religious-rituals-but-wont-give-me-money-2813196-2025-11-04",
      "headline": "Sunita Ahuja: Govinda spends lakhs on religious rituals but won't give me money Sunita Ahuja opened up about her marriage with Govinda. She also shared her plans to independently support social causes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-says-he-moved-to-dubai-for-peace-wanted-to-escape-the-noise-2813213-2025-11-04",
      "headline": "Wanted to escape noise: Ajith Kumar says Dubai life keeps him grounded and focused Ajith Kumar has traded Chennai's spotlight for Dubai's calm, choosing motorsports and solitude over celebrity chaos, while staying true to his middle-class values of simplicity and self-reliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-begins-naagzilla-shoot-film-to-release-on-independence-day-2026-karan-johar-2813218-2025-11-04",
      "headline": "Kartik Aaryan begins Naagzilla shoot, film to release on Independence Day 2026 Actor Kartik Aaryan has begun shooting for his upcoming film 'Naagzilla'. The movie will release in theatres on Independence Day 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-says-she-no-longer-seeks-validation-through-awards-2813212-2025-11-04",
      "headline": "Yami Gautam says she no longer seeks validation through awards: Audience loves me Yami Gautam said she has stopped seeking validation through awards or external approval, choosing instead to focus on the love she receives from her audience. The actor, who will next be seen in 'Haq', believes true success lies in staying detached and fulfilled through meaningful work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-emraan-hashmi-yami-gautam-cleared-by-censor-with-no-cuts-worldwide-amid-legal-notices-from-shah-bano-family-2813206-2025-11-04",
      "headline": "HAQ cleared with no cuts worldwide amid legal notices from Shah Bano's family Emraan Hashmi and Yami Gautam's 'HAQ' has been cleared by censor board worldwide with zero cuts ahead of its November 7 release. Inspired by the Shah Bano case, the film explores themes of justice, gender equality, and faith. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonathan-bailey-named-2025-people-sexiest-man-alive-2813188-2025-11-04",
      "headline": "Bridgerton star Jonathan Bailey named 2025's Sexiest Man Alive Jonathan Bailey, best known as Lord Anthony from 'Bridgerton', has been crowned People's Sexiest Man Alive 2025. The actor reacted to the news with his trademark charm on The Tonight Show Starring Jimmy Fallon, calling the honour both \"flattering and absurd\" as the franchise celebrates its 40th year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-anushka-sharma-fan-reel-viral-humorous-support-remarks-2813157-2025-11-04",
      "headline": "Anushka reacts to fan's hilarious reel on Virat's remarks about support from wife A fan-made reel portraying disappointment over Virat Kohli's statement about support from Anushka Sharma gains attention as the actor liked the post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-malik-father-daboo-malik-doubts-his-girlfriends-existence-lover-in-third-dimension-2813185-2025-11-04",
      "headline": "Amaal Malik's father doubts his girlfriend's existence: Lover in third dimension Amaal Mallik's father, Daboo Malik, opens up about his son's mysterious love life and ongoing journey on 'Bigg Boss 19'. He called it an \"invisible love story\" set in a \"third dimension.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/in-waves-and-war-review-the-silent-struggle-of-navy-seals-finding-their-way-back-2813141-2025-11-04",
      "headline": "In Waves and War review: The silent struggle of Navy SEALs finding their way backRelease Date:Mon Nov 03, 2025 'In Waves and War' is a moving documentary that explores the hidden battles veterans face after combat ends. Through confessions and psychedelic therapy, it offers a deeply human look at pain, healing, and the fragile hope of starting over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-priyanka-not-arjun-alia-were-original-choice-for-2-states-chetan-bhagat-2813154-2025-11-04",
      "headline": "SRK-Priyanka, not Arjun-Alia were original choice for 2 States: Chetan Bhagat Chetan Bhagat has revealed that Shah Rukh Khan and Priyanka Chopra were initially considered for the film '2 States'. The final casting of Arjun Kapoor and Alia Bhatt brought a fresh perspective to the adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bandla-ganesh-praise-dig-at-vijay-deverakonda-while-praising-kiran-abbavaram-2813160-2025-11-04",
      "headline": "Telugu producer takes swipe at actor's ego, fans say it's a dig at Vijay Deverakonda Producer Bandla Ganesh's remarks at a recent Telugu film success meet have sparked conversation. His comments on an actor's attitude were perceived to be a dig at Vijay Deverakonda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-anand-mocks-funny-logic-as-srk-king-look-draws-brad-pitt-comparisons-2813148-2025-11-04",
      "headline": "Siddharth Anand mocks funny logic as SRK's King look draws Brad Pitt comparisons Shah Rukh Khan's first look from 'King' sparked comparisons with Brad Pitt's 'F1' outfit, igniting debate over Bollywood's originality. Director Siddharth Anand responded with humour, calling out the \"funny logic\" behind the criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-joins-sunny-leone-new-splitsvilla-x6-co-host-2813134-2025-11-04",
      "headline": "Karan Kundrra joins Sunny Leone as co-Host for Splitsvilla X6. Watch promo Karan Kundrra is set to join Sunny Leone as the co-host of MTV's dating reality show Splitsvilla X6. The show's makers have revealed a new promotional video announcing Kundrra's addition to the hosting team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-rashmika-mandannas-the-girlfriend-is-her-biggest-gamble-yet-2813079-2025-11-04",
      "headline": "Why Rashmika Mandanna's The Girlfriend is her biggest gamble yet Rashmika Mandanna is ready to start a new phase in her career with 'The Girlfriend', a film that could showcase her artistic side beyond her star image. Releasing around the time of her engagement buzz, it marks her shift from a popular actor to a more serious performer in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veteran-marathi-actor-daya-dongre-dies-at-85-eknath-shinde-mourns-2813107-2025-11-04",
      "headline": "Veteran Marathi actor Daya Dongre dies at 85, Eknath Shinde pays tribute Daya Dongre, a celebrated name in Marathi cinema and theatre, died at the age of 85 after a long illness. Her career spanned decades, with memorable roles in theatre, television, and film, earning her both critical acclaim and awards."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-doctor-dermatologist-wife-murder-anaesthetic-drug-police-chilling-text-to-women-2813140-2025-11-04",
      "headline": "I killed my wife for you: Bengaluru doctor's message to women weeks after murderAfter killing his dermatologist wife with an anaesthetic drug, Bengaluru doctor Mahendra Reddy sent a chilling message, \"I killed my wife for you\", to several women, including one who had earlier rejected him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-field-marshal-asim-munir-more-powers-27th-constitution-amendment-2813248-2025-11-04",
      "headline": "More powers to Field Marshal Asim Munir? Buzz over Constitution amendment bidPakistan has decided to push through a controversial constitutional amendment widely seen as designed to secure the position and power of army chief Asim Munir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-courts-halt-ice-deportation-indian-man-subramanyam-subu-vedam-jailed-43-years-2813072-2025-11-04",
      "headline": "US courts halt deportation of Indian-origin man wrongfully jailed for 43 yearsSubramanyam 'Subu' Vedam, who came to the US when he was 9 months old, was arrested in 1982 for allegedly killing his friend. He spent more than 40 years in prison before his conviction was overturned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tharoor-should-blame-kamaraj-for-dynastic-politics-in-india-not-nehru-2813179-2025-11-04",
      "headline": "Tharoor should blame Kamaraj also for dynastic politics, not just NehruCongress leader Shashi Tharoor critiques the Nehru-Gandhi family's role in cementing dynastic politics in India. Historically, it was party kingmaker Kamaraj who helped Indira Gandhi become PM after Shastri's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bihar-assembly-election-2025-tejashwi-yadav-nitish-kumar-mahagathbandhan-mokama-murder-2812859-2025-11-04",
      "headline": "Bihar bizarre: Tejashwi, not Nitish, fights anti-incumbency, candidate is keyThough Nitish Kumar has ruled Bihar for most of the last 20 years, it seems it is Mahagathbandhan's CM candidate, Tejashwi Yadav, who is actually fighting anti-incumbency from Lalu's era. Though Modi magic is intact, in this neck-on-neck fight, it will ultimately boil down to candidate selection. But whoever wins, will Bihar really win?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/linda-sarsour-claims-hamas-linked-cair-funded-zohran-mamdani-campaign-new-york-city-mayor-election-2813256-2025-11-04",
      "headline": "Mamdani got campaign funds from Hamas-linked outfit, says mentor Linda SarsourPalestinian-American activist Linda Sarsour has claimed that the Council on American-Islamic Relations (CAIR), under congressional scrutiny for alleged Hamas ties, funded Zohran Mamdani's campaign for the New York City mayoral polls. Sarsour, who is Mamdani's political mentor, said CAIR gave him $120,000, becoming its biggest funder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-india-honouring-legends-ashwin-men-never-did-2813001-2025-11-04",
      "headline": "Ashwin praises Harmanpreet-led India for honouring legends: Men's team never did itRavichandran Ashwin's bold words hit home after India's historic win. The off-spinner praised Harmanpreet Kaur's side for doing what, in his view, the men's team never did, sharing their glory with past legends."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/unity-in-action-northeast-parties-announce-major-merger-into-single-entity-2813242-2025-11-04",
      "headline": "Unity in action: Northeast parties announce major merger into single entityDeclaring that \"our strength lies in unity\" and emphasising the need to give the people of the region one collective voice, the northeastern leaders said a committee has been constituted to oversee the merger process. The committee, convened by National People's Party (NPP) president James Sangma, will work over the next 45 days to finalise the structure of the unified entity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-does-not-want-immigrants-anti-immigration-unless-they-serve-us-military-army-indians-in-america-green-card-citizenship-2813208-2025-11-04",
      "headline": "US doesn't want immigrants, unless they're ready to die for itWhile there's a growing anti-immigrant sentiment in the US, thousands of immigrants, including Indians, are serving in the US military. Many join the wings of the American military for stable pay, benefits, and a faster path to citizenship. The reason why America allows foreigners to be enlisted into its forces is its recruitment shortfalls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ravi-uppal-flees-uae-mahadev-betting-app-scam-ed-cbi-probe-2813229-2025-11-04",
      "headline": "Mahadev betting app promoter flees UAE, currently untraceable: SourcesRavi Uppal, who co-owned the Mahadev Online Book with Sourabh Chandrakar, was briefly detained by UAE authorities in December 2023 but later released. His current whereabouts are unknown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/central-railway-engineers-face-criminal-charges-over-deadly-mumbra-train-accident-2813058-2025-11-04",
      "headline": "In a 1st, negligence charges against railway engineers over Thane train accidentFor the first time in railway history, criminal charges have been filed directly against Central Railway engineers following the fatal Thane train accident. This move marks a significant shift in accountability as the investigation reveals ignored warnings, incomplete repairs, and non-compliance with operational standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonathan-bailey-named-2025-people-sexiest-man-alive-2813188-2025-11-04",
      "headline": "Bridgerton star Jonathan Bailey named 2025's Sexiest Man AliveJonathan Bailey, best known as Lord Anthony from 'Bridgerton', has been crowned People's Sexiest Man Alive 2025. The actor reacted to the news with his trademark charm on The Tonight Show Starring Jimmy Fallon, calling the honour both \"flattering and absurd\" as the franchise celebrates its 40th year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/ice-agents-pull-out-us-citizen-car-video-collision-chicago-brute-force-2813053-2025-11-04",
      "headline": "US fed agents pull woman out of car, pin her down after she 'rams' their vehicleA viral video shows Immigration and Customs Enforcement (ICE) agents forcibly removing a woman from her car and pinning her on the ground in Chicago after she hit their unmarked federal vehicle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-yunus-govt-drop-music-physical-education-primary-school-teacher-post-after-islamist-pushback-warning-2812716-2025-11-04",
      "headline": "Yunus govt bows to Islamists, drops plan to hire music, physical education teachersUnder mounting pressure from hardline Islamic clerics, the interim government of Muhammad Yunus has scrapped its plans to hire music and physical education teachers for government-run primary schools. Calling the move \"un-Islamic, forced and irrelevant\", the Islamists had threatened to take to the streets if their demand was not met. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/faridabad-stalking-case-minor-girl-shot-outside-private-library-accused-under-police-hunt-2812991-2025-11-04",
      "headline": "Video: Haryana man shoots teen after stalking her, both attended same libraryThe incident took place outside a private library in Faridabad that both the girl and the accused regularly attended for study sessions, and was recorded on CCTV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/kim-kardashian-does-not-believe-humans-landed-on-the-moon-nasa-isnt-amused-2813232-2025-11-04",
      "headline": "Kim Kardashian thinks the Moon landing was fake. Nasa isn't amusedIn a new episode of Hulu's The Kardashians, Kardashian told viewers she thought astronauts Neil Armstrong and Buzz Aldrin never actually landed on the Moon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/3-accused-of-raping-college-student-in-coimbatore-shot-by-cops-arrested-2812997-2025-11-04",
      "headline": "3 men shot by cops, arrested over gang-rape of student near Coimbatore airportThe gang rape of the college student near Coimbatore airport has sent shockwaves across the state, sparking widespread political outrage. Several parties have demanded stringent action against the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/jubilee-hills-bypoll-2023-revanth-reddy-congress-brs-hyderabad-election-2813193-2025-11-04",
      "headline": "Why Jubilee Hills electoral contest could impact Telangana's political roadmapRevanth Reddy faces a crucial by-election in Jubilee Hills, testing his leadership in Telangana Congress. The result could reshape political dynamics in Hyderabad and influence future local polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/are-vr-workouts-the-future-of-fitness-gym-2813076-2025-11-04",
      "headline": "Are VR workouts the future of fitness?VR fitness is fun, flashy, and futuristic, yet trainers and experts say real movement, real form, and real connection still win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-govinda-spends-lakhs-on-religious-rituals-but-wont-give-me-money-2813196-2025-11-04",
      "headline": "Sunita Ahuja: Govinda spends lakhs on religious rituals but won't give me moneySunita Ahuja opened up about her marriage with Govinda. She also shared her plans to independently support social causes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/leaving-delhi-is-not-the-answer-dr-gc-khilnani-urges-n95-masks-as-smog-chokes-delhi-air-pollution-2813200-2025-11-04",
      "headline": "Leaving Delhi isn't the answer: Top pulmonologist urges N95 masks as smog worsensTop pulmonologist Dr. GC Khilnani talks about wearing N95 or N99 masks to protect oneself from Delhi-NCR's air pollution. Leaving Delhi, however, is not a solution, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-shehzad-poonawalla-shashi-tharoor-article-dynastic-politics-praise-warning-congress-2813195-2025-11-04",
      "headline": "Khatron ke khiladi: BJP leader's praise for Shashi Tharoor, and a warningCongress MP Shashi Tharoor's hard-hitting article on dynastic politics in India has drawn praise from BJP leader Shehzad Poonawalla, saying he is a 'khatron ke khiladi'. However, he said he was praying for him as \"the first family is very vengeful\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/nithin-kamath-reacts-to-viral-post-calling-zerodha-scam-over-withdrawal-limit-2813163-2025-11-04",
      "headline": "Nithin Kamath reacts to man's viral post calling Zerodha 'scam' over withdrawal limitA man claimed Zerodha restricted access to his own funds and accused the firm of unfair practices. The allegation sparked debate online, prompting a response from co-founder Nithin Kamath."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-dethroned-wolvaardt-takes-no1-odi-ranking-batters-2813258-2025-11-04",
      "headline": "Smriti Mandhana dethroned, Laura Wolvaardt takes top spot in Women's ODI rankings Laura Wolvaardt's record World Cup run has pushed her past Smriti Mandhana to become the No.1 ODI batter. India still saw key gains, with Jemimah Rodrigues entering the top ten and Deepti Sharma rising to fourth among all-rounders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-confirms-no-handshake-restrictions-with-pakistan-2813250-2025-11-04",
      "headline": "We followed spirit of the game: Hockey India to continue handshakes with Pakistan Hockey India has clarified that it will not stop players from shaking hands with Pakistan in future matches, stating that its approach follows the Olympic Charter and FIH guidelines. HI emphasized maintaining sportsmanship and focusing on performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-big-bash-league-knee-injury-sydney-thunder-2813230-2025-11-04",
      "headline": "R Ashwin to miss Big Bash League, reveals injury during training in Chennai BBL 15: R Ashwin, who was set to become the first male cricketer from India to play in the Big Bash League, has withdrawn from the upcoming season due to a knee injury. Ashwin signed to play for the Sydney Thunder. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-interview-father-bat-2813217-2025-11-04",
      "headline": "A cut bat from her father sparked Harmanpreet Kaur's dream to play for India Women's World Cup 2025: Speaking after India's World Cup triumph, Harmanpreet Kaur reminisced about how she began dreaming of playing cricket for the country as a child. The 36-year-old said her father was the one who gave wings to her dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-singing-duet-sunil-gavaskar-promise-womens-world-cup-video-2813202-2025-11-04",
      "headline": "Watch: Jemimah Rodrigues ready to jam with Sunil Gavaskar after World Cup promise Women's World Cup: Jemimah Rodrigues is ready to make Sunil Gavaskar's fun World Cup promise come true. The Indian star called out the legend after India's historic title win, saying she's ready for their long-awaited musical jam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anvay-dravid-u19-one-day-challenger-trophy-squad-hyderabad-2025-2813174-2025-11-04",
      "headline": "Rahul Dravid's son Anvay named in U19 One-Day Challenger Trophy squad Rahul Dravid's son Anvay has been named in one of the four squads for the men's Under-19 One-Day Challenger Trophy. The tournament will be played in Hyderabad from November 5 to 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/johnathan-trott-step-down-afghanistan-head-coach-2026-world-cup-2813171-2025-11-04",
      "headline": "Jonathan Trott to step away as Afghanistan head coach after 2026 T20 World Cup Jonathan Trott will step down as Afghanistan's head coach after the 2026 T20 World Cup, ending a remarkable stint that saw historic wins and steady growth. The ACB calls it a planned transition for long-term progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-moody-appointed-global-director-of-cricket-for-lucknow-super-giants-ahead-of-ipl-2026-2813133-2025-11-04",
      "headline": "After Kane Williamson, Lucknow Super Giants add Tom Moody to management Former Australian cricketer Tom Moody takes charge as Global Director of Cricket for Lucknow Super Giants, assuming responsibility for multiple franchises. His appointment arrives weeks before the IPL 2026 auction. Earlier in October, Lucknow roped in Kane Williamson as their strategic advisor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-india-a-emerging-asia-cup-full-squad-jitesh-sharma-captain-bcci-2813094-2025-11-04",
      "headline": "Vaibhav Suryavanshi named in Jitesh Sharma-led India's Rising Asia Cup squad At just 14, Vaibhav Suryavanshi continues his meteoric rise in Indian cricket, earning a place in the Jitesh Sharma-led India A squad for the Rising Asia Cup starting November 14 in Qatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-team-of-tournament-harmanpreet-kaur-laura-wolvaardt-2813088-2025-11-04",
      "headline": "No Harmanpreet Kaur; 3 Indians in ICC Women's World Cup Team of the Tournament Women's World Cup 2025: There was no place for title-winning captain Harmanpreet Kaur even as three Indians made it to the team of the tournament. South Africa's Laura Wolvaardt was named the captain for her heroics with the bat and leadership in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-amanjot-punjab-cricket-board-cash-reward-womens-world-cup-2813060-2025-11-04",
      "headline": "Punjab cricket board announces Rs 11 lakh reward for Harmanpreet, Amanjot Women's World Cup: Punjab Cricket Association honours World Cup-winning stars from the state with cash rewards for their remarkable contribution to India's historic triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/johnathan-trott-step-down-afghanistan-head-coach-2026-world-cup-2813171-2025-11-04",
      "headline": "Jonathan Trott to step away as Afghanistan head coach after 2026 T20 World Cup Jonathan Trott will step down as Afghanistan's head coach after the 2026 T20 World Cup, ending a remarkable stint that saw historic wins and steady growth. The ACB calls it a planned transition for long-term progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-moody-appointed-global-director-of-cricket-for-lucknow-super-giants-ahead-of-ipl-2026-2813133-2025-11-04",
      "headline": "After Kane Williamson, Lucknow Super Giants add Tom Moody to management Former Australian cricketer Tom Moody takes charge as Global Director of Cricket for Lucknow Super Giants, assuming responsibility for multiple franchises. His appointment arrives weeks before the IPL 2026 auction. Earlier in October, Lucknow roped in Kane Williamson as their strategic advisor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-india-a-emerging-asia-cup-full-squad-jitesh-sharma-captain-bcci-2813094-2025-11-04",
      "headline": "Vaibhav Suryavanshi named in Jitesh Sharma-led India's Rising Asia Cup squad At just 14, Vaibhav Suryavanshi continues his meteoric rise in Indian cricket, earning a place in the Jitesh Sharma-led India A squad for the Rising Asia Cup starting November 14 in Qatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-team-of-tournament-harmanpreet-kaur-laura-wolvaardt-2813088-2025-11-04",
      "headline": "No Harmanpreet Kaur; 3 Indians in ICC Women's World Cup Team of the Tournament Women's World Cup 2025: There was no place for title-winning captain Harmanpreet Kaur even as three Indians made it to the team of the tournament. South Africa's Laura Wolvaardt was named the captain for her heroics with the bat and leadership in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-amanjot-punjab-cricket-board-cash-reward-womens-world-cup-2813060-2025-11-04",
      "headline": "Punjab cricket board announces Rs 11 lakh reward for Harmanpreet, Amanjot Women's World Cup: Punjab Cricket Association honours World Cup-winning stars from the state with cash rewards for their remarkable contribution to India's historic triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-south-africa-rebuild-fearless-new-era-final-vs-india-loss-laura-wolvaardt-2813038-2025-11-04",
      "headline": "South Africa aim fearless new era amid baptism of fire after World Cup lossSouth Africa may have lost the Women's World Cup final to India on Sunday in Navi Mumbai, but the Proteas appear destined for an era where winning titles consistently is only a matter of time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-hand-india-captaincy-smiriti-mandhana-womens-world-cup-shantha-rangaswamy-2813026-2025-11-04",
      "headline": "Harmanpreet should hand over India captaincy to Mandhana: Shantha RangaswamyA day after India's historic Women's ODI World Cup triumph, former India captain Shantha Rangaswamy has called for a bold leadership change, urging Harmanpreet Kaur to pass the baton to Smriti Mandhana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-india-honouring-legends-ashwin-men-never-did-2813001-2025-11-04",
      "headline": "Ashwin praises Harmanpreet-led India for honouring legends: Men's team never did itRavichandran Ashwin's bold words hit home after India's historic win. The off-spinner praised Harmanpreet Kaur's side for doing what, in his view, the men's team never did, sharing their glory with past legends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-cricket-world-cup-india-title-iconic-moments-harmanpreet-kaur-sophie-devine-2812901-2025-11-04",
      "headline": "Harmanpreet's catch to Devine's farewell: Iconic moments from Women's World CupWomen's World Cup: We look at some of the iconic moments that captured the hearts of fans, including Harmanpreet Kaur's title-winning catch to dismiss Nadine de Klerk against South Africa in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-father-celebration-maiden-icc-womens-world-cup-title-2812975-2025-11-04",
      "headline": "Watch: Harmanpreet Kaur's emotional celebration with father after World Cup wait endsWomen's World Cup: A video of Harmanpreet Kaur celebrating India's World Cup triumph with her father, Harmander Singh Bhullar, went viral on social media. On Sunday, India lifted the trophy with a 52-run victory over South Africa at the DY Patil Stadium in Navi Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-mithali-raj-diana-edulji-india-title-interview-2812972-2025-11-03",
      "headline": "A big night: India legends celebrate historic Women's World Cup triumphWomen's World Cup 2025: In an interview, Mithali Raj, Diana Edulji, Poonam Yadav and Sushma Verma shared their views on India's victory on Sunday against South Africa at the DY Patil Stadium in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kolkata-police-arrest-khidirpur-club-officials-match-fixing-case-2812969-2025-11-03",
      "headline": "Kolkata Premier League under scanner after match-fixing probeThe Kolkata Premier League has come under the scanner after two club officials from a team in the competition was caught over alleged match-fixing on Monday, November 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sania-mirza-india-womens-world-cup-exclusive-interview-trophy-2812951-2025-11-03",
      "headline": "Sports not for boys anymore: Sania Mirza after India win Women's World CupWomen's World Cup: Former Indian tennis star Sania Mirza heaped praise on the Indian women's team and congratulated them after their win over South Africa in the final on Sunday at the Dr DY Patil Stadium in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-father-celebration-maiden-icc-womens-world-cup-title-2812975-2025-11-04",
      "headline": "Watch: Harmanpreet Kaur's emotional celebration with father after World Cup wait endsWomen's World Cup: A video of Harmanpreet Kaur celebrating India's World Cup triumph with her father, Harmander Singh Bhullar, went viral on social media. On Sunday, India lifted the trophy with a 52-run victory over South Africa at the DY Patil Stadium in Navi Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-mithali-raj-diana-edulji-india-title-interview-2812972-2025-11-03",
      "headline": "A big night: India legends celebrate historic Women's World Cup triumphWomen's World Cup 2025: In an interview, Mithali Raj, Diana Edulji, Poonam Yadav and Sushma Verma shared their views on India's victory on Sunday against South Africa at the DY Patil Stadium in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kolkata-police-arrest-khidirpur-club-officials-match-fixing-case-2812969-2025-11-03",
      "headline": "Kolkata Premier League under scanner after match-fixing probeThe Kolkata Premier League has come under the scanner after two club officials from a team in the competition was caught over alleged match-fixing on Monday, November 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sania-mirza-india-womens-world-cup-exclusive-interview-trophy-2812951-2025-11-03",
      "headline": "Sports not for boys anymore: Sania Mirza after India win Women's World CupWomen's World Cup: Former Indian tennis star Sania Mirza heaped praise on the Indian women's team and congratulated them after their win over South Africa in the final on Sunday at the Dr DY Patil Stadium in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/indias-83-moment-womens-team-shatters-glass-ceiling-with-historic-world-cup-win-ytvd-2812944-2025-11-03",
      "headline": "India's '83 Moment: Women's Team Shatters Glass Ceiling With Historic World Cup Win!This special report unpacks the Indian women's cricket team's historic World Cup victory, featuring insights from legends Mithali Raj and Diana Edulji, captain Harmanpreet Kaur, and other stars. Esteemed journalist Sharda Ugra calls the BCCI's equal pay policy 'a bit of a smoke and mirrors according to me'. The discussion delves into whether this triumph is women's cricket's '1983 moment', the transformative impact of the Women's Premier League (WPL), and the long struggles faced by pioneers like Edulji, who travelled in unreserved train compartments. The panel celebrates the emergence of new heroes and reflects on how the team's self-belief and the BCCI's support system culminated in this groundbreaking championship win that has ignited the dreams of a billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/this-feels-personal-sania-mirza-on-indian-womens-historic-world-cup-win-ytvd-2812941-2025-11-03",
      "headline": "'This Feels Personal': Sania Mirza on Indian Women's Historic World Cup WinThis special report focuses on the Indian women's cricket team's historic World Cup victory, with tennis icon Sania Mirza sharing her perspective on the monumental achievement. In a message to the champions, Sania Mirza said, 'But as a fellow female athlete, this feels personal and thank you for doing this for us and for our country.' The four-time Olympian and Grand Slam winner discusses the personal pride she feels, drawing parallels with her own journey of breaking barriers in Indian sports. The conversation also explores how the team's success, led by captain Harmanpreet Kaur, will shift mentalities, encourage parental support for female athletes, and inspire a new generation of girls to take up sports, just as athletes like Smriti Mandhana, PV Sindhu, and Mary Kom have."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikha-pandey-defends-jemimah-rodrigues-online-trolls-wc2025-2812916-2025-11-03",
      "headline": "Jemimah's trolls slammed by veteran India pacer: She is god's favourite childIndia veteran pacer Shikha Pandey defended Jemimah Rodrigues against trolls following the Women's World Cup 2025 win. Jemimah played a big role in India's Women's World Cup win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-viral-rise-world-cup-social-media-followers-2812897-2025-11-03",
      "headline": "Women's World Cup: How team India played the social media gameAfter being trolled not so long ago, Jemimah Rodrigues now stands as the most celebrated face of the Indian team on social media, following their Women's World Cup 2025 win. Apart from Jemimah, the other members of the team gained followers after the historic win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nari-shakti-reigns-supreme-indias-women-clinch-historic-first-ever-world-cup-title-ytvd-2812895-2025-11-03",
      "headline": "Nari Shakti Reigns Supreme! India's Women Clinch Historic First-Ever World Cup TitleThis special report focuses on the Indian women's cricket team's historic, first-ever World Cup victory, led by captain Harmanpreet Kaur, after defeating South Africa in a thrilling final. Legendary cricketer Sunil Gavaskar stated, 'This is a victory for the ages — one that will rank among the greatest in Indian cricket history.' The bulletin covers the team's incredible journey, overcoming past heartbreaks and a challenging path to the finals, including a key semi-final win against Australia. The historic achievement has been met with nationwide celebration and significant financial rewards, including a ₹51 crore prize from the BCCI and gifts from industrialists, marking a pivotal moment for women's cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/harmanpreets-smile-enjoy-mantra-that-led-india-to-world-cup-glory-ytvd-2812879-2025-11-03",
      "headline": "Harmanpreet's 'Smile & Enjoy' Mantra That Led India to World Cup GloryThis special report focuses on the Indian women's cricket team's historic World Cup victory, with insights from captain Harmanpreet Kaur and spinner Radha Yadav. Radha Yadav revealed the captain's simple yet powerful message ahead of the final: 'She just said smile, enjoy. Itna hard work kiya hai. Bas ek final push aur bindas ho ke khelo (You have worked so hard. Just one final push and play freely)'. The conversation highlights the team's calm and composed mindset, which was forged through previous setbacks. Yadav explains that having failed in three matches before, the team had gained the crucial experience of how to stage a comeback, which they executed perfectly to lift the coveted trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/jemimah-rodrigues-parents-ms-dhoni-attitude-world-cup-2025-2812874-2025-11-03",
      "headline": "MS Dhoni attitude: How Jemimah Rodrigues became a Women's World Cup winnerJemimah Rodrigues' parents revealed how keeping an MS Dhoni attitude helped the 25-year-old progress in cricket and become a World Cup winner. Jemimah played a crucial role in India's Women's World Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/jemimahs-tears-to-triumph-from-anxiety-being-dropped-to-world-cup-glory-ytvd-2812871-2025-11-03",
      "headline": "Jemimah's Tears To Triumph: From Anxiety & Being Dropped To World Cup GloryThis special report focuses on Indian cricketer Jemimah Rodrigues and the women's team's historic World Cup victory. Rodrigues reflects on her personal struggles, including being dropped from the team and battling anxiety, which she revealed made her 'cry every single day' during the tournament. The report highlights her crucial, match-winning knock in the semi-final against Australia, which she felt was 'all scripted by someone above'. It delves into her emotional post-match comments about the team's resilience, where she emphasised that they looked out for each other through ups and downs, proving they are a 'real champion team'."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}