{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pearl-kapur-self-proclaimed-india-youngest-billionaire-zyber-365-unicorn-fact-fiction-2611734-2024-10-05",
      "headline": "Curious case of Pearl Kapur: The self-proclaimed billionaire behind Zyber 365On his Instagram profile, Pearl Kapur brands himself as \"India's youngest billionaire,\" a title he embraces while carefully sidestepping questions about the legitimacy of his company's meteoric rise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-overtakes-jeff-bezos-as-worlds-second-richest-person-2610993-2024-10-04",
      "headline": "Mark Zuckerberg overtakes Jeff Bezos as world's second-richest person The dramatic rise in Mark Zuckerberg's fortune has been fuelled by a 23% increase in Meta's stock price since its better-than-expected Q2 results.\r\n\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-jammu-and-kashmir-assembly-election-2024-india-today-cvoter-exit-polls-result-congress-bjp-2611927-2024-10-05",
      "headline": "Congress to reclaim Haryana, INDIA edge in J&K tight fight: India Today exit pollThe India Today-CVoter exit poll predicts a strong showing by the Congress in Haryana, while Jammu and Kashmir may see the Congress-National Conference combine holding the edge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-2024-india-today-exit-poll-congress-strong-win-what-it-means-explained-five-points-2611750-2024-10-05",
      "headline": "What Haryana victory will mean for Congress. Explained in 5 pointsThe India Today-CVoter exit poll predicts a comfortable win for the Congress in Haryana in the Assembly polls with 50–58 seats in the 90-member House. What does a Congress victory in Haryana mean for the party, and the INDIA bloc? Explained in five simple points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-war-iran-hashem-safieddine-alive-dead-nasrallah-lebanon-2611870-2024-10-05",
      "headline": "Hassan Nasrallah's heir 'unreachable' after Israeli strikes in Lebanon: ReportUncertainty looms over Hezbollah as Hashem Safieddine, the successor to Hassan Nasrallah, remains reportedly unreachable after an Israeli airstrike targeted Beirut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-bjp-congress-worker-molested-video-party-campaign-event-2611834-2024-10-05",
      "headline": "Anti-women party: BJP shares video of Haryana Congress worker 'molested' at eventThe BJP called Congress the most 'anti-women party' even as Congress MP Kumari Selja condemned the incident and demanded strict action against the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/watch-india-todays-ground-reports-from-conflict-zones-in-israel-iran-lebanon-2611993-2024-10-05",
      "headline": "Watch India Today's ground reports from conflict zones in Israel, Iran, LebanonAs the tensions in the Middle East is rising by the day, the Israeli army on Saturday expanded its airstrikes to northern Lebanon as bombings continued in Beirut and southern cities. The Israeli army continued its offensive targeting Hezbollah. Strikes hit the northern city of Tripoli early on Saturday, where a top Hamas leader and his family were killed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/sanjauli-mosque-row-shimila-court-orders-demolition-waqf-board-2611922-2024-10-05",
      "headline": "Shimla court orders demolition of 3 floors of Sanjauli mosqueThe court granted the Sanjauli Mosque Committee two months to carry out the demolition at their own expense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/haryana-jammu-and-kashmir-assembly-elections-poll-of-exit-polls-2611947-2024-10-05",
      "headline": "Congress return in Haryana, hung Assembly in J&K: Poll of exit pollsAn aggregate of three exit polls indicate that the Congress will win 54 of Haryana's 90 seats - comfortably ahead of the halfway mark of 45. Jammu and Kashmir, which voted after 10 years, may see a hung Assembly again."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-girl-murder-case-police-sources-accused-arrested-confession-2611902-2024-10-05",
      "headline": "Bengal girl's killer gave her ice cream, offered her lift on cycle: SourcesThe accused had been trying to befriend the 11-year-old girl in the days leading up to the crime, as per sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zomato-ceo-deepinder-goyal-wife-grecia-munoz-delivery-agents-netizen-reactions-2611944-2024-10-05",
      "headline": "Zomato CEO Deepinder Goyal, wife turn delivery agents for a day, internet reactsTrading in his suit for a Zomato delivery agent's uniform, Deepinder Goyal hit the streets with his wife Grecia Munoz and delivered food orders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-prasad-insects-devotees-ttd-tirumala-tirupati-devasthanams-animal-fat-row-2611974-2024-10-05",
      "headline": "Devotees claim insects found in Tirupati prasad, temple authorities denyDevotees have alleged that they found insects in Tirupati prasad served to them at the Tirumala temple in Andhra Pradesh. The temple authorities have rejected such claims, calling them baseless."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-aap-bjp-bus-marshals-protest-saurabh-bharadwaj-vijender-gupta-atishi-2611896-2024-10-05",
      "headline": "High drama during bus marshals' protest, AAP MLA falls at BJP leader's feetThe AAP shared videos showing party leader Saurabh Bharadwaj falling on the feet of BJP leader Vijender Gupta, urging him to accompany AAP workers to the Lt Governor's office to submit a Cabinet note on the reinstatement of bus marshals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-elections-bhupinder-singh-hooda-congress-nayab-singh-saini-bjp-chief-minister-exit-poll-2611941-2024-10-05",
      "headline": "Bhupinder Hooda most preferred for Haryana chief minister post: Exit pollFormer Haryana Chief Minister and senior Congress leader Bhupinder Singh Hooda is the most preferred candidate to lead the state once again, with 30.8 per cent opting for him, as per the India Today-CVoter exit poll."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/haifa-northern-israel-hezbollah-strikes-lebanon-border-middle-east-tensions-ground-report-2611882-2024-10-05",
      "headline": "Ground report: Israel's Haifa turns into ghost town amid Hezbollah strikesIndia Today's Gaurav Sawant reached Haifa, a once bustling city in northern Israel that now wears a deserted look as Hezbollah continues to strike Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-pakistan-visit-external-affairs-ministe-sco-summit-islamabad-2611784-2024-10-05",
      "headline": "Civil person, will behave myself: S Jaishankar's quip on Pak visit for SCO meetExternal Affairs Minister S Jaishankar announced that his upcoming visit to Pakistan for the Shanghai Cooperation Organisation (SCO) summit later this month will focus on the multilateral event rather than India-Pakistan relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-exit-poll-result-2024-congress-national-conference-bjp-2611920-2024-10-05",
      "headline": "Advantage INDIA in close J&K contest: India Today-CVoter exit pollJammu and Kashmir Exit Poll Result 2024: Mehbooba Mufti's PDP and independents fielded by Engineer Rashid are likely to play the role of a kingmaker, with exit polls predicting a hung Assembly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-palestine-red-hands-empty-strollers-keffiyeh-keys-blood-stained-trousers-symbolism-amid-war-iran-gaza-2611701-2024-10-05",
      "headline": "Horror of red hands, wails of empty strollers: Symbolism amid Middle East warThe death and devastation in the war in the Middle East have given rise to symbols, and new meanings to old ones. Be it empty strollers, red-painted hands, Palestinian keys or blood-stained trousers. Here's a look at them on the eve of the first anniversary of the October 7 attack and the Israel-Iran war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/samantha-praises-ananya-panday-vikramaditya-motwane-ctrl-gripping-from-start-to-finish-2611905-2024-10-05",
      "headline": "Samantha praises Ananya Panday's CTRL: Gripping from start to finishTelugu actor Samantha praised Ananya Panday's performance in the film CTRL, calling it gripping and a must-watch. The film, directed by Vikramaditya Motwane, features Vihaan Samaat and premiered on Netflix on October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-sports-business-424-04-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-comeback-haryana-denies-bjp-hat-trick-predicts-india-today-cvoter-exit-poll-2611926-2024-10-05",
      "headline": "Congress comeback in Haryana, denies BJP hat-trick: India Today-CVoter exit pollThe Congress is likely to make a comeback in Haryana, denying the BJP a hat-trick and is projected to win 50-58 seats, as per the India Today-CVoter exit poll. The BJP is likely to get 20-28 seats, the survey shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reveals-rishabh-pant-smart-tactic-in-t20-world-cup-final-2611977-2024-10-05",
      "headline": "Rohit reveals Pant's smart tactic in T20 World Cup final triumphT20 World Cup 2024: Rohit Sharma has revealed Rishabh Pant had used a clever tactic during the final against South Africa to slow down the game and break the momentum of the batting side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-wearing-open-footwear-good-indian-climate-2611712-2024-10-05",
      "headline": "Is wearing open footwear good in an Indian climate?Open footwear can help prevent excessive perspiration and reduce the risk of sweat-induced infections, but wearing them constantly may expose your feet to dirt, pollution, and harmful sun rays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/spider-man-director-sam-raimi-in-talks-to-direct-doctor-strange-3-2611805-2024-10-05",
      "headline": "Spider-Man director Sam Raimi in talks to direct Doctor Strange 3Director Sam Raimi is reportedly in discussions to return for Doctor Strange 3, aiming for a 2027 release. Benedict Cumberbatch will reprise his role, with the film set between Avengers: Doomsday and Avengers: Secret Wars."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-debt-burden-family-suicide-son-online-gambling-games-police-case-2611985-2024-10-05",
      "headline": "3 of family die by suicide after son incurs Rs 30 lakh debt in online gamblingThree members of a family ended their lives in Telangana's Nizamabad district after the couple were unable to clear a debt of Rs 30 lakh incurred due to their son's habit of online gambling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-opposes-5-nominated-members-jammu-kashmir-assembly-government-formation-bjp-election-results-2611731-2024-10-05",
      "headline": "J&K gets five MLAs even before the first vote is counted; Opposition furiousFor the first time in J&K, five nominated members will play a significant role in government formation. The Congress has strongly opposed the move to nominate members and accused the BJP of attempting to manipulate election results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/samantha-praises-ananya-panday-vikramaditya-motwane-ctrl-gripping-from-start-to-finish-2611905-2024-10-05",
      "headline": "Samantha praises Ananya Panday's CTRL: Gripping from start to finishTelugu actor Samantha praised Ananya Panday's performance in the film CTRL, calling it gripping and a must-watch. The film, directed by Vikramaditya Motwane, features Vihaan Samaat and premiered on Netflix on October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/aamir-khan-to-imran-khan-celebs-at-reena-duttas-fathers-prayer-meet-2611925-2024-10-05",
      "headline": "Aamir Khan to Imran Khan, celebs at Reena Dutta's father's prayer meetBollywood stars gathered to pay their respects at Reena Dutta's father's prayer meet, with Aamir Khan, Imran Khan, Kiran Rao, Junaid Khan, and Ira Khan in attendance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-rumours-rajinikanth-health-affected-coolie-shoot-2611914-2024-10-05",
      "headline": "Lokesh Kanagaraj on rumours of Rajinikanth's health affected by Coolie shootFilmmaker Lokesh Kanagaraj addressed rumours about Rajinikanth's health being affected by the filming of Coolie. He clarified that the actor had informed him about his upcoming treatment a month earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-angelina-jolie-to-auction-her-vintage-1958-ferrari-250-gt-2611856-2024-10-05",
      "headline": "Actor Angelina Jolie to auction her vintage 1958 Ferrari 250 GTAngelina Jolie's rare 1958 Ferrari 250 GT, a black coupe with Pininfarina coachwork, will be auctioned in Paris. The car is expected to fetch between €600,000 and €800,000."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-suryakumar-yadav-gwalior-pitch-t20-cricket-2611990-2024-10-05",
      "headline": "Suryakumar Yadav deems Gwalior pitch ideal for T20 cricketIND vs BAN, 1st T20I: Suryakumar Yadav said that the pitch in Gwalior is ideal for T20 cricket. Suryakumar will lead India when the Men in Blue step out for their series opener against Bangladesh on Sunday, October 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-super-league-mohun-bagan-beat-mohammedan-sporting-2611989-2024-10-05",
      "headline": "Mohun Bagan thrash Mohammedan Sporting riding on 3 first-half goalsMohun Bagan crushed city rivals Mohammed Sporting riding on three first-half strikes from Jamie Maclaren, Subhasish Bose and Greg Stewart in the less fancied 'Kolkata Derby' here on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-t20i-predicted-starting-eleven-mayank-yadav-nitish-kumar-reddy-debut-2611980-2024-10-05",
      "headline": "IND vs BAN, 1st T20I Predicted XI: Mayank Yadav, Nitish Reddy to debut?India's youth-heavy T20 squad, led by Suryakumar Yadav, aims to maintain their momentum against Bangladesh, with potential debuts for IPL sensation Mayank Yadav and rising star Nitish Kumar Reddy in the highly anticipated series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reveals-rishabh-pant-smart-tactic-in-t20-world-cup-final-2611977-2024-10-05",
      "headline": "Rohit reveals Pant's smart tactic in T20 World Cup final triumphT20 World Cup 2024: Rohit Sharma has revealed Rishabh Pant had used a clever tactic during the final against South Africa to slow down the game and break the momentum of the batting side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-bangladesh-danni-wyatt-hodge-nigar-sultana-sharjah-2611962-2024-10-05",
      "headline": "Danni Wyatt-Hodge stars as England edge past spirited Bangladesh Women's T20 World Cup 2024: Heather Knight's England beat Bangladesh by 21 runs on Saturday and got off to a brilliant start in their campaign in the United Arab Emirates (UAE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-vs-southampton-manchester-city-beat-fulham-liverpool-win-2611958-2024-10-05",
      "headline": "Arsenal secure 3-2 win vs Southampton, Manchester City beat FulhamArsenal came from behind to beat Southampton 3-1 at the Emirates. Manchester City edged Fulham 3-2, thanks to Mateo Kovacic's brace, keeping them a point behind Premier League leaders Liverpool, who secured a narrow 1-0 win over Crystal Palace through Diogo Jota's early goal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/bangladesh-shakib-al-hasan-india-towhid-hridoy-press-conference-2611945-2024-10-05",
      "headline": "Bangladesh will miss Shakib, but are hopeful of beating India: Towhid Hridoy IND vs BAN, 1st T20I: Towhid Hridoy said that Bangladesh will miss the services of Shakib Al Hasan, who has already retired from T20Is. But Hridoy showed faith in the Tigers to beat India in the latter's backyard. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-security-stepped-up-ahead-of-1st-t20i-in-gwalior-2611946-2024-10-05",
      "headline": "Security stepped up ahead of 1st T20I in GwaliorAuthorities have imposed strict security measures in Gwalior as India prepares to face Bangladesh in a T20I match. Protests by right-wing groups continue, raising tensions in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/harmanpreet-kaur-india-fatima-sana-pakistan-2611943-2024-10-05",
      "headline": "IND vs PAK preview: Bruised India face tough testWomen's T20 World Cup 2024: India have found themselves in a precarious position after losing to New Zealand by 58 runs on Friday. Harmanpreet Kaur and Co. need to beat Pakistan and also improve their net run rate to stay alive for a berth in the semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-premier-league-rcb-retention-prediction-virat-kohli-cameron-green-aakash-chopra-2611940-2024-10-05",
      "headline": "Kohli first pick, Siraj RTM: Chopra predicts RCB retention listAakash Chopra predicts Virat Kohli, Cameron Green, and Rajat Patidar to be retained by RCB for IPL 2024, with Mohammed Siraj and Will Jacks as potential RTM picks, signaling a fresh approach for the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-mayank-yadav-x-factor-suryakumar-yadav-pace-bowling-2611936-2024-10-05",
      "headline": "Will Mayank make his India debut? Suryakumar says pacer has X-factorIndia captain Suryakumar Yadav hints at Mayank Yadav's potential X-factor role ahead of the Bangladesh T20I series, fueling speculation over the pacer's debut after his remarkable IPL performances with Lucknow Super Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/bangladesh-shakib-al-hasan-india-towhid-hridoy-press-conference-2611945-2024-10-05",
      "headline": "Bangladesh will miss Shakib, but are hopeful of beating India: Towhid Hridoy IND vs BAN, 1st T20I: Towhid Hridoy said that Bangladesh will miss the services of Shakib Al Hasan, who has already retired from T20Is. But Hridoy showed faith in the Tigers to beat India in the latter's backyard. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-security-stepped-up-ahead-of-1st-t20i-in-gwalior-2611946-2024-10-05",
      "headline": "Security stepped up ahead of 1st T20I in GwaliorAuthorities have imposed strict security measures in Gwalior as India prepares to face Bangladesh in a T20I match. Protests by right-wing groups continue, raising tensions in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/harmanpreet-kaur-india-fatima-sana-pakistan-2611943-2024-10-05",
      "headline": "IND vs PAK preview: Bruised India face tough testWomen's T20 World Cup 2024: India have found themselves in a precarious position after losing to New Zealand by 58 runs on Friday. Harmanpreet Kaur and Co. need to beat Pakistan and also improve their net run rate to stay alive for a berth in the semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-premier-league-rcb-retention-prediction-virat-kohli-cameron-green-aakash-chopra-2611940-2024-10-05",
      "headline": "Kohli first pick, Siraj RTM: Chopra predicts RCB retention listAakash Chopra predicts Virat Kohli, Cameron Green, and Rajat Patidar to be retained by RCB for IPL 2024, with Mohammed Siraj and Will Jacks as potential RTM picks, signaling a fresh approach for the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-mayank-yadav-x-factor-suryakumar-yadav-pace-bowling-2611936-2024-10-05",
      "headline": "Will Mayank make his India debut? Suryakumar says pacer has X-factorIndia captain Suryakumar Yadav hints at Mayank Yadav's potential X-factor role ahead of the Bangladesh T20I series, fueling speculation over the pacer's debut after his remarkable IPL performances with Lucknow Super Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shivam-dube-ruled-out-of-t20i-series-tilak-varma-named-replacement-2611935-2024-10-05",
      "headline": "Shivam Dube ruled out of T20I series, Tilak Varma named replacementIndia vs Bangladesh: All-rounder Shivam Dube was ruled out of the three-match T20I series due to a back injury. The Senior Selection Committee named Tilak Varma as Shivam's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-suryakumar-yadav-captaincy-press-conference-2611934-2024-10-05",
      "headline": "Suryakumar to captain in IPL 2025? India skipper deals with Gwalior 'googly'IND vs BAN: Suryakumar Yadav opened on the chances of leading a team in the Indian Premier League (IPL). The 34-year-old spoke about captaincy before the opening T20I against Bangladesh in Gwalior. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-harmanpreet-kaur-fatima-sana-where-to-watch-2611930-2024-10-05",
      "headline": "IND vs PAK Live Streaming: When and where to watch Women's T20 World Cup clashWomen's T20 World Cup 2024: India and Pakistan will lock horns in the group match of the mega event on Sunday at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-confirms-sanju-samson-role-for-bangladesh-t20is-2611928-2024-10-05",
      "headline": "Suryakumar Yadav confirms Sanju Samson's new role for Bangladesh T20IsIndia vs Bangladesh: T20I captain Suryakumar Yadav confirmed India's openers for the three-match T20I series against Bangladesh and explained the new role of Sanju Samson.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-2024-sinner-alcaraz-and-djokovic-advance-to-third-round-2611924-2024-10-05",
      "headline": "Sinner, Alcaraz and Djokovic advance to third roundShanghai Masters 2024: Top seeds Jannik Sinner, Carlos Alcaraz, and Novak Djokovic won their respective matches to advance to the third round.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-captain-fatima-sana-india-all-rounder-2611921-2024-10-05",
      "headline": "I always wanted to be the No.1 all-rounder: Pakistan's Fatima Sana Women's T20 World Cup 2024: Pakistan captain Fatima Sana said that she wishes to be a quality all-rounder. Earlier, Fatima won the player of the match award against Sri Lanka and will look to carry the momentum against India as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-pakistan-india-skipper-calm-pressure-2611918-2024-10-05",
      "headline": "Stay calm, no such pressure: Fatima Sana's mantra for India clashWomen's T20 World Cup 2024: Pakistan skipper Fatima Sana said that Pakistan will look to stay calm when they lock horns with Harmanpreet Kaur's India on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-team-to-be-felicitated-after-first-irani-cup-win-in-27-years-2611911-2024-10-05",
      "headline": "Mumbai team to be felicitated after first Irani Cup win in 27 yearsThe Mumbai Cricket Association will felicitate the Ajinkya Rahane-led side in a ceremony after it clinched its first Irani Cup in 27 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-2024-sinner-alcaraz-and-djokovic-advance-to-third-round-2611924-2024-10-05",
      "headline": "Sinner, Alcaraz and Djokovic advance to third roundShanghai Masters 2024: Top seeds Jannik Sinner, Carlos Alcaraz, and Novak Djokovic won their respective matches to advance to the third round.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-captain-fatima-sana-india-all-rounder-2611921-2024-10-05",
      "headline": "I always wanted to be the No.1 all-rounder: Pakistan's Fatima Sana Women's T20 World Cup 2024: Pakistan captain Fatima Sana said that she wishes to be a quality all-rounder. Earlier, Fatima won the player of the match award against Sri Lanka and will look to carry the momentum against India as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-pakistan-india-skipper-calm-pressure-2611918-2024-10-05",
      "headline": "Stay calm, no such pressure: Fatima Sana's mantra for India clashWomen's T20 World Cup 2024: Pakistan skipper Fatima Sana said that Pakistan will look to stay calm when they lock horns with Harmanpreet Kaur's India on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-team-to-be-felicitated-after-first-irani-cup-win-in-27-years-2611911-2024-10-05",
      "headline": "Mumbai team to be felicitated after first Irani Cup win in 27 yearsThe Mumbai Cricket Association will felicitate the Ajinkya Rahane-led side in a ceremony after it clinched its first Irani Cup in 27 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-pakistan-head-to-head-last-match-played-harmanpreet-kaur-2611906-2024-10-05",
      "headline": "Women's T20 World Cup, IND vs PAK: Head-to-Head and past recordsIndia's women's team seeks redemption against Pakistan after a crushing 58-run loss to New Zealand in their T20 World Cup opener. Harmanpreet Kaur's side aims to bounce back in this high-pressure rivalry clash on October 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/aavishkar-salvi-backs-india-to-bounce-back-against-pakistan-2611903-2024-10-05",
      "headline": "Aavishkar Salvi backs India to bounce back against PakistanWomen's T20 World Cup 2024: Aavishkar Salvi said that India have the potential to stage a strong comeback against Pakistan after losing to New Zealand on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-aavishkar-salvi-press-conference-new-zealand-loss-2611897-2024-10-05",
      "headline": "Stay calm and united: How India plan to bounce back after World Cup opener lossWomen's T20 World Cup 2024: India's assistant coach Aavishkar Salvi said he is confident that the team will be calm and composed when they face arch-rivals Pakistan in Dubai on Sunday, October 6. India lost to New Zealand in their opening match on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-to-downsize-list-of-centrally-contracted-cricketers-2611895-2024-10-05",
      "headline": "Pakistan board to downsize list of centrally contracted cricketersThe Pakistan Cricket Board plans to reduce the number of centrally contracted players for the 2024/25 season. This move follows recommendations from foreign coaches and aims to reward players committed to top fitness levels."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}