{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongUS Trading Firm Jane Street: Securities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-rs-36-lakh-in-5-years-know-who-can-avail-this-government-scheme-national-savings-certificate-nsc-2750564-2025-07-04",
      "headline": "Want Rs 36 lakh in 5 years? Know who can avail this government schemeThis government scheme offers guaranteed returns, so you don't have to worry about market ups and downs. For the current quarter, the interest rate is fixed at 7.7% per year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/soham-parekh-us-startups-multiple-jobs-moonlighting-why-reasons-latest-update-2750540-2025-07-04",
      "headline": "Why did Soham Parekh work multiple jobs? Indian techie shares his reasonsHe confirmed that he worked at several companies simultaneously and misrepresented his location and employment status in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-gathering-dust-in-locker-financial-advisor-explains-how-to-make-it-work-2750539-2025-07-04",
      "headline": "Gold gathering dust in locker? Financial advisor explains how to make it workA financial advisor has warned that family gold stored in lockers faces risk from rust, floods, and poor insurance. He explains how a scheme can offer safety and steady returns instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epf-nps-can-build-rs-12-crore-retirement-fund-tax-expert-breaks-it-down-2750519-2025-07-04",
      "headline": "EPF, NPS can build Rs 12 crore retirement fund. Tax expert breaks it downFor salaried individuals earning up to Rs 14.65 lakh annually, Bangar believes this combination offers the best of both worlds: zero tax under the new regime and long-term wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-82-points-higher-nifty-below-25500-bajaj-finance-up-2-percent-2750516-2025-07-04",
      "headline": "Sensex opens 82 points higher, Nifty below 25,500; Bajaj Finance up 2%The S&P BSE Sensex was up 46.97 points to 83,286.44, while the NSE Nifty50 added 14.45 points to 25,419.75 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-openai-collaboration-ai-enterprise-chatgpt-business-sam-altman-vijay-guntur-2750514-2025-07-04",
      "headline": "HCLTech joins hands with OpenAI to take AI to businessesThe collaboration aims to help global companies adopt AI at scale, combining HCLTech's industry experience with OpenAI's advanced AI models and tools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-banned-sebi-from-stock-market-rs-4843-crore-seized-unlawful-gains-equity-derivatives-trading-2750504-2025-07-04",
      "headline": "Global trading firm Jane Street banned by Sebi from securities marketAccording to an order published on Sebi's website, the regulator has ordered the seizure of Rs 48.4 billion (approximately $570 million), which it claims is the total amount of illegal profit made by Jane Street. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dearness-allowance-da-hike-4-percent-pay-commission-7th-8th-cpi-data-central-government-employees-2750493-2025-07-04",
      "headline": "DA hike July 2025: 4% increase likely for central government employeesDearness Allowance is revised twice a year, in January and July. It is based on the average of All India Consumer Price Index for Industrial Workers (AICPI-IW) data over the past 12 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-world-most-valued-company-ai-boom-chipmaking-apple-microsoft-2750330-2025-07-03",
      "headline": "Nvidia to become world's most valued company ever with $3.9 trillion market capNvidia is set to become the most valuable company ever, reaching a $3.92 trillion market cap amid soaring AI demand. Its dominance in AI chipmaking has fuelled rapid growth, outpacing rivals like Apple and Microsoft.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-appoints-former-niti-aayog-ceo-amitabh-kant-as-non-executive-director-2750310-2025-07-03",
      "headline": "IndiGo appoints former NITI Aayog CEO Amitabh Kant as non-executive directorIndiGo has appointed former NITI Aayog CEO Amitabh Kant as a Non-Executive Director on its board, pending regulatory and shareholder approvals. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bars-foreclosure-charges-on-floating-rate-loans-to-micro-small-businesses-2750292-2025-07-03",
      "headline": "RBI bars foreclosure charges on floating rate loans to micro, small businessesAccording to the new rules, no prepayment charges will be allowed on floating rate loans to MSEs or to individuals borrowing for business purposes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-poverty-income-inequality-ppp-mmrp-who-is-poor-world-bank-niti-aayog-2750057-2025-07-03",
      "headline": "How poor is 'poor' in India?Millions of Indians have exited extreme poverty, yet many still live one crisis away from hunger, debt, or despair. In this deep dive, we examine why poverty is retreating in numbers, but not in reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-files-confidential-papers-for-ipo-to-raise-rs-4250-crore-report-2750174-2025-07-03",
      "headline": "Meesho files confidential papers for IPO to raise Rs 4,250 crore: ReportMeesho is a well-known player in India's booming e-commerce space, taking on giants like Amazon and Flipkart, with big global investors such as Prosus, Elevation Capital, WestBridge Capital, SoftBank, and Peak XV Partners backing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-settles-170-points-lower-nifty-below-25500-maruti-down-1-percent-2750131-2025-07-03",
      "headline": "Sensex settles 170 points lower, Nifty below 25,500; Maruti down 1%The S&P BSE Sensex was down by 170.22 points to end at 83,239.47, while the NSE Nifty50 fell by 48,10 points to close at 25,405.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/investing-mutual-fund-sip-regular-checks-money-management-portfolio-review-2750107-2025-07-03",
      "headline": "Don't set and forget: Why your SIPs need regular check-upsWhile the idea of 'set it and forget it' may seem peaceful, doing so could lead to long-term underperformance, missed opportunities, or even a shortfall in your retirement goals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-and-ceo-nithin-kamath-cautions-investors-against-risks-in-unlisted-shares-2750088-2025-07-03",
      "headline": "Zerodha's Nithin Kamath cautions investors against risks in unlisted sharesNithin Kamath said that many people get carried away by the hype around buying shares of companies before they go public. But in reality, unlisted shares are risky and can leave investors stuck without a way to sell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crude-oil-wti-brent-forecast-middle-east-tension-iran-israel-conflict-sp-global-2750084-2025-07-03",
      "headline": "Has the oil market grown numb to conflict in the Middle East?Global oil demand growth in 2025 is on track to be just 870,000 barrels per day. This would make it the weakest year for oil demand since 2001, except during major economic disruptions like the 2008 financial crisis and the COVID-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-income-inequality-now-worse-than-british-era-says-financial-analyst-2750041-2025-07-03",
      "headline": "India's income inequality now worse than British era, says financial analystThe divide between India's rich and poor is bigger than ever, with almost half the people surviving on very little, while a privileged few hold most of the wealth, says Hardik Joshi, a financial analyst."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-ceo-sashidhar-jagdishan-moves-supreme-court-against-lilavati-hospital-fir-2749997-2025-07-03",
      "headline": "HDFC Bank CEO moves Supreme Court against Lilavati Hospital FIRThe clash between one of India's largest private banks and a big Mumbai hospital is linked to a financial transaction, but the exact details of the FIR or the amount involved were not shared in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-itr-login-here-is-how-to-file-income-tax-using-net-banking-2749970-2025-07-03",
      "headline": "Lost your ITR login? Here's how to file income tax using net bankingIf you can't remember your Income Tax portal password, you don't need to reset it straight away. Most major banks in India allow you to access the e-Filing portal through their net banking services. It's a safe and easy way to file your return on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nestle-axis-bank-dividend-stock-ex-date-share-price-stock-market-july-3-2749960-2025-07-03",
      "headline": "Axis Bank, Nestle India set dividend record dates; last day to buy shares todayNestle India and Axis Bank have fixed July 4 as the record date, which will decide who is eligible to receive the dividend payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "The quiet Chinese game to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, Indian techie who worked at 4-5 US startups at same time?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-157-points-higher-nifty-above-25500-eternal-up-2-percent-2749901-2025-07-03",
      "headline": "Sensex, Nifty struggle for direction as markets await India-US deal newsThe S&P BSE Sensex was down by 13.01 points to 83,396.68, while the NSE Nifty50 lost 3.70 points to 25,449.70 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-setup-bse-nse-us-vietnam-trade-deal-china-2749878-2025-07-03",
      "headline": "Will Sensex, Nifty open higher amid US–Vietnam trade deal impact?Gift Nifty futures were trading at 25,584 points at 8:18 am, suggesting an increase from the previous close of 25,574.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-3-nse-bse-trading-nykaa-rvnl-nestle-yes-bank-dmart-pnb-2749874-2025-07-03",
      "headline": "Stocks to watch on July 3: Nykaa, RVNL, Nestle, Yes Bank, Dmart, PNBInvestors are now watching company announcements for the April–June quarter results, while developments related to a possible trade deal between India and the United States are also being closely followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-288-points-lower-nifty-settles-below-25-500-tata-steel-down-4-percent-2749530-2025-07-02",
      "headline": "Sensex ends 288 points lower, Nifty settles below 25, 500; Tata Steel down 4%The S&P BSE Sensex was down 287.60 points to end at 83,409.69, while the NSE Nifty50 lost 88.40 points to end at 25,453.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-julian-mcmahon-dies-at-56-after-long-battle-with-cancer-glbs-2751075-2025-07-05",
      "headline": "Actor Julian McMahon dies at 56 after long battle with cancerJulian McMahon, known for Nip/Tuck, Charmed, and Fantastic Four, has died at 56 after battling cancer. The actor was celebrated for his versatility, charisma, and beloved roles in TV and film.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-becomes-most-followed-on-spotify-beats-taylor-swift-and-ed-sheeran-2750928-2025-07-04",
      "headline": "Arijit Singh becomes most followed on Spotify, beats Taylor Swift and Ed SheeranArijit Singh has become the most followed artist on Spotify with 151 million followers, surpassing global stars like Taylor Swift and Ed Sheeran. Despite having fewer monthly listeners, his follower count reflects a strong and dedicated global fan base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-reddy-vanga-spirit-begin-in-september-prabhas-to-join-later-2750925-2025-07-04",
      "headline": "Spirit: Sandeep Reddy Vanga to begin shooting in September, Prabhas to join laterFilming of 'Spirit' begins in September 2025, with Prabhas to join the set in November. The actor will star alongside Triptii Dimri in the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-on-secret-wedding-with-mehzabeen-coatwala-2750921-2025-07-04",
      "headline": "Munawar Faruqui on secret wedding with Mehzabeen Coatwala: It was for my sonMunawar Faruqui shared that his decision to marry Mehzabeen Coatwala was driven by his desire to live with his son, Mikael. The wedding, kept private, happened just a month after the decision and within five months of knowing Mehzabeen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-x-review-fans-impressed-sara-ali-khan-performance-irrfan-khan-anurag-basu-2750878-2025-07-04",
      "headline": "Metro In Dino X review: Fans impressed with Sara's performance, miss Irrfan'Metro In Dino', which released in theatres today (July 4) has got social media buzzing with reviews. As per X users, actor Sara Ali Khan has delivered an impressive performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-reaction-fans-celebrate-salman-khan-in-uniform-welcome-bhaijaans-comeback-2750907-2025-07-04",
      "headline": "Battle of Galwan reaction: Fans celebrate Salman Khan in uniform, welcome Bhaijaan's comebackFans celebrated Salman Khan's comeback on Friday as the Bollywood superstar shared the first motion poster of his upcoming film 'Battle Of Galwan.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-motion-poster-salman-khan-looks-fierce-first-look-uniform-2750896-2025-07-04",
      "headline": "Battle of Galwan first look: Salman Khan is intense, fierce in uniformSalman Khan shared the motion poster of his upcoming film 'Battle of Galwan'. The story is based on one of India's most brutal battles fought without a single bullet being fired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/girls-day-bang-minah-to-marry-on-ju-wan-kdrama-actor-2750848-2025-07-04",
      "headline": "Girl's Day's Bang Minah, actor On Ju-wan set to get marriedK-pop band Girl's Day member Bang Minah and South Korean actor On Ju-wan's agencies have announced their plans to get married. The two worked together in a popular Kdrama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-to-begin-shooting-for-cocktail-2-in-august-2750841-2025-07-04",
      "headline": "Exclusive: Kriti Sanon to begin shooting for Cocktail 2 in AugustKriti Sanon has wrapped up shooting for 'Tere Ishk Mein' and is set to begin filming 'Cocktail 2' in August. After an intense schedule, the actor is currently taking a short break before diving into her next project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amal-clooney-praises-supportive-husband-george-clooney-amid-split-rumours-2750830-2025-07-04",
      "headline": "Amal Clooney praises supportive husband George Clooney amid split rumoursAmal Clooney opened up about her family life with husband George Clooney, highlighting their strong bond and mutual support amid rumours of a rift. She shared that they continue to prioritise privacy for their children. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/who-is-nikita-luther-winner-of-the-traitors-alongside-uorfi-javed-2750713-2025-07-04",
      "headline": "Who is Nikita Luther, winner of The Traitors alongside Uorfi Javed?Poker player Nikita Luther is now the winner of the reality TV show 'The Traitors'. She won the show alongside social media influencer Uorfi Javed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/ed-questions-telugu-producer-allu-aravind-for-3-hours-in-rs-101-crore-ramakrishna-electronics-bank-fraud-2750823-2025-07-04",
      "headline": "ED questions Telugu film producer Allu Aravind for 3 hours in bank fraud caseTelugu film producer Allu Aravind was questioned by the ED for three hours in a Rs 101.4 crore bank fraud case involving Ramakrishna Electronics and RTPL. The ED seized properties, froze accounts, and uncovered evidence of fund diversion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/jitendra-kumar-to-neena-gupta-panchayat-stars-rock-vintage-sportswear-2750806-2025-07-04",
      "headline": "Jitendra Kumar to Neena Gupta, Panchayat stars rock vintage sportswear. PicsAfter winning everyone's hearts with its simple story and light-hearted humour, Panchayat Season 4 is ready to impress again! This time, new photos from a fun Pickleball-themed photoshoot are going viral on social media. The pictures feature Jitendra Kumar, Neena Gupta, Sanvikaa, Chandan Roy, Faisal Malik, Durgesh Kumar, and Ashok Pathak in a sporty and stylish tennis court setting. Dressed in vintage-style sports outfits with sweatbands, visors, and rackets, the cast looks both playful and fashionable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-would-do-jurassic-part-rebirth-even-if-i-am-dying-in-next-five-minutes-2750816-2025-07-04",
      "headline": "Scarlett Johansson would've done Jurassic World even if she died in first 5 minutesScarlett Johansson has fulfilled her long-held wish to be part of the Jurassic franchise with a lead role in 'Jurassic World: Rebirth'. The BAFTA-winning actor explained how she got to play the lead in the latest film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-anxiously-waiting-for-anshula-kapoor-return-post-engagement-2750709-2025-07-04",
      "headline": "Boney Kapoor anxiously waiting for Anshula's return from New York after engagementInfluencer Anshula Kapoor, recently announced her engagement to partner Rohan Thakkar. Her father and film producer Boney Kapoor reacted to the news along with other family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thammudu-review-nithiin-action-drama-wild-ambitions-tame-execution-venu-sriram-wasted-opportunity-2750779-2025-07-04",
      "headline": "Thammudu review: Wild ambitions but tamed execution in Nithiin's survival thrillerRelease Date:Fri Jul 04, 2025'Thammudu' movie review: Despite an intriguing premise and a visually rich setting, 'Thammudu' struggles with coherence, emotional depth, and narrative impact. What could have been a gripping one-night survival thriller turns into a long, meandering ride with fleeting moments of brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-concert-in-india-are-we-ready-to-create-history-with-a-bts-concert-army-speaks-2750543-2025-07-04",
      "headline": "Is India ready to create history with a BTS concert? ARMY weighs inIndia's love for BTS is loud, loyal, and impossible to ignore. With HYBE now entering the Indian market, the dream of a BTS concert feels closer than ever. In this week's K-fix, we discuss whether India is ready to host a show of that scale right now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-fangirls-over-brad-pitt-f1-javier-bardem-2750782-2025-07-04",
      "headline": "Kareena Kapoor fangirls over Brad Pitt in F1: Who wants to be 20…Bollywood actor Kareena Kapoor has expressed her admiration for Brad Pitt after watching 'F1', joining fellow star Deepika Padukone in praising the Hollywood icon. The movie, centred around Formula One racing, has garnered positive reviews and strong box office success since its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amaal-mallik-says-bollywood-doing-to-kartik-aryan-what-it-did-to-sushant-singh-rajput-2750738-2025-07-04",
      "headline": "Bollywood doing to Kartik Aryan what it did to Sushant Singh Rajput: Amaal MallikAmaal Mallik alleged that Bollywood is trying to sideline Kartik Aaryan just like it did with Sushant Singh Rajput. He claimed powerful producers and actors are targeting Kartik, despite his success and strong family support."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-signs-bill-tax-breaks-spending-cuts-into-law-during-white-house-picnic-glbs-2751068-2025-07-05",
      "headline": "Trump signs 'One Big Beautiful Bill' into law at White House July 4 celebrationsUS President Donald Trump signed the \"One Big Beautiful Bill\" into law, a sweeping tax and spending package passed on July 4, sparking controversy over healthcare cuts and its USD 3 trillion debt impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raj-thackeray-uddhav-thackeray-brothers-marathi-cause-rally-worli-dome-mumbai-2751027-2025-07-04",
      "headline": "After 2 decades, Thackeray brothers to reunite for Marathi cause at mega rallyThe catalyst for the reunion of Raj Thackeray and Uddhav Thackeray was their joint opposition to the proposed three-language formula, which prompted the Mahayuti government to backtrack and put the policy on hold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-wins-rapid-title-grand-chess-tour-2025-zagreb-2751029-2025-07-04",
      "headline": "World Champion D Gukesh wins rapid title at Grand Chess Tour 2025 ZagrebReigning World Champion D. Gukesh won the rapid title at the Grand Chess Tour 2025 Rapid & Blitz in Zagreb, Croatia, on Friday. The 19-year-old scored 14 points out of a possible 18, recovering from an early setback to finish at the top of the standings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/may-be-in-afghanistan-bilawal-bhutto-says-pakistan-doesnt-know-where-masood-azhar-is-2751079-2025-07-05",
      "headline": "May be in Afghanistan: Bilawal Bhutto says Pak doesn't know where Masood Azhar isBilawal Bhutto, in an interview with Al Jazeera, said that Masood Azhar may be in Afghanistan, and denied that Hafiz Saeed is free. He also said that Pakistan is willing to act if India shares evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/newlywed-bride-recounts-140-days-in-ice-custody-says-was-treated-like-cattle-glbs-2751077-2025-07-05",
      "headline": "Treated like cattle: Newlywed bride recounts 140 days in US immigration custodyA newlywed Palestinian woman from Texas says she was \"treated like cattle\" during 140 days in ICE detention after her honeymoon, calling the experience dehumanising and unlawful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-results-carlos-alcaraz-cam-norrie-elise-mertens-2751057-2025-07-05",
      "headline": "Wimbledon: Alcaraz reaches Round 4 with hard-fought win, Norrie, Mertens advanceCarlos Alcaraz overcame Jan-Lennard Struff in four sets to make it to the fourth round of Wimbledon on Friday, July 4. Cam Norrie and Elise Mertens also booked their places in the fourth round with straight set wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-welcomes-60-day-gaza-ceasefire-proposal-with-positive-spirit-glbs-2751063-2025-07-05",
      "headline": "Hamas welcomes 60-day Gaza ceasefire proposal with 'positive spirit'Hamas responded \"positively\" to a US-brokered Gaza ceasefire plan, signaling readiness for talks, as pressure mounts on Israel and the US to secure a deal and release hostages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-socialist-image-may-face-scrutiny-over-mother-mira-nair-2-million-dollar-house-in-new-york-city-chelsea-2750847-2025-07-04",
      "headline": "Socialist Mamdani faces backlash over mother Mira Nair's $2-million houseZohran Mamdani, New York City's socialist mayoral candidate, may face public scrutiny over his family's wealth. The socialist candidate's mother, Mira Nair, owns a $2-million house in the city. Critics say Mamdani, who owns a four-acre plot in Uganda, is too privileged to be speaking of socialism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/theek-karke-dikhao-challenge-viral-governance-theek-karke-dikhao-after-ice-bucket-social-media-trend-campaign-2750760-2025-07-04",
      "headline": "After ice bucket, now a governance challenge for netas, babus: Theek Karke Dikhao After the ice bucket challenge, used to raise funds for the neuro-degenerative disorder ALS, here's the viral Theek Karke Dikhao social media campaign in India. People are sharing images of roads with potholes, dug-up pavements and trash-filled urban water bodies on X and Facebook, and challenging politicians and bureaucrats to fix them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-does-not-speak-on-matters-of-religion-india-steers-clear-of-dalai-lama-succession-row-2750886-2025-07-04",
      "headline": "Government does not speak on matters of religion: India on Dalai Lama succession rowThe Indian government said that it does not take any position on matters of religious belief or practices. The statement comes amid a row over Tibetan spiritual leader Dalai Lama's succession plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-trinidad-tobago-parliament-west-indies-cricket-diaspora-speech-women-empowerment-2750991-2025-07-04",
      "headline": "We cheer for West Indies, except vs India, PM quips in Trinidad and TobagoDuring his address to Trinidad and Tobago's Parliament, PM Modi said Indians cheer passionately for the West Indies cricket team except when they play against India. He also highlighted shared democratic values, diaspora ties, and women's empowerment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/school-boy-critically-injured-after-bmtc-bus-hits-him-in-anekal-bengaluru-2750770-2025-07-04",
      "headline": "BMTC bus hits schoolboy crossing road in Bengaluru, critically injuredA boy was critically injured in Bengaluru Urban district after being struck by a BMTC bus while crossing the road to board his school bus. Locals blame drivers of both buses for negligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-becomes-most-followed-on-spotify-beats-taylor-swift-and-ed-sheeran-2750928-2025-07-04",
      "headline": "Arijit Singh becomes most followed on Spotify, beats Taylor Swift and Ed SheeranArijit Singh has become the most followed artist on Spotify with 151 million followers, surpassing global stars like Taylor Swift and Ed Sheeran. Despite having fewer monthly listeners, his follower count reflects a strong and dedicated global fan base."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-independence-day-anti-trump-protests-expand-across-nation-on-july-4-glbs-2751059-2025-07-05",
      "headline": "On US Independence Day, anti-Trump protests expand across nationAs the US celebrates its 249th Independence Day, national pride is divided amid political tensions, immigration fears, and growing protests, while rising tariffs threaten future fireworks displays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-3-report-siraj-brook-smith-akash-edgbaston-2751013-2025-07-04",
      "headline": "2nd Test: Brook, Smith dazzle but Siraj has the final say on Day 3England vs India, 2nd Test: India ended Day 3 of the second Test at 64 for 1, extending their lead to 244 runs after Mohammed Siraj's six-wicket haul helped bowl England out for 407 - despite a commanding, unbeaten 184 from Jamie Smith - at Edgbaston on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/battle-of-galwan-motion-poster-salman-khan-looks-fierce-first-look-uniform-2750896-2025-07-04",
      "headline": "Battle of Galwan first look: Salman Khan is intense, fierce in uniformSalman Khan shared the motion poster of his upcoming film 'Battle of Galwan'. The story is based on one of India's most brutal battles fought without a single bullet being fired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/men/story/after-18-years-of-failed-attempts-ai-helps-couple-achieve-pregnancy-glbs-2751069-2025-07-05",
      "headline": "After 18 years of failed attempts, AI helps couple achieve pregnancyA couple conceived after 18 years of infertility, using Columbia University's AI-powered STAR system, which detected hidden sperm non-invasively. The breakthrough offers new hope for men with azoospermia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-502-04-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-dalai-lama-successor-tibetan-buddhism-news-1959-secret-escape-china-assam-rifles-welcome-2750578-2025-07-04",
      "headline": "Dalai, dance and disguise: How Tibetan leader hoodwinked China, fled to IndiaIt was a Great Escape in 1959 from Lhasa's Norbulingka Palace, the summer seat of the Dalai Lama, the head of Tibetan Buddhism. Then just 23, the Dalai Lama had no option but to flee Tibet after it became clear that an invitation to a dance event was communist China's bid to imprison him. Disguised as a soldier, he hoodwinked Chinese soldiers and entered India after a gruelling two-week trek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-six-wicket-haul-india-180-run-lead-edgbaston-test-2750983-2025-07-04",
      "headline": "Siraj shines in Bumrah's absence, picks 6-wicket haul to put India on topEngland vs India, 2nd Test: With Jasprit Bumrah rested, Mohammed Siraj led India's pace attack with a superb six-wicket haul, helping the visitors secure a 180-run first-innings lead against England on Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/upsc-aspirant-bags-rs-9-lakh-sleep-internship-to-sleep-9-hours-at-night-2750912-2025-07-04",
      "headline": "UPSC aspirant bags Rs 9 lakh internship to sleep 9 hours at nightAn UPSC aspirant from Pune has earned Rs 9.1 lakh by sleeping for 60 days as part of a unique internship programme. Pooja Madhav Wavhal was named the 'Sleep Champion of the Year' in the fourth season of the Wakefit Sleep Internship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-trinidad-and-tobago-visit-served-food-on-sohari-leaves-during-dinner-2750982-2025-07-04",
      "headline": "PM served food on Sohari leaf at dinner during Trinidad and Tobago visitPrime Minister Narendra Modi, who is on a two-day visit to Trinidad and Tobago, described Sohari leaves as of great cultural significance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shobhaa-de-jabs-thackerays-warring-cousins-have-made-language-political-issue-2751045-2025-07-05",
      "headline": "Warring cousins have made language a political issue: Shobhaa De jabs ThackeraysAuthor Shobhaa De has slammed the Marathi imposition in Mumbai, calling it political \"Dadagiri\" by Thackeray cousins, Uddhav Thackeray and Raj Thackeray, ahead of civic polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-ai2414-from-bengaluru-to-delhi-delayed-after-pilots-medical-emergency-airline-says-2750954-2025-07-04",
      "headline": "Bengaluru-Delhi flight delayed after Air India pilot's medical emergencyAn Air India pilot suffered a medical emergency before a Bengaluru-Delhi flight, delaying it on July 4. The pilot was hospitalised and is stable. Another crew member later operated the flight."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-results-carlos-alcaraz-cam-norrie-elise-mertens-2751057-2025-07-05",
      "headline": "Wimbledon: Alcaraz reaches Round 4 with hard-fought win, Norrie, Mertens advanceCarlos Alcaraz overcame Jan-Lennard Struff in four sets to make it to the fourth round of Wimbledon on Friday, July 4. Cam Norrie and Elise Mertens also booked their places in the fourth round with straight set wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jamie-smith-breaks-alec-stewarts-record-with-classy-184-2751030-2025-07-04",
      "headline": "Jamie Smith breaks 28-year-old record for England with classy 184 vs IndiaJamie Smith broke Alec Stewart's record and registered the highest score by an England wicketkeeper in Tests. Smith scored an unbeaten 184 on Day 3 of the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-wins-rapid-title-grand-chess-tour-2025-zagreb-2751029-2025-07-04",
      "headline": "World Champion D Gukesh wins rapid title at Grand Chess Tour 2025 ZagrebReigning World Champion D. Gukesh won the rapid title at the Grand Chess Tour 2025 Rapid & Blitz in Zagreb, Croatia, on Friday. The 19-year-old scored 14 points out of a possible 18, recovering from an early setback to finish at the top of the standings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-3-report-siraj-brook-smith-akash-edgbaston-2751013-2025-07-04",
      "headline": "2nd Test: Brook, Smith dazzle but Siraj has the final say on Day 3England vs India, 2nd Test: India ended Day 3 of the second Test at 64 for 1, extending their lead to 244 runs after Mohammed Siraj's six-wicket haul helped bowl England out for 407 - despite a commanding, unbeaten 184 from Jamie Smith - at Edgbaston on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-yashasvi-jaiswal-drs-controversy-2751007-2025-07-04",
      "headline": "Ben Stokes fumes at umpires as Jaiswal opts for DRS after 15-second timerEngland captain Ben Stokes had a heated chat with the umpires as India batter Yashasvi Jaiswal was allowed to opt for DRS even after exhausting his 15-second timer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yashasvi-jaiswal-joint-fastest-indian-2000-test-runs-2750993-2025-07-04",
      "headline": "Yashasvi Jaiswal becomes joint-fastest Indian to reach 2,000 Test runsEngland vs India, 2nd Test: Yashasvi Jaiswal became the joint-fastest Indian to reach 2,000 runs in Test cricket, equalling legends Rahul Dravid and Virender Sehwag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-six-wicket-haul-india-180-run-lead-edgbaston-test-2750983-2025-07-04",
      "headline": "Siraj shines in Bumrah's absence, picks 6-wicket haul to put India on topEngland vs India, 2nd Test: With Jasprit Bumrah rested, Mohammed Siraj led India's pace attack with a superb six-wicket haul, helping the visitors secure a 180-run first-innings lead against England on Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-taylor-fritz-rublev-win-madison-keys-osaka-exit-2750967-2025-07-04",
      "headline": "Taylor Fritz, Rublev march ahead; Madison Keys, Osaka crash outMadison Keys and Naomi Osaka crashed out in the third round, continuing a turbulent campaign for the US contingent in the women's draw. Meanwhile, Taylor Fritz and Andrey Rublev powered into the fourth round with straight-set wins, navigating delays and physical discomfort with grit and poise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/neeraj-chopra-classic-bengalurus-iconic-stadium-gears-up-for-javelin-spectacle-2750950-2025-07-04",
      "headline": "Neeraj Chopra Classic: Bengaluru's iconic stadium gears up for javelin spectacleNeeraj Chopra Classic: On the eve of a landmark moment in Indian athletics, Bengaluru's Sree Kanteerava Stadium lies in poised silence — the calm before a historic storm. For the first time ever, the nation will witness a world-class javelin spectacle on home soil, led by Olympic champion Neeraj Chopra and 11 elite throwers. The markers are set, the stage is ready, and history is about to be hurled into motion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yashasvi-jaiswal-joint-fastest-indian-2000-test-runs-2750993-2025-07-04",
      "headline": "Yashasvi Jaiswal becomes joint-fastest Indian to reach 2,000 Test runsEngland vs India, 2nd Test: Yashasvi Jaiswal became the joint-fastest Indian to reach 2,000 runs in Test cricket, equalling legends Rahul Dravid and Virender Sehwag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-six-wicket-haul-india-180-run-lead-edgbaston-test-2750983-2025-07-04",
      "headline": "Siraj shines in Bumrah's absence, picks 6-wicket haul to put India on topEngland vs India, 2nd Test: With Jasprit Bumrah rested, Mohammed Siraj led India's pace attack with a superb six-wicket haul, helping the visitors secure a 180-run first-innings lead against England on Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-taylor-fritz-rublev-win-madison-keys-osaka-exit-2750967-2025-07-04",
      "headline": "Taylor Fritz, Rublev march ahead; Madison Keys, Osaka crash outMadison Keys and Naomi Osaka crashed out in the third round, continuing a turbulent campaign for the US contingent in the women's draw. Meanwhile, Taylor Fritz and Andrey Rublev powered into the fourth round with straight-set wins, navigating delays and physical discomfort with grit and poise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/neeraj-chopra-classic-bengalurus-iconic-stadium-gears-up-for-javelin-spectacle-2750950-2025-07-04",
      "headline": "Neeraj Chopra Classic: Bengaluru's iconic stadium gears up for javelin spectacleNeeraj Chopra Classic: On the eve of a landmark moment in Indian athletics, Bengaluru's Sree Kanteerava Stadium lies in poised silence — the calm before a historic storm. For the first time ever, the nation will witness a world-class javelin spectacle on home soil, led by Olympic champion Neeraj Chopra and 11 elite throwers. The markers are set, the stage is ready, and history is about to be hurled into motion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-allows-pakistan-athletes-asia-cup-world-sports-events-protect-olympics-bid-2750914-2025-07-04",
      "headline": "Why India can't deny Pakistan entry to multilateral sporting events on its soilWith India's ambitious Olympic bid on the line, the government couldn't afford to block Pakistan from participating in multilateral sporting events on home soil-despite public outrage-fearing it could jeopardise the country's chances of hosting major global tournaments in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-vaibhav-suryavanshi-on-shubman-gills-double-century-2750909-2025-07-04",
      "headline": "Shubman Gill's double century ignites Vaibhav Suryavanshi's Test cricket dreamsIndia's teen batting sensation Vaibhav Suryavanshi revealed how Shubman Gill's double century against England during the 2nd Test has inspired him to play Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenal-thomas-partey-rape-cases-metropolitan-police-services-2750904-2025-07-04",
      "headline": "Former Arsenal midfielder Thomas Partey charged with multiple rape casesBritish police on Friday charged former Arsenal footballer Thomas Partey with five counts of rape and one count of sexual assault, according to an official statement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-diogo-jota-death-mohamed-salah-death-liverpool-2750897-2025-07-04",
      "headline": "Difficult to accept Diogo Jota won't be there: Mohamed Salah's tribute to forwardMohamed Salah paid a heartfelt tribute to Diogo Jota after the Liverpool forward's death in a car accident on Thursday, July 3. Jota and his brother passed away after their car crashed while the forward was heading back to England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-friendship-dreams-bengaluru-2750889-2025-07-04",
      "headline": "Neeraj Chopra Classic: Fueled by dreams, friendships and hope for a better futureThe Neeraj Chopra Classic marks India's first international javelin tournament, blending Chopra's personal dream with a collective vision for the future of Indian athletics. Fueled by global camaraderie and a deep-rooted passion for the sport, it signals a bold new chapter for javelin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-harry-brook-hundred-edgbaston-2750883-2025-07-04",
      "headline": "Headingley redemption at Edgbaston: Harry Brook scores 9th Test hundredAfter being dismissed for 99 at Headingley, Harry Brook got to his ninth Test hundred during the Edgbaston Test on Friday, July 4. Brook got to his maiden hundred against India off 137 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-launches-search-new-india-senior-mens-football-coach-2750864-2025-07-04",
      "headline": "AIFF opens applications for new India senior men's football coachThe All India Football Federation (AIFF) has officially opened applications for the position of head coach of the senior men's national football team, following the sudden departure of Spaniard Manolo Marquez. Aspiring candidates have until July 13 to apply, with the federation listing a comprehensive set of eligibility requirements and expectations for the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-hits-joint-3rd-fastest-test-hundred-english-batter-2750854-2025-07-04",
      "headline": "Jamie Smith hits joint 3rd fastest Test hundred by an English batterEngland vs India: Jamie Smith hit the joint fourth-fastest Test hundred by an England batter, matching Harry Brook's effort against Pakistan in Rawalpindi in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-friendship-dreams-bengaluru-2750889-2025-07-04",
      "headline": "Neeraj Chopra Classic: Fueled by dreams, friendships and hope for a better futureThe Neeraj Chopra Classic marks India's first international javelin tournament, blending Chopra's personal dream with a collective vision for the future of Indian athletics. Fueled by global camaraderie and a deep-rooted passion for the sport, it signals a bold new chapter for javelin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-harry-brook-hundred-edgbaston-2750883-2025-07-04",
      "headline": "Headingley redemption at Edgbaston: Harry Brook scores 9th Test hundredAfter being dismissed for 99 at Headingley, Harry Brook got to his ninth Test hundred during the Edgbaston Test on Friday, July 4. Brook got to his maiden hundred against India off 137 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-launches-search-new-india-senior-mens-football-coach-2750864-2025-07-04",
      "headline": "AIFF opens applications for new India senior men's football coachThe All India Football Federation (AIFF) has officially opened applications for the position of head coach of the senior men's national football team, following the sudden departure of Spaniard Manolo Marquez. Aspiring candidates have until July 13 to apply, with the federation listing a comprehensive set of eligibility requirements and expectations for the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-hits-joint-3rd-fastest-test-hundred-english-batter-2750854-2025-07-04",
      "headline": "Jamie Smith hits joint 3rd fastest Test hundred by an English batterEngland vs India: Jamie Smith hit the joint fourth-fastest Test hundred by an England batter, matching Harry Brook's effort against Pakistan in Rawalpindi in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-prasidh-krishna-trolled-jamie-smith-edgbaston-2750851-2025-07-04",
      "headline": "Clueless, liability: Prasidh Krishna slammed after horrendous Edgbaston spellFans slammed Prasidh Krishna for his forgettable spell against England in the Edgbaston Test on Friday, July 4. The Indian pacer was taken apart by Jamie Smith on Day 3 of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-2025-live-streaming-details-timings-all-you-need-to-know-2750836-2025-07-04",
      "headline": "Neeraj Chopra Classic 2025: Live streaming and all you need to knowThe Neeraj Chopra Classic is all set to create history on Friday, July 5. Here's a look at all you need to know about the tournament set to take place in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/president-donald-trump-ufc-event-in-white-house-dana-white-2750796-2025-07-04",
      "headline": "President Trump eyes UFC event at White House for USA's 250th anniversaryThe President of the United States of America, Donald Trump, has suggested the idea of holding a UFC event within the premises of the White House to celebrate the country's 250th anniversary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-british-gp-preview-lewis-hamilton-max-verstappen-2750786-2025-07-04",
      "headline": "F1 Returns to its Birthplace: All eyes on Silverstone for British Grand PrixFormula One returns to its roots  from July 4th to July 6th as the British Grand Prix takes centre stage at Silverstone, the birthplace of the F1 World Championship, which began here 75 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-3-updates-edgbaston-2750751-2025-07-04",
      "headline": "ENG vs IND, 2nd Test Day 3 Highlights: Siraj stars as India extend lead to 244England (ENG) vs India (IND), 2nd Test Day 3 Highlights: Mohammed Siraj was the star of the show on Day 3 as India extend their lead to 244 runs. Siraj took six wickets for 70 as India dismissed England for 407 before KL Rahul ensured India got a good start to their second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nico-williams-renews-athletic-bilbao-amidst-barcelona-rumours-2750748-2025-07-04",
      "headline": "Nico stays at Athletic Bilbao amid Barcelona talks, signs till 2035Nico Williams has extended his contract with Athletic Bilbao. The Spanish winger has put pen to paper on a new deal which will see him contracted for the club till 2035. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-5-results-carlos-alcaraz-sabalenka-raducanu-2750747-2025-07-04",
      "headline": "Wimbledon, Day 5 Highlights: Sabalenka beats Raducanu, Alcaraz advancesWimbledon 2025 Day 5 Highlights: Aryna Sabalenka overcame adversity to defeat Emma Raducanu 7-6, 6-4 in straight sets to move into the fourth round. Carlos Alcaraz came back strongly in his third-round fixture as he defeated Jan-Lennard Struff in the last two sets to progress ahead into pre-quarterfinals. India's Yuki Bhambri and China's Jiang Xinyu have beaten Nicole Melichar-Martinez and Christian Harrison 6-3, 1-6, 7-6 (10-6) in the second-round fixture of mixed doubles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pakistan-squash-championship-mehwish-ali-flashes-middle-finger-after-defeat-2750721-2025-07-04",
      "headline": "Watch: Mehwish Ali flashes middle finger after loss at Squash ChampionshipA Pakistani squash player was seen flashing the middle finger following her defeat in the round of 16 stages of the 32nd Asian Junior Individual Championships in South Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-break-all-white-dress-code-diogo-jota-car-crash-2750706-2025-07-04",
      "headline": "Wimbledon set to break 148-year-old dress code rule in memory of Diogo JotaWimbledon will allow players to wear black armbands in tribute to Diogo Jota, reported AP on Friday. This marks the first time the tournament breaks its all-white dress code amid mourning for the late footballer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alex-carey-beau-webster-rescue-australia-against-west-indies-brisbane-test-2750577-2025-07-04",
      "headline": "2nd Test: Webster, Carey put in yet another rescue act in GrenedaAlex Carey and Beau Webster staged a vital rescue for Australia after a top-order collapse. Their partnership helped stabilise the innings amid a fierce West Indies pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-vs-liverdoc-x-debate-ayurveda-modern-medicine-2750635-2025-07-04",
      "headline": "Chess star Vidit Gujrathi calls out LiverDoc for insulting his familyIndian chess grandmaster Vidit Gujrathi engaged in a heated online dispute with X user LiverDoc over his family's medical qualifications."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}