{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-43-points-higher-nifty-above-25200-sbi-gains-2-percent-2756659-2025-07-16",
      "headline": "Sensex closes 43 points higher, Nifty above 25,200; SBI gains 2%Sensex closes 43 points higher, Nifty above 25,200; SBI gains 2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gurugram-gurgaon-rain-water-logging-real-estate-price-bubble-review-infra-drainage-2756654-2025-07-16",
      "headline": "Will rain drown Gurugram's luxury real estate?Gurugram's luxury real estate may be booming, but repeated rain-induced flooding is testing its long-term value. If basic infrastructure fails, even the city's glitziest addresses could lose their appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-gold-losing-its-shine-here-is-why-fewer-people-are-investing-in-the-yellow-metal-gold-investment-trends-etfs-2756607-2025-07-16",
      "headline": "Is gold losing its shine? Here's why fewer people are investing in the yellow metalEarlier, gold symbolised family pride and social standing, but today's youngsters often see gold jewellery as outdated and instead put their money into things they believe will grow faster than gold ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-upcoming-meeting-august-expectation-simplification-slab-structure-rate-rationalisation-2756556-2025-07-16",
      "headline": "Fewer slabs, simpler rules? Next GST Council meet may trigger overhaulThe upcoming GST Council meeting, likely to be held in August 2025 after the monsoon session of Parliament, could bring key reforms in the way GST is structured and collected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-residential-housing-home-sales-drop-affordability-concerns-proptiger-report-2756552-2025-07-16",
      "headline": "Housing sales slide 14% as affordability pressures mount across cities: ReportThe PropTiger report, which tracks sales and launches across major cities, found that the most significant annual drop was recorded in Mumbai Metropolitan Region (MMR) and Pune, where sales fell by 32% and 27% respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mygate-founder-abhishek-kumar-work-as-guard-why-rs-1600-crore-valuation-iit-iim-graduate-2756521-2025-07-16",
      "headline": "Why this IITian took up a guard's job to build Mygate, valued at Rs 1,600 croreMyGate has raised a total of $83.3 million across eight rounds. Its latest funding was in April 2023, a Series B round worth $3.29 million, putting its valuation at Rs 1,670 crore, according to Tracxn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-private-school-fees-draining-indian-middle-class-ca-shares-eye-opening-figures-2756494-2025-07-16",
      "headline": "Are private school fees draining India's middle class? CA shares eye-opening figuresWith fees climbing each year, parents are feeling the pinch more than ever. Maybe now is the right moment to pause, think, and ask ourselves, are we getting real value for this cost? Can we secure our kids' future without spending a fortune on fees? asks a Delhi-based CA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ssy-scheme-how-your-daughter-can-get-rs-71-lakh-at-21-sukanya-samriddhi-yojana-government-scheme-2756448-2025-07-16",
      "headline": "SSY scheme: How your daughter can get Rs 71 lakh at 21It is a small savings scheme backed by the government, which offers high interest rates, tax benefits under Section 80C, and tax-free returns on maturity. Over 4.1 crore accounts have been opened so far under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-holders-good-news-soon-bonus-issue-special-interim-dividend-2756447-2025-07-16",
      "headline": "Good news soon for HDFC Bank shareholders? Here's all you need to knowHDFC Bank shares have delivered a 24% gain over the past year, with a year-to-date rise of nearly 13%. The stock has climbed more than 21% over the last six months, posting gains of 7% over the past three months and 4% in the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-bonus-issue-not-down-50-percent-down-2756443-2025-07-16",
      "headline": "Did Ashok Leyland shares fall over 50% today? Details hereThe steep drop is the result of the company's 1:1 bonus issue, which came into effect on Wednesday. When a stock goes \"ex-bonus,\" its price adjusts to reflect the additional shares being issued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepak-dobriyal-says-waiting-for-the-right-biopic-not-just-any-role-exclusive-2756655-2025-07-16",
      "headline": "Exclusive: Deepak Dobriyal says he's waiting for the right biopic, not just any role Actor Deepak Dobriyal shared his wish to play challenging real-life characters in biopics, including Nusrat Fateh Ali Khan, Pinki Pramanik, and Dhyan Chand. He also spoke about avoiding repetitive roles and choosing strong scripts with good directors and star casts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-kisses-katrina-kaif-in-birthday-post-and-its-too-cute-to-miss-2756633-2025-07-16",
      "headline": "Vicky Kaushal kisses Katrina Kaif in birthday post, and it's too cute to missVicky Kaushal shared a heartwarming birthday tribute to his 'special one', Katrina Kaif, sharing a series of adorable photos alongside a simple yet touching note that melted hearts online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mitti-ek-nayi-pehchan-review-ishwak-singh-starrer-brings-soul-of-rural-india-to-screen-2756568-2025-07-16",
      "headline": "Mitti Ek Nayi Pehchan review: Ishwak Singh's film brings rural India alive onscreenRelease Date:Thu Jul 10, 2025'Mitti: Ek Nayi Pehchan' is an emotional and honest story of a man who returns to his village and reconnects with his roots. Without any drama or glamour, the show shows the real life and struggles of rural India. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-and-telugu-directors-mourn-ravi-teja-father-rajagopal-raju-death-2756597-2025-07-16",
      "headline": "Chiranjeevi and Telugu directors mourn Ravi Teja's father Rajagopal Raju's deathTelugu actor Ravi Teja's father, Bhupathiraju Rajagopal Raju, died at the age of 90, on Tuesday. Several known personalities from the Telugu film industry, including veteran actor Chiranjeevi, offered their condolences to the 'Dhamaka' actor. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-4-in-works-details-2756601-2025-07-16",
      "headline": "The White Lotus Season 4 in works. Details'The White Lotus' is set for a fourth season with creator Mike White exploring new filming locations, possibly warmer destinations like Mexico or Egypt. Fans can expect the show to return by late 2026 or 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-admits-marriage-with-kirron-kher-is-not-the-best-2756588-2025-07-16",
      "headline": "Anupam Kher admits marriage with Kirron Kher isn't the bestAnupam Kher, who has been married to Kirron Kher for 30 years, shared that he believes compatibility in a relationship is often given too much importance. He also revealed that he has, at times, unintentionally hurt H"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moosewala-signed-to-god-world-tour-announced-3-years-after-his-assassination-what-it-means-ai-avatar-high-tech-concerts-2756575-2025-07-16",
      "headline": "Sidhu Moosewala's world tour announced 3 years after his death. What it meansSidhu Moosewala's official Instagram announced the groundbreaking 'Signed to God' world tour, set for 2026 - three years after his death. The tour aims to celebrate his legacy in a never-before-seen format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhon-ki-gustaakhiyan-director-santosh-singh-cast-shanaya-kapoor-after-instagram-reel-2756566-2025-07-16",
      "headline": "Exclusive: How an Instagram reel got Shanaya Kapoor her first feature filmDirector Santosh Singh introduced Shanaya Kapoor in his latest romantic drama 'Aankhon Ki Gustaakhiyan'. In an exclusive interview with us, he revealed that the debutante wasn't the first choice for the role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-samantha-ruth-prabhu-parineeti-chopra-lead-celeb-cheers-as-sidharth-malhotra-kiara-advani-welcome-baby-girl-2756502-2025-07-16",
      "headline": "KJo, Samantha, Parineeti lead celeb cheers as Sidharth-Kiara welcome baby girlActors Parineeti Chopra and Samantha Ruth Prabhu were amongst several celebrities who wished Bollywood couple Sidharth Malhotra and Kiara Advani. The two announced the birth of their baby girl on Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/9-hospitalised-beyonce-atlanta-cowboy-carter-show-stampede-2756550-2025-07-16",
      "headline": "Nine hospitalised after stampede at Beyonce's Atlanta Cowboy Carter showSeveral Beyonce fans were injured in a stampede caused by a shouting passenger on a train following her concert in Atlanta. The incident occurred as the crowd reacted to the disturbance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithya-menen-cow-dung-in-nails-idly-kadai-national-award-2756479-2025-07-16",
      "headline": "Nithya Menen had cow dung in nails while accepting National Award. Here's whyActor Nithya Menen recently opened up about the challenges she faced for her role in Dhanush's 'Idly Kadai'. She revealed that she had cow dung on her nails, which coincided with her accepting the National Film Award.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nitesh-tiwari-ramayana-aims-to-redefine-world-perception-of-india-producer-namit-malhotra-2756524-2025-07-16",
      "headline": "Ramayana aims to redefine world's perception of India: Producer Namit MalhotraProducer Namit Malhotra discussed his vision for Nitesh Tiwari's 'Ramayana'. Malhotra said he wanted to centre Indian culture internationally, and decided to change Western perception of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lewis-hamilton-dior-collection-bts-jimin-instagram-2756519-2025-07-16",
      "headline": "Lewis Hamilton shares Jimin's Dior look, fans call it best crossover momentFormula 1 legend Lewis Hamilton shared a photo of BTS' Jimin dressed in an outfit from his Dior collection. The post sent fans into a frenzy online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-meets-rajinikanth-mp-rajya-sabha-oath-taking-ceremony-2756528-2025-07-16",
      "headline": "Kamal Haasan meets friend Rajinikanth ahead of Rajya Sabha oath taking ceremonyActor-politician Kamal Haasan met his longtime friend and actor Rajinikanth at the latter's Chennai home on Wednesday. The meeting happened days ahead of Haasan's oath-taking ceremony as a Rajya Sabha member."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-gets-honorary-doctorate-from-university-of-bradford-2756493-2025-07-16",
      "headline": "Manisha Koirala gets honorary doctorate from University of Bradford, shares videoManisha Koirala was awarded an honorary doctorate by the University of Bradford. She also paid an emotional tribute to her late grandmother, whom she called her 'first teacher.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-to-marry-benny-blanco-in-september-ceremony-report-2756474-2025-07-16",
      "headline": "Selena Gomez to marry Benny Blanco in September ceremony: ReportSinger Selena Gomez and her boyfriend Benny Blanco are reportedly planning a September wedding in Montecito, California. The wedding invitations have been sent out to their close friends and family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-and-family-fall-victim-to-online-scam-during-dubai-trip-2756472-2025-07-16",
      "headline": "Archana Puran Singh and family fall victim to online scam during Dubai tripArchana Puran Singh shared in her vlog that she and her family were scammed while booking indoor skydiving tickets in Dubai through a fake website. Despite paying a hefty amount, no reservation was found, leaving the family shocked and disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ram-pothineni-debuts-as-lyricist-with-andhra-king-taluka-2756495-2025-07-16",
      "headline": "Actor Ram Pothineni debuts as lyricist with Andhra King TalukaTelugu actor Ram Pothineni is making his debut as a lyricist by penning the first single for his upcoming movie 'Andhra King Taluka'. With music by Anirudh Ravichander, the song will release on July 18, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-casual-walk-chennai-before-coolie-release-photo-goes-viral-2756482-2025-07-16",
      "headline": "Rajinikanth takes morning stroll in Chennai before Coolie release, pic goes viralSuperstar Rajinikanth was seen going on a casual morning walk in Chennai. A photo of the actor is now going viral on social media. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terrorists-fired-in-air-to-celebrate-after-killing-26-tourists-eyewitness-2756609-2025-07-16",
      "headline": "Pahalgam terrorists fired in air to celebrate after killing 26: EyewitnessIn the ongoing investigation into the recent Pahalgam terror attack that killed 26 civilians, it has been revealed that terrorists were seen resorting to celebratory firing immediately following the carnage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-glass-partition-removed-public-funds-junked-barely-lasts-a-year-dy-chandrachud-br-gavai-exclusive-rti-2756631-2025-07-16",
      "headline": "Exclusive: Supreme Court's Rs 2.6-crore glass partition junked within monthsThrough the RTI filed by India Today, we have exclusively learnt that the total cost of installation of the glass panels in the Supreme Court amounted to approximately Rs 2.6 crore. The cost of its removal was estimated at Rs 8,63,700."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-leads-kolkata-protest-over-detention-of-bengali-speaking-migrants-in-bjp-ruled-states-2756598-2025-07-16",
      "headline": "Put me in detention camp: Mamata Banerjee marches over 'targeting' of migrantsThe march, in the heart of Kolkata, was held in protest against the alleged harassment of Bengali-speaking people in BJP-ruled states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/visa-privilege-not-right-us-state-department-issues-strong-warning-for-visa-holders-us-embassy-in-india-deportation-american-laws-2756520-2025-07-16",
      "headline": "Visa is privilege, not a right: US State Dept warns of deportationsThe US Department of State has warned that visas are a privilege, not a right, and can be revoked if holders violate US laws. Arrests for crimes like assault or domestic violence can lead to deportation and future ineligibility. The warning comes after a series of advisories in recent weeks amid heightened scrutiny and enforcement surrounding US immigration policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gurugram-gurgaon-rain-water-logging-real-estate-price-bubble-review-infra-drainage-2756654-2025-07-16",
      "headline": "Will rain drown Gurugram's luxury real estate?Gurugram's luxury real estate may be booming, but repeated rain-induced flooding is testing its long-term value. If basic infrastructure fails, even the city's glitziest addresses could lose their appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-balasore-student-sexual-harassment-self-immolation-complaint-committee-report-2756484-2025-07-16",
      "headline": "Not a child to understand what favour I need, Odisha professor 'told' studentThe internal complaint committee had advised the professor, accused of sexually harassing the student who died after setting herself on fire, to modify his behaviour and teaching methods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/i-am-innocent-dont-know-anything-ups-chhangur-baba-breaks-silence-on-mass-religious-conversion-allegations-2756635-2025-07-16",
      "headline": "I am innocent: UP's Chhangur Baba on mass religious conversion allegationsUttar Pradesh's Chhangur Baba, the alleged mastermind behind the mass religious conversion case, has broken his silence on the allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/kota-how-indias-coaching-capital-collapsed-2756180-2025-07-15",
      "headline": "Kota: How India's coaching capital collapsedThe government is now intent on an education that promotes critical thinking rather than the rote learning coaching institutes foster\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-king-charles-akash-deep-sister-2756618-2025-07-16",
      "headline": "King Charles meets Team India, asks about Akash Deep's sisterThe Indian cricket teams met King Charles during their England tour. Charles asked about Akash Deep's sister, who is currently under treatment for cancer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/pune-porsche-case-2024-drink-driving-drunk-teen-father-businessman-juvenile-board-2756630-2025-07-16",
      "headline": "Pune Porsche crash case: How drunk teen escaped trial as adultDespite Pune Police alleging drink-driving, blood sample tampering and a cover-up in the Porsche crash, the Juvenile Justice Board rejected an adult trial for the teen, citing Supreme Court guidelines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-boeing-787-ahmedabad-crash-demand-cockpit-video-recorders-debate-safety-vs-privacy-2756086-2025-07-16",
      "headline": "Why no cameras in cockpits? Air India crash sparks debate, demandThe fuel-switch report in the Air India Boeing 787 crash probe has sparked a demand for a cockpit video recorder. The NTSB of the US that probes air crashes has for years batted for one. If cockpit voice recorders are part of the black boxes of planes, what has kept cockpit video recorders, which would aid air crash investigations, from being installed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/30-year-old-nri-arrested-in-hit-and-run-death-of-legendary-marathoner-fauja-singh-in-punjab-2756384-2025-07-16",
      "headline": "Learnt from news I hit Fauja Singh: NRI arrested for legendary marathoner's deathDuring police questioning, NRI Amritpal Singh Dhillon revealed that he was returning from Mukerian after selling his phone when his vehicle struck 114-year-old athlete Fauja Singh near Bias Pind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-gold-losing-its-shine-here-is-why-fewer-people-are-investing-in-the-yellow-metal-gold-investment-trends-etfs-2756607-2025-07-16",
      "headline": "Is gold losing its shine? Here's why fewer people are investing in the yellow metalEarlier, gold symbolised family pride and social standing, but today's youngsters often see gold jewellery as outdated and instead put their money into things they believe will grow faster than gold ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-anil-chauhan-operation-sindoor-pakistan-drones-intact-indigenous-weapons-2756504-2025-07-16",
      "headline": "Some Pak drones were found intact during Op Sindoor: Chief of Defence StaffAnil Chauhan, Chief of Defence Staff, said on Wednesday that some of the drones shot by Pakistan towards India during the four-day conflict after Operation Sindoor were found intact, implying that they may have not even functioned."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nato-chief-warns-india-china-brazil-of-100-secondary-sanctions-over-russia-trade-glbs-2756349-2025-07-16",
      "headline": "If you're Prime Minister of India and...: Nato's warning over buying Russian oilMark Rutte warned the leaders of China, India, and Brazil that if they continued trading with Russia and buying its oil and gas, he would impose 100 per cent secondary sanctions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/was-air-india-crash-mechanical-accidental-or-faqs-answered-2756089-2025-07-15",
      "headline": "Was Air India crash mechanical, accidental or…? FAQs answeredThe preliminary crash probe report has raised critical questions around how fuel supply to the engines got cut off. INDIA TODAY looks at the scenarios\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/happy-world-snake-day-2025-india-types-cobra-python-tribute-venom-poisonous-attack-harmful-relatives-heres-how-2756591-2025-07-16",
      "headline": "Happy World Snake Day, dear relativesSnakes are a misunderstood and feared lot, though 75% of them found in India are non-venomous. On World Snake Day, paying tribute to a species that's more venomous and strikes without provocation, our relatives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-student-self-immolation-case-father-conspiracy-balasore-college-death-2756501-2025-07-16",
      "headline": "My daughter was killed: Father of Odisha student who self-immolated breaks downA 20-year-old Odisha student died after setting herself on fire on campus, accusing her professor of sexual harassment. Her father has called it murder, alleging she was forced to end her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhon-ki-gustaakhiyan-director-santosh-singh-cast-shanaya-kapoor-after-instagram-reel-2756566-2025-07-16",
      "headline": "Exclusive: How an Instagram reel got Shanaya Kapoor her first feature filmDirector Santosh Singh introduced Shanaya Kapoor in his latest romantic drama 'Aankhon Ki Gustaakhiyan'. In an exclusive interview with us, he revealed that the debutante wasn't the first choice for the role. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sanjay-gaikwad-attack-canteen-contractor-sena-mva-maharashtra-assembly-protest-2756565-2025-07-16",
      "headline": "After Sena MLA's slapgate, MVA leaders protest against 'chaddi-baniyan' governmentAfter Shiv Sena MLA Sanjay Gaikwad was caught on video thrashing a canteen contractor in a vest and towel, opposition leaders staged a 'chaddi-baniyan' protest inside the Maharashtra Assembly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mitti-ek-nayi-pehchan-review-ishwak-singh-starrer-brings-soul-of-rural-india-to-screen-2756568-2025-07-16",
      "headline": "Mitti Ek Nayi Pehchan review: Ishwak Singh's film brings rural India alive onscreenRelease Date:Thu Jul 10, 2025'Mitti: Ek Nayi Pehchan' is an emotional and honest story of a man who returns to his village and reconnects with his roots. Without any drama or glamour, the show shows the real life and struggles of rural India. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/new-york-endures-heatwave-torrential-rains-how-the-extremes-struck-simultaneously-2756517-2025-07-16",
      "headline": "How climate extremes burnt and then submerged New YorkThis rare overlap of extreme heat and deluge is part of a broader pattern of volatile weather impacting much of the US this summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moosewala-signed-to-god-world-tour-announced-3-years-after-his-assassination-what-it-means-ai-avatar-high-tech-concerts-2756575-2025-07-16",
      "headline": "Sidhu Moosewala's world tour announced 3 years after his death. What it meansSidhu Moosewala's official Instagram announced the groundbreaking 'Signed to God' world tour, set for 2026 - three years after his death. The tour aims to celebrate his legacy in a never-before-seen format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/women-aged-over-24-banned-from-using-uk-gym-during-certain-hours-post-sparks-debate-2756529-2025-07-16",
      "headline": "Women aged over 24 banned from using UK gym during certain hours, post sparks debateA 36-year-old woman, in her post titled \"To think this is unfair?\", said she received an email from the gym notifying her of the revised schedule.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepak-dobriyal-says-waiting-for-the-right-biopic-not-just-any-role-exclusive-2756655-2025-07-16",
      "headline": "Exclusive: Deepak Dobriyal says he's waiting for the right biopic, not just any role Actor Deepak Dobriyal shared his wish to play challenging real-life characters in biopics, including Nusrat Fateh Ali Khan, Pinki Pramanik, and Dhyan Chand. He also spoke about avoiding repetitive roles and choosing strong scripts with good directors and star casts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-kisses-katrina-kaif-in-birthday-post-and-its-too-cute-to-miss-2756633-2025-07-16",
      "headline": "Vicky Kaushal kisses Katrina Kaif in birthday post, and it's too cute to missVicky Kaushal shared a heartwarming birthday tribute to his 'special one', Katrina Kaif, sharing a series of adorable photos alongside a simple yet touching note that melted hearts online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-and-telugu-directors-mourn-ravi-teja-father-rajagopal-raju-death-2756597-2025-07-16",
      "headline": "Chiranjeevi and Telugu directors mourn Ravi Teja's father Rajagopal Raju's deathTelugu actor Ravi Teja's father, Bhupathiraju Rajagopal Raju, died at the age of 90, on Tuesday. Several known personalities from the Telugu film industry, including veteran actor Chiranjeevi, offered their condolences to the 'Dhamaka' actor. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-admits-marriage-with-kirron-kher-is-not-the-best-2756588-2025-07-16",
      "headline": "Anupam Kher admits marriage with Kirron Kher isn't the bestAnupam Kher, who has been married to Kirron Kher for 30 years, shared that he believes compatibility in a relationship is often given too much importance. He also revealed that he has, at times, unintentionally hurt H"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-retirement-uturn-virat-kohli-test-comeback-2756644-2025-07-16",
      "headline": "Virat Kohli's passion unmatched, he should come back to Test cricket: Madan LalMadan Lal, the 1983 World Cup hero, has expressed a heartfelt wish that has struck a chord with cricket fans across the nation—to see Virat Kohli return to Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-king-charles-akash-deep-sister-2756618-2025-07-16",
      "headline": "King Charles meets Team India, asks about Akash Deep's sisterThe Indian cricket teams met King Charles during their England tour. Charles asked about Akash Deep's sister, who is currently under treatment for cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-icc-test-batting-ranking-top-spot-dethrones-harry-brook-eng-vs-ind-2756610-2025-07-16",
      "headline": "Joe Root dethrones Harry Brook to reclaim top spot in ICC Test rankingsEngland star Joe Root reclaimed the No.1 spot in ICC Test batting rankings after his century at Lord's, overtaking teammate Harry Brook and marking his eighth time at the top of the global charts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-agm-discusses-two-tier-test-system-t20-world-cup-expansion-new-members-2756600-2025-07-16",
      "headline": "ICC AGM: Two-tier Test system, T20 World Cup expansion to be discussedThe ICC's four-day AGM starting on Thursday will focus on key topics like the proposed two-tier Test system, T20 World Cup expansion, and new member ratifications. With the 2025-27 World Test Championship underway, discussions will center on funding and promotion-relegation rules within the two-tier format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-coach-sanath-jayasuriya-dismisses-pressure-following-2nd-t20i-loss-2756581-2025-07-16",
      "headline": "Coach Sanath Jayasuriya dismisses pressure talk following 2nd T20I lossSri Lanka head coach Sanath Jayasuriya insisted on Tuesday that the team is not under pressure despite their embarrassing 83-run loss to Bangladesh in the second T20I."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-broad-buttler-chirpy-sundar-nitish-fuelled-england-lord-win-2756563-2025-07-16",
      "headline": "Broad, Buttler believe chirpy Sundar, Nitish fuelled England's Lord's winEngland vs India: Stuart Broad and Jos Buttler felt Nitish Kumar Reddy and Washington Sundar's on-field antics on days three and four of the Lord's Test backfired, contributing to India's heartbreaking loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-isl-uncertain-future-statement-bengaluru-fc-indian-football-2756537-2025-07-16",
      "headline": "Sunil Chhetri's first reaction over ISL's uncertain future: Very concerningIndian Super League: Sunil Chhetri urged calm and unity across Indian football as uncertainty looms over the ISL's future, expressing faith in the AIFF and FSDL to find a solution that protects the sport's growth and stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-docked-two-wtc-points-slow-over-rate-lords-test-2756513-2025-07-16",
      "headline": "England penalised two WTC points for slow overrate in Lord's Test against IndiaEngland have been docked two ICC World Test Championship points for a slow over rate in the Lord's Test against India. This penalty has pushed England down to third place, affecting their championship hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-early-exit-japan-open-2025-lakshya-sen-satwik-chirag-win-2756506-2025-07-16",
      "headline": "Japan Open 2025: PV Sindhu crashes out in opening roundPV Sindhu's struggles continued as the two-time Olympic medallist crashed out in the first round of the Japan Open 2025 Super 750 tournament. In contrast, Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty registered commanding straight-game victories to advance to the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-macgill-cocaine-conviction-anxiety-family-impact-cricket-coaching-2756492-2025-07-16",
      "headline": "Stuart MacGill breaks silence on life after cocaine case: Worried for my kidsFormer Australian spinner Stuart MacGill has opened up about the toll of his legal troubles on his life and family. He reveals how anxiety and isolation have affected him and his children while he tries to rebuild through cricket coaching."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/satwik-chirag-lakshya-sen-badminton-japan-open-second-round-2756478-2025-07-16",
      "headline": "Satwik-Chirag, Lakshya Sen cruise into second round of Japan Open 2025India's campaign at the Japan Open 2025 began on a high note, with Satwik-Chirag and Lakshya Sen cruising into the second round after impressive straight-game wins in their respective men's doubles and singles matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-isl-uncertain-future-statement-bengaluru-fc-indian-football-2756537-2025-07-16",
      "headline": "Sunil Chhetri's first reaction over ISL's uncertain future: Very concerningIndian Super League: Sunil Chhetri urged calm and unity across Indian football as uncertainty looms over the ISL's future, expressing faith in the AIFF and FSDL to find a solution that protects the sport's growth and stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-docked-two-wtc-points-slow-over-rate-lords-test-2756513-2025-07-16",
      "headline": "England penalised two WTC points for slow overrate in Lord's Test against IndiaEngland have been docked two ICC World Test Championship points for a slow over rate in the Lord's Test against India. This penalty has pushed England down to third place, affecting their championship hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-early-exit-japan-open-2025-lakshya-sen-satwik-chirag-win-2756506-2025-07-16",
      "headline": "Japan Open 2025: PV Sindhu crashes out in opening roundPV Sindhu's struggles continued as the two-time Olympic medallist crashed out in the first round of the Japan Open 2025 Super 750 tournament. In contrast, Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty registered commanding straight-game victories to advance to the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-macgill-cocaine-conviction-anxiety-family-impact-cricket-coaching-2756492-2025-07-16",
      "headline": "Stuart MacGill breaks silence on life after cocaine case: Worried for my kidsFormer Australian spinner Stuart MacGill has opened up about the toll of his legal troubles on his life and family. He reveals how anxiety and isolation have affected him and his children while he tries to rebuild through cricket coaching."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/satwik-chirag-lakshya-sen-badminton-japan-open-second-round-2756478-2025-07-16",
      "headline": "Satwik-Chirag, Lakshya Sen cruise into second round of Japan Open 2025India's campaign at the Japan Open 2025 began on a high note, with Satwik-Chirag and Lakshya Sen cruising into the second round after impressive straight-game wins in their respective men's doubles and singles matches."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}