{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-shine-again-after-slow-start-will-they-continue-to-rise-2811504-2025-11-01",
      "headline": "Gold and silver shine again after slow start. Will they continue to rise?After a dull opening, both gold and silver managed to regain some shine during the day. Will the upward trend continue?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-links-anil-ambani-rana-kapoor-in-rs-2796-crore-yes-bank-loss-case-2811693-2025-11-01",
      "headline": "CBI links Anil Ambani, Rana Kapoor in Rs 2,796-crore Yes Bank loss caseThe CBI has accused industrialist Anil Ambani of approving favours to Yes Bank founder Rana Kapoor's family, causing huge financial losses to the bank. This development highlights alleged corruption and risky investments linked to Ambani's companies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-466-points-nifty-below-25750-bel-jumps-4-2811380-2025-10-31",
      "headline": "Sensex, Nifty continue losing streak amid profit booking; BEL jumps 4%The S&P BSE Sensex closed 465.75 points lower at 83,938.71, while the NSE Nifty50 fell 155.75 points to 25,722.10. Selling pressure was broad-based, with most sectoral indices ending in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-crosses-full-subscription-on-day-1-qibs-drive-demand-2811374-2025-10-31",
      "headline": "Lenskart IPO crosses full subscription on Day 1; QIBs drive demandThe IPO opened today and closes on November 4. Lenskart has set a price band of Rs 382 to Rs 402 per share, with a lot size of 37 shares for retail bidders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-leads-indias-crypto-investments-in-q3-2025-report-2811359-2025-10-31",
      "headline": "Gen Z leads India's crypto investments in Q3 2025: ReportThe 18–25 age group has officially overtaken the 26–35 bracket as the most active investors in crypto. For them, digital assets are no longer a risky experiment — they're becoming part of a serious investment plan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/from-groww-to-icici-amc-key-ipos-to-watch-this-november-2025-2811333-2025-10-31",
      "headline": "From Groww to ICICI AMC: Key IPOs to watch this November 2025Bengaluru-based investing platform Groww is set to launch its IPO worth Rs 6,632.3 crore. The issue includes a fresh issue of Rs 1,060 crore and an offer for sale of Rs 5,572.3 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/5x-income-rule-first-home-loan-affordability-2811330-2025-10-31",
      "headline": "Buying your first house? Check the 5x annual income rule and avoid EMI trapA rising number of first-time buyers are running the affordability math more cautiously. From the 5X income rule to avoiding EMI strain, housing decisions are shifting toward sustainability rather than stretch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hni-india-rebrands-as-kokuyo-workplace-india-targets-leadership-in-asia-by-2030-2811280-2025-10-31",
      "headline": "HNI India rebrands as Kokuyo Workplace India, targets leadership in Asia by 2030The rebranding marks a key step in Kokuyo's plan to make India a central hub for its Asia-Pacific operations. The move comes after Kokuyo's acquisition of HNI India earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-crisis-employees-letter-salaries-unpaid-beer-cafe-investors-2811262-2025-10-31",
      "headline": "Employees unpaid, control slipping: Bira 91's bad hangoverThe taps are dry, employees unpaid, and investors have taken charge. The question isn't how Bira 91 got here anymore. It's whether it can get out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-loan-vs-gold-overdraft-which-one-truly-saves-you-money-2811260-2025-10-31",
      "headline": "Gold loan vs gold overdraft: Which one truly saves you money?Gold loans and gold overdrafts both help unlock the value of your jewellery when you need cash fast. But they don't work the same way — and one could quietly cost you more than you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-aadhaar-to-bank-rules-7-key-financial-changes-starting-november-1-2811219-2025-10-31",
      "headline": "From Aadhaar to bank rules: 7 key financial changes starting November 1As November begins, a fresh set of financial rules will come into effect that could impact your daily money matters. From Aadhaar updates and bank nomination changes to new GST slabs and card fees — here's a quick look at what's changing from November 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/air-india-seeks-rs-10000-crore-support-from-tata-singapore-airlines-after-crash-report-2811203-2025-10-31",
      "headline": "Air India seeks Rs 10,000 crore lifeline from Tata, SIA after crash: ReportThe request comes at a sensitive moment for the airline, which has been trying to rebuild its reputation, modernise its ageing fleet and streamline operations since being taken over by the Tata Group in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/meta-plans-record-30-billion-bond-sale-to-fund-costly-ai-push-2811194-2025-10-31",
      "headline": "Meta plans record $30 billion bond sale to stay ahead in AI rcaseThe move comes as Meta signals that its capital expenditure in 2026 will be \"notably larger\" than next year, underscoring how aggressively it is investing to stay ahead in the AI race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-2025-gmp-latest-price-band-and-should-you-apply-2811181-2025-10-31",
      "headline": "Lenskart IPO opens: Check GMP, price band, and should you apply?The total issue size is about Rs 7,278 crore, of which roughly Rs 2,150 crore is a fresh issue, while the rest is an offer for sale by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-future-outlook-precious-metals-volatility-rates-in-india-world-2811180-2025-10-31",
      "headline": "Gold prices shaky, silver steady. What next for precious metals?Gold is wobbling as the dollar strengthens, while silver holds firm on industrial demand cues. With central banks still buying and the Fed unpredictable, where do precious metals go next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-flat-in-volatile-trade-ntpc-falls-over-25-2811165-2025-10-31",
      "headline": "Sensex, Nifty open flat in volatile trade; NTPC, Cipla among top losersAt around 9:24 am, the S&P BSE Sensex was up just 21.15 points at 84,425.61, while the NSE Nifty50 edged higher by 7.35 points to 25,885.20. Broader market indices also hovered marginally higher, mirroring the lack of conviction at the headline level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-remain-stable-will-prices-gain-after-us-fed-rate-cut-2810903-2025-10-31",
      "headline": "Gold and silver prices remain stable: Will prices gain after US Fed rate cut?Gold and silver prices steadied on Thursday after a choppy start, as investors weighed the impact of the US Federal Reserve's latest rate cut and awaited further clarity on global economic cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-ceo-umang-vohra-to-exit-in-2026-coo-achin-gupta-named-successor-2810838-2025-10-30",
      "headline": "Cipla CEO Umang Vohra to exit in 2026; COO Achin Gupta named successorThe company said Achin Gupta, currently Cipla's Global Chief Operating Officer (COO), will take over as CEO and MD from April 1, 2026."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-revives-iconic-rk-studios-to-preserve-family-legacy-and-boost-mumbai-film-industry-2811739-2025-11-01",
      "headline": "Ranbir Kapoor to relaunch RK Studios with his directorial debut: Report Bollywood actor Ranbir Kapoor is preparing to relaunch the historic RK Studios, with plans for his directorial debut and collaborations involving top industry figures. The move marks a continuation of his family's cinematic legacy and aims to re-establish RK Studios as a creative force in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-directorial-debut-the-bads-of-bollywood-features-rajat-bedi-star-studded-cast-netflix-2811731-2025-11-01",
      "headline": "Farah Khan says Aryan Khan was obsessed with Rajat Bedi since childhood Farah Khan has spoken about Aryan Khan's decision to include Rajat Bedi in his first web series as a director, highlighting the personal connection and professional opportunity involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mass-jathara-review-old-formula-fresh-energy-and-ravi-teja-back-in-rhythm-2811684-2025-11-01",
      "headline": "Mass Jathara review: Old formula, fresh energy, and Ravi Teja back in rhythmRelease Date:Sat Nov 01, 2025 'Mass Jathara' isn't trying to fix the mass commercial template, it's embracing it. Ravi Teja headlines a celebration of entertainment and nostalgia where every whistle, punchline, and throwback moment feels intentional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-security-assessed-khalistani-threats-diljit-dosanjh-kaun-banega-crorepati-2811719-2025-11-01",
      "headline": "Central agencies assess threat to Amitabh Bachchan post Diljit meeting Agencies are evaluating security for Amitabh Bachchan following threats from Sikh separatist groups after his televised interaction with Diljit Dosanjh, as concerns rise over the safety of both public figures and upcoming events abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-stars-ambani-jamnagar-halloween-party-creative-costumes-2811713-2025-11-01",
      "headline": "Halloween 2025: Alia and Deepika unite as Nita Ambani channels Audrey Hepburn Bollywood stars marked Halloween 2025 with an elaborate celebration in Jamnagar, featuring high-profile guests and creative costumes. Notable appearances included Alia Bhatt as Lara Croft, Deepika Padukone as Lady Singham, and Nita Ambani as Audrey Hepburn, with fans and celebrities alike praising the standout looks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-epic-remastered-women-architects-kingdom-fate-ss-rajamouli-prabhas-anushka-shetty-ramya-krishnan-2811433-2025-11-01",
      "headline": "Baahubali The Epic is much more than tale of two brothers, it has women at its core SS Rajamouli's 'Baahubali: The Epic', though it is centred on Prabhas and Rana Daggubati, it is the women in their lives who call the shots. With the re-mastered film hitting the screens on October 31, the film yet again places focus on the women of Mahishmati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-celebrates-thamma-success-kids-are-my-best-critics-rashmika-mandanna-2811669-2025-10-31",
      "headline": "Ayushmann Khurrana celebrates Thamma's success: Kids are my best critics In an exclusive interaction with India Today, actor Ayushman Khurrana spoke about how his latest release 'Thamma' won the hearts of his children and became their favourite. The film also starring Rashmika Mandanna, released in theatres on October 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-malik-lashes-out-malti-chahar-after-she-calls-him-gutter-2811667-2025-10-31",
      "headline": "BB 19 Episode 69: Amaal Malik lashes out at Malti after she calls him gutter In the latest episode of 'Bigg Boss 19', Amaal Malik locks horns with Malti Chahar after she called him a gutter. On the other hand, Pranit More was declared the new captain of the house.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-nayanika-seal-their-love-in-a-dreamy-elegant-engagement-ceremony-allu-arjun-2811653-2025-10-31",
      "headline": "Allu Sirish and Nayanika's engagement is all about love, grace and family warmth Actor Allu Sirish shared pictures from his dreamy engagement with Nayanika. The event was attended by close friends and family members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-hand-that-rocks-the-cradle-maika-monroe-mary-elizabeth-winstead-on-chemistry-and-boundaries-2811624-2025-10-31",
      "headline": "The Hand That...: Maika Monroe, Mary Elizabeth Winstead on chemistry and boundaries In an exclusive interaction with India Today, 'The Hand That Rocks the Cradle' actors Maika Monroe and Mary Elizabeth Winstead spoke about their camaraderie and dynamics in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-indian-film-television-directors-association-condemns-mumbai-hostage-crisis-denies-rohit-arya-industry-link-2811599-2025-10-31",
      "headline": "Film and TV body condemns Mumbai hostage crisis, denies Rohit Arya's industry link The Indian Film & Television Directors' Association (IFTDA) issued a statement and denied Rohit Arya's links in the entertainment industry. The body stated that Arya is not affiliated with any recognised and registered body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-cena-to-shah-rukh-khan-will-never-forget-your-kindness-you-inspire-the-world-2811575-2025-10-31",
      "headline": "John Cena to SRK: Will never forget your kindness, you inspire the world WWE legend John Cena replied to Shah Rukh Khan with a special post on X. He thanked the superstar for his kindness and wrote how he continues to inspire the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/streaming-in-november-delhi-crime-3-to-stranger-things-5-whats-new-on-ott-2811477-2025-10-31",
      "headline": "Streaming in November: Delhi Crime 3 to Stranger Things 5, what's new on OTT November 2025 brings a powerhouse lineup of OTT releases – from 'Delhi Crime Season 3' and 'The Family Man 3' to 'Stranger Things 5'. Explore every major show and film premiering across Netflix, Prime Video, JioHotstar, SonyLIV, and more this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-taj-story-review-paresh-rawal-digs-deep-but-plot-collapses-halfway-through-2811476-2025-10-31",
      "headline": "The Taj Story review: Paresh Rawal digs deep, but plot collapses halfway throughRelease Date:Fri Oct 31, 2025 'The Taj Story', starring Paresh Rawal, tries to blend history, faith and courtroom drama, but ends up a confusing, poorly written mess that fails to deliver on any front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/orry-viral-sabrina-carpenter-imitation-suhana-khan-laughter-2811498-2025-10-31",
      "headline": "Orry's hilarious Sabrina Carpenter spoof with Suhana Khan goes viral. Watch Social media sensation Orry shared a viral video impersonating Sabrina Carpenter, prompting laughter from Suhana Khan and widespread fan reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-hospitalised-for-routine-check-up-actor-team-says-hes-doing-fine-2811481-2025-10-31",
      "headline": "Dharmendra hospitalised for routine check-up, actor's team shares update Veteran actor Dharmendra has been hospitalised ahead of his 90th birthday and is currently under observation at Mumbai's Breach Candy Hospital for routine tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rm-bts-leadership-empathy-intellect-emotional-intelligence-2811261-2025-10-31",
      "headline": "How BTS' RM became the leader Gen Z needs right now In this week's K-fix, we discuss how BTS' RM redefines modern leadership with honesty, intellect, and empathy. From his thoughtful lyrics to his UN speech and solo album Indigo, RM proves that true leadership isn't about control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-cheers-jemimah-rodrigues-after-cricketer-opens-up-on-anxiety-2811416-2025-10-31",
      "headline": "Deepika Padukone cheers Jemimah Rodrigues after cricketer opens up on anxiety Indian cricketer Jemimah Rodrigues opened up about her anxiety during the Women's World Cup 2025 semifinal. Actor Deepika Padukone praised her for being vulnerable at a public forum."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-becomes-1st-state-in-india-to-eradicate-extreme-poverty-chief-minister-announces-in-assembly-2811729-2025-11-01",
      "headline": "Kerala becomes first state in India to eradicate extreme povertyKerala has become the first state to eradicate extreme poverty, Chief Minister Pinarayi Vijayan announced in the state Assembly on Saturday on the occasion of its formation day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-hostage-crisis-rohit-arya-controversial-past-rent-dispute-erratic-behaviour-2811721-2025-11-01",
      "headline": "Skeletons tumble out: Mumbai hostage-taker's rental dispute, erratic behaviourRohit Arya, who held 17 children hostage at a Powai studio in Mumbai, has a controversial past. The 38-year-old was shot dead by police during the rescue operation.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/jharkhand-man-killed-in-saudi-arabia-jeddah-shootout-body-repatriation-2811687-2025-11-01",
      "headline": "Indian man, 27, dies in crossfire between cops, smugglers in Saudi ArabiaA 27-year-old Jharkhand man, Vijay Kumar Mahato, was killed in a crossfire between Saudi police and suspected liquor smugglers in Jeddah. Authorities are coordinating with the Indian embassy to bring back his body and seek compensation for his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-cleared-delhi-cloud-seeding-plan-after-experts-said-not-feasible-2811675-2025-11-01",
      "headline": "Who cleared a Rs 34-crore cloud seeding plan after experts said 'not feasible'?Three expert agencies advised against it. Delhi did it anyway, spending Rs 34 crore of public money on a winter cloud seeding experiment that produced no rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-odi-world-cup-final-2811695-2025-11-01",
      "headline": "Turning trolls into believers: Indian women's team makes people dream againBattling trolls and persistent questions about pay parity with the men's team, Harmanpreet Kaur and her players have transformed scepticism into belief. Anchored by composure and quiet resilience, they now stand on the brink of rewriting Indian cricket's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-raut-udhhav-sena-leader-health-update-pm-modi-well-wishes-speedy-recovery-2811579-2025-10-31",
      "headline": "Serious health issue, says Sanjay Raut; PM wishes him, he respondsSanjay Raut, a prominent face of Uddhav Thackeray's Shiv Sena (UBT) faction, will be temporarily absent from political activity in the coming weeks. Prime Minister Narendra Modi wished the senior leader a speedy recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/did-all-work-for-you-not-my-family-nitish-kumars-video-message-to-people-of-bihar-five-days-before-polls-2811714-2025-11-01",
      "headline": "Worked for all, not my family: Nitish Kumar's video message ahead of Bihar pollsIn a video message, Nitish Kumar slammed the Rashtriya Janata Dal (RJD) for 'jungle raj' during its 15-year-rule, saying the NDA government worked to improve law and order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/south-delhi-luxury-property-rise-colonial-planning-elite-zones-2811394-2025-11-01",
      "headline": "I am from South Delhi – why is the south side of every city posh?South side neighbourhoods in major Indian metros have long been associated with wealth and prestige. This status stems from deliberate colonial planning and continues to influence property values and urban identity today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/first-glp-1-drug-rybelsus-approved-by-fda-to-protect-against-heart-attacks-stroke-2811435-2025-11-01",
      "headline": "First GLP-1 drug approved to protect against heart attacks, strokeThe FDA has approved Rybelsus, the first oral GLP-1 receptor agonist, to reduce cardiovascular risk in type 2 diabetes patients. The drug can be prescribed to reduce major adverse cardiovascular issues even in patients who have not yet experienced these events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-make-me-pregnant-ad-fraud-contractor-goes-after-advertisement-loses-rs-11-lakh-in-return-2811625-2025-10-31",
      "headline": "Pune man accepts 'make me pregnant' online ad offer, ends up losing Rs 11 lakhA Pune-based contractor fell victim to cyber fraud after he lost Rs 11 lakh while accepting an offer online that sought a woman to be made pregnant in exchange for money. The scam is likely linked to a nationwide cyber racket known as the \"Pregnant Job\" or \"Playboy Service\" scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/saishiva-sankaran-indian-f4-racing-f1-dreams-max-verstappen-2811595-2025-11-01",
      "headline": "Max Verstappen fan Saishiva Sankaran hoping to race alongside idol in F1A young star in the making, Saishiva Sankaran shares his ultimate dream of making to Formula One and racing alongside his idol Max Verstappen. Saishiva has been making a splash in Indian Racing League with the Speed Demons Delhi team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-vice-president-jd-vance-halloween-meme-wife-usha-faith-controversy-2811688-2025-11-01",
      "headline": "Say thank you: JD Vance dresses up as his own viral meme on HalloweenUS Vice President JD Vance went viral after dressing as his own meme for Halloween, sharing light-hearted posts on TikTok and X. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-steam-room-trap-women-escape-door-lock-failure-tata-eureka-park-2811652-2025-10-31",
      "headline": "Noida women get trapped in sauna for an hour, escape by breaking door with rodThe incident took place at Tata Eureka Park Society in Sector 150, where the women, identified as Parul Chaturvedi and Taruna, had gone for a steam bath at the clubhouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/viral-video-shows-relatives-pushing-patient-on-stretcher-through-city-road-in-madhya-pradeshs-rewa-2811735-2025-11-01",
      "headline": "Viral video shows relatives pushing patient on stretcher through city roadA video from Rewa city showing a patient being wheeled out of a government hospital on a stretcher has sparked widespread concern and criticism. The incident has prompted an official probe into hospital security and management lapses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-bans-entry-of-older-commercial-goods-vehicles-other-states-from-saturday-november-1-caqm-delhi-ncr-air-pollution-grap-measures-2811587-2025-10-31",
      "headline": "Old commercial vehicles banned from Delhi streets today. Check which are allowedThe Delhi Transport Department said that BS-IV vehicles will no longer be permitted to ply on the streets of the capital starting today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/nvidia-samsung-and-hyundai-chiefs-dine-in-seoul-fried-chicken-beer-chimaek-summit-pics-video-2811385-2025-10-31",
      "headline": "Bomb shots and fried chicken: Nvidia, Samsung and Hyundai chiefs' night outNvidia's Jensen Huang, Samsung's Lee Jae-yong and Hyundai's Chung Euisun had a great time when they met for fried chicken and beer at Kkanbu Chicken in the Gangnam district. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-538-01-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/value-of-indian-degrees-how-caps-abroad-could-boost-the-value-of-indian-degrees-2811672-2025-11-01",
      "headline": "Will Indian degrees finally gain value as global doors are closing to students?With foreign campuses tightening their gates, India has been offered a rare chance to rethink higher education. Students and families have been watching closely. Will Indian universities step up and turn this moment into lasting value?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/why-were-always-chasing-one-instagram-trend-after-another-and-the-hidden-cost-behind-it-2810717-2025-11-01",
      "headline": "Why we're always chasing one trend after another (and the hidden cost behind it)Are you always looking for a new trend to follow? Does it leave you feeling exhausted? Constantly chasing the 'next big thing' can take a toll on your mental health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-epic-remastered-women-architects-kingdom-fate-ss-rajamouli-prabhas-anushka-shetty-ramya-krishnan-2811433-2025-11-01",
      "headline": "Baahubali The Epic is much more than tale of two brothers, it has women at its coreSS Rajamouli's 'Baahubali: The Epic', though it is centred on Prabhas and Rana Daggubati, it is the women in their lives who call the shots. With the re-mastered film hitting the screens on October 31, the film yet again places focus on the women of Mahishmati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-shine-again-after-slow-start-will-they-continue-to-rise-2811504-2025-11-01",
      "headline": "Gold and silver shine again after slow start. Will they continue to rise?After a dull opening, both gold and silver managed to regain some shine during the day. Will the upward trend continue?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-defends-remarks-on-wife-usha-vances-faith-says-she-is-not-a-christian-and-has-no-plans-to-convert-2811616-2025-10-31",
      "headline": "Usha isn't converting: JD Vance hits back at critics, calls outrage bigotryThe Vice President's response followed intense criticism over his recent remarks at a university event, where he said he hoped his wife, Usha, might one day share his Christian faith. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mass-jathara-review-old-formula-fresh-energy-and-ravi-teja-back-in-rhythm-2811684-2025-11-01",
      "headline": "Mass Jathara review: Old formula, fresh energy, and Ravi Teja back in rhythmRelease Date:Sat Nov 01, 2025'Mass Jathara' isn't trying to fix the mass commercial template, it's embracing it. Ravi Teja headlines a celebration of entertainment and nostalgia where every whistle, punchline, and throwback moment feels intentional."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-discharged-from-hospital-2811748-2025-11-01",
      "headline": "Recovering Shreyas Iyer discharged from Sydney hospital after minor surgery India batter Shreyas Iyer has been discharged from Sydney hospital on Saturday, November 1, the BCCI has informed. Iyer had undergone a minor procedure after bruising his spleen during the 3rd ODI match against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-abhishek-sharma-harshit-rana-2811740-2025-11-01",
      "headline": "Pathan calls for better game awareness after Abhishek Sharma after big blunder Abhishek Sharma was the lone fighter in India's 2nd T20I match against Australia in Melbourne. Irfan Pathan, however, was not happy with the batter's game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/saishiva-sankaran-indian-f4-racing-f1-dreams-max-verstappen-2811595-2025-11-01",
      "headline": "Max Verstappen fan Saishiva Sankaran hoping to race alongside idol in F1 A young star in the making, Saishiva Sankaran shares his ultimate dream of making to Formula One and racing alongside his idol Max Verstappen. Saishiva has been making a splash in Indian Racing League with the Speed Demons Delhi team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-fracture-comeback-india-vs-south-africa-2811717-2025-11-01",
      "headline": "I am fully recovered: Rishabh Pant gives green signal for Test return India wicketkeeper batter Rishabh Pant has given a green signal for his return to Test cricket. Pant said that he has fully recovered from his frustrating foot injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-odi-world-cup-final-2811695-2025-11-01",
      "headline": "Turning trolls into believers: Indian women's team makes people dream again Battling trolls and persistent questions about pay parity with the men's team, Harmanpreet Kaur and her players have transformed scepticism into belief. Anchored by composure and quiet resilience, they now stand on the brink of rewriting Indian cricket's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-t20i-lahore-saim-ayub-faheem-ashaf-salman-mirza-level-series-2811673-2025-10-31",
      "headline": "PAK vs SA: Saim Ayub, Faheem Ashraf star as Pakistan crush South Africa in 2nd T20I Pakistan bounced back in style as Salman Mirza and Faheem Ashraf destroyed South Africa's batting before Saim Ayub's fluent fifty sealed a nine-wicket win, setting up a thrilling series decider in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/saturday-nights-main-event-2025-match-card-cm-punk-vs-jey-uso-cody-rhodes-vs-drew-mcintyre-where-to-watch-2811705-2025-11-01-2811670-2025-10-31",
      "headline": "WWE Saturday Night's Main Event: Matchcard, livestreaming details and more The 41st edition of Saturday Night's Main Event is all set to emanate from the Delta Center in Salt Lake City, Utah, USA with four major titles being defended at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-super-cup-east-bengal-goalless-draw-mohun-bagan-semifinal-2811662-2025-10-31",
      "headline": "AIFF Super Cup: East Bengal hold Mohun Bagan to reach semifinals on goal difference East Bengal produced a disciplined defensive show to hold Mohun Bagan goalless and secure a semifinal spot in the AIFF Super Cup on goal difference, as Oscar Bruzon's men stood tall under late pressure in a tense Kolkata derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-dominate-zimbabwe-second-t20i-seal-series-2-0-2811659-2025-10-31",
      "headline": "ZIM vs AFG: Afghanistan seal series with seven-wicket in second T20I Afghanistan secured the T20I series against Zimbabwe with a comprehensive seven-wicket victory in Harare, chasing down 126 with two overs to spare. Rashid Khan was the star of the show with the ball as Afghanistan continued to impress in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-womens-test-matches-multi-day-domestic-games-devajit-saikia-2811660-2025-10-31",
      "headline": "BCCI committed to increasing women's Test matches and multi-day domestic games BCCI secretary Devajit Saikia reaffirmed the board's commitment to expanding women's red-ball cricket, hinting at more Test matches and multi-day domestic tournaments as the next step in developing the game across all levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-t20i-lahore-saim-ayub-faheem-ashaf-salman-mirza-level-series-2811673-2025-10-31",
      "headline": "PAK vs SA: Saim Ayub, Faheem Ashraf star as Pakistan crush South Africa in 2nd T20I Pakistan bounced back in style as Salman Mirza and Faheem Ashraf destroyed South Africa's batting before Saim Ayub's fluent fifty sealed a nine-wicket win, setting up a thrilling series decider in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/saturday-nights-main-event-2025-match-card-cm-punk-vs-jey-uso-cody-rhodes-vs-drew-mcintyre-where-to-watch-2811705-2025-11-01-2811670-2025-10-31",
      "headline": "WWE Saturday Night's Main Event: Matchcard, livestreaming details and more The 41st edition of Saturday Night's Main Event is all set to emanate from the Delta Center in Salt Lake City, Utah, USA with four major titles being defended at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-super-cup-east-bengal-goalless-draw-mohun-bagan-semifinal-2811662-2025-10-31",
      "headline": "AIFF Super Cup: East Bengal hold Mohun Bagan to reach semifinals on goal difference East Bengal produced a disciplined defensive show to hold Mohun Bagan goalless and secure a semifinal spot in the AIFF Super Cup on goal difference, as Oscar Bruzon's men stood tall under late pressure in a tense Kolkata derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-dominate-zimbabwe-second-t20i-seal-series-2-0-2811659-2025-10-31",
      "headline": "ZIM vs AFG: Afghanistan seal series with seven-wicket in second T20I Afghanistan secured the T20I series against Zimbabwe with a comprehensive seven-wicket victory in Harare, chasing down 126 with two overs to spare. Rashid Khan was the star of the show with the ball as Afghanistan continued to impress in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-womens-test-matches-multi-day-domestic-games-devajit-saikia-2811660-2025-10-31",
      "headline": "BCCI committed to increasing women's Test matches and multi-day domestic games BCCI secretary Devajit Saikia reaffirmed the board's commitment to expanding women's red-ball cricket, hinting at more Test matches and multi-day domestic tournaments as the next step in developing the game across all levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-wi-3rd-t20i-romario-shepherd-hat-trick-roston-chase-west-indies-3-0-sweep-2811658-2025-10-31",
      "headline": "Romario Shepherd hat-trick, Roston Chase heroics guide West Indies to 3-0 sweepWest Indies wrapped up a 3-0 T20 series sweep over Bangladesh as Roston Chase and Ackeem Auguste hit rapid fifties, and Romario Shepherd claimed a stunning hat-trick to cap off a dominant display in the series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dabang-delhi-kc-clinches-pro-kabaddi-league-season-12-title-historic-home-victory-2811654-2025-10-31",
      "headline": "Dabang Delhi claim PKL season 12 title with thrilling win over Puneri PaltanDabang Delhi K.C. clinched their second PKL title with a 31–28 win against Puneri Paltan in the Season 12 Final at Thyagaraj Indoor Stadium, Delhi. Delhi became the first home team since 2015 to win the Pro Kabaddi League in their own city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-womens-world-cup-final-ticket-update-dy-patil-stadium-2811649-2025-10-31",
      "headline": "Historic Women's World Cup final looms, but tickets still not on sale in Navi MumbaiTwo days before India and South Africa meet in the Women's World Cup final, ticket sales have yet to be opened, leaving eager fans refreshing browsers and wondering when they'll finally get the chance to be part of history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-south-africa-a-rishabh-pant-bat-flop-prenelan-subrayen-2811619-2025-10-31",
      "headline": "Rishabh Pant fails with bat on comeback, Test stars flop in BengaluruRishabh Pant made his return to competitive cricket with a disappointing outing for India A against South Africa in the first practice match in Bengaluru. Devdutt Padikkal and Sai Sudharsan also failed to make an impact as India were bowled out for 234, conceding a 75-run first-innings lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-viswanathan-anand-trophy-indian-grandmasters-2811610-2025-10-31",
      "headline": "Viswanathan Anand Trophy: FIDE World Chess Cup named after Indian greatThe FIDE World Chess Cup trophy, named the Viswanathan Anand Trophy, celebrates India's first Grandmaster, honouring his enduring legacy and the nation's rise as a global chess powerhouse. The World Cup will be held in Panjim from October 31 to November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-shubman-gill-t20i-consistency-yashasvi-jaiswal-bench-2811608-2025-10-31",
      "headline": "Gill needs to perform with Jaiswal being left on bench: Irfan PathanIrfan Pathan said that Shubman Gill will need to start to score consistently in T20Is as he is keeping Yashasvi Jaiswal waiting in the bench for his chance. Gill was dismissed for 5 runs in the Melbourne T20I against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2nd-t20i-ashwin-gambhir-arshdeep-team-selection-controversy-2811606-2025-10-31",
      "headline": "Can't understand how Arshdeep misses out: Ashwin rips into Gambhir for MCG blunderRavichandran Ashwin has criticised Gautam Gambhir and the Indian team management for repeatedly benching Arshdeep Singh despite his stellar record. Ashwin insists Arshdeep deserves a permanent spot, calling him India's best T20 bowler after Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-south-africa-2nd-t20i-ball-by-ball-commentary-babar-azam-lahore-2811592-2025-10-31",
      "headline": "Pakistan vs South Africa, 2nd T20I Highlights from LahorePakistan put up a comprehensive display with the ball to down South Africa for a small target. Saim Ayub led their charge to ensure that they complete the chase without any hiccups. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-viswanathan-anand-trophy-indian-grandmasters-2811610-2025-10-31",
      "headline": "Viswanathan Anand Trophy: FIDE World Chess Cup named after Indian greatThe FIDE World Chess Cup trophy, named the Viswanathan Anand Trophy, celebrates India's first Grandmaster, honouring his enduring legacy and the nation's rise as a global chess powerhouse. The World Cup will be held in Panjim from October 31 to November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-shubman-gill-t20i-consistency-yashasvi-jaiswal-bench-2811608-2025-10-31",
      "headline": "Gill needs to perform with Jaiswal being left on bench: Irfan PathanIrfan Pathan said that Shubman Gill will need to start to score consistently in T20Is as he is keeping Yashasvi Jaiswal waiting in the bench for his chance. Gill was dismissed for 5 runs in the Melbourne T20I against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2nd-t20i-ashwin-gambhir-arshdeep-team-selection-controversy-2811606-2025-10-31",
      "headline": "Can't understand how Arshdeep misses out: Ashwin rips into Gambhir for MCG blunderRavichandran Ashwin has criticised Gautam Gambhir and the Indian team management for repeatedly benching Arshdeep Singh despite his stellar record. Ashwin insists Arshdeep deserves a permanent spot, calling him India's best T20 bowler after Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-south-africa-2nd-t20i-ball-by-ball-commentary-babar-azam-lahore-2811592-2025-10-31",
      "headline": "Pakistan vs South Africa, 2nd T20I Highlights from LahorePakistan put up a comprehensive display with the ball to down South Africa for a small target. Saim Ayub led their charge to ensure that they complete the chase without any hiccups. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-2nd-t20i-abhishek-sharma-press-conference-melbourne-2811591-2025-10-31",
      "headline": "Knew Harshit Rana can bat, he hits me for sixes in training: Abhishek SharmaIND vs AUS, 2nd T20I: Speaking to the press after hitting a fifty in India's defeat in Melbourne, opener Abhishek Sharma said he was not surprised to see Harshit Rana chip in with the bat. Abhishek also backed India to win the Women's World Cup on Sunday in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/gavaskars-big-promise-will-sing-with-jemima-if-india-wins-world-cup-ytvd-2811581-2025-10-31",
      "headline": "Gavaskar's Big Promise: Will Sing With Jemima If India Wins World Cup!This special report focuses on the Indian women's cricket team's historic World Cup semi-final win against Australia, with insights from cricket legend Sunil Gavaskar on the stellar performances by Jemima Rodrigues and Harmanpreet Kaur. Mr. Gavaskar hailed the record-breaking chase, stating, 'It was exhilarating, absolutely, and thrilling, absolutely thrilling.' The analysis delves into Jemima Rodrigues' magnificent unbeaten century and her crucial partnership with Captain Harmanpreet Kaur that powered India to chase down a mammoth target of 339. Gavaskar highlights Jemima's all-round contribution, including critical fielding, and her mental fortitude, having been dropped earlier in the tournament. The report also covers Gavaskar's view that this victory signals the 'coming of age' for the team and his personal promise to sing a duet with Jemima if India lifts the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-india-vs-south-africa-womens-world-cup-final-prediction-2811572-2025-10-31",
      "headline": "Fanboy Abhishek Sharma backs India to win Women's World Cup final vs South AfricaWomen's World Cup 2025: Opener Abhishek Sharma backed India to beat South Africa in the grand final in Navi Mumbai. The batting star said that the men's team cricketers had followed the semi-final win over Australia from Melbourne, which hosted a T20I on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/jemima-redefined-strength-it-requires-vulnerability-to-be-strong-dr-shyam-bhat-ytvd-2811539-2025-10-31",
      "headline": "Jemima redefined strength; it requires vulnerability to be strong: Dr. Shyam BhatPsychiatrist Dr. Shyam Bhat discusses the larger significance of cricketer Jemima Rodrigues' recent statements on mental health. Dr. Bhat states, 'she actually redefined what strength actually means...you should be in touch with your feelings. A certain vulnerability is required in order actually to be strong.' The conversation explores how Rodrigues represents a new generation that is more open about mental health challenges. Dr. Bhat also addresses why women are often more vocal about their struggles, the societal pressure on men to suppress vulnerability, and the shift in organisations towards valuing empathic leadership over traditional command-and-control structures. The interview highlights resilience, the importance of seeking support, and the changing narrative around mental wellness in India, both in sports and corporate life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-cup-2025-jemimah-rodrigues-best-fielder-award-india-win-2811536-2025-10-31",
      "headline": "Jemimah extends winning run, wins best fielder medal after historic Australia triumphJemimah Rodrigues dazzled with both bat and fielding brilliance as India sealed a famous win to reach the World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-reaction-josh-hazlewood-out-of-t20i-series-india-australia-2025-10-31-2811533-2025-10-31",
      "headline": "Abhishek Sharma's priceless reaction knowing Hazlewood will miss rest of T20I seriesAbhishek Sharma had a priceless reaction to knowing that Josh Hazlewood will miss the remainder of the T20I series against India. Hazlewood will start his preparations for the Ashes series, which will begin next month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-criticises-india-benching-arshdeep-singh-t20i-loss-australia-2811517-2025-10-31",
      "headline": "Varun Aaron tears into India management for benching Arshdeep SinghFormer fast bowler Varun Aaron criticised India for not selecting Arshdeep Singh in the second T20I against Australia. The decision sparked debate as India lost by four wickets defending a low total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-mohsin-naqvi-bcci-icc-meeting-november-4-2811499-2025-10-31",
      "headline": "BCCI hopes Mohsin Naqvi returns Asia Cup trophy before ICC meeting on Nov 4BCCI secretary Devajit Saikia stated that the Indian cricket board would raise the matter at the International Cricket Council's quarterly meeting on 4 November should Asian Cricket Council (ACC) chairman Mohsin Naqvi fail to hand over the Asia Cup trophy prior to that date. India are yet to be presented with the silverware, despite more than a month having elapsed since the final on 28 September."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}