{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cbdt-extends-tax-audit-deadline-to-october-31-offers-relief-to-professionals-2793281-2025-09-25",
      "headline": "CBDT extends deadline for filing income tax audit reports to October 31CBDT said the move comes in response to representations from professional bodies, including Chartered Accountant associations, highlighting difficulties in completing audit reports on time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-sensex-nifty-fall-profit-booking-tata-motors-trent-2793269-2025-09-25",
      "headline": "Sensex tumbles over 500 points, Nifty falls below 25,000The Nifty 50 slipped 0.66% to 24,890.85, while the BSE Sensex eased 0.68% to 81,159.68, logging their longest losing run since early March. Over the past five sessions, the Nifty and Sensex have fallen 2.1% and 2.2%, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-investing-can-ai-really-beat-human-experts-2793260-2025-09-25",
      "headline": "Stock market investing: Can AI really beat human experts?At the India Today Conclave Mumbai 2025, experts discussed how AI is changing stock market investing, whether it can replace traditional methods, and what role human judgement will continue to play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-tips-how-not-to-lose-money-india-today-conclave-mumbai-experts-2793233-2025-09-25",
      "headline": "How not to lose money on the stock market? Experts answer at India Today ConclaveWith increasing participation in equities, especially after the strong returns of the past few years, experts mentioned the importance of patience, asset allocation and realistic expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-second-richest-man-pledges-to-give-away-95-percent-of-his-373-billion-fortune-2793200-2025-09-25",
      "headline": "World's second-richest man pledges to give away 95% of his $373 billion fortuneMuch of his philanthropy is channelled through the Ellison Institute of Technology (EIT), a for-profit organisation based at the University of Oxford. EIT works on global challenges such as healthcare, climate change, food insecurity, and AI research."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/where-are-indians-heading-this-festive-season-top-destinations-revealed-2793133-2025-09-25",
      "headline": "Where are Indians heading this festive season? Top destinations revealedCurious where Indians are planning to travel this festive season? From bustling international cities to iconic domestic spots, these are the destinations topping the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/physical-gold-vs-stocks-buying-jewellery-shares-dalal-street-choose-market-expert-view-manappuram-muthoot-2793138-2025-09-25",
      "headline": "Festive gold rush: Should you buy jewellery or gold stocks this season?Indians love buying gold, especially in the festive season. However, Dalal Street has also seen an upward trend, with positive domestic developments such as GST rate cuts and income tax reforms earlier in the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-high-court-denies-priya-kapur-plea-to-file-sanjay-kapur-asset-list-in-sealed-cover-2793054-2025-09-25",
      "headline": "Court questions Priya Kapur's plea to disclose Sunjay Kapur assets in sealed coverThe application was filed in the ongoing inheritance dispute involving Karishma Kapoor's children, who are claiming a share in their late father's personal assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-slips-from-record-high-3-factors-explained-2793036-2025-09-25",
      "headline": "Gold slips from record high. 3 factors explainedGold retreated from its record peak this week, leaving investors curious about what triggered the fall. Here are three key factors behind the dip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-complaints-surge-45-in-q2-as-health-policies-drive-cases-2793025-2025-09-25",
      "headline": "Insurance complaints surge 45% in Q2 as health policies drive cases: ReportRising disputes reveal persistent mis-selling and transparency gaps in India's insurance sector, with policyholders increasingly turning to platforms like Insurance Samadhan to assert rights and seek timely redressal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-the-itr-deadline-you-will-now-have-to-file-under-new-tax-regime-2792999-2025-09-25",
      "headline": "Missed the ITR deadline? You will now have to file under new tax regimeWondering what happens if you miss the ITR filing deadline? Did you know you'll automatically be shifted to the new tax regime, losing the option to choose the old one?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/best-sectors-to-invest-stock-market-dalal-street-right-now-best-picks-fmcg-bfsi-auto-2792962-2025-09-25",
      "headline": "Which are the best sectors to invest on Dalal Street right now? Check best picksFrom FMCG to NBFCs, railways, autos and even shipbuilders, analysts see opportunities across a range of sectors as Dalal Street faces volatility. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-khan-shooting-daayra-meghna-gulzar-prithviraj-sukumaran-2793166-2025-09-25",
      "headline": "Kareena Kapoor starts filming Meghna Gulzar's Daayra with Prithviraj Sukumaran Kareena Kapoor Khan has officially begun shooting for her 68th film 'Daayra', co-starring Prithviraj Sukumaran and directed by Meghna Gulzar. The crime thriller promises a powerful exploration of justice and societal realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-ram-charan-nani-on-pawan-kalyan-they-call-him-og-2793249-2025-09-25",
      "headline": "Blockbuster: Chiranjeevi, Ram Charan, Nani on Pawan Kalyan's They Call Him OG Telugu actors including Chiranjeevi, Ram Charan and others showered praise on the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/star-trek-actor-william-shatner-agency-denies-hospitalisation-claims-2793209-2025-09-25",
      "headline": "Star Trek actor William Shatner's agency denies hospitalisation claims Actor William Shatner's agency has denied reports of his hospitalisation following a medical emergency at his home. The actor is reportedly stable, dispelling circulating rumours about his health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/does-rajat-bedi-jaraj-saxena-in-the-bads-of-bollywood-reflect-his-backstory-2792742-2025-09-25",
      "headline": "Does Rajat Bedi's Jaraj Saxena in The Ba***ds of Bollywood reflect his backstory? Actor Rajat Bedi gets to play his backstory on-screen in his comeback with Aryan Khan's directorial debut 'The B***ds of Bollywood'. IndiaToday.in shares insights on how the satirical series redeems Rajat's on-screen archetype through nostalgia and an underdog narrative. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-x-reviews-pawan-kalyan-shines-film-struggles-in-second-half-2793124-2025-09-25",
      "headline": "They Call Him OG X reviews: Pawan Kalyan shines, but film struggles in second half Actor Pawan Kalyan's action-drama 'They Call Him OG' opened to mixed reviews on September 25, 2025. While fans praised the action, many found the story predictable and the second half disappointing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dostana-2-vikrant-massey-dharma-productions-teases-stylish-avatar-2793125-2025-09-25",
      "headline": "Dostana 2 brings Vikrant Massey to Dharma, actor teases his most stylish avatar yet Actor Vikrant Massey is set to break away from his common man image with 'Dostana 2'. The actor confirmed that he is doing his first film with Dharma Productions. 'Dostana 2' would also star 'The Ba***ds of Bollywood' actor Lakshya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-takes-a-dig-at-india-pak-matches-after-sardaarji-3-controversy-2793160-2025-09-25",
      "headline": "Diljit Dosanjh takes a dig at India-Pak matches after Sardaarji 3 controversy Diljit Dosanjh addressed the controversy surrounding his film 'Sardaarji 3' and the India-Pakistan cricket matches amid national tensions following the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khans-partner-gauri-spratt-snaps-at-paps-for-following-her-on-road-2793126-2025-09-25",
      "headline": "Leave me alone: Aamir Khan's partner Gauri snaps at paps for following her on road Aamir Khan's partner, Gauri Spratt, lost her cool with the paparazzi for following her on the road. She snapped at them and asked them to leave her alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-32-day-31-written-update-farrhana-bhatt-ashnoor-kaur-captaincy-contendership-2793019-2025-09-25",
      "headline": "Bigg Boss 19 episode 32: Farrhana beats Ashnoor, secures captaincy contendership Farrhana Bhatt secured her captaincy contendership this week in 'Bigg Boss 19' by beating Ashnoor Kaur in the drone task. She later had a huge fight with another contestant, Kunickaa Sadanand, after the latter called her selfish. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/teacher-turner-syndrome-kaun-banega-crorepati-inspiring-journey-2793005-2025-09-25",
      "headline": "KBC 17: Gujarat teacher shares Turner Syndrome struggle, hopes for motherhood Contestant Jigna Mokaria, a teacher with Turner syndrome, secured Rs 7,50,000 on 'Kaun Banega Crorepati' 17. She shared her experiences of societal judgment and her aspirations for motherhood via surrogacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-paid-previews-pawan-kalyan-smashes-pushpa-2-stree-2-records-2793056-2025-09-25",
      "headline": "They Call Him OG paid previews: Pawan Kalyan smashes Pushpa 2, Stree 2 records Pawan Kalyan's 'They Call Him OG' released in theatres on September 25. Ahead of the grand premiere, the film has managed to break 'Pushpa 2' and 'Stree 2' records with its paid previews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salman-khan-aamir-khan-two-much-premiere-lacks-spark-2793030-2025-09-25",
      "headline": "Two Much premiere falls flat, lacks fun even with Salman and Aamir on the couch Actors Salman Khan and Aamir Khan appeared in the premiere episode of 'Two Much' but failed to deliver expected excitement. Read more to see if the show is worth watching."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-rajat-bedi-emraan-hashmi-bobby-deol-aryan-khan-netflix-nostalgic-ride-cinephiles-2792835-2025-09-25",
      "headline": "The Ba***ds of Bollywood: A nostalgic ride for cinephiles 'The Ba***ds of Bollywood' is a celebration of old hits, OG villains and 2000s nostalgia. Cinephiles, especially Hindi cinema lovers, are taking a trip down memory lane, all thanks to debutant director Aryan Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-trigeminal-neuralgia-battle-gamma-knife-surgery-relief-2792963-2025-09-25",
      "headline": "Salman Khan recalls struggles with trigeminal neuralgia: Took hour to eat breakfast Salman Khan discussed his struggles with trigeminal neuralgia, a severe nerve disorder. The actor details the challenges of diagnosis and undergoing lengthy surgery on Kajol and Twinkle Khanna's show 'Two Much'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-breaks-silence-on-sardaarji-3-row-hania-aamir-pahalgham-attack-india-pak-match-2792968-2025-09-25",
      "headline": "A Punjabi and Sardar can never go against country: Diljit Dosanjh breaks silence Diljit Dosanjh recently broke the silence on the 'Sardaarji 3' controversy. He stated that Sikhs can never go against the nation and explained the reason behind his silence over the past few months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-finale-belly-conrad-and-the-love-that-it-was-2792620-2025-09-25",
      "headline": "The Summer I Turned Pretty Finale: Belly Conrad and the love that it was 'The Summer I Turned Pretty' finale gave us Belly and Conrad's long-awaited love story, messy, frustrating, unforgettable, and worth every season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varun-konidela-sai-tej-celebrate-og-in-theatre-sandeep-reddy-vanga-joins-watch-2792951-2025-09-25",
      "headline": "Varun Konidela, Sai Tej celebrate OG in theatre, Sandeep Vanga, Nani join. Watch Varun Konidela, Sai Tej celebrated Pawan Kalyan's 'OG' release in theatres. Several videos of the duo cheering and rooting for the film have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-asap-rocky-welcome-third-child-reveal-name-2792918-2025-09-25",
      "headline": "Rihanna and A$AP Rocky announce birth of third child, reveal baby's name Singer Rihanna and her partner, A$AP Rocky, announced the birth of their third child. The couple shared the first image of their child on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/slow-horses-5-review-an-engaging-spy-series-on-online-hate-radicalisation-2792874-2025-09-25",
      "headline": "Slow Horses 5 review: An engaging spy thriller on online hate, radicalisationRelease Date:Wed Sep 24, 2025 Slow Horses Season 5 series review: The fifth season of 'Slow Horses' on Apple TV + depicts Jackson Lamb and his team investigating shocking attacks in London. Is the espionage series worth your time? Here is our review."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ncb-sameer-wankhede-sues-bads-of-bollywood-defamation-shah-rukh-khan-netflix-aryan-khan-2793215-2025-09-25",
      "headline": "Sameer Wankhede vs Shah Rukh, sues Ba****ds of Bollywood makers for defamationThe suit seeks relief in the form of a permanent and mandatory injunction, a declaration, and damages over what Sameer Wankhede alleges is a \"false, malicious, and defamatory\" portrayal in the Netflix series \"Ba***ds of Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cannot-let-out-timing-of-vote-chori-surgical-strike-aaditya-thackeray-promises-rahul-gandhi-like-expose-mumbai-conclave-2025-2793057-2025-09-25",
      "headline": "Rahul Gandhi promised vote chori H-bomb, Aaditya Thackeray teases surgical strike\"We have already written to the EC before the elections last year over the sudden spike in voters, about missing voters and why the booths have been mismanaged,\" Aaditya Thackeray said while promising a Rahul Gandhi-like expose on the poll body soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/got-couch-what-cm-devendra-fadnavis-says-maharashtra-coalition-scope-of-adding-allies-shiv-sena-ncp-eknath-shinde-ajit-pawar-2793045-2025-09-25",
      "headline": "Got a couch, not chairs: Fadnavis on Eknath Shinde, Ajit Pawar ambitionsMaharashtra CM Devendra Fadnavis has projected confidence over his current coalition government with the Shiv Sena and the NCP even as he acknowledged the personal ambitions of respective political leaders. He emphasised that the BJP remains the central pole in the government in the state, and they don't have a \"kursi\" but a couch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/deal-worth-rs-66500-crore-for-97-tejas-mark-1a-jets-with-state-owned-hal-likely-to-be-signed-today-sources-2793135-2025-09-25",
      "headline": "Government signs deal for 97 Tejas Mark-1A jets worth Rs 62,370 croreThe mega deal worth Rs 62,370 crore has been officially signed today, notably just one day before the retirement of the Indian Air Force's last two squadrons of MiG-21 fighter jets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/drdo-agni-prime-test-launch-train-rail-based-launcher-defence-army-2793162-2025-09-25",
      "headline": "Did DRDO launch the Agni missile from a train? Yes and noDRDO described the development as a \"game changer,\" stating that the road-cum-rail missile system would act as a force multiplier for the nation's strategic forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-high-court-denies-priya-kapur-plea-to-file-sanjay-kapur-asset-list-in-sealed-cover-2793054-2025-09-25",
      "headline": "Court questions Priya Kapur's plea to disclose Sunjay Kapur assets in sealed coverThe application was filed in the ongoing inheritance dispute involving Karishma Kapoor's children, who are claiming a share in their late father's personal assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-assembly-elections-bjp-dharmendra-pradhan-poll-in-charge-haryana-odisha-assembly-pols-2793217-2025-09-25",
      "headline": "BJP banks on Haryana-tested Dharmendra Pradhan as Bihar poll in-chargeBJP has appointed Dharmendra Pradhan as the Bihar election incharge, backed by his proven track record of successfully leading the party's election campaigns in Odisha and Haryana. Under his leadership, the BJP secured significant victories in both states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-breaks-silence-on-sardaarji-3-row-hania-aamir-pahalgham-attack-india-pak-match-2792968-2025-09-25",
      "headline": "A Punjabi and Sardar can never go against country: Diljit Dosanjh breaks silenceDiljit Dosanjh recently broke the silence on the 'Sardaarji 3' controversy. He stated that Sikhs can never go against the nation and explained the reason behind his silence over the past few months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/im-32-and-dont-want-kids-but-what-if-i-regret-it-at-50-2793131-2025-09-25",
      "headline": "I'm 32 and don't want kids, but what if I regret it at 50?IF you are a DINK couple and silently carry the weight of this question, you might want to read this."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhumi-pednekar-vows-to-keep-working-till-her-last-breath-2793230-2025-09-25",
      "headline": "All 'no's I heard growing up shaped me: Bhumi Pednekar on challenges in cinemaActor Bhumi Pednekar spoke about bringing noticeable change and impact through her film as a part of her session titled 'Power of Presence in Changing Industry' on Day 1 of India Today Conclave Mumbai 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/car-with-explosives-goes-off-in-tel-aviv-several-injured-report-2793277-2025-09-25",
      "headline": "Car with explosives goes off in Tel Aviv, several injured: ReportA car exploded in Tel Aviv, Israel, on Thursday, injuring several people, Reuters reported, citing local media. The cause of the explosion is not yet known."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-ravindra-jadeja-vice-captain-squad-2793141-2025-09-25",
      "headline": "After stellar England Tests, Ravindra Jadeja made vice-captain for West Indies seriesIND vs WI: After a stupendous Test series against England where he scored over 500 runs, Ravindra Jadeja has been made the vice-captain for the Test series against the West Indies in the absence of Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/world-lung-health-day-lancelot-pinto-on-health-airborne-diseases-respiratory-illnesses-cough-tuberculosis-copd-2792624-2025-09-25",
      "headline": "I am a pulmonologist, I believe breathing clean air is not a privilege, but a RightOn World Lung Day, I would like to address the burning issue of how bad air affects our lungs and how small lifestyle changes can prevent major lung impairments. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ashram-swami-chaitanyananda-saraswati-molesation-scandal-indian-air-force-letter-students-abuse-2793130-2025-09-25",
      "headline": "Delhi ashram molestation scandal: Air Force letter alleging abuse adds new twistThe Delhi Police have intensified efforts to arrest Swami Chaitanyananda Saraswati, the former head of a management institute who is currently on the run after he was accused by more than 15 women of molestation, blackmail and intimidation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-woman-claims-cop-tracked-car-sent-disturbing-messages-instagram-horrifying-ordeal-video-2793224-2025-09-25",
      "headline": "Gurugram woman claims cop tracked her car, sent disturbing messages on InstagramContent creator Shiwangi Peswani narrated her horrifying experience in a video on Instagram, and also tagged the Gurugram Cyber Police in her post, which has now gone viral.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/dance-dollars-bribery-charges-auditor-lavish-trips-miami-new-york-us-rick-cabaret-dancer-sued-eric-langan-heres-more-2793032-2025-09-25",
      "headline": "Lap dances as bribes: Why America's only listed strip-club empire is crumblingLap dances, lavish trips, and \"dance dollars\" helped build Eric Langan's publicly traded strip-club empire, but now the CEO and his top executives face tax fraud cases and lawsuits from dancers. Once celebrated as a Wall Street-friendly business pioneer, Langan's empire is crumbling now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/pawan-kalyan-they-call-him-og-review-gangster-drama-sujeeth-thaman-2792870-2025-09-25",
      "headline": "They Call Him OG review: Pawan Kalyan lifts predictable film with unmatched auraRelease Date:Thu Sep 25, 2025They Call Him OG movie review: Director Sujeeth's 'They Call Him OG' is a fan-service to Power Star Pawan Kalyan. The gangster drama, with a Japanese connection, has redundant ideas but is lifted by rousing elevation sequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-reveals-how-brahmin-caste-identity-irrelevant-2-maharashtra-maratha-protest-jarange-patil-pm-modi-2793175-2025-09-25",
      "headline": "Deva Bhau reveals how a Brahmin came to lead Maratha-dominated MaharashtraMaharashtra CM Devendra Fadnavis, who belongs to the Brahmin community, revealed how he overcame caste-based political hurdles to lead the Maratha-dominated state where his community makes up just 2% of the population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-trigeminal-neuralgia-battle-gamma-knife-surgery-relief-2792963-2025-09-25",
      "headline": "Salman Khan recalls struggles with trigeminal neuralgia: Took hour to eat breakfastSalman Khan discussed his struggles with trigeminal neuralgia, a severe nerve disorder. The actor details the challenges of diagnosis and undergoing lengthy surgery on Kajol and Twinkle Khanna's show 'Two Much'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/iphone-17-pro-max-review-phenomenally-good-2793127-2025-09-25",
      "headline": "iPhone 17 Pro Max review: Phenomenally goodApple launched the iPhone 17 Pro Max, along with other new iPhones, a couple of weeks ago. This is an expensive phone, but also the one that is arguably the best you can get. Or so we find in this iPhone 17 Pro Max review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-finale-belly-conrad-and-the-love-that-it-was-2792620-2025-09-25",
      "headline": "The Summer I Turned Pretty Finale: Belly Conrad and the love that it was'The Summer I Turned Pretty' finale gave us Belly and Conrad's long-awaited love story, messy, frustrating, unforgettable, and worth every season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-government-pinarayi-vijayan-class-10-social-science-textbook-governor-nominal-head-powers-tussle-raj-bhavan-2793020-2025-09-25",
      "headline": "Governor not the boss: Kerala govt's textbook reply amid power tussleThe Pinarayi Vijayan-led LDF government in Kerala has been in a long-running feud with governors. The Kerala government has now added a module to the Class 10 social science textbook, explaining the governor's powers and limits, calling them a \"nominal head\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-mumbai-2025/story/bjp-president-election-devendra-fadnavis-on-rss-chief-mohan-bhagwat-remark-on-suspense-over-bjp-president-2793022-2025-09-25",
      "headline": "Devendra Fadnavis explains RSS chief's remark on delay in picking BJP PresidentAt the India Today Conclave, Maharashtra Chief Minister Devendra Fadnavis said the RSS chief's remark signalled that BJP alone decides its president, not the Sangh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/slow-horses-5-review-an-engaging-spy-series-on-online-hate-radicalisation-2792874-2025-09-25",
      "headline": "Slow Horses 5 review: An engaging spy thriller on online hate, radicalisationRelease Date:Wed Sep 24, 2025Slow Horses Season 5 series review: The fifth season of 'Slow Horses' on Apple TV + depicts Jackson Lamb and his team investigating shocking attacks in London. Is the espionage series worth your time? Here is our review."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-justice-for-abhimanyu-easwaran-snub-ajit-agarkar-2793286-2025-09-25",
      "headline": "Justice for Abhimanyu Easwaran: Fans criticise WI series snub, Agarkar explains call Fans have labelled Abhimanyu Easwaran's omission from the India squad for West indies Tests as pure \"injustice\" to the batter. Ajit Agarkar explained the call, citing no need for an extra opener."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-varun-chakravarthy-ring-of-fire-dubai-drop-catches-press-conference-2793276-2025-09-25",
      "headline": "Varun Chakravarthy blames Ring of Fire in Dubai for India's drop catches Asia Cup 2025, IND vs BAN: Varun Chakravarthy said that the Ring of Fire in Dubai has made it tough for the Indian fielders to take catches in the ongoing tournament. On Wednesday, India beat Bangladesh by 41 runs to qualify for the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-joins-sydney-thunder-bbl-15-david-warner-influence-2793251-2025-09-25",
      "headline": "Clarity on role, David Warner mindset: R Ashwin on Thunder move R Ashwin explained why he decided to make the move to join Sydney Thunder as he created history with his move to join the Big Bash League franchise. Ashwin became the first player to represent India to play in the franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-key-takeaways-ajit-agarkar-rishabh-pant-jasprit-bumrah-2793234-2025-09-25",
      "headline": "IND vs WI: 10 key takeaways from Ajit Agarkar's Test squad announcement Ajit Agarkar confirmed during the squad announcement Rishabh Pant will return as India's vice-captain once fit. Jasprit Bumrah is available for both Tests against West Indies, while Mohammed Shami misses out due to limited recent match practice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-mohammed-shami-test-snub-agarkar-pace-bowling-future-2793235-2025-09-25",
      "headline": "Shami snub, India's fast-bowling roadmap: Agarkar explains big squad calls Ajit Agarkar explained why Mohammed Shami was snubbed from the squad for the upcoming series against the West Indies. Agarkar also revealed India's pace bowling roadmap going forward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-appoint-lisa-keightley-head-coach-womens-premier-league-2793205-2025-09-25",
      "headline": "Mumbai Indians name two-time world champion as head coach for WPL Mumbai Indians have named Lisa Keightley as their new head coach for the Women's Premier League. Her appointment aims to build on MI's success and maintain their dominance in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-available-west-indies-tests-ajit-agarkar-india-squad-2793170-2025-09-25",
      "headline": "No workload management: Jasprit Bumrah available for both West Indies Tests IND vs WI: India's chief selector Ajit Agarkar confirmed that Jasprit Bumrah is fully fit and available for both Tests against the West Indies, having had sufficient rest after missing the fifth England Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-india-a-captaincy-odi-leader-no-confirmation-potential-leader-ajit-agarkar-2793173-2025-09-25",
      "headline": "Shreyas Iyer's India A captaincy not a confirmation of ODI leadership: Ajit Agarkar Shreyas Iyer's appointment as the India A captain for the unofficial one-day series vs Australia A fuelled talks of him being in line for ODI leadership. Ajit Agarkar, however, dismissed captaincy speculation, clarifying Iyer's India A role doesn't guarantee him the ODI leadership mantle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-karun-nair-exclusion-west-indies-test-squad-devdutt-padikkal-ajit-agarkar-2793159-2025-09-25",
      "headline": "End of the road for Karun Nair in Tests? Agarkar explains West Indies squad snub Karun Nair's exclusion from the India squad for the West Indies series was explained by Chief selector Ajit Agarkar. Karun failed to make his mark during the England tour, where he played four out of five Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-ravindra-jadeja-vice-captain-squad-2793141-2025-09-25",
      "headline": "After stellar England Tests, Ravindra Jadeja made vice-captain for West Indies series IND vs WI: After a stupendous Test series against England where he scored over 500 runs, Ravindra Jadeja has been made the vice-captain for the Test series against the West Indies in the absence of Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-appoint-lisa-keightley-head-coach-womens-premier-league-2793205-2025-09-25",
      "headline": "Mumbai Indians name two-time world champion as head coach for WPL Mumbai Indians have named Lisa Keightley as their new head coach for the Women's Premier League. Her appointment aims to build on MI's success and maintain their dominance in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-available-west-indies-tests-ajit-agarkar-india-squad-2793170-2025-09-25",
      "headline": "No workload management: Jasprit Bumrah available for both West Indies Tests IND vs WI: India's chief selector Ajit Agarkar confirmed that Jasprit Bumrah is fully fit and available for both Tests against the West Indies, having had sufficient rest after missing the fifth England Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-india-a-captaincy-odi-leader-no-confirmation-potential-leader-ajit-agarkar-2793173-2025-09-25",
      "headline": "Shreyas Iyer's India A captaincy not a confirmation of ODI leadership: Ajit Agarkar Shreyas Iyer's appointment as the India A captain for the unofficial one-day series vs Australia A fuelled talks of him being in line for ODI leadership. Ajit Agarkar, however, dismissed captaincy speculation, clarifying Iyer's India A role doesn't guarantee him the ODI leadership mantle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-karun-nair-exclusion-west-indies-test-squad-devdutt-padikkal-ajit-agarkar-2793159-2025-09-25",
      "headline": "End of the road for Karun Nair in Tests? Agarkar explains West Indies squad snub Karun Nair's exclusion from the India squad for the West Indies series was explained by Chief selector Ajit Agarkar. Karun failed to make his mark during the England tour, where he played four out of five Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-ravindra-jadeja-vice-captain-squad-2793141-2025-09-25",
      "headline": "After stellar England Tests, Ravindra Jadeja made vice-captain for West Indies series IND vs WI: After a stupendous Test series against England where he scored over 500 runs, Ravindra Jadeja has been made the vice-captain for the Test series against the West Indies in the absence of Rishabh Pant. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}