{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-introduces-bankin-domain-for-indian-banks-to-tackle-financial-fraud-2676141-2025-02-07",
      "headline": "RBI introduces 'bank.in' domain for Indian banks to tackle financial fraudThe move aims to tackle growing financial fraud and cybercrime, prevent malicious activities, and strengthen the country's financial ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/after-5-years-rbi-cut-key-lending-rate-by-25-basis-points-to-625-2676083-2025-02-07",
      "headline": "After 5 years, RBI cut key lending rate by 25 basis points to 6.25%This marks the first rate cut since 2020 and the first policy decision under Governor Malhotra's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-home-loans-to-get-cheaper-as-rbi-cuts-rates-25-basis-points-625-percent-check-details-2676080-2025-02-07",
      "headline": "Home loans to get cheaper as RBI cuts rates. Check detailsThe RBI MPC reduced key lending rates by 25 basis points to 6.25%, the first rate cut in nearly five years under the leadership of newly appointed RBI Governor Sanjay Malhotra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-rate-interest-repo-cut-25-basis-points-625-per-cent-first-time-since-2020-2676071-2025-02-07",
      "headline": "RBI reduces key lending rate by 25 basis points to 6.25%The rate cut announced by the committee is the first since 2020. This was also the first policy meeting of Sanjay Malhotra as RBI Governor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-markets-opening-sensex-nifty-flat-as-investors-await-rbi-policy-decision-itc-down-2-percent-2676061-2025-02-07",
      "headline": "Stock markets open flat as investors await RBI policy decision; ITC down 2%The S&P BSE Sensex was down by 23.98 points to 78,034.18, while the NSE Nifty50 lost 7 points to 23,596.35 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-upi-services-unavailable-on-this-date-get-details-here-2675839-2025-02-06",
      "headline": "HDFC Bank UPI services unavailable on this date. Get details hereDuring the downtime, the UPI transactions on HDFC Bank's current and savings accounts and RuPay credit cards will be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06",
      "headline": "Zomato to be Eternal? Deepinder Goyal says company name change cleared by boardThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/default-on-personal-loan-check-consequences-impact-on-credit-score-hefty-penalty-legal-notice-2675670-2025-02-06",
      "headline": "What if you default on personal loan? Check consequencesPersonal loan default consequences: Banks or lenders impose hefty penalties, or late fee charges in case of a missed EMI amount. They may even impose higher interest charges and additional charges for collection efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-redeem-credit-card-points-check-2-simple-ways-online-banking-customer-service-helpline-2675748-2025-02-06",
      "headline": "Want to redeem credit card points? Check these 2 simple ways How to redeem credit card points: The number of credit card points one earns depends on the type of card, whether basic or premium, and the amount spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-sharply-as-dalal-street-remains-edgy-ahead-of-rbis-rate-decision-2675724-2025-02-06",
      "headline": "Sensex, Nifty fall sharply as D-Street remains edgy ahead of RBI's rate decisionThe S&P BSE Sensex closed 213.12 points lower at 78,058.16 and the NSE Nifty50 settled 92.95 points lower at 23,603.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-income-tax-regime-maximum-deductions-savings-calculations-explained-2675707-2025-02-06",
      "headline": "How much can you save with maximum deductions under old income tax regime?Old tax regime: What if someone earning above Rs 12.75 lakh annually chooses the old regime and claims the maximum deductions? Will it result in tax savings? This article explores the key deductions available under the old income tax regime and the maximum amount one can claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-should-you-choose-for-income-above-rs-12-lakh-2675644-2025-02-06",
      "headline": "Old vs New tax regime: Which one should you choose for income above Rs 12.75 lakh?Old vs New tax regime: What if you earn more than Rs 12.75 lakh? Should you pick the new tax regime for lower rates or stick to the old one for deductions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-what-is-it-and-how-will-it-help-taxpayers-2675626-2025-02-06",
      "headline": "New Income Tax Bill: What is it and how will it help taxpayers?In order to make the Income Tax Act 1961 more concise and simpler, the government is introducing a new income tax bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/union-cabinet-likely-to-approve-new-income-tax-bill-tomorrow-2675611-2025-02-06",
      "headline": "Union Cabinet likely to approve new Income Tax Bill tomorrowThe Union Cabinet is expected to clear the new Income Tax Bill tomorrow, paving the way for its introduction in the Lok Sabha"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-stock-price-today-falling-q3fy25-results-explained-2675613-2025-02-06",
      "headline": "Explained: Why Swiggy shares hit record low todaySwiggy shares dropped over 7% to hit a new 52-week low of Rs 387 on the Bombay Stock Exchange (BSE) in early trade. At around 11:37 am, Swiggy shares were down 4.16% lower at Rs 400.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bets-on-pro-business-policies-in-budget-2025-here-are-the-key-takeaways-business-friendly-reforms-2675596-2025-02-06",
      "headline": "India bets on pro-business policies in Budget 2025. Here are the key takeawaysOne of the most significant initiatives announced is the establishment of a High-Level Committee for transformative reforms across sector regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-will-senior-citizens-benefit-from-increased-tds-limits-on-interest-and-rental-payments-2675587-2025-02-06",
      "headline": "How will senior citizens benefit from increased TDS limits?The tax reforms announced in Budget 2025 aim at lowering the compliance burden for elderly taxpayers, and giving them enhanced financial flexibility and security in their retirement years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-likely-to-be-approved-by-cabinet-tomorrow-check-key-details-2675593-2025-02-06",
      "headline": "New Income Tax Bill likely to be approved by Cabinet tomorrow. Check key details The new legislation, often referred to as the Direct Tax Code, is aimed at overhauling the existing tax structure, making it more streamlined and transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-policy-decision-repo-rate-cut-likely-first-time-in-5-years-25-bps-2675563-2025-02-06",
      "headline": "Will RBI cut key rates for 1st time in 5 years? 4 things you need to knowRBI MPC: There are expectations that the central bank's MPC will decide on cutting the key rates for the first time in 5 years by 25 basis points (BPS)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-netflixs-the-trauma-code-a-breakout-hit-surpassing-squid-game-2-2676127-2025-02-07",
      "headline": "What makes Netflix's The Trauma Code a breakout hit surpassing Squid Game 2The Trauma Code: Heroes on Call has taken Netflix by storm, surpassing Squid Game Season 2 on the global chart. This medical drama captivates with its blend of intense medical scenarios, hospital politics, and humour, offering a fresh take on the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-long-note-on-bianca-censori-invisible-dress-grammy-controversy-2675906-2025-02-06",
      "headline": "Kanye West on Bianca Censori's nude dress controversy: Wife is so brave and hotKanye West defends his wife Bianca Censori's controversial invisible dress at the Grammy 2025, sharing a long note on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-sets-the-record-straight-on-55-kg-weight-loss-no-ozempic-just-hard-work-2675851-2025-02-06",
      "headline": "Ram Kapoor on 55 kg weight loss: No Ozempic, just hard workRam Kapoor's 55 kg weight loss has sparked widespread speculation about the methods he used. However, Kapoor clarified on social media that his transformation was achieved through hard work and dedication, dismissing the use of shortcuts like Ozempic or surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-season-2-review-equal-parts-dramatic-and-delectably-exciting-netflix-series-2675638-2025-02-06",
      "headline": "The Night Agent Season 2 review: Equal parts dramatic and delectably excitingReleased-Thu Jan 23, 2025In The Night Agent Season 2 on Netflix, a spy recruited by the most secretive body of the FBI, gets entangled in the mysteries of state secrets and in-house traitors. Peter Sutherland is back to save his country from falling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-on-ott-when-where-to-watch-nithya-menen-ravi-mohan-film-2675609-2025-02-06",
      "headline": "Kadhalikka Neramillai on OTT: When and where to watch Nithya Menen, Ravi Mohan filmNithya Menen and Ravi Mohan's Kadhalikka Neramillai is reportedly gearing up for its OTT debut on Netflix. The film was earlier released in theatres during the Pongal festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shiv-sena-mp-milind-deoras-woke-dig-at-grammys-for-not-honouring-zakir-hussain-2675559-2025-02-06",
      "headline": "Milind Deora's 'woke' dig at Grammys for not honouring tabla icon Zakir HussainShiv Sena leader and Member of Parliament Milind Deora took a dig at the Grammys for omitting Tabla maestro Zakir Hussain's name from their In Memoriam segment. Zakir Hussain, who died in December 2024, was a four-time Grammy winner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-kendrick-lamar-biggest-fight-rap-history-grammys-2025-2675551-2025-02-06",
      "headline": "Kendrick Lamar vs Drake: Did the Grammys settle the 'battle rap'?Rappers Kendrick Lamar and Drake's feud spans over a decade, with diss tracks, accusations, and a lawsuit. From collaborations to lyrical attacks, here's a full breakdown of their ongoing rap battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jisoo-of-blackpink-working-in-newtopia-gave-me-a-lot-of-confidence-2675539-2025-02-06",
      "headline": "Jisoo of BLACKPINK: Working in Newtopia gave me a lot of confidence The highly anticipated K-drama, Newtopia, featuring Park Jeong-min and BLACKPINK's Jisoo, debuts on February 7, 2025, blending a zombie apocalypse with a poignant love story. Jisoo opens up on her character and the differences between herself and Young-joo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-and-ar-rahman-perform-urvasi-urvasi-in-chennai-leave-fans-ecstatic-2675531-2025-02-06",
      "headline": "Ed Sheeran, AR Rahman perform Urvasi Urvasi in Chennai, fans ecstaticEd Sheeran's Chennai concert took an unforgettable turn when AR Rahman joined him on stage. The duo's surprise performance left the audience thrilled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-to-skip-the-bads-of-bollywood-promotions-2675386-2025-02-05",
      "headline": "Aryan Khan to skip The Bads of Bollywood promotions. How makers plan to compensateSuperstar Shah Rukh Khan's son, Aryan Khan, will not be a part of any promotional event for his debut series, the Netflix project, The Bads of Bollywood. The show is set to feature Bobby Deol, Mona Singh among others in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-piece-season-2-wraps-filming-netflix-shares-first-look-2675387-2025-02-05",
      "headline": "One Piece Season 2 filming wrapped. Netflix shares first look from the showNetflix has completed the filming of One Piece Season 2, and the main cast shared a celebratory image. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-on-ott-when-and-where-to-watch-sanya-malhotra-hindi-remake-of-great-indian-kitchen-stmp-2675365-2025-02-05",
      "headline": "Mrs on OTT: When and where to watch Sanya Malhotra's filmSanya Malhotra's Mrs, the Hindi remake of The Great Indian Kitchen, will release on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-says-coldplay-wanted-to-appear-on-his-show-sent-his-team-a-mail-2675358-2025-02-05",
      "headline": "Kapil Sharma says Coldplay reached out to appear on his showKapil Sharma recently revealed that British band Coldplay expressed their desire to take part in his show. The band was in India as part of their Music of Spheres tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-on-finding-love-again-staying-private-after-divorce-dating-ankita-kukreja-2675310-2025-02-05",
      "headline": "Aamir Ali opens up finding love again, staying private after divorceAamir Ali shared insights on finding love again after his divorce from Sanjeeda Shaikh. He talked about his emotional journey and staying private about his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/celebrity-masterchef-review-farah-khan-tejasswi-prakash-2675267-2025-02-05",
      "headline": "Too many celebs spoil the broth: Why Celebrity MasterChef is not palatableWhile Celebrity MasterChef offers entertainment, it lacks the raw authenticity that made the original MasterChef format so compelling. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-infiltrators-indian-line-of-control-killed-army-foiled-attack-2676192-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak ambush on Indian post foiled, 7 infiltrators killed along LOC: SourcesPak attack on Indian post foiled, 7 infiltrators killed on intervening night of Feb 4-5 along LOC: Sources"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-lieutenant-governor-orders-probe-aam-aadmi-party-operation-lotus-charge-bjp-assembly-elections-results-arvind-kejriwal-2676189-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Lt Governor orders probe into AAP's 'Op Lotus' charge against BJPOn Thursday, party MP Sanjay Singh claimed that the BJP offered Rs 15 crore each to seven AAP candidates to switch sides. Without revealing their names, he alleged that the candidates even received phone calls from the BJP, a day after the elections to the 70-member Assembly took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-supriya-sule-sanjay-raut-india-bloc-maharashtra-elections-discrepancy-voters-adult-population-election-commission-2676169-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi's Himachal twist while claiming anomaly in Maharashtra voter listRahul Gandhi, addressing a press briefing with Sanjay Raut and Supriya Sule, claimed in the five months between the Lok Sabha and Assembly polls, 39 lakh new voters were added in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-shivpuri-mirage-fighter-jet-crash-injured-pilot-communicates-2676021-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Injured Air Force pilot radios in after crash: 'Joshi, Jadhav bol raha hun'An Indian Air Force Mirage-2000 fighter jet crashed in Madhya Pradesh's Shivpuri district due to a system malfunction. Both pilots ejected safely with minor injuries. A viral video captured one pilot reporting the crash to Gwalior Airbase.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/pm-modi-congress-jawaharlal-nehru-freedom-of-speech-first-amendment-constitution-2676115-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a troubled Nehru restricted free speech with first amendment of ConstitutionIt was in 1951 that India's first Prime Minister, Jawaharlal Nehru, amended the Constitution for the first time, because the \"Constitution came in the way\" of urgent social changes. A look at what led to the first amendment of the Constitution, which curtailed the absolute freedom of speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/did-covid-19-change-the-moons-temperature-we-finally-know-what-happened-2676112-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Covid-19 lockdown on Earth change the Moon's temperature?Researchers have now revisited the study to see if the sudden break in human activity on Earth led to the cooling down of the Moon in  April and May of 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shreyas-iyer-odi-spot-admission-pundit-reaction-virat-kohli-2676087-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Iyer's ODI spot admission baffles pundits as line-up change looms in 2nd ODIIndia vs England: Shreyas Iyer revealed after the first ODI that he was not originally part of the playing XI in Nagpur. He stated that he replaced Virat Kohli in the India lineup after the batter suffered a knee injury. Iyer's admission baffled Akash Chopra.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/loveyapa-movie-review-junaid-khan-wonderfully-elevates-a-well-intentioned-romantic-comedy-2675936-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Loveyapa review: Junaid Khan wonderfully elevates a well-intentioned rom-comReleased-Fri Feb 07, 2025Director Advait Chandan's Loveyapa addresses the relevant problems of the generation - body-shaming, social media manipulation, gas-lighting, and deep-fakes. Junaid Khan makes an effortless big screen debut with the right story at the right time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-elections-arvind-kejriwal-aap-candidates-meeting-bjp-operation-lotus-2676076-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After AAP meeting, Manish Sisodia says BJP's abuse will stop post Delhi results After the meeting, which concluded at around 12:45 pm, Manish Sisodia said that BJP is a party of leaders who resort to hurling abuses. \"All their abuses will stop once the results are out tomorrow,\" said Sisodia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/siddaramaiah-wife-muda-cbi-probe-karnataka-high-court-relief-petition-seeking-investigation-land-scam-2676095-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Relief for Siddaramaiah: Karnataka High Court denies Muda case transfer to CBIKarnataka High Court dismissed the writ petition filed by RTI activist Snehamayi Krishna, seeking the transfer of the Mysore Urban Development Authority (Muda) site allocation case to the Central Bureau of Investigation (CBI). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-introduces-bankin-domain-for-indian-banks-to-tackle-financial-fraud-2676141-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI introduces 'bank.in' domain for Indian banks to tackle financial fraudThe move aims to tackle growing financial fraud and cybercrime, prevent malicious activities, and strengthen the country's financial ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jeet-adani-diva-shah-steal-the-show-with-bhangra-at-pre-wedding-celebrations-video-2676140-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Jeet Adani, Diva Shah steal the show with Bhangra at pre-wedding celebrationsJeet Adani will get married to Diva Jaimin Shah, daughter of a Surat-based businessman, today.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-plane-with-10-on-board-goes-missing-over-alaska-search-operations-on-2676086-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US plane with 10 on board goes missing over Alaska, search operations onThe Nome-bound plane took off from the Alaskan town of Unalakleet at 2:37 pm local time on late Thursday afternoon, 39 minutes before it disappeared from radar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/foldable-iphone-detailed-in-an-extensive-leak-what-should-you-expect-2676110-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Foldable iPhone detailed in an extensive leak: What should you expectThanks to a detailed writeup shared on X (formerly Twitter), we might have a clearer picture of what Apple's first foldable device could look like, its features, and its potential release timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/world-will-benefit-if-all-hindus-unite-regardless-of-caste-region-mohan-bhagwat-2676075-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World will benefit if all Hindus unite regardless of caste, region: Mohan BhagwatWhile addressing the Hindu Ekta Sammelan in Pathanamthitta, Kerala, RSS chief Mohan Bhagwat also said that all Hindus \"should be treated as one irrespective of their caste, region, or language\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pilot-surprises-girlfriend-romantic-proposal-flight-leaves-her-teary-eyed-viral-video-2676174-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Pilot surprises girlfriend with mid-flight proposal, leaves her teary-eyedThe heartwarming moment was documented by a fellow passenger on the flight and has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/if-trump-can-deport-illegal-indians-by-the-planeload-why-cant-modi-govt-evict-63-bangladeshis-2675717-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "If Trump can deport illegal Indians by the planeload, why can't Modi govt evict 63 Bangladeshis?The Supreme Court order to expedite foreigners' deportation from Assam runs into India's legal and diplomatic challenges in executing it, complicated by strained ties with Dhaka\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/pregnant-woman-sexually-assaulted-pushed-out-of-train-in-vellore-tamil-nadu-2676051-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pregnant woman sexually assaulted, pushed out of train in Tamil NaduA pregnant woman was sexually assaulted and pushed off a moving train in Tamil Nadu. She was on her way to Chittoor in Andhra Pradesh when the crime occurred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/fear-of-being-obsolete-fobo-how-indians-are-tackling-automation-anxiety-2675850-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fear of being obsolete (FOBO) is real: How Indians are tackling AI anxietyWith automation and AI changing jobs, many Indians fear becoming obsolete, as per a recent report. The best response to FOBO? Upskilling. Indian employees are turning to certifications and AI training to stay relevant in a shifting job market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-mehta-boys-review-boman-irani-avinash-tiwary-prime-video-2676052-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Mehta Boys review: Boman Irani's film is a moving lesson on love and lovingReleased-Fri Feb 07, 2025The Mehta Boys explores a complex father-son bond with realism and subtlety. Boman Irani impresses as both director and actor, while Avinash Tiwary shines. Though the resolution feels conventional, the film's authenticity makes it a refreshing watch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-fire-breaks-at-maha-kumbh-several-tents-affected-as-devotees-panic-2676117-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Another fire breaks at Maha Kumbh, over 20 tents burnt as devotees panicAnother fire broke out at Maha Kumbh on Friday in which several tents were affected. Devotees were seen panicking and running to shelter as fire tenders rushed to douse the flames. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/how-did-the-makhana-became-a-global-super-food-ft-makhana-board-2675820-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How did makhana become a global superfood?During the 2025 budget speech, Finance minister Nirmala Sitharaman announced the formation Makhana Board to boost the production, processing and marketing of fox nuts (also called black diamonds)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-high-court-allows-bs-yediyurappas-quash-petition-in-pocso-case-2676104-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court refuses to cancel Pocso case against Yediyurappa, grants pre-arrest bailIn a partial relief to former chief minister BS Yediyurappa, Karnataka High Court granted him anticipatory bail but refused to quash the Pocso case against him, sending the matter back to the trial court.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/conclave-review-riveting-thriller-ralph-fiennes-stanley-tucci-john-lithgow-carlos-diehz-2676016-2025-02-07",
      "headline": "Conclave review: A riveting Vatican thriller led by the genius Ralph FiennesReleased-Fri Feb 07, 2025Conclave, directed by Edward Berger, is a riveting political thriller set within the Vatican. Ralph Fiennes delivers a masterful performance, supported by a stellar cast, in this adaptation of Robert Harris' novel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thandel-x-review-internet-calls-naga-chaitanya-sai-pallavi-film-a-must-watch-stmp-2676183-2025-02-07",
      "headline": "Thandel X review: Internet calls Naga Chaitanya-Sai Pallavi film a must-watchThe verdict from the audience is here. Naga Chaitanya and Sai Pallavi's Thandel has seemingly struck a chord with the viewers. Here's what the internet is saying about the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-diplomat-teaser-john-abraham-is-master-of-persuasion-in-gripping-diplomacy-tale-2676177-2025-02-07",
      "headline": "The Diplomat teaser: John Abraham is master of persuasion in diplomatic thrillerThe Diplomat teaser: John Abraham will be seen in a different role in The Diplomat, where intellect triumphs over brawn. The film, based on true events, highlights the art of diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamta-kulkarni-shah-rukh-khan-salman-khan-karan-arjun-2676133-2025-02-07",
      "headline": "Mamta Kulkarni recalls SRK, Salman Khan 'sniggered' at her on Karan Arjun setMamta Kulkarni recalled Salman Khan shutting the door on her and Shah Rukh Khan and him laughing at her during Karan Arjun shoot. She also shared how she aced her shot while Salman and Shah Rukh struggled with multiple retakes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-board-update-saim-ayub-injury-new-zealand-tour-2676176-2025-02-07",
      "headline": "Pakistan Cricket Board issues crucial fitness update on injured Saim AyubThe Pakistan Cricket Board (PCB) has announced that opener Saim Ayub is making good progress in his recovery from a right ankle injury and will continue his rehabilitation in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ruben-amorim-manchester-united-winter-signings-big-risk-patrick-drogu-premier-league-2676156-2025-02-07",
      "headline": "Amorim admits major risk after Manchester United make only 2 January signingsManchester United manager Ruben Amorim admitted limiting January signings to just two players was a \"big risk,\" prioritising long-term stability over quick fixes, despite United's struggles and a growing injury crisis, including Lisandro Martínez's latest setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-is-leader-of-franchise-cricket-and-sa20-can-only-learn-from-them-graeme-smith-2676138-2025-02-07",
      "headline": "IPL is leader of franchise cricket and SA20 can learn from them: Graeme SmithSA20 commissioner Graeme Smith has committed to making it the world's second-best league, saying that the IPL remains the best league in franchise cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-anil-kumble-10-wickets-26-years-february-7-india-vs-pakistan-1999-2676114-2025-02-07",
      "headline": "When Anil Kumble stunned Pakistan with historic 10-wicket haulFebruary 7, 1999: India legend Anil Kumble emulated England off-spinner Jim Laker with a perfect 10-wicket haul in an inning against Pakistan in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-shreyas-iyer-confidence-set-the-tone-zaheer-khan-nagpur-2676109-2025-02-07",
      "headline": "Shreyas Iyer's confidence set the tone for India's Nagpur ODI: Zaheer KhanZaheer Khan hailed Shreyas Iyer's fearless knock in the Nagpur ODI, praising his confidence and resilience in India's chase. His aggressive innings played a key role in India's victory and strengthened his case for the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-special-general-meeting-on-march-1-to-elect-joint-secretary-2676103-2025-02-07",
      "headline": "BCCI convenes Special General Meeting on March 1 to elect joint secretaryThe Board of Control for Cricket in India (BCCI) has called a special general meeting (SGM) to nominate a new joint secretary. The SGM will be conducted in Mumbai on March 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shreyas-iyer-odi-spot-admission-pundit-reaction-virat-kohli-2676087-2025-02-07",
      "headline": "Shreyas Iyer's ODI spot admission baffles pundits as line-up change looms in 2nd ODIIndia vs England: Shreyas Iyer revealed after the first ODI that he was not originally part of the playing XI in Nagpur. He stated that he replaced Virat Kohli in the India lineup after the batter suffered a knee injury. Iyer's admission baffled Akash Chopra.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-carabao-cup-final-newcastle-united-after-tottenham-hotspur-win-2676059-2025-02-07",
      "headline": "Liverpool set up final against Newcastle United after thrashing SpursLiverpool booked their way to Wembley and a League Cup final against Newcastle United after defeating a lethargic Tottenham Hotspur 4-0 at Anfield on Thursday, and 4-1 on aggregate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aston-villa-premier-league-transer-news-winners-of-market-marcus-rahsford-marco-asensio-2676056-2025-02-07",
      "headline": "January Transfer Window: Are Aston Villa the true winners of the market?Aston Villa's ambitious January transfer window has seen them bring in high-profile yet inconsistent stars like Marcus Rashford and Marco Asensio. While the signings promise excitement, their success hinges on whether these players can rediscover their best form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-special-general-meeting-on-march-1-to-elect-joint-secretary-2676103-2025-02-07",
      "headline": "BCCI convenes Special General Meeting on March 1 to elect joint secretaryThe Board of Control for Cricket in India (BCCI) has called a special general meeting (SGM) to nominate a new joint secretary. The SGM will be conducted in Mumbai on March 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shreyas-iyer-odi-spot-admission-pundit-reaction-virat-kohli-2676087-2025-02-07",
      "headline": "Shreyas Iyer's ODI spot admission baffles pundits as line-up change looms in 2nd ODIIndia vs England: Shreyas Iyer revealed after the first ODI that he was not originally part of the playing XI in Nagpur. He stated that he replaced Virat Kohli in the India lineup after the batter suffered a knee injury. Iyer's admission baffled Akash Chopra.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-carabao-cup-final-newcastle-united-after-tottenham-hotspur-win-2676059-2025-02-07",
      "headline": "Liverpool set up final against Newcastle United after thrashing SpursLiverpool booked their way to Wembley and a League Cup final against Newcastle United after defeating a lethargic Tottenham Hotspur 4-0 at Anfield on Thursday, and 4-1 on aggregate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aston-villa-premier-league-transer-news-winners-of-market-marcus-rahsford-marco-asensio-2676056-2025-02-07",
      "headline": "January Transfer Window: Are Aston Villa the true winners of the market?Aston Villa's ambitious January transfer window has seen them bring in high-profile yet inconsistent stars like Marcus Rashford and Marco Asensio. While the signings promise excitement, their success hinges on whether these players can rediscover their best form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cristiano-ronaldo-retirement-message-marcelo-nostalgic-real-madrid-duo-fluminese-2676045-2025-02-07",
      "headline": "Cristiano Ronaldo sends heartfelt retirement message to MarceloCristiano Ronaldo paid an emotional tribute to Marcelo, recalling their iconic Real Madrid partnership as the legendary left-back retired at 36 after winning 25 trophies, including five Champions League titles, in a glittering career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-family-meet-president-droupadi-murmu-at-rashtrapati-bhavan-2676041-2025-02-07",
      "headline": "Sachin Tendulkar, family meet President Droupadi Murmu at Rashtrapati BhavanIndia batting great Sachin Tendulkar and his family met President Droupadi Murmu at the Rashtrapati Bhavan on Thursday. Sachin attended the Vimarsh Shrinkhala function alongside several other prominent figures and gave her his signed Indian Test jersey.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-to-play-afghanistan-at-champions-trophy-despite-boycott-calls-2676035-2025-02-07",
      "headline": "England to play Afghanistan at Champions Trophy despite boycott callsEngland will play their Champions Trophy match against Afghanistan later this month, the England Cricket Board (ECB) announced on Thursday, amid calls to boycott the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/hasrhit-rana-maiden-odi-wicket-plan-ben-duckett-india-vs-england-death-over-duties-2676031-2025-02-07",
      "headline": "Harshit's plan for maiden ODI wicket, death over duty: Ready for all rolesHarshit Rana reflects on his maiden ODI wicket, revealing how tactical variations in his bowling setup helped dismiss Ben Duckett, marking a memorable debut as India secured victory against England in the ODI series opener in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-champions-troohy-hits-form-different-captain-suresh-raina-2676029-2025-02-07",
      "headline": "If Rohit hits form before Champions trophy, will see a different captain: RainaSuresh Raina has claimed that Rohit Sharma will be a different kind of captain if he is able to find form before the start of the Champions Trophy. Rohit failed in the first ODI against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-first-odi-harshit-rana-debut-press-conference-nagpur-2675987-2025-02-06",
      "headline": "Always mentally prepared to play for India anytime: Harshit Rana after debutIndia pacer Harshit Rana claimed that he is always ready to represent the national side when called upon after his ODI debut in Nagpur against England on Thursday, February 6. Harshit, after a shaky start, bounced back in his second spell to pick up 3 wickets to restrict England to just 248 and set up India's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-match-highlights-report-shreyas-iyer-2675981-2025-02-06",
      "headline": "Who said what as Shreyas Iyer 2.0 strikes against short ball in NagpurShreyas Iyer's terrific knock set the base for India's win in the 1st ODI. After the match, Kevin Pietersen and Parthiv analysed Iyer's updated technique, which helped him face the short ball barrage from Jofra Archer and Saqib Mahmood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-harshit-rana-phil-salt-over-nagpur-press-conference-2675974-2025-02-06",
      "headline": "Harshit Rana shrugs off Nagpur horror over to Phil Salt: Part of the gameIndia pacer Harshit Rana shrugged off conceding 26 runs in an over to Phil Salt, saying that it is just part of the game at the end of the day. Despite the early setback, Harshit would produce a brilliant display in his second spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-champions-troohy-hits-form-different-captain-suresh-raina-2676029-2025-02-07",
      "headline": "If Rohit hits form before Champions trophy, will see a different captain: RainaSuresh Raina has claimed that Rohit Sharma will be a different kind of captain if he is able to find form before the start of the Champions Trophy. Rohit failed in the first ODI against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-first-odi-harshit-rana-debut-press-conference-nagpur-2675987-2025-02-06",
      "headline": "Always mentally prepared to play for India anytime: Harshit Rana after debutIndia pacer Harshit Rana claimed that he is always ready to represent the national side when called upon after his ODI debut in Nagpur against England on Thursday, February 6. Harshit, after a shaky start, bounced back in his second spell to pick up 3 wickets to restrict England to just 248 and set up India's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-match-highlights-report-shreyas-iyer-2675981-2025-02-06",
      "headline": "Who said what as Shreyas Iyer 2.0 strikes against short ball in NagpurShreyas Iyer's terrific knock set the base for India's win in the 1st ODI. After the match, Kevin Pietersen and Parthiv analysed Iyer's updated technique, which helped him face the short ball barrage from Jofra Archer and Saqib Mahmood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-harshit-rana-phil-salt-over-nagpur-press-conference-2675974-2025-02-06",
      "headline": "Harshit Rana shrugs off Nagpur horror over to Phil Salt: Part of the gameIndia pacer Harshit Rana shrugged off conceding 26 runs in an over to Phil Salt, saying that it is just part of the game at the end of the day. Despite the early setback, Harshit would produce a brilliant display in his second spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-1st-odi-nagpur-shreyas-iyer-funny-story-rohit-sharma-phone-call-virat-kohli-2675927-2025-02-06",
      "headline": "Cut movie-night short: Shreyas reveals late call to replace Virat in 1st ODIIndia batter Shreyas Iyer revealed that he was originally not a part of the playing XI in the 1st ODI vs England. Iyer said that he received a late-night phone call from Rohit Sharma, asking him to be ready to play in place of Virat Kohli in Nagpur.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-virat-kohli-injury-update-shubman-gill-nagpur-2675914-2025-02-06",
      "headline": "Virat Kohli injury update: Nothing to worry, he will play 2nd ODI, says Shubman GillShubman Gill has brushed aside any concerns about Virat Kohli's fitness and claimed that the star batter will definitely play the second ODI against England in Cuttack. Kohli suffered a knee injury, which ruled him out of the match in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-shubman-gill-lambi-race-ghoda-sanjay-manjrekar-nagpur-2675913-2025-02-06",
      "headline": "Shubman Gill 'lambi race ka ghoda', says Sanjay Manjrekar after Nagpur ODI heroicsIndia vs England, 1st ODI: Former India batter Sanjay Manjrekar heaped praise on Shubman Gill after the newly-appointed vice-captain hit a match-winning 87 in India's four-wicket win in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-odi-nagpur-score-shubman-gill-shreyas-iyer-rohit-sharma-fail-2675898-2025-02-06",
      "headline": "Rohit Sharma fails, but clinical India begin Champions Trophy prep in styleIndia vs England, 1st ODI: Rohit Sharma's return to ODI cricket ended in disappointment, but India had several positives in their four-wicket win in Nagpur on Thursday. Shubman Gill led India's successful chase of 249 after Ravindra Jadeja shone with the ball for the home team. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}