{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-halts-700-million-chip-plan-here-is-why-2718487-2025-05-02",
      "headline": "Zoho halts $700 million chip plan. Here's whyZoho, started in 1996, is known for offering affordable business software and services to companies around the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vizhinjam-port-pm-modi-inaugurates-why-its-important-for-india-shipping-global-trade-2718492-2025-05-02",
      "headline": "Vizhinjam port inaugurated: What makes it a strategic gem for IndiaThe Vizhinjam port has a natural sea depth of around 20 metres, making it suitable for very large ships without the need for deep digging, which is common in other ports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/npci-reduces-upi-response-time-payments-to-get-faster-from-june-16-what-it-means-for-you-2718441-2025-05-02",
      "headline": "UPI payments to get faster from June 16: What it means for youNPCI shared in its latest circular stated that from June 16, 2025, UPI users can expect quicker responses when checking the status of a transaction or reversing a payment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-at-strongest-since-october-2024-as-it-breaks-84-per-dollar-mark-2718379-2025-05-02",
      "headline": "Rupee at strongest since October 2024 as it breaks 84/dollar markThis marks a nearly 2% weekly gain for the rupee, powered by a sustained rally in Indian equities and growing optimism over an early US-India trade deal under the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-zomato-eternal-shares-are-rising-despite-78-percent-drop-in-q4-profit-2718371-2025-05-02",
      "headline": "Zomato shares rise despite 78% drop in Q4 profit. Should you buy, hold or sell?Eternal posted revenue of Rs 5,830 crore, broadly in line with analyst estimates. EBITDA margin slipped to 1.2%—falling short of expectations—but the company managed to maintain stable contribution margins in both food delivery and quick commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-share-price-rise-5-percent-enterprises-good-q4-results-boost-adani-stocks-2718368-2025-05-02",
      "headline": "Adani Group stocks rise up to 5%. Here's whyAdani Enterprises' shares climbed more than 2% on Friday after the company reported an increase in its net profit for the January–March quarter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-wall-street-rally-boosts-global-markets-2718360-2025-05-02",
      "headline": "Sensex gains 900 points. 3 reasons why stock market is rising todayThe S&P BSE Sensex was up 867.48 points at 81,109.72 around 10 am, while the NSE Nifty50 gained 247.90 points to trade at 24,582.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-jumps-450-points-nifty-above-24400-adani-ports-up-4-percent-2718356-2025-05-02",
      "headline": "Sensex, Nifty soar as trade deal hopes lift sentiment; FII buying boosts rallyThe S&P BSE Sensex went past the 81,000 mark while NSE Nifty50 was close to surpassing 24,600 level as Dalal Street surged in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-check-allotment-status-online-guide-latest-gmp-listing-gain-market-debut-date-2718355-2025-05-02",
      "headline": "Ather Energy IPO: Check allotment status, latest GMP and listing dateThe total number of bids received was 7,67,49,068 against the offer of 5,11,22,370 shares. Through the IPO, Ather Energy raised Rs 2,980.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-rise-or-fall-may-2-nse-bse-trading-fii-buying-2718350-2025-05-02",
      "headline": "Stock market opening today: Will Sensex, Nifty rise or fall on May 2?In the last two sessions, both Sensex and Nifty ended slightly lower. There was uncertainty among investors due to rising tension between India and Pakistan. However, markets are expected to start the day on a stronger note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-focus-eternal-zomato-tata-motors-adani-enterprises-infosys-mahindra-q4-2718333-2025-05-02",
      "headline": "Stocks to watch: Eternal, Tata Motors, Adani Enterprises, Infosys, MahindraBoth the Sensex and Nifty ended slightly lower in the last session, as cautious sentiment prevailed among investors over rising India-Pakistan tension. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-losses-pakistan-airspace-closure-shut-consequences-pahalgam-terror-attack-2718279-2025-05-01",
      "headline": "Air India expects $600 million in losses if Pak airspace shut for a year: ReportThe closure of Pakistani airspace for a year would result in losses of USD 600 million for the country's national carrier, Air India, news agency PTI reported, citing sources. The airline has sought the government's assistance to address the challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-makes-pravaah-portal-mandatory-for-financial-institutions-starting-may-2025-2718086-2025-05-01",
      "headline": "RBI makes PRAVAAH portal mandatory for financial institutions starting May 1The PRAVAAH portal provides all necessary forms, along with simple instructions. Users can submit their application, track its progress, and even get alerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gst-collection-record-high-april-data-rs-237-lakh-crore-rise-126-percent-tax-2718033-2025-05-01",
      "headline": "GST collections hit record Rs 2.37 lakh crore in April, up 12.6%In March, GST collections stood at Rs 1.96 lakh crore, showing a 9.9% rise from the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodha-founder-and-ceo-nithin-kamath-exposes-whatsapp-investment-scam-using-his-name-to-dupe-investors-details-here-2718012-2025-05-01",
      "headline": "Nithin Kamath exposes this scam using his name to dupe investors. Details hereZerodha's CEO Nithin Kamath has urged investors to stay alert, always check the source, and never act on random financial advice sent on messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-q4-results-net-profit-soars-50-percent-revenue-up-23-percent-share-price-2717975-2025-05-01",
      "headline": "Adani Ports Q4 results: Net profit soars 50%, revenue up 23%The company reported a 50% rise in its consolidated net profit, which stood at Rs 3,023 crore. This is an increase from Rs 2,025 crore reported in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-atm-charges-to-lpg-prices-5-key-financial-changes-to-know-in-may-2025-itr-forms-1-and-4-home-loan-rates-cut-2717964-2025-05-01",
      "headline": "From ATM charges to LPG prices: 5 key financial changes to know in May 2025Starting May 1, taking cash out from an ATM after your free monthly limit will cost you Rs 23 per transaction, up from the current Rs 21."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/eternal-q4-earnings-zomato-results-what-to-expect-january-to-march-quarter-profit-ebitda-2717951-2025-05-01",
      "headline": "Zomato Q4 earnings: What to expect from Eternal's January-March resultsAnalysts expect mixed numbers for the fourth quarter, mainly due to expected higher losses from its quick commerce arm, Blinkit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-does-not-always-glitter-this-ca-post-might-change-your-mind-2717923-2025-05-01",
      "headline": "'Gold doesn't always glitter': This CA's post might change your mindA CA pointed out a combination of global shocks, like COVID-19, wars, inflation fears, and central bank purchases, which all contributed to the price spike in the yellow metal since 2020."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musk-slams-report-claiming-tesla-looking-to-replace-him-2717885-2025-05-01",
      "headline": "'Deliberately false': Elon Musk slams report claiming Tesla looking to replace himElon Musk responded furiously on X, calling it \"an EXTREMELY BAD BREACH OF ETHICS\" and slamming the WSJ for \"publishing a DELIBERATELY FALSE ARTICLE\" despite receiving a prior denial from Tesla's board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vedanta-q4-profit-more-than-doubles-check-price-target-fy26-estimates-and-more-2717871-2025-05-01",
      "headline": "Vedanta Q4 profit more than doubles: Check price target, FY26 estimates and moreWith expansion projects nearing completion and deleveraging underway, analysts believe Vedanta is positioning itself for a stronger, leaner phase of growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-itr-forms-1-and-4-notified-for-fy-2024-2025-check-key-changes-who-can-file-2717870-2025-05-01",
      "headline": "New ITR Forms 1 and 4 notified for FY 2024-2025. Check key changes, who can fileITR-1, or Sahaj, is for resident individuals who have an overall income of not more than Rs 50 lakh a year and the income is from a salary or pension, single house property, or income like interest from bank deposits or fixed deposits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-allotment-status-online-guide-how-to-check-latest-gmp-listing-date-2717849-2025-05-01",
      "headline": "Ather Energy IPO: Step-by-step guide to check allotment status. See latest GMPThe electric scooter maker's public offer was just fully subscribed by the end of the final day of bidding, suggesting investors were not keen to put their money on another EV scooter maker, after Ola Electric's shares have not performed well since its market debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-leadership-crisis-ceo-resigns-accounting-scandal-2717838-2025-05-01",
      "headline": "Accounting lapse, high-profile exits: What's next for IndusInd Bank?As the dust settles on IndusInd Bank's derivatives debacle, the real test begins: can the bank restore trust, steady the ship, and convince investors it's back on course?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coca-cola-record-servings-maha-kumbh-180-million-q1-fy25-results-prayagraj-atlanta-2717829-2025-05-01",
      "headline": "Coca-Cola sells record servings at Maha Kumbh. The final number may shock youWhile saints and seekers looked for divine blessings, the world's biggest beverage giant looked across the Ganga's banks and found its biggest crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-today-maharashtra-day-sensex-nifty-trading-open-close-may-1-2717776-2025-05-01",
      "headline": "Sensex, Nifty holiday: Are stock markets open for trading today?There are also no market holidays in the months of June and July 2025, so investors can expect uninterrupted trading during this period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-milk-price-hike-mother-dairy-two-rupees-per-litre-2717659-2025-04-30",
      "headline": "After Mother Dairy, Amul hikes milk prices by Rs 2 per litreAfter Mother Dairy, Amul has also hiked the prices of its milk up to 2rs per litre. The new prices will come into effect from tomorrow, i.e., May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-is-king-says-mark-mobius-amid-trade-war-fears-backs-india-over-china-2717526-2025-04-30",
      "headline": "'Cash is king,' says Mark Mobius amid trade war fears, backs India over ChinaVeteran investor Mark Mobius believes that the uncertainty around the trade wars makes it risky to invest right now. However, he does see hope in countries like India, which he says could benefit as global supply chains shift away from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-46-points-lower-nifty-below-24400-bajaj-twins-fall-5-percent-2717501-2025-04-30",
      "headline": "Sensex closes 46 points lower, Nifty below 24,400; Bajaj twins fall 5%The S&P BSE Sensex was down by 46.14 points to end at 80,242.24, while the NSE Nifty50 lost 1.75 points to close at 24,334.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-today-fall-stock-market-investment-akshaya-tritiya-safe-haven-2717498-2025-04-30",
      "headline": "Can gold retain its glitter as Dalal Street gets back its glow?Just a week ago, gold was trading at record levels due to global uncertainty. Concerns over trade tensions, US tariffs, and geopolitical issues had pushed investors towards gold, a common choice during uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-public-listing-market-buzz-dalal-street-trading-lg-tata-zepto-reliance-hdfc-2717462-2025-04-30",
      "headline": "New wave of IPOs is coming. Is Dalal Street ready?Tata Capital, PhonePe, and Zepto are also said to be in the pipeline. Financial firms like HDB Financial Services and Hero FinCorp are planning to raise Rs 12,500 crore and Rs 3,668 crore, respectively. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rakuten-to-invest-over-100-million-dollars-in-india-plans-to-boost-hiring-by-8-percent-2717447-2025-04-30",
      "headline": "Rakuten to invest over $100 million in India, plans to boost hiring by 8%Rakuten currently employs 4,000 people in India, 90% of whom are tech staff, and plans to recruit people who it considers \"power users\" of AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-raises-atm-charges-rs-23-from-may-1-know-the-details-here-2717434-2025-04-30",
      "headline": "RBI raises ATM charges to Rs 23 from May 1: Know the details herePeople living in metro cities would get three free transactions per month, while those living in non-metro areas would get five free transactions per month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-rallies-strongest-2025-level-foreign-inflows-dollar-sales-2717421-2025-04-30",
      "headline": "Rupee jumps to highest level in 2025. Check factors behind strong rallyThe Indian rupee reached its highest level of 2025, driven by foreign inflows and exporter dollar sales. Optimism over US-India trade talks and a weakening US dollar further supported the currency's rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/if-we-look-closely-zoho-founder-and-ceo-sridhar-vembu-on-finding-rural-talent-2717362-2025-04-30",
      "headline": "'If we look closely...': Zoho's Sridhar Vembu on finding rural talentZoho's CEO, Sridhar Vembu, believes that India's path to development must include creating jobs and opportunities in smaller towns and villages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-group-stocks-trading-price-target-q4-results-brokerage-reports-2717352-2025-04-30",
      "headline": "5 Adani stocks get new targets after Q4 results: What should investors do?With Gautam Adani-led Adani Enterprises Ltd set to announce its earnings report soon, stock brokerages have already reviewed the performance of five listed companies from the group and shared fresh price targets and advice for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/varun-beverages-q4-results-key-things-to-expect-from-pepsico-bottler-2717316-2025-04-30",
      "headline": "Varun Beverages Q4 net profit at Rs 726 crore; firm announces interim dividendThe company posted a net profit of Rs 726 crore, up 35% year-on-year, driven by higher volumes and peak-season demand. Revenue for the quarter came in at Rs 5,680 crore, a 29% jump YoY, slightly ahead of most analyst estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vivad-se-vishwas-20-deadline-ends-today-last-call-to-settle-income-tax-disputes-2717298-2025-04-30",
      "headline": "Vivad Se Vishwas 2.0 deadline ends today: Last call to settle income tax disputesVivad Se Vishwas 2.0 is a dispute resolution scheme run by the Income Tax Department. It gives taxpayers a chance to settle ongoing tax-related cases by avoiding the prolonged litigation process and simply paying the disputed tax amount."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/akshaya-tritiya-2025-gold-price-today-should-you-buy-or-avoid-yellow-metal-rate-2717296-2025-04-30",
      "headline": "Akshaya Tritiya 2025: Is falling gold price an opportunity to buy more?Akshaya Tritiya is considered a good day to buy gold. But with gold prices now close to all-time highs, near Rs 96,000 per 10 grams, many buyers are thinking twice before making big purchases this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-day-3-latest-subscription-gmp-struggling-should-you-subscribe-2717291-2025-04-30",
      "headline": "Ather Energy IPO ends today: Should you subscribe or avoid?Ather Energy is struggling to generate investor interest, with sluggish IPO subscription levels and a muted grey market premium."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-prasad-dies-liver-disease-transplant-money-2718503-2025-05-02",
      "headline": "Malayalam actor Vishnu Prasad dies of liver diseaseMalayalam film and television actor Vishnu Prasad has passed away at the age of 49 in Kochi. He was undergoing treatment for liver-related issues and was awaiting a transplant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kull-the-legacy-of-raisingg-review-amol-parashar-ektaa-kapoor-ridhi-dogra-nimrat-kaur-royal-rivalries-dark-family-saga-2718419-2025-05-02",
      "headline": "Kull review: This game of thrones between siblings is dark and grittyReleased-Fri May 02, 2025Kull review: 'Kull-The Legacy Of Raisingghs', starring Amol Parashar, Nimrat Kaur and Ridhi Dogra, is now streaming on JioHotstar. The eight-episode drama explores how far a royal family will go when power is the ultimate prize. Read our review here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-apologised-son-taimur-making-him-watch-adipurush-jewel-thief-2718499-2025-05-02",
      "headline": "Saif Ali Khan says he apologised to son Taimur for making him watch AdipurushSaif Ali Khan recently revealed showing 'Adipurush' to his elder son, Taimur. The actor revealed he apologised to the little one after making him sit through the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-kylie-jenner-pda-is-unmissable-at-nba-games-2718485-2025-05-02",
      "headline": "Timothee Chalamet-Kylie Jenner turn heads with their PDA at NBA gamesTimothee Chalamet and Kylie Jenner are back in town with their PDA. The couple was clicked at the NBA Playoff game, enjoying courtside in a Los Angeles stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/oppenheimer-producer-charles-roven-india-global-reach-your-business-just-so-inside-india-2718467-2025-05-02",
      "headline": "Your business is just inside India: Oppenheimer producer on India's global reachHollywood producer Charles Roven stated that Indian films often fail to go global because they primarily focus on local audiences. Actor Aamir Khan agreed, adding that India needs more cinema screens to truly unlock its film industry's potential."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-blames-lack-of-theatres-for-bollywoods-box-office-struggles-2718461-2025-05-02",
      "headline": "Aamir Khan blames lack of theatres for Bollywood's box office strugglesDuring a discussion at WAVES Summit 2025, Bollywood superstar Aamir Khan opened up about the lack of theatres in India, calling it a long-standing issue Bollywood has faced over decades. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-slams-history-books-for-ignoring-southern-legacy-8-chapters-on-mughals-2718454-2025-05-02",
      "headline": "8 chapters on Mughals: R Madhavan slams history books for ignoring South legacyAmid the NCERT row, actor R Madhavan called out the education policymakers for dedicating 'eight chapters to Mughals' and excluding the legacy of the Southern kingdoms from history textbooks. He also mentioned that the curriculum gives less importance to the history of Jainism, Hinduism, and Buddhism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-telugu-vs-malayalam-film-debate-2718446-2025-05-02",
      "headline": "Actor Nani weighs in on Telugu vs Malayalam film debate | ExclusiveIn an exclusive chat with India Today, actor Nani shared his views on the differences between Telugu and Malayalam cinema, highlighting the box office success of Telugu films and the quality of Malayalam cinema. He appreciated the passion of both Telugu and Malayali audiences for films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-wishes-parents-dharmendra-hema-malini-45th-wedding-anniversary-2718443-2025-05-02",
      "headline": "Esha Deol wishes her 'world' Dharmendra-Hema Malini on 45th wedding anniversaryVeteran Bollywood couple Dharmendra and Hema Malini marked their 45th wedding anniversary on May 2. On the occasion, their daughter Esha Deol shared a heartfelt family picture to wish her 'world' on the big day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-to-those-harassing-kashmiris-you-are-validating-pak-propaganda-2718418-2025-05-02",
      "headline": "Javed Akhtar to those 'harassing Kashmiris': You are validating Pak propagandaPoet and lyricist Javed Akhtar recalled the Kargil War with Pakistan and blamed the neighbours for never wanting peace with India. He spoke at an event and slammed those 'harassing Kashmiris' after the Pahalgam terrorist attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-roasts-karan-johar-parenting-and-sports-skills-at-waves-summit-2025-2718393-2025-05-02",
      "headline": "SRK roasts Karan Johar's parenting and sports skills: You get trained firstAt the WAVES Summit 2025, Shah Rukh Khan playfully roasted Karan Johar during a fun-filled chat about parenting and attending their children's school events. Their friendship and fun banter stole the show, leaving the audience in splits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-thanks-fans-for-all-the-birthday-love-2718391-2025-05-02",
      "headline": "Anushka Sharma thanks fans for all the birthday love. See postActor Anushka Sharma shared a picture of herself on social media to express gratitude for the love she received on her birthday. The actor turned 37 on May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-pushpa-pose-being-first-south-indian-actor-to-sport-six-packs-waves-summit-2718382-2025-05-02",
      "headline": "Allu Arjun recreates Pushpa pose, admits being 1st South star with six-pack absAllu Arjun was one of the chief guests at WAVES Summit 2025 on Thursday in Mumbai. The actor recreated his iconic Pushpa pose, which received cheers from audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-vs-retro-box-office-collection-day-1-detailed-report-nani-and-suriya-films-make-a-roaring-start-2718380-2025-05-02",
      "headline": "HIT 3 vs Retro box office Day 1: Nani and Suriya's films make a roaring start 'HIT: The Third Case' and 'Retro' have taken over the box office in the South industry. Both films began on a solid note, with a double-digit opening, and are looking at fabulous first-weekend figures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sparsh-shrivastava-music-debut-ji-huzoor-tv-stint-facing-rejection-exclusive-2718209-2025-05-02",
      "headline": "Has Sparsh Shrivastava faced bias due to TV background? Actor answersSparsh Shrivastava, known for his roles in 'Laapataa Ladies' and 'Dupahiya', has ventured into music with his single 'Ji Huzoor', showcasing his diverse talents. In an exclusive interview, he opened up about his TV stint, facing rejections and pursuing music seriously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/hania-aamir-reacts-fake-post-blaming-pakistan-army-pahalgam-terror-attack-2718366-2025-05-02",
      "headline": "Assigning blame without proof...: Hania Aamir's dig at India over Pahalgam attackPakistani actor Hania Aamir, taking a swipe at India for holding Pakistan accountable for the Pahalgam attack, asserted that assigning blame without proof only 'deepens the divide'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-1-detailed-report-ajay-devgn-film-opens-strong-raises-bollywood-hopes-2718361-2025-05-02",
      "headline": "Raid 2 box office Day 1: Ajay Devgn's film opens strong, raises Bollywood's hopesAjay Devgn's 'Raid 2' has begun its box office journey on a fabulous note. The film received mixed reviews, but the audience gave it a positive chance to work well. It could be the first Bollywood film of the year to be looking at reaching the benchmark of Rs 100 crore in a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-racing-comeback-driver-team-owner-2718349-2025-05-02",
      "headline": "Ajith Kumar opens up about racing comeback and looking beyond films | ExclusiveAjith Kumar opened up about his dual career as a racing driver and team owner, revealing his passion for motorsports despite past challenges. He shared insights into his aspirations and the support he receives from family and teammates, in an exclusive chat with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/british-comedian-russell-brand-to-appear-in-london-court-today-on-rape-charges-2718336-2025-05-02",
      "headline": "British comedian Russell Brand to appear in London court today on rape chargesBritish actor-comedian Russell Brand will appear in a London court after being charged with rape and sexual assault in cases related to four women over two decades ago."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-vizhinjam-port-launch-pm-modi-takes-swipe-at-india-bloc-via-congress-mp-shashi-tharoor-2718452-2025-05-02",
      "headline": "'Many will lose sleep': PM Modi's jibe at INDIA bloc ft. Shashi TharoorAt the Vizhinjam port inauguration in Kerala, Prime Minister Narendra Modi used Congress MP Shashi Tharoor's presence to take a political dig at the Opposition's INDIA bloc, stirring fresh speculation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-entry-financial-action-task-force-grey-list-terror-funding-pahalgam-attack-2718402-2025-05-02",
      "headline": "India plans twin financial strikes on Pakistan to curb terror funding: SourcesIn the wake of the Pahalgam terror attack, sources said India is likely to actively pursue getting Pakistan back onto the Financial Action Task Force (FATF) grey list."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bilawal-bhutto-on-pakistans-links-with-terror-groups-dont-think-its-a-secret-2718482-2025-05-02",
      "headline": "Don't think it's a secret: Bilawal Bhutto on Pakistan's links with terror groupsBilawal Bhutto's remarks came during an interview with Sky News, where he responded to a question regarding earlier comments by Pakistan's Defence Minister Khwaja Asif on the country's link to terror groups. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-mangalore-former-bajrang-dal-member-surathkal-murder-accused-murdered-2718359-2025-05-02",
      "headline": "Tension grips Karnataka coastal city after ex-Bajrang Dal member hacked to deathA former Bajrang Dal member with a long criminal record was killed in a sword attack near Mangaluru, Karnataka. The incident created tension in the area, leading the police to heighten security, amid citywide bandh called by Hindu outfit VHP. s"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/hania-aamir-reacts-fake-post-blaming-pakistan-army-pahalgam-terror-attack-2718366-2025-05-02",
      "headline": "Assigning blame without proof...: Hania Aamir's dig at India over Pahalgam attackPakistani actor Hania Aamir, taking a swipe at India for holding Pakistan accountable for the Pahalgam attack, asserted that assigning blame without proof only 'deepens the divide'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rivers-in-pakistan-arent-drying-yet-here-is-why-2718197-2025-05-01",
      "headline": "Rivers in Pakistan aren't drying yet. Here's whyOfficial data and satellite imagery processed by India Today's Open-Source Intelligence (OSINT) team suggest rivers allocated to Pakistan under the IWT – the Indus, Chenab, and Jhelum (collectively called Western rivers) – continued to flow their normal course and speed as of April 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-national-prayer-day-christians-jews-muslims-divine-dreams-38-virgins-2718469-2025-05-02",
      "headline": "Trump, divine dreams and his miraculous 38 virginsOn National Prayer Day, US President Donald Trump sought \"divine dreams\" and discussed bringing \"religion back to the White House\". Then, he addressed Muslims and thanked them for voting for him in the 2024 Presidential election, and discussed a conversation with Imams of Michigan, involving \"38 virgins\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/adil-shah-exemplifies-kashmiriyat-and-insaniyat-says-pdps-iltija-mufti-2718449-2025-05-02",
      "headline": "Adil Shah exemplifies Kashmiriyat and insaniyat, says PDP's Iltija MuftiIn an exclusive interaction with India Today, PDP leader Iltija Mufti said that Syed Adil Shah exemplifies Kashmiriyat and humanity, who laid down his life protecting tourists during Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kull-the-legacy-of-raisingg-review-amol-parashar-ektaa-kapoor-ridhi-dogra-nimrat-kaur-royal-rivalries-dark-family-saga-2718419-2025-05-02",
      "headline": "Kull review: This game of thrones between siblings is dark and grittyReleased-Fri May 02, 2025Kull review: 'Kull-The Legacy Of Raisingghs', starring Amol Parashar, Nimrat Kaur and Ridhi Dogra, is now streaming on JioHotstar. The eight-episode drama explores how far a royal family will go when power is the ultimate prize. Read our review here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/four-dead-over-100-flights-delayed-why-did-it-rain-so-heavily-in-delhi-ncr-2718445-2025-05-02",
      "headline": "Why did it rain so heavily in Delhi-NCR? Weather department explainsThe India Meteorological Department (IMD) explained that this sudden weather change was due to a combination of factors involving moisture and wind patterns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-debunks-air-force-officers-sacking-claims-on-not-fighting-war-against-pak-2718313-2025-05-02",
      "headline": "Government fact-checks claims of Air Force officer's sacking over Pak war stanceThe government fact-checked claims by several pro-Pakistan social media accounts that said that Vice Chief of Air Staff Air Marshal Sujeet Pushpakar Dharkar was sacked for refusing to fight a war against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/weather-forecast-severe-thunderstorm-and-rain-alert-in-parts-of-north-east-south-india-2718299-2025-05-02",
      "headline": "Over 100 flights delayed, 4 dead as rain, strong winds batter Delhi-NCRDelhi-NCR was hit by heavy rainfall coupled with severe thunderstorms and gusty winds early on Friday. An orange alert is in place in the national capital, with flights being delayed due to the inclement weather conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ipl-2025-rr-vs-mi-feature-2718428-2025-05-02",
      "headline": "Vaibhav Suryavashi's quiet and long struggle just began yesterdayIPL 2025, RR vs MI: Vaibhav Suryavanshi set the Sawai Mansingh Stadium blaze with a 35-ball hundred against Gujarat Titans, but fell for a duck at the same venue on Thursday against the Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/waves-summit-2025-aamir-khan-kareena-kapoor-aishwarya-rai-bachchan-2718367-2025-05-02",
      "headline": "WAVES Summit 2025: Kareena Kapoor Khan says she enjoys being in BollywoodWAVES Summit 2025 live Day 2: PM Modi inaugurated the four-day summit in Mumbai on May 1. On the second day, celebrities including Aamir Khan, Aishwarya Rai Bachchan and Kareena Kapoor will take part in talk sessions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/muslim-castes-to-be-recorded-in-upcoming-census-but-not-quota-sources-2718404-2025-05-02",
      "headline": "Muslim castes to be recorded in upcoming census, but not quota: SourcesThe census work is expected to begin within the next two to three months. The deputation process for appointing officials will commence soon. Once all preparatory steps are completed, the actual census will be conducted within 15 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indias-response-to-pahalgam-terror-attack-should-avoid-regional-war-jd-vance-glbs-2718312-2025-05-02",
      "headline": "India's response to Pahalgam terror attack should avoid regional war: JD VanceUnderlining that India's response to last week's Pahalgam attack should avoid the risk of a broader regional conflict, US Vice President JD Vance hoped that Pakistan would work with India to track down terrorists who carried out the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-weather-heavy-rain-brings-relief-meme-storm-x-thunderstorm-videos-posts-2718444-2025-05-02",
      "headline": "Heavy rain brings relief for Delhi and a meme storm on X. See videos, postsAs #DelhiWeather occupied the top spot on the trends list on X, social media users posted clips, memes, and witty reactions documenting the dramatic shift in weather. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-wall-street-rally-boosts-global-markets-2718360-2025-05-02",
      "headline": "Sensex gains 900 points. 3 reasons why stock market is rising todayThe S&P BSE Sensex was up 867.48 points at 81,109.72 around 10 am, while the NSE Nifty50 gained 247.90 points to trade at 24,582.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-opens-attari-wagah-border-gate-after-24-hours-begins-taking-back-citizens-deported-india-pahalgam-terror-attack-2718396-2025-05-02",
      "headline": "Pak opens Attari-Wagah border gate, begins taking back its citizens from IndiaThe move came after nearly 24 hours of silence from Islamabad, during which several Pakistani nationals - many of them elderly or visiting family - were left in limbo on Indian soil despite New Delhi's readiness to facilitate their return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/amaravati-proposed-andhra-pradesh-greenfield-capital-city-construction-relaunch-revival-2718268-2025-05-02",
      "headline": "Amaravati revived: All you need to know about Andhra Pradesh's capital in makingAfter years of uncertainty, development of Andhra Pradesh's capital Amaravati is back on track. Revived by Chief Minister Chandrababu Naidu's 2024 return to power and fresh funding, Prime Minister Narendra Modi will relaunch the construction work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-roasts-karan-johar-parenting-and-sports-skills-at-waves-summit-2025-2718393-2025-05-02",
      "headline": "SRK roasts Karan Johar's parenting and sports skills: You get trained firstAt the WAVES Summit 2025, Shah Rukh Khan playfully roasted Karan Johar during a fun-filled chat about parenting and attending their children's school events. Their friendship and fun banter stole the show, leaving the audience in splits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-will-be-indian-astronaut-shubhanshu-shukas-callsign-on-ax-4-mission-in-space-2718411-2025-05-02",
      "headline": "This will be Indian astronaut Shubhanshu Shuka's callsign in spaceThe mission will launch from Kennedy Space Center in Florida aboard a SpaceX Falcon 9 rocket, propelling Shukla and his multinational crew 400 kilometers above Earth to the ISS. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/will-tariffs-make-iphones-more-expensive-tim-cook-reveals-2718347-2025-05-02",
      "headline": "Will tariffs make iPhones more expensive? Tim Cook revealsApple has recently opened about the US-imposed tariff and its impact on its business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-pm-modi-thiruvananthapuram-airport-vizhinjam-seaport-kerala-2718294-2025-05-02",
      "headline": "Shashi Tharoor receives PM in Kerala, takes dig at 'dysfunctional' Delhi airportCongress MP Shashi Tharoor, a four-time lawmaker from Kerala's Thiruvananthapuram, said he \"managed to land in time\" to receive Prime Minister Narendra Modi in the city and slammed the Delhi airport for flight delays."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/madrid-open-2025-jack-draper-rafael-nadal-ranking-semi-final-2718501-2025-05-02",
      "headline": "Jack Draper joins Rafael Nadal in rare ranking club after semis berthMadrid Open 2025: Britain's Jack Draper is set to become only the second left-hander this century to enter the top five of the ATP rankings. Draper will face Lorenzo Musetti in the semis after beating Matteo Arnaldi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-pat-cummins-matthew-hayden-sunil-gavaskar-2718478-2025-05-02",
      "headline": "Did SRH start to doubt their aggressive batting approach? Matthew Hayden reactsMatthew Hayden feels that SRH started to doubt their all-aggressive approach during the IPL 2025 season. SRH have struggled during the campaign this year after catching the imagination of everyone last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-test-series-cheteshwar-pujara-return-2718457-2025-05-02",
      "headline": "If India need me for England Test series, I am prepared: Cheteshwar PujaraCheteshwar Pujara has said that he is ready to make a return to the Indian Test team for the upcoming England tour, if his services are required. India will face England in a five-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/srh-struggling-with-an-unstable-middle-order-in-ipl-2025-daniel-vettori-responds-2718450-2025-05-02",
      "headline": "SRH struggling with an unstable middle order? Daniel Vettori respondsIPL 2025, GT vs SRH: In the press conference before the match against the Gujarat Titans, head coach Daniel Vettori talked about the form of the Sunrisers Hyderabad batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ipl-2025-rr-vs-mi-feature-2718428-2025-05-02",
      "headline": "Vaibhav Suryavashi's quiet and long struggle just began yesterdayIPL 2025, RR vs MI: Vaibhav Suryavanshi set the Sawai Mansingh Stadium blaze with a 35-ball hundred against Gujarat Titans, but fell for a duck at the same venue on Thursday against the Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-rohit-sharma-suryakumar-yadav-jasprit-bumrah-2718423-2025-05-02",
      "headline": "Rohit's resilience, Surya's flair, MI looking like the team to beat in IPLFrom 1 win in 5 matches to 6 straight victories — Mumbai Indians aren't just back, they're terrifying once again. The top players are back in form once again and MI are looking like the team to beat this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-avani-lekhara-ipl-2025-jerseys-pink-promise-2718409-2025-05-02",
      "headline": "Watch: RR exchange jerseys with Paralympian Avani Lekhara in heartfelt interactionIPL 2025, RR vs MI: Paralympic medallist Avani Lekhara was a part of the Rajasthan Royals' Pink Promise campaign in the match against Mumbai Indians on Thursday at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-hyderabad-daniel-vettori-press-conference-2718387-2025-05-02",
      "headline": "SRH have let themselves down: Daniel Vettori gutted after poor campaignIPL 2025, GT vs SRH: Sunrisers Hyderabad head coach Daniel Vettori said that the Orange Army haven't been up to the mark and hence, are struggling at the bottom half of the table. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-preview-predicted-xis-team-news-ahmedabad-pitch-weather-report-2718383-2025-05-02",
      "headline": "GT vs SRH: Gujarat look to edge closer to playoff spot as Hyderabad on the brinkShubman Gill and Gujarat Titans will be looking to edge closer to the IPL 2025 spots as Sunrisers Hyderabad battle for survival in Ahmedabad on Friday, May 2.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-hardik-pandya-mi-vs-rr-ipl-2025-2718370-2025-05-02",
      "headline": "Suryakumar, Hardik critical despite MI's huge win vs RR. Here's whyIPL 2025, RR vs MI: Hardik Pandya and Suryakumar Yadav engaged in a fun conversation after Mumbai Indians beat the Rajasthan Royals by 100 runs on Thursday in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rajasthan-royals-avani-lekhara-ipl-2025-jerseys-pink-promise-2718409-2025-05-02",
      "headline": "Watch: RR exchange jerseys with Paralympian Avani Lekhara in heartfelt interactionIPL 2025, RR vs MI: Paralympic medallist Avani Lekhara was a part of the Rajasthan Royals' Pink Promise campaign in the match against Mumbai Indians on Thursday at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-hyderabad-daniel-vettori-press-conference-2718387-2025-05-02",
      "headline": "SRH have let themselves down: Daniel Vettori gutted after poor campaignIPL 2025, GT vs SRH: Sunrisers Hyderabad head coach Daniel Vettori said that the Orange Army haven't been up to the mark and hence, are struggling at the bottom half of the table. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-srh-preview-predicted-xis-team-news-ahmedabad-pitch-weather-report-2718383-2025-05-02",
      "headline": "GT vs SRH: Gujarat look to edge closer to playoff spot as Hyderabad on the brinkShubman Gill and Gujarat Titans will be looking to edge closer to the IPL 2025 spots as Sunrisers Hyderabad battle for survival in Ahmedabad on Friday, May 2.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-hardik-pandya-mi-vs-rr-ipl-2025-2718370-2025-05-02",
      "headline": "Suryakumar, Hardik critical despite MI's huge win vs RR. Here's whyIPL 2025, RR vs MI: Hardik Pandya and Suryakumar Yadav engaged in a fun conversation after Mumbai Indians beat the Rajasthan Royals by 100 runs on Thursday in Jaipur. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}