{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesIndia's GDP growth accelerates to 7.8% in Q1FY26, beats estimates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-hints-at-major-overhaul-in-epfo-with-30-rollout-2778669-2025-08-29",
      "headline": "Sanjeev Sanyal hints at major overhaul in EPFO with 3.0 rolloutEconomist Sanjeev Sanyal has signalled that the Employees' Provident Fund Organisation (EPFO) is gearing up for a major transformation, with the much-awaited EPFO 3.0 promising faster, simpler, and more digital-first services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trumps-50-percent-tariffs-could-cost-india-usd-55-60-billion-warns-jefferies-global-head-of-equity-strategy-chris-wood-2778657-2025-08-29",
      "headline": "Trump's draconian tariffs may cost India $55-60 billion, warns Jefferies' Chris WoodChris Wood argues that the US tariffs are as much political as economic. He links the steep duties to Donald Trump's \"personal pique\" at being denied a role in resolving India-Pakistan tensions after their four-day conflict in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-rich-but-time-poor-why-real-wealth-is-about-balance-explains-ca-2778622-2025-08-29",
      "headline": "Cash-rich but time-poor? Why real wealth is about balance, explains CAIn today's fast-paced world, people often chase bigger salaries and titles, but an expert says money alone cannot define wealth. What matters more, he argues, is the freedom to spend time on things that truly count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-50-percent-us-tariff-blow-dent-india-economic-growth-in-q1-2778584-2025-08-29",
      "headline": "Will 50% US tariffs hit India's economic growth in Q1 and beyond?US tariffs, slow private investment, and weak urban demand are testing India's growth. Can GST cuts, government spending, and a strong monsoon keep the economy from stalling?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-agm-today-5-things-you-need-to-know-2778573-2025-08-29",
      "headline": "Reliance AGM today: 5 things you need to knowAll eyes will be on Reliance Industries as it holds its 48th AGM today at 2 PM. From Jio and retail IPO buzz to its push into green energy and AI, investors are bracing for big announcements from Mukesh Ambani."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooney-venice-film-festival-jay-kelly-premiere-standing-ovation-adam-sandler-2778704-2025-08-29",
      "headline": "George Clooney, Adam Sandler's Jay Kelly gets standing ovation at Venice premiereActor George Clooney braved a sinus infection and rain for the Venice premiere of Jay Kelly. His co-star Adam Sandler was also present at the screening as the movie received a standing ovation from the audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/do-you-wanna-partner-trailer-tammanaah-diana-run-beer-start-up-in-quirky-dramedy-2778745-2025-08-29",
      "headline": "Do You Wanna Partner trailer: Tamannaah, Diana run beer start-up in quirky dramedyThe trailer for the comedy-drama 'Do You Wanna Partner', featuring actors Tamannaah Bhatia and Diana Penty, was released on August 29. The series highlights female friendship and entrepreneurship in a male-dominated society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/param-sundari-movie-review-sidharth-malhotra-janhvi-kapoor-can-sell-kerala-trips-not-love-2778728-2025-08-29",
      "headline": "Param Sundari review: Sidharth-Janhvi can sell Kerala trips, not loveRelease Date:Fri Aug 29, 2025'Param Sundari' review: Tushar Jalota's romantic comedy starring Sidharth Malhotra and Janhvi Kapoor delivers stunning Kerala visuals and good music, but lacks chemistry and a compelling story. Yet another predictable and forgettable Bollywood love story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-meets-sabyasachi-mukherjee-at-taj-hotel-mumbai-2778710-2025-08-29",
      "headline": "Zeenat Aman admits she once failed to recognise SabyasachiVeteran actor Zeenat Aman shares a nostalgic encounter with designer Sabyasachi Mukherjee at Mumbai's Taj hotel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-welcomes-isro-scientist-haripriya-saketpuram-who-quit-game-at-rs-25-lakh-can-you-answer-2778697-2025-08-29",
      "headline": "KBC 17: Isro scientist fails to answer Rs 25 lakh question. Can you?In the latest episode of 'Kaun Banega Crorepati', Amitabh Bachchan welcomed Isro scientist to the hot seat, who quit the game at Rs 25 lakh. Can you answer the answer? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rocky-anthony-ippolito-to-play-young-sylvester-stallone-in-biopic-amazon-mgm-2778647-2025-08-29",
      "headline": "Anthony Ippolito to portray young Sylvester Stallone in biopic I Play RockyActor Anthony Ippolito is set to take on the role of young Sylvester Stallone in 'I Play Rocky'. The film reveals the true underdog story behind the making of the iconic 'Rocky' movie and Stallone's relentless pursuit of his dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-x-reviews-sidharth-malhotra-janhvi-kapoor-shine-weak-second-half-2778680-2025-08-29",
      "headline": "Param Sundari X reviews: Sidharth-Janhvi shine in a film with weak second halfActors Sidharth Malhotra and Janhvi Kapoor's 'Param Sundari' opens to mixed reactions. Audiences praise the chemistry, but criticise the predictable second half.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-mallik-accuses-awez-darbar-nagma-mirajkar-gauahar-khan-reacts-2778651-2025-08-29",
      "headline": "Bigg Boss 19: Gauahar reacts after Amaal says Awez-Nagma get work because of himBigg Boss 19 heats up as Amaal Mallik accuses Awez Darbar and Nagma Mirajkar of taking no stand inside the house. Gauahar Khan defends the couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-marks-ganesh-chaturthi-shefali-jariwala-memory-fulfills-her-wish-2778659-2025-08-29",
      "headline": "Parag Tyagi marks Ganesh Chaturthi in Shefali Jariwala's memory, fulfills her wishParag Tyagi celebrated Ganesh Chaturthi in memory of Shefali Jariwala. He shared a video along with a heartfelt note while remembering his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bosco-martis-credit-for-janhvi-kapoor-chuttamale-choreographer-needs-to-be-celebrated-as-much-as-a-star-2778627-2025-08-29",
      "headline": "Bosco Martis demands equal credit for choreographers after Chuttamalle's successChoreographer Bosco Martis has voiced his concerns about inadequate recognition for his work on the hit song 'Chuttamalle' from the Telugu film Devara Part 1.  He called for equal respect and visibility for choreographers alongside stars and music directors in the Indian film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-and-playboi-carti-to-headline-lollapalooza-india-2026-2778592-2025-08-29",
      "headline": "Linkin Park and Playboi Carti to headline Lollapalooza India 2026Lollapalooza India 2026 has announced a historic line-up with Linkin Park set to perform in the country for the first time, alongside headliner Playboi Carti. The Mumbai festival has been scheduled for January 24–25, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/songs-of-paradise-review-saba-azad-soni-razdan-bring-noor-begum-alive-2778557-2025-08-29",
      "headline": "Songs of Paradise review: Saba delivers, Soni Razdan adds soul to Kashmiri sagaRelease Date:Fri Aug 29, 2025'Songs of Paradise' review: Prime Video's latest offering, 'Songs of Paradise', beautifully blends Kashmir's breathtaking landscapes with its rich musical heritage, tracing the inspiring journey of Noor Begum, a woman who defied patriarchy through her voice. Anchored by powerful performances and soulful music, the film is a poignant ode to resilience and art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-teaser-varun-janhvi-bring-love-laughter-with-twists-2778575-2025-08-29",
      "headline": "Sunny Sanskari Ki Tulsi Kumari teaser: Varun-Janhvi bring love, laughter with twistsThe teaser for Varun Dhawan and Janhvi Kapoor's rom-com 'Sunny Sanskari Ki Tulsi Kumari' has been unveiled, promising a festive wedding twist. Directed by Shashank Khaitan, the film will be released in theatres on October 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bugonia-trailer-emma-stone-bald-look-in-yorgos-lanthimos-sci-fi-dark-comedy-2778560-2025-08-29",
      "headline": "Bugonia trailer: Emma Stone goes bald in Yorgos' sci-fi dark comedyEmma Stone reunites with Yorgos Lanthimos for the sci-fi black comedy 'Bugonia', where she plays a CEO kidnapped by men who believe she's an alien. The trailer, featuring her bold bald look, has gone viral ahead of the film's October release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kpop-demon-hunters-arden-cho-bts-blackpink-2778537-2025-08-29",
      "headline": "Kpop Demon Hunters' Arden Cho wants to collaborate with BTS, BLACKPINK: ExclusiveNetflix's 'KPop Demon Hunters' has captured global audiences with its hit song 'Golden' becoming the top-streamed track. Actor Arden Cho discussed her role, Asian-American representation, and hoped for a sequel in an exclusive interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-unveils-aunty-kisko-bola-teaser-sajid-khan-ssunita-ahuja-join-as-judges-2778518-2025-08-29",
      "headline": "Farah Khan unveils Aunty Kisko Bola teaser, Sajid-Ssunita join as judgesFarah Khan has launched a quirky YouTube talent show titled 'Aunty Kisko Bola', dedicated to showcasing women's talents regardless of age. The show will feature rotating guest judges, starting with Sajid Khan and Ssunita Ahuja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-enjoy-college-football-first-outing-engagement-diamond-ring-2778524-2025-08-29",
      "headline": "Taylor Swift, Travis Kelce enjoy college football in 1st outing after engagementTaylor Swift and Travis Kelce made their first public appearance after announcing their engagement. Several viral pictures and videos showed the singer flaunting her sparkling diamond ring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-ssunita-ahuja-dance-together-at-ganesh-visarjan-amid-divorce-rumours-2778508-2025-08-29",
      "headline": "Govinda, Ssunita dance together at Ganesh Visarjan amid divorce rumours. VideosActor Govinda and his wife Ssunita Ahuja ended divorce rumours by celebrating Ganesh Chaturthi with their family, performing the visarjan rituals with son Yashvardhan. Ssunita also addressed the media, firmly dismissing the speculation and reaffirming their bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-dances-to-dhol-ganpati-visarjan-zaheer-iqbal-sonakshi-sinha-arpita-khan-ganesh-chaturthi-2778506-2025-08-29",
      "headline": "Salman Khan dances to dhol at Ganpati visarjan, Sonakshi-Zaheer join. WatchSalman Khan participated in Ganpati visarjan by shaking a leg at the grand festivities, which were held by his sister, Arpita Khan Sharma. A video of the superstar dancing to dhol has emerged online. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-personal-pique-singling-out-india-tariffs-not-allowed-mediate-pakistan-conflict-2778696-2025-08-29",
      "headline": "Trump taking out his grudge on India, says JefferiesThe report by Jefferies said Trump's 'personal pique' saw the US impose a 50% tariff on India, the highest among American trading partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sikh-man-shot-dead-us-los-angeles-gatka-martial-art-machette-footage-viral-2778730-2025-08-29",
      "headline": "US cops shoot dead Sikh man performing gatka on road, release footageLos Angeles police claimed that Gurpreet Singh was wielding a machete and was shot dead after he refused to comply and tried to attack the cops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-must-apologise-amit-shah-on-abuse-to-pm-modi-his-mother-at-bihar-rally-2778648-2025-08-29",
      "headline": "Rahul Gandhi must apologise: Amit Shah on abuse to PM, his mother at Bihar RallyAmit Shah condemned Congress leaders for allegedly using derogatory words against PM Modi and his late mother during a Bihar rally, calling it the \"greatest fall in politics.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/taylor-swift-engagement-diamond-ring-indian-roots-golconda-mines-history-mir-jumla-persia-link-nadir-shah-2778454-2025-08-29",
      "headline": "How a poor Persian oilman's son rose to rule Kohinoor's nest in IndiaThe rock that Taylor Swift flaunted after her engagement brought India's Golconda diamond mines into focus. The Koh-i-Noor, the world's most famous and costliest diamond, was from India's Golconda mines, and was looted and taken to Persia by invader Nadir Shah. About 150 years before that, a Persian oilman's son, Mir Jumla, who helped Aurangzeb in his succession battle, came to rule the Golconda mines, the nest of the Kohinoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thai-court-sacks-suspended-pm-shinawatra-over-leaked-call-with-cambodian-leader-2778731-2025-08-29",
      "headline": "Thai court sacks suspended PM Shinawatra over leaked call with Cambodian leaderPaetongtarn Shinawatra, who was Thailand's youngest prime minister, becomes the sixth premier from or backed by the billionaire Shinawatra family to be removed by the military or judiciary in a tumultuous two-decade battle for power between the country's warring elites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-jaish-e-mohammed-suspects-depart-kathmandu-malaysia-deny-india-entry-bihar-police-claims-2778736-2025-08-29",
      "headline": "Nepal denies reports of Jaish terrorists entering Bihar: They flew to MalaysiaNepal stated that the three Pakistani nationals flew from Kathmandu to Kuala Lumpur on separate flights at different times, contradicting Bihar Police's claim that they had entered the poll-bound state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/param-sundari-movie-review-sidharth-malhotra-janhvi-kapoor-can-sell-kerala-trips-not-love-2778728-2025-08-29",
      "headline": "Param Sundari review: Sidharth-Janhvi can sell Kerala trips, not loveRelease Date:Fri Aug 29, 2025'Param Sundari' review: Tushar Jalota's romantic comedy starring Sidharth Malhotra and Janhvi Kapoor delivers stunning Kerala visuals and good music, but lacks chemistry and a compelling story. Yet another predictable and forgettable Bollywood love story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-treasury-secretary-scott-bessant-mocks-indian-rupee-against-dollar-reserve-currency-donald-trump-reciprocal-tariff-2778748-2025-08-29",
      "headline": "Amid Trump tariffs, US Treasury Secretary mocks Indian rupeeUS Treasury Secretary Scott Bessant said he is not concerned about the rupee becoming a reserve currency, adding that it cannot rival the dollar as it is at an all-time low. Earlier, US President Donald Trump had dismissed India's economy as \"dead\". However, economists argue that US tariffs and distancing India could backfire on America itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-likely-to-play-without-jersey-sponsor-2778677-2025-08-29",
      "headline": "Asia Cup 2025: India likely to play without jersey sponsor, say sourcesIndia are likely to play without any jersey sponsor in the Asia Cup 2025, sources have confirmed to India Today. During the BCCI emergency Apex council meeting, there were discussions about bringing in the new sponsor. But since there is not enough time to advertise and complete the process, it is going to be a tough task for the board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/flag-war-on-bihar-street-congress-bjp-workers-face-off-over-pm-modi-abuse-row-2778620-2025-08-29",
      "headline": "Battle of Patna ft flagpoles: Congress, BJP workers get into street-fightBoth parties accused each other of instigating the clash. BJP workers told India Today TV that they were holding a peaceful protest in front of the Congress office in Patna before people allegedly started pelting stones. On the other hand, Congress accused BJP workers of throwing stones from outside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-gold-fixation-midas-touch-white-house-gilding-obsession-lobbying-with-lusture-change-global-relations-2778268-2025-08-29",
      "headline": "How Trump's gold fixation is bringing Midas curse to White HouseDonald Trump has brought the golden flashiness of his Trump Towers to the White House, changing its look and feel. The whole world now knows about Trump's gold obsession and Apple's Tim Cook has even \"bribed\" him with a golden plaque. This is how the Midas curse is bringing a golden murkiness to the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/xi-jinping-secret-letter-spurred-delhi-beijing-thaw-during-trumps-tariff-war-report-2778543-2025-08-29",
      "headline": "Xi's secret letter spurred Delhi-Beijing thaw during Trump's tariff war: ReportIn his letter to President Droupadi Murmu, later passed on to PM Modi, Chinese President Xi Jinping sought to \"test the waters on improving ties.\" Indian officials said Xi reached out directly to Indian President Droupadi Murmu in March, during heightened US trade tensions with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/imd-red-alert-noida-ghaziabad-heavy-rainfall-yellow-alert-delhi-ncr-weather-update-2778526-2025-08-29",
      "headline": "Over 250 flights hit as rain pounds Delhi-NCR, big jams as roads waterloggedHeavy traffic congestion was reported across several key routes in the capital following a spell of rain. Major stretches, including the DND Flyway, Mathura Road, Vikas Marg, ISBT, Geeta Colony and Rajaram Kohli Marg experienced slow-moving traffic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/what-is-daruma-doll-gifted-pm-narendra-modi-japan-visit-significance-summit-chief-priest-tokyo-here-is-more-explained-2778589-2025-08-29",
      "headline": "What is Daruma Doll gifted to PM Modi, what's its significance?During his two-day visit to Japan for the India-Japan Annual Summit, Prime Minister Narendra Modi was presented with a Daruma doll by the chief priest of Shorinzan-Daruma-ji Temple. The Daruma doll is a hollow, round, brightly painted figure with blank white eyes. It symbolises perseverance, resilience, good fortune, and the pursuit of goals.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bus-driver-heart-attack-jodhpur-indore-route-saves-passengers-2778691-2025-08-29",
      "headline": "Video: Rajasthan driver passes steering to helper, collapses, then diesIn the CCTV footage accessed by India Today TV, Rao can be seen seated next to his colleague before collapsing. A woman in the front seat is seen calling for help as other passengers rush to support him, holding him upright and rubbing his feet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-departs-japan-china-strengthen-strategic-economic-ties-glbs-2778439-2025-08-28",
      "headline": "World not only watching but counting on India: PM Modi in Tokyo Live UpdatesThe two sides will go beyond signing MoUs, with Prime Minister Modi and his Japanese counterpart expected to deliberate on the prevailing geopolitical and geo-economic landscape amid US President Donald Trump's ongoing trade war, Indian envoy to Japan Sibi George said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-to-identify-panic-attack-and-heightened-anxiety-in-public-how-to-help-2777052-2025-08-29",
      "headline": "How to recognise a panic attack in public, and help someone through itAt a time when cases of anxiety and panic attacks are on the rise, it's important to know how to support someone in distress. Here's a quick guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/songs-of-paradise-review-saba-azad-soni-razdan-bring-noor-begum-alive-2778557-2025-08-29",
      "headline": "Songs of Paradise review: Saba delivers, Soni Razdan adds soul to Kashmiri sagaRelease Date:Fri Aug 29, 2025'Songs of Paradise' review: Prime Video's latest offering, 'Songs of Paradise', beautifully blends Kashmir's breathtaking landscapes with its rich musical heritage, tracing the inspiring journey of Noor Begum, a woman who defied patriarchy through her voice. Anchored by powerful performances and soulful music, the film is a poignant ode to resilience and art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-slaps-sreesanth-unseen-video-lalit-modi-shares-viral-2778684-2025-08-29",
      "headline": "Unseen video of Harbhajan slapping Sreesanth out; Lalit Modi's clip goes viralFormer IPL chairman Lalit Modi has released the long-hidden clip of Harbhajan Singh slapping Sreesanth during an IPL match in 2008. The footage has gone viral ever since it played on Michael Clarke's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-floods-aap-ministers-discuss-sweden-goa-cruise-trips-bhagwant-mann-congress-2778612-2025-08-29",
      "headline": "Video: Punjab ministers discuss Sweden, Goa cruise trips during flood inspectionA leaked Facebook Live showing three Punjab ministers recalling cruises and beach trips during a flood survey in Tarn Taran has triggered outrage, with Congress accusing the AAP government of insensitivity amid the flood alert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/do-you-wanna-partner-trailer-tammanaah-diana-run-beer-start-up-in-quirky-dramedy-2778745-2025-08-29",
      "headline": "Do You Wanna Partner trailer: Tamannaah, Diana run beer start-up in quirky dramedyThe trailer for the comedy-drama 'Do You Wanna Partner', featuring actors Tamannaah Bhatia and Diana Penty, was released on August 29. The series highlights female friendship and entrepreneurship in a male-dominated society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/indian-students-abroad-struggle-survival-jobs-foreign-degree-debt-2778672-2025-08-29",
      "headline": "Degrees don't pay rent: White-collar dreams, blue-collar jobsMany Indian students face low-skilled survival jobs despite expensive foreign education. This exposes systemic failures and the gap between expectations and reality abroad."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-vs-putri-wardani-live-score-bwf-world-championships-quarters-2778784-2025-08-29",
      "headline": "Live: PV Sindhu eyes historic medal, faces Putri Wardani in quartersBWF World Championships 2025 live score: Two-time Olympic medallist PV Sindhu faces higher-ranked Putri Wardani in the quarterfinal of the world meet in Paris. If Sindhu wins her match on Friday, she will become the first woman to win more than five medals at the prestigious world meet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-tanisha-crasto-dhruv-kapila-medal-2778733-2025-08-29",
      "headline": "World Championships: Tanisha Crasto and Dhruv Kapila fall short of historic medalBWF World Championships 2025: India's Dhruv Kapila and Tanisha Crasto fell one step short of a historic medal at the world meet. The 17th-ranked pair los to World No. 4 Chen Tangjie and Toh Eewei of Malaysia on Friday in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/simone-biles-meets-coco-gauff-inspiring-confidence-us-open-2025-2778729-2025-08-29",
      "headline": "Watch: Coco Gauff meets gymnastics legend Simone Biles at US OpenAmerican star Coco Gauff thanked her inspiration, decorated US gymnast Simone Biles, when they met at Arthur Ashe Stadium on Thursday, after the tennis star defeated Donna Vekic 7-6(5), 6-2 in the second round of the 2025 US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-opening-day-korea-japan-malaysia-win-2778721-2025-08-29",
      "headline": "Asia Cup 2025: Champions Korea hammer Chinese Taipei, Malaysia and Japan winChampions South Korea started their Asia Cup title defence with a bang as they swept aside Chinese Taipei. Japan breezed past Kazakhstan and Malaysia overcame an early wobble to defeat Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-played-pace-better-than-virat-kohli-neil-wagner-2778709-2025-08-29",
      "headline": "Kohli or MS Dhoni, who played bouncer better? Neil Wagner recalls fiery spellPacer Neil Wagner has reflected on the 2014 Auckland Test, noting that he found MS Dhoni more comfortable against pace than Virat Kohli in overseas conditions. Wagner used the short ball plan to perfection to help his team win the first Test by 40 runs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-world-cup-england-captain-nat-sciver-brunt-kate-cross-omission-2778714-2025-08-29",
      "headline": "Women's World Cup: Sciver-Brunt calls Kate Cross omission 'bitter but positive'England captain Nat Sciver-Brunt has said that Kate Cross's exclusion from the Women's World Cup squad reflects a team moving in the right direction. She acknowledged that selecting a squad for any tournament is always a tough and significant decision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-novak-djokovic-us-open-2025-third-round-matches-2778687-2025-08-29",
      "headline": "Novak Djokovic, Carlos Alcaraz headline high-octane third-round actionUS Open 2025, August 29: Day six of the tournament promises high-octane action as third-round matches feature some of the sport's biggest stars. World No. 2 Carlos Alcaraz will take on Italy's Luciano Darderi, while Novak Djokovic returns to Centre Court to face Cameron Norrie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-slaps-sreesanth-unseen-video-lalit-modi-shares-viral-2778684-2025-08-29",
      "headline": "Unseen video of Harbhajan slapping Sreesanth out; Lalit Modi's clip goes viralFormer IPL chairman Lalit Modi has released the long-hidden clip of Harbhajan Singh slapping Sreesanth during an IPL match in 2008. The footage has gone viral ever since it played on Michael Clarke's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-likely-to-play-without-jersey-sponsor-2778677-2025-08-29",
      "headline": "Asia Cup 2025: India likely to play without jersey sponsor, say sourcesIndia are likely to play without any jersey sponsor in the Asia Cup 2025, sources have confirmed to India Today. During the BCCI emergency Apex council meeting, there were discussions about bringing in the new sponsor. But since there is not enough time to advertise and complete the process, it is going to be a tough task for the board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwes-bold-time-shift-to-battle-out-nfl-primetime-2778639-2025-08-29",
      "headline": "WWE Raw implements bold time shift to challenge NFL primetime viewershipWWE Raw teams with Netflix for a bold September test run, starting at 7 p.m. ET to get ahead of Monday Night Football's prime time surge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-novak-djokovic-us-open-2025-third-round-matches-2778687-2025-08-29",
      "headline": "Novak Djokovic, Carlos Alcaraz headline high-octane third-round actionUS Open 2025, August 29: Day six of the tournament promises high-octane action as third-round matches feature some of the sport's biggest stars. World No. 2 Carlos Alcaraz will take on Italy's Luciano Darderi, while Novak Djokovic returns to Centre Court to face Cameron Norrie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-slaps-sreesanth-unseen-video-lalit-modi-shares-viral-2778684-2025-08-29",
      "headline": "Unseen video of Harbhajan slapping Sreesanth out; Lalit Modi's clip goes viralFormer IPL chairman Lalit Modi has released the long-hidden clip of Harbhajan Singh slapping Sreesanth during an IPL match in 2008. The footage has gone viral ever since it played on Michael Clarke's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-likely-to-play-without-jersey-sponsor-2778677-2025-08-29",
      "headline": "Asia Cup 2025: India likely to play without jersey sponsor, say sourcesIndia are likely to play without any jersey sponsor in the Asia Cup 2025, sources have confirmed to India Today. During the BCCI emergency Apex council meeting, there were discussions about bringing in the new sponsor. But since there is not enough time to advertise and complete the process, it is going to be a tough task for the board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwes-bold-time-shift-to-battle-out-nfl-primetime-2778639-2025-08-29",
      "headline": "WWE Raw implements bold time shift to challenge NFL primetime viewershipWWE Raw teams with Netflix for a bold September test run, starting at 7 p.m. ET to get ahead of Monday Night Football's prime time surge."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}