{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-let-ai-analyse-your-online-spending-habits-ai-and-spending-habits-ai-for-budgeting-ai-personal-finance-tools-2772315-2025-08-17",
      "headline": "Should you let AI analyse your online spending habits?Artificial intelligence is gradually slipping into our wallets. From tracking what we buy to predicting our next expense, AI-based tools are becoming popular. But should you really let AI analyse your online spending habits?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/trade-deal-talks-hit-roadblock-as-us-delegations-india-visit-could-be-delayed-2772307-2025-08-17",
      "headline": "Trade deal talks hit roadblock as US delegation's India visit could be delayedThe India-US trade deal talks face a potential roadblock as the US delegation may delay its August 25 visit to India. This postponement impacts scheduled negotiations that were crucial for preventing additional tariffs. A 50% tariff on Indian goods is set to take effect from August 27. Currently, a 25% tariff is already in place, impacting exporters. The deferment of the meeting does not signify cancellation, but rather a delay. Reasons for the delay could be operational or related to geopolitical outcomes. \"A 50% tariff will be imposed on us from August 27 in totality.\" The BTA deal is anticipated by the end of September or October, with expectations for a meeting by the end of August, contingent on geopolitical developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-negotiators-visit-to-new-delhi-for-bilateral-trade-talks-deferred-to-be-rescheduled-report-2772226-2025-08-16",
      "headline": "Trade deal in limbo as US team's India visit deferred amid tariff warThe United States has been pressing India to open its agriculture and dairy sectors, but New Delhi has ruled out concessions, saying such moves would endanger small farmers and cattle rearers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cuts-rationalisation-simpler-tax-structure-good-simple-tax-cheaper-goods-2772146-2025-08-16",
      "headline": "Real wallet-friendly shake-up: GST 2.0 to feel like 'Good and Simple Tax'The government is set to launch GST 2.0 with major rate cuts, making essentials cheaper and simplifying tax slabs. The overhaul promises lower prices, fewer complications, and a true 'Good and Simple Tax'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-proposes-two-gst-rates-of-5-and-18-tobacco-at-40-tax-cuts-for-farm-and-health-sectors-sources-2771789-2025-08-15",
      "headline": "Government proposes 5%, 18% GST slabs; tobacco at 40%, relief for farmers: SourcesThe government has proposed reducing GST to two slabs: 5% and 18% with sin goods at 40%, aiming to cut taxes on essentials like farm products, health items, handicrafts, and insurance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-rating-importance-what-do-they-mean-india-upgrade-pakistan-sp-global-2771729-2025-08-15",
      "headline": "Credit ratings decoded: How a simple upgrade can change a country's fortuneGlobal credit rating agency S&P Global has upgraded India's long-term unsolicited sovereign credit rating to 'BBB' from 'BBB-'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/gst-council-meeting-in-september-12-slam-may-be-dropped-sources-2771695-2025-08-15",
      "headline": "GST council meeting in September, 12% slam may be dropped: SourcesTwo-day GST Council meetings are expected in September to pave the way for reforms. The announcement was made by the Prime Minister from the ramparts of the Red Fort. These reforms are seen as a Diwali gift for the middle class. Key changes include the removal of the 12% GST slab and rate rationalisation for health and life insurance policies. The government aims to reduce the GST on most items currently in the 12% slab to 5%. This move is expected to make essential items such as footwear, bags, clothes, and toothpastes more affordable. The government is addressing concerns about inflation and the rising cost of living. Feedback regarding health insurance, which impacts the common person, has also been considered. The meetings in September are crucial for approving these changes, with implementation anticipated before Diwali. The Finance Ministry and state finance ministers have been involved in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/removal-of-12-tax-slab-among-key-reforms-to-be-discussed-in-gst-council-meetings-in-september-sources-2771661-2025-08-15",
      "headline": "GST Council may drop 12% slab, more tax reforms in September meeting: SourcesThe meeting comes after Prime Minister Narendra Modi, in his Independence Day speech, announced plans for a major overhaul of the Goods and Services Tax (GST) system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/same-sex-couple-tax-law-biased-uneven-challenge-gits-received-partners-bombay-hc-report-2771623-2025-08-15",
      "headline": "Claiming bias, same-sex couple approaches court over uneven tax: ReportThe petition was admitted by a bench of Justice BP Colabawalla and Justice Firdoush Pooniwalla, which has also issued a notice to the Attorney General as the case raises a constitutional question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/independence-day-pm-modi-announces-next-generation-gst-reform-with-significantly-lower-rates-2771561-2025-08-15",
      "headline": "PM Modi announces next-generation GST reform with significantly lower ratesDuring his Independence Day address, Prime Minister Narendra Modi announced a sweeping overhaul of the GST system, promising to unveil a \"next-generation\" tax regime with substantially lower rates this Diwali, which he hailed as a festive gift from the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-speech-announces-rs-1-lakh-crore-pradhan-mantri-viksit-bharat-rojgar-yojana-scheme-2771555-2025-08-15",
      "headline": "Rs 15,000 from government on 1st private-sector job: PM's big youth schemePM Modi in his Independence Day speech said that the Pradhan Mantri Viksit Bharat Rojgar Yojana will create nearly 3.5 crore new employment opportunities for the youth. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-opens-up-on-his-bond-with-daughter-shora-2772500-2025-08-17",
      "headline": "Nawazuddin Siddiqui opens up on his bond with daughter Shora: My biggest criticActor Nawazuddin Siddiqui said his daughter Shora keeps him grounded and often scolds him without caring about his stardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-relish-lucknow-chaat-ahead-of-param-sundari-release-2772490-2025-08-17",
      "headline": "Janhvi-Sidharth relish Lucknow chaat ahead of Param Sundari release. VideoJanhvi Kapoor and Sidharth Malhotra enjoyed chaat in Lucknow while promoting their upcoming film 'Param Sundari'. The romantic drama, releasing on August 29, has already created buzz with its trailer and the duo's on-screen chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kollam-thulasi-faces-heat-for-sexist-outburst-after-amma-malayalam-film-body-elects-woman-president-shwetha-mennon-2772470-2025-08-17",
      "headline": "Men should rule: Kerala actor's sexist rant after film body elects woman headThe Malayalam film body elected Shwetha Menon as its first female president, marking a landmark moment in Malayalam cinema. However, veteran Kollam Thulasi's sexist remarks have overshadowed the celebration, reigniting debates on industry sexism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-shows-off-his-age-old-outfits-janhvi-kapoor-has-the-sweetest-reaction-2772472-2025-08-17",
      "headline": "Boney Kapoor shows off his age-old outfits, Janhvi has the sweetest reactionBoney Kapoor impressed fans on Instagram by posing in a stylish look featuring his 22-year-old jeans and 18-year-old shirt, paired with a fresh haircut. His daughter Janhvi Kapoor added a sweet \"Wow papa\" comment, while fans showered him with love and nostalgic messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-x-twitter-reactions-aryan-khans-glimpse-gives-fans-full-srk-deja-vu-2772422-2025-08-17",
      "headline": "Bads of Bollywood X reactions: Aryan Khan's glimpse gives fans full SRK deja vuAryan Khan's upcoming web series 'The Ba***ds of Bollywood' first teaser sparked widespread attention. The series, written and directed by Aryan Khan, features a star-studded cast and is backed by Gauri Khan, promising a stylised entertainment world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-recalls-losing-film-with-oscar-winning-director-alejandro-gonzalez-inarritu-2772452-2025-08-17",
      "headline": "Fahadh Faasil recalls losing film with Oscar-winning director Alejandro InarrituFahadh Faasil shared that he was once in talks for a film with Hollywood director Alejandro Gonzalez Inarritu but couldn't take it up because of accent issues. He added that he wants his most special projects to come from Malayalam cinema itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-salman-khans-sikandar-failed-ar-murugadoss-admits-missteps-in-execution-2772402-2025-08-17",
      "headline": "Why Salman Khan's Sikandar failed? AR Murugadoss admits missteps in executionSalman Khan's 'Sikandar', directed by AR Murugadoss, has underperformed at the box office despite high expectations. Murugadoss admitted the emotional story did not connect with audiences and expressed hope to return to Bollywood when he finds his comfort zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shares-health-update-says-cancer-treatment-hits-hard-and-heavy-2772413-2025-08-17",
      "headline": "Dipika Kakar shares health update, says cancer treatment hits hard and heavyDipika Kakar, who underwent a major surgery for stage 2 liver cancer in June, recently shared a heartfelt health update with fans, admitting that treatment days often feel heavy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-day-3-rajinikanth-film-storms-past-rs-250-crore-worldwide-2772363-2025-08-17",
      "headline": "Coolie box office Day 3: Rajinikanth film storms past Rs 250 crore worldwideRajinikanth's 'Coolie' continues its unstoppable run at the box office, raking in Rs 158.25 crore domestically in just three days. The film has become the highest-grossing Tamil release of 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-box-office-day-3-hrithik-roshan-jr-ntr-film-witnesses-a-sharp-drop-2772386-2025-08-17",
      "headline": "War 2 box office Day 3: Hrithik Roshan, Jr NTR film witnesses a sharp dropOn Day 3, 'War 2' collected around Rs 33 crore in India, bringing its three-day total to nearly Rs 143–144 crore. Despite the dip, Hrithik Roshan and Jr NTR's film has crossed Rs 200 crore worldwide and emerged as the seventh highest-grossing Bollywood release of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-gets-wife-shefali-jariwalas-face-tattooed-on-his-chest-2772366-2025-08-17",
      "headline": "Parag Tyagi gets wife Shefali Jariwala's face tattooed on his chest. VideoParag Tyagi paid a heartfelt tribute to his late wife Shefali Jariwala by getting her portrait tattooed on his chest, keeping her memory close to his heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-represents-india-at-new-yorks-india-day-parade-independence-day-2772356-2025-08-17",
      "headline": "Vijay Deverakonda represents India at New York's India Day parade. WatchActor Vijay Deverakonda celebrated Independence Day by proudly representing India at the India Day parade in New York City. He participated in flag-hoisting ceremonies and greeted fans at Times Square. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nakuul-mehta-jankee-welcome-baby-girl-shares-adorable-pics-from-hospital-2772352-2025-08-17",
      "headline": "Nakuul Mehta, wife Jankee welcome baby girl share adorable pics from hospitalActor Nakuul Mehta and his wife Jankee have welcomed their second child, a baby girl, sharing the joyous news with fans through a heartfelt Instagram post. The couple's son Sufi was lovingly included in the announcement, holding his newborn sister in the first picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaideep-ahlawat-bhangra-steals-the-show-at-iffm-2025-fans-want-more-2772347-2025-08-17",
      "headline": "Jaideep Ahlawat's impromptu bhangra steals the show at IFFM 2025, fans want moreJaideep Ahlawat set the stage on fire with his impromptu bhangra at the Indian Film Festival of Melbourne 2025, leaving the audience and Malaika Arora cheering for more. The actor also bagged the Best Actor - Web Series award for his role in 'Paatal Lok 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-bads-of-bollywood-first-look-is-all-sass-and-swag-watch-2772328-2025-08-17",
      "headline": "Aryan Khan flips the script with his bold Bads of Bollywood first lookAryan Khan's 'The Ba***ds of Bollywood' teaser has generated excitement by blending love and critique of Bollywood, with the show slated for release in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/coolie-rajinikanth-fiim-collection-1983-amitabh-bachchan-injury-fandom-india-turned-film-hall-movie-ticket-2771317-2025-08-17",
      "headline": "How Coolie fever gripped India 40 years agoWhile Rajinikanth-starrer Coolie might seem to break all the fandom craze, India saw something similar, if not more, in 1983 when Amitabh Bachchan's Coolie hit the theatres. It was during the shooting of Coolie that Big B sustained a life-threatening injury and the whole country prayed for him. So, when the film was released, anticipation was sky-high and fans turned theatres into temples for Amitabh worship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anita-advani-secret-marriage-claim-rajesh-khanna-funeral-exclusion-2772311-2025-08-17",
      "headline": "Anita Advani says she secretly married Rajesh Khanna: He made me wear mangal sutraAnita Advani has revealed that she was privately married to the late Bollywood superstar Rajesh Khanna, adding a new dimension to his personal life story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-mobbed-during-dahi-handi-event-in-mumbai-actor-maintains-calm-2772300-2025-08-17",
      "headline": "Janhvi Kapoor mobbed during Dahi Handi event in Mumbai, actor maintains calmJanhvi Kapoor encountered a crowd surge while promoting 'Param Sundari' at a Mumbai Dahi Handi event amidst Janmashtami celebrations. Videos from the event were shared online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-shuts-down-troll-asking-him-to-retire-with-witty-reply-2772283-2025-08-17",
      "headline": "Shah Rukh Khan shuts down troll asking him to retire with witty replyShah Rukh Khan engaged fans on X with a lively #AskSRK session, where he schooled a troll suggesting retirement. During the session on Saturday, he also updated fans about his recovery, 'King', and son Aryan's directorial debut. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/big-progress-on-russia-stay-tuned-donald-trump-posts-day-after-meeting-with-putin-2772488-2025-08-17",
      "headline": "Big progress on Russia, stay tuned, Trump says day after meeting with PutinDonald Trump posted a cryptic message on his Truth Social account on Sunday, hinting at some big development that has been made regarding Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/give-affidavit-in-7-days-or-apologise-to-nation-election-commission-on-rahul-gandhis-vote-chori-charges-2772434-2025-08-17",
      "headline": "Give affidavit in 7 days or apologise: Poll body to Rahul Gandhi on 'vote chori'The Election Commission has asked Rahul Gandhi to either submit an affidavit within seven days backing his 'vote chori' claims or apologise to the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-slams-opposition-crushed-constitution-delhi-vision-gst-reform-2772446-2025-08-17",
      "headline": "Once crushed Constitution, now dancing with it: PM Modi slams OppositionPM Modi attacked the Opposition, saying they once crushed the Constitution but now pretend to safeguard it. He also shared his vision to transform Delhi into the capital of a developed India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-trying-to-snatch-voting-rights-we-will-show-you-peoples-strength-rahul-gandhi-2772499-2025-08-17",
      "headline": "We aren't afraid of you, will show you people's strength: Rahul to poll bodyElection Commission trying to snatch voting rights, we will show you people's strength: Rahul Gandhi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/street-dogs-can-be-trained-stray-canine-behaviourists-reveal-how-supreme-court-shelter-home-protest-delhi-ncr-2771898-2025-08-17",
      "headline": "Stray dogs can be trained to reduce aggression. Trainers reveal howThe debate over Delhi's stray dogs has split the nation. While pet dogs are trained and groomed, street dogs have an entirely different image. Unlike what is popularly believed, strays can be trained, and their aggression largely reduced. Behaviourists and trainers who have trained stray dogs tell us how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-eci-counters-rahul-gandhi-charges-voter-fraud-house-number-address-vote-chori-sir-bihar-supreme-court-2772457-2025-08-17",
      "headline": "House No. 0 to name duplications: Poll body's big counter to Rahul GandhiThe Election Commission of India (ECI) on Sunday countered Congress leader Rahul Gandhi's \"vote chori\" or vote theft allegations, by explaining how thousands of voters had zero as house numbers and that duplication in voter list didn't mean fraud. It vouched for the sanctity of the electoral rolls and said the Special Intensive Revision (SIR) exercise in Bihar wasn't being done in a rush."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/yamuna-river-water-level-to-cross-danger-mark-delhi-flood-advisory-issued-2772486-2025-08-17",
      "headline": "Yamuna may cross danger mark in two days, government issues flood advisoryAccording to the advisory, the river is expected to cross the 206-metre danger level by 2 am on August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ai-engineer-varun-gupta-an-iit-grad-gets-probation-and-34000-fine-for-leaking-intel-secrets-to-microsoft-2772395-2025-08-17",
      "headline": "AI engineer Varun Gupta fined $34,000 for leaking Intel secrets to MicrosoftAccording to the reports, Varun Gupta leaked thousands of files from Intel to Microsoft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-love-stronger-when-its-off-social-media-2771279-2025-08-17",
      "headline": "Why the happiest couples don't post everythingIf you're worried that you and your partner don't post enough about your relationship on social media, it might actually be a good thing and a healthy approach to love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/with-this-treasure-pakistan-army-chief-asim-munirs-rare-earth-boast-after-oil-deal-with-us-2772360-2025-08-17",
      "headline": "With this treasure...: Asim Munir's 'rare earth' boast after oil deal with USAsim Munir's remarks come after US officials expressed interest in Pakistan's mineral reserves, which are vital for the electronics and defence sectors, as Washington seeks to break away from Chinese hegemony and reduce its dependency on Beijing's supply chains amid rising uncertainties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kollam-thulasi-faces-heat-for-sexist-outburst-after-amma-malayalam-film-body-elects-woman-president-shwetha-mennon-2772470-2025-08-17",
      "headline": "Men should rule: Kerala actor's sexist rant after film body elects woman headThe Malayalam film body elected Shwetha Menon as its first female president, marking a landmark moment in Malayalam cinema. However, veteran Kollam Thulasi's sexist remarks have overshadowed the celebration, reigniting debates on industry sexism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-york-restaurant-shooting-in-brooklyn-killed-injured-2772461-2025-08-17",
      "headline": "3 killed, 8 injured in early morning mass shooting at restaurant in BrooklynThe incident occurred just before 3.30 am inside Taste of the City Lounge, located at 903 Franklin Avenue, NYPD Commissioner Jessica Tisch said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-opens-up-on-his-bond-with-daughter-shora-2772500-2025-08-17",
      "headline": "Nawazuddin Siddiqui opens up on his bond with daughter Shora: My biggest criticActor Nawazuddin Siddiqui said his daughter Shora keeps him grounded and often scolds him without caring about his stardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-expressway-project-pm-modi-inaugurate-uer-ii-dwarka-expressway-traffic-advisory-issued-2772281-2025-08-17",
      "headline": "Delhi gets Rs 11,000 crore road push as PM opens 2 highways to decongest capitalThe 10.1-km Delhi section of the Dwarka Expressway and a key stretch of UER-II, built at a combined cost of nearly Rs 11,000 crore, aim to ease traffic congestion and improve the capital's connectivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/keir-starmer-european-leaders-join-zelenskyy-washington-talks-donald-trump-ukraine-war-peace-deal-2772469-2025-08-17",
      "headline": "Keir Starmer, European leaders to join Zelenskyy in Washington talks with TrumpEuropean leaders including Macron, Merz, Starmer, Meloni and von der Leyen will accompany Zelenskyy to Washington for talks with Trump, as the US president pushes Ukraine towards a quick peace deal with Russia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-vs-mohun-bagan-durand-cup-quarter-final-kolkata-stops-2772419-2025-08-17",
      "headline": "When Kolkata stops, it's only for East Bengal vs Mohun Bagan DerbyWhen East Bengal and Mohun Bagan face off, Kolkata doesn't just watch — it holds its breath. Ninety minutes of chaos, colour, and history where football isn't sport, but identity played loud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtuber-elvish-yadavs-gurugram-house-sprayed-with-over-2-dozen-bullets-by-bike-borne-men-cops-at-scene-2772291-2025-08-17",
      "headline": "Over 2 dozen bullets fired at Elvish Yadav's Gurugram home, attackers on the runElvish Yadav was not present at his residence when the firing took place. Bullets riddled the lower floors of the multi-storey house while the controversial YouTuber's family and caretaker remained inside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-514-15-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cloudburst-kills-4-injures-6-in-jammu-kashmirs-kathua-houses-buried-roads-cut-off-rescue-ops-on-2772286-2025-08-17",
      "headline": "7 dead after cloudburst, landslide in J&K's Kathua, Army choppers join rescue opsSeveral houses were buried under rubble and floodwaters in the Ghati area, officials said. Damage was also reported on the Jammu–Pathankot National Highway. Rescue teams are at the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/voter-adhikar-yatra-rahul-gandhi-vote-chori-bihar-tejashwi-yadav-ec-affidavit-congress-2772404-2025-08-17",
      "headline": "Why just me, not BJP? Rahul Gandhi questions poll panel's affidavit demandRahul Gandhi accused the Election Commission of bias, questioning why only he was asked for an affidavit after alleging vote theft. He claimed the BJP manipulated voter rolls and vowed to monitor Bihar's elections closely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-bannerghatta-national-park-leopard-attacks-safari-bus-viral-video-2772319-2025-08-17",
      "headline": "Leopard attacks safari bus in Bengaluru, claws 12-year-old boy's hand. Video viralA safari ride at Bengaluru's Bannerghatta National Park turned tense after a leopard jumped onto a non-AC bus carrying tourists and clawed a 12-year-old boy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-rapes-mother-accused-her-having-affair-haus-qazi-police-2772326-2025-08-17",
      "headline": "Delhi man rapes mother twice after accusing her of having 'bad character'The complainant, accompanied by her 25-year-old daughter, approached cops and alleged that her son, Md Firoz, had assaulted and sexually abused her on multiple occasions this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/form-7-in-voter-id-meaning-uses-and-how-to-apply-2772416-2025-08-17",
      "headline": "Form 7 in voter ID: Meaning, uses and how to applyForm 7 is the official application used by voters to either object to someone's inclusion in the electoral roll or request deletion of a name already listed. You use it when you find entries that don't belong or need removal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/2025-a-year-that-documented-the-fall-of-greats-in-tamil-cinema-shankar-rajinikanth-kamal-haasan-suriya-coolie-thug-life-2771807-2025-08-17",
      "headline": "2025: A year that documented the fall of greats in Tamil cinemaMani Ratnam, Shankar, Kamal Haasan, Suriya, and AR Murugadoss's films were criticised for their creations in 2025. This raises a pertinent question about the audience's changing tastes. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-opens-up-on-his-bond-with-daughter-shora-2772500-2025-08-17",
      "headline": "Nawazuddin Siddiqui opens up on his bond with daughter Shora: My biggest criticActor Nawazuddin Siddiqui said his daughter Shora keeps him grounded and often scolds him without caring about his stardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-relish-lucknow-chaat-ahead-of-param-sundari-release-2772490-2025-08-17",
      "headline": "Janhvi-Sidharth relish Lucknow chaat ahead of Param Sundari release. VideoJanhvi Kapoor and Sidharth Malhotra enjoyed chaat in Lucknow while promoting their upcoming film 'Param Sundari'. The romantic drama, releasing on August 29, has already created buzz with its trailer and the duo's on-screen chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kollam-thulasi-faces-heat-for-sexist-outburst-after-amma-malayalam-film-body-elects-woman-president-shwetha-mennon-2772470-2025-08-17",
      "headline": "Men should rule: Kerala actor's sexist rant after film body elects woman headThe Malayalam film body elected Shwetha Menon as its first female president, marking a landmark moment in Malayalam cinema. However, veteran Kollam Thulasi's sexist remarks have overshadowed the celebration, reigniting debates on industry sexism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-shows-off-his-age-old-outfits-janhvi-kapoor-has-the-sweetest-reaction-2772472-2025-08-17",
      "headline": "Boney Kapoor shows off his age-old outfits, Janhvi has the sweetest reactionBoney Kapoor impressed fans on Instagram by posing in a stylish look featuring his 22-year-old jeans and 18-year-old shirt, paired with a fresh haircut. His daughter Janhvi Kapoor added a sweet \"Wow papa\" comment, while fans showered him with love and nostalgic messages."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-womens-world-cup-spin-challenge-australia-2772492-2025-08-17",
      "headline": "Alyssa Healy, Australia brace for tough spin challenge in Women's World CupAlyssa Healy acknowledged the tough spin-friendly conditions Australia will face at the Women's ODI World Cup. Having returned from injury, Healy is in excellent form, finishing as the top run-scorer in both the T20 and One-Day series against India A. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/khalid-jamil-sunil-chhetri-snub-cafa-nations-cup-india-football-team-2772487-2025-08-17",
      "headline": "Khalid Jamil lifts lid on Chhetri snub: Wanted different faces in CAFA CupKhalid Jamil's first India squad raised eyebrows with the omission of Sunil Chhetri, as the new coach prioritises fresh faces for the CAFA Nations Cup, sparking questions about the legendary striker's long-term international future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-r-ashwin-on-shubman-gill-vs-jaiswal-debate-2772481-2025-08-17",
      "headline": "Asia Cup 2025: R. Ashwin gives his verdict on Shubman Gill vs Jaiswal debateFormer India spinner Ravichandran Ashwin has shared his views on the Shubman Gill vs Yashasvi Jaiswal debate for the upcoming Asia Cup 2025. The two players are in contention to be the backup opener for the continental tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shathira-jakir-jessy-womens-world-cup-umpire-bangladesh-2772474-2025-08-17",
      "headline": "Bangladesh umpire Shathira Jakir Jessy set for historic World Cup stintFormer cricketer Shathira Jakir Jessy will become the first Bangladeshi woman umpire to officiate in a senior World Cup at the Women's ODI World Cup in India. Jessy, who has officiated in various international tournaments, is excited for the opportunity after years of hard work.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-bashir-responds-nathan-lyon-jibe-ashes-2025-2772468-2025-08-17",
      "headline": "I stick to what I believe in: Shoaib Bashir responds to Nathan Lyon's jibeEngland spinner Shoaib Bashir has dismissed Nathan Lyon's critique, insisting he will focus on his own growth ahead of the Ashes. Inspired by Lyon's craft, the 21-year-old aims to recover fully and play a key role in England's bid to reclaim the urn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aqib-javed-india-vs-pakistan-asia-cup-2772463-2025-08-17",
      "headline": "Pakistan's T20 team can beat India: Aqib Javed's bold claim for Asia CupSelector Aqib Javed expressed confidence in Pakistan's ability to beat India in the Asia Cup 2025, praising the strength of the current squad. Despite India's dominant T20I record, Pakistan aims to repeat their 2022 Asia Cup success in the upcoming clash on September 14.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-johnson-test-cricket-privilege-todd-greenberg-cricket-australia-2772458-2025-08-17",
      "headline": "Mitchell Johnson slams Cricket Australia CEO's take on lesser Test matchesMitchell Johnson has slammed calls to restrict Test cricket to elite nations, urging the ICC and boards to \"stop hoarding the privilege and start sharing the responsibility.\" He says the format's future lies in support, not exclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-on-making-rohit-sharma-run-10km-every-day-2772438-2025-08-17",
      "headline": "Rohit Sharma has class to play till 45, make him run 10km every day: Yograj SinghFormer India all-rounder Yograj Singh has slammed Rohit Sharma's critics amid the recent reports of his retirement and urged the cricketer to work on his fitness claiming that he has the ability to play till 45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-mike-hesson-asia-cup-strike-rate-2772432-2025-08-17",
      "headline": "Babar Azam has been asked to improve his strike-rate: Mike HessonPakistan head coach Mike Hesson explained that Babar Azam was left out of the Asia Cup squad due to concerns over his strike rate and performance against spin in T20s, areas where he has been asked to improve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-backs-ravichandran-ashwin-as-future-india-coach-2772429-2025-08-17",
      "headline": "Pujara backs Ashwin as future India coach after stellar careerCheteshwar Pujara, one of India's most dependable Test batters, believes Ravichandran Ashwin has all the qualities to become the national team's coach in the years ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/richarlison-brace-tottenham-burnley-thomas-frank-comments-2772425-2025-08-17",
      "headline": "Thomas Frank hails Richarlison's impact, warns about his injury woesTottenham manager Thomas Frank hailed Richarlison's stunning display against Burnley but urged caution over his fitness, stressing the need to manage him carefully."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-johnson-test-cricket-privilege-todd-greenberg-cricket-australia-2772458-2025-08-17",
      "headline": "Mitchell Johnson slams Cricket Australia CEO's take on lesser Test matchesMitchell Johnson has slammed calls to restrict Test cricket to elite nations, urging the ICC and boards to \"stop hoarding the privilege and start sharing the responsibility.\" He says the format's future lies in support, not exclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-on-making-rohit-sharma-run-10km-every-day-2772438-2025-08-17",
      "headline": "Rohit Sharma has class to play till 45, make him run 10km every day: Yograj SinghFormer India all-rounder Yograj Singh has slammed Rohit Sharma's critics amid the recent reports of his retirement and urged the cricketer to work on his fitness claiming that he has the ability to play till 45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-mike-hesson-asia-cup-strike-rate-2772432-2025-08-17",
      "headline": "Babar Azam has been asked to improve his strike-rate: Mike HessonPakistan head coach Mike Hesson explained that Babar Azam was left out of the Asia Cup squad due to concerns over his strike rate and performance against spin in T20s, areas where he has been asked to improve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-backs-ravichandran-ashwin-as-future-india-coach-2772429-2025-08-17",
      "headline": "Pujara backs Ashwin as future India coach after stellar careerCheteshwar Pujara, one of India's most dependable Test batters, believes Ravichandran Ashwin has all the qualities to become the national team's coach in the years ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/richarlison-brace-tottenham-burnley-thomas-frank-comments-2772425-2025-08-17",
      "headline": "Thomas Frank hails Richarlison's impact, warns about his injury woesTottenham manager Thomas Frank hailed Richarlison's stunning display against Burnley but urged caution over his fitness, stressing the need to manage him carefully."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}