{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-documents-ais-form-16-capital-gains-26-ad-pan-card-aadhar-tax-returns-fy25-2777547-2025-08-27",
      "headline": "Filing ITR for FY 2024-25? Keep these 6 documents handyKeeping your documents in order is the first step to a smooth filing process. Not having the documents in place not only delays the process but also increases the chance of errors in the return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-crypto-platforms-boom-in-grey-zone-says-zerodhas-nithin-kamath-2777489-2025-08-27",
      "headline": "Indian crypto platforms boom in grey zone, says Zerodha's Nithin KamathTraders are increasingly drawn to futures and options (F&O) products in digital assets, lured by high leverage and lower tax costs compared to traditional markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-50-percent-india-exporters-impact-gdp-trade-key-sectors-way-out-pm-modi-donald-trump-2777450-2025-08-27",
      "headline": "Trump's 50% tariff shock: How can exporters shield themselvesThe tariff was announced as a response to India's continued trade with Russia, and it now places Indian products at a disadvantage in the American market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-to-itr-filing-here-is-how-to-create-your-account-on-the-e-filing-portal-2777447-2025-08-27",
      "headline": "New to ITR filing? Here's how to create your account on the e-filing portalNew taxpayers often wonder how to start their ITR journey, and the answer is simple: create your account on the e-filing portal to access all tax-related services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-indian-leather-footwear-exports-impact-trade-cle-russia-africa-markets-kanpur-piyush-goyal-2777387-2025-08-27",
      "headline": "Indian leather industry eyes expansion in Russian, African markets amid US tariffsTrade delegations are set to visit Russia and Africa soon, with Commerce Minister Piyush Goyal expected to lead the mission in Russia. Buyer-seller meets are also planned in African countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-ganesh-chaturthi-2025-nse-bse-close-derivatives-trading-details-us-tariff-2777143-2025-08-27",
      "headline": "Ganesh Chaturthi 2025: Is stock market open for trading today?The stock market holiday list for 2025 is available on the official BSE (Bombay Stock Exchange) website. Earlier, markets were closed on August 15 for Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/how-will-trumps-50-tariff-impact-indian-economy-and-its-exports-2777315-2025-08-27",
      "headline": "How will Trump's 50% tariff impact Indian economy and its exports?The United States has escalated its trade dispute with India, imposing new tariffs that bring the total rate to 50% on certain goods. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/what-impact-will-trumps-50-tariff-have-on-the-indian-economy-experts-weigh-in-2777272-2025-08-26",
      "headline": "How will Trump's 50% tariff impact Indian economy? Experts weigh inThe discussion centres on the implications of a 50% tariff threatened by Donald Trump on Indian goods. Experts analyse the potential impact on India's economy, particularly labour-intensive sectors such as textiles, leather, gems and jewellery. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/papa-johns-pizza-returns-to-india-with-first-outlet-in-bengaluru-plans-650-stores-by-2035-2777192-2025-08-26",
      "headline": "Papa John's to return to India with Bengaluru outlet, plans 650 stores by 2035US-based Papa John's will re-enter India this October, opening its first store in Bengaluru and targeting 650 outlets by 2035. The pizza chain, which exited in 2017 due to poor performance, has partnered with Pulsar Capital and UAE's PJP Investments Group as master franchisees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-appoints-amit-kapur-to-lead-new-ai-and-services-transformation-unit-2777191-2025-08-26",
      "headline": "TCS appoints Amit Kapur to lead new AI and services transformation unitIn a bid to deepen its AI capabilities, TCS has named Amit Kapur as the head of its newly formed AI and services transformation unit, effective September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-credit-history-how-lenders-are-opening-doors-for-new-borrowers-2777127-2025-08-26",
      "headline": "No credit history? How lenders are opening doors for new borrowersFor decades, a blank credit history meant a closed door to loans. Now, fintechs and banks are rewriting the rules—using digital footprints and alternative data to bring first-time borrowers into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pmo-holds-high-level-meet-on-us-tariff-impact-explores-relief-for-exporters-2777081-2025-08-26",
      "headline": "PM holds high-level meet on US tariff impact, explores relief for exportersThe PMO on Tuesday held a high-level meeting with senior ministers and officials from the Finance and Commerce Ministries to frame India's response to the US decision to double tariffs on Indian goods to 50% from Wednesday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-rents-luxury-property-mumbai-juhu-girlfriend-saba-azad-2777468-2025-08-27",
      "headline": "Hrithik Roshan rents luxury property in Mumbai's Juhu to girlfriend Saba AzadActor Hrithik Roshan has rented his sea-facing luxury property in Juhu to his girlfriend, Saba Azad, for Rs 75,000 monthly rent. The rental agreement also includes a security deposit of Rs 1.2 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-return-to-hyderabad-after-india-day-parade-in-us-2777551-2025-08-27",
      "headline": "Masks on: Vijay Deverakonda, Rashmika Mandanna return to Hyderabad after US tripActors Vijay Deverakonda and Rashmika Mandanna were seen at the Hyderabad airport on Wednesday after they returned from the US. The duo attended the India Day Parade and several other events in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lik-first-punch-love-meets-evolutionship-in-pradeep-ranganathan-2040-story-love-insurance-kompany-2777526-2025-08-27",
      "headline": "LIK first punch: Love meets evolutionship in Pradeep Ranganathan's 2040 storyWritten and directed by Vignesh Shivan, 'LIK' aka 'Love Insurance Kompany' stars Pradeep Ranganathan and Krithi Shetty in a rom-com set in the year 2040. The 'First Punch' teaser also revealed that the film is scheduled to release in theatres this Diwali."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-3-latest-written-update-day-2-gaurav-khanna-abhishek-bajaj-nominated-tanya-mittal-ashnoor-kaur-clash-2777452-2025-08-27",
      "headline": "Bigg Boss 19 episode 3: 7 contestants nominated, Tanya-Ashnoor's clash escalatesThe first nomination of 'Bigg Boss 19' took place on Tuesday, with Farrhana Bhatt observing the process from the secret room. Neelam Giri, Tanya Mittal, Abhishek Bajaj and Gaurav Khanna are some of the nominated contestants. Meanwhile, Tanya and Ashnoor Kaur clashed over house duties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-in-bigg-boss-19-is-annoying-entitled-but-absolute-tv-gold-2777511-2025-08-27",
      "headline": "Tanya Mittal in Bigg Boss 19 is annoying, entitled, but absolute TV goldLove her or hate her, Tanya Mittal is already the talking point of 'Bigg Boss 19'. From demanding to be called \"Ma'am\" and bragging about royal security to throwing around unsolicited knowledge, the self-proclaimed queen has become Miss Pick Me of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engaged-selena-gomez-gigi-hadid-celebs-congratulate-2777488-2025-08-27",
      "headline": "Taylor Swift-Travis Kelce engaged: Selena Gomez, Gigi Hadid and celebs send loveSinger Taylor Swift announced her engagement to boyfriend Travis Kelce on August 26. Several stars congratulated the duo and sent their love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vash-level-2-review-krishnadev-yagnik-film-amplifies-terror-2777484-2025-08-27",
      "headline": "Vash Level 2 review: Krishnadev Yagnik's sequel is raw, chaotic and unsettlingRelease Date:Wed Aug 27, 2025Vash Level 2, the sequel to the 2023 Gujarati hit, dives into a darker, chaotic horror narrative with themes of innocence corrupted\r\n The film offers intense visuals and performances but struggles with pacing in its latter half"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-went-the-extra-mile-preeti-jhangiani-recalls-his-humility-on-mohabbatein-sets-2777436-2025-08-27",
      "headline": "SRK helped me with lip-sync, sat on floor with spot boys: Actor Preeti JhangianiActor Preeti Jhangiani recalled how Shah Rukh Khan's humility and support on the sets of 'Mohabbatein' had a lasting impact on her. She shared that SRK never behaved like a superstar and even helped her overcome struggles during the song 'Soni Soni'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-removes-shoes-airport-fan-gifts-chhatrapati-sambhaji-maharaj-idol-watch-2777429-2025-08-27",
      "headline": "Vicky Kaushal removes shoes at airport as fan gifts Sambhaji Maharaj idol. WatchActor Vicky Kaushal's recent gesture of removing his shoes after a fan gifted him a Chhatrapati Sambhaji Maharaj idol has surfaced online. The clip has left fans impressed, with many praising his respectful move in the comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-opens-up-on-daughter-nysa-devgn-bollywood-debut-talks-about-nepo-babies-2777388-2025-08-27",
      "headline": "Kajol opens up on daughter Nysa Devgn's Bollywood debut, talks about nepo-babiesKajol, in a recent interaction, talked about daughter Nysa Devgan's plans to join Bollywood. She also shared her thoughts on the nepo-baby debate, saying scrutiny is an inevitable part of the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-daughter-misha-turns-9-mira-rajput-posts-adorable-birthday-wish-2777408-2025-08-27",
      "headline": "Shahid Kapoor's daughter Misha turns 9, Mira Rajput posts adorable birthday wishShahid Kapoor and Mira Rajput's daughter Misha turned nine on August 26, with Mira sharing a heartfelt birthday post and a rare picture of her. The post received warm wishes from celebrities, including Ananya Panday and Neha Dhupia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-chennai-express-comparisons-param-sundari-cant-group-all-south-indians-together-deepika-srk-2777401-2025-08-27",
      "headline": "Janhvi, Sidharth reject Chennai Express parallels with Param SundariJanhvi Kapoor and Sidharth Malhotra are gearing up for the release of their upcoming film, Param Sundari.' The two stars recently reacted to comparisons with Deepika Padukone and Shah Rukh Khan's 'Chennai Express.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-dreamy-proposal-engagement-missouri-ed-kelce-shares-2777397-2025-08-27",
      "headline": "Taylor-Travis engaged 2 weeks ago in Missouri, Ed Kelce reveals dreamy proposalDid you know that Taylor Swift and Travis Kelce got engaged in Missouri almost two weeks ago? Kelce's father, Ed, discussed the planning that went on and how the two broke the news to their parents and friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lara-dutta-rejected-bipasha-basu-role-20-years-of-no-entry-challenge-myself-anees-bazmee-salman-khan-fardeen-khan-2777386-2025-08-27",
      "headline": "Lara Dutta rejected Bipasha Basu's role in No Entry: Wanted to challenge myselfActor Lara Dutta recently recalled rejecting Bipasha Basu's role in 'No Entry'. In a heartfelt note on the film's 20th anniversary, she stated how she wanted to challenge herself with the character. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engagement-married-internet-reaction-2777369-2025-08-27",
      "headline": "Taylor Swift engaged to Travis Kelce, Internet awaits Royal American weddingTaylor Swift and Travis Kelce, the IT couple, announced their engagement in a joint post on Instagram. Soon after the post was made, the Swifties expressed their joy on social media, calling it a fairytale dream that came true."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bruce-willis-wife-emma-shares-health-update-dementia-advocates-for-caregivers-2777282-2025-08-26",
      "headline": "Bruce Willis' wife Emma shares update on his dementia, advocates for caregiversActor Bruce Willis' wife Heming Willis opened up about her journey caring for Bruce Willis after his FTD diagnosis. She aimed to raise awareness and provide guidance for other caregivers facing similar challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engagement-pics-love-story-now-has-a-ring-dreamy-proposal-2777287-2025-08-26",
      "headline": "Taylor Swift-Travis Kelce's love story now has a ring. See engagement picsTaylor Swift and Travis Kelce are now engaged. The couple shared a few dreamy pictures from their romantic moment on social media and announced the good news to fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-feeds-underprivileged-children-outside-noida-metro-station-viral-video-2777245-2025-08-26",
      "headline": "Honey Singh feeds underprivileged children at Noida metro station, video goes viralRapper Yo Yo Honey Singh was seen sharing food with children outside Noida metro station. The compassionate act has touched many hearts and sparked widespread social media appreciation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/odum-kuthira-chaadum-kuthira-onam-release-fahadh-faasil-kalyani-priyadarshan-viral-reel-2777213-2025-08-26",
      "headline": "Fahadh Faasil, Kalyani Priyadarshan recreate iconic comedy sceneFahadh Faasil and Kalyani Priyadarshan star in 'Odum Kuthira Chaadum Kuthira', a film set for Onam release, featuring a blend of comedy and fantasy. The star cast of the film recreated a viral scene from 'Mookkilla Rajyathu', with Kalyani Priyadarshan calling it their acting workshop."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/30-dead-several-injured-after-heavy-rain-triggered-landslide-on-vaishno-devi-yatra-route-in-jk-2777356-2025-08-27",
      "headline": "34 dead as rain pounds J&K, Jhelum over danger mark, landslide hits Vaishno Devi Yatra UpdatesA landslide triggered by heavy rain claimed 34 lives and left 23 others injured along the Mata Vaishno Devi Yatra track in Katra. Officials fear more people may be trapped under the debris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-stopped-india-pakistan-flare-up-threatening-high-tariffs-glbs-2777337-2025-08-27",
      "headline": "7 jets shot down, claims Trump as he doubles down on mediating India-Pak truceThe US President said he pressured Indian Prime Minister Narendra Modi to ease tensions with Pakistan, warning of steep tariffs if the conflict escalated. Trump claimed his blunt warning prompted quick action from New Delhi.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/khalistani-gurpatwant-singh-pannun-bats-for-punjab-origin-trucker-who-killed-3-us-canada-india-heres-more-2777529-2025-08-27",
      "headline": "Khalistani Pannun bats for Punjab-origin trucker who killed 3 in USKhalistani terrorist Gurpatwant Singh Pannun is now defending Punjab-origin truck driver Harjinder Singh, who killed three people in Florida after making an illegal U-turn and working in the US illegally. Singh faces three counts of vehicular homicide.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/family-sues-openai-after-16-year-old-dies-by-suicide-following-months-of-chats-with-chatgpt-2777435-2025-08-27",
      "headline": "OpenAI sued after 16-year-old dies by suicide following months of chats with ChatGPTThe parents of 16-year-old Adam Raine have filed a lawsuit against OpenAI after their son died by suicide following months of harmful interactions with ChatGPT. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/environment/story/floods-china-india-pakistan-heavy-rains-landslides-rainfall-flash-floods-2777523-2025-08-27",
      "headline": "Flood fury in India, China, Pakistan: Here's why it's raining so muchIndia, Pakistan, and China have witnessed massive landslides due to heavy rainfall. Urbanisation, industrialisation, and deforestation have escalated climate change, leading to changes in morning patterns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trumps-50-tariffs-kick-today-us-india-ties-hit-new-low-key-points-glbs-2777351-2025-08-27",
      "headline": "Trump's 50% tariffs kick in, India stands firm as duties set to pinch exportersAccording to US President Donald Trump, the higher levies, which double the previous 25 per cent tariff, are intended to push Russian President Vladimir Putin toward negotiations with Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-ipl-retirement-indian-premier-league-2777440-2025-08-27",
      "headline": "R Ashwin retires from IPL amid trade rumours, sets sight on overseas leaguesIndia spinner Ravichandran Ashwin announced his retirement from the Indian Premier League on Wednesday, August 27. Ashwin announced his retirement via a post on his social media accounts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-man-files-case-against-hyundai-deepika-padukone-srk-over-defective-car-2777358-2025-08-27",
      "headline": "Rajasthan man files case against Hyundai, Deepika Padukone, SRK over defective carKirti Singh, in his complaint, alleged that the dealership assured him the car was trouble-free, promising to take responsibility in case of any defect. However, soon after purchase, the car started showing serious technical faults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/taylor-swift-engagement-ring-dress-details-travis-kelce-2777490-2025-08-27",
      "headline": "Taylor Swift's engagement ring: Co-designed with love, by Travis KelceHere's everything you need to know about Taylor Swift's dazzling engagement ring, her chic striped dress, and the statement watch she wore for her dreamy proposal with Travis Kelce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fiji-pm-sitiveni-rabuka-on-trump-tariffs-on-india-somebody-not-happy-but-you-will-weather-it-2777491-2025-08-27",
      "headline": "Somebody isn't happy with you: Fiji PM to PM Modi as Trump tariffs kick inThe South Pacific nation's Prime Minister reached New Delhi on Sunday for a three-day visit aimed at strengthening Fiji's partnership with India across sectors including maritime security, trade, and health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-kolkata-urdu-academy-invitation-javed-akhtar-protests-jamiat-ulema-e-hind-wahyahin-foundation-muslims-2777527-2025-08-27",
      "headline": "Speaks against Allah, Islam: Jamiat warns Urdu Academy on hosting Javed AkhtarThe West Bengal Urdu Academy's decision to invite poet-lyricist Javed Akhtar as chief guest for a Kolkata mushaira has triggered protests from two Muslim groups. The Jamiat Ulema-e-Hind and the Wahyahin Foundation have claimed that Akhtar has repeatedly \"spoken against religion and God\" and demand the invitation be withdrawn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/we-taught-ai-to-optimise-not-to-care-and-that-should-scare-us-2777443-2025-08-27",
      "headline": "We taught AI to optimise - not to care. And that should scare usAI doesn't understand ethics but it understands patterns. We like to call these systems \"intelligent,\" but they're not. At least not in any human sense. They don't know what's fair. They don't care what's just. They don't wrestle with ambiguity. They don't understand nuance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/prithipal-singh-murder-sundeep-mishra-book-gunned-down-2777525-2025-08-27",
      "headline": "Beyond the Podium: Are we failing our Champions?They brought India glory, but found little support after. As medals faded, so did respect. What do we really offer our sporting heroes once the spotlight is gone?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/private-school-spending-almost-9-times-higher-than-public-government-survey-2777541-2025-08-27",
      "headline": "Families pay 9 times more for private than public school students: Government surveyA national government survey has shown that while government schools educate the majority of children, households spend vastly more per child in private schools. The average household outlay per student in non-government schools was Rs 25,002, compared with Rs 2,863 in government schools. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-open-lemonade-stand-adorable-video-shows-players-chatting-with-children-2777502-2025-08-27",
      "headline": "Video: Jannik Sinner, Aryna Sabalenka chat with children at US Open lemonade standVideos shared on the tournament's official social media handles went viral, documenting players' wholesome conversations with the children. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trouble-in-nda-as-up-minister-slams-bjp-end-alliance-if-theres-no-benefit-2777558-2025-08-27",
      "headline": "Trouble in NDA as UP minister slams BJP: End alliance if there's no benefitSanjay Nishad's outburst is rooted in his anger against BJP leaders from the Nishad community, whom he believes are being promoted to weaken his party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/ganesh-chaturthi-2025-festival-photo-gallery-pics-celebrations-pandals-lalbaugcha-raja-mumbai-hyderabad-kolkata-2777420-2025-08-27",
      "headline": "Ganesh Chaturthi 2025: Stunning pictures of festive celebrations across IndiaFrom Mumbai's iconic Lalbaugcha Raja pandals to vibrant celebrations, devotees welcomed Lord Ganesha with grandeur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/reliance-owned-vantara-sit-probe-supreme-court-illegal-animal-trade-money-laundering-2777557-2025-08-27",
      "headline": "Top court-appointed special team on Vantara affairs to hold first meet tomorrowThe Special Investigation Team (SIT), formed by the Supreme Court, has been tasked with probing allegations of illegal animal trade, smuggling and financial irregularities in Reliance-owned Vantara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-50-percent-india-exporters-impact-gdp-trade-key-sectors-way-out-pm-modi-donald-trump-2777450-2025-08-27",
      "headline": "Trump's 50% tariff shock: How can exporters shield themselvesThe tariff was announced as a response to India's continued trade with Russia, and it now places Indian products at a disadvantage in the American market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-guwahati-maharaja-prithu-flyover-gnb-road-himanta-biswa-sarma-king-who-defeated-invader-bakhtiyar-khilji-2777016-2025-08-27",
      "headline": "Who's King Prithu who destroyed Nalanda-raider Khilji, made him retire?The Himanta Biswa Sarma-led Assam government's decision to name Guwahati's GNB Flyover 'Maharaj Prithu Flyover' has revived the heroic tales of King Prithu, the 13th-century raja of Kamrupa. When Khilji, after attacking Nalanda and invading Bengal, was marching through Kamrupa with 12,000 cavalry and 20,000 infantry fighters, Raja Prithu led a multi-community force and decimated Khilji's army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/sleep-deprivation-eye-health-corneal-repair-risks-2777481-2025-08-27",
      "headline": "Not just dark circles, sleepless nights can damage your visionIn this week's Health 6/6, we explore how disrupted sleep can cause serious corneal damage and vision problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kartarpur-corridor-punjab-border-villages-flooded-heavy-rainfall-rescue-operations-2777480-2025-08-27",
      "headline": "Video: Kartarpur corridor almost submerged as River Ravi swells after heavy rainGurdwara Darbar Sahib Kartarpur, believed to be the final resting place of Guru Nanak and a central pilgrimage site for Sikhs, now stands surrounded by floodwaters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-hit-dragged-for-metres-dies-in-crash-involving-16-year-old-driver-2777412-2025-08-27",
      "headline": "Caught on CCTV: Delhi man dies after being run over by car driven by 16-year-oldAccording to police, the car was being driven by a 16-year-old who suddenly swerved, causing the vehicle to hit the victim."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-55-year-old-tribal-woman-gives-birth-17th-child-rajasthan-poverty-2777359-2025-08-27",
      "headline": "Udaipur woman, 55, gives birth to 17th child. Her family collects scrap to surviveA 55-year-old tribal woman in Udaipur gave birth to her 17th child, with her family facing extreme poverty and homelessness despite government schemes. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-chennai-super-kings-tribute-retirement-ipl-2777544-2025-08-27",
      "headline": "CSK pays heartfelt tribute to 'thirupurra sundaran' R Ashwin after IPL retirementR Ashwin announced his retirement from the Indian Premier League, ending an illustrious stint with Chennai Super Kings. The five-time champions paid a rich tribute to the off-spinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-retires-ipl-top-moments-csk-punjab-kings-dc-rr-2777534-2025-08-27",
      "headline": "Ashwin retires from IPL: Top moments of spin great's Indian Premier League careerRavichandran Ashwin bid farewell to the Indian Premier League after an illustrious career spanning 221 matches and 187 wickets. He won back-to-back IPL titles with Chennai Super Kings in 2010 and 2011 and captained Punjab Kings in 2018, leading them to six victories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/prithipal-singh-murder-sundeep-mishra-book-gunned-down-2777525-2025-08-27",
      "headline": "Beyond the Podium: Are we failing our Champions?They brought India glory, but found little support after. As medals faded, so did respect. What do we really offer our sporting heroes once the spotlight is gone?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lockie-ferguson-recalls-ms-dhoni-key-delivery-leave-2019-world-cup-semi-final-2777496-2025-08-27",
      "headline": "MS Dhoni's shocking leave in the 2019 World Cup recalled by FergusonNew Zealand fast bowler Lockie Ferguson has revealed he was 'surprised' to see MS Dhoni leave deliveries during the 2019 World Cup semi-final against India at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-clarke-skin-cancer-surgery-urges-regular-skin-checks-2777456-2025-08-27",
      "headline": "Michael Clarke grateful after skin cancer removed in fresh health scareFormer Australia captain Michael Clarke has revealed that he has undergone another surgery to remove skin cancer, urging fans to prioritise health check-ups and stay vigilant about sun safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-bengaluru-bulls-team-preview-exclusive-2777372-2025-08-27",
      "headline": "Pressure and Promise: Bengaluru Bulls coach Ramesh lays out bold PKL 12 visionBengaluru Bulls hit the reset button ahead of Pro Kabaddi League Season 12, with new coach BC Ramesh taking charge after Randhir Singh Sehrawat's exit. Ramesh opens up on pressure, strategy, and building a balanced squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-ipl-retirement-indian-premier-league-2777440-2025-08-27",
      "headline": "R Ashwin retires from IPL amid trade rumours, sets sight on overseas leaguesIndia spinner Ravichandran Ashwin announced his retirement from the Indian Premier League on Wednesday, August 27. Ashwin announced his retirement via a post on his social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/becky-lynch-ozzy-osbourne-fight-2777433-2025-08-27",
      "headline": "Becky Lynch's Ozzy jab sparks Kelly Osbourne's fiery responseBecky Lynch's heel promo in Birmingham saw her insult Ozzy Osbourne weeks after his death. This sparked a furious response from Kelly Osbourne, daughter of Ozzy, on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-shankar-to-join-hanuma-vihari-at-tripura-leaves-tamil-nadu-2777417-2025-08-27",
      "headline": "Vijay Shankar to join Hanuma Vihari at Tripura, set to leave Tamil NaduIndia all-rounder Vijay Shankar is set to turn out for Tripura in the upcoming domestic season after securing a No Objection Certificate (NOC) from the Tamil Nadu Cricket Association. The 33-year-old's move comes shortly after former India batter Hanuma Vihari also signed up with the North-Eastern side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/esports-nations-cup-2026-all-details-2777418-2025-08-27",
      "headline": "Esports Nations Cup: Country-based multi-game format to debut in 2026The Esports Nations Cup debuts in 2026, pitting countries head to head in Riyadh with multiple games, national pride, and global participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-narendra-modi-chess-world-cup-goa-2777415-2025-08-27",
      "headline": "FIDE Chess World Cup: PM Modi delighted to host event in IndiaPrime Minister Narendra Modi was elated to host the FIDE Chess World Cup. The PM took to X to express his joy on Wednesday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-ipl-retirement-indian-premier-league-2777440-2025-08-27",
      "headline": "R Ashwin retires from IPL amid trade rumours, sets sight on overseas leaguesIndia spinner Ravichandran Ashwin announced his retirement from the Indian Premier League on Wednesday, August 27. Ashwin announced his retirement via a post on his social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/becky-lynch-ozzy-osbourne-fight-2777433-2025-08-27",
      "headline": "Becky Lynch's Ozzy jab sparks Kelly Osbourne's fiery responseBecky Lynch's heel promo in Birmingham saw her insult Ozzy Osbourne weeks after his death. This sparked a furious response from Kelly Osbourne, daughter of Ozzy, on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-shankar-to-join-hanuma-vihari-at-tripura-leaves-tamil-nadu-2777417-2025-08-27",
      "headline": "Vijay Shankar to join Hanuma Vihari at Tripura, set to leave Tamil NaduIndia all-rounder Vijay Shankar is set to turn out for Tripura in the upcoming domestic season after securing a No Objection Certificate (NOC) from the Tamil Nadu Cricket Association. The 33-year-old's move comes shortly after former India batter Hanuma Vihari also signed up with the North-Eastern side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/esports-nations-cup-2026-all-details-2777418-2025-08-27",
      "headline": "Esports Nations Cup: Country-based multi-game format to debut in 2026The Esports Nations Cup debuts in 2026, pitting countries head to head in Riyadh with multiple games, national pride, and global participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-narendra-modi-chess-world-cup-goa-2777415-2025-08-27",
      "headline": "FIDE Chess World Cup: PM Modi delighted to host event in IndiaPrime Minister Narendra Modi was elated to host the FIDE Chess World Cup. The PM took to X to express his joy on Wednesday night."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}