{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unacademy-ceo-gaurav-munjal-denies-reports-of-sale-deal-with-allen-career-institute-2646516-2024-12-07",
      "headline": "Not doing any sale: Unacademy CEO Gaurav Munjal denies reports of takeover dealReports earlier suggested that Allen Career Institute was in talks to acquire Unacademy for $800 million, significantly lower than its peak valuation of $3.4 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-can-become-the-ai-capital-of-the-world-metas-sandhya-devanathan-2646252-2024-12-07",
      "headline": "India can become the AI capital of the world: Meta's Sandhya DevanathanSandhya Devanathan, Vice President and Head of India at Meta, discusses the company's AI initiatives, including Meta AI and Llama models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/we-are-going-to-be-future-ready-priyank-kharge-on-ai-transforming-job-market-2646186-2024-12-06",
      "headline": "We are going to be future ready: Priyank Kharge on AI transforming job marketSharing his thoughts on AI creating a job deficit, Priyank Kharge, Minister of IT and Biotechnology of Karnataka said that technological evolution creates new opportunities rather than eliminating them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forging-the-future-cp-gurnani-aditya-ghosh-discuss-ais-role-in-empowering-india-2646110-2024-12-06",
      "headline": "Forging the future: CP Gurnani, Aditya Ghosh discuss AI's role in empowering IndiaCP Gurnani highlighted the necessity of blending AI with human capabilities. Aditya Ghosh emphasised the accessibility of AI, calling this era a \"magical time\" akin to the Industrial Revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/firms-leveraging-ai-to-empower-workforce-on-right-track-says-professor-das-narayandas-2645981-2024-12-06",
      "headline": "Firms using AI to empower workforce likely to excel in future: Professor Das NarayandasSpeaking at the India Today-Business Today AI Conference 2024, during a session titled 'Leadership.Change.AI', he emphasised that organisations focusing on how AI can augment their workforce are likely to emerge as industry leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-factors-behind-strong-rallt-2645945-2024-12-06",
      "headline": "Paytm share price hits 52-week high today. What's driving the rally?Paytm share price: The stock jumped 3.60% to hit a 52-week high of Rs 990.90 on Friday. At the closing bell, the stock settled 1.89% higher at Rs 974.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-rbi-mpc-sensex-nifty-end-flat-as-rbi-maintains-status-quo-on-interest-rates-2645938-2024-12-06",
      "headline": "Sensex, Nifty end flat as RBI maintains status quo on interest ratesThe S&P BSE Sensex lost 56.74 points to end at 81,709.12, while the NSE Nifty50 was down 30.60 points to close at 24,677.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claims-denied-zerodha-ceo-nithin-kamath-explains-why-and-what-you-can-do-2645903-2024-12-06",
      "headline": "Insurance claims denied? Nithin Kamath explains why and what you can doNithin Kamath warns that having insurance doesn't guarantee full claims and lists common rejection reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mcx-share-price-hits-rs-7000-milestone-as-stock-rallies-over-8-percent-high-volume-2645915-2024-12-06",
      "headline": " MCX share price hits Rs 7,000 milestone as stock rallies over 8%The stock has delivered an impressive growth trajectory, with gains of over 100% in the past year, over 300% in the last three years, and more than 500% over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-today-jumps-over-6-percent-explained-2645894-2024-12-06",
      "headline": "Explained: Why Vedanta share price jumped over 6% todayThe surge in stock price follows an announcement from Vedanta Resources Finance II PLC, a subsidiary of VRL, that it had redeemed the full amount of $1.2 billion in bonds due in 2025 but extended to 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcements-repo-rate-unchanged-homebuyers-may-have-to-wait-till-2025-for-emi-relief-2645893-2024-12-06",
      "headline": "RBI MPC: Homebuyers may have to wait till 2025 for EMI reliefThe RBI has kept key lending rates unchanged with Governor Shaktikanta Das explaining the Monetary Policy Committee's (MPC) focus on economic stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-crr-to-4-how-this-liquidity-boost-will-benefit-the-economy-2645873-2024-12-06",
      "headline": "RBI cuts CRR to 4%: How this liquidity boost will benefit economyThe decision to cut CRR is expected to benefit the banking sector, particularly public sector banks, by lowering the cost of funds and increasing lending capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-to-activate-uan-for-employment-linked-incentive-eli-scheme-to-december-15-2645519-2024-12-06",
      "headline": "EPFO extends deadline to activate UAN for ELI scheme. Check final dateThe EPFO has extended the deadline to link UAN and Aadhaar under the ELI scheme to mid-December, aiming to boost job creation with incentives for employees and employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-increases-upi-lite-transaction-limit-how-will-customers-benefit-upi-rule-changes-upi-lite-app-2645455-2024-12-06",
      "headline": "RBI increases UPI Lite transaction limit: How will you benefit?The RBI has increased transaction limits for UPI Lite, making digital payments more convenient, flexible, and accessible for customers, especially for low-value and offline transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-policy-repo-rate-action-crticisim-piyush-goyal-nirmala-sitharaman-2645843-2024-12-06",
      "headline": "'Our job is…': RBI Governor defends policy amid criticism over lending ratesShaktikanta Das explained that the decision to hold rates stems from a dual focus on managing inflation and supporting growth. He acknowledged the recent rise in inflation, primarily due to food prices, and the moderation in economic growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-cash-reserve-ratio-crr-understanding-rbi-liquidity-management-tool-how-will-crr-impact-economy-2645799-2024-12-06",
      "headline": "What is Cash Reserve Ratio? Understanding RBI's liquidity management toolThe RBI cut the Cash Reserve Ratio (CRR) to 4% on December 6, injecting Rs 1.16 lakh crore into the banking system to boost liquidity, credit flow, and economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-rates-unchanged-cuts-crr-to-4-what-it-means-for-stock-market-2645804-2024-12-06",
      "headline": "RBI keeps key rates unchanged, cuts CRR to 4%: What it means for stock marketAt 11:23 am, the Sensex was down 13.04 points at 81,752.82, while the Nifty50 declined 12.05 points to trade at 24,695.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-key-takeaways-lower-gdp-forecast-crr-boost-inflation-projection-new-podcast-ai-2645801-2024-12-06",
      "headline": "Lower GDP forecast to CRR boost: 6 key takeaways from RBI MPCThe MPC decided by a 4-2 majority to maintain the policy repo rate at 6.5%. Governor Shaktikanta Das explained that this decision was based on an assessment of the economy and financial conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-crr-cash-reserve-ration-reduced-to-4-percent-2645782-2024-12-06",
      "headline": "RBI reduces CRR to 4% for liquidity boost. 3 things to know The RBI MPC has kept the key lending rates unchanged to 6.5% as its focus remains on bringing inflation under control. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syrian-rebels-claim-to-enter-capital-damascus-no-sign-of-army-deployment-news-agency-reuters-2646610-2024-12-08",
      "headline": "End of dark era: Syrian rebels capture Damascus as President Assad fleesSyrian rebel forces entered the capital, Damascus, facing no resistance from the military, reports Reuters. President Bashar al-Assad has reportedly fled, boarding a plane to an unknown destination amid the rebel advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-protest-march-punjab-haryana-delhi-chalo-shambhu-border-talks-government-2646614-2024-12-08",
      "headline": "Farmers to resume protest march to Delhi today, say Centre in no mood to talkFarmer leaders accused the Central government of having no intention to engage in talks with them and announced that a 100-member group would march to Delhi from Shambhu on the Punjab-Haryana border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankart-on-russia-ukraine-war-doha-forum-panel-zelenskyy-putin-modi-2646617-2024-12-08",
      "headline": "S Jaishankar on criticism of India buying Russian oil: Do you have a better dealSpeaking at the 22nd edition of the Doha Forum panel, S Jaishankar gave a stern reply to a question on India's decision to import crude oil from Russia amidst the ongoing Russia-Ukraine war. Moscow has emerged as the largest supplier of crude oil to India, accounting for more than 35 per cent of the country's imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-test-day-3-live-cricket-score-rohit-sharma-rishabh-pant-pat-cummins-adelaide-oval-2646612-2024-12-08",
      "headline": "IND vs AUS 2nd Test, Day 3 Live: India bowled out for 175, set 19-run targetIndia vs Australia, 2nd Test Day 3 Live: Australia are on the brink of winning this Test match. Mitchell Starc, Pat Cummins and Scott Boland have bowled out India for just 175 runs in the second innings, setting a 19-run target for the hosts. Nitish Kumar Reddy top scores for India with 42, while Cummins picks up 5 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/bhut-jolokia-lost-its-sting-bhot-naga-mircha-raja-mirchi-worlds-hottest-ghost-chilli-pepper-scoville-heat-unit-2646592-2024-12-08",
      "headline": "How heat of Bhut Jolokia, once world's hottest pepper, has ghosted usBhut Jolokia or Naga Mircha from India's northeast was recorded as the world's hottest chilli pepper in 2007. It is becoming a victim of its fame and witnessing an erosion in its heat quotient. Here's what led to the Ghost Pepper losing its sting and what can be done to preserve its heat and unique flavour."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/diljit-dosanjh-indore-show-protest-bajrang-dal-vhp-non-vegetarian-kfc-2646635-2024-12-08",
      "headline": "Bajrang Dal protests at Diljit Dosanjh's Indore concert venue over liquor saleBajrang Dal and VHP workers protested against liquor and non-vegetarian counters at Diljit Dosanjh's concert venue in Indore, claiming that it hurt religious sentiments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/crickee-travid-head-lied-mohammed-siraj-reflects-on-aggressive-send-off-in-adelaide-2646627-2024-12-08",
      "headline": "Travis Head lied: Mohammed Siraj's revelation on aggressive send-off in AdelaideMohammed Siraj opened up about his aggressive send-off to Travis Head on Day 2 of the Adelaide Test. Siraj claimed Travis Head was lying when he said 'well-bowled' after getting dismissed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-bullet-ridden-bodies-of-2-cops-found-in-udhampur-probe-on-2646646-2024-12-08",
      "headline": "Bodies of 2 cops with bullet injuries found in J&K, police hint at suicideThe slain policemen were travelling from north Kashmir's Sopore to Reasi's Talwara in Jammu region for training. Their bullet-ridden bodies were found near a temple in Udhampur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/diljit-dosanjh-fans-sing-ikk-kudi-in-bengaluru-metro-post-concert-viral-viral-2646643-2024-12-08",
      "headline": "Diljit Dosanjh's fans sing Ikk Kudi in Bengaluru metro post-concert. Video goes viralDiljit Dosanjh's fans kept the party alive post the singer's Bengaluru concert when a group of them started to sing 'Ikk Kudi' inside a metro coach. A video has gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/maharashtra-assembly-session-erupts-after-opposition-boycott-over-evm-tampering-2646599-2024-12-08",
      "headline": "Maharashtra Assembly session erupts in protest over EVM tampering chargesAccusations of EVM manipulation in Markatwadi sparked protests and a boycott of the Maharashtra Assembly's special session. Opposition leaders are demanding transparency, with prominent figures such as Sharad Pawar and Rahul Gandhi planning visits to the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hostages-matan-zangauker-hamas-videos-ceasefire-gaza-october-7-attack-palestine-netanyahu-2646605-2024-12-08",
      "headline": "Time is running out: Hamas releases video of 24-year-old Israeli hostage Matan Zangauker, the Israeli man abducted during Hamas's October 7 attack, urged negotiations for the release of captives and expressed his disappointment in the efforts of Benjamin Netanyahu's government to secure their freedom."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-aqi-in-poor-category-light-rain-predicted-winters-to-intesnify-2646625-2024-12-08",
      "headline": "Delhi air quality remains 'poor', light rain today expected to intensify coldThe Central Pollution Control Board (CPCB) recorded an overall air quality index of 272 at 8 am. At least two stations, Bawana and Anand Vihar, reported \"Very Poor\" air quality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vinod-kambli-like-my-son-1983-team-will-take-care-of-him-sunil-gavaskar-2646620-2024-12-08",
      "headline": "Vinod Kambli like my son, 1983 team will take care of him: Sunil GavaskarThe 1983 World Cup winning team assured that they would take care of former India cricketer Vinod Kambli. He has been battling with serious health issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-priest-george-koovakad-elevated-as-cardinal-by-pope-francis-2646573-2024-12-07",
      "headline": "Indian priest George Koovakad elevated as cardinal by Pope FrancisIn a grand ceremony at the Vatican, Indian priest George Jacob Koovakad was elevated to cardinal by Pope Francis. Koovakad's appointment brings the total number of Indian cardinals to six."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mohammed-shami-jasprit-bumrah-injury-scare-2646575-2024-12-08",
      "headline": "Should India rush in Shami for Brisbane Test after Bumrah's injury scare? AUS vs IND, 2nd Test: Jasprit Bumrah has been a vital member of the Indian team, but he faced an injury scare during his spell on Day 2 of the second Test against Australia at the Adelaide Oval. Should India rush Mohammed Shami to Australia?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performance-o-o-jane-jane-da-bangg-the-tour-reloaded-concert-dubai-2646644-2024-12-08",
      "headline": "Watch: Salman Khan's enthralling performance at Dubai concertSalman Khan's performance at Da-Bangg The Tour Reloaded in Dubai was a hit among the fans. Several videos from the concert have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-maharashtra-is-a-mandate-for-modi-30-2024-maharashtra-assembly-election-results-2646156-2024-12-06",
      "headline": "How Maharashtra is a mandate for Modi 3.0The landslide win has put the BJP on a stronger wicket after the general election setback and laid the ground for development at full steam"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-jyotiraditya-scindia-sukanta-majumdar-walk-the-ramp-at-bharat-mandapam-2646586-2024-12-07",
      "headline": "Watch: Jyotiraditya Scindia, Sukanta Majumdar walk the ramp at Bharat MandapamUnion Minister Jyotiraditya Scindia and Minister of State Sukanta Majumdar participated in the Ashtalakshmi Mahotsav fashion show held at Bharat Mandapam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/norte-dame-reopens-in-paris-after-5-years-of-restoration-firefighters-honoured-2646593-2024-12-08",
      "headline": "Notre Dame reopens 5 years after fire; Trump, Zelenskyy, Elon Musk attendThe restored Notre Dame Cathedral was reopened with a ceremony led by Archbishop Laurent Ulrich and attended by world leaders, including President Macron and US President-elect Trump, marking the end of a five-year restoration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-emmanuel-macron-handshake-duels-viral-video-notre-dame-reopening-zelenskyy-2646608-2024-12-08",
      "headline": "Video: Trump, Macron's intense, 17-second handshake at Notre Dame is viralThe leaders' initial handshake on the palace steps was a forceful display, with Trump pulling Macron's hand toward his body as they embraced and exchanged white-knuckled, back-and-forth grips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-politics-business-entertainment-435-07-12-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/unitedhealth-ceo-brian-thompson-killer-identified-new-york-city-mayor-eric-adams-2646606-2024-12-08",
      "headline": "UnitedHealth CEO's killer identified, says New York City Mayor: ReportBrian Thompson, UnitedHealth CEO since 2021, was shot in the back on Wednesday in a targeted attack by a masked assailant lying in wait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariff-threat-brics-countries-s-jaishankar-us-dollar-currency-2646585-2024-12-08",
      "headline": "On Trump's tariff threat, Jaishankar says India never for de-dollarisationResponding to Donald Trump's 100 per cent tariff threat, External Affairs Minister (EAM) S Jaishankar said that India has never been for de-dollarisation and that there is no proposal to have a Brics currency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/katrina-kaif-vicky-kaushal-mumbai-airport-wedding-anniversary-2646648-2024-12-08",
      "headline": "Video: Katrina Kaif-Vicky Kaushal leave for holiday ahead of anniversaryKatrina Kaif and Vicky Kaushal were clicked at the Mumbai airport on December 8. The couple is believed to have jett off to an undisclosed destination to celebrate their wedding anniversary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performance-o-o-jane-jane-da-bangg-the-tour-reloaded-concert-dubai-2646644-2024-12-08",
      "headline": "Watch: Salman Khan's enthralling performance at Dubai concertSalman Khan's performance at Da-Bangg The Tour Reloaded in Dubai was a hit among the fans. Several videos from the concert have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-daughter-malti-marie-nick-jonas-new-york-anniversary-2646634-2024-12-08",
      "headline": "Priyanka Chopra shares 'magic' moments with daughter Malti and Nick JonasPriyanka Chopra recently charmed fans with adorable pictures from her New York trip with daughter Malti Marie and husband Nick Jonas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-box-office-allu-arjun-breaks-records-600-crore-sukumar-rashmika-mandanna-rrr-fahadh-faasil-2646624-2024-12-08",
      "headline": "Pushpa 2 box office Day 3: Allu Arjun's film hits Rs 600 crore markAllu Arjun's Pushpa 2 has taken the box office by storm. The film emerged as the only Indian movie to cross the Rs 600 crore mark in just three days. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-w-vs-ind-w-ellyse-completes-4000-odi-runs-hits-72-ball-hundred-vs-india-2646640-2024-12-08",
      "headline": "AUS-W vs IND-W: Ellyse completes 4000 ODI runs, hits fastest hundred vs India Ellyse Perry hit the fastest ODI hundred against the Indian women's team as she completed her 3rd century in the format. Australia went on to post a mammoth target of 372 runs vs India in Brisbane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/crickee-travid-head-lied-mohammed-siraj-reflects-on-aggressive-send-off-in-adelaide-2646627-2024-12-08",
      "headline": "Travis Head lied: Mohammed Siraj's revelation on aggressive send-off in AdelaideMohammed Siraj opened up about his aggressive send-off to Travis Head on Day 2 of the Adelaide Test. Siraj claimed Travis Head was lying when he said 'well-bowled' after getting dismissed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mohammed-shami-jasprit-bumrah-injury-scare-2646575-2024-12-08",
      "headline": "Should India rush in Shami for Brisbane Test after Bumrah's injury scare? AUS vs IND, 2nd Test: Jasprit Bumrah has been a vital member of the Indian team, but he faced an injury scare during his spell on Day 2 of the second Test against Australia at the Adelaide Oval. Should India rush Mohammed Shami to Australia?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/vinod-kambli-like-my-son-1983-team-will-take-care-of-him-sunil-gavaskar-2646620-2024-12-08",
      "headline": "Vinod Kambli like my son, 1983 team will take care of him: Sunil GavaskarThe 1983 World Cup winning team assured that they would take care of former India cricketer Vinod Kambli. He has been battling with serious health issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-test-day-3-live-cricket-score-rohit-sharma-rishabh-pant-pat-cummins-adelaide-oval-2646612-2024-12-08",
      "headline": "IND vs AUS 2nd Test, Day 3 Live: Starc, Cummins put Australia on brink of winIndia vs Australia, 2nd Test Day 3 Live: Australia are on the brink of winning this Test match. Mitchell Starc and Pat Cummins have bowled brilliantly in the morning and have nearly wiped out the Indian team in Adelaide. Rishabh Pant, R Ashwin and Harshit Rana have been sent back to the dugout already."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-joe-root-bazballs-to-36th-test-hundred-emulates-rahul-dravid-2646611-2024-12-08",
      "headline": "Watch: Joe Root Bazballs to 36th Test hundred, emulates Rahul DravidNZ vs ENG: Joe Root reached his 36th Test hundred and equalled Rahul Dravid's tally of centuries in the format. Root became the 5th joint-highest Test centurion with the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-assam-cricketer-devajit-saikia-acting-secretary-bcci-2646587-2024-12-07",
      "headline": "Former Assam cricketer Devajit Saikia appointed acting secretary of BCCI Devajit Saikia has been appointed as the acting secretary of the BCCI by Board President Roger Binny. He takes over the role from Jay Shah, who recently assumed the position of the new ICC President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-adelaide-travis-head-2646584-2024-12-07",
      "headline": "Picked my moments: Head on putting 'pressure' on India in AdelaideAUS vs IND: Travis Head talked about his brilliant century in the Adelaide Test against India. The left-hander scored 140 runs with the help of 17 fours and four sixes, putting Australia in a position of strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-joe-root-bazballs-to-36th-test-hundred-emulates-rahul-dravid-2646611-2024-12-08",
      "headline": "Watch: Joe Root Bazballs to 36th Test hundred, emulates Rahul DravidNZ vs ENG: Joe Root reached his 36th Test hundred and equalled Rahul Dravid's tally of centuries in the format. Root became the 5th joint-highest Test centurion with the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-assam-cricketer-devajit-saikia-acting-secretary-bcci-2646587-2024-12-07",
      "headline": "Former Assam cricketer Devajit Saikia appointed acting secretary of BCCI Devajit Saikia has been appointed as the acting secretary of the BCCI by Board President Roger Binny. He takes over the role from Jay Shah, who recently assumed the position of the new ICC President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-adelaide-travis-head-2646584-2024-12-07",
      "headline": "Picked my moments: Head on putting 'pressure' on India in AdelaideAUS vs IND: Travis Head talked about his brilliant century in the Adelaide Test against India. The left-hander scored 140 runs with the help of 17 fours and four sixes, putting Australia in a position of strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-travis-head-cheteshwar-pujara-short-ball-adelaide-test-2646579-2024-12-07",
      "headline": "India did not exploit Travis Head's weakness against short balls: Pujara AUS vs IND: Cheteshwar Pujara said that India should have bowled more short balls to Travis Head, who scored 140 runs and put Australia in a commanding position in the second Test at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-asia-cup-final-india-vs-bangladesh-livestreaming-details-squads-dubai-2646566-2024-12-07",
      "headline": "U-19 Asia Cup final, India vs Bangladesh: When and where to watch summit clashThe stage is set for the U-19 Asia Cup Final as India will take on the defending champions, Bangladesh, in an exciting clash. Both teams will be banking on current form and get their hands on the title on Sunday, December 8."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-auction-bengaluru-players-list-2646564-2024-12-07",
      "headline": "Heather Knight, Deandra Dottin head list of 120 players in auction WPL 2025: Deandra Dottin, Heather Knight and Lizelle Lee have the highest base price for the upcoming Women's Premier League auction to be held on December 15 in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-adelaide-day-night-test-comeback-stats-2646554-2024-12-07",
      "headline": "How realistic are India's chances of making a comeback in Adelaide?  AUS vs IND, 2nd Test: With India trailing by 29 runs in their second innings with only five wickets in hand, is there any hope for them to bounce back at the Adelaide Oval? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-captaincy-trolling-aus-vs-ind-border-gavaskar-trophy-adelaide-test-2646545-2024-12-07",
      "headline": "Rohit Sharma's captaincy heavily criticised as India surrender in AdelaideIndia captain Rohit Sharma was heavily trolled on social media after India's poor day in the field on Day 2 of the second Test match against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-game-10-d-gukesh-father-question-singapore-2646547-2024-12-07",
      "headline": "D Gukesh's dad a chess player? Indian grandmaster gives witty responseD Gukesh had a witty response when asked if his father is the first chess player he talks to after Game 10 of the World Chess Championship against Ding Liren on Saturday, December 7. Gukesh and Liren played out another draw on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-mohammed-shami-sunil-gavaskar-interview-2646544-2024-12-07",
      "headline": "Tough for Mohammed Shami to play Brisbane Test, says Sunil Gavaskar AUS vs IND: In an interview with India Today, Sunil Gavaskar said that India would find it tough to rope in Mohammed Shami for the Brisbane Test, starting December 14. The pacer recently returned to playing competitive cricket for Bengal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-morne-morkel-aus-vs-ind-adelaide-australia-vs-india-travis-head-2646536-2024-12-07",
      "headline": "Jasprit Bumrah injury scare: Bowling coach Morne Morkel gives updateIndia's bowling coach Morne Morkel gave an update on star India fast bowler Jasprit Bumrah after he suffered an injury scare on Day 2 of the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-captaincy-trolling-aus-vs-ind-border-gavaskar-trophy-adelaide-test-2646545-2024-12-07",
      "headline": "Rohit Sharma's captaincy heavily criticised as India surrender in AdelaideIndia captain Rohit Sharma was heavily trolled on social media after India's poor day in the field on Day 2 of the second Test match against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-game-10-d-gukesh-father-question-singapore-2646547-2024-12-07",
      "headline": "D Gukesh's dad a chess player? Indian grandmaster gives witty responseD Gukesh had a witty response when asked if his father is the first chess player he talks to after Game 10 of the World Chess Championship against Ding Liren on Saturday, December 7. Gukesh and Liren played out another draw on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-mohammed-shami-sunil-gavaskar-interview-2646544-2024-12-07",
      "headline": "Tough for Mohammed Shami to play Brisbane Test, says Sunil Gavaskar AUS vs IND: In an interview with India Today, Sunil Gavaskar said that India would find it tough to rope in Mohammed Shami for the Brisbane Test, starting December 14. The pacer recently returned to playing competitive cricket for Bengal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-morne-morkel-aus-vs-ind-adelaide-australia-vs-india-travis-head-2646536-2024-12-07",
      "headline": "Jasprit Bumrah injury scare: Bowling coach Morne Morkel gives updateIndia's bowling coach Morne Morkel gave an update on star India fast bowler Jasprit Bumrah after he suffered an injury scare on Day 2 of the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-day-2-rohit-sharma-footwork-issues-sunil-gavaskar-adelaide-2646535-2024-12-07",
      "headline": "Sunil Gavaskar suggests exercises to Rohit Sharma to overcome footwork issuesSunil Gavaskar feels that Rohit Sharma needs to do some exercise before coming in to bat after his failure in the pink-ball Test. The India captain's footwork was the cause of his downfall in both innings of the match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/cricket-australia-vs-india-2nd-test-mohammed-siraj-travis-head-sunil-gavaskar-2646533-2024-12-07",
      "headline": "Siraj has to curb his aggression: Gavaskar on heated exchange with HeadAUS vs IND, 2nd Test: Sunil Gavaskar said that Mohammed Siraj needs to curb his aggression to avoid finding himself in trouble. On Saturday, Siraj gave Travis Head a fiery send-off after the latter scored a hundred on Day 2 of the Day-Night Test at the Adelaide Oval.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gus-atkinson-hat-trick-new-zealand-vs-england-nz-vs-eng-wellington-2646527-2024-12-07",
      "headline": "Gus Atkinson 'more greedy' after claiming hat-trick vs New Zealand in 2nd TestEngland fast bowler Gus Atkinson etched his name in history books as he registered a hat-trick against New Zealand on Day 2 of the second Test in Wellington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-game-10-d-gukesh-vs-ding-liren-draw-singapore-2646520-2024-12-07",
      "headline": "Gukesh, Liren play out draw in Game 10 as deadlock continues in seriesThe stalemate between D Gukesh and Ding Liren in the World Chess Championship continued on Saturday, December 7 as Game 10 also ended in a draw. Both men are now tied at 5-5 with 4 more games remaining in the series. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}