{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-withdraws-external-influence-claims-after-talks-with-employees-madhabi-puri-buch-2600643-2024-09-16",
      "headline": "Sebi withdraws 'external influence' claims after talks with employeesJust under two weeks ago, Sebi had issued a statement suggesting that external forces were behind the unrest among its staff, which was seen as an attempt to discredit the organisation and its leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-listing-bonanza-missed-alternate-options-experts-explained-2600641-2024-09-16",
      "headline": "Missed Bajaj Housing Finance listing day rally? Check these alternate optionsBajaj Housing Finance bumper listing: By the end of the trading session, the company's stock price stood at Rs 164.99, marking a significant increase over its IPO issue price. But for those who missed out on the listing day windfall, what are the next steps?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oberoi-inheritance-war-siblings-clash-over-late-prs-oberois-will-vikramjit-natasha-arjun-anastasia-2600606-2024-09-16",
      "headline": "Oberoi inheritance war: Siblings clash over late PRS Oberoi's willOn one side are Vikramjit Oberoi, Natasha Oberoi, and Arjun Oberoi. On the other side is Anastasia Oberoi, PRS Oberoi's daughter from his second marriage to Mirjana Jojic Oberoi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-upper-circuit-bumper-listing-what-next-investor-trading-strategy-2600532-2024-09-16",
      "headline": "Bajaj Housing Finance shares hit upper circuit after bumper listing: What's next?Bajaj Housing Finance listing: By midday, the shares hit an upper circuit at Rs 164.99, representing an overall premium of 135.70% over the IPO price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mf-radhika-gupta-ceo-does-not-own-luxury-cars-depreciating-asset-owns-innova-2600494-2024-09-16",
      "headline": "'Can afford, but won't buy': Edelweiss MF CEO on not owning luxury carsEdelweiss MF Radhika Gupta CEO currently owns an Innova, which is known for its practicality and reliability rather than for being a luxury car."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/branch-manager-to-ceo-how-atul-jain-transformed-bajaj-housing-finance-2600465-2024-09-16",
      "headline": "From branch manager to CEO: How Atul Jain transformed Bajaj Housing FinanceAtul Jain, now 52, has been with the Bajaj Group for over two decades. He began his career in investment banking, working as a project executive at PNB Capital Services Limited and later at Prudential Capital Markets Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-bumper-listing-multibagger-gains-gmp-what-should-investors-do-2600452-2024-09-16",
      "headline": "Bajaj Housing Finance shares list at 114% premium. What should investors do? With Bajaj Housing Finance shares debuting at a staggering 114% premium, investors face a pivotal choice: lock in profits now or stay the course for potential long-term rewards. Find out what experts suggest for your next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kross-shares-list-flat-on-dalal-street-rs-240-book-profit-or-hold-expert-view-2600424-2024-09-16",
      "headline": "Kross shares list flat on D-Street: Should you book profit or hold? Kross listing: Shares of Kross made a flat debut opening at Rs 240 on NSE and BSE, the same as its IPO price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-market-listing-blockbuster-debut-114-percent-premium-book-profit-or-hold-2600411-2024-09-16",
      "headline": "Bajaj Housing Finance turns multibagger on listing: Book profits or hold?Bajaj Housing Finance IPO listing: With this blockbuster entry on Dalal Street, the key dilemma for investors is now whether to book profits immediately or hold onto their positions for long-term gains.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-rally-as-fed-rate-cut-looms-markets-stay-bullish-bajaj-housing-finance-debut-2600405-2024-09-16",
      "headline": "Sensex, Nifty rally as Fed rate cut looms; markets stay bullishThe S&P BSE Sensex added 169.53 points to 83,060.47, while the NSE Nifty50 gained 62.55 points to 25,419.05"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-list-at-114-premium-over-ipo-price-at-rs-150-2600399-2024-09-16",
      "headline": "Bajaj Housing Finance makes bumper debut as shares list at 114% premiumBajaj Housing Finance listing: The shares were allocated to successful bidders on September 13, and the listing gains of Rs 80 per share slightly exceeded the grey market premium (GMP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-september-16-2024-precious-metals-record-hike-on-mcx-2600384-2024-09-16",
      "headline": "Gold, silver price today, September 16, 2024: Precious metals record hike on MCXGold Price Today September 16, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-and-major-smartphone-brands-samsung-xiaomi-motorola-face-antitrust-heat-report-2600139-2024-09-15",
      "headline": "Amazon, Flipkart and major smartphone brands face antitrust heat: ReportThe Competition Commission of India (CCI) has found that these companies have been involved in exclusive product launches on their platforms, which may have restricted competition and harmed smaller businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rent-vs-buy-expert-views-smarter-financial-move-for-you-2599981-2024-09-15",
      "headline": "Rent vs buy: What's the smarter financial move for you?Renting offers the freedom to move, explore career opportunities, and invest in other ventures. Buying a home, on the other hand, offers long-term security, a sense of ownership, and equity building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-approves-madhya-pradeshs-request-for-soybean-procurement-at-msp-2599830-2024-09-14",
      "headline": "Centre approves Madhya Pradesh's request for soybean procurement at MSPUnion Agriculture and Farmer Welfare Minister Shivraj Singh Chouhan confirmed that the proposal from the Madhya Pradesh government was received and approved late Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-export-price-limit-basmati-rice-onion-outbound-shipments-and-enhance-farmers-income-2599748-2024-09-14",
      "headline": "Centre lifts minimum export price cap on onion, basmati riceThe $950 per tonne minimum export price for basmati rice has been removed while the export duty on onion has been cut to 20 per cent from 40 per cent, in effect from September 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-expected-listing-gains-double-investors-wealth-latest-gmp-2599745-2024-09-14",
      "headline": "Bajaj Housing Finance IPO: Will it double investors' wealth on market debut?Bajaj Housing Finance IPO listing: With the GMP indicating a significant upside, all eyes are now on whether the shares will live up to the hype and deliver the bumper listing gains many expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-2024-trump-allies-plan-to-privatise-fannie-and-freddie-says-report-2599379-2024-09-13",
      "headline": "Trump allies plan to privatise Fannie and Freddie, says reportThe discussions involve prominent figures close to Trump, including Larry Kudlow, the former director of the National Economic Council, and John McEntee, who previously worked in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-dhaval-address-conflict-of-interest-charges-3-big-clarifications-joint-statemet-2599223-2024-09-13",
      "headline": "Sebi chief addresses conflict of interest allegations with 3 big clarificationsThe Buchs firmly denied any wrongdoing, offering detailed explanations to counter allegations tied to consulting roles, rental income, and Madhabi Puri Buch's ICICI Bank stock options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-share-market-strong-rally-break-bajaj-finance-finserv-2599227-2024-09-13",
      "headline": "Sensex, Nifty end lower as markets take breather after strong rallyThe S&P BSE Sensex fell 135.83 points to 82,926.88, while the NSE Nifty50 settled 43 points lower at 25,345.90."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-chief-minister-mamata-banerjee-invites-protesting-doctors-meeting-deadlock-kolkata-2600473-2024-09-16",
      "headline": "Mamata Banerjee's 'fifth and final' invite to protesting doctors for talks todayThe protesting doctors will decide if they accept Bengal Chief Minister Mamata Banerjee's invitation after a general body meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-resignation-delhi-cm-news-political-sixer-five-big-reasons-aam-aadmi-party-aap-delhi-assembly-election-2600535-2024-09-16",
      "headline": "Kejriwal's move to resign is a political sixer. 5 big reasons whyArvind Kejriwal's decision to resign as the Chief Minister of Delhi is a calculated political move. From removing the corruption taint to beating anti-incumbency to gaining from the anti-BJP momentum in the Opposition camp, here are five big reasons why this is Kejriwal's political sixer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-donald-trump-assassination-attempt-secret-service-ryan-wesley-routh-2600575-2024-09-16",
      "headline": "Trump was about to putt when shots were fired. Then, Secret Service noticed rifleAs Trump lined up his shot at his West Palm Beach club on Monday, the Secret Service caught something unusual: the muzzle of a rifle barrel poking through the bushes near the fence line."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/germany-cologne-city-blast-police-operation-2600569-2024-09-16",
      "headline": "Explosion in Germany's Cologne, major police operation underwayA major explosion occurred outside a nightclub in Germany's Cologne city, following which the police launched a \"major operation\" in the area. No injuries or loss of lives were reported after the explosion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-hockey-on-field-fight-video-2600583-2024-09-16",
      "headline": "Watch: Heated moments in close India vs Pakistan hockey thriller in ChinaAsian Champions Trophy Hockey: India and Pakistan produced a thriller in their final round-robin game. Tempers flared in the final quarter of the match on Saturday before India clinched a 2-1 victory. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/caste-census-centre-mulls-adding-caste-column-to-census-sources-2600451-2024-09-16",
      "headline": "Centre deliberating on adding caste column to census, no decision yet: SourcesThe government is considering to include a caste column in the next census. Parties across the political spectrum have been demanding a caste census. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-phase-ii-ahmedabad-metro-rail-project-inaugurate-gujarat-visit-2600623-2024-09-16",
      "headline": "PM Modi inaugurates 2nd phase of Ahmedabad Metro Rail ProjectPrime Minister Modi inaugurated the project, which has been built at a cost of Rs. 5,384 crore, during his first visit to Gujarat since the Lok Sabha polls. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vande-bharat-train-row-trinamool-congress-mp-saket-gokhale-ministry-of-railways-2600543-2024-09-16",
      "headline": "Fake news: Railways fact-checks Trinamool MP alleging 50% hike in Vande Bharat costsIn response to Gokhale's claim, the Ministry of Railways clarified that the total cost of a train is calculated by multiplying the cost per coach by the number of coaches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-aditi-rao-hydari-marriage-briday-entry-wanaparthy-telangana-2600549-2024-09-16",
      "headline": "Pics: Siddharth can't stop smiling as Aditi Rao makes her bridal entryAditi Rao Hydari's bridal entry was straight out of a movie scene. Siddharth couldn't stop smiling when he saw her for the first time at the wedding venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/choreographer-jani-master-accused-of-sexually-abusing-21-year-old-zero-fir-filed-2600550-2024-09-16",
      "headline": "Telugu choreographer Jani Master accused of sexually abusing woman, case filedA 21-year-old woman accused Telugu choreographer Jani Master of sexually abusing her several times during their outdoor shoots. The police have now filed a zero FIR in the case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/shogun-star-anna-sawai-becomes-first-asian-woman-to-win-best-actress-emmy-2600544-2024-09-16",
      "headline": "Shogun star Anna Sawai becomes first Asian woman to win Best Actress EmmyAnna Sawai won the Emmy for Best Actress in a Drama for her role in Shogun, making her the first actor of Asian descent to achieve this honour. She expressed gratitude to her cast and crew, especially co-star Hiroyuki Sanada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-on-donald-trump-second-assassination-joe-biden-kamala-harris-2600352-2024-09-16",
      "headline": "No one is even trying to assassinate...: Elon Musk on Trump Florida shooting In a post on X, tech billionaire Elon Musk made a controversial statement targeting the Biden-Harris administration and questioned why no one is trying to assassinate US President Joe Biden and Vice President Kamala Harris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-wins-best-actress-at-siima-2024-aaradhya-takes-pics-of-mom-on-stage-2600363-2024-09-16",
      "headline": "Aishwarya Rai wins Best Actress at SIIMA 2024, Aaradhya turns photographerAishwarya Rai Bachchan and daughter Aaradhya Bachchan wore blingy outfits at SIIMA 2024, held in Dubai. The actor won the Critics award for her performance as Nandini in Ponniyin Selvan: Part 2. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/baramulla-encounter-drobe-footage-explainer-jammu-and-kashmir-indian-army-2600441-2024-09-16",
      "headline": "Video explainer on dramatic Baramulla anti-terror op captured in drone footageThree terrorists were killed on Saturday following an overnight gunbattle with security forces in Jammu and Kashmir's Baramulla district, officials said, terming it as a \"significant success\" ahead of the assembly elections. In a video of the encounter, captured on a drone, one of the three terrorists can be seen running out of the building in a bid to escape. However, security personnel opened fire on him, following which he was shot dead. The Union Territory is witnessing an increase in terrorist attacks over the past few weeks ahead of Assembly polls there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manish-sisodia-arvind-kejriwal-meeting-residence-today-resignation-announcement-next-delhi-chief-minister-buzz-2600409-2024-09-16",
      "headline": "Arvind Kejriwal likely to resign tomorrow, seeks time to meet Lt Governor: SourcesArvind Kejriwal dropped a bombshell on Sunday, announcing that he would resign as the Delhi Chief Minister in the next two days. His announcement came days after he was granted bail by the Supreme Court in liquor policy case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/renukaswamy-murder-case-police-raids-bengaluru-prison-actor-darshan-thoogudeepa-viral-photo-2600462-2024-09-16",
      "headline": "Phones, knives found in Bengaluru jail where actor Darshan was given VIP treatmentThe police raid comes after a photo of actor and murder accused Darshan Thoogudeepa chilling out with a gangster, Wilson Garden Naga, inside a prison went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/bal-gangadhar-tilak-transformed-ganesh-chaturthi-movement-against-british-2600618-2024-09-16",
      "headline": "How Bal Gangadhar Tilak turned Ganesh Chaturthi into an anti-British movementBal Gangadhar Tilak's innovative approach to Ganesh Chaturthi redefined its role from a private religious observance into a vibrant public festival. By transforming the celebration into a platform for political and social unity, Tilak harnessed its cultural significance to galvanise resistance against British colonial rule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-donald-trump-assassination-attempt-ryan-wesley-routh-gunman-ak-47-rifle-fbi-2600349-2024-09-16",
      "headline": "Who is Ryan Routh, Ukraine supporter arrested for shooting at Trump in FloridaThe alleged gunman, whom authorities have identified as 58-year-old Ryan Wesley Routh, earlier on social media stated that \"democracy is on the ballot\" this year and \"we cannot lose.\" "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-abhijit-mondal-police-officer-save-accused-sanjoy-roy-cremate-body-haste-cbi-exclusive-2600466-2024-09-16",
      "headline": "Kolkata cop tried to save rape accused, got victim's body cremated in haste: CBIThe CBI has alleged that senior Kolkata cop Abhijit Mondal tried to protect RG Kar hospital rape-murder accused Sanjoy Roy, and got the trainee doctor's body hurriedly cremated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/ios-18-to-start-rolling-out-today-here-is-what-you-should-do-before-installing-2600366-2024-09-16",
      "headline": "iOS 18 to start rolling out today: Here is what you should do before installingiOS 18 is all set to come to India today. Here is how you can prepare your device for the installation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/priyanka-chopra-reacts-to-viral-video-of-little-girl-explaining-why-she-doesnt-take-studies-seriously-2600542-2024-09-16",
      "headline": "Little girl explains why she doesn't take studies seriously, Priyanka Chopra reactsPriyanka Chopra reacted to a viral video of a little girl explaining why she doesn't take her studies seriously. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-professor-reaction-college-students-prank-viral-video-2600477-2024-09-16",
      "headline": "Bengaluru professor's reaction after students play a prank on him is viral. VideoA group of students of Bengaluru's Christ University decided to play a prank on their professor. His reaction has gone viral on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/polaris-dawn-mission-complete-what-did-the-spacex-astronauts-achieve-2600560-2024-09-16",
      "headline": "Polaris Dawn mission: All that the SpaceX astronauts achievedThe Crew Dragon spacecraft splashed down in the Gulf of Mexico near Florida's Dry Tortugas in the predawn darkness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-roorkee-study-delhi-floods-linked-urbanisation-climate-change-2600541-2024-09-16",
      "headline": "Delhi's 2023 floods linked to rapid urbanisation, climate change: IIT RoorkeeIIT Roorkee researchers warned that rapid urbanisation along the Yamuna floodplains in Delhi, worsened by climate change, is escalating flood risks, urging sustainable urban planning to prevent future disasters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/superstar-rajinikanth-vettaiyan-audio-launch-prevue-event-september-20-tj-gnanavel-2600640-2024-09-16",
      "headline": "Rajinikanth, Amitabh Bachchan's Vettaiyan audio launch and prevue event date is outThe makers of Superstar Rajinikanth and Amitabh Bachchan's Vettaiyan announced the audio launch and prevue event date on social media. The film will hit theatres on October 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-anand-tiwari-on-bad-newz-box-office-failure-never-expected-numbers-2600632-2024-09-16",
      "headline": "Director Anand Tiwari on Bad Newz box office failure: Never expected numbers In a recent chat with India Today.in, director Anand Tiwari addressed the dismal box office collection of his film Bad Newz, stating that he never expected any specific numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sohum-shah-on-tumbbad-2-and-competing-with-stree-and-munjya-franchise-exclusive-2600597-2024-09-16",
      "headline": "Sohum Shah on Tumbbad 2 and competing with Stree and Munjya franchise | ExclusiveIn an exclusive interview with us, actor, director and producer Sohum Shah talked about making Tumbbad 2at a time when Maddock Films has already established a horror-comedy universe with films based on folklore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-sunita-on-losing-their-3-month-old-daughter-her-lungs-did-not-develop-2600564-2024-09-16",
      "headline": "Govinda's wife Sunita on losing their 3-month-old daughter: Her lungs didn't developSunita Kapoor revealed she raised her son Yashvardhan in a cocoon after losing a premature daughter. She never left her children to the care of servants. Sunita married Govinda in 1987.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-in-greater-noida-paved-way-for-hallway-test-cricket-for-new-zealand-stars-2600622-2024-09-16",
      "headline": "Rain in Greater Noida paved way for hallway Test cricket for New Zealand starsRachin Ravindra revealed that the New Zealand team kept themselves entertained by playing a Test series in the corridors of their team hotel in Greater Noida. The one-off Test between Afghanistan and New Zealand was abandoned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-south-korea-semifinal-live-score-asian-champions-trophy-hulunbuir-2600617-2024-09-16",
      "headline": "Asian Champions Trophy semi-final: Harmanpreet's India aim final berthIndia vs South Korea hockey live score and updates, Asian Champions Trophy 2024: Unbeaten India are taking on South Korea in the semi-final in Hulunbuir in China. India defeated Korea 3-1 in the round-robin stage and are favourites to reach their second successive final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lankas-wellalage-samarawickrama-crowned-icc-players-of-the-month-for-august-2600610-2024-09-16",
      "headline": "Dunith Wellalage crowned ICC Men's Player of the Month for August 2024The International Cricket Council (ICC) announced Sri Lanka players Dunith Wellalage and Harshitha Samarawickrama as the ICC Players of the Month for August 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-vacation-in-america-american-football-dhoni-retirement-2600604-2024-09-16",
      "headline": "MS Dhoni relishes vacation with friends in USA, watches American footballLegendary India cricketer MS Dhoni was seen enjoying his holiday in USA as he was in attendance to watch American football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-hockey-on-field-fight-video-2600583-2024-09-16",
      "headline": "Watch: Heated moments in close India vs Pakistan hockey thriller in ChinaAsian Champions Trophy Hockey: India and Pakistan produced a thriller in their final round-robin game. Tempers flared in the final quarter of the match on Saturday before India clinched a 2-1 victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marseille-set-to-sign-france-midfielder-adrien-rabiot-as-free-agent-2600555-2024-09-16",
      "headline": "France midfielder Adrien Rabiot set to join Marseille as free agentAdrien Rabiot is set to join Marseille, having agreed to a deal in principle after leaving Juventus. The French midfielder's return to Ligue 1 marks a significant move for the club, pending a medical examination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2011-dravid-played-his-final-odi-kohli-scored-1st-hundred-on-english-soil-2600553-2024-09-16",
      "headline": "OTD in 2011: Dravid played his final ODI, Kohli scored 1st hundred on English soilOn this day in 2011, Rahul Dravid played his final ODI innings for India during the 5th match of the series against England in Cardiff. In the same match, Kohli scored his first-ever hundred on English soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-ravi-shasti-adelaide-test-36-all-out-karaoke-night-virat-kohli-2600545-2024-09-16",
      "headline": "Ravi Shastri organised karaoke night after 36-all out in Adelaide: R AshwinOff-spinner R Ashwin recalled how Ravi Shastri helped improve the morale in the Indian dressing room after they lost to Australia in Adelaide in 2020. India were bundled out for 36, their lowest total in Test cricket history. However, India bounced back from that defeat and won the series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-ind-vs-ban-rohit-sharma-najmul-hossain-shanto-2600527-2024-09-16",
      "headline": "IND vs BAN: Sunil Gavaskar's stern message for hosts: 'Can't put their guard down'Legendary India batter Sunil Gavaskar has sent a stern message for Indian cricket team ahead of the two-match Test series against Bangladesh beginning from September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-reaction-manchester-city-alleged-financial-breaches-case-2600526-2024-09-16",
      "headline": "Manchester City innocent until proven guilty: Pep GuardiolaManchester City manager Pep Guardiola has reiterated his belief in the Premier League club's innocence as the independent trial into the team's alleged financial breaches begins.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-announce-16-member-squad-for-home-test-series-vs-new-zealand-2600516-2024-09-16",
      "headline": "Sri Lanka announce 16-member squad for home Test series vs New ZealandSri Lanka announced a 16-member squad for the home Test series against New Zealand. The hosts showcased faith in the youngsters, who were brilliant in their performances against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2011-dravid-played-his-final-odi-kohli-scored-1st-hundred-on-english-soil-2600553-2024-09-16",
      "headline": "OTD in 2011: Dravid played his final ODI, Kohli scored 1st hundred on English soilOn this day in 2011, Rahul Dravid played his final ODI innings for India during the 5th match of the series against England in Cardiff. In the same match, Kohli scored his first-ever hundred on English soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-ravi-shasti-adelaide-test-36-all-out-karaoke-night-virat-kohli-2600545-2024-09-16",
      "headline": "Ravi Shastri organised karaoke night after 36-all out in Adelaide: R AshwinOff-spinner R Ashwin recalled how Ravi Shastri helped improve the morale in the Indian dressing room after they lost to Australia in Adelaide in 2020. India were bundled out for 36, their lowest total in Test cricket history. However, India bounced back from that defeat and won the series 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-ind-vs-ban-rohit-sharma-najmul-hossain-shanto-2600527-2024-09-16",
      "headline": "IND vs BAN: Sunil Gavaskar's stern message for hosts: 'Can't put their guard down'Legendary India batter Sunil Gavaskar has sent a stern message for Indian cricket team ahead of the two-match Test series against Bangladesh beginning from September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-reaction-manchester-city-alleged-financial-breaches-case-2600526-2024-09-16",
      "headline": "Manchester City innocent until proven guilty: Pep GuardiolaManchester City manager Pep Guardiola has reiterated his belief in the Premier League club's innocence as the independent trial into the team's alleged financial breaches begins.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-announce-16-member-squad-for-home-test-series-vs-new-zealand-2600516-2024-09-16",
      "headline": "Sri Lanka announce 16-member squad for home Test series vs New ZealandSri Lanka announced a 16-member squad for the home Test series against New Zealand. The hosts showcased faith in the youngsters, who were brilliant in their performances against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-jofra-archer-workload-marcus-trescothick-2600484-2024-09-16",
      "headline": "England continue to be cautious as Jofra Archer returns to ODIs after 18 months England vs Australia: Jofra Archer will not feature in all five ODIs against Australia as the team management will continue to manage his workload. England and Australia will meet in a five-match series from September 19 to 29. It marks Archer's return to the 50-over format after 18 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-is-favourite-to-win-world-chess-championship-match-ding-liren-2600474-2024-09-16",
      "headline": "D Gukesh is favourite to win World Chess Championship match: Ding LirenDefending champion Ding Liren says his Indian challenger D Gukesh is the favourite to win their highly awaited global chess title match in November, while admitting that he has \"dropped a lot\" in the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-two-word-message-hundred-in-duleep-trophy-2600455-2024-09-16",
      "headline": "Ishan Kishan posts two-word message after superb hundred in Duleep TrophyWicketkeeper Ishan Kishan posted a two-word caption with his photo after a superb hundred in the second round of the Duleep Trophy. Ishan did not play for Team India in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/basit-ali-mohammad-rizwan-babar-azam-pakistan-cricket-pcb-2600436-2024-09-16",
      "headline": "Basit Ali reveals how Mohammad Rizwan is better skipper than Babar AzamFormer Pakistan cricketer Basit Ali has backed Mohammad Rizwan to become the next captain of Pakistan replacing Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-lyon-on-pressure-shane-warne-legacy-australia-spin-great-2600406-2024-09-16",
      "headline": "Still feel in shadow of Shane Warne: Lyon on comparisons with spin legendVeteran Australian off-spinner Nathan Lyon admitted that he still feels the pressure of succeeding Shane Warne as the country's premier spinner, even after a decade at the helm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paris-st-germain-condemn-online-racism-towards-nuno-mendes-2600395-2024-09-16",
      "headline": "Paris St-Germain condemn online racism towards Nuno Mendes after Ligue 1 winParis Saint-Germain defender Nuno Mendes faced racist comments on social media following PSG's 3-1 win against Brest in a French league game. The club condemned the abuse and expressed its \"full support\" for the Portugal left-back on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-picks-jasprit-bumrah-as-most-valuable-indian-cricketer-over-rohit-kohli-2600394-2024-09-16",
      "headline": "R Ashwin picks Jasprit Bumrah as most valuable Indian cricketer over Rohit-KohliStar India off-spinner Ravichandran Ashwin has picked Jasprit Bumrah as India's most valuable currently. Bumrah has been in phenomenal form across formats ever since his comeback in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/conor-gallagher-and-julian-alvarez-have-energised-atletico-diego-simeone-2600378-2024-09-16",
      "headline": "New signings Gallagher and Alvarez have energised Atletico: SimeoneAtletico Madrid coach Diego Simeone said that the arrivals of English midfielder Conor Gallagher and Argentine striker Julian Alvarez have energised the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-lyon-on-pressure-shane-warne-legacy-australia-spin-great-2600406-2024-09-16",
      "headline": "Still feel in shadow of Shane Warne: Lyon on comparisons with spin legendVeteran Australian off-spinner Nathan Lyon admitted that he still feels the pressure of succeeding Shane Warne as the country's premier spinner, even after a decade at the helm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paris-st-germain-condemn-online-racism-towards-nuno-mendes-2600395-2024-09-16",
      "headline": "Paris St-Germain condemn online racism towards Nuno Mendes after Ligue 1 winParis Saint-Germain defender Nuno Mendes faced racist comments on social media following PSG's 3-1 win against Brest in a French league game. The club condemned the abuse and expressed its \"full support\" for the Portugal left-back on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-picks-jasprit-bumrah-as-most-valuable-indian-cricketer-over-rohit-kohli-2600394-2024-09-16",
      "headline": "R Ashwin picks Jasprit Bumrah as most valuable Indian cricketer over Rohit-KohliStar India off-spinner Ravichandran Ashwin has picked Jasprit Bumrah as India's most valuable currently. Bumrah has been in phenomenal form across formats ever since his comeback in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/conor-gallagher-and-julian-alvarez-have-energised-atletico-diego-simeone-2600378-2024-09-16",
      "headline": "New signings Gallagher and Alvarez have energised Atletico: SimeoneAtletico Madrid coach Diego Simeone said that the arrivals of English midfielder Conor Gallagher and Argentine striker Julian Alvarez have energised the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-women-vs-england-women-orla-prendergast-2600373-2024-09-16",
      "headline": "Watch: Ireland women celebrate historic maiden T20I win over EnglandIreland women registered their historic maiden victory over England women in the second T20I on Monday, September 16 at Castle Avenue, Dublin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-starc-pick-yashasvi-jaiswal-as-indias-next-superstar-2600369-2024-09-16",
      "headline": "Watch: Steve Smith, Starc pick Yashasvi Jaiswal as India's next 'superstar'Top Australian cricketers like Steve Smith and Mitchell Starc have named Yashasvi Jaiswal the next big star in world cricket. The young Indian batter's impressive performances have caught the attention of the cricket world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hansi-flick-praises-lamine-yamal-after-barcelona-thrash-girona-2600362-2024-09-16",
      "headline": "Flick praises Barcelona's outstanding Yamal after Girona winManager Hansi Flick lauded Barcelona's teenage wonder Lamine Yamal after the Spain international scored twice to lead the LaLiga leaders to a 4-1 victory against Girona on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-brendon-mccullum-england-cricket-ecb-2600358-2024-09-16",
      "headline": "Jos Buttler excited for Brendon McCullum era in white-ball cricketEngland white-ball captain Jos Buttler is looking forward to working with Brendon McCullum. The Test team head coach was named the boss in all formats earlier in the month of September."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}