{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-icici-bank-hit-record-highs-after-strong-q4-buy-hold-or-sell-2712044-2025-04-21",
      "headline": "HDFC Bank, ICICI Bank hit record highs after strong Q4: Buy, hold or sell?HDFC Bank rose 1.3% while ICICI Bank gained 0.9% by 9:40 am. Their gains helped lift the Nifty Bank and Nifty Private Bank indices by nearly 2%, and pushed the Nifty 50 up 0.6%, with heavyweight HDFC Bank emerging as the index's top driver."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-800-points-nifty-rise-why-is-stock-market-rising-today-banking-stocks-fiis-us-tariff-talk-jd-vance-india-2712039-2025-04-21",
      "headline": "Sensex jumps 800 points: Why is stock market rising today?Stock market today: The rally on Monday marks the fifth straight session of gains, showing that investor confidence is returning. Both Sensex and Nifty touched their highest levels since January 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-bank-share-price-rally-up-nearly-7-percent-q4-results-strong-performance-2712032-2025-04-21",
      "headline": "Explained: Why Yes Bank share price rose nearly 7% todayThe Yes Bank stock was trading at Rs 18.95 on the BSE, marking a 4.75% jump. Gains continued through the morning, with the stock touching an intraday high of Rs 19.37, indicating that it rallied nearly 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-smallcap-midcap-stocks-should-you-buy-or-not-expert-explains-2712010-2025-04-21",
      "headline": "Stock market rally: Should investors consider small-cap, mid-cap stocks?With strong institutional inflows and improved breadth in the market, analysts say the coming weeks could favour investors who are selectively increasing exposure to quality names in the midcap and smallcap universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-india-record-high-global-uncertainty-should-you-buy-sell-explained-2712000-2025-04-21",
      "headline": "Gold prices continue to rise amid global uncertainty. Should you buy or sell?Gold price today: Monday's jump follows a dip in the previous session, where MCX Gold fell 0.44% to Rs 95,239 due to profit booking. But the broader narrative remains dominated by geopolitical and macroeconomic anxiety. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-middle-class-jobs-obsession-must-end-new-economic-era-india-marcellus-investment-managers-saurabh-mukherjea-explains-2711980-2025-04-21",
      "headline": "Job model that built India is dying, warns ace investor Saurabh MukherjeaSpeaking on a recent podcast titled Beyond the Paycheck: India's Entrepreneurial Rebirth, Saurabh Mukherjea issued a clear and unsettling warning: salaried employment, long considered the golden path to financial security, is dying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-500-points-nifty-above-23500-banking-stocks-lift-market-2711974-2025-04-21",
      "headline": "Sensex, Nifty rally as strong Q4 results from banks lift market confidenceThe S&P BSE Sensex gained 635.70 points to 79,188.90, while the NSE Nifty50 added 200.30 points to 24,051.95 as of 10:33 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-opening-stock-market-today-what-to-expect-trading-nse-bse-2711960-2025-04-21",
      "headline": "Stock market opening today: Will Sensex, Nifty continue their winning rally?Sensex, Nifty today: While strong results from HDFC Bank and ICICI Bank may help, weak global cues and disappointing Q4 results from Infosys could hold back gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-21-shares-in-focus-today-tcs-infosys-gensol-engineering-hdfc-bank-indigo-nse-bse-trading-2711952-2025-04-21",
      "headline": "Stocks to watch on April 21: TCS, Infosys, Gensol Engineering, HDFC Bank, IndigoShares of several major companies such as TCS, Inofsys, HDFC Bank, ICICI Bank, BHEL, Gensol Engineering, IndiGo, among others, will be in focus on April 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ministry-of-corporate-affairs-probes-gensol-over-loan-fraud-filings-accounts-under-scanner-sources-2711754-2025-04-20",
      "headline": "Gensol faces government inquiry after Rs 975 crore EV loan misuse: SourcesAccording to sources, the MCA's move is an independent action aimed at investigating potential corporate governance lapses and financial irregularities. There is no fixed timeline for the inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-from-april-23-tariffs-and-customs-negotiations-on-agenda-2711580-2025-04-19",
      "headline": "India-US trade talks from April 23, tariffs, customs negotiations on agenda: ReportThe Indian official team is visiting the US to give further impetus to the negotiations in the 90-day tariff pause window and discuss these terms of reference to iron out differences on certain issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments, however, continue. \r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rani-mukerjis-mardaani-3-to-release-on-holi-2026-first-look-out-2712041-2025-04-21",
      "headline": "Rani Mukerji's Mardaani 3 to release on Holi 2026, first look outRani Mukerji's first look from 'Mardaani 3' is finally out. The film will release in theatres on February 27, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/twilight-kristen-stewart-marries-dylan-meyer-in-intimate-ceremony-los-angeles-home-2712029-2025-04-21",
      "headline": "Twilight actor Kristen Stewart marries Dylan Meyer in intimate ceremonyActor Kristen Stewart married Dylan Meyer in an intimate ceremony held at their Los Angeles home on Easter Sunday. The couple, who began dating in 2019, got engaged in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-sunny-deol-film-eyes-rs-100-crore-despite-kesari-2-clash-box-office-akshay-kumar-2711995-2025-04-21",
      "headline": "Jaat box office Day 11: Sunny Deol film eyes Rs 100 crore despite Kesari 2 clashSunny Deol's thriller 'Jaat' has been going strong at the box office. The film is eyeing Rs 100 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-racing-team-podium-finish-belgium-2711987-2025-04-21",
      "headline": "Ajith Kumar's racing team secures another podium finish in Belgium. Watch videosAjith Kumar Racing Team enjoyed another podium finish in the Belgium international event. The actor held the Indian flag high as they stood on the podium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rubina-dilaik-fumes-over-death-threats-to-husband-abhinav-dont-test-my-patience-2711981-2025-04-21",
      "headline": "Rubina Dilaik fumes over death threats to husband Abhinav: Don't test my patienceActor Rubina Dilaik addressed the death threats her husband, Abhinav Shukla, and family received from Asim Riaz's fans. In a social media post, she wrote, \"Don't test my patience.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-akshay-kumar-r-madhavan-sees-huge-growth-on-easter-holiday-2711972-2025-04-21",
      "headline": "Kesari 2 box office Day 3: Akshay Kumar's film sees big growth on EasterAkshay Kumar's courtroom drama 'Kesari Chapter 2' received a phenomenal response over the Easter holiday. The film earned Rs 29.75 crore in three days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-aaradhya-family-pic-wedding-anniversary-divorce-rumours-2711971-2025-04-21",
      "headline": "Aishwarya Rai shares family pic on wedding anniversary, first in over a yearAishwarya Rai Bachchan shared a family picture with Abhishek and Aaradhya, marking their 18th wedding anniversary. Their fans congratulated them on their anniversary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/asim-riaz-slams-abhinav-shukla-death-threat-lawrence-bishnoi-gang-rubina-dilaik-spat-battleground-2711951-2025-04-21",
      "headline": "Stand tall or stay silent: Rapper Asim Riaz's rebuttal to actor Abhinav ShuklaAmidst a heated controversy, rapper Asim Riaz has addressed actor Abhinav Shukla's claims of receiving death threats from an alleged Lawrence Bishnoi gang member. This follows a spat between Riaz and Rubina Dilaik on a reality show, escalating tensions further."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-kajol-share-sweetest-wishes-for-daughter-nysa-on-her-22nd-birthday-2711892-2025-04-20",
      "headline": "Ajay Devgn, Kajol share sweetest wishes for daughter Nysa on her 22nd birthdayNysa Devgan, daughter of Kajol and Ajay Devgn, turned 22 on April 20. To mark the occasion, her parents shared heartfelt birthday wishes along with beautiful pictures of her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-stuns-with-vicky-kaushal-mehndi-at-friends-wedding-video-2711875-2025-04-20",
      "headline": "Katrina Kaif flaunts 'VK' mehndi in cute pic with Vicky Kaushal at a weddingAt a friend's wedding, actor Katrina Kaif showcased a special mehndi design dedicated to her husband, Vicky Kaushal. The intricate 'VK' mehndi left fans in awe and quickly became the talk of the town."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhinav-shukla-death-threat-by-alleged-lawrence-bishnoi-gang-amid-rubina-row-with-asim-riaz-battleground-2711863-2025-04-20",
      "headline": "Actor Abhinav Shukla gets death threat from 'Bishnoi gang'Actor Abhinav Shukla has been threatened on Instagram by a person claiming to be a member of the Lawrence Bishnoi gang. The threat follows his wife Rubina Dilaik's controversy with Asim Riaz on 'Battleground'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simran-criticises-co-actor-for-insensitive-remark-on-doing-aunty-roles-2711849-2025-04-20",
      "headline": "Simran criticises co-actor for insensitive remark on doing 'aunty roles'Tamil actor Simran publicly called out a fellow actor for making an insensitive remark about 'aunty roles'. Expressing her shock, Simran stated that she'd rather portray such roles with dignity than take on a meaningless or 'dabba' role.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-posts-video-of-rescuing-abandoned-girl-behind-house-2711802-2025-04-20",
      "headline": "Disha Patani's sister rescues abandoned baby girl, vows to secure her futureActor Disha Patani's sister, Khushboo Patani, a former army officer, shared a video in which she was seen rescuing a girl child lying in the dirt behind her house. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-exposes-south-industry-navel-obsession-shares-her-experience-2711796-2025-04-20",
      "headline": "Malavika Mohanan exposes South industry's 'navel obsession', shares her experienceActor Malavika Mohanan recalled being body-shamed in both the South Indian and the Hindi film industry. She also talked about the South Indian industry's 'naval' obsession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-too-profound-for-words-moment-a-signed-jersey-by-lionel-messi-watch-viral-video-2711792-2025-04-20",
      "headline": "In Mohanlal's 'too profound for words' moment, a signed jersey by Lionel MessiMalayalam superstar Mohanlal couldn't contain his joy when his friends brought him one of the biggest gifts of his life - a signed jersey by football legend Lionel Messi. Here's what he had to say about that 'unforgettable moment'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shine-tom-chacko-brother-defends-him-in-drugs-case-with-sarcasm-2711752-2025-04-20",
      "headline": "Malayalam actor Shine Tom Chacko's brother defends him in drugs case with sarcasmMalayalam actor Shine Tom Chacko was arrested and later released on bail in a drug-related case. His brother, Joe John Chako, now spoke to the media, and defended the actor by asking if none of them had ever visited a de-addiction centre before. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-10-detailed-report-sunny-deol-film-faces-kesari-2-with-grace-and-strength-2711745-2025-04-20",
      "headline": "Jaat box office Day 10: Sunny Deol's film faces Kesari 2 with grace and strengthSunny Deol's 'Jaat' has slowed down at the box office with the release of Akshay Kumar's 'Kesari Chapter 2' this weekend. A slight dip was expected, but it will be interesting to see how far the film can go now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-calls-anurag-kashyap-sick-you-cant-pollute-brahmin-legacy-watch-viral-video-2711734-2025-04-20",
      "headline": "Manoj Muntashir calls Anurag Kashyap 'sick': You can't pollute Brahmin legacyLyricist Manoj Muntashir shared a video on social media, slamming Anurag Kashyap for his alleged casteist remark against Brahmins. He also issued an open challenge to him in the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-thanks-fans-for-jaat-enjoys-nature-walk-before-border-2-shoot-2711732-2025-04-20",
      "headline": "Sunny Deol enjoys nature walk before Border 2 shoot, thanks fans for JaatAmid the massive success of his film 'Jaat', Sunny Deol is unwinding in the valleys. Sharing a serene video on Sunday, the actor thanked fans for their overwhelming love and promised that the sequel would be even more entertaining."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/as-it-is-facing-charge-of-encroaching-into-executive-supreme-court-on-plea-for-presidents-rule-in-bengal-2712035-2025-04-21",
      "headline": "Facing charge of encroaching on executive: Top court on Bengal riots pleaThe Supreme Court has come under criticism from BJP leaders against the backdrop of two important rulings - setting a timeline for the President to take a call on bills and staying of certain provisions of Waqf law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-vice-president-jd-vance-embarks-first-official-visit-india-with-family-2711929-2025-04-21",
      "headline": "JD Vance lands in Delhi, to hold bilateral with PM under US tariffs shadow  Live Updates US Vice President JD Vance, along with his wife Usha and three children, is on a four-day visit to India. This marks his first official visit to the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/wife-mental-health-problems-son-claims-ex-karnataka-police-chief-dead-stab-wounds-2711969-2025-04-21",
      "headline": "Schizophrenic mother imagined things, threatened Karnataka ex-top cop: SonMurdered ex-DGP Om Prakash's son Karthikesh told the police that his mother, the primary suspect in the former top cop's death, was suffering from severe mental health issues. Om Prakash was found dead at his Bengaluru residence with multiple stab wounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-contracts-2024-25-shreyas-iyer-ishan-kishan-back-top-grade-2712042-2025-04-21",
      "headline": "Shreyas Iyer, Ishan Kishan back as BCCI announces annual contracts for 2024-25The BCCI announced the annual central contracts for the 2024-25 season. While Shreyas Iyer and Ishan Kishan returned to the contracted players list, Rohit Sharma and Virat Kohli retained their places in the top bracket despite retiring from T20Is last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/too-polite-to-chatgpt-sam-altman-says-its-costing-openai-millions-2711982-2025-04-21",
      "headline": "Too polite to ChatGPT? Sam Altman says it's costing OpenAI millionsOpenAI CEO Sam Altman claims that saying \"Please\" or \"Thank you\" while interacting with ChatGPT is costing the company tens of millions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jd-vance-india-visit-vice-president-and-family-to-arrive-in-india-soon-meeting-with-pm-modi-on-agenda-2711944-2025-04-21",
      "headline": "US Vice President JD Vance, wife Usha and children wrap up Akshardham visitUS Vice President JD Vance and family arrived in New Delhi this morning for a four-day official visit to India, marking his first trip to the country since assuming office. Vice President Vance is scheduled to meet Prime Minister Narendra Modi later this evening. High on the agenda will be the ongoing negotiations for a long-anticipated bilateral trade agreement, as well as the status of President Donald Trump's reciprocal tariffs on Indian goods. These measures, currently on hold until July, have remained a key sticking point in trade talks and are expected to feature prominently in Vice President Vance's official engagements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-opposes-trade-deals-with-us-at-its-expense-appeasement-wont-bring-peace-2711943-2025-04-21",
      "headline": "China's big warning to countries striking trade deals with US amid tariff faceoffA spokesperson from China's Ministry of Commerce (MOFCOM) said China respects the right of all countries to address economic and trade differences with the US through consultations conducted on an equal footing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-800-points-nifty-rise-why-is-stock-market-rising-today-banking-stocks-fiis-us-tariff-talk-jd-vance-india-2712039-2025-04-21",
      "headline": "Sensex jumps 800 points: Why is stock market rising today?Stock market today: The rally on Monday marks the fifth straight session of gains, showing that investor confidence is returning. Both Sensex and Nifty touched their highest levels since January 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/in-pics-us-vice-president-jd-vance-and-family-in-india-on-first-visit-heres-what-they-did-2712034-2025-04-21",
      "headline": "In pics: JD Vance and family in India on first visit. Here's what they didUS Vice President JD Vance, accompanied by his wife Usha and their three children, is currently on a four-day official trip to India — his first visit to the country in this capacity. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/noida/story/noidas-nh-24-choked-with-traffic-security-curbs-cause-major-rush-hour-chaos-2712020-2025-04-21",
      "headline": "Noida's NH-24 choked, security curbs cause rush hour chaosThe gridlock comes amid heightened security arrangements in Delhi-NCR as US Vice President JD Vance landed in India for his first official visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-defence-chief-pete-hegseth-shared-yemen-strike-plans-signal-chat-wife-brother-lawyer-2711930-2025-04-21",
      "headline": "US defence chief shared Yemen strike plans in chat with wife, brother: ReportPete Hegseth shared sensitive information - including the flight timings of the combat aircrafts used to target Houthi targets on Yemeni soil - with his family and lawyer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/odisha/story/odisha-puri-minor-youth-torture-forced-to-drink-urine-mistaken-identity-2712003-2025-04-21",
      "headline": "2 Odisha teens thrashed, forced to drink urine in case of mistaken identityThe duo were tied to an electric pole, thrashed with iron rods, and burned with cigarette butts. One of the victims sustained serious head injuries in the assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-man-signs-up-as-blinkit-delivery-agent-says-untouchability-goes-beyond-caste-in-viral-post-2712046-2025-04-21",
      "headline": "Delhi man signs up as Blinkit delivery agent, says untouchability isn't just caste-basedA Delhi-based man swapped his desk job for a day to work as a Blinkit delivery agent, and came back with a reality check most people choose to overlook. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-kkr-vs-gt-team-news-kolkata-conditions-2712038-2025-04-21",
      "headline": "KKR vs GT: Kolkata desperate to bounce back against table toppers in home denIPL 2025, KKR vs GT Prediction: Kolkata Knight Riders (KKR) are set to take on Gujarat Titans (GT) in their eighth fixture of the Indian Premier League 2025 (IPL 2025). The Ajinkya Rahane-led side will be desperate to bounce back following their embarrassing loss vs Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/naxal-carrying-rs-1-crore-bounty-among-8-maoists-killed-jharkhand-bokaro-encounter-2711989-2025-04-21",
      "headline": "Naxal with Rs 1 crore bounty killed in Jharkhand; 8 ultras dead in opThe Central forces on Monday made a huge breakthrough in their all-out offensive against Naxals, killing eight, including a Maoist leader with a Rs 1 crore bounty on his head, in Jharkhand's Bokaro, officials said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jharkhand-karni-sena-chief-vinay-singh-found-dead-with-gunshot-wound-pistol-in-hand-2711973-2025-04-21",
      "headline": "Jharkhand Karni Sena chief found dead with gunshot wound, pistol in handNews of Vinay Singh's death triggered outrage among his supporters, who gathered late Sunday night and blocked National Highway--33 near Dimna Chowk, a key route connecting Jamshedpur to Kolkata and Odisha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-posts-video-of-rescuing-abandoned-girl-behind-house-2711802-2025-04-20",
      "headline": "Disha Patani's sister rescues abandoned baby girl, vows to secure her futureActor Disha Patani's sister, Khushboo Patani, a former army officer, shared a video in which she was seen rescuing a girl child lying in the dirt behind her house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isros-spadex-satellites-complete-second-docking-successfully-more-tests-to-follow-union-minister-2712002-2025-04-21",
      "headline": "Isro's SpaDeX satellites complete second docking successfully, more tests to followThe SpaDeX mission was launched on December 30 last year when ISRO placed in orbit two satellites, SDX01 and SDX02, to demonstrate docking experiments in space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/japanese-singer-flew-1000-km-daily-for-college-did-not-let-career-affect-studies-2712028-2025-04-21",
      "headline": "Japanese singer flew 1,000 km daily for college, didn't let career affect studiesWhile most students complain about early morning classes, this Japanese singer flew across the country and still made it on time, every single day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-sends-birthday-flowers-to-mother-maye-in-mumbai-viral-x-post-2711997-2025-04-21",
      "headline": "Elon Musk sends birthday flowers to mother Maye in Mumbai. She replies with loveElon Musk's mother, Maye Musk, celebrated her 77th birthday in Mumbai. She shared a photo of herself with the flowers her son sent for the occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/twilight-kristen-stewart-marries-dylan-meyer-in-intimate-ceremony-los-angeles-home-2712029-2025-04-21",
      "headline": "Twilight actor Kristen Stewart marries Dylan Meyer in intimate ceremonyActor Kristen Stewart married Dylan Meyer in an intimate ceremony held at their Los Angeles home on Easter Sunday. The couple, who began dating in 2019, got engaged in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-temple-one-well-one-cremation-ground-rss-chief-mohan-bhagwat-urges-social-unity-2711921-2025-04-21",
      "headline": "One temple, one well, one cremation ground: RSS chief urges Hindu unityCurrently on a five-day visit to Aligarh, the RSS chief addressed 'swayamsevaks' at two separate 'shakhas'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/gmail-users-beware-this-google-email-is-a-scam-2711975-2025-04-21",
      "headline": "Gmail users beware: This Google email is a scamA convincing Gmail scam is tricking users into giving away personal data — here is how to spot and avoid it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-india-record-high-global-uncertainty-should-you-buy-sell-explained-2712000-2025-04-21",
      "headline": "Gold prices continue to rise amid global uncertainty. Should you buy or sell?Gold price today: Monday's jump follows a dip in the previous session, where MCX Gold fell 0.44% to Rs 95,239 due to profit booking. But the broader narrative remains dominated by geopolitical and macroeconomic anxiety. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-contracts-2024-25-shreyas-iyer-ishan-kishan-back-top-grade-2712042-2025-04-21",
      "headline": "Shreyas Iyer, Ishan Kishan back as BCCI announces annual contracts for 2024-25The BCCI announced the annual central contracts for the 2024-25 season. While Shreyas Iyer and Ishan Kishan returned to the contracted players list, Rohit Sharma and Virat Kohli retained their places in the top bracket despite retiring from T20Is last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-kkr-vs-gt-team-news-kolkata-conditions-2712038-2025-04-21",
      "headline": "KKR vs GT: Kolkata desperate to bounce back against table toppers in home denIPL 2025, KKR vs GT Prediction: Kolkata Knight Riders (KKR) are set to take on Gujarat Titans (GT) in their eighth fixture of the Indian Premier League 2025 (IPL 2025). The Ajinkya Rahane-led side will be desperate to bounce back following their embarrassing loss vs Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-kieron-pollard-interview-mayanti-langer-2712026-2025-04-21",
      "headline": "Fed up of praising CSK: How Mayanti Langer got Pollard to drop the diplomacyIPL 2025, MI vs CSK: After initially taking a diplomatic tone, Kieron Pollard dropped the filter in a post-match chat with broadcasters, revealing how he fired up the Mumbai Indians dressing room ahead of their thumping 9-wicket win over Chennai Super Kings at the Wankhede Stadium on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-head-coach-mahela-jayawardene-after-mi-vs-csk-2711990-2025-04-21",
      "headline": "Still midway through the season, not taking anything for granted: MI Head coachMumbai Indians (MI) head coach Mahela Jayawardene said that the team isn't taking anything for granted and are just midway through their season. MI beat CSK by nine wickets to register their fourth win of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyers-sister-shresta-hits-back-at-trolls-after-pbks-loss-vs-rcb-2711976-2025-04-21",
      "headline": "IPL 2025: Shreyas Iyer's sister Shresta hits back at trolls after PBKS' loss vs RCBPunjab Kings' (PBKS) captain Shreyas Iyer's sister Shresta has hit back at trolls following Punjab's loss against Royal Challengers Bengaluru (RCB) in Match 37 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-csk-powerplay-woes-keep-haunting-chennai-in-horror-ipl-2025-campaign-2711970-2025-04-21",
      "headline": "MI vs CSK: Powerplay woes keep haunting Chennai in horror IPL 2025 campaignIPL 2025, MI vs CSK: Former batter Sunil Gavaskar was clear cut in saying that Chennai Super Kings need to up their game in the powerplay to put oppositions under pressure. On Sunday, CSK lost to MI by nine wickets and kept languishing at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/csk-head-coach-stephen-fleming-on-batting-approach-mi-vs-csk-2711959-2025-04-21",
      "headline": "Need to be a bit more proactive with bat, we're lacking confidence: CSK head coachChennai Super Kings (CSK) head coach Stephen Fleming said that the team needs to be a bit more proactive with the bat throughout the innings but is lacking confidence at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-how-17-year-old-ayush-mhatre-impressed-ms-dhoni-at-csk-nets-2711957-2025-04-21",
      "headline": "IPL 2025: How 17-year-old Ayush Mhatre impressed MS Dhoni at CSK netsChennai Super Kings (CSK) head coach Stephen Fleming revealed how Ayush Mhatre stood out in their mid-season trials and impressed MS Dhoni to earn a spot in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-rohit-sharma-shows-his-relevance-in-modern-t20-game-2711946-2025-04-21",
      "headline": "High-tempo with smart batting: Rohit Sharma shows his relevance in modern T20 gameRohit Sharma stormed back into form and showed how his ability to tweak his game effectively shows that the MI legend still has a place in the modern T20 game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-almost-over-for-csk-kris-srikkanth-after-loss-vs-mi-2711935-2025-04-21",
      "headline": "IPL 2025 almost over for CSK: Srikkanth's damning verdict after MI hammeringIPL 2025, MI vs CSK: Former batter Kris Srikkanth said that Chennai Super Kings' campaign in the tournament is more or less over after their nine-wicket defeat to Mumbai Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-csk-powerplay-woes-keep-haunting-chennai-in-horror-ipl-2025-campaign-2711970-2025-04-21",
      "headline": "MI vs CSK: Powerplay woes keep haunting Chennai in horror IPL 2025 campaignIPL 2025, MI vs CSK: Former batter Sunil Gavaskar was clear cut in saying that Chennai Super Kings need to up their game in the powerplay to put oppositions under pressure. On Sunday, CSK lost to MI by nine wickets and kept languishing at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/csk-head-coach-stephen-fleming-on-batting-approach-mi-vs-csk-2711959-2025-04-21",
      "headline": "Need to be a bit more proactive with bat, we're lacking confidence: CSK head coachChennai Super Kings (CSK) head coach Stephen Fleming said that the team needs to be a bit more proactive with the bat throughout the innings but is lacking confidence at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-how-17-year-old-ayush-mhatre-impressed-ms-dhoni-at-csk-nets-2711957-2025-04-21",
      "headline": "IPL 2025: How 17-year-old Ayush Mhatre impressed MS Dhoni at CSK netsChennai Super Kings (CSK) head coach Stephen Fleming revealed how Ayush Mhatre stood out in their mid-season trials and impressed MS Dhoni to earn a spot in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-rohit-sharma-shows-his-relevance-in-modern-t20-game-2711946-2025-04-21",
      "headline": "High-tempo with smart batting: Rohit Sharma shows his relevance in modern T20 gameRohit Sharma stormed back into form and showed how his ability to tweak his game effectively shows that the MI legend still has a place in the modern T20 game. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-almost-over-for-csk-kris-srikkanth-after-loss-vs-mi-2711935-2025-04-21",
      "headline": "IPL 2025 almost over for CSK: Srikkanth's damning verdict after MI hammeringIPL 2025, MI vs CSK: Former batter Kris Srikkanth said that Chennai Super Kings' campaign in the tournament is more or less over after their nine-wicket defeat to Mumbai Indians."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}