{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stuck-in-middle-income-trap-fareed-zakaria-explain-reason-behind-china-economic-crisis-davos-wef-2669724-2025-01-24",
      "headline": "Stuck in middle-income trap: Fareed Zakaria decodes China's economic crisisFareed Zakaria said that China's economy is not going to grow any time at the six, seven, eight percent that it was growing at previously. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/minimum-credit-score-for-getting-personal-loan-check-details-here-2669673-2025-01-24",
      "headline": "How to achieve minimum credit score for getting personal loan? Details hereThe higher the credit score, the greater are the chances for the approval of your loan requests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/interglobe-aviation-indigo-q3-results-net-profit-falls-by-18-pecent-to-rs-2449-ceo-pieter-elbers-2669660-2025-01-24",
      "headline": "InterGlobe Aviation Q3 results: IndiGo operator's net profit falls by 18%Indigo Q3 results: The net profit for the aviation company dropped by 18% to Rs 2,449 crore when compared to Rs 2,998 crore in the same quarter a year ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-ev-sector-expectations-expansion-of-charging-stations-boost-ev-sales-finance-minister-nirmala-sitharaman-2669565-2025-01-24",
      "headline": "Budget 2025: EV sector pushes for tech investments and smart mobility solutionsExperts anticipate that Budget 2025 would introduce policies that would boost EV sales across the country and help India achieve its goal of reducing carbon emissions by one billion tonnes by 2030.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-amid-volatility-energy-and-pharma-lead-losses-hul-down-3-percent-2669600-2025-01-24",
      "headline": "Sensex, Nifty fall amid volatility; energy and pharma lead lossesShare Market: The S&P BSE Sensex shed 329.92 points to close at 76,190.46, while the NSE Nifty50 lost 113.15 points to end at 23,092.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-milk-prices-by-rs-1-per-litre-across-india-2669597-2025-01-24",
      "headline": "Amul cuts milk prices by Re 1 per litre across IndiaThe reduction will only be applicable to 1-litre packs. Previously, in June 2024, Amul had increased milk prices by Rs 2 per litre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fareed-zakaria-speaks-on-donald-trumps-administration-and-india-us-relations-2669573-2025-01-24",
      "headline": "India-US relationship beyond personalities: Fareed Zakaria on Trump 2.0Fareed Zakaria shared his insights on the political shift in the United States and the seismic changes it is expected to bring geopolitically and economically across the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-share-price-fall-sri-lanka-cancels-power-purchase-deal-report-2669582-2025-01-24",
      "headline": "Adani Green Energy shares fall as Sri Lanka cancels power purchase dealAdani Green Energy shares fell after the news of Sri Lanka cancelling the power purchase deal to hit the day's low of Rs 1,008, crashing over 6% from the day's high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-buys-60-controlling-stake-in-pegatron-india-2669549-2025-01-24",
      "headline": "Tata Electronics buys 60% controlling stake in Pegatron IndiaTEPL, which is a wholly-owned subsidiary of Tata Sons, said the latest acquisition aligns with Tata Sons' Chairman N Chandrasekaran's vision of investments by the Tata Group in electronics manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-today-why-are-stock-markets-volatile-should-you-be-worried-3-things-to-know-expert-view-2669514-2025-01-24",
      "headline": "Why are markets volatile, and should you be worried? 3 things to know Sensex scaled to 76,985.95, reaching the day's high, a jump of over 500 points, but was trading at 76,621.03 as of 1 PM. Nifty has also gone about in the same manner. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-ocl-deny-media-report-enforcement-directorate-probe-media-reports-factually-incorrect-2669509-2025-01-24",
      "headline": "Paytm denies ED probe in crypto scam, calls reports 'factually incorrect'Paytm Latest News: Paytm's clarification came after a few media reports claimed that the ED is investigating the fintech firm and other payment gateways in a cryptocurrency scam. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-paytm-stock-price-tumbled-nearly-9-percent-today-ed-investigation-crypto-scam-company-response-2669465-2025-01-24",
      "headline": "Explained: Why Paytm share price tumbled nearly 9% todayPaytm share price: The shares of the company fell nearly 9% to hit a day's low of Rs 773.90. At 12:18 pm, shares of the fintech company stabilised a bit to trade 2.27% higher at Rs 829.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cyient-ceo-karthikeyan-natarajan-resigns-share-price-tumbles-2669426-2025-01-24",
      "headline": "Why did Cyient CEO Karthikeyan Natarajan resign?The resignation of Cyient's CEO Karthikeyan Natarajan was a major reason that led to the sharp decline in the company's share price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hul-to-acquire-stake-in-minimalist-for-rs-2670-crore-peak-xv-bags-10x-gains-rahul-yadav-mohit-kumar-yadav-2669199-2025-01-24",
      "headline": "HUL to acquire stake in Minimalist for Rs 2,670 crore; Peak XV bags 10X gainsHUL has acquired a 90.5% stake in Minimalist for Rs 2,670 crore, making it one of the biggest acquisitions in the country's startup ecosystem. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cyient-share-price-20-percent-52-week-low-triggered-stock-price-crash-explained-2669414-2025-01-24",
      "headline": "Cyient share price falls 20% to hit 52-week low. What triggered Friday's crash?Cyient stock price: At around 10:21 am, shares of Cyient were down 17.96% to Rs 1,438 on the Bombay Stock Exchange (BSE). In early trade, shares of the IT company fell as much as 20% to hit a 52-week low of Rs 1,402.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dr-reddys-laboratories-share-price-falls-sharply-q3-results-explained-2669392-2025-01-24",
      "headline": "Explained: Why Dr Reddy's share price cracked 6% in early tradeDr Reddy's Laboratories Stock Price: Dr Reddy's shares tumbled up to 6% in early trade and at 9:46 am, they were trading 4.35% lower at Rs 1,233.25 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-asian-markers-energy-shares-2669386-2025-01-24",
      "headline": "Sensex, Nifty open higher tracking Asian markets; energy stocks gainShare Market Today, 24 January 2025: The S&P BSE Sensex was up 204.76 points to 76,725.14 at 9:17 am, while the NSE Nify50 traded 64.15 points higher at 23,269.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/union-minister-ashwini-vaishnaw-says-manufacturing-services-ai-to-drive-growth-2669269-2025-01-23",
      "headline": "Union Minister Ashwini Vaishnaw says manufacturing, services, AI to drive growthAt the World Economic Forum, Minister Ashwini Vaishnav outlined India's economic strategy based on four pillars: public investment in infrastructure, focus on manufacturing and innovation, inclusive growth, and simplification of laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-personal-profile-updation-process-check-steps-here-2669188-2025-01-23",
      "headline": "EPFO simplifies personal profile updation process. Check steps hereEPF members can update their personal details like name, gender, date of birth, nationality and marital status without the need to submit any documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-boosting-startups-with-extended-tax-holidays-and-simplified-processes-2669042-2025-01-23",
      "headline": "Budget 2025: Startups seeks extended tax holidays, access to affordable creditSeveral experts have shared their Budget 2025 expectations for the startup sector, seeking reforms to help this sector maintain its growth momentum and scale globally."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/identity-ott-release-tovino-thomas-trisha-krishnan-thriller-2669755-2025-01-24",
      "headline": "Identity OTT release: When and where to watch Tovino Thomas, Trisha's thrillerIdentity OTT release date: The Tovino Thomas and Trisha Krishnan-starrer is set to release on Zee5. Directed by Akhil Paul and Anas Khan, the psychological thriller will begin streaming from next week. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-in-india-a-rollercoaster-of-excitement-chaos-and-disappointment-2669642-2025-01-24",
      "headline": "Coldplay in India: A rollercoaster of excitement, chaos, and disappointmentColdplay's first three concerts in India have left fans with mixed feelings. While tickets for all the five shows sold out quickly, fans all over the country complained about the issues surrounding the Mumbai concerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ott-releases-of-the-week-hisaab-barabar-sweet-dreams-sivarapalli-stmp-2669723-2025-01-24",
      "headline": "OTT releases of the week: Hisaab Barabar, Sweet Dreams, Sivarapalli and moreWith the weekend around the corner, here's a list of all the latest films and series that will release on OTT this week. Take a look at some here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/benedict-cumberbatch-says-it-will-take-lot-of-money-to-return-as-sherlock-2669698-2025-01-24",
      "headline": "Benedict Cumberbatch says it will take 'lot of money' to return as SherlockBritish star Benedict Cumberbatch recently opened up about whether he would return as Sherlock Holmes. The actor played the famed fictional detective in the BBC series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-veer-mehra-bigg-boss-18-win-baal-veer-dev-joshi-engagement-tv-newsmakers-2669656-2025-01-24",
      "headline": "TV newsmakers of the weekStarting from Karan Veer Merhra's Bigg Boss 18 win to Bal Veer actor's engagement, the television world was full of exciting news and events. Read to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-brown-sues-warner-bros-for-sexual-assault-allegations-in-docuseries-2669648-2025-01-24",
      "headline": "Singer Chris Brown sues Warner Bros for sexual assault allegations in docuseriesSinger Chris Brown has reportedly sued Warner Bros over sexual assault allegations for a whopping $500 million. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/newtopia-trailer-out-blackpinks-jisoo-park-jeongmin-prime-video-february-7-2669552-2025-01-24",
      "headline": "Newtopia trailer: BLACKPINK's Jisoo to headline hilarious romantic zombie dramaThe much-anticipated trailer for Newtopia is out, featuring BLACKPINK's Jisoo and actor Park Jeong-min. The duo navigates a zombie outbreak in this gripping drama based on Han Sang-woon's novel Influenza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sweet-dreams-movie-review-mithila-palkar-amol-parashar-film-is-a-candy-that-is-not-sweet-enough-2669515-2025-01-24",
      "headline": "Sweet Dreams movie review: Mithila-Amol's film is a candy that's not sweet enoughReleased-Fri Jan 24, 2025Sweet Dreams movie review: Sweet Dreams could have been a simple romantic film, but it ends up being preachy in an attempt to mildly school the young generation about the difference between dreams and reality. However, Mithila Palkar and Amol Parashar look pretty together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-winner-karan-veer-mehra-ex-wife-nidhi-seth-remarries-2669490-2025-01-24",
      "headline": "BB 18 winner Karan Veer Mehra's ex-wife, actor Nidhi Seth gets marriedTwo years after separating from Karanveer Mehra, actress Nidhi Seth remarried her boyfriend Sandiip Kummar. Recently, she shared pictures from her temple wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-rose-g-dragon-taeyang-claim-the-stage-at-paris-event-pics-videos-2669503-2025-01-24",
      "headline": "Watch: BTS' J-hope, Rose, G-Dragon and Taeyang claim the stage at Paris eventBTS member J-hope, Blackpink's Rose, and G-Dragon and Taeyang of BigBang recently marked their presence at a Paris event. J-hope even shared photos from his performance on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-life-gives-you-tangerines-park-bo-gum-iu-kdrama-premiere-date-announced-netflix-march-7-2669504-2025-01-24",
      "headline": "When Life Gives You Tangerines: Park Bo-gum, IU's K-drama to premiere on this dateThe much-anticipated K-drama, When Life Gives You Tangerines, starring Park Bo-gum and IU, will premiere on Netflix on March 7. The streaming date was shared alongside the show's first teaser."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hisaab-barabar-review-r-madhavan-tries-hard-to-save-this-middling-film-neil-nitin-mukesh-zee5-2669458-2025-01-24",
      "headline": "Hisaab Barabar review: R Madhavan tries hard to save this middling filmReleased-Fri Jan 24, 2025Hisaab Barabar movie review: R Madhavan's latest, Hisaab Barabar, had the potential to deliver something raw and novel. Instead, the Ashwni Dhir directorial falls into the usual traps of the everyman story. Read our take on the film here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/paatal-lok-2-ending-explained-jaideep-ahlawat-2-crore-what-happens-to-hathi-ram-2669204-2025-01-24",
      "headline": "Paatal Lok 2 ending explained: What's next for Hathi Ram, did he get Rs 2 crore?Paatal Lok 2 continues to captivate audiences with its intricate storyline and profound depiction of Nagaland's socio-political landscape. The series resolves its many mysteries, leaving viewers pondering Inspector Hathi Ram's future. Find out what the season's ending meant and whether there will be a third season of Paatal Lok."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/emiway-bantai-marries-swaalina-photos-instagram-2669410-2025-01-24",
      "headline": "Pics: Rapper Emiway Bantai marries singer-actor SwaalinaRapper Eminem Batai surprised fans as he shared photos from his intimate wedding ceremony with actor and singer Swaalina. The duo worked together in the 2023 music video, Kudi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/ian-bohen-on-working-with-salman-khan-in-marigold-yellowstone-teen-wolf-hollywood-dreams-2669395-2025-01-24",
      "headline": "Ian Bohen on working with Salman Khan in Marigold, Yellowstone, Teen Wolf, Hollywood dreams Ian Bohen opened up in an exclusive chat about the emotional and dramatic finale season of Yellowstone and credited Teen Wolf for bolstering his self-assurance. He also spoke about Salman Khan, whom he co-starred in Marigold. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/video/wolf-man-cast-interview-julia-garner-says-india-hire-me-leigh-whannell-on-directing-bollywood-film-2669387-2025-01-24",
      "headline": "Wolf Man Cast Interview: Julia Garner says 'India Hire Me'; Leigh Whannell on directing Bollywood film In an exclusive chat with India Today's Bhavna Agarwal, Julia and Leigh spoke about Wolf Man and their experience working on it and interest in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/meet-shashi-kapoors-grandson-zahan-kapoor-unlike-any-kapoor-and-sons-black-warrant-2669390-2025-01-24",
      "headline": "Meet Shashi Kapoor's grandson Zahan Kapoor: Unlike any Kapoor and Sons | Black WarrantZahan Kapoor, grandson of Bollywood icon Shashi Kapoor, is earning praise for his role in the crime thriller Black Warrant. In an exclusive interview with India Today, Zahan expressed gratitude for the overwhelming response and Kapoor legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-feels-hina-khan-using-cancer-for-publicity-in-new-video-2669375-2025-01-24",
      "headline": "Watch: Actor Rozlyn Khan accuses Hina Khan of using cancer for publicityRozlyn Khan, a breast cancer survivor, has raised questions about Hina Khan's actions post-mastectomy, suggesting the actor might be using her cancer diagnosis for publicity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/antara-mitra-slams-jasleen-royal-coldplay-opening-act-vishal-dadlani-2669354-2025-01-24",
      "headline": "Singer Antara slams Jasleen Royal's Coldplay act: Put music on topSinger Antara Mitra called out Jasleen Royal's opening act with Coldplay. She requested people to 'put music on top'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-special-amul-honours-hathi-ram-chaudhary-paatal-lok-2-2669302-2025-01-23",
      "headline": "Jaideep Ahlawat 'melted like makhan' after Amul's 'Lok-priya snack' honourActor Jaideep Ahlawat shared a gratitude note on social media after Amul gave a shout-out to his character from his latest release, Paatal Lok Season 2. The actor plays the role of Hathi Ram Chaudhary. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/aap-poster-war-bjp-congress-rahul-gandhi-dishonest-people-pm-modi-delhi-assembly-election-2669903-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi finds special mention in AAP's list of dishonest peopleFor the first time, Congress leader Rahul Gandhi's picture appears on one of AAP's posters, with the party terming him \"dishonest\" alongside PM Modi, Home Minister Amit Shah, and Delhi BJP leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-extradition-to-india-us-supreme-court-clears-dismisses-his-last-review-petition-mumbai-26-11-accused-2669897-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Supreme Court clears extradition of 26/11 accused Tahawwur Rana to IndiaThe US Supreme Court has approved the extradition of Tahawwur Rana, a Canadian of Pakistani origin, to India. Rana is accused of involvement in the 2008 Mumbai terror attacks targeting multiple locations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-final-live-score-arnya-sabalenka-vs-madison-keys-2669961-2025-01-25?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Women's singles final live: Madison Keys on top vs Aryna Sabalenka in Set 1Australian Open 2025 final live score and updates: Madison Keys has begun the final on a sensational note. She is striking the ball incredibly well, putting relentless pressure on Aryna Sabalenka. The World No. 1 has been broken twice in the first set. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/google-maps-wrong-direction-french-cyclists-nepal-bareilly-uttar-pradesh-police-2669937-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "French men cycling to Nepal take Google Maps shortcut, get stranded in Bareilly'Google Maps showed them a shortcut via Baheri in Bareilly, due to which they got lost and reached Churaili Dam,' said a police official."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/animal-kill-marco-why-indians-are-loving-gore-on-the-big-screen-2669858-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian audience's laal ishq: Decoding the rise of gore on big screensIndian cinema is witnessing a surge in stylised gore, captivating audiences despite the lack of family-friendly certifications. On Cinematic Saturday, actor Unni Mukundan, senior trade analyst Taran Adarsh and National Award-winning critic Deepak Dua decode what is drawing the big screen audience to gruesome films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-gaza-ressurgence-sighs-israel-war-anthony-blinken-build-up-2669772-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is Hamas back in control in Gaza within days of ceasefire?The ceasefire in the Israel-Hamas war may have brought a pause to the fighting, but it has also allowed Hamas to regroup and assert its authority in Gaza. Hamas, which has recruited thousands of fighters all through the war, has redeployed police and is making a visible return to power in Gaza."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-2025-yamuna-water-pollution-bjp-parvesh-verma-arvind-kejriwal-poster-dip-video-2669952-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's Parvesh Verma dips Arvind Kejriwal's cutout in Yamuna amid pollution rowThe BJP intensified its criticism of former Delhi Chief Minister Arvind Kejriwal, focusing on the unfulfilled promise to clean the Yamuna River. Candidate Parvesh Verma staged a symbolic protest, accusing AAP of failing to address pollution despite 11 years in power."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-minister-ponguleti-srinivas-reddy-scolds-anger-karimnagar-collector-pamela-satpathy-viral-video-2669943-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana minister berates IAS officer at event: Have you no common sense?A viral clip shows Telangana Revenue Minister Ponguleti Srinivas Reddy lashing out at Karimnagar District Collector Pamela Satpathy during a government programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-viral-video-of-mamta-kulkarni-getting-emotional-at-maha-kumbh-mela-2025-during-mahamandaleshwar-ceremony-2669950-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Mamta Kulkarni gets emotional, shares video of her Mahamandaleshwar ceremonyFormer actor Mamta Kulkarni, known for films like Karan Arjun and Sabse Bada Khiladi, renounced worldly affairs, and became a 'Mahamandelshwar' at the ongoing Maha Kumbh Mela. She later shared a video of her consecration ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/after-windsor-comet-zs-jsw-mg-looks-to-electrify-market-with-cyberster-m9-2669918-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Windsor, Comet, ZS, JSW MG looks to electrify market with Cyberster, M9With the arrival of the Cyberster and the M9, JSW MG's EV portfolio will include mass-market and premium models."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-woman-slams-uber-cab-driver-sends-inappropriate-texts-viral-linkedin-post-prompts-action-2669925-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman slams Uber as cab driver sends inappropriate texts. Viral post prompts actionA Delhi-based woman slammed Uber after she claimed to have received inappropriate texts from a cab driver moments after she booked a ride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-g-dukesh-vs-abdusattorov-tata-steel-2025-magnus-carlsen-reaction-draw-2669955-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Spectacular failure: Carlsen criticises Gukesh's strategy at Tata Steel ChessTata Steel Chess 2025: World Champion D. Gukesh escaped from a worse position to hold Grandmaster Nodirbek Abdusattorov to a draw after 64 moves in a Round 6 match that lasted nearly six hours on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-techie-hilarious-chat-with-college-maths-professor-viral-screenshot-2669908-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie shares hilarious chat with Maths professor. Screenshot goes viralA Bengaluru-based techie shared an unexpected conversation with his maths professor on social media which has since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-captures-mahesh-babu-passport-ssmb29-priyanka-chopra-reacts-2669904-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SS Rajamouli 'captures' Mahesh Babu's passport. Priyanka Chopra reactsFilmmaker SS Rajamouli confirmed his next project with Mahesh Babu and Priyanka Chopra, using his usual humour to announce the collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vido-vande-bharat-srinagar-vaishno-devi-katra-chenab-railway-bridge-anji-khad-jammu-kashmir-2669915-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Vande Bharat train's 1st trial run on world's highest rail bridge in J&KIndian Railways conducted the first trial run of Vande Bharat train from Shri Mata Vaishno Devi Katra station to Srinagar station on Chenab Bridge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-kush-desai-white-house-deputy-press-secretary-indian-american-former-journalist-2669917-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Kush Desai, Indian-American picked by Trump as his deputy press secretaryUS President Donald Trump has appointed Kush Desai, an Indian-American former journalist, as his deputy press secretary. Desai previously held key roles, including Deputy Communications Director for the 2024 Republican National Convention and Communications Director for the Republican Party of Iowa."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/from-paragliding-to-bungee-jumping-how-safe-are-extreme-sports-in-india-2669722-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From paragliding to bungee jumping: How safe are extreme sports in India?With more Indians embracing travel, the demand for thrilling, adrenaline-packed activities has surged. However, recent incidents have raised questions about the safety and security of such activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-business-entertainment-politics-444-24-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-airlines-flight-lagos-washington-emergency-landing-sudden-movement-injuries-2669968-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Chaos on US-bound flight after 'sudden movement' mid-air, 6 injuredVideo footage taken by passengers shows the chaos onboard, with trays, food, and other objects scattered across the floor. Such was the impact of the jolt that the overhead luggage bins were splashed with beverages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-dutt-to-return-as-gangster-raghu-in-mahesh-manjrekar-vaastav-2-all-you-need-to-know-2669967-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sanjay Dutt to return as gangster Raghu in Mahesh Manjrekar's Vaastav 2: ReportVaastav (1999) is considered one of the most reverred performances by actor Sanjay Dutt. A new report now suggested that he could be back as Raghu in Sanjay Manjrekar's Vaastav 2. Here's everything you need to know about this new film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/h-1b-visa-uncle-don-doesnt-want-you-2669046-2025-01-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "H-1B visa: Uncle Don doesn't want youIndians in America are in for trouble should president Donald Trump enforce his hardline stance on immigration. How real is the threat and what India can do about it\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-mette-frederiksen-phone-call-greenland-takeover-denmark-horrendous-appalling-europe-officials-nato-2669879-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's 'horrendous' phone call with Danish PM over Greenland: ReportTrump made it clear that he was \"serious\" about acquiring Greenland, but Danish PM Mette Frederiksen rejected the idea outright, stating Denmark was not interested in \"selling\" the mineral-rich island."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-to-launch-nvs-02-on-gslv-f15-to-boost-indian-constellation-what-is-navic-2669714-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "GSLV-F15 NVS-02 launch: What is Isro's NavIC navigation constellation?NVS-02 is part of the Navigation with Indian Constellation (NavIC), which aims to augment Indian navigational requirements, both in the private and military sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-chennai-t20i-preview-pitch-team-news-prediction-2669895-2025-01-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2nd T20I preview: Deflated England set for another trial by spin in Chennai India vs England, 2nd T20I preview: After struggling against spin in Kolkata, England face another stern test in Chennai, known for its spin-friendly conditions. India are sweating over the fitness of opener Abhishek Sharma, who twisted his ankle during training on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/18-years-after-jab-we-met-shahid-kapoor-says-geet-aditya-are-now-breaking-up-2669993-2025-01-25",
      "headline": "18 years after Jab We Met, Shahid Kapoor says Geet-Aditya are now 'breaking up' Actor Shahid Kapoor played the role of businessman Aditya Kashyap who falls in love with a chatterbox Geet in Jab We Met. 18 years after the release of the film, he thinks that Aditya and Geet would have frustrated each other and would be taking a divorce today. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-bradd-pitts-son-pax-meets-with-another-e-bike-accident-2669962-2025-01-25",
      "headline": "Angelina Jolie, Brad Pitt's son Pax meets with another e-bike accidentPax Jolie-Pitt, son of Angelina Jolie and Brad Pitt, was involved in another e-bike accident in Hollywood. Despite the crash, he appeared uninjured. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-unmissable-reaction-fan-sings-kandukondain-kandukondain-song-2669966-2025-01-25",
      "headline": "Watch: Ajith Kumar's unmissable reaction as fan sings Kandukondain songActor Ajith Kumar was pleasantly surprised by a fan's rendition of the Kandukondain Kandukondain title track at a restaurant in Dubai. The heartwarming interaction quickly went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-dutt-to-return-as-gangster-raghu-in-mahesh-manjrekar-vaastav-2-all-you-need-to-know-2669967-2025-01-25",
      "headline": "Sanjay Dutt to return as gangster Raghu in Mahesh Manjrekar's Vaastav 2: ReportVaastav (1999) is considered one of the most reverred performances by actor Sanjay Dutt. A new report now suggested that he could be back as Raghu in Sanjay Manjrekar's Vaastav 2. Here's everything you need to know about this new film. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/want-to-be-lady-jasprit-bumrah-nepal-u-19-captain-puja-mahato-womens-u-19-world-cup-2669980-2025-01-25",
      "headline": "I want to be lady Jasprit Bumrah: Nepal U-19 captain Puja MahatoNepal's Under-19 captain Puja Mahato recently spoke about her admiration for Jasprit Bumrah and mentioned that she wants to be lady Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-final-live-score-arnya-sabalenka-vs-madison-keys-2669961-2025-01-25",
      "headline": "Women's singles final live: Aryna Sabalenka vs Madison Keys final underwayAustralian Open 2025 final live score and updates: Aryna Sabalenka is bidding to complete a rare hat-trick at Melbourne Park. The World No. 1 has been in fine form, but she faces a tricky test against Madison Keys, who knocked out Iga Świątek in the semi-final"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-g-dukesh-vs-abdusattorov-tata-steel-2025-magnus-carlsen-reaction-draw-2669955-2025-01-25",
      "headline": "Spectacular failure: Carlsen criticises Gukesh's strategy at Tata Steel ChessTata Steel Chess 2025: World Champion D. Gukesh escaped from a worse position to hold Grandmaster Nodirbek Abdusattorov to a draw after 64 moves in a Round 6 match that lasted nearly six hours on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-suryakumar-yadav-jokes-about-not-emulating-rohit-sharmas-stump-mic-antics-2669953-2025-01-25",
      "headline": "Suryakumar Yadav jokes about not emulating Rohit Sharma's stump-mic anticsIndia's T20I captain Suryakumar Yadav revealed that he likes to stay away from stump mic so as to not repeat Rohit Sharma's stump mic antics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wrestling-federation-of-india-office-brij-bhushan-sharan-singh-connaught-place-new-delhi-2669938-2025-01-25",
      "headline": "WFI admits operating from Brij Bhushan's residence, vows to shift in FebruaryThe Wrestling Federation of India promised it would shift its office fro former president Brij Bhushan Singh's residene to a new venue in New Delhi in February. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ajinkya-rahane-recalled-to-bat-in-mumbai-vs-jammu-kashmir-game-in-ranji-trophy-2669930-2025-01-25",
      "headline": "Why was ARahane recalled to bat after being given out on-field in Ranji Trophy?Mumbai captain Ajinkya Rahane was recalled to bat after being given out on-field during Day 2 of their Ranji Trophy clash against Jammu & Kashmir. Rahane had reached the dressing room when he was called back to resume his innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-noman-ali-hat-trick-pakistan-spinner-west-indies-multan-test-2669923-2025-01-25",
      "headline": "Noman Ali scripts history, becomes 1st Pakistan spinner to take Test hat-trickPakistan vs West Indies, 2nd Test: Noman Ali took a hat-trick in the first hour of Day 1 of the Test match in Multan. The 38-year-old became the first spinner to achieve the landmark for Pakistan in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-pep-talk-mumbai-vs-jammu-and-kashmir-ranji-trophy-bkc-2669919-2025-01-25",
      "headline": "Rohit Sharma gives pep talk to Mumbai teammates after Shardul Thakur heroicsRanji Trophy 2024-25: India captain Rohit Sharma addressed the team huddle ahead of Jammu and Kashmir's final innings. Rohit struggled with the bat on his return to the domestic tournament after nine years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-washington-sundar-varun-chakravarthy-recall-chennai-memories-ind-vs-eng-2nd-t20i-2669910-2025-01-25",
      "headline": "Local boys Sundar and Varun recall fond Chennai memories ahead of 2nd T20IWashington Sundar, Varun Chakravarthy recalled old memories in Chennai ahead of the second T20I against England in the city at MA Chidambaram Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-womens-world-cup-2025-direct-berth-bangladesh-2669913-2025-01-25",
      "headline": "New Zealand pip Bangladesh to seal last direct spot for Women's ODI World Cup 2025New Zealand secured the last of the six direct berths for the ICC Women's World Cup 2025. Bangladesh fluffed an opportunity to overtake New Zealand when they lost the final match of an ODI series in the West Indies on Friday, January 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-noman-ali-hat-trick-pakistan-spinner-west-indies-multan-test-2669923-2025-01-25",
      "headline": "Noman Ali scripts history, becomes 1st Pakistan spinner to take Test hat-trickPakistan vs West Indies, 2nd Test: Noman Ali took a hat-trick in the first hour of Day 1 of the Test match in Multan. The 38-year-old became the first spinner to achieve the landmark for Pakistan in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-pep-talk-mumbai-vs-jammu-and-kashmir-ranji-trophy-bkc-2669919-2025-01-25",
      "headline": "Rohit Sharma gives pep talk to Mumbai teammates after Shardul Thakur heroicsRanji Trophy 2024-25: India captain Rohit Sharma addressed the team huddle ahead of Jammu and Kashmir's final innings. Rohit struggled with the bat on his return to the domestic tournament after nine years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-washington-sundar-varun-chakravarthy-recall-chennai-memories-ind-vs-eng-2nd-t20i-2669910-2025-01-25",
      "headline": "Local boys Sundar and Varun recall fond Chennai memories ahead of 2nd T20IWashington Sundar, Varun Chakravarthy recalled old memories in Chennai ahead of the second T20I against England in the city at MA Chidambaram Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-womens-world-cup-2025-direct-berth-bangladesh-2669913-2025-01-25",
      "headline": "New Zealand pip Bangladesh to seal last direct spot for Women's ODI World Cup 2025New Zealand secured the last of the six direct berths for the ICC Women's World Cup 2025. Bangladesh fluffed an opportunity to overtake New Zealand when they lost the final match of an ODI series in the West Indies on Friday, January 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ricky-ponting-wants-australia-to-continue-with-sam-konstas-on-sri-lanka-tour-2669896-2025-01-25",
      "headline": "Ricky Ponting wants Australia to continue with Sam Konstas on Sri Lanka tour Legendary Australia cricketer has suggested the Australian team management to continue with Sam Konstas as opener in the upcoming Test series against Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-chennai-t20i-preview-pitch-team-news-prediction-2669895-2025-01-25",
      "headline": "2nd T20I preview: Deflated England set for another trial by spin in Chennai India vs England, 2nd T20I preview: After struggling against spin in Kolkata, England face another stern test in Chennai, known for its spin-friendly conditions. India are sweating over the fitness of opener Abhishek Sharma, who twisted his ankle during training on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-points-out-indias-major-selection-blunder-for-champions-trophy-2669884-2025-01-25",
      "headline": "Harbhajan Singh points out India's major selection blunder for Champions TrophyFormer India spinner Harbhajan Singh has pointed out a major selection blunder in India's squad for the ICC Champions Trophy 2025 as he feels that the selectors could've picked Yuzvendra Chahal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-aryna-sabalenka-madison-keys-final-melbourne-2669697-2025-01-25",
      "headline": "Aryna Sabalenka favourite in finale, but Madison Keys no pushoverAustralian Open 2025: Aryna Sabalenka will go into the summit clash as the firm favourite at the Rod Laver Arena, but Madison Keys will also fancy her chances following her hard-fought win over World No.2 Iga Swiatek in the semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-14-schedule-order-of-play-womens-final-aryna-sabalenka-madison-keys-2669826-2025-01-25",
      "headline": "Australian Open: When and where to watch Women's singles final on Day 14The stage is set for the grand final of the women's singles at the Australian Open 2025 as Aryna Sabalenka will aim to complete a hat-trick of titles in Melbourne. Madison  Keys will be aiming to halt the Belarussian juggernaut and clinch her first grand slam. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/uww-calls-for-end-to-interference-in-wfi-affairs-threatens-to-suspend-india-2669836-2025-01-24",
      "headline": "UWW calls for end to interference in WFI affairs, threatens to suspend IndiaThe UWW, the world governing body for wrestling, has threatened to suspend India if political interference in the Wrestling Federation Of India (WFI) affairs don't come to an end soon. A suspension could put Indian wrestlers' partcipation in events under jeopardy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-did-the-happy-slam-become-the-angry-slam-or-is-tennis-just-changing-2669817-2025-01-24",
      "headline": "Australian Open: Did the Happy Slam become the Angry Slam? Or is tennis just changing?The Australian Open 2025 saw a lot of big results and upsets but all the noise was about the unruly and rowdy crowd in attendance during the matches in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-2nd-test-aaqib-javed-press-conference-spin-strategy-2669811-2025-01-24",
      "headline": "PAK vs WI: Pakistan interim coach Aaqib Javed defends spin strategy at homePakistan interim coach Aaqib Javed has defended their spin strategy for home matches ahead of the second Test against West Indies. Pakistan won the series against England and the first Test against West Indies using spinners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-14-schedule-order-of-play-womens-final-aryna-sabalenka-madison-keys-2669826-2025-01-25",
      "headline": "Australian Open: When and where to watch Women's singles final on Day 14The stage is set for the grand final of the women's singles at the Australian Open 2025 as Aryna Sabalenka will aim to complete a hat-trick of titles in Melbourne. Madison  Keys will be aiming to halt the Belarussian juggernaut and clinch her first grand slam. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/uww-calls-for-end-to-interference-in-wfi-affairs-threatens-to-suspend-india-2669836-2025-01-24",
      "headline": "UWW calls for end to interference in WFI affairs, threatens to suspend IndiaThe UWW, the world governing body for wrestling, has threatened to suspend India if political interference in the Wrestling Federation Of India (WFI) affairs don't come to an end soon. A suspension could put Indian wrestlers' partcipation in events under jeopardy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-did-the-happy-slam-become-the-angry-slam-or-is-tennis-just-changing-2669817-2025-01-24",
      "headline": "Australian Open: Did the Happy Slam become the Angry Slam? Or is tennis just changing?The Australian Open 2025 saw a lot of big results and upsets but all the noise was about the unruly and rowdy crowd in attendance during the matches in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-vs-west-indies-2nd-test-aaqib-javed-press-conference-spin-strategy-2669811-2025-01-24",
      "headline": "PAK vs WI: Pakistan interim coach Aaqib Javed defends spin strategy at homePakistan interim coach Aaqib Javed has defended their spin strategy for home matches ahead of the second Test against West Indies. Pakistan won the series against England and the first Test against West Indies using spinners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-kuldeep-yadav-trolls-rcb-video-response-delhi-capitals-2669794-2025-01-24",
      "headline": "IPL trophy will be yours: Kuldeep Yadav asks RCB fans to chill after viral videoKuldeep Yadav tried to calm the RCB fans by saying that they would win the IPL trophy after the video trolling the franchise went viral on Friday, January 24. Kuldeep received mixed response after his RCB troll video went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-2nd-t20i-predicted-xi-mohammed-shami-return-abhishek-sharma-chennai-2669771-2025-01-24",
      "headline": "IND vs ENG 2nd T20I Predicted XI: Shami return, Abhishek fitness in focusIndia and England are all set to lock horns in the 2nd T20I on Saturday, January 25 at the iconic Chepauk stadium in Chennai. All eyes will be on the Indian lineup as fans wait to see if Mohammed Shami will be ready for the match and if Abhishek Sharma can survive his injury scare. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-twists-ankle-india-suffer-injury-scare-england-2nd-t20i-2669784-2025-01-24",
      "headline": "Abhishek Sharma twists ankle as India suffer injury scare ahead of Chennai T20IIndia opener Abhishek Sharma twisted his ankle during the nets session in Chennai in a massive injury scare for the hosts on the eve of the second T20I against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-consider-all-spin-attack-in-second-test-vs-west-indies-2669776-2025-01-24",
      "headline": "Pakistan consider all-spin attack in second Test against West IndiesPakistan are contemplating a bold strategy for the second Test against the West Indies by potentially fielding three specialist spinners and no pace bowler, following their recent success with spin in Multan."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}