{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-key-proposals-for-fds-long-term-savings-capital-markets-mutual-funds-taxation-and-compliance-2659369-2025-01-03",
      "headline": "Budget 2025: Key proposals for FDs, and long-term savingsTax incentives for fixed deposits and boost middle-class savings could redefine savings strategies in Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-goods-and-services-tax-on-vouchers-and-gift-cards-all-you-need-to-know-2659315-2025-01-03",
      "headline": "GST on vouchers and gift cards: All you need to knowGift vouchers are exempt from GST, but commissions and services linked to them remain taxable under GST rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-sensex-nifty-fall-nearly-1-percent-as-it-financial-banking-pharma-stocks-tumble-in-volatile-day-2659277-2025-01-03",
      "headline": "Sensex, Nifty fall nearly 1% as IT, banking stocks tumble in volatile day The S&P BSE Sensex plunged 720.60 points to end at 79,223.11, while the NSE Nifty50 lost 199.60 points to end at 23,989.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-taxpayers-5-reforms-that-could-make-new-tax-regime-a-better-deal-for-you-2659264-2025-01-03",
      "headline": "Budget 2025: 5 reforms that could make new tax regime a better deal for youThe government is expected to focus on boosting consumption, given the low GDP for the second quarter, which could lead to tax relief measures aimed at increasing disposable income for salaried taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-date-time-and-what-to-expect-fm-nirmala-sitharaman-to-present-key-policies-and-reforms-income-tax-2659224-2025-01-03",
      "headline": "Budget 2025: Date, time, and what to expectThe countdown to India's Union Budget 2025 has begun, with Nirmala Sitharaman set to present key policies and reforms on February 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-kpi-green-energy-share-price-is-showing-36-decline-on-some-trading-apps-bonus-issue-stmp-2659186-2025-01-03",
      "headline": "Explained: Why KPI Green Energy shares are down 36% on some trading appsKPI Green Energy stock price: The stock declined 4.44% to trade at Rs 547 on the Bombay Stock Exchange (BSE) at Rs 1:40 pm after hitting an intraday low of Rs 548."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-rises-4-percent-should-you-buy-brokerage-review-clsa-nomura-stmp-2659167-2025-01-03",
      "headline": "Tata Motors share price rises 4%. Is it a good time to invest?Tata Motors stock: Over the past five trading sessions, Tata Motors has gained more than 6%. However, the stock has seen a decline of 18.36% in the last six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-five-key-announcements-india-is-waiting-for-income-tax-relief-reduction-in-excise-duty-on-fuel-focus-on-job-creation-2659149-2025-01-03",
      "headline": "Budget 2025: 5 key announcements India is waiting forBudget 2025 holds the potential to bring much-needed relief to the economy, addressing both long-term growth and immediate concerns like inflation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-gains-over-12-percent-hits-all-time-high-know-why-stmp-2659153-2025-01-03",
      "headline": "ITI share price soars over 12%, hits all-time high. Know whyITI stock price: Earlier, some analysts had advised investors to book profits as it was approaching a critical resistance zone. However, it has now surpassed the resistance zone and is likely to continue its upward momentum. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oil-india-ongc-share-price-jump-5-percent-today-what-is-fuelling-the-rally-stmp-2659131-2025-01-03",
      "headline": "Oil India, ONGC shares jump 5% today. What's fuelling the rally?The rally can be attributed to global policy measures aimed at economic revival, which investors believe could boost fuel demand and enhance earnings for upstream oil companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jai-corp-stock-price-52-week-low-today-check-key-details-capital-reduction-proposal-stmp-2659116-2025-01-03",
      "headline": "Explained: Why Jai Corp share price hit 52-week low todayThe steep decline in Jai Corp's share price over two sessions stems from a significant capital reduction proposal involving Urban Infrastructure Holdings Private Limited (UIHPL), where Jai Corp holds a 32% equity stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-tax-saving-tips-for-young-professionals-in-2025-investment-planning-health-insurance-2659101-2025-01-03",
      "headline": "5 tax-saving tips for young professionals in 2025Proactive financial planning helps young professionals save taxes, build wealth, and reach goals with strategies like early planning, goal-based investing, and health insurance, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-600-points-3-reasons-behind-stock-market-volatility-2659096-2025-01-03",
      "headline": "Sensex tumbles 600 points: 3 reasons behind stock market volatilityThe downturn highlights the persistent volatility on Dalal Street, with investors uncertain about the short-term market trajectory. While auto and IT stocks had propelled a rally just a day ago, profit booking amid prevailing uncertainty appears to have weighed heavily on sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/leo-dry-fruits-and-spices-ipo-last-day-check-price-band-gmp-today-stmp-2659089-2025-01-03",
      "headline": "Leo Dry Fruits and Spices IPO: Check price band, GMP today  Leo Dry Fruits and Spices IPO last day: The initial public offering (IPO) of Leo Dry Fruits and Spices will close for bidding on Friday after having opened for subscription on January 1, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-5-top-expectations-of-senior-citizens-enhanced-savings-better-deductions-for-medical-costs-2659086-2025-01-03",
      "headline": "Budget 2025: 5 top expectations of senior citizens Budget 2025 can ease senior citizens' burdens with higher tax exemptions, simpler processes, and targeted benefits for financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dmart-share-price-avenue-supermarts-stock-jumps-13-percent-in-early-trade-should-you-buy-stmp-2659058-2025-01-03",
      "headline": "DMart share price jumps 14% in early trade: Should you buy?DMart share price: The stock, which closed at Rs 3,617.75 in the previous session, rose to a high of Rs 4,165.00 during intraday trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-drops-over-400-points-nifty-slips-below-24100-in-early-trade-2659048-2025-01-03",
      "headline": "Sensex drops 400 points; Nifty slips below 24,100 in early tradeThe S&P BSE Sensex lost 452.52 points to 79,491.29, while the NSE Nifty50 was down by 93.25 points to 24,095.40 as of 9:42 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kabeer-biswas-founder-dunzo-exit-quick-commerce-startup-reliance-retail-battles-cash-crisis-report-2659043-2025-01-03",
      "headline": " Kabeer Biswas may call it quits as Dunzo battles cash crisis: Report The Bengaluru-based quick commerce platform has faced a challenging period over the last 12–18 months, marked by cash flow issues and difficulties in raising fresh funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-allotment-status-online-step-by-step-guide-latest-gmp-listing-date-2659030-2025-01-03",
      "headline": "Indo Farm Equipment IPO: Check allotment status, GMP and listing dateIndo Farm IPO allotment status:: Investors who wish to check Indo Farm Equipment IPO allotment can do so by visiting the Bombay Stock Exchange (BSE) website and the registrar's online portal, which is Mas Services Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-evasion-can-unregistered-small-businesses-b2c-receive-gst-notices-2658821-2025-01-03",
      "headline": "Can unregistered small businesses receive GST notices?The annual turnover threshold for GST registration is Rs 40 lakh for businesses supplying goods and Rs 20 lakh for service providers. Businesses below these limits are exempt, but exceeding them triggers registration and compliance requirements."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/2025-delhi-election-ramesh-bidhuri-sexist-remark-against-congress-priyanka-gandhi-controversy-2659964-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Roads like Priyanka Gandhi's cheeks: BJP leader's sexist jibe, Congress hits backCalling BJP an \"anti-woman party,\" Congress said that the remarks made by Bidhuri are \"shameful\" and reflect his \"ugly\" mindset when it comes to women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prime-minister-narendra-modi-delhi-election-attack-aap-government-bjp-assembly-elections-2659991-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Won't tolerate 'AAP-da' in Delhi, only BJP can develop city: PM's big attackPrime Minister Narendra Modi accused the AAP government in Delhi of not having a development vision for the national capital and asserted that there had been an 'AAP-da' (disaster) in the city in the last 10 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/gujarat/story/gujarat-porbandar-helicopter-crash-air-enclave-deaths-2659977-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3 killed after Coast Guard helicopter crashes in Gujarat's PorbandarCoast Guard helicopter: Three crew members of a Coast Guard helicopter died after it crashed in Gujarat's Porbandar Airport. Indian Coast Guard officials confirmed the deaths and said that an investigation into the cause of the crash is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-allan-border-not-invited-present-trophy-australia-win-series-2659947-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunil Gavaskar upset he wasn't invited for Border-Gavaskar Trophy presentationIND vs AUS: Legendary India batter Sunil Gavaskar was upset over not being called to hand over the winner's trophy to the Australian team alongside his peer Allan Border. Gavaskar and Border are the two players which the India vs Australia series is named after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/mughlai-food-restaurants-delhi-kolkata-lucknow-rumali-roti-roomali-online-kebab-tikka-cost-economics-profit-sikll-2658799-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is the rumali roti vanishing? Solving the great menu mysteryIn a world where food trends shift faster than you can say \"naan\", the quiet disappearance of rumali roti from menus in some Indian cities raised concerns. The rumali might have been a casualty of restaurant economics or health concerns, but a roti revolution is ensuring that the iconic flatbread from ulta tawa survives all odds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/panipuri-vendor-gst-notice-lakh-viral-social-media-claim-fact-check-tamil-nadu-2659986-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did panipuri vendor get GST notice for earning Rs 40 lakh? Here's the truthIndia Today TV conducted a fact check of the GST notice that was issued to a panipuri vendor from Tamil Nadu and found out that it was actually for a hotel vendor, and the 'to address' of the notice was doctored."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/aap-bjp-social-media-war-delhi-assembly-polls-aapda-chief-ministerial-face-digs-2659930-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's 'no Chief Minister face' jab at BJP, party responds with 'AAP-da' digDelhi Elections 2025: The AAP and BJP sparred on social media ahead of the Delhi Assembly polls likely to be held in February. The AAP is aiming to win a third consecutive term while the BJP is eyeing a return to power in the national capital after 27 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-performance-injury-sydney-2659905-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Perfect Perth, sore Sydney: Jasprit Bumrah vs Australia ends in an anti-climaxIND vs AUS: From ectasy in Perth with a stunning win to a painful end in Sydney, Jasprit Bumrah's historic Border-Gavaskar Trophy 2024-25 came to a close in anti-climatic fashion. Bumrah's incredible performance wasn't enough as India lost the series 1-3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/40-years-this-is-the-time-it-took-for-a-non-maruti-car-to-triumph-in-annual-sales-2659957-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "40 years! This is the time it took for a non-Maruti car to triumph in annual salesOver the past 40 years, Maruti cars have dominated the Indian passenger vehicle market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/pm-narendra-modi-to-inaugurate-delhi-section-of-namo-bharat-corridor-traffic-advisory-issued-2659870-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM launches key Delhi section of Namo Bharat Rapid Rail in mega infra pushThe 13-kilometre Delhi section of the Namo Bharat RRTS corridor between Sahibabad and New Ashok Nagar was inaugurated by Prime Minister Narendra Modi today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-killed-suv-plunges-gorge-jammu-and-kashmirs-kishtwar-2659946-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "4 killed as vehicle plunges into gorge in Jammu and Kashmir's KishtwarJ&K Accident: Four people died, and two remain missing after a vehicle plunged into a deep gorge in Jammu and Kashmir's Kishtwar district. Rescue teams are searching, with Union Minister Jitendra Singh monitoring updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-congress-mp-conversation-iit-madras-students-bjp-education-2659884-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How are Congress and BJP different? Rahul Gandhi respondsIn a conversation with IIT Madras students, Rahul Gandhi said the Congress believed in equitable distribution of resources and inclusive growth, while the BJP focused aggressively on growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/healthy-tea-snacks-not-biscuits-rusks-2659861-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What are the healthiest snacks to go with chai? Not biscuits, rusk for sureHealth experts warn that many popular tea-time snack choices in Indian households are unhealthy and should be avoided for daily consumption. If your morning tea ritual also feels incomplete without dipping biscuits or rusks, it might be time to rethink your snack choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deva-teaser-out-shahid-kapoor-rosshan-andrrews-pooja-hegde-january-31-2659979-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Deva teaser: Shahid Kapoor is a trigger-happy cop in Rosshan Andrrews filmDeva teaser: Zee Studios and Roy Kapur Films have unveiled the teaser for Deva, featuring Shahid Kapoor in an intense role. The film, directed by Rosshan Andrrews, promises high-octane action and captivating performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/concert-etiquette-please-the-reason-sonu-nigam-got-upset-with-politicians-2659405-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Concert etiquette, please: The reason Sonu Nigam got upset with politiciansAbrupt entry-exit, crowding backstage, mobile phone disturbance—renowned artistes underline the don'ts for people attending musical performances"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-sees-seasons-longest-zero-visibility-spell-on-january-4-flights-diverted-2659866-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18 flights cancelled, over 250 delayed in Delhi amid dense fog; 60 trains affectedDelhi Weather: As dense fog engulfed Delhi, reducing visibility to zero, at least 18 flights were cancelled today. More than 10 trains were running six to seven hours late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-son-albie-press-conference-in-sydney-2659971-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pat Cummins' son Albie adorably interrupts father's press conference in SydneyIND vs AUS: Australia captain Pat Cummins had his press conference interrupted in Sydney. Cummins' son Albie walked through the gate and called for his father, briefly stopping the press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-politics-business-entertainment-441-03-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-performance-gautam-gambhir-press-conference-sydney-2659931-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India can't be Jasprit Bumrah dependent always: Gautam Gambhir after series lossIND vs AUS: India coach Gautam Gambhir claimed that the team cannot always be dependent on Jasprit Bumrah to get a win after losing the Sydney Test and the Border-Gavaskar Trophy to Australia. Bumrah missed Day 3 of the match at the SCG due to a back spasm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-receives-legal-notice-ahead-of-ahmedabad-concert-2659898-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Coldplay receives legal notice ahead of Ahmedabad concertColdplay Ahmedabad Concert: Ahead of Coldplay's concert in Ahmedabad this January, the District Child Protection Unit has issued a notice to ensure no children are used on stage and mandatory hearing protection is provided. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-woman-shares-how-life-changed-after-marrying-an-odia-man-in-viral-video-2659976-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US woman shares how life changed after marrying an Odia man in viral videoIn a video on Instagram, an American woman shared how her life changed after becoming part of her husband's Odia family. The video has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-update-video-teen-hostage-family-rescue-benjamin-netanyahu-2659902-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas releases Israeli teen hostage's video, family says 'hearts torn to pieces'Hamas released a new video of Liri Albag, a 19-year-old Israeli soldier, held hostage for one-and-a-half years by the group. Her family said their \"hearts were torn to pieces\" after seeing the clip and urged the Israeli government to secure her release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-india-lose-border-gavaskar-trophy-sydney-test-match-jasprit-bumrah-injury-2659900-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No Bumrah, no joy: India drop Border-Gavaskar Trophy after 7 years in SydneyIND vs AUS 5th Test: A Jasprit Bumrah-less Indian team failed to restrict Australia on Day 3 of the final Test match in Sydney. India lost the 5th Test by 6 wickets, surrendering the Border-Gavaskar Trophy for the first time in 10 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/naxals-killed-abujhmad-chhattisgarh-encounter-security-forces-2659904-2025-01-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "4 Naxals gunned down in encounter with security forces in Chhattisgarh, cop diesChhattisgarh Nasal Encounter: The gunfight broke out in the densely forested Naxal stronghold Abujhmaad, bordering Narayanpur and Dantewada districts, as the security forces were conducting an anti-Naxalite operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/soha-ali-khan-visits-mansoor-ali-khan-pataudis-grave-on-his-84th-birth-anniversary-2660005-2025-01-05",
      "headline": "Soha Ali Khan visits Mansoor Pataudi's grave on his 84th birth anniversaryActor and writer Soha Ali Khan paid a visit to the grave of her father and late cricket icon, Mansoor Ali Khan Pataudi, on the occasion of his 84th birth anniversary. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-day-89-salman-khan-confronts-chahat-pandey-her-secret-relationship-2660000-2025-01-05",
      "headline": "BB 18 Day 89: Salman Khan confronts Chahat about her secret relationshipIn a dramatic episode of Bigg Boss 18, host Salman Khan confronted contestant Chahat Pandey about her secret relationship, following comments from her mother about fellow contestant Avinash Mishra. The episode also featured a promotional visit from Kiara Advani and Ram Charan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-attributes-his-success-to-chiranjeevi-at-game-changer-event-2659973-2025-01-05",
      "headline": "Pawan Kalyan attributes his success to Chiranjeevi at Game Changer eventAndhra Pradesh's Deputy Chief Minister and megastar Pawan Kalyan recently graced the Game Changer event held in the state, where he praised Ram Charan's father and actor Chiranjeevi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deva-teaser-out-shahid-kapoor-rosshan-andrrews-pooja-hegde-january-31-2659979-2025-01-05",
      "headline": "Deva teaser: Shahid Kapoor is a trigger-happy cop in Rosshan Andrrews filmDeva teaser: Zee Studios and Roy Kapur Films have unveiled the teaser for Deva, featuring Shahid Kapoor in an intense role. The film, directed by Rosshan Andrrews, promises high-octane action and captivating performances."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-interview-sanjay-manjrekar-other-reason-gautam-gambhir-2659990-2025-01-05",
      "headline": "Gambhir vs Rohit? Sanjay Manjrekar's 'honest' take on captain's candid interviewAustralia vs India, 5th Test: Former India cricketer Sanjay Manjrekar said Rohit Sharma spoke to the broadcasters midway through the Sydney Test because he wanted to clear the air about his absence from the XI. Manjrekar also said retirement is a personal call, but one's place in the squad should be determined by the selectors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pat-cummins-on-golden-run-in-captaincy-didnt-realise-weve-won-everything-2659987-2025-01-05",
      "headline": "Pat Cummins on golden run in captaincy: Didn't realise we've won everythingAustralia captain Pat Cummins revealed that he didn't realise that his team had won everything in Test cricket after the 3-1 series win against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-virat-kohli-off-side-woes-ab-de-villiers-2659983-2025-01-05",
      "headline": "Virat Kohli's off-side woes: AB de Villiers suggests solution to India starAB de Villiers has suggested a solution to Virat Kohli's off-side woes after the Indian star struggled during the recently-concluded Border-Gavaskar Trophy against Australia. Kohli was dismissed multiple times in the same fashion during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-son-albie-press-conference-in-sydney-2659971-2025-01-05",
      "headline": "Pat Cummins' son Albie adorably interrupts father's press conference in SydneyIND vs AUS: Australia captain Pat Cummins had his press conference interrupted in Sydney. Cummins' son Albie walked through the gate and called for his father, briefly stopping the press conference.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-5th-test-gautam-gambhir-press-conference-defeat-border-gavaskar-trophy-2659963-2025-01-05",
      "headline": "Gambhir addresses Rohit-Kohli dilemma after India lose Border-Gavaskar TrophyAustralia vs India, 5th Test: Head coach Gautam Gambhir remained coy about the Test future of Rohit Sharma and Virat Kohli. Speaking after India lost the Sydney Test, Gambhir said it was not the right time to talk about the transition period. He underscored the importance of Test players playing domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-team-pose-with-wtc-bgt-ashes-titles-pat-cummins-2659959-2025-01-05",
      "headline": "Big boys, big titles: Australia flaunt BGT, Ashes, WTC trophies after Sydney winThe Australian team decided to pose with the Ashes, Border-Gavaskar Trophy and the World Test Championship mace as they defeated India in the Sydney Test on Sunday, January 5. Australia defeated India in Sydney by 6 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-england-tour-simon-katich-future-stand-up-comedy-2659952-2025-01-05",
      "headline": "Rohit Sharma for England? Test cricket not for 37-year-olds at top-order: KatichAustralia vs India, 5th Test: Former Australia opener Simon Katich said he is doubtful whether Rohit Sharma, at 37, would be able to regain his form in Test cricket. India next play a five-Test series in England, known to be one of the toughest places for visiting batters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-blasts-virat-kohli-aus-vs-ind-border-gavaskar-trophy-2659949-2025-01-05",
      "headline": "Irfan Pathan blasts Virat Kohli: Do India deserve underperforming seniors?Former India cricketer turned commentator Irfan Pathan heavily criticised star India batter Virat Kohli for his prolonged poor form in Test cricket after series loss vs Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-allan-border-not-invited-present-trophy-australia-win-series-2659947-2025-01-05",
      "headline": "Sunil Gavaskar upset he wasn't invited for Border-Gavaskar Trophy presentationIND vs AUS: Legendary India batter Sunil Gavaskar was upset over not being called to hand over the winner's trophy to the Australian team alongside his peer Allan Border. Gavaskar and Border are the two players which the India vs Australia series is named after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-first-odi-report-matt-henry-will-young-wellington-2659944-2025-01-05",
      "headline": "NZ vs SL: Young, Henry star as New Zealand thump Sri Lanka in 1st ODIWill Young and Matt Henry were the stars of the show as New Zealand thumped Sri Lanka by 9 wickets in the first ODI played in Wellington on Sunday, January 5. Sri Lanka were bundled out for 178 and Young's unbeaten 90 set up the chase perfectly for the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-team-pose-with-wtc-bgt-ashes-titles-pat-cummins-2659959-2025-01-05",
      "headline": "Big boys, big titles: Australia flaunt BGT, Ashes, WTC trophies after Sydney winThe Australian team decided to pose with the Ashes, Border-Gavaskar Trophy and the World Test Championship mace as they defeated India in the Sydney Test on Sunday, January 5. Australia defeated India in Sydney by 6 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-england-tour-simon-katich-future-stand-up-comedy-2659952-2025-01-05",
      "headline": "Rohit Sharma for England? Test cricket not for 37-year-olds at top-order: KatichAustralia vs India, 5th Test: Former Australia opener Simon Katich said he is doubtful whether Rohit Sharma, at 37, would be able to regain his form in Test cricket. India next play a five-Test series in England, known to be one of the toughest places for visiting batters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-blasts-virat-kohli-aus-vs-ind-border-gavaskar-trophy-2659949-2025-01-05",
      "headline": "Irfan Pathan blasts Virat Kohli: Do India deserve underperforming seniors?Former India cricketer turned commentator Irfan Pathan heavily criticised star India batter Virat Kohli for his prolonged poor form in Test cricket after series loss vs Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-allan-border-not-invited-present-trophy-australia-win-series-2659947-2025-01-05",
      "headline": "Sunil Gavaskar upset he wasn't invited for Border-Gavaskar Trophy presentationIND vs AUS: Legendary India batter Sunil Gavaskar was upset over not being called to hand over the winner's trophy to the Australian team alongside his peer Allan Border. Gavaskar and Border are the two players which the India vs Australia series is named after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-first-odi-report-matt-henry-will-young-wellington-2659944-2025-01-05",
      "headline": "NZ vs SL: Young, Henry star as New Zealand thump Sri Lanka in 1st ODIWill Young and Matt Henry were the stars of the show as New Zealand thumped Sri Lanka by 9 wickets in the first ODI played in Wellington on Sunday, January 5. Sri Lanka were bundled out for 178 and Young's unbeaten 90 set up the chase perfectly for the hosts. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-sam-konstas-intimidation-remark-gautam-gambhir-sydney-2659937-2025-01-05",
      "headline": "AUS vs IND: Gautam Gambhir slams Australia's Sam Konstas 'intimidation' remarkIndia coach Gautam Gambhir has slammed suggestions from the Australia camp that his side were trying to intimidate Sam Konstas during the Sydney Test. Konstas was involved in a confrontation with Jasprit Bumrah during the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-on-importance-of-domestic-cricket-aus-vs-ind-border-gavaskar-trophy-2659935-2025-01-05",
      "headline": "Gautam Gambhir reiterates importance of domestic cricket after Australia series lossIndia head coach Gautam Gambhir highlighted the importance of playing domestic cricket after 1-3 series loss against Australia in the Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-performance-gautam-gambhir-press-conference-sydney-2659931-2025-01-05",
      "headline": "India can't be Jasprit Bumrah dependent always: Gautam Gambhir after series lossIND vs AUS: India coach Gautam Gambhir claimed that the team cannot always be dependent on Jasprit Bumrah to get a win after losing the Sydney Test and the Border-Gavaskar Trophy to Australia. Bumrah missed Day 3 of the match at the SCG due to a back spasm. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-injury-update-taken-to-hospital-back-spasm-2659922-2025-01-05",
      "headline": "Bumrah rues missing out on spiciest pitch of series: Cannot fight my bodyStand-in India captain Jasprit Bumrah explained the reason behind opting out of bowling midway through the final Test match of the series. Bumrah said that he cannot keep fighting his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-rohit-sharma-test-future-sydney-bgt-gambhir-pressure-2659923-2025-01-05",
      "headline": "Gautam Gambhir leaves it to Virat Kohli, Rohit Sharma to decide Test futureAustralia vs India, 5th Test: Speaking to the press after India lost the Sydney Test on Sunday, head coach Gautam Gambhir said Virat Kohli and Rohit Sharma are still hungry and it is up to them to take a call on their Test future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-performance-injury-sydney-2659905-2025-01-05",
      "headline": "Perfect Perth, sore Sydney: Jasprit Bumrah vs Australia ends in an anti-climaxIND vs AUS: From ectasy in Perth with a stunning win to a painful end in Sydney, Jasprit Bumrah's historic Border-Gavaskar Trophy 2024-25 came to a close in anti-climatic fashion. Bumrah's incredible performance wasn't enough as India lost the series 1-3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/scott-boland-sydney-test-player-of-the-match-aus-vs-ind-border-gavaskar-trophy-2659911-2025-01-05",
      "headline": "Scott Boland on not getting enough opportunities: 'Happy playing whenever I can'Australian seamer Scott Boland revealed that he's happy to play whenever he gets an opportunity after his Player of the Match performance in the fifth Test against India in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-world-test-championship-final-knocked-out-sydney-test-south-africa-2659903-2025-01-05",
      "headline": "India fail to reach World Test Championship final for first time in history Border-Gavaskar Trophy: India failed to reach the final of the World Test Championship for the first time in the tournament's history. Australia will take on South Africa at the Lord's in June in the much-awaited title clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-rohit-sharma-test-future-sydney-bgt-gambhir-pressure-2659923-2025-01-05",
      "headline": "Gautam Gambhir leaves it to Virat Kohli, Rohit Sharma to decide Test futureAustralia vs India, 5th Test: Speaking to the press after India lost the Sydney Test on Sunday, head coach Gautam Gambhir said Virat Kohli and Rohit Sharma are still hungry and it is up to them to take a call on their Test future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-performance-injury-sydney-2659905-2025-01-05",
      "headline": "Perfect Perth, sore Sydney: Jasprit Bumrah vs Australia ends in an anti-climaxIND vs AUS: From ectasy in Perth with a stunning win to a painful end in Sydney, Jasprit Bumrah's historic Border-Gavaskar Trophy 2024-25 came to a close in anti-climatic fashion. Bumrah's incredible performance wasn't enough as India lost the series 1-3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/scott-boland-sydney-test-player-of-the-match-aus-vs-ind-border-gavaskar-trophy-2659911-2025-01-05",
      "headline": "Scott Boland on not getting enough opportunities: 'Happy playing whenever I can'Australian seamer Scott Boland revealed that he's happy to play whenever he gets an opportunity after his Player of the Match performance in the fifth Test against India in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-world-test-championship-final-knocked-out-sydney-test-south-africa-2659903-2025-01-05",
      "headline": "India fail to reach World Test Championship final for first time in history Border-Gavaskar Trophy: India failed to reach the final of the World Test Championship for the first time in the tournament's history. Australia will take on South Africa at the Lord's in June in the much-awaited title clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-pat-cummins-ends-10-year-wait-for-border-gavaskar-trophy-aus-vs-ind-2659888-2025-01-05",
      "headline": "Pat Cummins walks the talk, adds Border Gavaskar Trophy to glittering cabinetAustralia captain Pat Cummins ended Australia's ten-year-long wait for the Border Gavaskar Trophy as he led them to their first series win since 2015 by 3-1. Cummins picked 25 wickets and scored 159 runs in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-india-lose-border-gavaskar-trophy-sydney-test-match-jasprit-bumrah-injury-2659900-2025-01-05",
      "headline": "No Bumrah, no joy: India drop Border-Gavaskar Trophy after 7 years in SydneyIND vs AUS 5th Test: A Jasprit Bumrah-less Indian team failed to restrict Australia on Day 3 of the final Test match in Sydney. India lost the 5th Test by 6 wickets, surrendering the Border-Gavaskar Trophy for the first time in 10 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-rohit-sharma-sydney-interview-meme-fest-einstein-shakespeare-da-vinci-parody-accounts-2659889-2025-01-05",
      "headline": "Rohit Sharma interview triggers memes fest: Einstein, Da Vinci parodies add to funRohit Sharma was the subject of massive trolling by parody accounts after his Sydney interview on Day 2 of the SCG Test on Saturday, January 4. Rohit spoke about a lot of topics during his interview with the broadcasters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-steve-smith-misses-10000-test-runs-sydney-scg-2659881-2025-01-05",
      "headline": "AUS vs IND: Steve Smith misses out on reaching 10000 Test runs, stuck at 9999Steve Smith was left to rue his luck on Day 3 of the Sydney Test as the Australian batter missed out on reaching 10000 Test runs. Smith was left stuck at 9999 runs as he scored just 4 in the second innings. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}