{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Exports to software: How India's economy will benefit from UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-542-points-lower-nifty-below-25100-as-volatility-weighs-heavy-2760677-2025-07-24",
      "headline": "Sensex ends 542 points lower, Nifty below 25,100 as volatility weighs heavyThe S&P BSE Sensex ended 542.47 points lower at 82,184.17, while the NSE Nifty50 declined 157.80 points to close at 25,062.10. Selling pressure was visible across sectors, with FMCG, IT, and financial stocks dragging the indices down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-shopkeepers-are-turning-away-from-upi-payments-2760642-2025-07-24",
      "headline": "Small shopkeepers are turning away from UPI paymentsAccording to the National Payments Corporation of India (NPCI), UPI saw over 14.04 billion transactions in June 2024. Yet, for many at the grassroots, the system seems too complex and risky to fully embrace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/anil-ambani-ed-raid-today-reliance-power-infra-shares-down-5-percent-loan-fraud-2760636-2025-07-24",
      "headline": "ED raids hit Anil Ambani stocks: Reliance Power, Infra sink 5%Reliance Infrastructure has lost 9.37% in the past five trading sessions, Reliance Power has fallen by 7.41% during the same period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-heres-how-to-fix-it-to-avoid-penalty-2760613-2025-07-24",
      "headline": "Filed the wrong ITR form? Here's how to fix it to avoid penaltyMany taxpayers only spot mistakes after hitting 'Submit'. Filing the wrong form can snowball into bigger headaches later, from refund delays to unexpected penalties. But tax experts say you do have ways to set things right, provided you act quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-500-points-why-stock-market-is-down-today-2760574-2025-07-24",
      "headline": "Sensex plunges 600 points. Why is the stock market down today?The S&P BSE Sensex dropped 592.85 points to 82,133.79 by 1:04 pm, while the NSE Nifty50 fell 169.25 points to 25,050.65. All broader market indices were in the red as market sentiment weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-on-digilocker-see-how-it-helps-you-pension-account-pf-balance-2760554-2025-07-24",
      "headline": "EPFO now on DigiLocker: See how it helps youThe government has been making several digital changes for EPFO members in the last few months. This new feature on DigiLocker is another step to make your provident fund details more accessible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-whats-on-the-table-in-the-landmark-usd-34-billion-deal-2760546-2025-07-24",
      "headline": "India-UK FTA: What's on the table in landmark $34 billion deal?For Indian businesses, the FTA opens up wider access to British markets by slashing tariffs and easing compliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-penalty-for-missed-income-tax-deadlines-panel-suggests-in-new-income-tax-bill-2025-2760516-2025-07-24",
      "headline": "No penalty for missed income tax deadlines? Panel suggests in New Tax BillThe suggestions come from the Select Committee, which has studied the new Income Tax Bill, 2025. This new Bill is meant to replace the old Income Tax Act of 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-conducts-raids-on-properties-linked-to-anil-ambani-in-mumbai-2760503-2025-07-24",
      "headline": "ED conducts raids on properties linked to Anil Ambani in MumbaiThe Enforcement Directorate (ED) on Thursday carried out searches at multiple locations in Mumbai connected to industrialist Anil Ambani's companies, days after the State Bank of India (SBI) classified Reliance Communications and Ambani himself as 'fraud'. While his personal residence wasn't searched, ED teams from Delhi and Mumbai targeted premises tied to Reliance Anil Ambani Group (RAAGA) companies in connection with an ongoing money laundering investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-plunges-20-today-whats-behind-the-fall-2760496-2025-07-24",
      "headline": "IEX share price crashes 23% to hit 52-week low. What's behind the fall?IEX shares nosedived after CERC announced phased implementation of market coupling. The move aims to centralise price discovery, challenging IEX's dominance. Investors await clarity from the company's Q1FY26 results."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sacha-baron-cohen-flaunts-six-pack-for-marvel-role-thanks-ozempic-2760582-2025-07-24",
      "headline": "Sacha Baron Cohen flaunts six-pack for Marvel role, thanks OzempicActor Sacha Baron Cohen posted his Men's Fitness UK cover on Instagram on Wednesday. He revealed his sculpted physique in a series of shirtless photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mareesan-review-fahadh-faasil-vaduvelu-road-trip-takes-wrong-turn-post-interval-2760648-2025-07-24",
      "headline": "Maareesan review: Fahadh-Vadivelu's road trip takes wrong turn post-intervalRelease Date:Fri Jul 25, 2025Maareesan movie review: Director Sudheesh Sankar's 'Maareesan', starring Vadivelu and Fahadh Faasil, is a comedy thriller. While the film wows you with a brilliant first half, it takes a formulaic turn in the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-bayaan-premiere-toronto-international-film-festival-2025-2760569-2025-07-24",
      "headline": "Huma Qureshi's Bayaan to premiere at TIFF 2025 as only Indian filmActor Huma Qureshi's film 'Bayaan' will have its world premiere at TIFF 2025. The film directed by Bikas Ranjan Mishra has been selected for the prestigious global festival's Discovery section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dj-snake-returns-to-india-with-a-six-city-tour-hyderabad-delhi-2760620-2025-07-24",
      "headline": "DJ Snake returns to India with a six-city tour: I've missed your energyDJ Snake is set to return to India with a six-city tour in September. He will kick off his tour in Kolkata on September 26 and wrap it up in Delhi-NCR on October 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/no-retakes-no-scripts-the-traitors-india-director-on-filming-show-real-time-2760586-2025-07-24",
      "headline": "No retakes, no scripts: The Traitors India director on filming show real-time'The Traitors India' director Nishant Nayak shared insights on directing the reality TV show with no retakes and live filming. In an interview with India Today, he highlighted how authenticity and Indian sensibilities shaped the unique adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swifts-eras-tour-looks-turned-into-13-wax-statues-at-madame-tussauds-2760577-2025-07-24",
      "headline": "Taylor Swift's Eras Tour looks turned into 13 wax statues at Madame TussaudsMadame Tussauds has unveiled 13 new wax figures of Taylor Swift, capturing her iconic looks from the record-breaking Eras Tour across 13 cities worldwide. This historic release celebrates Swift's immense influence in music and fashion, offering fans a unique experience of her legendary style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-avoids-paparazzi-selfies-with-fans-amid-saiyaara-success-2760580-2025-07-24",
      "headline": "Aneet Padda avoids paparazzi, selfies with fans amid Saiyaara success. WatchActor Aneet Padda recently avoided paparazzi and selfies with fans. She preferred to stay low profile amid the success of her latest film, 'Saiyaara'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-rahul-mishra-hyundai-india-couture-week-2025-sufi-inspired-love-collection-2760490-2025-07-24",
      "headline": "Tamannaah Bhatia dazzles in Rahul Mishra's Sufi-inspired couture collectionActor Tamannaah Bhatia walked the ramp for designer Rahul Mishraat at the Hyundai India Couture Week 2025 in New Delhi on Wednesday. She unveiled the 'Becoming Love' collection with two stunning outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-day-1-prediction-detailed-report-pawan-kalyan-career-best-biggest-opener-to-beat-vakeel-saab-2760570-2025-07-24",
      "headline": "Hari Hara Veera Mallu box office Day 1 prediction: Pawan Kalyan's biggest opener yet'Hari Hara Veera Mallu' is looking at surpassing the opening-day figures of Pawan Kalyan's 'Vakeel Saab' to become the biggest opener of his career. The film has recorded tremendous traction in advance sales. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-reacts-man-kicking-clinic-receptionist-he-needs-to-be-in-jail-2760545-2025-07-24",
      "headline": "Janhvi Kapoor reacts to man kicking clinic receptionist: Nothing excuses thisActor Janhvi Kapoor recently reacted to the viral incident where a man allegedly kicked and dragged a clinic receptionist. The actor questioned such sort of upbringing and demanded strict punishment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prince-harry-meghan-markle-100-millon-dollar-netflix-deal-to-end-without-renewal-2760506-2025-07-24",
      "headline": "Prince Harry and Meghan Markle's $100 million Netflix deal to end without renewalPrince Harry and Meghan Markle's Netflix deal will end this year without renewal. The partnership, valued at approximately $100 million, has now reportedly \"run its course\". The deal was signed in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javeds-swollen-face-heals-attends-delhi-event-india-couture-week-after-lip-filler-removal-2760508-2025-07-24",
      "headline": "Uorfi Javed's swollen face heals, attends Delhi event after lip filler removalJust a day after revealing the swelling caused by dissolving her lip fillers, Uorfi Javed made a confident public appearance at India Couture Week in Delhi, looking completely normal. The actor-influencer recently got her lip fillers dissolved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-3-makers-to-recreate-aaj-ki-raat-style-track-with-kriti-sanon-2760498-2025-07-24",
      "headline": "Exclusive: Don 3 makers to recreate 'Aaj Ki Raat' style track with Kriti Sanon 'Don 3', the highly anticipated Bollywood reboot, will star Ranveer Singh and Kriti Sanon in lead roles. The makers are planning a special dance track, similar to 'Aaj Ki Raat'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-6-detailed-report-mohit-suri-film-remarkable-run-crosses-rs-150-crore-2760487-2025-07-24",
      "headline": "Saiyaara box office Day 6: Mohit Suri's film's remarkable run crosses Rs 150 crore'Saiyaara' has been making the perfect noise from Bollywood in theatres. The love story has been on a record-breaking spree, and there seems no stopping its extraordinary run - at least in the next 10 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-jonas-family-yacht-moment-with-daughter-malti-and-denise-jonas-shared-on-instagram-2760453-2025-07-24",
      "headline": "Aye aye captain, says Priyanka Chopra as daughter Malti steers yacht. See picActor Priyanka Chopra Jonas shared a cute photo of her daughter Malti and mother-in-law Denise Jonas on social media. She is currently on a holiday with her family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hans-zimmer-joins-euphoria-season-3-with-labrinth-soundtrack-2760462-2025-07-24",
      "headline": "Hans Zimmer joins Euphoria Season 3 as composer, Labrinth returnsLegendary music composer and producer Hans Zimmer has teamed up with English singer and songwriter Labrinth for 'Euphoria Season 3' music score. The upcoming season will release in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-ai-influencer-kavya-mehra-digital-contestant-salman-khan-host-august-premiere-2760431-2025-07-24",
      "headline": "Bigg Boss 19 to feature AI influencer Kavya Mehra as first digital contestant: ReportAI influencer Kavya Mehra may join the much-awaited 19th season of reality TV show Bigg Boss. She would be the first digital contestant in the show's history. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-says-her-parents-divorce-shaped-her-own-with-anurag-kashyap-2760443-2025-07-24",
      "headline": "Kalki Koechlin says her parents' divorce shaped her own with Anurag KashyapKalki Koechlin opened up about how her parents' divorce shaped her perspective on relationships, including her own separation from Anurag Kashyap. The two married in 2011 and officially parted ways in 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-reviews-fahadh-faasil-vadivelu-maareesan-2760447-2025-07-24",
      "headline": "Kamal Haasan reviews Fahadh Faasil-Vadivelu's Maareesan: Dances between wit, depthKamal Haasan appreciated the wit and depth of 'Maareesan', a Tamil comedy thriller by Sudheesh Sankar, set to release on 25 July 2025. The film features Fahadh Faasil and Vadivelu in lead roles."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-uk-sign-landmark-free-trade-agreement-during-pms-meeting-with-uks-starmer-2760664-2025-07-24",
      "headline": "PM Modi, Starmer sign historic free trade deal, UK's biggest since leaving EUIndia and the UK on Thursday signed a landmark Free Trade Agreement (FTA), which is expected to boost bilateral trade by USD 34 billion annually. The deal was signed during Prime Minister Narendra Modi's visit to the UK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/has-high-court-applied-its-mind-judiciously-supreme-court-pulls-up-judge-for-bail-to-actor-darshan-2760596-2025-07-24",
      "headline": "Did High Court apply its mind? Supreme Court fumes over bail to actor DarshanThe Supreme Court reserved its order on the Karnataka government's plea challenging bail to actor Darshan in the Renukaswamy murder case. The bench called the High Court's bail order a perverse exercise of discretion. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-warned-by-regulator-over-systemic-lapses-in-fatigue-management-and-training-2760666-2025-07-24",
      "headline": "Aviation regulator warned Air India over crew fatigue, training lapses: ReportAviation regulator had warned Air India of possible enforcement action over repeated safety violations related to crew fatigue, inadequate training, and compliance failures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-day-2-live-updates-score-manchester-weather-gill-stokes-2760632-2025-07-24",
      "headline": "4th Test Day 2 Live Score and Updates: Archer removes Jadeja earlyIndia (IND) vs England (ENG), 4th Test, Day 2 Live Score and Updates: Jofra Archer has got the early wicket of Ravindra Jadeja as England have got an early breakthrough. Washington Sundar has joined Shardul Thakur in the middle with the English bowlers looking dangerous. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/cambodia-thailand-war-hindu-temples-shiva-lingam-sanskrit-dangrek-mountain-prasat-ta-muen-thom-2760643-2025-07-24",
      "headline": "Ancient Hindu temple with Shivling and the Thailand-Cambodia warAncient Hindu temples are part of the area, the dispute over which has sparked a war between Thailand and Cambodia. The clashes began after Cambodian drones were reportedly spotted near the Ta Muen Temple Complex, a group of 11th-century Khmer Hindu temples dedicated to Lord Shiva. This is all about the 1,000-year-old Prasat Ta Muen Thom temple and how it turned into a Buddhist centre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-uk-visit-live-free-trade-deal-signing-meet-with-king-charles-on-todays-agenda-2760563-2025-07-24",
      "headline": "Live: People of India didn't just bring curry, but creativity, character, says PMPM Modi UK Visit Live: India and the United Kingdom on Thursday signed a landmark Free Trade Agreement (FTA) on Thursday, marking the largest trade deal for the UK since its exit from the European Union in 2020. The agreement, projected to increase bilateral trade by USD 34 billion annually, was formalized by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds. The signing followed high-level discussions between Indian Prime Minister Narendra Modi and British Prime Minister Keir Starmer during Modi's visit to London. The FTA is expected to deepen economic ties and open new opportunities for businesses in both countries. This marks PM's fourth visit to the UK since taking office, following previous trips in 2015, 2018, and 2021. Follow indiatoday.in for all Live Updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/why-thailand-cambodia-are-fighting-border-clash-territorial-dispute-2760590-2025-07-24",
      "headline": "F-16 jets, rocket strikes: Why 'friends' Thailand and Cambodia are at warThe Thailand-Cambodia border region has become the site of a deadly clash between the two Southeast Asian neighbours over a simmering territorial dispute, leaving over 10 civilians and soldiers dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-looming-google-earth-lens-how-indias-strategic-assets-lie-exposed-vulnerable-to-harm-2760192-2025-07-23",
      "headline": "How India's strategic assets lie exposed, vulnerable to harmWith detailed imagery of military bases, nuclear plants, border posts and more easily accessible to Open Source Intelligence, how dangerous is this for national security?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-right-toe-fracture-likely-ruled-out-england-test-series-2760603-2025-07-24",
      "headline": "Rishabh Pant suffers right toe fracture, likely out of England seriesRishabh Pant is unlikely to take any further part in the Manchester Test and is expected to miss the remainder of the ongoing Test series against England after scans revealed a fracture in his right toe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jain-and-the-art-of-diplomatic-immunity-who-is-harsh-vardhan-jain-londonia-envoy-caught-for-running-fake-embassy-2760339-2025-07-24",
      "headline": "Jain & the art of diplomatic immunityIt was nothing short of a diplomatic Disneyland. The UP STF busted Harsh Vardhan Jain, \"Baron\" of Westarctica, who turned a rented Ghaziabad bungalow into a fake embassy for imaginary nations. With forged passports, luxury cars bearing diplomatic plates, and photos with real leaders, he scammed job-seekers and firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-partly-pauses-high-courts-mumbai-train-blasts-acquittal-order-accused-not-to-be-re-arrested-2760499-2025-07-24",
      "headline": "Mumbai blasts: Top court halts acquittal order, but accused won't be re-arrestedThe Supreme Court said the Bombay High Court judgment, acquitting all the accused in the 7/11 Mumbai blasts case, shall not be treated as a precedent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mareesan-review-fahadh-faasil-vaduvelu-road-trip-takes-wrong-turn-post-interval-2760648-2025-07-24",
      "headline": "Maareesan review: Fahadh-Vadivelu's road trip takes wrong turn post-intervalRelease Date:Fri Jul 25, 2025Maareesan movie review: Director Sudheesh Sankar's 'Maareesan', starring Vadivelu and Fahadh Faasil, is a comedy thriller. While the film wows you with a brilliant first half, it takes a formulaic turn in the second half."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russian-air-traffic-controllers-lose-contact-with-plane-carrying-50-people-search-on-news-agency-reuters-2760537-2025-07-24",
      "headline": "Russian plane crashes killing all 49 aboard, pilot error during landing suspectedA Russian passenger plane operated by Angara airline crashed near Tynda in the Far East on Monday, killing all 49 on board -- including five children -- after losing contact with air traffic control during a second landing attempt in poor visibility, with pilot error or technical malfunction suspected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/indian-graduate-employability-crisis-skills-gap-youth-unemployment-2760512-2025-07-24",
      "headline": "Why Indian graduates are struggling to find jobsIndia faces a growing employability crisis as many graduates lack necessary job skills. This gap threatens youth employment and calls for urgent educational reforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/cbp-warns-green-card-holders-always-carry-documents-face-fines-indians-america-homeland-security-noem-vance-2760645-2025-07-24",
      "headline": "US cautions Green Card, visa holders, carry papers always or face fineThe US Customs and Border Protection (CBP) has warned all non-citizens, including green card holders, to carry their registration documents at all times or risk fines and misdemeanour charges. This requirement is based on federal law and applies to all non-citizens aged 18 and older. The advisory affects millions, including Indians, who form the second-largest immigrant group in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-comeback-cricket-career-challenges-sonchiriya-england-india-test-2760558-2025-07-24",
      "headline": "Rishabh Pant: Cricket's resilient Sonchiriya dancing to destiny's musicLike the dacoits in Sonchiriya, Rishabh Pant walks a path shadowed by omens. But each time, he lifts the dead snake and keeps moving, saying 'mai ka naam le ke aage badho'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-west-bengal-durga-puja-angan-2026-elections-bjp-tmc-religious-politics-row-2760129-2025-07-24",
      "headline": "Dugga Dugga: BJP, Trinamool battle for Bengal's presiding deity DurgaWith West Bengal headed for the crucial Assembly election in 2026, goddess Durga, the presiding deity of the state, has taken centre stage in the political battlefield. From PM Modi's rally chant to CM Mamata Banerjee's proposed 'Durga Angan', both BJP and TMC are invoking the deity in a bid to sway voters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/rcb-police-officers-to-face-action-as-karnataka-approves-stampede-probe-panels-report-2760637-2025-07-24",
      "headline": "Bengaluru stampede: RCB, cops to face action as Karnataka approves probe reportThe Karnataka cabinet has approved the Justice Cunha report on the June 4 stampede outside Chinnaswamy Stadium that killed 11. Action will be taken against RCB, KSCA, DNA, and police officials. The report cites gross negligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bihari-vs-bahari-the-election-debate-in-nitish-land-2759995-2025-07-23",
      "headline": "Bihari vs 'Bahari': The election debate in Nitish landThe chief minister puts a binding clause on gender quotas: it will be exclusively for women domiciled in Bihar"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-woman-dances-on-bonnet-of-moving-mercedes-as-boyfriend-drives-viral-video-reel-2760672-2025-07-24",
      "headline": "Video: Mumbai woman dances on bonnet of moving Mercedes as boyfriend drivesIn the now-viral clip, the woman is seen posing and dancing on the bonnet of a moving Mercedes while it moves along the road in order to record a reel.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/no-more-tech-hiring-in-india-donald-trump-tells-google-apple-and-others-to-focus-on-americans-2760486-2025-07-24",
      "headline": "No more tech hiring in India, Donald Trump tells Google and MicrosoftUS President Donald Trump has sent a strong message to big tech companies like Google and Microsoft, asking them to stop hiring overseas, including in countries like India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-tried-to-persuade-vice-president-jagdeep-dhankhar-thrice-but-he-acted-alone-on-justice-varma-impeachment-motion-2760303-2025-07-23",
      "headline": "Photo alongside PM, Mercedes fleet: Jagdeep Dhankhar's demands widened riftJagdeep Dhankhar's tussle with the government was not a one-day affair and had been brewing for long over a list of demands by the former Vice President. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/udaipur-files-film-release-muslim-terror-sympathizers-jannatul-ulama-arshad-madani-2760630-2025-07-24",
      "headline": "Udaipur Files paints all Muslims as terror sympathisers: Fresh plea in top courtMaulana Arshad Madani's petition in the Supreme Court challenges the Centre's clearance of the controversial film Udaipur Files, arguing that it vilifies Indian Muslims as terror sympathisers and promotes communal hatred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sacha-baron-cohen-flaunts-six-pack-for-marvel-role-thanks-ozempic-2760582-2025-07-24",
      "headline": "Sacha Baron Cohen flaunts six-pack for Marvel role, thanks OzempicActor Sacha Baron Cohen posted his Men's Fitness UK cover on Instagram on Wednesday. He revealed his sculpted physique in a series of shirtless photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mareesan-review-fahadh-faasil-vaduvelu-road-trip-takes-wrong-turn-post-interval-2760648-2025-07-24",
      "headline": "Maareesan review: Fahadh-Vadivelu's road trip takes wrong turn post-intervalRelease Date:Fri Jul 25, 2025Maareesan movie review: Director Sudheesh Sankar's 'Maareesan', starring Vadivelu and Fahadh Faasil, is a comedy thriller. While the film wows you with a brilliant first half, it takes a formulaic turn in the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-bayaan-premiere-toronto-international-film-festival-2025-2760569-2025-07-24",
      "headline": "Huma Qureshi's Bayaan to premiere at TIFF 2025 as only Indian filmActor Huma Qureshi's film 'Bayaan' will have its world premiere at TIFF 2025. The film directed by Bikas Ranjan Mishra has been selected for the prestigious global festival's Discovery section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-avoids-paparazzi-selfies-with-fans-amid-saiyaara-success-2760580-2025-07-24",
      "headline": "Aneet Padda avoids paparazzi, selfies with fans amid Saiyaara success. WatchActor Aneet Padda recently avoided paparazzi and selfies with fans. She preferred to stay low profile amid the success of her latest film, 'Saiyaara'. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-lhuan-dre-pretorius-odi-call-up-2760670-2025-07-24",
      "headline": "South Africa name squads for Australia tour, Pretorius earns ODI call-upAiden Markram and Temba Bavuma made their comebacks while Lhuan-dre Pretorius earned a maiden ODI call-up as Australia named their squads for the tour of Australia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-white-ball-series-england-2026-t20is-odis-schedule-ecb-2760663-2025-07-24",
      "headline": "India to tour England again in 2026 for white-ball series, schedule announcedIndia will tour England in July 2026 for an eight-match white-ball series including five T20Is and three ODIs. The summer also features England hosting Pakistan and Sri Lanka, plus the first-ever women's Test at Lord's, marking a historic cricket season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-dravid-pujara-ashwin-sai-sudharsan-knock-manchester-2760647-2025-07-24",
      "headline": "Solidity of Dravid and Pujara: Ashwin praises Sai Sudharsan's knock in ManchesterRavichandran Ashwin lauded Sai Sudharsan's composed knock of 61 in the fourth Test against England, even drawing comparisons between the youngster's temperament and technique to those of India's most dependable No. 3s - Rahul Dravid and Cheteshwar Pujara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-day-2-live-updates-score-manchester-weather-gill-stokes-2760632-2025-07-24",
      "headline": "4th Test Day 2 Live Score and Updates: Archer removes Jadeja earlyIndia (IND) vs England (ENG), 4th Test, Day 2 Live Score and Updates: Jofra Archer has got the early wicket of Ravindra Jadeja as England have got an early breakthrough. Washington Sundar has joined Shardul Thakur in the middle with the English bowlers looking dangerous. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-parthiv-patel-icc-rule-england-vs-india-2760612-2025-07-24",
      "headline": "Should Rishabh Pant be allowed a batting sub? Parthiv Patel weighsENG vs IND: Speaking to Rishabh Pant's toe injury, Parthiv Patel said that he's okay with the ICC's rule of like-for-like replacement of wicketkeepers where the incoming player won't be allowed to bat and will only be allowed to keep wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-barcelona-manchester-united-loan-gary-lineker-comment-2760608-2025-07-24",
      "headline": "Not everything goes as you thought: Rashford on United amid Barcelona moveMarcus Rashford accepted that Manchester United were going through changes and it did not include him in his plans. Despite this he did not badmouth the club whilst being unveiled as a new FC Barcelona player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-right-toe-fracture-likely-ruled-out-england-test-series-2760603-2025-07-24",
      "headline": "Rishabh Pant suffers right toe fracture, likely out of England seriesRishabh Pant is unlikely to take any further part in the Manchester Test and is expected to miss the remainder of the ongoing Test series against England after scans revealed a fracture in his right toe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-comeback-cricket-career-challenges-sonchiriya-england-india-test-2760558-2025-07-24",
      "headline": "Rishabh Pant: Cricket's resilient Sonchiriya dancing to destiny's musicLike the dacoits in Sonchiriya, Rishabh Pant walks a path shadowed by omens. But each time, he lifts the dead snake and keeps moving, saying 'mai ka naam le ke aage badho'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-indian-batters-sanjay-manjrekar-proud-manchester-test-2760561-2025-07-24",
      "headline": "Manjrekar backs India's batters: Can do it in typical English conditionsSanjay Manjrekar was particularly proud of the Indian batters for coming through the overcast conditions in the Manchester Test with flying colours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-stuart-broad-england-vs-india-manchester-test-2760555-2025-07-24",
      "headline": "Stuart Broad backs Rishabh Pant to bat with 'bruised foot' in ManchesterENG vs IND, 4th Test: Rishabh Pant suffered a foot injury on Day 1 of the fourth Test at the Old Trafford in Manchester after being struck by a yorker from Chris Woakes.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/zahaan-hemrajani-top-10-finish-u17-open-skiff-world-championships-india-sailing-success-2760535-2025-07-24",
      "headline": "Zahaan Hemrajani secures historic top 10 finish at U17 sailing worldsMumbai's Zahaan Hemrajani secured a top 10 overall finish at the prestigious U17 O'pen Skiff World Championships, held from July 17 to 23 in Nishinomiya, Japan. His result marks one of the highest-ever finishes by an Indian sailor at this global youth event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-right-toe-fracture-likely-ruled-out-england-test-series-2760603-2025-07-24",
      "headline": "Rishabh Pant suffers right toe fracture, likely out of England seriesRishabh Pant is unlikely to take any further part in the Manchester Test and is expected to miss the remainder of the ongoing Test series against England after scans revealed a fracture in his right toe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-comeback-cricket-career-challenges-sonchiriya-england-india-test-2760558-2025-07-24",
      "headline": "Rishabh Pant: Cricket's resilient Sonchiriya dancing to destiny's musicLike the dacoits in Sonchiriya, Rishabh Pant walks a path shadowed by omens. But each time, he lifts the dead snake and keeps moving, saying 'mai ka naam le ke aage badho'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-indian-batters-sanjay-manjrekar-proud-manchester-test-2760561-2025-07-24",
      "headline": "Manjrekar backs India's batters: Can do it in typical English conditionsSanjay Manjrekar was particularly proud of the Indian batters for coming through the overcast conditions in the Manchester Test with flying colours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-stuart-broad-england-vs-india-manchester-test-2760555-2025-07-24",
      "headline": "Stuart Broad backs Rishabh Pant to bat with 'bruised foot' in ManchesterENG vs IND, 4th Test: Rishabh Pant suffered a foot injury on Day 1 of the fourth Test at the Old Trafford in Manchester after being struck by a yorker from Chris Woakes.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/zahaan-hemrajani-top-10-finish-u17-open-skiff-world-championships-india-sailing-success-2760535-2025-07-24",
      "headline": "Zahaan Hemrajani secures historic top 10 finish at U17 sailing worldsMumbai's Zahaan Hemrajani secured a top 10 overall finish at the prestigious U17 O'pen Skiff World Championships, held from July 17 to 23 in Nishinomiya, Japan. His result marks one of the highest-ever finishes by an Indian sailor at this global youth event."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}