{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-benefit-drawbacks-key-sectors-raghuram-rajan-explained-2735448-2025-06-04",
      "headline": "Explained: How India can benefit from striking trade deal with USIndia's challenge goes beyond just sealing a US trade deal, it's about finding the right balance between opening up for growth and safeguarding its own industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/scoda-tubes-share-price-stock-market-debut-flat-listing-rs-140-bse-nse-2735441-2025-06-04",
      "headline": "Scoda Tubes lists flat at issue price amid strong IPO subscriptionScoda Tubes saw good interest during its initial public offering (IPO) phase, which ran from May 28 to May 30, 2025. The IPO was oversubscribed by 57.37 times, highlighting strong market demand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-us-student-visa-curbs-policy-india-opportunity-explained-2735417-2025-06-04",
      "headline": "Trump's student visa curbs opportunity for India, says Raghuram RajanRaghuram Rajan has called the US administration's actions \"unfortunate,\" particularly in how they undermine the long-standing academic and economic ties between the US and countries like India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-144-points-higher-nifty-above-24500-eternal-up-over-1-percent-2735414-2025-06-04",
      "headline": "Sensex opens 144 points higher, Nifty above 24,500; Eternal up over 1%The S&P BSE Sensex was up 89.35 points to 80,826.86, while the NSE Nifty50 added 29.35 points to 24,606 as of 9:32 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-russia-ties-brics-us-commerce-secretary-trump-modi-howard-lutnick-2735407-2025-06-04",
      "headline": "India's Russia ties, Brics push rubbed US the wrong way: Commerce Secretary LutnickSpeaking at an event in Washington, US Secretary of Commerce Howard Lutnick said that President Donald Trump deeply admires India and the two countries are going to have a great relationship together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nvidia-world-most-valuable-company-shares-rise-wall-street-overtakes-microsoft-google-2735405-2025-06-04",
      "headline": "Nvidia overtakes Microsoft to become world's most valuable companyThis is not the first time Nvidia has reached the top. The company had earlier taken the number one spot on 24 January this year but was later overtaken."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-today-markets-likely-to-open-higher-us-china-trade-talks-rbi-mpc-rate-cut-trading-setup-2735395-2025-06-04",
      "headline": "Stock market opening today: Sensex, Nifty likely to open higher. Here's whyGift Nifty futures were trading at 24,723, as of 8:06 am, suggesting a higher opening above Nifty's previous close of 24,542.50. The anticipation of a constructive dialogue between the U.S. and China"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-4-trading-tips-hdfc-bank-wipro-ola-electric-nestle-yes-bank-2735387-2025-06-04",
      "headline": "Stocks to watch on June 4: HDFC Bank, Wipro, Ola Electric, Nestle, Yes BankExplore the latest stock market movements with major stakes sold in Yes Bank, HDFC Bank's IPO plans, and strategic advancements by companies like Wipro and Ola Electric."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cartier-confirms-client-data-stolen-in-cyberattack-glbs-2735327-2025-06-04",
      "headline": "Cartier confirms client data stolen in cyberattackCartier confirmed a cyberattack in which client data was stolen, joining a growing list of major brands hit by breaches, including Victoria's Secret, Marks & Spencer, and The North Face."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-on-viksit-bharat-indian-economy-gdp-growth-2735251-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanCan India turn its economic momentum into lasting prosperity? As global risks loom and GDP rankings rise, Raghuram Rajan lays out what it will really take to become a developed nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-needs-8-9-growth-to-become-viksit-bharat-by-2047-raghuram-rajan-2735233-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanIn an exclusive interview with India Today TV's Consulting Editor Rajdeep Sardesai, former RBI Governor Raghuram Rajan discussed India's economic outlook in uncertain global times. He emphasised the need for 8-9% growth for India to become a developed nation by 2047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/oecd-cuts-global-growth-forecast-to-29-percent-in-2025-2026-trade-war-tariffs-impact-2735081-2025-06-03",
      "headline": "OECD cuts global growth forecast citing trade war risksThe OECD has reduced its global growth forecast to 2.9% for 2025 and 2026, attributing the slowdown to heightened trade tensions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dept-q-review-matthew-goode-cold-case-series-gripping-2735148-2025-06-04",
      "headline": "Department Q review: Matthew Goode shines in gripping slow-burn thrillerReleased-Thu May 29, 2025Dept Q review: Crime thriller 'Dept. Q' adapts Jussi Adler-Olsen's noir novels into a gripping series. The show delves into complex characters and slow-burning mysteries, promising an intense viewing experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-schools-paps-again-as-they-follow-her-to-car-watch-viral-video-as-she-says-chaliye-aap-bhi-2735436-2025-06-04",
      "headline": "Chaliye aap bhi: Jaya Bachchan schools paps again as they follow her to carVeteran actor Jaya Bachchan is often seen asking paparazzi to behave themselves. This time too, she sarcastically asked them to back-off as they followed her to her car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-common-man-appeal-everyday-characters-criminal-justice-season-4-2734955-2025-06-04",
      "headline": "Ordinary but unforgettable: Why Pankaj Tripathi's everyday characters stay with youActor Pankaj Tripathi, renowned for his impeccable acting, stands out from the crowd due to his common-man appeal, which adds a unique layer to his craft. Read to know more about his skills and how his acting has an everlasting impact.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-allu-ayaan-royal-challengers-bengaluru-win-ipl-win-2735410-2025-06-04",
      "headline": "No more Ee Saala Cup Lollipop: Allu Arjun's son's funny video after RCB's IPL winAllu Arjun's son, Allu Ayaan, was extremely emotional after Royal Challengers Bengaluru (RCB) won its first-ever IPL trophy. He poured water on his head, expressed his love for Virat Kohli and said he cannot say 'Ee Saala Cup Namde' any more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/15-years-of-vedam-when-telugu-cinema-dared-to-dream-differently-2734984-2025-06-04",
      "headline": "15 years on, Vedam remains Telugu cinema's unmatched masterpieceJune 4 marks 15 years of 'Vedam', a Telugu film that broke conventions with its layered storytelling, symbolic characters, and powerful music. Still fresh and unique, it remains a cinematic milestone that challenges the industry to aspire higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/allu-arjun-ranveer-singh-vijay-deverakonda-rashmika-mandanna-rcb-ipl-win-worth-the-wait-2735384-2025-06-04",
      "headline": "Worth the wait: Allu Arjun, Ranveer Singh, others celebrate RCB's maiden IPL winAllu Arjun, Ranveer Singh, Vicky Kaushal, Vijay Deverakonda, Rashmika Mandanna and several other celebrities congratulated Royal Challengers Bengaluru on their maiden IPL title win. This win ended their 18-year wait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-jumps-in-joy-rcb-big-ipl-2025-win-virat-kohli-2735369-2025-06-04",
      "headline": "Anushka Sharma's ecstatic celebration after RCB's maiden IPL win is pure joyActor Anushka Sharma couldn't control her excitement after Royal Challengers Bengaluru (RCB) ended up as the champions of IPL 2025. In a viral video, she could be seen jumping in joy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/love-island-usa-season-7-how-to-watch-stream-schedule-and-premiere-details-glbs-2735354-2025-06-04",
      "headline": "Love Island USA Season 7: How to watch, stream schedule, and premiere detailsLove Island USA Season 7 premieres June 3 on Peacock with new twists, ten fresh Islanders in Fiji, and real-time audience interaction through the app. Episodes also air on Bravo and Hulu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-gave-bag-of-cash-to-bury-hotel-assault-tape-ex-guard-tells-court-glbs-2735348-2025-06-04",
      "headline": "Diddy gave bag of cash to bury hotel assault tape, ex-guard tells courtA former hotel guard testified that Sean Combs paid $100,000 to suppress assault footage. The video, now key evidence in a federal case, supports multiple abuse allegations Combs denies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-are-labubu-dolls-tiktoks-viral-collectible-is-selling-out-fast-glbs-2735344-2025-06-04",
      "headline": "What are Labubu Dolls? TikTok's viral collectible is selling out fastLabubu dolls, creepy-cute collectibles from Pop Mart, have gone viral on TikTok due to celebrity influence, surprise unboxing, and high resale value — some fetching up to $7,000 online.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-taylor-swift-pregnant-internet-buzzes-over-baby-bump-photo-glbs-2735329-2025-06-04",
      "headline": "Is Taylor Swift pregnant? Internet buzzes over 'baby bump' photoA viral photo of Taylor Swift sparked speculation that she may be pregnant with Travis Kelce's child, though fans are divided and the couple has not publicly addressed the rumors.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-nigam-on-being-replaced-by-aaman-devgan-in-azaad-waited-an-entire-year-2735182-2025-06-03",
      "headline": "Siddharth Nigam on being replaced by Aaman Devgan in Azaad: Waited an entire yearActor Siddharth Nigam recently opened up on being replaced by Ajay Devgn's nephew Aaman Devgan in 'Azaad.' His mother recalled their shocking reaction after finding out Aaman was playing the lead in the period drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-supports-deepika-padukone-8-hour-workday-request-2735185-2025-06-03",
      "headline": "Pankaj Tripathi on long working hours amid Deepika-Sandeep Vanga's Spirit rowActor Pankaj Tripathi talked about fixed work hours in films, saying it's important to set limits. He believes saying \"no\" politely is necessary to maintain a healthy balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-invites-chandrababu-naidu-son-akhil-akkineni-zainab-ravdjee-wedding-2735159-2025-06-03",
      "headline": "Nagarjuna invites Chandrababu Naidu to son Akhil Akkineni-Zainab's weddingActor Nagarjuna met Andhra Pradesh Chief Minister N Chandrababu Naidu to invite him to his son Akhil Akkineni's wedding with Zainab Ravdjee on June 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/good-boy-cast-exclusive-park-bo-gum-kim-so-hyun-lee-sang-yi-on-bollywood-india-their-playlist-2735156-2025-06-03",
      "headline": "Good Boy Cast Exclusive: Park Bo Gum, Kim So Hyun, Lee Sang Yi on Bollywood, India, their playlistPark Bo Gum, Kim So Hyun, Lee Sang Yi, Heo Seong Tae and Tae Won Seo get real in this exclusive interview with Bhavna Agarwal on all things Good Boy—their action-packed K-drama that's already winning hearts, premiering on Prime Video in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imran-khan-ex-wife-avantika-malik-on-divorce-struggles-to-save-her-marriage-2735133-2025-06-03",
      "headline": "Avantika Malik on divorce with Imran Khan: Was the worst thing I had to go throughActor Imran Khan's ex-wife Avantika Malik recently spoke about their painful separation. The couple ended their eight-year marriage in 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-might-be-comedy-king-but-lets-discuss-when-he-was-villain-supreme-2735069-2025-06-03",
      "headline": "Paresh Rawal might be comedy king, but let's discuss when he was villain supremeBefore he became everyone's favourite Baburao Ganpatrao Apte, Paresh Rawal was one of Bollywood's most chilling and realistic villains. It's time to revisit his powerful negative roles that showed his true range long before he wore the crown of a comedy king. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-thiruvothu-criticises-kerala-cm-pinarayi-vijayan-over-hema-committee-inaction-wcc-member-bina-paul-agrees-2735138-2025-06-03",
      "headline": "Actor Parvathy slams Kerala government's inaction on Hema Committee's findingsActor Parvathy Thiruvothu criticised the Kerala government's delay in acting on the Hema Committee report, which was submitted over five years ago. She called out the lack of urgency, and pushed for overdue reforms in the Malayalam film industry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maalik-teaser-rajkummar-rao-as-gangster-unleashes-wrath-violent-thriller-2735022-2025-06-03",
      "headline": "Maalik teaser: Rajkummar Rao unleashes wrath on adversaries in violent thrillerThe teaser of Rajkummar Rao starrer 'Maalik' is out. The film debuts the actor in a dark, ruthless gangster avatar in the teaser. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-18-year-wait-worth-virat-kohli-victory-speech-2735358-2025-06-04",
      "headline": "Virat Kohli's stirring IPL victory speech was worth the 18-year waitAfter 18 long years, RCB finally lifted their maiden IPL trophy on Tuesday. Virat Kohli's stirring, emotional victory speech made the wait feel profoundly worth it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtuber-jasbir-singh-with-11-million-subscribers-arrested-in-punjab-for-spying-has-ties-to-jyoti-malhotra-2735439-2025-06-04",
      "headline": "Another YouTuber arrested in Punjab for 'spying', has links with Jyoti MalhotraYouTuber Jasbir Singh with 1.1 million subscribers arrested in Punjab for 'spying', has ties to Jyoti Malhotra"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/malaysia-snubs-pakistan-islamic-nations-call-to-block-indias-operation-sindoor-events-2735406-2025-06-04",
      "headline": "Malaysia snubs Pak's 'Islamic nations' call to block India's Op Sindoor eventsTrying to play the religion card, the Pakistani embassy urged Malaysian government officials to cancel all 10 programmes by the Sanjay Jha-led delegation, saying, 'We are an Islamic country, you are an Islamic country... don't listen to the Indian delegation.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/fbi-arrests-chinese-nationals-for-smuggling-crop-killing-pathogen-into-us-glbs-2735359-2025-06-04",
      "headline": "FBI arrests Chinese nationals for smuggling crop-killing pathogen into USTwo Chinese nationals were arrested for smuggling a dangerous crop fungus into the US, posing risks to food security and public health. They face multiple federal charges and possible deportation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/namde-to-namdu-virat-kohli-rcb-18-year-quest-turns-bengaluru-cheat-code-into-ipl-glory-2735416-2025-06-04",
      "headline": "Namde to Namdu: Virat's 18-year quest turns Bengaluru's cheat code into IPL gloryFrom a 90s kid in Bihar watching black-and-white TV to becoming a loyal RCB fan in his karmabhoomi Bengaluru, the journey mirrors the city's own underdog spirit and slow but steady rise. In 2025, after 18 years of heartbreak, Virat Kohli and RCB finally lifted the IPL trophy, changing not just a war-cry, but the emotional script of a generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-new-banknotes-mujibur-rahman-out-hindu-temple-kantajew-mondir-kantaji-dinajpur-targeted-by-islamists-2735045-2025-06-04",
      "headline": "Hindu temple targeted by Islamists to be on Bangladesh banknotesThe Muhammad Yunus-led interim government is on a drive to move Bangladesh away from the legacy and memory of Mujibur Rahman, its founding father. The image of a Hindu temple targeted by Islamic terrorists is among those replacing Mujib on the new banknotes. Here's more about the Kantajew temple of Dinajpur on whose premises a mosque was also coming up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-russia-ties-brics-us-commerce-secretary-trump-modi-howard-lutnick-2735407-2025-06-04",
      "headline": "India's Russia ties, Brics push rubbed US the wrong way: Commerce Secretary LutnickSpeaking at an event in Washington, US Secretary of Commerce Howard Lutnick said that President Donald Trump deeply admires India and the two countries are going to have a great relationship together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/kamal-haasan-kannada-row-rajya-sabha-seat-nomination-paper-filing-delayed-2735425-2025-06-04",
      "headline": "Kamal Haasan postpones Rajya Sabha nomination filing amid Kannada rowActor Kamal Haasan has postponed filing his Rajya Sabha nomination, reportedly until after the release of his film Thug Life. The delay comes amid the backlash over his controversial remarks about Kannada language's origins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-the-loyal-challenger-from-royal-challengers-bangalore-2735397-2025-06-04",
      "headline": "Virat Kohli, the Loyal Challenger from Royal Challengers BangaloreVirat Kohli's 18-year journey with RCB is a testament to unwavering loyalty, perseverance, and the transformation of raw potential into greatness. The long-awaited IPL triumph not only marked the end of RCB's title drought but also elevated him as a symbol of devotion, character, and the enduring bond between a player and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-signs-order-imposing-50-tariffs-for-steel-and-aluminum-spares-uk-glbs-2735347-2025-06-04",
      "headline": "Trump signs order hiking US steel, aluminium tariffs to 50% from today; UK sparedTrump signs executive order doubling tariffs on imported steel and aluminium to 50 per cent, citing national security risks and unfair pricing. The policy, effective June 4, aims to protect domestic industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/fight-erupts-between-mumbai-airport-security-staff-drivers-over-parking-watch-video-2735380-2025-06-04",
      "headline": "Video: Fists, belts fly as cabbies, Mumbai airport staff clash over parkingVisuals of a fight between the security staff and drivers at Mumbai International Airport over parking issues are doing rounds on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/i-just-cant-stand-it-anymore-elon-musk-explodes-over-trumps-budget-bill-glbs-2735324-2025-06-04",
      "headline": "Disgusting abomination: Elon Musk explodes over Trump's big, beautiful billElon Musk slammed Trump's massive tax-and-spending bill as a \"disgusting abomination,\" warning it will spike the deficit to $2.5 trillion and burden Americans with crushing, unsustainable debt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-common-man-appeal-everyday-characters-criminal-justice-season-4-2734955-2025-06-04",
      "headline": "Ordinary but unforgettable: Why Pankaj Tripathi's everyday characters stay with youActor Pankaj Tripathi, renowned for his impeccable acting, stands out from the crowd due to his common-man appeal, which adds a unique layer to his craft. Read to know more about his skills and how his acting has an everlasting impact.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-losses-4-day-conflict-with-india-6-fighter-jets-2-surveillance-planes-30-missiles-2735197-2025-06-03",
      "headline": "6 fighter jets, 2 surveillance planes: Pak's losses in 4-day conflict with IndiaSources told India Today that technical analysis of operational data confirms that six fighter aircraft belonging to the Pakistan Air Force were shot down during the air battles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-bengal-2021-post-poll-violence-case-dastardly-offence-roots-democracy-bjp-tmc-refused-fir-family-leave-village-2735402-2025-06-04",
      "headline": "Cop refused FIR, told family to leave village: Court on Bengal post-poll violenceThe Supreme Court recently slammed the Bengal Police in a case linked to the 2021 post-poll violence wherein a BJP supporter's house was vandalised, and his wife was sexually assaulted, saying the officer in-charge refused to register an FIR and asked the family to leave the village instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/allu-arjun-ranveer-singh-vijay-deverakonda-rashmika-mandanna-rcb-ipl-win-worth-the-wait-2735384-2025-06-04",
      "headline": "Worth the wait: Allu Arjun, Ranveer Singh, others celebrate RCB's maiden IPL winAllu Arjun, Ranveer Singh, Vicky Kaushal, Vijay Deverakonda, Rashmika Mandanna and several other celebrities congratulated Royal Challengers Bengaluru on their maiden IPL title win. This win ended their 18-year wait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/jewellery-for-your-shoes-sunglasses-jeans-and-basically-everything-2735178-2025-06-04",
      "headline": "Jewellery for your shoes, sunglasses, jeans – and basically, everythingFrom sunglasses to shoes and watches, nearly every accessory has its own accessory now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mystery-beast-kills-6-in-madhya-pradesh-village-limbai-barwani-forest-officials-under-fire-2735398-2025-06-04",
      "headline": "Mystery beast kills 6 in Madhya Pradesh village; forest officials under fireThe string of deaths in Barwani district's Limbai village has deepened the mystery around the nature of the attacker. Neither the local villagers nor the forest department have been able to identify the animal responsible. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-jibe-india-pakistan-ceasefire-bjp-rss-pm-modi-surrendered-trump-call-2735175-2025-06-03",
      "headline": "Rahul Gandhi's 'Narender surrender' dig at PM over Trump's claim, BJP hits backRahul Gandhi accused the BJP and RSS of bowing under pressure and contrasted their response with Congress leaders of the past. Reacting to his remarks, the BJP called him uncivilised and said Indians look at him as \"an agent of Pakistan\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-celebrations-rcb-lifts-title-ee-sala-cup-namde-fireworks-red-2735339-2025-06-04",
      "headline": "Ee Sala Cup Namdu: Bengaluru celebrates like never before after RCB wins IPL 2025The moment RCB sealed their maiden IPL title, Bengaluru celebrated like never before. Fans flooded the streets in every direction, lit fireworks, and filled the night with chants of 'Ee Sala Cup Namdu!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/exclusive-indian-astronaut-shubhanshu-shukla-speak-to-pm-modi-2735211-2025-06-03",
      "headline": "Will Shubhanshu Shukla speak to PM Modi from space?  Indian astronaut answersIndian Astronaut Shubhanshu Shukla, set to launch on June 10, will become only the second Indian to travel to space after Rakesh Sharma and the first to visit the ISS. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-classroom-construction-scam-manish-sisodia-satyendar-jain-aam-aadmi-party-anti-corruption-bureau-summon-fir-2735365-2025-06-04",
      "headline": "Manish Sisodia, Satyendar Jain summoned in classroom construction scamThe anti-corruption bureau has summoned AAP leaders and ex-Delhi ministers Satyendar Jain and Manish Sisodia on June 6 and 9, respectively, in the Rs 2,000-crore classroom construction scam less than two months after an FIR was registered against them in the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-is-sana-yousaf-pakistan-teen-influencer-17-shot-dead-islamabad-honour-killing-2735135-2025-06-03",
      "headline": "Who is Sana Yousaf? The 17-year-old Pakistani influencer shot dead in IslamabadPakistani influencer Sana Yousaf, 17, was shot dead at her Islamabad home on Monday evening. Read on to know more about her. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-4-wednesday-pm-modi-operation-sindoor-kamal-haasan-kannada-row-rahul-gandhi-haryana-visit-bihar-polls-maharashtra-monsoon-rain-updates-2735373-2025-06-04",
      "headline": "News Menu, June 4: Op Sindoor delegation to meet PM; Rahul Gandhi in Haryana todayIndia Today's Wednesday news menu serves up a fiery mix of Kamal Haasan upping the ante after being pulled up by the Karnataka High Court over his Kannada remarks, Rahul Gandhi's visit to Haryana in a bid to revamp Congress, the Operation Sindoor delegation led by Shrikant Shinde set to meet PM Modi, and more."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-victory-parade-rcb-vs-pbks-full-schedule-2735442-2025-06-04",
      "headline": "RCB victory parade after IPL 2025 win: Full scheduleIPL 2025, RCB vs PBKS: Here's the full schedule of Royal Challengers Bengaluru's victory celebration after they won their maiden Indian Premier League title on Tuesday with a six-run win over Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rcb-vs-pbks-emotional-2735421-2025-06-04",
      "headline": "A season I'll never forget: Virat Kohli pens emotional note after RCB's winIPL 2025, RCB vs PBKS: Virat Kohli had a special message for his fans after the Royal Challengers Bengaluru won the title for the maiden time with a six-run win over Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-shreyas-iyer-ricky-ponting-priyansh-arya-prabhsimran-singh-2735408-2025-06-04",
      "headline": "Project Punjab isn't a failure, but it needs a few tweaks after IPL 2025 heartbreakPunjab Kings faced heartbreak in the IPL 2025 Final, but 'Project Punjab' is off to a great start. The Kings will have to maintain consistency and they should  make a few tweaks ahead of next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-names-rcbs-best-performance-in-ipl-2025-2735403-2025-06-04",
      "headline": "Sunil Gavaskar names RCB's best performance in IPL 2025Legendary India batter Sunil Gavaskar picked his best performance of the Royal Challengers Bengaluru (RCB) in the Indian Premier League 2025 (IPL 2025) after they finally ended their 18-year-long trophy drought. RCB beat PBKS by six runs in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ee-sala-cup-namde-was-like-a-jinx-staying-quiet-worked-for-rcb-sunil-gavaskar-2735396-2025-06-04",
      "headline": "'Ee Sala Cup Namde' felt like a jinx, staying quiet worked for RCB: Sunil GavaskarLegendary India cricketer Sunil Gavaskar said toning down 'Ee Sala Cup Namde' slogan helped Royal Challengers Bengaluru (RCB) massively as it helped them break the jinx and lift the title after 18 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-the-loyal-challenger-from-royal-challengers-bangalore-2735397-2025-06-04",
      "headline": "Virat Kohli, the Loyal Challenger from Royal Challengers BangaloreVirat Kohli's 18-year journey with RCB is a testament to unwavering loyalty, perseverance, and the transformation of raw potential into greatness. The long-awaited IPL triumph not only marked the end of RCB's title drought but also elevated him as a symbol of devotion, character, and the enduring bond between a player and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-ipl-2025-final-rajeev-shukla-interview-2735394-2025-06-04",
      "headline": "Knew RCB would win IPL, but didn't think it would take this long: Rajeev ShuklaIPL 2025 Final, RCB vs PBKS: In an interview with India Today, Rajeev Shukla said that he didn't believe that Royal Challengers Bengaluru would take 18 seasons to win their maiden Indian Premier League trophy. On Tuesday, RCB beat PBKS by six runs at the Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rajeev-shukla-interview-2735391-2025-06-04",
      "headline": "Virat Kohli isn't right for an IPL team, people said: Rajeev Shukla slams criticsIPL 2025, RCB vs PBKS: In an interview with India Today, Rajeev Shukla praised Virat Kohli as the latter won his maiden title after waiting for 18 long seasons. On Tuesday, Bengaluru beat Punjab by six runs at the Narendra Modi Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-rcb-vs-pbks-final-2735375-2025-06-04",
      "headline": "Krunal Pandya: Mumbai's main man once, RCB's IPL final hero nowIPL 2025 Final, RCB vs PBKS: Krunal Pandya's stupendous spell of 4-0-17-2 helped Royal Challengers Bengaluru win their maiden Indian Premier League title after beating Punjab Kings by six runs on Tuesday at the Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-ravi-shastri-final-rcb-vs-pbks-2735370-2025-06-04",
      "headline": "Watch: Kohli leaps into Shastri's arms in pure joy as long IPL wait endsIPL 2025: Virat Kohli ran and leapt into Ravi Shastri's arms in joy after the Royal Challengers Bengaluru (RCB) won the title for the first time in 18 years on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-victory-parade-in-bengaluru-when-and-where-to-watch-2735366-2025-06-04",
      "headline": "RCB IPL 2025 victory parade: When and where to watch celebrations in Bengaluru?Royal Challengers Bengaluru (RCB) have announced a victory parade for their fans following their team's maiden IPL title after beating Punjab Kings (PBKS) by six runs in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-ipl-2025-final-rajeev-shukla-interview-2735394-2025-06-04",
      "headline": "Knew RCB would win IPL, but didn't think it would take this long: Rajeev ShuklaIPL 2025 Final, RCB vs PBKS: In an interview with India Today, Rajeev Shukla said that he didn't believe that Royal Challengers Bengaluru would take 18 seasons to win their maiden Indian Premier League trophy. On Tuesday, RCB beat PBKS by six runs at the Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rajeev-shukla-interview-2735391-2025-06-04",
      "headline": "Virat Kohli isn't right for an IPL team, people said: Rajeev Shukla slams criticsIPL 2025, RCB vs PBKS: In an interview with India Today, Rajeev Shukla praised Virat Kohli as the latter won his maiden title after waiting for 18 long seasons. On Tuesday, Bengaluru beat Punjab by six runs at the Narendra Modi Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-rcb-vs-pbks-final-2735375-2025-06-04",
      "headline": "Krunal Pandya: Mumbai's main man once, RCB's IPL final hero nowIPL 2025 Final, RCB vs PBKS: Krunal Pandya's stupendous spell of 4-0-17-2 helped Royal Challengers Bengaluru win their maiden Indian Premier League title after beating Punjab Kings by six runs on Tuesday at the Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-ravi-shastri-final-rcb-vs-pbks-2735370-2025-06-04",
      "headline": "Watch: Kohli leaps into Shastri's arms in pure joy as long IPL wait endsIPL 2025: Virat Kohli ran and leapt into Ravi Shastri's arms in joy after the Royal Challengers Bengaluru (RCB) won the title for the first time in 18 years on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-victory-parade-in-bengaluru-when-and-where-to-watch-2735366-2025-06-04",
      "headline": "RCB IPL 2025 victory parade: When and where to watch celebrations in Bengaluru?Royal Challengers Bengaluru (RCB) have announced a victory parade for their fans following their team's maiden IPL title after beating Punjab Kings (PBKS) by six runs in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-virat-kohli-compares-ipl-2025-win-with-test-cricket-2735362-2025-06-04",
      "headline": "IPL win among my best, but five rungs below Test cricket: Virat KohliIndia and Royal Challengers Bengaluru (RCB) star Virat Kohli compared his historic Indian Premier League 2025 (IPL 2025) triumph with Test cricket and ranked it five levels below the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-18-year-wait-worth-virat-kohli-victory-speech-2735358-2025-06-04",
      "headline": "Virat Kohli's stirring IPL victory speech was worth the 18-year waitAfter 18 long years, RCB finally lifted their maiden IPL trophy on Tuesday. Virat Kohli's stirring, emotional victory speech made the wait feel profoundly worth it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735337-2025-06-04",
      "headline": "Virat Kohli's message to RCB captain Rajat Patidar: IPL win is as big for othersVirat Kohli had a special message for Rajat Patidar and the RCB squad as they ended their IPL jinx and won the title on Tuesday, June 3. Kohli and Patidar were able to mastermind RCB's first title win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-celebrations-rcb-lifts-title-ee-sala-cup-namde-fireworks-red-2735339-2025-06-04",
      "headline": "Ee Sala Cup Namdu: Bengaluru celebrates like never before after RCB wins IPL 2025The moment RCB sealed their maiden IPL title, Bengaluru celebrated like never before. Fans flooded the streets in every direction, lit fireworks, and filled the night with chants of 'Ee Sala Cup Namdu!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-bengaluru-victory-parade-celebrations-virat-kohli-date-2735336-2025-06-04",
      "headline": "Virat Kohli promises special RCB victory parade in Bengaluru on June 4IPL 2025 final: Virat Kohli said RCB players and members of the support staff will celebrate the Indian Premier League victory with fans in Bengaluru on Wednesday evening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-carlos-alcaraz-beats-tommy-paul-reach-semifinal-2735335-2025-06-04",
      "headline": "Merciless Carlos Alcaraz makes easy work of Tommy Paul to reach semisCarlos Alcaraz showed no mercy on Tuesday evening as he produced a clinical, commanding performance to dismantle American Tommy Paul 6-0, 6-1, 6-4 and reach the semi-finals of the French Open.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-odi-series-sweep-west-indies-jamie-smith-maiden-fifty-oval-2735332-2025-06-04",
      "headline": "England crush West Indies to complete 3-0 ODI series win England completed a 3-0 sweep of West Indies in their one-day international series with opener Jamie Smith's rapid half-century paving the way for a convincing seven-wicket victory at the Oval on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/krunal-pandya-reaction-rcb-ipl-2025-title-win-two-man-of-the-match-2735325-2025-06-04",
      "headline": "Told Hardik that Pandya household would have 9 trophies: KrunalAfter becoming the first player to win two Player of the Match awards in IPL finals, RCB star Krunal Pandya revealed that he had told his brother Hardik that the Pandya household would boast nine trophies in 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-bengaluru-victory-parade-celebrations-virat-kohli-date-2735336-2025-06-04",
      "headline": "Virat Kohli promises special RCB victory parade in Bengaluru on June 4IPL 2025 final: Virat Kohli said RCB players and members of the support staff will celebrate the Indian Premier League victory with fans in Bengaluru on Wednesday evening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-carlos-alcaraz-beats-tommy-paul-reach-semifinal-2735335-2025-06-04",
      "headline": "Merciless Carlos Alcaraz makes easy work of Tommy Paul to reach semisCarlos Alcaraz showed no mercy on Tuesday evening as he produced a clinical, commanding performance to dismantle American Tommy Paul 6-0, 6-1, 6-4 and reach the semi-finals of the French Open.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-odi-series-sweep-west-indies-jamie-smith-maiden-fifty-oval-2735332-2025-06-04",
      "headline": "England crush West Indies to complete 3-0 ODI series win England completed a 3-0 sweep of West Indies in their one-day international series with opener Jamie Smith's rapid half-century paving the way for a convincing seven-wicket victory at the Oval on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/krunal-pandya-reaction-rcb-ipl-2025-title-win-two-man-of-the-match-2735325-2025-06-04",
      "headline": "Told Hardik that Pandya household would have 9 trophies: KrunalAfter becoming the first player to win two Player of the Match awards in IPL finals, RCB star Krunal Pandya revealed that he had told his brother Hardik that the Pandya household would boast nine trophies in 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735328-2025-06-04",
      "headline": "Virat Kohli deserved IPL trophy more than anyone else: RCB captain Rajat PatidarRajat Patidar said that Virat Kohli deserved to win the IPL trophy as RCB defeated PBKS to end their 18-year wait. Patidar said it was a great opportunity for him to captain Kohli and learn as a captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-reaction-punjab-kings-lose-final-rcb-win-ipl-2025-2735321-2025-06-04",
      "headline": "Shreyas Iyer dejected after final heartbreak vs RCB, vows to win IPL next yearPunjab Kings captain Shreyas Iyer was dejected after the narrow final defeat to RCB but said the job was only half done, adding that he and his team would come back stronger in pursuit of the title next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-full-list-of-award-winners-ahmedabad-2735322-2025-06-04",
      "headline": "IPL 2025: Full list of award winners for the seasonThe IPL 2025 season has come to an end with RCB winning their first title with a final win over PBKS on Tuesday, June 3. Here's a look at all the award winners from the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-celebration-anushka-sharma-bengaluru-girl-2735318-2025-06-04",
      "headline": "Anushka Sharma is a Bengaluru girl, RCB winning IPL means so much: Virat KohliIPL 2025 final: Filled with emotions, Virat Kohli thanked wife Anushka Sharma after RCB won their first IPL title in 18 years. Kohli reflected on the unwavering support from Anushka through his highs and lows over the years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/fireworks-in-bengaluru-as-rcb-kohli-bags-ipl-ee-sala-cup-namdu-2735317-2025-06-04",
      "headline": "Fireworks in Bengaluru as King Kohli bags IPL: Ee sala cup NamduViral videos showed fireworks lighting up the night skies as Royal Challengers Bengaluru (RCB) fans flooded the streets in celebration after their team finally lifted the IPL 2025 trophy—ending an 18-year wait for their maiden title. RCB clinched a thrilling six-run victory over Punjab Kings in the final at the Narendra Modi Stadium on Tuesday, June 3. Virat Kohli was joined in the celebrations by AB de Villiers and Chris Gayle, as the iconic chant \"Ee Sala Cup Namde\" was joyfully transformed into \"Ee Sala Cup Namdu.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-virat-kohli-hugs-anushka-sharma-ab-de-villiers-maiden-title-2735309-2025-06-04",
      "headline": "Watch: Virat Kohli hugs Anushka, AB de Villiers after RCB's IPL 2025 triumphAfter 18 years of heartbreaks and near misses, Royal Challengers Bengaluru finally clinched their maiden IPL title, as emotions ran high with Virat Kohli embracing Anushka Sharma and AB de Villiers in unforgettable celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-title-win-ahmedabad-2735306-2025-06-03",
      "headline": "Ee sala cup namdu: Fans rejoice as Virat Kohli, RCB finally win IPL titleRCB fans and Virat Kohli can finally say 'Ee salad cup namdu' as they won the IPL 2025 title in Ahmedabad on Tuesday, June 3. RCB defeated PBKS by 6 runs at the Narendra Modi stadium on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-winning-reaction-bengaluru-heart-2735303-2025-06-03",
      "headline": "Virat Kohli on winning IPL after 18 years: Gave it my youth, prime and experienceIPL 2025 Final: Despite being overcome with emotion after ending an 18-year wait for the title, Virat Kohli spoke with remarkable clarity. He reiterated his commitment to Royal Challengers Bengaluru, vowing to represent the franchise until the end of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-18-year-wait-punjab-kings-2735295-2025-06-03",
      "headline": "RCB crowned IPL champions, 18-year-long wait for Virat Kohli, Bengaluru endsIPL 2025 Final: The 18-year wait finally ended on Tuesday in Ahmedabad. For Virat Kohli and RCB, it was a moment of redemption, relief, and ecstasy. For Punjab Kings, who had exceeded expectations throughout the season, the final brought yet another heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/emotional-virat-kohli-in-tears-after-rcbs-18-year-old-wait-for-ipl-title-ends-2735298-2025-06-03",
      "headline": "Virat Kohli in tears after RCB's 18-year-old wait for IPL title endsVirat Kohli was overcome with emotion as Royal Challengers Bengaluru finally ended their 18-year wait for an IPL title, bringing the curtains down on one of the league's most enduring heartbreak stories. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-shreyas-iyer-fails-virat-kohli-celebration-2735288-2025-06-03",
      "headline": "Shreyas Iyer fails in IPL 2025 final, Virat Kohli erupts in ecstatic celebrationIPL 2025, PBKS vs RCB: Virat Kohli was thrilled to bits when Romario Shepherd got the big wicket of Shreyas Iyer to dent Punjab's chase of 191 in the big final. Shreyas chose the wrong time to falter with the bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-10-results-lorenzo-musetti-frances-tiafoe-roland-garros-2735279-2025-06-03",
      "headline": "Lorenzo Musetti continues fine clay season with maiden French Open semi-finalLorenzo Musetti continued his fine season on clay as he overcame Frances Tiafoe in four sets to make it to his first French Open semi-final. Musetti also climbed up the ATP live rankings with the win. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}