{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-korean-md-speech-hong-ju-jeon-bumper-listing-50-percent-premium-market-debut-hold-or-sell-2803276-2025-10-15",
      "headline": "LG Electronics IPO rocks NSE, and so does LG's Korean MD with his speechLG Electronics India's Korean Managing Director, Hong Ju Jeon, won hearts across India when he addressed the audience entirely in Hindi at the company's listing ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-eases-withdrawal-rules-but-there-is-a-catch-details-here-100-percent-pf-withdrawal-2803041-2025-10-15",
      "headline": "EPFO eases withdrawal rules, but there is a catch. Details HereThe EPFO has made a big change by allowing members to withdraw their entire provident fund balance. Still, the revised rules include a major catch that not everyone may find favourable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunjay-kapur-will-dispute-gambling-allegations-validity-concerns-2803053-2025-10-14",
      "headline": "No proof Sunjay Kapur drafted will: Karisma Kapoor's kids call Priya acute gamblerIn the ongoing Sunjay Kapur property dispute, senior advocate Mahesh Jethmalani, representing actor Karisma Kapoor's children, slammed the late industralist's widow, Priya Kapur, calling her an \"acute gambler\" and saying there was no proof whether Sunjay Kapur had actually drafted the will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/best-sectors-stock-market-investment-long-term-portfolio-ev-logistics-power-equipment-auto-2802991-2025-10-14",
      "headline": "Diwali 2025: Expert lists best sectors to light up your long-term portfolioOnce seen as a risky bet for the daring few, it's now finding a place right beside traditional investments. From young professionals buying their first mutual fund to families creating demat accounts, the shift is real and growing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-297-points-lower-nifty-below-25200-dr-reddys-falls-over-2-2802947-2025-10-14",
      "headline": "Sensex, Nifty end lower amid profit booking; LG Electronics listing lights up D-StreetThe S&P BSE Sensex slipped 297.07 points to close at 82,029.98, while the NSE Nifty50 dropped 81.85 points to settle at 25,145.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-chief-kristalina-georgieva-india-praise-proving-doubters-wrong-economic-reforms-2802924-2025-10-14",
      "headline": "India proving doubters wrong with its economic reforms: IMF chiefSpeaking ahead of the IMF-World Bank annual meetings in Washington, Georgieva said India's strong economic policies and reforms have helped it stand out as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-stocks-why-you-should-track-gold-and-silver-rally-this-diwali-2802910-2025-10-14",
      "headline": "Forget stocks, why should you track gold and silver rally this DiwaliWith markets showing uncertainty, should investors consider precious metals over stocks this festive season? Experts explain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-ipo-sees-bumper-listing-why-you-shouldnt-sell-entire-stake-today-2802905-2025-10-14",
      "headline": "LG Electronics IPO sees bumper listing. Why you shouldn't sell entire stake todayLG Electronics IPO surged over 50% on listing, but should investors sell everything today or hold for bigger gains?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-finance-is-not-foolproof-cautions-zerodha-founder-ceo-nithin-kamath-2802838-2025-10-14",
      "headline": "Digital finance isn't foolproof, cautions Zerodha's Nithin KamathFrom Aadhaar e-Sign to mobile apps, digital finance has transformed access to financial services in India. However, Nithin Kamath points out that system failures and delays still pose challenges for users."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bira-91-beer-disappeared-wine-shops-bars-legal-name-change-leadership-change-failure-transparency-salary-delay-2802466-2025-10-14",
      "headline": "Bira 91 went poof! And the name change was just the beer headWhile several news reports said that a change in the name of Indian beer Bira 91 spelt doom for the craft beer brand, it was just the tip of the iceberg. The company is facing a Rs 80-crore loss, supply-chain disruption, and most importantly, internal unrest, with employees demanding the ouster of founder Ankur Jain. This is what industry insiders have to say about the mess at Bira 91."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-allows-100-percent-pf-withdrawal-7-major-changes-you-should-know-2802786-2025-10-14",
      "headline": "EPFO now allows 100% PF withdrawal. 7 major changes you should knowMembers of EPFO can now breathe a sigh of relief as the organisation allows full withdrawal of PF balances. Here's a look at seven important changes that will affect how you access your funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-india-ipo-listing-share-price-hold-sell-2802777-2025-10-14",
      "headline": "LG Electronics IPO makes bumper debut. Should you hold or sell?With the stock listing at a sharp premium, booking partial profits allows investors to secure immediate gains, while retaining a portion of shares could help benefit from the company's long-term growth trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-crash-price-down-40-percent-why-reason-demerger-passenger-pv-cv-businesses-2802761-2025-10-14",
      "headline": "Tata Motors shares crash 40%: Is the Tata stock really down?Tata Motors shares opened at Rs 399 on Tuesday, down around 39.62% from Monday's close of Rs 660.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-india-makes-bumper-stock-market-debut-lists-at-50-over-ipo-price-2802746-2025-10-14",
      "headline": "LG Electronics lights up Dalal Street with 50% listing gain on market debutLG Electronics stock market listing: The strong opening reflected robust investor demand and optimism about the company's growth prospects in India's consumer electronics market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-200-points-nifty-above-25300-hcltech-shares-up-2-percent-2802727-2025-10-14",
      "headline": "Sensex jumps over 200 points, Nifty above 25,300; HCLTech up 2%The S&P BSE Sensex added 205.08 points to 82,532.13, while the NSE Nifty50 gained 60.60 points to 25,287.95 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-listing-today-latest-gmp-over-rs-400-how-much-investors-can-gain-market-debut-2802698-2025-10-14",
      "headline": "LG Electronics listing today: Investors eye big gains as GMP crosses Rs 400LG Electronics IPO opened for subscription on October 7 and closed on October 9. The price band for the issue was set between Rs 1,080 and Rs 1,140 per share."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-insurance-star-health-ombudsman-irdai-manipal-hospital-mudit-agarwal-poonam-singhal-2802351-2025-10-14",
      "headline": "Every claim is a fight: Inside a family's months-long health insurance battleIn India, buying health insurance is easy, but claiming it is another battle. Families like Mudit Agarwal's often end up fighting bureaucracy instead of focusing on illness. In this week's story from our ongoing 'Claim Denied' series, we reveal how one family's ordeal exposes the cracks in the system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-share-price-market-debut-gmp-above-rs-400-bumper-opening-nse-bse-listing-gains-2802672-2025-10-14",
      "headline": "LG Electronics share listing today: Will it make bumper debut on stock market?LG Electronics IPO is one of the most talked-about offerings of 2025, attracting bids worth over Rs 4.4 lakh crore against the Rs 11,607 crore issue size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-businessman-vijay-mallya-discontinues-bankruptcy-annulment-application-in-uk-ahead-of-his-hearing-2802568-2025-10-13",
      "headline": "Vijay Mallya discontinues bankruptcy annulment application in UK ahead of hearingThis means the \"Trustee in Bankruptcy\" can continue to pursue assets to help a consortium of banks led by the State Bank of India (SBI) realise the repayment of an estimated judgment debt of around 1.05 billion pounds owed by Vijay Mallya's now-defunct Kingfisher Airlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-shopping-on-credit-cards-here-how-no-cost-emi-flash-sale-offers-can-backfire-2802457-2025-10-13",
      "headline": "Diwali shopping on credit cards? Here's how offers can backfireFestive sales and flashy credit card deals may look irresistible, but hidden charges, interest traps and repayment delays can turn Diwali shopping into a debt headache."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-justin-trudeau-rumours-relationship-speculation-london-concert-comments-2803263-2025-10-15",
      "headline": "Katy Perry's viral response to fan proposal fuels Justin Trudeau romance talk Katy Perry's recent remarks at a London concert and viral photos with Justin Trudeau have stirred speculation about her relationship status. The singer gave a cheeky response to a fan who proposed to her with a sign mid-concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhruv-vikram-bison-kaalamaadan-diwali-release-breakthrough-tamil-cinema-2802982-2025-10-15",
      "headline": "How Dhruv Vikram's Bison could turn out to be what Sethu was for his dad Vikram Dhruv Vikram prepares to make his mark with the intense film 'Bison: Kaalamaadan' releasing this Diwali. The film could be his breakthrough, and help him step out of his father Vikram's shadow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dangelo-dies-aged-51-pancreatic-cancer-grammy-winning-rb-soul-singer-2803258-2025-10-15",
      "headline": "Grammy-winning R&B icon D'Angelo dies at 51 after battle with cancer Grammy-winning R&B and soul singer D'Angelo, known for his soulful music and memorable collaborations, has died at 51 after battling pancreatic cancer. His family mourns the loss while celebrating the enduring legacy of his extraordinary musical contributions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-showstopper-vikram-phadnis-vintage-india-fashion-celebration-2803252-2025-10-15",
      "headline": "Salman Khan brings royal charm to designer Vikram Phadnis' 35-year fashion gala Salman Khan made a rare and regal appearance on the ramp for Vikram Phadnis' 35th anniversary fashion show in Mumbai. The star-studded event celebrated 'Vintage India'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-episode-52-gaurav-khanna-amaal-mallik-clash-over-nominations-ration-task-sparks-chaos-2803216-2025-10-14",
      "headline": "Bigg Boss episode 52: Gaurav–Amaal clash over nominations, ration task sparks chaos In the latest 'Bigg Boss' episode, Gaurav and Amaal's nomination clash set off a chain of heated arguments and shifting alliances in the house. The BB Ration Task added to the chaos as Malti's mistake led to penalties and fresh disputes among contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-da-bangg-the-tour-reloaded-set-to-rock-qatar-this-november-2803147-2025-10-14",
      "headline": "Salman Khan's Da-Bangg: The Tour Reloaded set to rock Qatar this November Salman Khan will bring his mega stage show 'Da-Bangg: The Tour Reloaded' to Doha on November 14, 2025, at the Asian Town Amphitheatre. Featuring stars like Sonakshi Sinha, Jacqueline Fernandez, and Prabhu Deva, the event promises a night of music, dance, and Bollywood glamour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/de-de-pyaar-de-2-trailer-ajay-devgn-rom-com-sequel-picks-up-where-first-film-left-off-2803126-2025-10-14",
      "headline": "De De Pyaar De 2 trailer: Ajay Devgn's rom-com sequel picks up where first film left off Ajay Devgn's romantic comedy sequel 'De De Pyaar De 2' trailer is out, continuing the story of Aashish and his younger girlfriend Ayesha as they navigate family dynamics. The film reunites Devgn and Rakul Preet Singh, with new cast additions including Meezaan Jafri and Ishita Dutta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-a-show-like-search-the-naina-murder-case-teaches-parents-about-teen-girls-2803102-2025-10-14",
      "headline": "What a show like Search: The Naina Murder Case teaches parents about teen girls Many new Indian shows such as 'Search: The Naina Murder Case' are shining a light on teenage life, by portraying real struggles around identity, sexuality, and social media, and giving parents the tools to engage in meaningful conversations with their daughters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kylie-jenner-music-debut-terror-jr-fourth-strike-king-kylie-collection-relaunch-2803088-2025-10-14",
      "headline": "Kylie Jenner makes music debut, revives King Kylie collection in new campaign Social media star Kylie Jenner features as a vocalist on Terror Jr's new single 'Fourth Strike'.  Jenner relaunches Kylie Cosmetics' classic products under the 'King Kylie' brand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kunal-kohli-thinks-viral-kbc-5th-grader-is-irritating-says-he-needs-a-lesson-2803084-2025-10-14",
      "headline": "Kunal Kohli thinks viral KBC 5th grader is irritating, says he needs a lesson Filmmaker Kunal Kohli offers a sharp take on viral KBC contestant Ishaan Bhatt, reflecting on confidence, arrogance, and the need for basic etiquette."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/classics-redux-how-alt-version-films-and-shows-are-reimagining-literary-works-2803013-2025-10-14",
      "headline": "Classics redux: How alt-version films and shows are reimagining literary works The new wave of alt-adaptations shows the past isn't just history; it's open-source content. By remixing timeless tales to confront modern identity, grief, and AI anxiety, filmmakers prove that Gen Z is actively rewriting the canon for the screen. IndiaToday.in shares insights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-draft-contract-it-ends-with-us-1-7-million-salary-bonuses-2803065-2025-10-14",
      "headline": "Blake Lively's It Ends With Us payday was  $1.75 million: Report Actor Blake Lively reportedly was offered a contract with significant compensation and bonuses for 'It Ends With Us'. Proposed agreement included extensive travel, family, and staff provisions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/inside-photos-of-kyunki-kahaanii-reunion-go-viral-fans-celebrate-tulsi-parvati-2803061-2025-10-14",
      "headline": "Inside photos of Kyunki-Kahaanii reunion go viral, fans celebrate Tulsi-Parvati Sakshi Tanwar and Kiran Karmarkar reprised their roles as Parvati and Om for a special appearance in 'Kyunki Saas Bhi Kabhi Bahu Thi 2'. The reunion of Tulsi and Parvati sparked strong reactions from audiences on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-maggie-kang-rejects-live-action-adaptation-2803032-2025-10-14",
      "headline": "K-Pop Demon Hunters team rejects live-action plans as film breaks records KPop Demon Hunters' creators rule out a live-action version. Maggie Kang and Chris Appelhans cite animation's unique qualities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-thanks-manish-malhotra-for-family-like-diwali-bash-shares-pics-2803031-2025-10-14",
      "headline": "Fatima Sana Shaikh thanks Manish Malhotra for family-like Diwali bash, shares pics Fatima Sana Shaikh shared unseen photos from Manish Malhotra's Diwali party, thanking the designer for his warmth and describing the celebration as \"family-like.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jung-sung-il-divorce-amicable-separation-co-parenting-2802989-2025-10-14",
      "headline": "Jung Sung Il and wife divorce after nine years, remain devoted co-parents South Korean Jung Sung Il and his wife have mutually agreed to end their nine-year marriage. The separation was reached amicably and both intend to co-parent their son."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/dmk-ally-seeks-big-boss-ban-tamil-nadu-cultural-protest-2802988-2025-10-14",
      "headline": "DMK ally seeks ban on Big Boss in Tamil Nadu, warns of major protest DMK ally Thamizhaga Vazhvurimai Katchi calls for Big Boss ban in Tamil Nadu citing disrespect to Tamil culture. The party warns of a major protest if authorities do not act on the demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/arun-khetarpal-ikkis-film-completes-filming-december-2025-release-2802974-2025-10-14",
      "headline": "Ikkis shooting complete: Agastya Nanda 1st look as Lieutenant Arun Khetarpal out Filming for 'Ikkis', which tells the story of Arun Khetarpal, has finally been completed. The film features Agastya Nanda and veteran actor Dharmendra, under the direction of Sriram Raghavan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sudipto-sen-criticises-filmfare-awards-overlooking-best-films-2802954-2025-10-14",
      "headline": "The Kerala Story director Sudipto Sen slams Laapataa Ladies' Filmfare awards win Filmmaker Sudipto Sen publicly criticised the Filmfare Awards for awarding films he described as 'plagiarised' and for overlooking notable works. Laapataa Ladies won Best Film and other major honours at the recent ceremony in Ahmedabad, prompting Sen's remarks."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-us-adviser-ashley-tellis-arrested-over-china-meetings-secrets-glbs-2803243-2025-10-15",
      "headline": "Indian-origin strategic expert Ashley Tellis arrested in US over top secret filesUS-India expert Ashley Tellis has been arrested for allegedly hoarding classified documents and meeting Chinese officials. The long-time adviser faces up to 10 years in prison if convicted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-asi-suicide-family-refuse-cremation-demand-y-puran-kumar-wife-arrest-2803166-2025-10-14",
      "headline": "Will cremate body only after late IPS officer's wife's arrest: Haryana cop's familyThe family of Assistant Sub-Inspector (ASI) Sandeep Kumar, who died by suicide, said they'll cremate his body only after late IPS officer Y Puran Kumar's wife, Amneet Puran Kumar, is put behind bars."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/over-10-injured-as-bus-travelling-from-jaisalmer-to-jodhpur-catches-fire-2803003-2025-10-14",
      "headline": "20 dead in Jaisalmer bus fire; PM condoles deaths, announces Rs 2 lakh aidSmoke started emanating from the bus carrying 57 passengers while it was travelling on the Jodhpur-Jaisalmer highway. Despite the driver immediately stopping the bus on the roadside, it burst into flames within minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/its-china-vs-world-scott-bessent-expects-india-will-aid-us-on-rare-earths-glbs-2803238-2025-10-15",
      "headline": "China's pointed a bazooka at world: Tariff-happy US now wants India's backingUS Treasury Secretary said US expects India and Europe to back Washington in countering China's dominance over rare earth supplies, calling it \"China versus the world.\" Despite steep US tariffs on Indian goods, Bessent said global support is vital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-rohit-sharma-virat-kohli-india-vs-australia-odis-2803274-2025-10-15",
      "headline": "Have Rohit Sharma and Virat Kohli been put on notice?After India's win against West Indies, the focus has shifted straightaway to Rohit Sharma and Virat Kohli's return. Ahead of the ODI series against Australia, head coach Gautam Gambhir might have just sent a subtle warning to the veteran duo."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/duragapur-rape-survivors-friend-arrested-had-molested-her-when-she-went-out-with-him-2803121-2025-10-14",
      "headline": "Durgapur survivor's classmate arrested, raped her when she went out with himThe male classmate who accompanied the Durgapur rape survivor on the night of the incident has been arrested after cops gathered several pieces of evidence against him. This marks the sixth arrest in this case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/they-disappeared-my-hair-trump-fumes-at-time-magazine-over-his-pic-on-its-cover-2803123-2025-10-14",
      "headline": "They disappeared my hair: Trump fumes over TIME coverUS President Donald Trump criticised Time Magazine for its choice of his photograph on its cover, saying he had his hair \"disappeared\" and called it the \"worst photo of all time\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-cop-suicide-video-accuses-late-ips-officer-y-puran-kumar-his-cronies-of-graft-sex-abuse-2803066-2025-10-14",
      "headline": "Graft, sex abuse, torture: What Haryana cop said in bombshell video before suicideHaryana Assistant Sub-Inspector (ASI) Sandeep Kumar, who killed himself on Tuesday, accused late senior IPS officer Y Puran Kumar of graft and bribery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/six-pocket-syndrome-india-kbc-kid-confidence-parenting-entitlement-2802939-2025-10-14",
      "headline": "KBC's viral kid and the six-pocket syndrome: A mirror to modern parentingA KBC contestant's confident interruption has ignited a debate on modern parenting styles in India. Experts link this behaviour to 'Six-Pocket Syndrome,' highlighting the risks of overindulgence and entitlement among children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-approver-quip-shilpa-shetty-husband-raj-kundra-cheating-case-2803124-2025-10-14",
      "headline": "Why don't you turn approver against Raj Kundra, High Court asks Shilpa ShettyThe remark was made by the Bombay High Court bench while hearing actor Shilpa Shetty's plea to temporarily suspend LOC issued against her in Rs 60-crore cheating case involving her husband Raj Kundra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-eases-withdrawal-rules-but-there-is-a-catch-details-here-100-percent-pf-withdrawal-2803041-2025-10-15",
      "headline": "EPFO eases withdrawal rules, but there is a catch. Details HereThe EPFO has made a big change by allowing members to withdraw their entire provident fund balance. Still, the revised rules include a major catch that not everyone may find favourable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-sharm-naak-gaza-circus-leaves-shehbaz-sharif-grinning-pm-modi-grinning-away-2803062-2025-10-14",
      "headline": "PM Modi stays away from Trump's 'Sharm-naak' Gaza circus, Shehbaz stays stagedCongress MP Shashi Tharoor questioned whether PM Modi's absence from a historic global event was a missed opportunity for India. Yet, had Modi been pulled alongside Sharif on stage as Trump played peacemaker, it's Tharoor's party that would have been crying 'Sharm-naak'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/how-modern-co-parents-are-doing-it-right-2802888-2025-10-15",
      "headline": "How modern co-parents are doing it rightModern relationships are reshaping traditional norms, with many separated couples choosing co-parenting and sharing responsibilities equally to support their child's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shehbaz-sharif-effusive-praise-for-trump-gaza-summit-online-ridicule-bootlicker-tag-2803192-2025-10-14",
      "headline": "Shehbaz Sharif's over-the-top praise for Trump earns him 'bootlicker' tagAt the Gaza Summit in Egypt, Shehbaz Sharif may have impressed Trump with his effusive praise, but the Pakistan PM also earned a flood of online mockery and the 'bootlicker' tag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-justin-trudeau-rumours-relationship-speculation-london-concert-comments-2803263-2025-10-15",
      "headline": "Katy Perry's viral response to fan proposal fuels Justin Trudeau romance talkKaty Perry's recent remarks at a London concert and viral photos with Justin Trudeau have stirred speculation about her relationship status. The singer gave a cheeky response to a fan who proposed to her with a sign mid-concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-hands-over-four-more-bodies-of-israeli-hostages-after-israel-threatens-aid-cut-glbs-2803247-2025-10-15",
      "headline": "Hamas hands over four more hostage bodies after Israel threatens Gaza aid cutHamas will hand over four more deceased hostages amid Israeli aid cuts. Gaza faces famine, destroyed infrastructure, ongoing clashes, and stalled peace efforts, while Hamas reasserts control over urban areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-showstopper-vikram-phadnis-vintage-india-fashion-celebration-2803252-2025-10-15",
      "headline": "Salman Khan brings royal charm to designer Vikram Phadnis' 35-year fashion galaSalman Khan made a rare and regal appearance on the ramp for Vikram Phadnis' 35th anniversary fashion show in Mumbai. The star-studded event celebrated 'Vintage India'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-unesco-heritage-jaipur-is-falling-to-official-bulldozers-2803010-2025-10-14",
      "headline": "How UNESCO heritage Jaipur is falling to official bulldozersA government demolition drive post-recent building collapses is erasing centuries-old havelis in the walled city and baring years of conservation neglect\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-tariffs-deter-nations-from-joining-brics-glbs-2803257-2025-10-15",
      "headline": "Brics was attack on dollar: Trump claims tariffs made nations drop out of blocUS President Trump claims his tariff threats forced countries to drop out of Brics. According to Trump, his warning led countries to rethink their participation in the economic grouping led by Brazil, Russia, India, China, and South Africa."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-sultan-of-johor-cup-handshake-malaysia-2803083-2025-10-14",
      "headline": "After Asia Cup handshake snub, India-Pak's high-five at hockey tournamentIndia and Pakistan under-21 hockey players exchanged high-fives before their Sultan of Johor Cup match in Malaysia on Tuesday, October 14. The gesture came after cricket teams snubbed handshakes at the Women's World Cup and the Asia Cup.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhruv-vikram-bison-kaalamaadan-diwali-release-breakthrough-tamil-cinema-2802982-2025-10-15",
      "headline": "How Dhruv Vikram's Bison could turn out to be what Sethu was for his dad VikramDhruv Vikram prepares to make his mark with the intense film 'Bison: Kaalamaadan' releasing this Diwali. The film could be his breakthrough, and help him step out of his father Vikram's shadow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-awards-presidential-medal-of-freedom-posthumously-to-charlie-kirk-watch-video-glbs-2803248-2025-10-15",
      "headline": "Video: Trump awards Charlie Kirk posthumous Presidential Medal of FreedomPresident Donald Trump awarded the Presidential Medal of Freedom posthumously to slain conservative activist Charlie Kirk, praising him as a \"fearless warrior for liberty\" during a Rose Garden ceremony on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-and-afghan-taliban-clash-again-along-khyber-pakhtunkhwa-border-glbs-2803272-2025-10-15",
      "headline": "Pakistan and Afghan Taliban clash again along Khyber Pakhtunkhwa borderPakistan's state-run media blamed Afghan forces for firing the first shots without provocation, saying Pakistani troops returned fire and damaged several Afghan tanks and posts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/disarm-or-be-disarmed-perhaps-violently-donald-trumps-stark-warning-to-hamas-glbs-2803239-2025-10-15",
      "headline": "If they don't disarm, we will disarm them: Trump's stark warning to HamasTrump warned Hamas to disarm following a US-brokered Gaza ceasefire, stressing enforcement amid ongoing violence, while his phased peace plan aims to stabilize the region and prevent renewed Israel-Hamas hostilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhruv-vikram-bison-kaalamaadan-diwali-release-breakthrough-tamil-cinema-2802982-2025-10-15",
      "headline": "How Dhruv Vikram's Bison could turn out to be what Sethu was for his dad VikramDhruv Vikram prepares to make his mark with the intense film 'Bison: Kaalamaadan' releasing this Diwali. The film could be his breakthrough, and help him step out of his father Vikram's shadow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-showstopper-vikram-phadnis-vintage-india-fashion-celebration-2803252-2025-10-15",
      "headline": "Salman Khan brings royal charm to designer Vikram Phadnis' 35-year fashion galaSalman Khan made a rare and regal appearance on the ramp for Vikram Phadnis' 35th anniversary fashion show in Mumbai. The star-studded event celebrated 'Vintage India'. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-kuldeep-yadav-shane-warne-india-ashwin-retirement-spin-bowling-2803234-2025-10-15",
      "headline": "Inspired by Shane Warne's wizardry, Kuldeep Yadav proves his worth in whites Kuldeep Yadav is finally receiving the consistent run in the Indian Test team that he has long deserved, after years of sporadic appearances. Through patience and relentless work on his craft—drawing inspiration from Shane Warne—he is poised to carry forward India's rich spin legacy following R. Ashwin's retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-beat-bangladesh-3rd-odi-report-series-sweep-3-0-2803282-2025-10-15",
      "headline": "Afghanistan thrash Bangladesh by 200 runs to sweep ODI series 3–0 Afghanistan completed their decimation of Bangladesh with a commanding 200-run victory in the third and final ODI in Abu Dhabi, sealing a 3–0 series sweep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-rohit-sharma-virat-kohli-india-vs-australia-odis-2803274-2025-10-15",
      "headline": "Have Rohit Sharma and Virat Kohli been put on notice? After India's win against West Indies, the focus has shifted straightaway to Rohit Sharma and Virat Kohli's return. Ahead of the ODI series against Australia, head coach Gautam Gambhir might have just sent a subtle warning to the veteran duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-calls-selector-reforms-domestic-cricket-indian-test-team-2803277-2025-10-15",
      "headline": "Indian players scared of BCCI selectors? Rahane drops bombshell remark Indian batter and former interim captain Ajinkya Rahane has called for radical changes to how selectors in the country's domestic cricket are appointed, saying that only recently retired first-class cricketers should be entrusted with the responsibility of picking teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-mental-collapse-shock-defeat-japan-fifa-world-cup-2803195-2025-10-14",
      "headline": "Team fell apart mentally: Carlo Ancelotti after Brazil's shocking defeat to Japan Brazil suffered a stunning 3–2 defeat to Japan, their first-ever loss to the Asian team. The defeat exposed mental weaknesses that Ancelotti says will be lessons for the World Cup preparation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-set-277-run-target-muthusamy-harmer-spin-pakistan-collapse-lahore-test-2803191-2025-10-14",
      "headline": "Muthuswamy, Harmer dismantle Pakistan as South Africa eye 1–0 lead South African spinners Senuran Muthusamy and Simon Harmer dismantled Pakistan's lineup, sharing nine wickets as the home side managed only 167 in their second innings. South Africa, chasing a venue-record 277, reached 51/2 by stumps, with Noman Ali's late double strike keeping pressure high heading into Day 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-new-zealand-womens-world-cup-rain-washout-nilakshi-de-silva-fastest-fifty-2803179-2025-10-14",
      "headline": "Women's World Cup: Colombo rain keeps SL winless, adds to New Zealand's woes Rain forced the abandonment of the Sri Lanka vs New Zealand Women's World Cup 2025 match in Colombo. Sri Lanka posted a good total of 258/6 in first innings before rain washed out the entire second innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/atiqa-mir-wins-minimax-rmc-uae-championship-2803182-2025-10-14",
      "headline": "10-year-old Atiqa Mir bosses male pack for memorable win in RMC UAE Championship Ten-year-old Atiqa Mir made history by becoming the first female winner in the Minimax category at the RMC UAE Championship. Her victory highlights rising talent from India and marks a significant milestone in a male-dominated sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-afc-asian-cup-2027-qualification-ends-after-2-1-loss-to-singapore-2803170-2025-10-14",
      "headline": "India's AFC Asian Cup 2027 qualification hopes shut down with 1-2 defeat to Singapore India's hopes of qualifying for the 2027 AFC Asian Cup ended with a 2-1 loss to Singapore. The defeat highlights missed chances and defensive lapses that cost India dearly in the qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/indian-junior-hockey-team-draws-3-3-pakistan-sultan-of-johor-cup-comeback-2803167-2025-10-14",
      "headline": "India rally from two goals down to draw 3–3 with Pakistan in Sultan of Johor Cup The Indian junior men's hockey team fought back from two goals down to draw 3–3 with Pakistan in a thrilling Sultan of Johor Cup match. The result highlights India's resilience but leaves the group stage wide open ahead of final fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-vice-president-rajiv-shukla-denies-rohit-kohlis-retirement-rumours-2803140-2025-10-14",
      "headline": "Rajiv Shukla denies rumours of Rohit, Kohli's retirement during Australia tour BCCI Vice President Rajiv Shukla has denied rumours of Virat Kohli and Rohit Sharma's retirements after the upcoming tour of Australia, beginning on October 19 with a three-match ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-new-zealand-womens-world-cup-rain-washout-nilakshi-de-silva-fastest-fifty-2803179-2025-10-14",
      "headline": "Women's World Cup: Colombo rain keeps SL winless, adds to New Zealand's woes Rain forced the abandonment of the Sri Lanka vs New Zealand Women's World Cup 2025 match in Colombo. Sri Lanka posted a good total of 258/6 in first innings before rain washed out the entire second innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/atiqa-mir-wins-minimax-rmc-uae-championship-2803182-2025-10-14",
      "headline": "10-year-old Atiqa Mir bosses male pack for memorable win in RMC UAE Championship Ten-year-old Atiqa Mir made history by becoming the first female winner in the Minimax category at the RMC UAE Championship. Her victory highlights rising talent from India and marks a significant milestone in a male-dominated sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-afc-asian-cup-2027-qualification-ends-after-2-1-loss-to-singapore-2803170-2025-10-14",
      "headline": "India's AFC Asian Cup 2027 qualification hopes shut down with 1-2 defeat to Singapore India's hopes of qualifying for the 2027 AFC Asian Cup ended with a 2-1 loss to Singapore. The defeat highlights missed chances and defensive lapses that cost India dearly in the qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/indian-junior-hockey-team-draws-3-3-pakistan-sultan-of-johor-cup-comeback-2803167-2025-10-14",
      "headline": "India rally from two goals down to draw 3–3 with Pakistan in Sultan of Johor Cup The Indian junior men's hockey team fought back from two goals down to draw 3–3 with Pakistan in a thrilling Sultan of Johor Cup match. The result highlights India's resilience but leaves the group stage wide open ahead of final fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-vice-president-rajiv-shukla-denies-rohit-kohlis-retirement-rumours-2803140-2025-10-14",
      "headline": "Rajiv Shukla denies rumours of Rohit, Kohli's retirement during Australia tour BCCI Vice President Rajiv Shukla has denied rumours of Virat Kohli and Rohit Sharma's retirements after the upcoming tour of Australia, beginning on October 19 with a three-match ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rohit-sharma-lands-in-delhi-ahead-of-australia-tour-2803120-2025-10-14",
      "headline": "Watch: Rohit Sharma lands in Delhi, set to depart with Team India for AustraliaStar India batter Rohit Sharma has landed in Delhi ahead of the three-match Test series against Australia set to begin on October 19. Rohit will link up with the rest of his teammates, who were already in the city for the second Test against West Indies. Team India will leave for Australia from Delhi in the wee hours of October 15.\r\nThe upcoming Australia series will mark the return of both Rohit and Virat Kohli to international cricket after the duo announced its Test retirement in May early this year It will also be the first series for Rohit after stepping down from captaincy and handing over the reins to Shubman Gill.\r\nThe star opener will be eager to return with a bang as he's set to play as a player for the first time since 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/pratik-maharana-wins-national-u20-200m-title-odisha-sprinter-breaks-meet-record-2803112-2025-10-14",
      "headline": "Teenager Pratik Maharana smashes 200m record, carries Odisha's sprinting batonFrom a chance discovery to a national junior champion, Odisha's Pratik Maharana has made heads turn. Training under Siba Mishra, former coach of Dutee Chand, the 200m sprinter — tipped to win continental medals soon — is already on the radar of top athletics academies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhirs-stirring-speech-in-west-indies-dressing-room-after-delhi-test-2803111-2025-10-14",
      "headline": "Watch: Gambhir's stirring speech in West Indies dressing room after Delhi TestIndia head coach Gautam Gambhir praised West Indies' strong fightback despite their Test defeat in Delhi. He emphasised that world cricket needs West Indies and urged them to build a solid Test team for future success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-rajeev-shukla-supports-gautam-gambhir-harshit-rana-selection-controversy-2803105-2025-10-14",
      "headline": "BCCI stands by Gautam Gambhir in support of Harshit Rana: Make comments responsiblyBCCI vice-president Rajeev Shukla has backed Gautam Gambhir amid criticism over Harshit Rana's selection for the India ODI squad. Both leaders emphasise responsible criticism to protect young players' morale and uphold team unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captain-rohit-sharma-virat-kohli-mentors-2803092-2025-10-14",
      "headline": "Shubman Gill will grow as a captain with Rohit and Kohli by his side: Ian BishopIan Bishop believes that Shubman Gill will be in safe hands as he embarks on his new journey as ODI captain alongwith the presence of Rohit Sharma and Virat Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-gautam-gambhir-demands-fast-bowler-friendly-pitches-after-delhi-test-2803026-2025-10-14",
      "headline": "Gautam Gambhir demands fast bowler friendly pitches after guelling Delhi TestIndia clinched a 2-0 series victory over West Indies, yet head coach Gautam Gambhir expressed concern regarding the Arun Jaitley Stadium surface, urging for pitches that have better support for fast bowlers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-sultan-of-johor-cup-handshake-malaysia-2803083-2025-10-14",
      "headline": "After Asia Cup handshake snub, India-Pak's high-five at hockey tournamentIndia and Pakistan under-21 hockey players exchanged high-fives before their Sultan of Johor Cup match in Malaysia on Tuesday, October 14. The gesture came after cricket teams snubbed handshakes at the Women's World Cup and the Asia Cup.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-mental-conditioning-coach-gautam-gambhir-press-conference-2803067-2025-10-14",
      "headline": "I need one: Gautam Gambhir jokes after mental coach suggestion for Shubman GillIndia tour of Australia: Head coach Gautam Gambhir praised Shubman Gill for earning the trust of the dressing room. Gill, who is being groomed as India's next all-format captain, will lead the ODI side for the first time in a three-match series in Australia, starting on 19 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captain-rohit-sharma-virat-kohli-mentors-2803092-2025-10-14",
      "headline": "Shubman Gill will grow as a captain with Rohit and Kohli by his side: Ian BishopIan Bishop believes that Shubman Gill will be in safe hands as he embarks on his new journey as ODI captain alongwith the presence of Rohit Sharma and Virat Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-gautam-gambhir-demands-fast-bowler-friendly-pitches-after-delhi-test-2803026-2025-10-14",
      "headline": "Gautam Gambhir demands fast bowler friendly pitches after guelling Delhi TestIndia clinched a 2-0 series victory over West Indies, yet head coach Gautam Gambhir expressed concern regarding the Arun Jaitley Stadium surface, urging for pitches that have better support for fast bowlers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-sultan-of-johor-cup-handshake-malaysia-2803083-2025-10-14",
      "headline": "After Asia Cup handshake snub, India-Pak's high-five at hockey tournamentIndia and Pakistan under-21 hockey players exchanged high-fives before their Sultan of Johor Cup match in Malaysia on Tuesday, October 14. The gesture came after cricket teams snubbed handshakes at the Women's World Cup and the Asia Cup.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-mental-conditioning-coach-gautam-gambhir-press-conference-2803067-2025-10-14",
      "headline": "I need one: Gautam Gambhir jokes after mental coach suggestion for Shubman GillIndia tour of Australia: Head coach Gautam Gambhir praised Shubman Gill for earning the trust of the dressing room. Gill, who is being groomed as India's next all-format captain, will lead the ODI side for the first time in a three-match series in Australia, starting on 19 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-robert-lewandowski-fc-barcelona-thigh-injury-setback-2803054-2025-10-14",
      "headline": "FC Barcelona dealt major setback as Robert Lewandowski sidelined with thigh injuryLa Liga 2025: FC Barcelona have suffered a major blow with Robert Lewandowski expected to be out of action due to a thigh injury he picked up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ian-botham-questions-england-ashes-preparations-australia-borderline-arrogance-2802961-2025-10-14",
      "headline": "Ian Botham slams England's lack of preparation for Ashes 2025: Borderline arroganceFormer England all-rounder Ian Botham has raised concerns over England's limited Ashes preparations, highlighting the risks of minimal warm-up matches and fitness management ahead of the Test series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/shami-vs-agarkar-pacer-slams-no-communication-over-aus-tour-snub-ytvd-2802931-2025-10-14",
      "headline": "Shami vs Agarkar: Pacer Slams 'No Communication' Over Aus Tour SnubThis special report focuses on the escalating controversy between senior Indian pacer Mohammed Shami and the BCCI's selection committee, headed by chief selector Ajit Agarkar. Shami is quoted in the bulletin as saying, 'The Indian team did not communicate with me regarding fitness. I am not the one who should inform them about my fitness.' The pacer has publicly questioned his exclusion from the upcoming tour of Australia, stating that if he is fit enough to play four-day Ranji Trophy matches for Bengal, he should be considered for the 50-over format. This comes after Agarkar had reportedly raised concerns about Shami's lack of consistent match practice. Shami refutes any fitness concerns, asserting he is ready to play for the Indian team whenever called upon, creating a standoff between the veteran player and the national selectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-birthday-yuvraj-singh-video-message-arjan-vailly-2802902-2025-10-14",
      "headline": "On Gambhir's birthday, Yuvraj Singh's Arjan Vailly tribute to coach goes viralYuvraj Singh's witty birthday wish for Gautam Gambhir lit up social media, as the World Cup hero hailed the coach's trademark intensity with a playful Arjan Vailly-themed tribute. Gambhir celebrated his 44th birthday on Tuesday, overseeing India's Test win over the West Indies in New Delhi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-fitness-indian-team-management-ranji-trophy-omission-2802893-2025-10-14",
      "headline": "If I can play Ranji, why can't I play ODIs? Shami's dig at Indian team managementMohammed Shami contradicted chief selector Ajit Agarkar's remarks on his fitness, asserting that if he is fit enough to play four-day Ranji Trophy matches, he is equally capable of handling the demands of 50-over cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-australia-odis-shubman-gill-captain-message-2802881-2025-10-14",
      "headline": "Do your magic: Rohit Sharma and Virat Kohli get cool message from Shubman GillIndia tour of Australia: Shubman Gill backed Virat Kohli and Rohit Sharma to continue their prolific run in one-day internationals as they return to international cricket in a three-match ODI series starting on 19 October. Gill will lead the ODI side for the first time after taking over from Rohit as captain.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}