{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-react-to-us-fed-rate-cut-what-investors-need-to-know-expert-view-2602676-2024-09-19",
      "headline": "Gold prices react to US Fed rate cut: What investors need to knowThe US Federal Reserve's rate cuts aim to stabilise the economy but raise concerns about their impact on global markets, particularly on gold prices, a key investment in uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-gain-small-midcap-stocks-under-pressure-reason-explained-2602658-2024-09-19",
      "headline": "Explained: Why small and midcap stocks are under pressure todayPublic Sector Undertaking (PSU) stocks, particularly in sectors such as defence, railways, and non-banking financial companies (NBFCs), have been hit hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-cut-stock-market-protfolio-rebalancing-strategies-it-banking-largecap-expert-views-2602618-2024-09-19",
      "headline": "IT, banking, large-cap stocks: Strategies to boost portfolio after Fed rate cutWill the US Fed's rate cut boost opportunities on Dalal Street? Check these expert strategies to realign your portfolio. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hal-irfc-bhel-rvnl-pfc-irctc-cochin-shipyard-rec-stocks-fall-why-psu-stocks-are-under-pressure-2602600-2024-09-19",
      "headline": "HAL, IRFC, BHEL stocks fall: Here's why PSU stocks are under pressurePSU stocks fell even as India's benchmark indices, Sensex and Nifty, rose on the back of higher-than-expected interest rate cuts by the US Federal Reserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-50-bps-rate-cut-impact-on-indian-economy-explained-2602573-2024-09-19",
      "headline": "Explained: What US Fed's 50 bps rate cut means for Indian economyThe Fed's decision signalled a shift towards easing monetary policy, with experts divided on its implications for the global economy, including India. Here's a detailed look at how the bigger-than-expected rate cut could impact the Indian economy and the broader market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cisco-job-cut-thousands-in-second-biggest-layoff-of-2024-report-2602557-2024-09-19",
      "headline": "Cisco cuts thousands of jobs in second biggest layoff of 2024: Report This latest round of layoffs follows a previous cut in February when Cisco let go of about 4,000 employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-cuts-rates-by-50-bps-how-will-it-affect-indian-stock-market-expert-view-volatility-it-fmcg-defence-2602546-2024-09-19",
      "headline": "US Fed cuts rates by 50 bps: How will it affect Indian stock market?This is the first time the Fed has reduced rates since 2020, and it has been done to address slowing economic growth and easing inflation in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-record-highs-jumps-600-points-crosses-25000-first-time-2602473-2024-09-19",
      "headline": "Sensex jumps over 700 points, Nifty crosses 25,500 for 1st time; IT stocks gainThe S&P BSE Sensex was up 758.7 points at 83,706.93 at 9:41 am, while the NSE Nifty50 gained 215.40 points to trade at 25,592.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-slashes-rates-by-50-bps-in-first-rate-reduction-since-2020-2602387-2024-09-18",
      "headline": "US Fed slashes rates by 50 bps in first rate reduction since 2020Policymakers see the Fed's benchmark rate falling by another half of a percentage point by the end of this year, another full percentage point in 2025, and by a final half of a percentage point in 2026 to end in a 2.75 per cent-3.00 per cent range."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-decision-live-news-updates-today-at-1130-pm-5-things-to-watch-out-2602214-2024-09-18",
      "headline": "US Fed rate decision today at 11:30 pm – 5 things to watch outMarkets are widely expecting a 25-basis-point cut in the key interest rate, marking the first reduction in four years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tupperware-files-for-bankruptcy-chapter-11-once-household-name-struggles-to-stay-afloat-2602163-2024-09-18",
      "headline": "Tupperware, once a household name, files for bankruptcyTupperware Brands and some of its subsidiaries filed for Chapter 11 bankruptcy protection on Tuesday. The company, widely known for its food storage containers, has been struggling with falling sales in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-explained-details-how-to-invest-eligibility-criteria-online-buying-guide-2602103-2024-09-18",
      "headline": " NPS Vatsalya: How to invest, eligibility criteria, and online buying guideNPS Vatsalya enables parents or guardians to open a pension account for minors and contribute as little as Rs 1,000 annually, making it accessible to families from various economic backgrounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-profit-booking-us-fed-rate-cut-decision-explained-2602086-2024-09-18",
      "headline": "Explained: Why IT stocks faced profit booking ahead of US Fed rate decisionMphasiS led the decline, dropping 5.6%, followed by L&T Technology Services, Persistent Systems, Tata Consultancy Services, HCL Technologies, and Tech Mahindra, which saw losses ranging from 3% to 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-amid-profit-booking-in-it-stocks-tcs-shares-fall-4-percent-2602047-2024-09-18",
      "headline": "Sensex, Nifty fall amid profit booking in IT stocks; TCS falls 4%The S&P BSE Sensex closed 131.43 points down at 82,948.23, whille the NSE Nifty50 lost 41 points to end at 25,377.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-shares-hit-20-upper-circuit-whats-next-2602045-2024-09-18",
      "headline": "Reliance Infra shares hit 20% upper circuit. What's next? The sharp uptick in Reliance Infra's share price followed the company's announcement of a significant reduction in its standalone external debt, from Rs 3,831 crore to Rs 475 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-cross-rs-700-for-the-first-time-since-january-more-room-to-rise-2602021-2024-09-18",
      "headline": "Paytm shares cross Rs 700 for the first time since January. More room to rise?\tBefore today, the last time Paytm traded above Rs 700 was in late January, closing at Rs 761."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radhika-gupta-edelweiss-mutual-fund-calls-sips-new-status-symbol-for-delhis-young-investors-2602010-2024-09-18",
      "headline": "Radhika Gupta calls SIPs the new status symbol for Delhi's young investorsRadhika Gupta, MD and CEO of Edelweiss Mutual Fund, believes that the true indicator of success in today's financial landscape should be how much one invests in Systematic Investment Plans (SIPs), not the number of real estate holdings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-assures-no-price-hikes-for-essential-commodities-wheat-rice-sugar-edible-oils-festive-season-2601992-2024-09-18",
      "headline": "Government assures no price hikes for essential commodities this festive seasonThe Ministry of Food and Consumer Affairs has highlighted that, as of now, there are no plans to allow any increase in prices for essentials items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-dip-after-multibagger-rally-buy-hold-or-sell-2601951-2024-09-18",
      "headline": "Bajaj Housing Finance shares dip after multibagger rally: Buy, hold, or sell?After a stellar market debut, Bajaj Housing Finance shares have dipped today—should investors be concerned or hold steady?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/west-bengal-gdp-decline-per-capita-income-eac-pm-working-paper-2601914-2024-09-18",
      "headline": "How West Bengal lost its crown as India's financial hubFrom economic powerhouse to struggling state, West Bengal's fall from its prime spot in India's financial scene tells a story of lost opportunity and shifting fortunes."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-delhi-cabinet-kailash-gehlot-saurabh-bhardwaj-retained-among-ministers-mukesh-ahlawat-new-entrant-2602642-2024-09-19",
      "headline": "Mukesh Ahlawat new face in Atishi cabinet, Kailash Gahlot to be retained: SourcesMukesh Ahlawat contested the 2020 Delhi Assembly elections from Sultanpur Majra on an AAP ticket. He won the polls with 48,042 votes and replaced Sandeep Kumar, former minister for the welfare of Scheduled castes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-narendra-modi-jammu-and-kashmir-first-phase-assembly-elections-srinagar-rally-youth-voted-without-fear-youth-carry-books-pens-2602608-2024-09-19",
      "headline": "J&K youth now carry books and pens, not stones: PM on record voter turnoutJammu and Kashmir saw a voter turnout of 60.21 per cent in the first phase of polling for the Assembly election - the highest in the past seven elections. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/centre-probing-ernst-and-young-pune-woman-death-mother-work-pressure-2602594-2024-09-19",
      "headline": "Government probing EY India employee's death due to 'excessive workload'The incident has led to a massive outrage on social media after a letter written by the Pune woman's mother to the head of Ernst & Young India went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-choreographer-jani-master-arrested-in-goa-after-being-charged-with-pocso-rape-case-2602599-2024-09-19",
      "headline": "Telugu choreographer Jani Master arrested in Goa after being charged with POCSOTelugu choreographer Shaik Jani Basha was arrested by the Special Operations Team (SOT) in Goa after being charged with POCSO following a sexual abuse complaint by a 21-year-old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-cm-designate-atishi-singh-aam-aadmi-party-news-aap-arvind-kejriwal-future-assembly-election-2025-party-unity-2602595-2024-09-19",
      "headline": "Will AAP unity stand test of post-poll politics?Politics is what takes place between what's said and what's left unsaid. Most AAP leaders said that Kejriwal would return after the election, and that's exactly why they have agreed to Atishi as the CM. What's unsaid is that Atishi is a stop-gap solution. But will AAP unity stand the test if Atishi continues as the CM? Will personal ambitions create a fissure within the ranks?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/woman-killed-body-severed-chennai-cops-recover-body-crime-tamil-nadu-2602566-2024-09-19",
      "headline": "Woman's body chopped up, found stuffed inside suitcase lying on Chennai roadThe Chennai Police detained a man after they found a woman's dismembered body in a suitcase, 100 metres away from his home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/udhayanidhi-stalin-sanatana-dharma-climb-to-tamil-nadu-deputy-chief-minister-dmk-mk-stalin-kanimozhi-bjp-aiadmk-2602563-2024-09-19",
      "headline": "How Udhayanidhi Stalin used Sanatana Dharma as crutches to climb Udhayanidhi Stalin is poised to become the deputy chief minister of Tamil Nadu. A year earlier, he made critical remarks on Sanatana Dharma, which a section of experts believed would thwart his growth. However, the remarks helped him solidify his standing within the DMK and settle the succession battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-mumbai-expressway-pothole-kcc-buildcon-nhai-terminate-employee-2602521-2024-09-19",
      "headline": "Employee blames rats for hole in Delhi-Mumbai highway, company fires himThe firm stated that the comment was made by a junior employee who had no technical understanding regarding the project and confirmed that he had been terminated from the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-indian-ammunition-enters-ukraine-despite-russia-opposition-2602655-2024-09-19",
      "headline": "Ammunition from Indian enters Ukraine despite Russia's oppositionAccording to sources, the transfer of arms to support Ukraine's defence against Russia has occurred for more than a year. The Kremlin has raised the issue on at least two occasions, including during a July meeting between Russian Foreign Minister Sergei Lavrov and S Jaishankar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/justin-trudeau-liberal-party-loss-montreal-toronto-pm-approval-rating-grand-exit-2025-canada-election-2602646-2024-09-19",
      "headline": "How recent losses predict a Trudeau grand exitThe party of Canadian Prime Minister Justin Trudeau recently lost the byelection in Montreal, a safe seat. Seen together with the defeat in Toronto, another Liberal Party fortress, in June, and his plunging approval ratings, it could be a marker for Trudeau's grand exit in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-haryana-manifesto-jobs-for-ex-agniveers-msp-on-24-crops-rs-2000-for-women-2602580-2024-09-19",
      "headline": "BJP Haryana manifesto: Jobs for ex-Agniveers, MSP promise, cash benefit for womenAs per the poll manifesto, the BJP stated that 10 industrial cities will be built on the lines of IMT Kharkhoda and special incentives to entrepreneurs to provide jobs to locals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/anand-mahindra-heartfelt-message-elon-musk-neuralink-blindsight-device-2602662-2024-09-19",
      "headline": "Anand Mahindra's heartfelt message for Elon Musk on Blindsight deviceThe Blindsight device from Elon Musk's brain-chip startup company Neuralink will enable even those who have lost both eyes and their optic nerve to see. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-nawada-mahadalits-houses-set-on-fire-land-dispute-congress-bjp-jdu-2602553-2024-09-19",
      "headline": "21 Dalit homes set on fire in Bihar, Congress's jungle raj swipe at NDAInitially, it was reported that over 80 houses were gutted in the incident on Wednesday night, but Bihar police have put the number at 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-apologises-for-mispronouncing-marathi-word-2602638-2024-09-19",
      "headline": "Watch: Amitabh Bachchan apologises for mispronouncing a Marathi word Bollywood icon Amitabh Bachchan issued an apology after mispronouncing a Marathi word in a recent video. His friend, singer Sudesh Bhosale, pointed out the error, prompting Bachchan to share a correction and apology with his fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-national-president-jp-nadda-congress-rahul-gandhi-mallikarjun-kharge-letter-failed-product-jab-2602507-2024-09-19",
      "headline": "JP Nadda's 'failed product' barb at Rahul Gandhi in letter to Mallikarjun KhargeJP Nadda's letter to Mallikarjun Kharge came two days after the latter wrote to the Prime Minister raising concerns over \"extremely objectionable, violent and rude\" remarks made by NDA leaders against Rahul Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-water-is-not-enough-to-stay-hydrated-2602635-2024-09-19",
      "headline": "Why water is not enough to stay hydratedWater is vital to the body, but alone it's not enough for proper hydration. That's where electrolytes come in—minerals like sodium, potassium, and chloride, which play a crucial role in keeping the body hydrated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-defence-minister-khawaja-asif-kashmir-election-article-370-congress-alliance-2602483-2024-09-19",
      "headline": "Pak minister's Article 370 remark stirs row, BJP says Congress has same agendaPakistani defence minister Khawaja Asif said there was a 'high chance' that the Congress-National Conference alliance would come to power in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/chennai-techie-fired-worked-as-swiggy-delivery-agent-viral-story-2602592-2024-09-19",
      "headline": "Fired from job, Chennai techie worked as Swiggy delivery agent. His story is viralA techie from Chennai who was fired from his job a few months ago was forced to join Swiggy as a delivery partner. He recounted his journey in a LinkedIn post that has now gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/decide-on-emergency-release-in-a-week-supreme-court-to-film-body-2602570-2024-09-19",
      "headline": "'Emergency' makers accuse film body of delaying release at BJP's behestOn September 4, the Bombay High Court had passed an order, directing the CBFC to consider the representations filed by a Sikh body against the film and take a decision by September 18, on whether to release it or not. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/worlds-smallest-scuba-diver-this-lizard-has-a-tiny-air-tank-on-its-nose-2602654-2024-09-19",
      "headline": "Tiny lizard, big bubbles: The smallest scuba diver on EarthLizards able to form bubbles can stay underwater 32% longer than those without."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-walkietalkie-explosions-deaths-pager-blasts-israel-2602443-2024-09-19",
      "headline": "Hezbollah walkie-talkie blasts kill 20, raise fears of wider Israel conflict Live UpdatesWednesday's walkie-talkie blasts came as Israeli Defence Minister Yoav Gallant announced a \"new phase in the war\" against the Hamas militant group, adding that the \"centre of gravity\" is moving north with the deployment of a new military division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-laddu-was-prepared-using-animal-fat-says-chandrababu-naidu-sri-venkateswara-temple-andhra-pradesh-2602421-2024-09-19",
      "headline": "Chandrababu Naidu claims animal fat used in Tirupati laddoo, YSR Congress deniesSpeaking at the NDA legislature party meeting, N Chandrababu Naidu said that Tirupati laddoo was made with substandard ingredients and animal fat was used instead of ghee during its preparation during YSR Congress's government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/noida-hospital-guards-assault-2602622-2024-09-19",
      "headline": "Video: Men assault female guard, attack male security at Noida hospitalCCTV footage showed the attackers shoving the female guard aside and then thrashing the male guard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/dune-prophecy-emily-watson-looks-fierce-in-new-poster-from-upcoming-jiocinema-show-2602683-2024-09-19",
      "headline": "Dune Prophecy: Emily Watson looks fierce in new posterJioCinema Premium has released a new poster featuring Emily Watson for the upcoming series Dune: Prophecy. Set to premiere in November, the series delves into the events 10,000 years before the rise of Paul Atreides."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-promised-to-take-care-of-my-son-aadesh-shrivastava-vijayta-pandit-2602667-2024-09-19",
      "headline": "SRK promised to take care of my son, not able to contact him: Actor VijaytaLate music composer Aadesh Shrivastava's wife and former actor Vijayta Pandit recently spoke about her husband's last days. She said that Shah Rukh Khan had promised to help their son during tough times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/sajid-khan-farah-khan-aman-verma-himesh-reshammiya-father-vipin-reshammiya-funeral-2602669-2024-09-19",
      "headline": "Pics: Celebs at Himesh Reshammiya's father Vipin's funeral Himesh Reshammiya's father and music director, Vipin Reshammiya, died on September 18 at 87. The funeral ceremony took place on September 19 and was attended by several stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-adds-the-chulbul-pandey-dabangg-swag-to-rohit-shetty-singham-again-report-2602659-2024-09-19",
      "headline": "Salman Khan adds the Chulbul Pandey swag to Rohit Shetty's Singham Again: ReportSingham Again just got bigger with Salman Khan's addition as Chulbul Pandey from Dabangg. There's no confirmation on the same, but there were talks about Rohit Shetty including the famous cop character in his universe. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-set-to-have-scan-on-hamstring-injury-ahead-of-pakistan-tour-2602696-2024-09-19",
      "headline": "Ben Stokes set to have scan on hamstring injury ahead of Pakistan tourEngland captain Ben Stokes is scheduled for a hamstring scan next week as the team evaluates his fitness for the upcoming Test series against Pakistan. The 33-year-old all-rounder has been sidelined since August due to the injury but remains active in training."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-kl-rahul-failure-fans-question-selection-2602686-2024-09-19",
      "headline": "IND v BAN: KL Rahul's place in Test team questioned after Chennai failureIndia vs Bangladesh, Chennai Test: KL Rahul squandered a good opportunity to play the crisis man's role for India on Day 1 of the first Test. Rahul was not proactive during his 52-ball stay in the middle. He was dismissed for 16 by off-spinner Mehidy Hasan Miraz. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-kuldeep-yadav-dropped-sanjay-manjrekar-chennai-2602666-2024-09-19",
      "headline": "Find it amazing how easily India drops a Kuldeep Yadav: Sanjay ManjrekarSanjay Manjrekar said that he was left baffled by India's decision to drop Kuldeep Yadav for the Chennai Test against Bangladesh on Thursday, September 19. India went 3 pacers for the match in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-badminton-malavika-bansod-quarter-final-kirsty-gilmour-gregoria-mariska-2602656-2024-09-19",
      "headline": "Malavika Bansod continues dream run, storms into quarter-finalsChina Open 2024: After stunning Paris Olympics bronze medalist, Gregoria Mariska Tunjung in the opening round, India's Malavika Bansod defeated two-time Commonwealth Games medallist Kirsty Gilmour of Scotland to progress to the women's singles quarter-final on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rishabh-pant-litton-das-hasan-mahmud-2602623-2024-09-19",
      "headline": "Rishabh Pant's stump mic chatter with Litton goes viral: 'Mujhe kyu maar re ho'India vs Bangladesh, 1st Test: India wicketkeeper batter Rishabh Pant was involved in stump mic chatter with Litton Das on Day 1 of the first Test against Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-gautam-gambhir-reaction-rishabh-pant-wicket-2602619-2024-09-19",
      "headline": "Gautam Gambhir disappointed after Rishabh Pant's dismissal in ChennaiIndia vs Bangladesh, 1st Test: Rishabh Pant threw away a good opportunity to convert a good start into a big knock. Guatam Gambhir echoed the emotions of the majority of Indian fans when Pant got out on 39 to young pacer Hasan Mahmud in Chennai on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-psg-boss-luis-enrique-makes-bizarre-childbirth-analogy-for-girona-win-2602620-2024-09-19",
      "headline": "PSG boss Luis Enrique makes bizarre 'childbirth' analogy for Girona winPSG boss Luis Enrique claimed that his side's win over Girona in the Champions League was painful like childbirth. PSG secured a last-gasp win over Girona on Wednesday, September 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-virat-kohli-dismissal-planning-tamim-iqbal-reaction-2602593-2024-09-19",
      "headline": "Kohli's dismissal makes Bangladesh analyst look like magician: Tamim IqbalIndia vs Bangladesh, Chennai Test: Former Bangladesh captain Tamim Iqbal said that Virat Kohli's dismissal on Day 1 made the Bangladeshi analyst look like a magician. Kohli was dismissed after scoring just six runs in the morning session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/parthiv-patel-ind-vs-ban-rishabh-pant-yashasvi-jaiswal-2602579-2024-09-19",
      "headline": "Parthiv Patel reveals reasoning behind sending Rishabh Pant ahead of KL RahulFormer India cricketer Parthiv Patel gave the reasoning behind team management's decision to send Rishabh Pant ahead of KL Rahul on Day 1 of the first Test against Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-shubman-gill-duck-chennai-parthiv-patel-2602571-2024-09-19",
      "headline": "Shubman Gill was unlucky: Parthiv Patel defends India batter after Chennai duckParthiv Patel has defended Shubman Gill after the Indian batter was dismissed for a duck on day one of the first Test against Bangladesh on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-bans-victorian-women-coach-dulip-samaraweera-for-20-years-2602527-2024-09-19",
      "headline": "Cricket Australia bans Victorian women's coach Dulip Samaraweera for 20 yearsCricket Australia has banned Dulip Samaraweera, former head coach of the Victorian women's cricket team, for 20 years following an investigation into a coercive relationship with a female player. The decision underscores CA's commitment to player welfare and integrity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-psg-boss-luis-enrique-makes-bizarre-childbirth-analogy-for-girona-win-2602620-2024-09-19",
      "headline": "PSG boss Luis Enrique makes bizarre 'childbirth' analogy for Girona winPSG boss Luis Enrique claimed that his side's win over Girona in the Champions League was painful like childbirth. PSG secured a last-gasp win over Girona on Wednesday, September 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-virat-kohli-dismissal-planning-tamim-iqbal-reaction-2602593-2024-09-19",
      "headline": "Kohli's dismissal makes Bangladesh analyst look like magician: Tamim IqbalIndia vs Bangladesh, Chennai Test: Former Bangladesh captain Tamim Iqbal said that Virat Kohli's dismissal on Day 1 made the Bangladeshi analyst look like a magician. Kohli was dismissed after scoring just six runs in the morning session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/parthiv-patel-ind-vs-ban-rishabh-pant-yashasvi-jaiswal-2602579-2024-09-19",
      "headline": "Parthiv Patel reveals reasoning behind sending Rishabh Pant ahead of KL RahulFormer India cricketer Parthiv Patel gave the reasoning behind team management's decision to send Rishabh Pant ahead of KL Rahul on Day 1 of the first Test against Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-shubman-gill-duck-chennai-parthiv-patel-2602571-2024-09-19",
      "headline": "Shubman Gill was unlucky: Parthiv Patel defends India batter after Chennai duckParthiv Patel has defended Shubman Gill after the Indian batter was dismissed for a duck on day one of the first Test against Bangladesh on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-bans-victorian-women-coach-dulip-samaraweera-for-20-years-2602527-2024-09-19",
      "headline": "Cricket Australia bans Victorian women's coach Dulip Samaraweera for 20 yearsCricket Australia has banned Dulip Samaraweera, former head coach of the Victorian women's cricket team, for 20 years following an investigation into a coercive relationship with a female player. The decision underscores CA's commitment to player welfare and integrity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-mahmud-ind-vs-ban-rohit-sharma-shubman-gill-virat-kohli-chennai-test-2602540-2024-09-19",
      "headline": "Who is Hasan Mahmud? Young Bangladesh pacer torments India in Chennai TestBangladesh seamer Hasan Mahmud ran through the Indian batting order on Day 1 of the first Test against Bangladesh at the MA Chidambaram Stadium in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-shubman-gill-duck-virat-kohli-chennai-2602532-2024-09-19",
      "headline": "IND vs BAN: Shubman Gill joins Virat Kohli in unwanted ducks list for IndiaShubman Gill joined Virat Kohli in an unwanted ducks list for India as he suffered a failure during day one of the Chennai Test. Gill was dismissed for an 8-ball duck as Hasan Mahmud wreaked havoc on day one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-virat-kohli-failure-hasan-mahmud-chennai-2602506-2024-09-19",
      "headline": "IND vs BAN: Virat Kohli fails on India Test return, out for 6 in ChennaiIndia vs Bangladesh, Chennai Test: Virat Kohli's return to the India Test side is off to the worst possible start as he was dismissed for just 6 runs in the first innings of the Chennai Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rohit-sharma-shubman-gill-hasan-mahmud-2602505-2024-09-19",
      "headline": "IND vs BAN: Rohit Sharma, Shubman Gill fail in testing conditions in ChennaiIndia captain Rohit Sharma and Shubman Gill were dismissed cheaply on Day 1 of the first Test against Bangladesh after Bangladesh captain Najmul Hossain Shanto won the toss and elected to bowl first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-42-year-toss-run-ends-chennai-chepauk-2602482-2024-09-19",
      "headline": "IND vs BAN: Bangladesh end 42-year toss run in Chennai by fielding firstBangladesh's decision to field first in the Chennai Test ended a 42-year toss run at the Chepauk. This is the first time in 21 Tests that a team has decided to field first after winning the toss at the iconic stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-chennai-test-pitch-challenge-2602472-2024-09-19",
      "headline": "Bangladesh not underdogs: Ashwin reckons Chennai pitch perfect for Test cricketIndia vs Bangladesh: Ace spinner R Ashwin reckons that Bangladesh cannot be considered underdogs after their historic series win in Pakistan. Ashwin also shared his memories of playing Test cricket in his hometown, Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-rohit-sharma-message-chennai-2602466-2024-09-19",
      "headline": "Back your potential: Rohit Sharma's message to India as 10-Test run startsRohit Sharma has told his side to back their potential as India kickstart their 10-Test run with the match against Bangladesh in Chennai on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-42-year-toss-run-ends-chennai-chepauk-2602482-2024-09-19",
      "headline": "IND vs BAN: Bangladesh end 42-year toss run in Chennai by fielding firstBangladesh's decision to field first in the Chennai Test ended a 42-year toss run at the Chepauk. This is the first time in 21 Tests that a team has decided to field first after winning the toss at the iconic stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-chennai-test-pitch-challenge-2602472-2024-09-19",
      "headline": "Bangladesh not underdogs: Ashwin reckons Chennai pitch perfect for Test cricketIndia vs Bangladesh: Ace spinner R Ashwin reckons that Bangladesh cannot be considered underdogs after their historic series win in Pakistan. Ashwin also shared his memories of playing Test cricket in his hometown, Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-rohit-sharma-message-chennai-2602466-2024-09-19",
      "headline": "Back your potential: Rohit Sharma's message to India as 10-Test run startsRohit Sharma has told his side to back their potential as India kickstart their 10-Test run with the match against Bangladesh in Chennai on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-indias-playing-xi-chennai-test-akash-deep-kl-rahul-rishabh-pant-2602454-2024-09-19",
      "headline": "IND vs BAN: India pick 3 pacers for Chennai Test, Akash Deep in XIIndia have picked three fast bowlers for the first Test against Bangladesh in Chennai as Akash Deep joins Jasprit Bumrah and Mohammed Siraj in the playing XI. Bangladesh captain Najmul Hossain Shanto won the toss and elected to bowl first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-comeback-test-cricket-632-days-2602446-2024-09-19",
      "headline": "India gleam with hope as Rishabh Pant returns to Tests after absence of 632 daysIndia vs Bangladesh: Rishabh Pant returns to Test cricket after a long gap of 632 days. Pant's return to the Test side not only brings incredible joy to India fans but also adds the much-needed X factor to the Test team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-six-sixes-vs-stuart-broad-t20-world-cup-2007-2602450-2024-09-19",
      "headline": "OTD in 2007: Yuvraj Singh thrashes Stuart Broad for six sixes in an overStar India all-rounder Yuvraj Singh hit England's Stuart Broad for six consecutive sixes in an over during the T20 World Cup 2007 at Kingsmead Durban."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}