{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-ticks-up-volatility-expectations-climb-to-two-year-peak-2716133-2025-04-28",
      "headline": "Rupee ticks up, volatility expectations climb to two-year peakThe rupee was at 85.26 against the US dollar as of 11:00 am, up from its close at 85.45 in the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-form-16-getting-a-makeover-heres-all-you-need-to-know-2716130-2025-04-28",
      "headline": "ITR Filing 2025: Is Form 16 getting a makeover? Here's all you need to knowForm 16 is a certificate that an employer gives to an employee, which shows how much salary he earned and how much tax they deducted from it on the employee's behalf. It's proof that your taxes have been properly paid to the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-airspace-close-india-flights-huge-loss-millions-overflight-fees-reroute-pahalgam-attack-2716107-2025-04-28",
      "headline": "Explained: How Pakistan could lose millions after closing airspace for IndiaPakistan's decision to close its airspace to Indian airlines, after India's diplomatic move against Pakistan over the Pahalgam terror attack, is likely to cause disruptions on several key international routes, particularly flights departing from North India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-subcribe-or-not-latest-gmp-brokerage-views-price-band-allotment-date-2716104-2025-04-28",
      "headline": "Ather Energy IPO: Should you subscribe or not?Ather Energy IPO: The IPO is a book-built offer worth Rs 2,980.76 crore, comprising a fresh issue of 8.18 crore equity shares valued at Rs 2,626.30 crore and an offer for sale (OFS) of 1.11 crore shares aggregating Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-sensex-nifty-rising-today-check-top-factors-dalal-street-rally-2716082-2025-04-28",
      "headline": "Sensex gains over 800 points. 3 reasons behind stock market rallyStock market today: At around 10:15 am, the S&P BSE Sensex was trading 849.30 points higher at 80,061.83, while the NSE Nifty50 rose 237.10 points to 24,276.45. All broader market indices were also firmly in positive territory, signalling the potential for a strong session ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-jumps-after-q4-results-buy-hold-sell-2716075-2025-04-28",
      "headline": "Reliane shares jump over 4% after strong Q4 results. Buy, hold or sell?The Mukesh Ambani-led conglomerate reported a 2% rise in consolidated net profit to Rs 19,407 crore, beating analysts' expectations of around Rs 18,471 crore. Revenue from operations for the quarter grew 10% year-on-year to Rs 2.64 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-jumps-350-points-nifty-above-24100-ril-gains-2-percent-mahindra-shares-rise-2716061-2025-04-28",
      "headline": "Sensex, Nifty rally driven by Reliance boost and positive Asian market trendsThe S&P BSE Sensex added 558.35 points to 79,770.88, while the NSE Nifty50 gained 155.75 points to 24,195.10as of 9:47 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-open-subscribe-skip-latest-gmp-expert-view-details-important-dates-price-band-allotment-2716060-2025-04-28",
      "headline": "Ather Energy IPO opens for bidding: Should you subscribe? Check latest GMPAther Energy IPO is a book-built issue worth Rs 2,980.76 crore. It includes a fresh issue of 8.18 crore shares aggregating to Rs 2,626.30 crore, and an offer for sale (OFS) of 1.11 crore shares worth Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-stock-market-opening-april-28-trading-nse-bse-dalal-street-2716040-2025-04-28",
      "headline": "Sensex, Nifty opening: Will stock market rise or fall today?The situation between India and Pakistan remains tense after the recent attack in Kashmir. This tension pulled down both the Sensex and Nifty on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-april-28-ril-idfc-first-bank-mahindra-axis-bank-2716027-2025-04-28",
      "headline": "Stocks to watch on April 28: RIL, IDFC First Bank, Mahindra, Axis BankVarious stocks are likely to see big movements today, April 28, as several companies are set to announce their quarterly earnings and other key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-lifted-171-million-people-extreme-poverty-2012-to-2022-world-bank-data-2715692-2025-04-27",
      "headline": "India lifted 171 million people from extreme poverty from 2012 to 2022: World BankRural extreme poverty dropped from 18.4 per cent to 2.8 per cent, and urban from 10.7 per cent to 1.1 per cent, narrowing the rural-urban gap from 7.7 to 1.7 percentage points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-simplifies-online-pf-transfers-form-13-job-change-uan-2715484-2025-04-26",
      "headline": "Changing jobs? Check this EPFO update on PF transfersEffective January 2025, the requirement for employer approval in most transfer cases has been eliminated. Previously, PF balance transfers required coordination between source and destination EPFO offices, often causing delays."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-delhi-groom-cancelling-wedding-after-dj-plays-channa-mereya-2716128-2025-04-28",
      "headline": "KJo reacts to Delhi groom cancelling wedding after DJ plays Channa MereyaFilmmaker Karan Johar recently reacted to a Delhi groom who called off wedding after the DJ played 'Channa Mereya'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-at-ex-wife-reena-duttas-house-with-girlfriend-gauri-son-junaid-2716127-2025-04-28",
      "headline": "Aamir Khan meets ex-wife Reena Dutta with partner Gauri, son JunaidActor Aamir Khan visited his former wife Reena Dutta's residence on Sunday. He was accompanied by his girlfriend Gauri Spratt and son Junaid.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-big-shot-uk-tour-postponed-after-pahalgam-attack-2716109-2025-04-28",
      "headline": "Salman Khan's Big Shot UK Tour postponed after Pahalgam attackThe Bollywood Big Shot UK Tour, featuring major stars like Salman Khan, Madhuri Dixit, and Tiger Shroff, has been postponed in light of the recent India-Pakistan tensions. Organisers have assured that new dates will be announced soon, and refunds will be provided in the meantime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-padma-bhushan-presentation-ceremony-in-new-delhi-family-arrival-2716092-2025-04-28",
      "headline": "Ajith Kumar and family arrive in Delhi for Padma Awards ceremony. WatchAjith Kumar, his wife Shalini, daughter Anoushka and son, Aadvik, were seen heading to New Delhi. The actor will receive his Padma Bhushan award on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-delhi-show-cancelled-new-schedule-to-be-finalised-soon-2716080-2025-04-28",
      "headline": "Kevin Hart's Delhi show cancelled due to Pahalgam attack, new date to be outComedian Kevin Hart's show in Delhi, scheduled for April 30, has been cancelled. The organisers are in talks with Hart's team for a new schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-3-detailed-report-emraan-hashmi-kashmir-based-film-fails-to-pick-pace-2716071-2025-04-28",
      "headline": "Ground Zero box office Day 3: Emraan Hashmi's Kashmir-based film fails to pick pace'Ground Zero' clashed with 'Kesari Chapter 2', 'Jaat' and 'Phule' at the box office, and that eventually suppressed its run. The Emraan Hashmi starrer didn't manage to attract the audience to theatres in its opening weekend. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-greets-staff-at-mumbai-airport-video-goes-viral-2716065-2025-04-28",
      "headline": "Shah Rukh Khan greets long-time staff at Mumbai airport, video goes viralShah Rukh Khan arrived in Mumbai with his manager, Pooja Dadlani. The 'Jawan' actor shook hands with a man who had been his staff for 22 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-to-slap-aurangzeb-shares-solution-to-kashmir-issue-2716059-2025-04-28",
      "headline": "Vijay Deverakonda wants to 'slap Aurangzeb', shares solution to Kashmir issueActor Vijay Deverakonda says he would like to go back in time and slap Aurangzeb. He also thinks that educating the people of Kashmir is a solution to the terrorism problem in the Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-10-detailed-report-akshay-kumar-film-shows-terrific-growth-in-2nd-weekend-2716053-2025-04-28",
      "headline": "Kesari 2 box office Day 10: Akshay Kumar's film shows terrific growth in 2nd weekend'Kesari Chapter 2' beat all other new releases during the weekend at the box office. The film collected more than what 'Ground Zero' and 'Jaat' earned. It is now looking at unlocking a new potential at the ticket window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-nani-casting-mahabharata-2716047-2025-04-28",
      "headline": "SS Rajamouli confirms actor Nani's casting in Mahabharata, his dream projectFilmmaker SS Rajamouli, at the pre-release event of 'HIT 3', stated that Nani will definitely be a part of Mahabharata. For the unaware, Mahabharata is the 'RRR' director's dream project."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atul-kulkarni-visits-pahalgam-after-terror-attack-this-is-our-kashmir-2716013-2025-04-28",
      "headline": "Actor Atul Kulkarni visits Pahalgam after attack, says 'this is our Kashmir'Actor Atul Kulkarni visits Pahalgam days after the terror attack to send out a message to the world. He urged the people to visit Pahalgam and not to be afraid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgns-father-asked-me-to-drink-own-urine-to-speed-up-recovery-paresh-rawal-2715944-2025-04-27",
      "headline": "Ajay Devgn's father asked me to drink own urine to speed up recovery: Paresh RawalActor Paresh Rawal shared a surprising remedy he followed for an injury recovery - consuming his own urine. This revelation was made during a conversation with Lallantop, a sister channel of India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-to-make-his-met-gala-debut-in-a-sabyasachi-ensemble-report-2715941-2025-04-27",
      "headline": "Shah Rukh Khan to make his Met Gala debut in a Sabyasachi ensemble: ReportAccording to reports, Bollywood icon Shah Rukh Khan is set to debut at the Met Gala 2025, donning a Sabyasachi creation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tv-actor-navina-bole-accuses-sajid-khan-of-misconduct-says-he-asked-her-to-strip-2715905-2025-04-27",
      "headline": "TV actor Navina Bole accuses Sajid Khan of misconduct, says he asked her to stripTV actor Navina Bole has come forward with allegations against filmmaker Sajid Khan, accusing him of inappropriate behaviour during a meeting. This adds to the growing list of accusations against Khan, who has been previously named in other misconduct cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/havoc-review-tom-hardy-is-the-only-saving-grace-of-gareth-evans-gore-thriller-2715896-2025-04-27",
      "headline": "Havoc review: Tom Hardy is the only saving grace in Gareth Evans' gore actionerReleased-Fri Apr 25, 2025Netflix's 'Havoc', directed by Gareth Evans, pairs Tom Hardy with a thrilling plot, but ultimately disappoints. Why? Read on and find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fleeing-romania-to-being-an-oscar-nominee-why-sebastian-stan-is-truly-a-star-2713501-2025-04-27",
      "headline": "Fleeing Romania to being an Oscar nominee: Why Sebastian Stan is truly a starActor Sebastian Stan's journey from Romania to ruling the roost in Hollywood is anything but typical. From a childhood under a strict regime to becoming a celebrated actor, Stan's story is one of resilience and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-2-emraan-hashmi-film-collects-rs-3-crorw-2715878-2025-04-27",
      "headline": "Ground Zero box office Day 2: Emraan Hashmi film picks pace, collects Rs 3 croreEmraan Hashmi's military drama 'Ground Zero' is witnessing growth at the box office despite facing competition from other Bollywood films. The film chronicles the story of BSF officer Narendra Nath Dhar Dubey's operation against terrorist mastermind Ghazi Baba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-ott-release-when-where-to-watch-john-abrahams-political-thriller-2715868-2025-04-27",
      "headline": "The Diplomat OTT release: When, where to watch John Abraham's political thriller'The Diplomat', starring John Abraham, is reportedly set to premiere on Netflix on May 9, 2025. The film delves into the intricacies of diplomacy and personal conflicts, inspired by the true story of Indian diplomat JP Singh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sinners-production-designer-hannah-bleacher-reveals-hidden-tribute-to-chadwick-boseman-2715827-2025-04-27",
      "headline": "Sinners production designer reveals hidden tribute to Chadwick BosemanIn a recent interview, 'Sinners' production designer Hannah Bleacher unveiled a subtle tribute to Chadwick Boseman embedded in the film. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/government-blocks-pakistani-youtube-channels-including-shoaib-akhtars-amid-crackdown-after-pahalgam-attack-2716088-2025-04-28",
      "headline": "Provocative: India blocks Pakistani YouTube channels amid Pahalgam crackdown Live Updates The banned platforms, which collectively have around 63 million subscribers, include major Pakistani news channels such as Dawn News, Samaa TV, ARY News, Bol News, Raftar, Geo News, and Suno News."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-writes-to-bbc-india-head-strong-sentiments-pahalgam-terror-attack-reporting-ib-ministry-watchlist-2716097-2025-04-28",
      "headline": "Government's stern message to BBC over its coverage of J&K terror attackIn an article titled 'Pakistan suspends visas for Indians after deadly Kashmir attack,' the BBC referred to the terror attack as a 'militant attack,' prompting the Narendra Modi government to write to the BBC's India head, Jackie Martin."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-live-updates-pakistan-opens-fire-along-loc-for-fourth-night-in-a-row-2716044-2025-04-28",
      "headline": "Live: Police carry out raids on properties of terrorists, their associates in J&KJammu Kashmir Pahalgam Attack Live Updates: Pakistani troops opened unprovoked fire across the Line of Control (LoC) in Jammu and Kashmir overnight, the Indian Army said on Sunday, marking the fourth consecutive ceasefire violation in recent days. Pakistan initiated unprovoked small arms fire across the LoC in areas opposite Kupwara and Poonch districts. However, the Indian forces responded \"swiftly and effectively\" to the aggression. The renewed hostilities come amid heightened tensions following the brutal terror attack in Pahalgam on April 22, where 25 tourists and a local Kashmiri were gunned down in cold blood in the popular Baisaran valley. The massacre has been described as one of the most horrific attacks in the Kashmir Valley since the abrogation of Article 370."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-airspace-close-india-flights-huge-loss-millions-overflight-fees-reroute-pahalgam-attack-2716107-2025-04-28",
      "headline": "Explained: How Pakistan could lose millions after closing airspace for IndiaPakistan's decision to close its airspace to Indian airlines, after India's diplomatic move against Pakistan over the Pahalgam terror attack, is likely to cause disruptions on several key international routes, particularly flights departing from North India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-1/",
      "headline": "A brief history of terrorism in KashmirTo trace the evolution of insurgency and terrorism, we revisit Kashmir's turbulent history from Independence through the violent 1990s, when terror dominated the narrative."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-call-india-pakistan-responsible-solution-pahalgam-terror-attack-jammu-kashmir-2716004-2025-04-28",
      "headline": "US urges India, Pak to work towards 'responsible solution' after Pahalgam attackThe US said it stands with India against terrorism after the deadly Pahalgam terror attack and urged India and Pakistan to work towards a responsible resolution."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/black-hawk-army-pilot-risky-visual-separation-move-led-to-deadly-washington-potomac-river-crash-2716039-2025-04-28",
      "headline": "Ignoring instructor, Army pilot's risky move led to deadly Washington crash: ReportCaptain Rebecca Lobach failed to follow her co-pilot and instructor Andrew Eaves's order to turn left in a bid to avoid the descending aircraft, ignoring his instructions just 15 seconds before the crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/robert-vadra-clarifies-muslims-feeling-weakened-remark-on-pahalgam-attack-words-misunderstood-2716055-2025-04-28",
      "headline": "Robert Vadra clarifies 'Muslims feeling weakened' remark on Pahalgam attackRobert Vadra clarified that his comments on Pahalgam attack were 'not fully understood in their complete context' after a row erupted over his 'Muslims feeling weakened' remark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/will-ai-take-over-your-job-it-is-complicated-2716129-2025-04-28",
      "headline": "Will AI take over your job? It's complicatedThe arrival of powerful AI tools like ChatGPT and Gemini has also brought with them existentialist dread for humans. Will the AI do the work that we currently do? The answers to this question are many and the reality probably lies somewhere between everything will change to nothing will change. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aimim-chief-asaduddin-owaisi-warns-pakistan-retaliation-warmongering-its-leaders-2715984-2025-04-28",
      "headline": "You are ISIS's successors: Asaduddin Owaisi to Pak over Pahalgam terror attackThe AIMIM Lok Sabha MP's remarks came after Pakistani Minister Hanif Abbasi openly threatened India with nuclear retaliation in response to India suspending the Indus Waters Treaty after the Pahalgam terrorist attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-france-sign-rafale-marine-jet-deal-maritime-security-2716121-2025-04-28",
      "headline": "India, France to ink Rs 63,000 crore deal for advanced Rafale-M jets todayIndia and France will sign a Rs 63,000 crore deal today for 26 Rafale-M jets for the Indian Navy, boosting maritime strength and deepening defence ties. Deliveries are expected between 2029 and 2031.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-cheetah-toll-increases-madhya-pradesh-kuno-national-park-mohan-yadav-2716058-2025-04-28",
      "headline": "Cheetah Nirva gives birth to 5 cubs, Kuno's big cat count rises to 29Cheetah Nirva at Kuno National Park gave birth to five cubs, boosting India's population of the spotted big cats to 31. Madhya Pradesh Chief Minister Mohan Yadav and Union Minister for the Environment Bhupender Yadav shared the news on X.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-highest-scores-prasidh-krishna-saliva-ball-2716114-2025-04-28",
      "headline": "It's a chain reaction: Prasidh explains how saliva is impacting playGujarat Titans fast bowler Prasidh Krishna has said that the saliva is having huge impact in the death overs of IPL 2025. Prasidh explained that the use of saliva is creating a chain reaction in the final overs of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/ncert-class-7-books-drop-mughals-delhi-sultanate-introduce-maha-kumbh-chapter-2716120-2025-04-28",
      "headline": "No Mughals or Delhi Sultans: NCERT revamps Class 7 Social Science books againNCERT has dropped chapters on the Mughals and Delhi Sultanate from Class 7 Social Science textbooks completely, introducing new content on ancient Indian dynasties, Maha Kumbh, and sacred pilgrimage sites instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-sensex-nifty-rising-today-check-top-factors-dalal-street-rally-2716082-2025-04-28",
      "headline": "Sensex gains over 800 points. 3 reasons behind stock market rallyStock market today: At around 10:15 am, the S&P BSE Sensex was trading 849.30 points higher at 80,061.83, while the NSE Nifty50 rose 237.10 points to 24,276.45. All broader market indices were also firmly in positive territory, signalling the potential for a strong session ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-udit-raj-questions-shashi-tharoor-after-slammed-bilawal-bhutto-pahalgam-attack-2715983-2025-04-28",
      "headline": "Is he BJP spokesperson? Congress leader on Shashi Tharoor slamming Bilawal BhuttoCongress leader Udit Raj seemed to be indicating that Shashi Tharoor deviated from the party line over the Pahalgam attack, where it had questioned the security lapses and intelligence failures on the government's part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-rs-60-lakh-household-income-middle-class-questions-living-in-india-quality-of-life-2716108-2025-04-28",
      "headline": "Bengaluru man with Rs 60 lakh income questions living in India over quality of lifeIn his Reddit post titled \"Is India ever going to change? Or should I just leave already?\", the Bengaluru man said that he resides in Horemavu and described himself as \"married, with a working wife, middle class, and a household income of approximately Rs 60 lakh.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/case-bhojpuri-singer-neha-singh-rathore-criticising-government-pahalgam-terrorist-attack-2715976-2025-04-28",
      "headline": "Sedition case against Bhojpuri singer for criticising government over J&K attackThe FIR was filed against Neha after an X handle, run by a Pakistani journalists' group, reposted her video in which she claimed that PM Modi will now be seeking votes in Bihar in the name of the Pahalgam attack victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-votes-today-economic-woes-trump-threats-to-dominate-showdown-2716032-2025-04-28",
      "headline": "Canada votes today: Economic woes, Trump threats to dominate showdownThe snap election, called just weeks after Mark Carney replaced Justin Trudeau as Liberal Party leader and prime minister, comes against a backdrop of economic anxiety, surging costs of living, immigration debates, and an escalating trade conflict with US President Donald Trump."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mangaluru-karnataka-janivara-sacred-thread-issue-railway-nursing-exam-admit-card-bans-mangalsutra-2716068-2025-04-28",
      "headline": "Railways' exam rule on mangalsutra, sacred thread stirs fresh row in KarnatakaFresh controversy erupted after candidates for the Railway department's Nursing Superintendent exam were instructed to remove religious symbols, such as the mangalsutra and janivara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-nani-casting-mahabharata-2716047-2025-04-28",
      "headline": "SS Rajamouli confirms actor Nani's casting in Mahabharata, his dream projectFilmmaker SS Rajamouli, at the pre-release event of 'HIT 3', stated that Nani will definitely be a part of Mahabharata. For the unaware, Mahabharata is the 'RRR' director's dream project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-to-slap-aurangzeb-shares-solution-to-kashmir-issue-2716059-2025-04-28",
      "headline": "Vijay Deverakonda wants to 'slap Aurangzeb', shares solution to Kashmir issueActor Vijay Deverakonda says he would like to go back in time and slap Aurangzeb. He also thinks that educating the people of Kashmir is a solution to the terrorism problem in the Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-ias-officer-smita-sabharwal-transferred-among-administration-reshuffle-2716101-2025-04-28",
      "headline": "Telangana transfers IAS officer who reshared Kancha Gachibowli land row AI imageTelangana government transferred 20 IAS officers, including Smita Sabharwal, amid controversy over her social media post on the Kancha Gachibowli land dispute. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/jnu-elections-left-holds-jnu-fort-abvp-breaks-through-with-1st-central-panel-post-in-9-years-2716074-2025-04-28",
      "headline": "Left holds JNU fort, ABVP breaks through with 1st central panel post in 9 yearsAccording to results announced on Monday by the JNUSU election commission, Nitish Kumar of the All India Students' Association (AISA) was elected president with 1,702 votes, defeating ABVP's Shikha Swaraj, who secured 1,430 votes. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-vs-rajasthan-royals-press-conference-2716122-2025-04-28",
      "headline": "Death overs batting has not been easy in IPL 2025: Shahrukh KhanGujarat Titans batter Shahrukh Khan has said that batting in the death overs has not been easy in IPL 2025. The cricketer has explained that hitting the dry ball has been very difficult this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/prasidh-krishna-talks-about-the-art-of-death-bowling-in-ipl-2025-2716118-2025-04-28",
      "headline": "Prasidh Krishna talks about the art of death bowling in IPL 2025Fast bowler Prasidh Krishna has spoken about the art of death bowling in the Indian Premier League. Prasidh explained that the use of saliva has having a big impact in the final overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mayank-yadav-is-just-another-bowler-for-me-to-face-says-naman-dhir-2716115-2025-04-28",
      "headline": "Mayank Yadav is just another bowler for me to face: Naman DhirMumbai Indians (MI) all-rounder Naman Dhir downplayed the threat of Mayank Yadav during his quick-fire cameo against Lucknow Super Giants (LSG). The right-handed batter scored an unbeaten 25* (11) to help MI post a massive score of 215/7 in their 20 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-highest-scores-prasidh-krishna-saliva-ball-2716114-2025-04-28",
      "headline": "It's a chain reaction: Prasidh explains how saliva is impacting playGujarat Titans fast bowler Prasidh Krishna has said that the saliva is having huge impact in the death overs of IPL 2025. Prasidh explained that the use of saliva is creating a chain reaction in the final overs of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rajasthan-royals-bowling-coach-shane-bond-on-his-teams-performance-2716100-2025-04-28",
      "headline": "We've got into positions to win, just haven't been good enough: RR bowling coachRajasthan Royals (RR) bowling coach Shane Bond has reflected on his team's close losses in the Indian Premier League 2025 (IPL 2025) and said that they haven't been good enough at winning matches after being in a good position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shane-bond-rues-not-seizing-key-moments-rr-vs-gt-2716087-2025-04-28",
      "headline": "Shane Bond rues not seizing 'key moments' as RR aim for good finish to the seasonRajasthan Royals (RR) fast bowling coach Shane Bond rued not being able to seize key moments throughout their Indian Premier League 2025 (IPL 2025) campaign ahead of their fixture against Gujarat Titans (GT). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-proves-his-worth-in-stellar-stint-with-rcb-2716057-2025-04-28",
      "headline": "IPL 2025: Underrated Krunal Pandya proves his worth in stellar stint with RCBIPL 2025: While Krunal Pandya flaunted his batting resurgence in RCB's win over Delhi Capitals on Sunday, he has bowled with greater freedom and purpose for his new side. At RCB, the veteran all-rounder is playing with a clear sense of belonging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/conditions-and-toss-just-didnt-play-in-our-favor-kevin-pietersen-after-loss-vs-rcb-2716054-2025-04-28",
      "headline": "Conditions and toss just didn't play in our favour: Kevin Pietersen after loss vs RCBDelhi Capitals (DC) mentor Kevin Pietersen felt that the conditions and the toss didn't favour his team against Royal Challengers Bengaluru (RCB)as they lost the match by six wickets at the Arun Jaitley Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-director-of-cricket-mo-bobat-on-bowling-performance-dc-vs-rcb-2716045-2025-04-28",
      "headline": "We bowled really well and consistently put pressure on DC batters: RCB DirectorRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat praised their all-round bowling performance against Delhi Capitals (DC), which helped them restrict DC to 162. RCB managed to win the match by six wickets and climb to the top of the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-director-mo-bobat-praises-krunal-pandya-dc-vs-rcb-2716033-2025-04-28",
      "headline": "RCB Director praises 'tactical' Krunal Pandya after match-winning show vs DCRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat was full of praise for Krunal Pandya following his match-winning all-round performance against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shane-bond-rues-not-seizing-key-moments-rr-vs-gt-2716087-2025-04-28",
      "headline": "Shane Bond rues not seizing 'key moments' as RR aim for good finish to the seasonRajasthan Royals (RR) fast bowling coach Shane Bond rued not being able to seize key moments throughout their Indian Premier League 2025 (IPL 2025) campaign ahead of their fixture against Gujarat Titans (GT). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-proves-his-worth-in-stellar-stint-with-rcb-2716057-2025-04-28",
      "headline": "IPL 2025: Underrated Krunal Pandya proves his worth in stellar stint with RCBIPL 2025: While Krunal Pandya flaunted his batting resurgence in RCB's win over Delhi Capitals on Sunday, he has bowled with greater freedom and purpose for his new side. At RCB, the veteran all-rounder is playing with a clear sense of belonging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/conditions-and-toss-just-didnt-play-in-our-favor-kevin-pietersen-after-loss-vs-rcb-2716054-2025-04-28",
      "headline": "Conditions and toss just didn't play in our favour: Kevin Pietersen after loss vs RCBDelhi Capitals (DC) mentor Kevin Pietersen felt that the conditions and the toss didn't favour his team against Royal Challengers Bengaluru (RCB)as they lost the match by six wickets at the Arun Jaitley Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-director-of-cricket-mo-bobat-on-bowling-performance-dc-vs-rcb-2716045-2025-04-28",
      "headline": "We bowled really well and consistently put pressure on DC batters: RCB DirectorRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat praised their all-round bowling performance against Delhi Capitals (DC), which helped them restrict DC to 162. RCB managed to win the match by six wickets and climb to the top of the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-director-mo-bobat-praises-krunal-pandya-dc-vs-rcb-2716033-2025-04-28",
      "headline": "RCB Director praises 'tactical' Krunal Pandya after match-winning show vs DCRoyal Challengers Bengaluru (RCB) Director of cricket Mo Bobat was full of praise for Krunal Pandya following his match-winning all-round performance against Delhi Capitals (DC). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}