{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Turkey's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-leena-gandhi-tewari-the-suv-chairperson-who-bought-india-costliest-flats-2733045-2025-05-30",
      "headline": "Meet Leena Tewari, the USV chairperson who bought India's costliest flatsLeena is the chairperson of USV, a Mumbai-based pharmaceutical company, which was started by her late father, Vithal Gandhi, in partnership with Revlon in 1961. Forbes estimates Leena's net worth at $3.9 billion, as of May 30, 2025, making her one of India's richest women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-maria-goretti-sebi-ban-1-year-why-reasons-shares-sadhna-broadcast-limited-sbl-2733005-2025-05-30",
      "headline": "Explained: Why Arshad Warsi, wife Maria Goretti were banned by Sebi for 1 yearArshad Warsi and Maria Goretti bought shares of Sadhna Broadcast Limited (now known as Crystal Business System Ltd) from other individuals who were also named in the Sebi order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donaldtrump-tariff-tsunami-impact-on-global-economy-explained-2733001-2025-05-30",
      "headline": "How Trump's tariff tsunami is reshaping global economyIn just over four months, Trump's flurry of trade actions, alternating between shock-and-awe tariffs and strategic pauses, has upended conventional expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-form-16-here-is-when-will-you-get-it-and-what-to-check-itr-filing-2025-2732994-2025-05-30",
      "headline": "Waiting for Form 16? Here's when will you get it and what to checkEmployers are required to issue Form 16 to employees if they've deducted TDS from their salary. It consists of two parts and shows how much salary was paid and how much tax was deducted during the year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-wife-maria-goretti-sebi-ban-57-others-stock-manipulation-case-sadhna-broadcast-ltd-2732975-2025-05-30",
      "headline": "Arshad Warsi, his wife, among 59 people banned from stock market for 1 yearSebi said the group was part of a scheme to artificially raise the price of Sadhna Broadcast shares before selling them to unsuspecting retail investors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-buys-back-masters-first-six-albums-shamrock-capital-deal-2733368-2025-05-30",
      "headline": "You belong with me: Taylor Swift buys back rights to her first 6 albumsTaylor Swift has repurchased the master recordings of her first six albums. This move restores her ownership and highlights artists' rights in the music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-reacts-to-bushra-ansari-comment-shabana-azmi-and-i-sleeping-on-streets-2733310-2025-05-30",
      "headline": "Shabana and I've been sleeping on streets: Javed Akhtar reacts to Pak actor's remarkJaved Akhtar replied strongly to Pakistani actor Bushra Ansari's comments about him not getting a house to rent. He said she has no right to tell him to stay quiet and proudly said he is Indian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-sister-midnight-film-release-uncut-india-2733296-2025-05-30",
      "headline": "Radhika Apte hopes Sister Midnight releases uncut in IndiaActor Radhika Apte discusses her daring new film Sister Midnight and its journey to an Indian release, hoping it will be shown uncut despite censorship concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-shares-his-success-mantra-saying-no-to-work-yes-to-family-2733276-2025-05-30",
      "headline": "Saif Ali Khan shares his success mantra: Saying no to work, yes to familySaif Ali Khan shared that true success, for him, means choosing family time over work commitments. He said small moments with loved one's matter more than professional achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-to-make-hollywood-debut-with-kevin-spacey-holiguards-2733287-2025-05-30",
      "headline": "Disha Patani to make Hollywood debut with Kevin Spacey's HoliguardsActor Disha Patani is set to make her Hollywood debut with Kevin Spacey's upcoming film 'Holiguards'. The film is extensively shot in Mexico."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-controversy-south-indian-artistes-association-support-karnataka-backlash-unity-2733257-2025-05-30",
      "headline": "South Indian Artistes Association backs Kamal Haasan amid language rowThe South Indian Artistes Association has strongly supported Kamal Haasan amid the recent backlash in Karnataka. The statement warns that misrepresenting Kamal could harm cinema's cultural unity and public discourse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-and-vishwaroopam-tale-of-two-bans-and-kamal-haasans-defiance-2733233-2025-05-30",
      "headline": "Thug Life and Vishwaroopam: Tale of two bans and Kamal Haasan's defianceKamal Haasan's upcoming film, 'Thug Life', directed by Mani Ratnam, has been banned in Karnataka. Twelve years ago, another film of the actor, 'Vishwaroopam', was also banned. Both times, Haasan remained unfazed. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-bella-hadid-introduce-23-year-old-half-sister-aydan-nix-2733221-2025-05-30",
      "headline": "Gigi and Bella Hadid introduce their 23-year-old half sister, Aydan NixSupermodel sisters, Gigi Hadid and Bella Hadid, have introduced their 23-year-old half-sister, Aydan Nix, who they connected with in 2023 after a surprise DNA test. Raised in Florida, Aydan is now pursuing a career in fashion after graduating from Parsons School of Design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/criminal-justice-season-4-review-stellar-pankaj-tripathi-cross-examines-average-legal-drama-2733216-2025-05-30",
      "headline": "Criminal Justice 4 review: Stellar Pankaj Tripathi cross-examines average legal dramaReleased-Fri May 30, 2025In 'Criminal Justice Season 4', actor Pankaj Tripathi tries to hold the court in a murder case, but how much can he do alone? The story looks engaging in parts, but not fully convincing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-fan-enters-theatre-with-snake-during-khaleja-re-release-2733214-2025-05-30",
      "headline": "Mahesh Babu fan enters theatre with snake during Khaleja re-releaseA Mahesh Babu fan carried a live snake to theatres in Vijayawada as the actor's film 'Khaleja' re-released in theatres. A video of the incident has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/hybe-chairman-bang-si-hyuk-investigated-fraudulent-trading-bts-comeback-2733100-2025-05-30",
      "headline": "Hybe chairman investigated for alleged fraud before BTS comebackHybe chairman Bang Si-hyuk is under investigation for alleged fraudulent trading during the company's pre-IPO phase. The probe intensifies scrutiny as BTS prepares for its highly anticipated comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bhairavam-review-typical-good-old-school-telugu-commercial-entertainer-2733142-2025-05-30",
      "headline": "Bhairavam review: A typical but good old-school Telugu commercial entertainerReleased-Fri May 30, 2025Bhairavam movie review: This Telugu family drama directed by Vijay Kanakamedala stars Manoj Manchu, Bellamkonda Sai Srinivas and Nara Rohith in the lead. The film packs a good emotional punch despite the template story, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kankhajura-review-mohit-raina-roshan-matthews-thriller-strong-performances-weak-ending-2733144-2025-05-30",
      "headline": "Kankhajura review: Mohit-Roshan's thriller grips early but falters in climaxReleased-Fri May 30, 2025Kankhajura series review: 'Kankhajura' is a psychological thriller on SonyLiv that explores family tension and emotional manipulation. Despite strong performances, the series falters with a rushed and less impactful ending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-gorgeous-bridesmaid-in-black-for-friend-white-wedding-in-spain-2733169-2025-05-30",
      "headline": "Alia Bhatt is a gorgeous bridesmaid in black for friend's white wedding in SpainActor Alia Bhatt radiated charm in a black outfit at her friend's white wedding in Spain. The pictures of her with the other bridesmaids have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-to-do-singam-4-with-hari-jyotika-now-deleted-photo-rumours-2733078-2025-05-30",
      "headline": "Actor Suriya to do Singam 4 next? Jyotika's now-deleted photo sparks rumoursJyotika shared a photo of Suriya in what appears to resemble his 'Singam' look from her daughter's graduation day. However, she quickly deleted the photo. Now, it has fuelled speculation about the actor's possible collaboration with director Hari for 'Singam 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-gives-off-boss-lady-vibes-in-new-photos-from-cannes-2025-2732961-2025-05-30",
      "headline": "Aishwarya Rai Bachchan gives off boss-lady vibes in new photos from Cannes 2025Aishwarya Rai Bachchan stunned in new photos from Cannes 2025. She gave powerful boss-lady vibes in a chic mauve pantsuit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-trailer-karan-johar-20-contestants-captive-reality-show-2733082-2025-05-30",
      "headline": "The Traitors trailer: KJo brings 20 contestants to compete in a high-voltage gameKaran Johar is set to host a new reality show 'The Traitors', premiering on Prime Video on June 12. Featuring 20 celebrities, the trailer promises intense drama, mind games, and thrilling twists.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-banned-karnataka-kannada-language-row-2733089-2025-05-30",
      "headline": "Kamal Haasan's Thug Life banned in Karnataka amid Kannada language rowActor Kamal Haasan's upcoming film, 'Thug Life', has been banned by the Karnataka Film Chamber. This move came after the actor's 'Kannada is born out of Tamil' comment at the film's audio launch in Chennai on May 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/raj-kundra-jokes-about-using-nepo-husband-card-on-the-traitors-watch-2733074-2025-05-30",
      "headline": "Raj Kundra jokes about using nepo-husband card on The Traitors. WatchAt the trailer launch of The Traitors, Raj Kundra reflected on how public perception of his masked appearances might play to his advantage on the reality show. \"Whenever I've worn a mask, people have wondered what I'm hiding. That mystery might help me in this game,\" he said. Calling The Traitors a show of deception and strategy, Kundra added with a laugh that he might even use the \"nepo husband\" card, since the show is hosted by his brother-in-law, Karan Kundrra."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-worked-tirelessly-to-help-lead-most-sweeping-consequential-government-reform-program-trump-2733416-2025-05-30",
      "headline": "Trump praises Musk's 'very great talents' during White House send-offDuring the press event, Trump praised Musk's dedication, stating, \"Elon Musk has worked tirelessly.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Turkey's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/so-much-for-being-mr-nice-guy-us-president-donald-trump-claims-china-violated-trade-deal-with-us-2733300-2025-05-30",
      "headline": "So much for being Mr Nice Guy: Trump claims China violated trade deal with USTrump claimed that by sealing a trade deal with Beijing in order to save China from what was going to be a very bad situation after he imposed unprecedented 145 per cent tariffs on imports from Asia's largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-8",
      "headline": "Operation Sindoor: When Indian missiles rained on Pak terror paradeIn the concluding part of our 'A Brief History of Terrorism in Kashmir' series, we revisit India's bold strikes on Pakistan after the Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-supreme-court-allows-donald-trump-revoke-temporary-legal-status-of-migrants-2733348-2025-05-30",
      "headline": "US Supreme Court allows Trump to revoke legal status of over 5 lakh migrantsThe decision of the court will bolster US President Donald Trump's drive to step up deportations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-will-never-accept-india-hegemony-in-region-says-field-marshal-asim-munir-indus-water-treaty-balochistan-pahalgam-attack-2733245-2025-05-30",
      "headline": "Pakistan will never accept India's hegemony: Army chief MunirPakistan Army chief Field Marshal Asim Munir said Islamabad would never accept Indian dominance in the South Asian region and termed the suspension of the Indus Water Treaty a \"red line\" for Pakistan. Munir also accused India of backing Baloch rebels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/indus-waters-treaty-india-paid-pakistan-water-scarcity-dams-canals-contribution-money-world-bank-deal-history-war-2733068-2025-05-30",
      "headline": "Not just water, money too flowed from India to Pakistan as part of Indus treatyFor a treaty hailed globally as a triumph of water diplomacy, India paid not just in rivers, but in rupees, following the Indus Waters Treaty (IWT) with Pakistan of 1960. Behind the Indus treaty lies the lesser-known story of how India bankrolled Pakistan's water infrastructure, only to be repaid with hostility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-and-vishwaroopam-tale-of-two-bans-and-kamal-haasans-defiance-2733233-2025-05-30",
      "headline": "Thug Life and Vishwaroopam: Tale of two bans and Kamal Haasan's defianceKamal Haasan's upcoming film, 'Thug Life', directed by Mani Ratnam, has been banned in Karnataka. Twelve years ago, another film of the actor, 'Vishwaroopam', was also banned. Both times, Haasan remained unfazed. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shashi-tharoor-colombia-pro-pakistan-stand-operation-sindoor-china-link-2733075-2025-05-30",
      "headline": "Colombia surprised Tharoor. Does its pro-Pak stance have China link?Colombia has expressed condolences over the loss of lives (read terrorists) in Pakistan after India's Operation Sindoor. It left Shashi Tharoor, who visited the country for global outreach, disappointed. Is there a China link to Colombia's pro-Pakistan stance?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/criminal-justice-season-4-review-stellar-pankaj-tripathi-cross-examines-average-legal-drama-2733216-2025-05-30",
      "headline": "Criminal Justice 4 review: Stellar Pankaj Tripathi cross-examines average legal dramaReleased-Fri May 30, 2025In 'Criminal Justice Season 4', actor Pankaj Tripathi tries to hold the court in a murder case, but how much can he do alone? The story looks engaging in parts, but not fully convincing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-buys-back-masters-first-six-albums-shamrock-capital-deal-2733368-2025-05-30",
      "headline": "You belong with me: Taylor Swift buys back rights to her first 6 albumsTaylor Swift has repurchased the master recordings of her first six albums. This move restores her ownership and highlights artists' rights in the music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/nagaur-twins-score-identical-9717-in-rajasthan-class-10-board-result-2733159-2025-05-30",
      "headline": "Rajasthan twins score identical 97.17% in Class 10 board resultIn what can only be described as an extraordinary coincidence, twin sisters Kanishka and Kartika Chaudhary, who've shared not just a birthday but also books, dreams, and late-night study sessions, have now added another identical milestone to their journey—scoring exactly 97.17% each in Rajasthan's Class 10 board exams.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-quash-fir-man-rape-case-calls-allegations-fabricated-malicious-2733256-2025-05-30",
      "headline": "NRI withdrew marriage proposal over woman's obsessive conduct: Court in rape caseThe Supreme Court said that the FIR was nothing but a bundle of lies, and was full of \"fabricated, malicious and unsubstantiated allegations\" levelled by the complainant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-pause-on-visa-interviews-worries-indian-students-expert-says-relief-soon-student-visas-trump-rubio-educational-consultant-2733140-2025-05-30",
      "headline": "US pause on visa interviews worries Indian students, expert says relief soonThe US has paused visa interview scheduling for international students, creating uncertainty amongst students globally, especially in India, which makes up the biggest cohort of international students in the US. However, Viral Doshi, an educational consultant, suggests that once the US's social media guidance for vetting international students is updated, it will prioritise students who need to start their academic year in August or September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/2026-kia-ev9-unveiled-gets-enhanced-range-and-a-new-edition-2733268-2025-05-30",
      "headline": "2026 Kia EV9 unveiled, gets enhanced range and a new editionKia has unveiled the 2026 EV9 in the US with improved range, new features, and a new Nightfall Edition, enhancing the performance and styling of its flagship electric SUV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/get-rich-india-economy-superpower-military-pm-modi-manmohan-singh-nehru-gdp-fdi-pakistan-china-2732660-2025-05-30",
      "headline": "Get rich fast or die trying: India's choice is a no-brainerFor India that aspires to be powerful, it has to become filthy rich. Money can't buy you love, but it can buy aircraft carriers and friends. For the money, India needs reforms, and PM Modi will have to channel his inner Manmohan Singh, and not the inner Nehru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-bsf-women-defended-border-posts-akhnoor-jammu-and-kashmir-india-pakistan-war-shelling-2733055-2025-05-30",
      "headline": "Given choice to retreat amid Pak shelling, 7 BSF women sent enemy runningSeven BSF women defended two forward posts for three days in the Akhnoor Sector of Jammu and Kashmir amid intense shelling by Pakistan during Operation Sindoor. The all-woman team, led by Assistant Commandant Neha Bhandari, were offered the option to withdraw. However, they not only defended the posts but sent Pakistani soldiers fleeing for their lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vivek-ramaswamy-anniversary-post-wife-racist-backlash-go-back-to-india-2732967-2025-05-30",
      "headline": "'Should be deported': Vivek Ramaswamy's anniversary post faces racist backlashIndian-origin Republican leader Vivek Ramaswamy's anniversary post was bombarded with racist and anti-immigrant comments by X users over his views on the H-1B visa programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gave-enemy-sleepless-nights-pm-modis-op-sindoor-shoutout-to-brahmos-at-kanpur-event-2733143-2025-05-30",
      "headline": "Gave enemy sleepless nights: PM's Op Sindoor shoutout to BrahMosPM Modi spoke about India's growing defence manufacturing power, especially in Uttar Pradesh. He said the BrahMos missile that gave sleepless nights to the enemy during Operation Sindoor has its new address in Uttar Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/deportation-fears-rejections-how-indian-students-can-stay-ahead-amid-us-visa-jitters-2733097-2025-05-30",
      "headline": "Deportation fears, rejections: How Indian students can stay ahead amid US visa jittersStudents are advised to maintain vigilance, academic discipline, a clean digital footprint, and a well-thought-out Plan B that includes Europe and the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cholesterol-risks-india-bad-ldl-lipoprotein-a-testing-advanced-heart-therapies-2733219-2025-05-30",
      "headline": "Cholesterol isn't always the enemy, but ignoring it can be deadlyCholesterol management in India is often misunderstood, risking silent heart and brain health issues."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-jasprit-bumrah-ipl-2025-eliminator-sai-sudharsan-gt-vs-mi-match-report-2733418-2025-05-30",
      "headline": "Rohit, Bumrah specials knock Gujarat out as Mumbai keep IPL final hopes aliveMumbai Indians stormed into the Qualifier 2 of the Indian Premier League with a thrilling 20-run victory over Gujarat Titans. Two special performances from Rohit Sharma and Jasprit Bumrah highlighted the team's performance on the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-century-india-a-409-for-3-against-england-lions-day-1-2733419-2025-05-30",
      "headline": "Karun Nair 186 not out highlights India A's dominant batting show vs England LionsKarun Nair scored a commanding century as India A piled up 409 for 3 against England Lions on Day 1 in Canterbury. Sarfaraz Khan missed a century by eight runs while Dhruv Jurel joined the party in the third session on Friday, May 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-kusal-mendis-hit-wicket-video-2733390-2025-05-30",
      "headline": "Dropped catches, bizarre hit-wicket: Kusal Mendis infuriates fans in GT vs MIKusal Mendis had a terrible outing against Mumbai Indians in the IPL Eliminator vs Mumbai Indians. Not only did Kusal drop catches, but he also fell to a bizarre dismissal on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/asian-athletics-championships-pooja-high-jump-interview-sack-training-2733384-2025-05-30",
      "headline": "Golden girl Pooja trained on sacks of husk, leapt to Asian glory with torn shoes18-year-old Pooja, who once trained on sacks of husk in her village, wasn't fazed by torn shoes. She soared to a gold medal in the high jump at the Asian Athletics Championships in Gumi, South Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-sign-jeremie-frimpong-bayer-leverkusen-trent-alexander-arnold-exit-2733375-2025-05-30",
      "headline": "Liverpool replace Trent Alexander-Arnold with Bayer right-back Jeremie FrimpongPremier League champions Liverpool have confirmed the signing of Jeremie Frimpong from Bayer Leverkusen. The deal was announced after Trent Alexander-Arnold's move to Real Madrid was confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gt-vs-mi-rohit-sharma-300-sixes-7000-runs-ipl-81-eliminator-2733354-2025-05-30",
      "headline": "Rohit Sharma breaks multiple records in Eliminator: 7000 runs, 300 IPL sixesMumbai Indians great Rohit Sharma became the first Indian to hit 300 sixes and only the second batter to complete 7000 runs in IPL history. Rohit reached both milestones in the IPL Eliminator against Gujarat Titans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lions-karun-nair-century-test-series-canterbury-2733347-2025-05-30",
      "headline": "Karun Nair hits classy century vs England Lions, puts hand up for Test spotKarun Nair scored a brilliant century on Day 1 of India A's four-day match against England Lions. The Delhi Capitals batter has put his hand up for a spot in the Test XI when India take on England in a five-Test series, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-eliminator-rohit-sharma-fifty-virat-kohli-fails-2733324-2025-05-30",
      "headline": "Rohit rides his luck to fifty day after Kohli fails in IPL playoffsIPL 2025: Rohit Sharma hit a rapid 28-ball fifty in the IPL Eliminator against Gujarat Titans on Friday. Rohit, who was dropped twice early in his innings, made the best of his luck in Mullanpur Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gt-vs-mi-sai-sudharsan-relay-catch-jonny-bairstow-ipl-eliminator-2733320-2025-05-30",
      "headline": "IPL Eliminator: Sai Sudharsan turns goalkeeper in sensational relay catch vs MIGujarat Titans star Sai Sudharsan produced a stunning piece of fielding to remove Mumbai Indians opener Jonny Bairstow in the IPL Eliminator in Mullanpur on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahendra-singh-dhoni-ranchi-fishing-csk-ipl-2025-bottom-finish-2733307-2025-05-30",
      "headline": "MS Dhoni back in Ranchi, enjoys fishing after CSK's disappointing IPL seasonChennai Super Kings (CSK) captain MS Dhoni was seen enjoying a fishing session in Ranchi after returning home following the five-time champions' early exit from the IPL 2025 season. A photo that surfaced on social media shows Dhoni holding a fish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-says-forbidden-rcb-phrase-team-reaches-ipl-final-2733295-2025-05-30",
      "headline": "After RCB reach final, De Villiers breaks Ee Saala Cup Namde promise to ViratAB de Villiers admitted to uttering the forbidden RCB phrase 'Ee Saala Cup Namde' despite Virat Kohli's warning. RCB reached the IPL final after nine years, raising hopes of ending the elusive wait for title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lions-karun-nair-century-test-series-canterbury-2733347-2025-05-30",
      "headline": "Karun Nair hits classy century vs England Lions, puts hand up for Test spotKarun Nair scored a brilliant century on Day 1 of India A's four-day match against England Lions. The Delhi Capitals batter has put his hand up for a spot in the Test XI when India take on England in a five-Test series, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-eliminator-rohit-sharma-fifty-virat-kohli-fails-2733324-2025-05-30",
      "headline": "Rohit rides his luck to fifty day after Kohli fails in IPL playoffsIPL 2025: Rohit Sharma hit a rapid 28-ball fifty in the IPL Eliminator against Gujarat Titans on Friday. Rohit, who was dropped twice early in his innings, made the best of his luck in Mullanpur Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gt-vs-mi-sai-sudharsan-relay-catch-jonny-bairstow-ipl-eliminator-2733320-2025-05-30",
      "headline": "IPL Eliminator: Sai Sudharsan turns goalkeeper in sensational relay catch vs MIGujarat Titans star Sai Sudharsan produced a stunning piece of fielding to remove Mumbai Indians opener Jonny Bairstow in the IPL Eliminator in Mullanpur on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahendra-singh-dhoni-ranchi-fishing-csk-ipl-2025-bottom-finish-2733307-2025-05-30",
      "headline": "MS Dhoni back in Ranchi, enjoys fishing after CSK's disappointing IPL seasonChennai Super Kings (CSK) captain MS Dhoni was seen enjoying a fishing session in Ranchi after returning home following the five-time champions' early exit from the IPL 2025 season. A photo that surfaced on social media shows Dhoni holding a fish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-says-forbidden-rcb-phrase-team-reaches-ipl-final-2733295-2025-05-30",
      "headline": "After RCB reach final, De Villiers breaks Ee Saala Cup Namde promise to ViratAB de Villiers admitted to uttering the forbidden RCB phrase 'Ee Saala Cup Namde' despite Virat Kohli's warning. RCB reached the IPL final after nine years, raising hopes of ending the elusive wait for title. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}