{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-check-latest-gmp-subscription-status-allotment-expected-listing-gain-2607230-2024-09-27",
      "headline": "KRN Heat Exchanger IPO: Check latest GMP, subscription status, other detailsKRN Heat Exchanger opened for subscription on September 25 looking to raise Rs 341.95 crore from its public issue, and has already seen bids of over 80 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-wipro-it-stocks-rally-4-percent-accenture-fy25-guidance-boost-2607196-2024-09-27",
      "headline": "Accenture guidance boost lifts Infosys, Wipro; IT stocks rally up to 4%Accenture not only exceeded market expectations for its Q4 results but also raised its revenue guidance for FY25 to a range of 3-6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-record-high-for-6th-straight-session-2607157-2024-09-27",
      "headline": "Sensex, Nifty hit record high for 6th straight sessionThe S&P BSE Sensex added 67.47 points to 85,903.59, while the NSE Nifty50 gained 14.70 points to 26,230.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-shares-cross-rs-500-mark-after-gaining-5-more-gains-ahead-2606881-2024-09-26",
      "headline": "Vedanta shares cross Rs 500 mark after gaining 5%. More gains ahead?Vedanta's performance in 2024 has been impressive, with the stock climbing 95% so far this year and gaining 124.35% over the last 12 months. Over a five-year period, the stock has risen by 202%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-all-time-high-market-rally-metal-auto-stocks-2606880-2024-09-26",
      "headline": "Sensex, Nifty close at all-time high led by rally in auto and metal stocksThe S&P BSE Sensex added 666.25 points to end at 85,836.12, while the NSE Nifty50 gained 211.90 points to close at 26,216.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-steel-share-price-gains-five-session-expert-views-buy-hold-or-sell-2606867-2024-09-26",
      "headline": "Tata Steel shares gain for 5th straight session. What should investors do?In the past year, Tata Steel has rallied 28%, with an 18% gain so far in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-shares-surge-to-record-high-on-citis-buy-call-check-details-2606794-2024-09-26",
      "headline": "Trent shares surge to record high on Citi's 'buy' call. Check detailsCiti set a target price of Rs 9,250 for the stock, signaling a 21% upside from the previous closing price, and added it to its Pan-Asia high-conviction focus list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-conclave-puneet-chhatwal-eyes-top-3-spot-for-taj-hotels-in-global-hospitality-2606774-2024-09-26",
      "headline": "Puneet Chhatwal eyes top 3 spot for Taj Hotels in global hospitalityHe envisions the brand securing its place among the top three global hospitality companies in the next five years, a goal driven by Taj's ethos of service, adaptability to changing luxury trends, and a commitment to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radhika-gupta-edelweiss-mutual-fund-dal-chawal-investment-portfolio-2606746-2024-09-26",
      "headline": "80% of your portfolio should be 'Dal-Chawal': Radhika Gupta's investment mantraRadhika Gupta's message focused on the importance of disciplined, long-term investing—what she calls \"Dal-Chawal Investing\"—a simple and sustainable approach she believes will help investors navigate the market's highs and lows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-ipo-opens-review-price-band-gmp-should-you-subcribe-good-bad-2606728-2024-09-26",
      "headline": "Diffusion Engineers IPO opens for subscription: Should you subcribe?The price band for the IPO has been set between Rs 159 and Rs 168 per share. Investors can apply for a minimum lot of 88 shares, requiring a retail investment of Rs 14,784."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-allotment-check-status-online-guide-listing-gain-gmp-today-subscription-2606695-2024-09-26",
      "headline": "Manba Finance IPO allotment: Check status, expected listing gain, subscriptionManba Finance IPO opened for subscription on September 23 and ran until September 25, generating huge bids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motors-ipo-details-market-valuation-nomura-maruti-suzuki-2606690-2024-09-26",
      "headline": "Hyundai Motors IPO: Can it beat Maruti Suzuki's market valuation?Hyundai, the second-largest automaker in India, has maintained a steady market share of 15-17% since 2008. But does it have what it takes to beat market leader Maruti Suzuki's valuation? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-26-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2606675-2024-09-26",
      "headline": "Gold, silver price today, September 26, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 26 September 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-raps-delhi-air-quality-panel-air-pollution-stubble-burning-2607351-2024-09-27",
      "headline": "Silent spectators: Supreme Court blasts air quality panel on Delhi pollutionThe development comes as Delhi experienced a significant decline in air quality this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-prime-minister-keir-starmer-backs-india-bid-for-permanent-seat-united-nations-security-council-unsc-after-us-france-2607193-2024-09-27",
      "headline": "India's bid for permanent UN Security Council seat gets major push UK Prime Minister Keir Starmer on Thursday backed India for a permanent member of the United Nations Security Council (UNSC) during his address at the United Nations General Assembly's 79th session in New York."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-mahalaxmi-fridge-murder-accused-confessed-mother-2607354-2024-09-27",
      "headline": "Loved her, she wanted to trap me: Bengaluru murder accused confessed to motherPolice sources said after killing Mahalakshmi, the accused went to his home in Odisha, after almost three years, and confessed to the crime before his mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-karan-johar-stars-charging-huge-amount-cant-guarantee-hits-2607047-2024-09-26",
      "headline": "Karan Johar wants to cut pay checks, Saif Ali Khan quips on fee-business remarkSaif Ali Khan, speaking at India Today Mumbai Conclave 2024, said that actors charging astronomical amounts and not delivering cannot last for long in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/last-mughal-emperor-bahadur-shah-zafar-british-pension-sepoy-mutiny-1857-revolt-delhi-meerut-rangoon-2606778-2024-09-27",
      "headline": "For British pension, Bahadur Shah Zafar plotted against sepoys in 1857Indian sepoys who had raised the flag of revolt in 1857 reached Red Fort and urged Bahadur Shah Zafar to be the symbolic head of their fight. The last Mughal emperor, living off a pension from the British, wrote letters to the British conspiring against the Indian sepoys. A look at the pension worries of Bahadur Shah Zafar amid 21st century India's pension conundrum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/class-2-student-killed-school-hostel-hathras-up-to-bring-glory-fame-2607216-2024-09-27",
      "headline": "'Human sacrifice' in UP, Class 2 boy strangled to bring 'glory to school'The alleged motive behind the murder was to ensure the prosperity of the school, which had been under financial strain. The accused believed that offering a human sacrifice would lead to the school's success.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-arunachal-pradesh-mountain-peak-army-team-dalai-lama-2607298-2024-09-27",
      "headline": "Null and void: China as mountaineers name Arunachal peak after 6th Dalai LamaChina's reaction comes after a team of the National Institute of Mountaineering and Adventure Sports scaled an unnamed and uncharted peak in Arunachal Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqt-bill-ammendment-bjp-muslim-responses-controversy-mp-nishikant-dubey-alleges-foreign-role-aimplb-2607168-2024-09-27",
      "headline": "Who flooded Waqf Bill JPC's mailbox?The huge number of suggestions that the Joint Parliamentary Committee (JPC) on the Waqf (Amendment) Bill received has sparked a controversy. Panel member and BJP MP Nishikant Dubey sought a probe into the role of China or Pakistan's ISI over the 1.25 crore submissions. The All India Muslim Personal Law Board said Muslims had sent 5 crore feedback to the JPC against the bill."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/flipkart-apologises-aalsi-bewakoof-kambakkht-pati-video-backlash-big-billion-days-sale-2607239-2024-09-27",
      "headline": "Flipkart apologises for video calling husbands 'aalsi, bewakoof' after backlashThe video, promoting Flipkart's 'Big Billion Days Sale,' has since been removed from their social media platforms after the backlash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/turkey-president-turkiye-recep-tayyip-erdogan-skipped-kashmir-in-united-nations-speech-rattled-pakistan-shahbaz-sharif-2607222-2024-09-27",
      "headline": "Why Turkey's Erdogan skipped Kashmir in speech, rattled Pakistan | ExplainedTurkey's President Erdogan omits Kashmir in his UNGA speech. What could signal a potential shift in Turkey's stance, is seen as a blow to Pakistan, and it's futile 'activism' for Kashmir. The move could be linked to Turkey's aspirations to join the BRICS group, and strengthening ties with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-fan-riger-robi-hospitalised-2607350-2024-09-27",
      "headline": "Bangladesh fan 'Tiger Robi' rushed to hospital after dehydration in Kanpur TestIndia vs Bangladesh, 2nd Test: A Bangladesh cricket fan, Tiger Robi, was admitted to a hospital in Kanpur after his health deteriorated at the stands on Day 1 of the encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-nuclear-powered-submarine-sank-earlier-this-year-report-2607102-2024-09-27",
      "headline": "Chinese nuclear-powered submarine sank earlier this year: ReportAccording to a US defence official who spoke to news agency Reuters, China's new first-in-class nuclear-powered attack submarine sank sometime between May and June this year, though the exact cause behind the incident was not clear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/devara-x-review-fans-blown-away-by-jr-ntrs-performance-but-disappointed-by-vfx-2607197-2024-09-27",
      "headline": "Devara X review: Fans 'blown away' by Jr NTR's performance, but disappointed by VFXJr NTR's Devara: Part 1 made its grand theatrical debut on September 27. While the superstar's performance is being praised on social media, the VFX used in the film drew flak. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-trolls-social-media-medals-viral-photo-hotel-room-2607285-2024-09-27",
      "headline": "Manu Bhaker doubles down on trolls, flaunts room full of medals in heartwarming postDouble Olympic medalist Manu Bhaker continued to hit out at her trolls. The celebrated shooter flaunted a room of medals, which included the two bronze medals she won at the Paris Olympics. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/osama-bin-laden-apj-abdul-kalam-comparison-ruta-awhad-remarks-video-ncp-sharad-pawar-jitendra-awhad-bjp-2607270-2024-09-27",
      "headline": "Row over Sharad Pawar party leader's wife comparing Abdul Kalam to Osama bin LadenRuta Awhad made the contentious comparison while addressing a gathering of children. She urged them to read Osama bin Laden's biography to understand how he became a terrorist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-tests-dragon-pressure-suits-stores-blood-sample-for-study-2607277-2024-09-27",
      "headline": "Commander Sunita Williams tests SpaceX's Dragon pressure suits Commander Sunita Williams and Flight Engineer Butch Wilmore are scheduled to return home with Crew-9 aboard SpaceX's Dragon spacecraft in February 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-weather-update-rain-imd-maharashtra-red-orange-alert-2607253-2024-09-27",
      "headline": "Heavy rain pounds Mumbai, red alert issued, showers to continue throughout weekThe IMD has issued a red alert for Nashik, while orange alerts have been placed for Palghar, Pune, Nandurbar, and Dhule. Additionally, nearly every city in Maharashtra is under a yellow alert for the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-brains-behind-student-movement-protests-sheikh-hasina-ouster-mahfuz-alam-2607177-2024-09-27",
      "headline": "Bangladesh's Muhammad Yunus reveals 'brains' behind Sheikh Hasina's ousterSpeaking at the Clinton Global Initiative, Dr Muhammad Yunus introduced and praised the young leaders who drove the student-led movement that led to Sheikh Hasina's ouster. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-mumbai-dharavi-project-adani-group-aaditya-thackeray-2607260-2024-09-27",
      "headline": "Will take back Dharavi project contract from Adani Group if...: Devendra FadnavisDevendra Fadnavis, speaking at India Today's Mumbai Conclave, alleged that the previous Uddhav Thackeray government failed to cap the Transferable Development Rights of the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/watch-bhool-bhulaiyaa-3-teaser-vidya-balan-manjulika-gives-you-thrills-in-a-scary-ride-with-kartik-aaryan-2607256-2024-09-27",
      "headline": "Bhool Bhulaiyaa 3 teaser: Vidya Balan's Manjulika gives you thrills in a scary rideThe much-anticipated Bhool Bhulaiyaa 3 teaser, starring Kartik Aaryan, is here. The makers have introduced every character in the video, marking a grand and a celebratory comeback of Vidya Balan as the OG Manjulika. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/maye-musk-reacts-viral-picture-of-son-elon-musk-italy-pm-giorgia-meloni-2607274-2024-09-27",
      "headline": "What Maye Musk said about son Elon's viral pic with Italy PM Giorgia MeloniMaye Musk has reacted to a viral picture of her son, billionaire Elon Musk, and Italian Prime Minister Giorgia Meloni. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-bhulaiyaa-3-teaser-x-reactions-fans-celebrate-diwali-early-with-manjulika-vidya-balan-kartik-aaryan-2607311-2024-09-27",
      "headline": "Bhool Bhulaiyaa 3 teaser X reactions: Fans celebrate Diwali early with ManjulikaSocial media users welcomed the teaser of Bhool Bhulaiyaa 3 on Friday, September 27, and celebrated the comeback of Vidya Balan to the franchise as the OG Manjulika. They complimented Kartik Aaryan for bringing entertainment this Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/the-last-of-us-season-2-pedro-pascal-bella-ramsey-joel-fans-react-teaser-video-2607333-2024-09-27",
      "headline": "The Last of Us 2: Pedro Pascal's Joel returns, fans say 'lots of pain incoming'The first teaser of The Last of Us Season 2 is here. Its stars Pedro Pascal and Bella Ramsey return and promise more action and drama, along with a world of pain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-to-prakash-raj-over-tirupati-laddu-row-pawan-kalyan-2607335-2024-09-27",
      "headline": "Vishnu Manchu to Prakash Raj over Tirupati laddu row: Not everything is your fightActor Vishnu Manchu addressed his social media exchange with Prakash Raj over the Tirupati laddu adulteration controversy, defending Pawan Kalyan's call for an investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parvin-dabas-discharged-hospital-back-home-after-car-accident-2607321-2024-09-27",
      "headline": "Parvin Dabas back home after being discharged from hospitalActor Parvin Dabas, known for roles in films like Khosla Ka Ghosla, has been discharged from the hospital following a car accident. He shared his health update and gratitude towards fans on social media."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-breaks-anil-kumble-indian-for-most-test-wickets-in-asia-2607352-2024-09-27",
      "headline": "Ashwin breaks Anil Kumble's Indian record for most Test wickets in AsiaIndia vs Bangladesh:  Ravichandran Ashwin has surpassed Anil Kumble to become India's most successful bowler in Test cricket in Asia during the second Test against Bangladesh. Ashwin now has 420 wickets in the Asian continent, second only to Muttiah Muralitharan's 612."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-fan-riger-robi-hospitalised-2607350-2024-09-27",
      "headline": "Bangladesh fan 'Tiger Robi' rushed to hospital after dehydration in Kanpur TestIndia vs Bangladesh, 2nd Test: A Bangladesh cricket fan, Tiger Robi, was admitted to a hospital in Kanpur after his health deteriorated at the stands on Day 1 of the encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/neeraj-chopra-india-return-home-haryana-grand-welcome-diamond-league-injury-2607345-2024-09-27",
      "headline": "Watch: Neeraj Chopra receives roaring welcome on returning home India's javelin star Neeraj Chopra received a grand welcome in Haryana after his second-place finish at the Brussels Diamond League, despite injury. The Sports University of Haryana in Sonipat celebrated his remarkable achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-fitness-world-championships-2025-injury-update-2607336-2024-09-27",
      "headline": "Neeraj Chopra targets return to peak fitness, World Championship glory in 2025 Neeraj Chopra said he is confident of returning to 100 percent fitness at the start of the next season. The double Olympic medalist was battling with a groin injury throughout the 2024 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ole-gunnar-solksjaer-open-to-manchester-united-managerial-return-2607323-2024-09-27",
      "headline": "Ole Gunnar Solskjaer open to Manchester United managerial return: Would say yesOle Gunnar Solskjaer has claimed that he would be open to making a return as the manager of Manchester United. Solksjaer left the United 3 years ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-fans-unhappy-after-dwayne-bravo-joins-kkr-2607322-2024-09-27",
      "headline": "Disappointing start to season: CSK fans unhappy after Dwayne Bravo joins KKRChennai Super Kings fans were left stunned as Dwayne Bravo, a key figure in their IPL success, joined Kolkata Knight Riders as a mentor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-second-test-kamindu-mendis-5th-hundred-galle-2607303-2024-09-27",
      "headline": "SL vs NZ: Kamindu Mendis continues golden Test run, scores 5th Test hundredKamindu Mendis continued his golden run in Test cricket as he scored his 5th hundred on Day 2 of the Galle Test on Friday, September 27. Kamindu got to his hundred in 147 balls against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-ravi-shastri-raghuvendra-diwedi-special-post-2607290-2024-09-27",
      "headline": "Ravi Shastri shares special post with 'Raghu Bhaiya' ahead Kanpur TestFormer India coach Ravi Shastri praised the team's throwdown specialist, Raghuvendra Diwedi, known as \"Raghu Bhaiya,\" ahead of the second Test against Bangladesh. Shastri highlighted Raghu's crucial role in preparing India's top batters to face high-speed bowling challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-trolls-social-media-medals-viral-photo-hotel-room-2607285-2024-09-27",
      "headline": "Manu Bhaker doubles down on trolls, flaunts room full of medals in heartwarming postDouble Olympic medalist Manu Bhaker continued to hit out at her trolls. The celebrated shooter flaunted a room of medals, which included the two bronze medals she won at the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ravindra-jadeja-imitate-jasprit-bumrah-bowling-action-2607264-2024-09-27",
      "headline": "Watch: Virat Kohli and Ravindra Jadeja imitate Jasprit Bumrah's bowling actionIndia vs Bangladesh, 2nd Test: Virat Kohli and Ravindra Jadeja were seen copying Jasprit Bumrah's bowling action and his routine of returning to the mark after delivering the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dwayne-bravo-shah-rukh-khan-message-kkr-mentor-chennai-super-kings-2607236-2024-09-27",
      "headline": "Dwayne Bravo recalls Shah Rukh Khan's party message after joining KKR as mentorIPL 2025: Former West Indies all-rounder recalled Shah Rukh Khan's message after he was appointed the mentor of the Knight Riders. Bravo also thanked the Chennai Super Kings for 'blessing' him for the next chapter of his cricketing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-second-test-kamindu-mendis-5th-hundred-galle-2607303-2024-09-27",
      "headline": "SL vs NZ: Kamindu Mendis continues golden Test run, scores 5th Test hundredKamindu Mendis continued his golden run in Test cricket as he scored his 5th hundred on Day 2 of the Galle Test on Friday, September 27. Kamindu got to his hundred in 147 balls against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-ravi-shastri-raghuvendra-diwedi-special-post-2607290-2024-09-27",
      "headline": "Ravi Shastri shares special post with 'Raghu Bhaiya' ahead Kanpur TestFormer India coach Ravi Shastri praised the team's throwdown specialist, Raghuvendra Diwedi, known as \"Raghu Bhaiya,\" ahead of the second Test against Bangladesh. Shastri highlighted Raghu's crucial role in preparing India's top batters to face high-speed bowling challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-trolls-social-media-medals-viral-photo-hotel-room-2607285-2024-09-27",
      "headline": "Manu Bhaker doubles down on trolls, flaunts room full of medals in heartwarming postDouble Olympic medalist Manu Bhaker continued to hit out at her trolls. The celebrated shooter flaunted a room of medals, which included the two bronze medals she won at the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ravindra-jadeja-imitate-jasprit-bumrah-bowling-action-2607264-2024-09-27",
      "headline": "Watch: Virat Kohli and Ravindra Jadeja imitate Jasprit Bumrah's bowling actionIndia vs Bangladesh, 2nd Test: Virat Kohli and Ravindra Jadeja were seen copying Jasprit Bumrah's bowling action and his routine of returning to the mark after delivering the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dwayne-bravo-shah-rukh-khan-message-kkr-mentor-chennai-super-kings-2607236-2024-09-27",
      "headline": "Dwayne Bravo recalls Shah Rukh Khan's party message after joining KKR as mentorIPL 2025: Former West Indies all-rounder recalled Shah Rukh Khan's message after he was appointed the mentor of the Knight Riders. Bravo also thanked the Chennai Super Kings for 'blessing' him for the next chapter of his cricketing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-contrasting-reactions-to-drs-decisions-in-kanpur-test-go-viral-2607227-2024-09-27",
      "headline": "Rohit Sharma's contrasting reactions to DRS decisions in Kanpur Test go viral India vs Bangladesh: Indian captain Rohit Sharma's animated reactions to two crucial DRS calls on Day 1 of the second Test against Bangladesh in Kanpur have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-boss-erik-ten-hag-backs-bruno-fernandes-to-regain-form-2607229-2024-09-27",
      "headline": "Manchester United boss Erik ten Hag backs Bruno Fernandes to regain formManchester United boss Erik ten Hag has backed captain Bruno Fernandes to bounce back after his sluggish start to the new campaign. Fernandes is yet to score a goal this season for United. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-virat-kohli-feet-touched-ground-staff-member-kanpur-2607214-2024-09-27",
      "headline": "Watch: Virat Kohli's feet touched by Kanpur ground staff member before 2nd TestA member of the Green Park ground staff decided to approach Virat Kohli and proceeded to touch Virat Kohli's feet in a heartwarming moment on Friday, September 27. Kohli is aiming to make an impact in the Kanpur Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-toss-60-year-old-record-2607198-2024-09-27",
      "headline": "India become first team to win toss and bowl first in Kanpur Test in 60 years India vs Bangladesh, 2nd Test: Rohit Sharma called it right at the toss and opted to field at Green Park. This is the first time in 60 years that a team has won the toss in Kanpur and opted to bowl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-bowling-coach-morne-morkel-relishes-new-job-2607192-2024-09-27",
      "headline": "Bowling coach Morne Morkel relishing India jobFormer South African pacer Morne Morkel enjoyed his first week as the bowling coach of the Indian men's cricket team during the two-match Test series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-virat-kohli-fab-four-pressure-parthiv-patel-tamim-iqbal-2607184-2024-09-27",
      "headline": "Virat Kohli faces more pressure than Smith, Root and Williamson: Parthiv, TamimParthiv Patel and Tamim Iqbal feel that Virat Kohli faces more pressure than the rest of the Fab 4 members, Steve Smith, Joe Root and Kane Williamson. Kohli has been going through a rough patch in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dwayne-bravo-kolkata-knight-riders-mentor-gautam-gambhir-2607175-2024-09-27",
      "headline": "IPL 2025: Dwayne Bravo appointed new KKR mentor, replaces Gautam GambhirIPL 2025: Kolkata Knight Riders announced former West Indies all-rounder Dwayne Bravo as their mentor for the upcoming Indian Premier League season. Bravo's association with Chennai Super Kings, therefore, comes to an end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-rohit-sharma-playing-xis-kanpur-2607174-2024-09-27",
      "headline": "IND vs BAN: India sticks to Chennai winning mantra in Kanpur Test, no 3rd spinnerIndia has decided to stick with the same team that won them the Chennai Test in Kanpur as they will use 3 pacers instead of using an extra spinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-bowling-coach-morne-morkel-relishes-new-job-2607192-2024-09-27",
      "headline": "Bowling coach Morne Morkel relishing India jobFormer South African pacer Morne Morkel enjoyed his first week as the bowling coach of the Indian men's cricket team during the two-match Test series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-virat-kohli-fab-four-pressure-parthiv-patel-tamim-iqbal-2607184-2024-09-27",
      "headline": "Virat Kohli faces more pressure than Smith, Root and Williamson: Parthiv, TamimParthiv Patel and Tamim Iqbal feel that Virat Kohli faces more pressure than the rest of the Fab 4 members, Steve Smith, Joe Root and Kane Williamson. Kohli has been going through a rough patch in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dwayne-bravo-kolkata-knight-riders-mentor-gautam-gambhir-2607175-2024-09-27",
      "headline": "IPL 2025: Dwayne Bravo appointed new KKR mentor, replaces Gautam GambhirIPL 2025: Kolkata Knight Riders announced former West Indies all-rounder Dwayne Bravo as their mentor for the upcoming Indian Premier League season. Bravo's association with Chennai Super Kings, therefore, comes to an end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-rohit-sharma-playing-xis-kanpur-2607174-2024-09-27",
      "headline": "IND vs BAN: India sticks to Chennai winning mantra in Kanpur Test, no 3rd spinnerIndia has decided to stick with the same team that won them the Chennai Test in Kanpur as they will use 3 pacers instead of using an extra spinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hull-ruled-out-of-pakistan-test-tour-with-quad-injury-2607165-2024-09-27",
      "headline": "Josh Hull ruled out of Pakistan Test tour with quad injuryEngland's fast bowler Josh Hull has been ruled out of the upcoming Test series against Pakistan due to a quad injury, the ECB confirmed. Hull sustained the injury during his Test debut against Sri Lanka, further depleting England's pace options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-shakib-al-hasan-retirement-bcb-president-faruque-ahmed-2607145-2024-09-27",
      "headline": "Shakib Al Hasan's security not in our hands: Bangladesh cricket board presidentBangladesh cricket board president Faruque Ahmed has claimed that they cannot guarantee Shakib Al Hasan's security if the all-rounder wants to play his final Test on home soil. Shakib announced his retirement from Tests on September 26 and wanted to play his last game in Mirpur. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}