{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-six-year-low-falls-to-282-percent-in-may-2025-2739809-2025-06-12",
      "headline": "Retail inflation hits six-year low, falls to 2.82% in May 2025The decline in retail inflation is mainly because food prices rose at a much slower pace than before. Cheaper vegetables, fruits, cereals, and pulses helped bring food inflation down sharply. In May, food inflation fell to 0.99% from 1.78% in April."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-tata-shares-fall-air-india-crash-2739766-2025-06-12",
      "headline": "Sensex tanks 823 points, Nifty falls below 25,000; Tata Motors falls 3%The S&P BSE Sensex was down by 823.16 points to close at 81,691.98, while the NSE Nifty50 fell by 253.20 points to settle at 24,888.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-reacts-after-air-india-plane-crashes-in-ahmedabad-with-242-onboard-2739764-2025-06-12",
      "headline": "Boeing reacts to Air India plane crash in Ahmedabad, says aware of initial reportsThe London-bound flight AI-171, carrying 242 people including 230 passengers and 12 crew members, crashed in the Meghaninagar area near the Sardar Vallabhbhai Patel International Airport minutes after takeoff. The plane had issued a mayday call before losing contact with air traffic control."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shocked-and-deeply-saddened-gautam-adani-after-air-india-plane-crash-in-ahmedabad-2739761-2025-06-12",
      "headline": "Shocked and deeply saddened: Gautam Adani after Air India plane crash in AhmedabadOn Thursday afternoon, an Air India flight heading to London crashed just minutes after take-off, with 242 people on board. The flight, AI-171, was being operated by a Boeing 787 Dreamliner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-flight-171-crash-ahmedabad-airport-operations-suspended-2739753-2025-06-12",
      "headline": "Focus on supporting affected people: Tata Group chief on Ahmedabad plane crashThe airplane crash has led to a temporary suspension of flight operations at Sardar Vallabhbhai Patel International Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-share-price-down-7-percent-in-pre-market-trading-after-air-india-plane-crash-ahmedabad-2739751-2025-06-12",
      "headline": "Boeing shares tumble 8% after Air India flight crashes in AhmedabadBoeing shares nosedived over 8% in pre-market trade after the Air India Dreamliner crash in Ahmedabad, deepening investor concerns over the jetmaker's safety record and regulatory troubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-voluntary-buyouts-knowledge-ads-teams-ai-investment-voluntary-exit-programme-mention-report-2739707-2025-06-12",
      "headline": "Google offers buyout plans amid AI-focused overhaul: ReportGoogle is now giving some employees the option to leave the company with a severance package. This is being called a \"voluntary exit programme\", as per reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dalal-street-falls-nearly-1-percent-us-china-trade-middle-east-tensions-stock-market-falling-sensex-down-700-points-2739681-2025-06-12",
      "headline": "Dalal Street dips nearly 1 percent on global trade and geopolitical concernsStock market today: The fall occurred despite markets erasing early losses as the S&P BSE Sensex fell by 911 points to 81,603.95 and the NSE Nifty50 lost 288.75 points to 24,854.45 by 2:29 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-tighten-remittance-rules-bar-offshore-time-deposits-report-2739671-2025-06-12",
      "headline": "India to tighten remittance rules, bar offshore time deposits: ReportThe Reserve Bank of India (RBI) will amend regulations to prevent overseas transfers from being used to park money in time deposits or other interest-bearing accounts abroad, one of the sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-expected-20-june-2025-financial-aid-indian-farmers-2739652-2025-06-12",
      "headline": "PM-Kisan 20th instalment: When will farmers get the next Rs 2,000?This scheme provides income support of Rs 6,000 a year to eligible farmers. The money is paid in three equal parts of Rs 2,000, directly into the farmers' bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dollar-dream-vs-reality-why-rs-80-lakh-in-us-salary-not-as-big-as-it-sounds-purchasing-power-parity-rs-23-lakhs-india-equals-rs-80-lakhs-us-salary-2739606-2025-06-12",
      "headline": "Dollar dream vs reality: Why Rs 80 lakh in US salary not as big as it soundsRs 23 lakh in India can go as far as Rs 80 lakh in the US when it comes to daily living costs. An upcoming author reveals the impact of Purchasing Power Parity (PPP) on salary comparisons between India and the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-rises-over-usd-100-million-after-apology-to-donald-trump-2739577-2025-06-12",
      "headline": "Elon Musk's net worth jumps after apology to Donald TrumpElon Musk's net worth increased by $191 million, reaching $411.4 billion after his public apology to President Donald Trump."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-defends-endorsing-sports-betting-app-if-it-is-legal-let-me-do-it-2739800-2025-06-12",
      "headline": "Aamir Khan defends endorsing sports betting app: If it is legal, let me do itActor Aamir Khan opened up on his decision to endorse a sports betting app while refraining from alcohol and tobacco advertisements. The actor highlighted his consideration for quality and creative scripts while saying yes to brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-heartbroken-after-ahmedabad-plane-crash-sends-prayers-for-victims-families-2739862-2025-06-12",
      "headline": "SRK heartbroken after Ahmedabad plane crash, sends prayers for victims' familiesActor Shah Rukh Khan shared a note on X, expressing deep grief for the victims of the Ahmedabad plane crash. The actor also sent prayers for the families of those affected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-shares-rare-pic-of-dharmendra-and-prakash-kaur-on-their-71st-anniversary-2739819-2025-06-12",
      "headline": "Bobby Deol shares rare pic of Dharmendra and Prakash Kaur on their 71st anniversaryActor Bobby Deol shared a rare picture of his parents, actor Dharmendra and his first wife, Prakash Kaur, on social media. His post marked the 71st wedding anniversary celebration of his parents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nikhil-siddhartha-reacts-after-india-house-set-accident-confirms-no-human-damage-2739708-2025-06-12",
      "headline": "No human damage: Actor Nikhil Siddhartha reacts after India House set accidentA water tank burst flooded the set of Ram Charan's maiden production 'The India House', causing significant damage but no loss of life. Lead actor Nikhil Siddhartha and producer Abhishek Agarwal confirmed the safety of all involved and thanked the crew for their quick response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-jitendra-kumar-leadership-from-kota-to-phulera-prove-not-all-heroes-wear-capes-2739637-2025-06-12",
      "headline": "Why Jitendra Kumar's leadership from Kota to Phulera prove not all heroes wear capesJitendra Kumar's roles as Jeetu Bhaiya in 'Kota Factory' and Abhishek in 'Panchayat' have quietly redefined how mentorship and leadership are portrayed on screen. Through empathy and simplicity, he's become a relatable guide for both students and senior citizens across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keerthy-suresh-action-comedy-revolver-rita-release-in-august-2739784-2025-06-12",
      "headline": "Keerthy Suresh's action‑comedy Revolver Rita to release in August. Promo outFollowing her Bollywood debut in 'Baby John', Keerthy Suresh returns to Tamil cinema with her upcoming quirky action-comedy 'Revolver Rita', set to hit theatres in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/elijah-cooper-zahara-jolie-pitt-rumoured-fiance-2739770-2025-06-12",
      "headline": "Who is Elijah Cooper, Zahara Jolie-Pitt's rumoured fiance? All you need to knowAngelina Jolie and Brad Pitt's daughter Zahara sparked a social media frenzy after being seen at the celebrity hotspot Craig's with her rumoured boyfriend, Elijah Cooper, wearing a diamond ring. This sighting has left fans buzzing with questions, especially: who is Elijah Cooper?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/salman-khan-indian-supercross-racing-league-kannappa-trailer-launch-postponed-after-ahmedabad-plane-crash-2739790-2025-06-12",
      "headline": "Salman Khan's event, Kannappa trailer launch postponed after Ahmedabad plane crashSalman Khan's event and the 'Kannappa' trailer launch were called off after an Air India flight to London crashed just five minutes after takeoff from Ahmedabad's Sardar Vallabhbhai Patel International Airport on Thursday afternoon.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/big-b-playful-reaction-to-director-saying-he-spoiled-industry-work-template-2739674-2025-06-12",
      "headline": "Big B's playful reaction to director saying he spoiled industry's work templateActor Amitabh Bachchan recently shared a light-hearted conversation with one of the directors of his ad film. In his playful blog post, he admitted how people felt he might spoil the industry's work template. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sabrina-carpenter-faces-backlash-over-controversial-album-cover-of-mans-best-friend-2739703-2025-06-12",
      "headline": "Sabrina Carpenter faces backlash over controversial Man's Best Friend album coverSinger Sabrina Carpenter invited criticism over the album cover of 'Man's Best Friend'. Several social media users claimed that the cover is degrading and caters to the male gaze."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-sardaar-ji-3-ban-in-trouble-over-casting-row-2739713-2025-06-12",
      "headline": "Diljit Dosanjh's Sardaar Ji 3 in trouble over casting row, film body urges banDiljit Dosanjh's upcoming film 'Sardaar Ji 3' faces trouble as FWICE urges CBFC to deny certification over alleged casting of Pakistani actors. The controversy comes amid rising Indo-Pak tensions, following a government advisory against such collaborations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahmedabad-air-india-plane-crash-randeep-hooda-riteish-deshmukh-celebs-express-concern-2739618-2025-06-12",
      "headline": "Ahmedabad plane crash: Allu Arjun, Akshay Kumar, Alia Bhatt, celebs mourn the lossAn Air India flight bound for London crashed five minutes after take-off from Ahmedabad airport on Thursday afternoon. Shortly after the news broke, concerns, support, and prayers began pouring in from film celebrities, including Allu Arjun, Akshay Kumar, Alia Bhatt, Riteish Deshmukh and Randeep Hooda, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-better-sister-deepens-what-adolescence-taught-us-about-child-psychology-2739634-2025-06-12",
      "headline": "The Better Sister deepens what Adolescence taught us about child psychology'The Better Sister' on Prime Video has created buzz for its suspense and courtroom drama. However, the show also gives insight into parenting, therapy, childhood trauma and marital abuse. Here's a glimpse into how the show has a subtle take on teenage struggles post Netflix' 'Adolescence'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/btss-suga-to-be-discharged-from-military-service-on-june-21-2739693-2025-06-12",
      "headline": "After BTS's Jimin and Jungkook, ARMY awaits Suga's returnK-pop's biggest boyband BTS is all set to reunite, as every member except for Suga has been discharged from the mandatory military service. Suga will be discharged later this month.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-to-release-indian-version-of-shakiras-hips-dont-lie-read-details-2739619-2025-06-12",
      "headline": "Diljit Dosanjh hints at desi Hips Don't Lie collaboration with Shakira. WatchSinger Diljit Dosanjh hinted at the possibility of a collaboration with pop sensation Shakira for the Indian version of her song 'Hips don't lie'. The duo met at the Met Gala earlier this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-she-cant-imagine-ddlj-2-kuch-kuch-hota-hai-sequels-no-one-wants-to-know-what-happens-after-the-train-left-2739668-2025-06-12",
      "headline": "Kajol rules out DDLJ 2: No one wants to know what happens after train leftKajol recently shared her thoughts on possible sequels to her iconic films 'Dilwale Dulhania Le Jayenge' and 'Kuch Kuch Hota Hai'. She feels that some love stories are best left as they are. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-didnt-have-identity-got-show-because-of-me-navjot-singh-sidhu-2739639-2025-06-12",
      "headline": "Kapil Sharma didn't have identity, got show because of me: Navjot Singh SidhuFormer cricketer Navjot Singh Sidhu revealed that he played a key role in helping Kapil Sharma land his big break. He also opened up about the real reason behind his participation in 'Bigg Boss' back in 2012.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bengal-files-teaser-vivek-ranjan-agnihotri-brings-chilling-story-with-powerhouse-performers-2739642-2025-06-12",
      "headline": "The Bengal Files teaser: A chilling story with powerhouse performersIn 'The Bengal Files' teaser, you see a glimpse of all the prominent characters in the film. It further promises a rigid, dark and unsettling tone for the film directed and written by Vivek Ranjan Agnihotri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-venkatesh-trivikram-srinivas-director-line-up-confirms-naga-vamsi-2739626-2025-06-12",
      "headline": "Venkatesh first, Jr NTR next: Producer confirms director Trivikram's line-upAmid growing speculation about his next collaborations, director Trivikram Srinivas' long-time associate and producer Naga Vamsi has officially clarified the filmmaker's upcoming line-up on social media."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/air-india-ahmedabad-plane-climbed-just-625-feet-before-crashing-final-moment-in-radar-data-2739754-2025-06-12",
      "headline": "Air India crash: Plane's final moments recorded in radar dataThe plane, as seen in videos, was struggling to gain altitude before veering sharply and descending rapidly, followed by a loud explosion and a massive fireball as the aircraft crashed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/passenger-list-of-the-ahmedabad-plane-crash-what-we-know-so-far-2739746-2025-06-12",
      "headline": "169 Indians among 242 flyers on crashed Air India flight: Full passenger listAn Air India flight carrying over 242 passengers crashed near Ahmedabad Airport minutes after takeoff, triggering a massive rescue operation. Details about the passengers and casualties are still emerging as authorities work at the crash site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/boeing-787-dreamliner-is-flawed-fuselage-manufacture-whistleblower-rang-alarm-air-india-crash-ahmedabad-2739852-2025-06-12",
      "headline": "Boeing 787 Dreamliner is flawed: Whistleblower sounded alarm early onA year before Tuesday's Air India crash in Ahmedabad, which involved a Boeing 78 Dreamliner, a whistleblower had flagged structural flaws in the manufacturing of the wide-body jet, alleging unsafe assembly practices and shortcuts. While the cause of the Air India crash remains under investigation, there are no links yet to the earlier warnings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pilots-sumeet-sabharwal-clive-kundar-crashed-air-india-flight-boeing-787-8-dreamliner-had-9300-hours-of-flying-experience-2739748-2025-06-12",
      "headline": "Pilots flying crashed Air India flight had 9,300 hours of flying experienceWhile Captain Sumeet Sabharwal had 8,200 hours of flying experience, his copilot, Clive Kundar, had 1,100 hours under his belt, the civil aviation regulatory body said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-air-india-crash-is-one-of-aviation-historys-worst-disasters-2739858-2025-06-12",
      "headline": "Ahmedabad Air India crash is one of aviation history's worst disastersA London-bound Air India flight with 242 people on board crashed just five minutes after taking off from Ahmedabad's Sardar Vallabhbhai Patel International Airport on Thursday afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-part-of-air-india-plane-hangs-out-of-resident-doctors-hostel-after-crash-2739771-2025-06-12",
      "headline": "Video: Part of Air India plane hangs out of resident doctors' hostel after crashA part of the Air India flight, which crashed shortly after take-off from Sardar Vallabhbhai Patel International Airport in Ahmedabad, fell on BJ Medical College's resident doctors' hostel roof in Ahmedabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/heartbreaking-beyond-words-pm-modi-on-ahmedabad-london-air-india-flight-crash-2739783-2025-06-12",
      "headline": "Heartbreaking beyond words: PM Modi on Ahmedabad-London Air India flight crashReacting to the Air India crash in Ahmedabad, Prime Minister Narendra Modi expressed sorrow over the incident. Calling the incident \"heart-breaking beyond words\", Modi said he was in touch with authorities coordinating rescue and relief efforts at the crash site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-gatwick-flight-gave-mayday-call-to-atc-crashed-outside-airport-perimeter-after-take-off-2739726-2025-06-12",
      "headline": "Mayday, Mayday Air India declared, then radio silence: Tracing Ahmedabad crashThe Air India Ahmedabad-London flight gave a mayday call to ATC, moments before it crashed near the Ahmedabad airport, the DGCA said in a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-indian-origin-doctor-bobby-mukkamala-head-us-american-medical-association-ama-healthcare-system-us-2739594-2025-06-12",
      "headline": "Who is Indian-origin doctor Bobby Mukkamala to head US medical bodyAn Indian-origin doctor was sworn in as the president of the American Medical Association, becoming the first person of Indian-descent to lead America's most influential physician organisation. Bobby Mukkamala, who has roots in Andhra Pradesh, expressed concern about the US healthcare system and vowed to work on it as he took charge of the medical body."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-profile-pic-goes-black-after-london-bound-flight-crashes-in-ahmedabad-2739763-2025-06-12",
      "headline": "Air India profile pics go black after London-bound flight crashes in AhmedabadAn Air India flight to London crashed five minutes after take-off from the Ahmedabad airport on Thursday afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-plane-crash-gujarat-chief-minister-vijay-rupani-air-india-flight-ahmedabad-airport-2739712-2025-06-12",
      "headline": "Ex-Gujarat CM Vijay Rupani on Air India flight that crashed in AhmedabadAhmedabad plane crash: Former Gujarat Chief Minister Vijay Rupani was on the London-bound Air India aircraft that crashed near the Ahmedabad airport. According to the passenger list document accessed by India Today Digital, \"Vijay Ramniklal Rupani\" is the 12th passenger on the list and was booked in the Z class, which falls under the Business Class category."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/devastating-scenes-thoughts-with-passengers-families-uk-pm-starmer-as-london-bound-air-india-plane-crashes-2739786-2025-06-12",
      "headline": "Devastating scenes, thoughts with passengers: UK PM on Air India flight crashThe UK Prime Minister, Keir Starmer, has responded to the crash of a London-bound plane in Ahmedabad. Around 53 British nationals were also onboard on this flight. He also expressed his sympathies with the families of those who had onboarded the flight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahmedabad-air-india-plane-crash-randeep-hooda-riteish-deshmukh-celebs-express-concern-2739618-2025-06-12",
      "headline": "Ahmedabad plane crash: Allu Arjun, Akshay Kumar, Alia Bhatt, celebs mourn the lossAn Air India flight bound for London crashed five minutes after take-off from Ahmedabad airport on Thursday afternoon. Shortly after the news broke, concerns, support, and prayers began pouring in from film celebrities, including Allu Arjun, Akshay Kumar, Alia Bhatt, Riteish Deshmukh and Randeep Hooda, among others. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-air-india-plane-london-flight-crash-eyewitness-2739767-2025-06-12",
      "headline": "Loud blast, smoke, debris all over: Eyewitness account of Air India crashA man who rushed to the Air India crash site in Ahmedabad said he saw thick smoke and scattered debris after hearing a massive explosion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-planc-crash-as-air-india-flight-crashes-a-look-at-checks-planes-undergo-2739777-2025-06-12",
      "headline": "As Air India flight crashes, a look at checks planes undergoAn Air India flight carrying 242 people crashed soon after it took off from Sardar Vallabhbhai Patel International Airport in Ahmedabad on Thursday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shocked-and-deeply-saddened-gautam-adani-after-air-india-plane-crash-in-ahmedabad-2739761-2025-06-12",
      "headline": "Shocked and deeply saddened: Gautam Adani after Air India plane crash in AhmedabadOn Thursday afternoon, an Air India flight heading to London crashed just minutes after take-off, with 242 people on board. The flight, AI-171, was being operated by a Boeing 787 Dreamliner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/what-is-a-mayday-call-2739750-2025-06-12",
      "headline": "What is Mayday call that Air India pilot issued moments before fatal crash?Following its Mayday call, Air India 171 tragically crashed just five minutes after take-off in Ahmedabad on Thursday. Here's what a Mayday call means and how it originated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/perseverance-rover-captures-breathtaking-view-of-martian-moon-deimos-2739545-2025-06-12",
      "headline": "Perseverance rover captures breathtaking view of Martian moon DeimosPerseverance's camera employed its maximum long-exposure setting of 3.28 seconds for each of 16 individual frames. These were combined onboard into a single composite image."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bhopal/story/bhopal-railway-overbridge-sharp-turn-flawed-design-sparks-row-madhya-pradesh-2739574-2025-06-12",
      "headline": "Bhopal bridge with 90-degree turn stumps people, officials defend designA new railway overbridge in Bhopal has stirred controversy due to its sharp 90-degree turn, raising safety concerns among locals. Officials cite land constraints and metro station proximity as reasons for the unusual design.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-boeing-787-8-dreamliner-london-flight-crashes-after-take-off-from-ahmedabad-political-reactions-2739736-2025-06-12",
      "headline": "Air India crash: Ministers, leaders express shock, London Mayor deeply distressedReactions from all over the world poured in after an Air India flight to London crashed shortly after take-off from Ahmedabad, leaving the nation stunned and rescue operations underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-an-income-tax-notice-types-of-income-tax-notices-here-is-how-to-deal-with-it-2739551-2025-06-12",
      "headline": "Got an income tax notice? Don't panic, here's how to deal with itFor many honest taxpayers, the unexpected arrival of an income tax notice in their inbox can trigger anxiety. However, most of them are often routine and manageable. This article explains what these notices really mean, why they're sent, and what you should do if one lands your way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-makes-mickey-out-of-donald-trump-over-la-protests-immigration-raids-beijing-washington-2739638-2025-06-12",
      "headline": "China makes a mickey out of DonaldWith protests erupting in Los Angeles and other US cities over immigration raids, the Chinese state media has seized the opportunity to mock the Trump government, capitalising on a crisis that Washington appears to have handed over on a silver platter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-hcourt-grants-interim-bail-to-all-four-accused-in-rcb-bengaluru-stampede-case-2739749-2025-06-12",
      "headline": "Four accused in Bengaluru stampede case granted interim bailThe Karnataka High Court has granted interim bail to all four accused in the Chinnaswamy Stadium stampede case. The court,  however, directed all accused to surrender their passports. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-in-breach-of-non-proliferation-duties-global-nuclear-watchdog-iaeas-board-declares-first-in-20-years-2739684-2025-06-12",
      "headline": "Iran not in compliance with nuclear obligations: UN nuclear watchdogThe IAEA's 35-nation Board of Governors declared Iran in breach of its non-proliferation obligations, for the first time in almost 20 years."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-pat-cummins-world-record-five-wicket-haul-lords-2739871-2025-06-12",
      "headline": "Pat Cummins scripts world record, 1st captain to take 5-wicket haul in ICC finalPat Cummins made history by taking a five-wicket haul in the ICC World Test Championship final against South Africa at Lord's. He went past India's Bishan Singh Bedi in an all-time list of captains with most five-fers in Test cricket history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-sa-pacer-david-bedingham-handle-the-ball-controversy-vs-australia-2739839-2025-06-12",
      "headline": "Out or not out? David Bedingham survives the handle-the-ball appeal in WTC finalSouth Africa batter David Bedingham found himself in the middle of a rare on-field controversy during the World Test Championship final against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-test-championship-final-marnus-labuschagne-catch-temba-bavuma-pat-cummins-2739827-2025-06-12",
      "headline": "Watch: Labuschagne's stunning two-handed catch helps Australia remove BavumaWTC final, Australia vs South Africa: Marnus Labuschagne took a blinder of a catch at covers to help remove South Africa's Temba Bavuma just when he looked to attack the Aussie bowlers. South Africa were reeling at 121 for 5 at Lunch on Day 2 in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/radha-yadav-replaces-injured-shuchi-upadhyay-for-upcoming-england-tour-2739803-2025-06-12",
      "headline": "Radha Yadav replaces injured Shuchi Upadhyay in India squad for England tourRadha Yadav comes in as the injury replacement for Shuchi Upadhyay, who was ruled out due to a left shin injury ahead of India Women's upcoming white-ball tour of England. Radha Yadav has not played an international match since December 2024.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-prize-money-increase-highest-singles-payouts-line-judges-removed-2739822-2025-06-12",
      "headline": "Wimbledon prize money increased to record number ahead of 2025 campaignWimbledon has increased its total prize money by 7 percent to a record 53.5 million pounds this year. The tournament will also replace traditional line judges with an electronic system, marking a historic change."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/air-india-ahmedabad-plane-crash-sports-athletes-reaction-2739806-2025-06-12",
      "headline": "Absolutely devastated: Indian sports stars react to Air India plane crash in AhmedabadAn Air India flight from Ahmedabad to London crashed shortly after take-off on Thursday. Indian sports stars, including Virat Kohli, Rohit Sharma and PV Sindhu, reacted to the tragic incident that has left the world in shock. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-needs-time-to-rise-captains-are-not-made-in-1-2-months-harbhajan-singh-2739787-2025-06-12",
      "headline": "Shubman Gill needs time to rise, captains are not made in 1-2 months: Harbhajan SinghFormer India cricketer Harbhajan Singh has backed Shubman Gill to succeed as Test skipper, but said that the youngster will need some time to rise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/poland-manager-michal-probierz-resigns-lewandowski-captaincy-dispute-2739776-2025-06-12",
      "headline": "Poland coach Probierz resigns after Lewandowski captaincy rowPoland manager Michal Probierz resigned on Thursday following a row over his decision to replace the country's record goalscorer Robert Lewandowski as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-steve-smith-embarrassed-after-being-dismissed-by-part-timer-aiden-markram-2739715-2025-06-12",
      "headline": "Steve Smith embarrassed after being dismissed by part-timer Markram in WTC finalSteve Smith was not pleased after his dismissal to Aiden Markram in the first innings of the WTC Final. The Aussie was unable to comprehend how he got out to a part-time bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-2-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2739683-2025-06-12",
      "headline": "AUS vs SA Live: Australia look to stretch lead after Cummins blows SA awayAustralia vs South Africa WTC Final 2025 Day 2 Live: Australia captain Pat Cummins picks up a sensational six-wicket haul to bowl South Africa out for 138 and help his team secure a 74-run first-innings lead in the ultimate World Test Championship final at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-needs-time-to-rise-captains-are-not-made-in-1-2-months-harbhajan-singh-2739787-2025-06-12",
      "headline": "Shubman Gill needs time to rise, captains are not made in 1-2 months: Harbhajan SinghFormer India cricketer Harbhajan Singh has backed Shubman Gill to succeed as Test skipper, but said that the youngster will need some time to rise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/poland-manager-michal-probierz-resigns-lewandowski-captaincy-dispute-2739776-2025-06-12",
      "headline": "Poland coach Probierz resigns after Lewandowski captaincy rowPoland manager Michal Probierz resigned on Thursday following a row over his decision to replace the country's record goalscorer Robert Lewandowski as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-steve-smith-embarrassed-after-being-dismissed-by-part-timer-aiden-markram-2739715-2025-06-12",
      "headline": "Steve Smith embarrassed after being dismissed by part-timer Markram in WTC finalSteve Smith was not pleased after his dismissal to Aiden Markram in the first innings of the WTC Final. The Aussie was unable to comprehend how he got out to a part-time bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-2-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2739683-2025-06-12",
      "headline": "AUS vs SA Live: Australia look to stretch lead after Cummins blows SA awayAustralia vs South Africa WTC Final 2025 Day 2 Live: Australia captain Pat Cummins picks up a sensational six-wicket haul to bowl South Africa out for 138 and help his team secure a 74-run first-innings lead in the ultimate World Test Championship final at Lord's."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}