{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-are-gold-and-silver-prices-rising-again-this-week-2826268-2025-11-26",
      "headline": "Why are gold and silver prices rising again this week?Prices of gold and silver have moved up once more, with global economic signals and firmer market demand driving this renewed momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/air-pollution-health-insurance-costlier-premiums-risk-explained-2826252-2025-11-26",
      "headline": "Will worsening air quality make your health insurance premium costlier?As pollution worsens across Indian cities, are health insurers preparing to charge residents more for risks they cannot control? The big question now is how soon premiums will change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-do-you-accurately-calculate-your-pf-balance-without-logging-in-2826225-2025-11-26",
      "headline": "How do you accurately calculate your PF balance without logging in?Checking your PF balance no longer requires a portal login. Several quick offline and mobile-based tools now let you check it instantly using just your phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-planning-fixed-deposits-risks-inflation-strategy-explained-2826188-2025-11-26",
      "headline": "The retirement mistake that quietly burns your savingsMany retirees feel safest locking their life savings into fixed deposits. Financial planners warn that this comfort comes at a cost, as inflation and low returns can quietly weaken long-term retirement wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-delays-explained-income-tax-department-shares-expected-timeline-2826167-2025-11-26",
      "headline": "ITR refund delays explained: Tax department shares expected timelineSeveral taxpayers who filed their returns months ago are still waiting for refunds. The tax department has now explained the reasons and shared when refunds are expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-nifty-up-why-reasons-us-fed-rate-cut-optimism-crude-oil-wall-street-bse-nse-2826141-2025-11-26",
      "headline": "Sensex jumps 900 points: 5 reasons why stock market is rising todayThe S&P BSE Sensex jumped 751.75 points to 85,338.76, while the NSE Nifty50 rose 237.25 points to 26,122.05 by 11:08 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-confusing-investment-tools-with-goals-are-costing-you-2826132-2025-11-26",
      "headline": "How confusing investment tools with goals are costing youIt's easy to fall for traps with exciting returns, lifestyle upgrades, peer pressure or the \"this stock is the next big thing\" buzz. But life rarely hands you one challenge at a time. School fees, a home loan, a parent's health emergency or an unexpected crisis – they can all come together. Hence, relying on just one tool is like trying to build a house with no foundation – one storm and the whole thing collapses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-share-price-down-why-3-percent-block-deal-35-crore-shares-indian-continent-investment-singtel-2826094-2025-11-26",
      "headline": "Explained: Why Bharti Airtel shares are down 3% todayBharti Airtel share price: Around 3.5 crore shares, equal to nearly 0.6% of Airtel's equity, were traded at Rs 2,108 apiece in the block deal window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-nearly-200-points-higher-nifty-above-25900-airtel-down-3-percent-2826061-2025-11-26",
      "headline": "Sensex opens nearly 200 points up, Nifty above 25,900; Airtel down 3%The S&P BSE Sensex added 274.90 points to 84,861.91, while the NSE Nifty50 gained 83.25 points to 25,968.05 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-allotment-status-check-bse-mufg-online-guide-listing-date-latest-gmp-2826058-2025-11-26",
      "headline": "Sudeep Pharma IPO allotment today: Step-by-step status check and listing dateThe three-day subscription window, which closed on November 25, saw the IPO race towards nearly 100 times subscription, reflecting strong interest across investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-listing-today-expected-share-price-stock-open-higher-lower-latest-gmp-2826041-2025-11-26",
      "headline": "Excelsoft Technologies IPO listing today: Will the stock open higher or lower?The allotment of shares was completed on November 24, and with the kind of subscription numbers the company has posted, many retail investors are hoping for a firm opening on the exchanges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-may-hike-prices-early-next-quarter-2825935-2025-11-25",
      "headline": "Tata Motors may hike prices early next quarterChandra said Tata Motors currently holds 16–17 per cent share in the SUV segment, and the Sierra is expected to lift this to 20–25 per cent once fully ramped up."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-november-russian-oil-imports-set-to-hit-five-month-high-amid-us-tariffs-2825865-2025-11-25",
      "headline": "India's November Russian oil imports set to hit 5-month high amid US tariffsIndia, the world's third-largest oil importer, has been the biggest buyer of discounted seaborne Russian crude after Russia was shunned by Western countries following its 2022 invasion of Ukraine.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-314-points-lower-nifty-below-26000-infosys-down-1-percent-2825677-2025-11-25",
      "headline": "Sensex closes 314 points lower, Nifty below 26,000; Infosys down 1%The S&P BSE Sensex lost 313.70 points to close at 84,587.01, while the NSE Nifty50 was down by 74.70 points to end at 25,884.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-code-implementation-do-new-codes-hit-narayana-murthy-9-9-6-dreams-work-life-balance-working-hours-2825644-2025-11-25",
      "headline": "Do new Labour Codes hit Narayana Murthy's 9-9-6 dreams?India's new Labour Codes cap workweeks at 48 hours, with flexibility on scheduling, overtime pay, and a mandatory day of rest. But as industry leaders like Narayana Murthy push for 72-hour weeks and L&T's SN Subrahmanyan praises 90-hour schedules, many are raising questions whether these reforms will hold ground in a culture where overwork is routine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-listing-day-price-stock-market-debut-how-its-fixed-pre-open-session-volume-demand-bse-nse-2825623-2025-11-25",
      "headline": "Waiting for your IPO to list? Here's how opening price on markets is decidedMost retail investors have little idea how the opening price for an IPO is decided. They often rely on grey market premium (GMP), hype, and subscription figures to guess the listing level, even though none of these factors directly set the price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-fixed-term-employment-boost-full-time-jobs-at-risk-explained-2825593-2025-11-25",
      "headline": "Do the new labour codes put full-time jobs at risk?Fixed-term jobs just got a major boost under the new labour codes. But does this new flexibility mean full-time roles are at risk, or will companies find a new balance altogether?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-progress-energy-shift-crude-oil-russia-lpg-progress-2825457-2025-11-25",
      "headline": "India–US trade deal looks quiet. The 'energy' shift tells another storyIndia and the US may look stalled on a formal trade deal, but shifting oil flows, a major LPG pact and calibrated tariff moves show the real progress is happening quietly behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-down-100-points-nifty-below-26000-infosys-down-1-percent-2825434-2025-11-25",
      "headline": "Sensex opens 100 points lower, Nifty below 26,000; Infosys down 1%The S&P BSE Sensex was down by 16.48 points to 84,884.23, while the NSE Nifty50 lost 4.55 points to 25,954.95 as of 9:28 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-review-should-you-bid-day-3-subscription-2825433-2025-11-25",
      "headline": "Sudeep Pharma IPO closes today: Is it worth a bid? Check the GMPThe Rs 895-crore IPO includes a fresh issue of Rs 95 crore and an offer for sale worth Rs 800 crore. The price band is set at Rs 563 to Rs 593 per share, and the minimum investment for retail buyers is Rs 14,825."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dont-judge-him-palaash-muchhal-cousin-after-wedding-smriti-put-on-hold-2826247-2025-11-26",
      "headline": "Don't judge him: Palaash Muchhal's cousin after wedding with Smriti is put on hold Singer Palaash Muchhal's cousin has urged the public not to speculate or judge amid swirling cheating rumours. The singer's wedding with cricketer Smriti Mandhana was postponed due to a family medical emergency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jennie-joins-exchange-4-guest-panelist-blackpink-world-tour-break-2826250-2025-11-26",
      "headline": "Blackpink's Jennie joins Korean dating show EXchange 4 cast as panelist BLACKPINK's Jennie will make a guest appearance as a panel member on TVING's dating show EXchange 4, with filming scheduled during her tour break. The confirmation marks her return to Korean variety television."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-season-5-guide-india-release-date-time-and-all-theres-to-know-2826253-2025-11-26",
      "headline": "Stranger Things Season 5 India release date, time and all you should know Netflix to release Stranger Things season 5 in multiple volumes, with the first episodes arriving in India on November 27 and the finale scheduled for New Year's Day. Here's all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-divides-pakistan-lyari-residents-over-town-portrayal-2826185-2025-11-26",
      "headline": "Ranveer Singh's Dhurandhar divides Pakistan's Lyari residents over town's portrayal Ranveer Singh's 'Dhurandhar', recreating Pakistan's Lyari gang wars, drew mixed reactions from locals who criticised actors' portrayals but acknowledged the film capturing their town's environment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/love-war-leaked-photos-ranbir-kapoor-alia-bhatt-sanjay-leela-bhansali-2826207-2025-11-26",
      "headline": "Alia Bhatt-Ranbir Kapoor's retro looks from Love & War set spark buzz Photos of Ranbir Kapoor in army attire and Alia Bhatt in retro glamour from Sanjay Leela Bhansali's upcoming film Love & War have gone viral, generating excitement among fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gabriella-demetriades-gives-glimpse-family-time-arjun-rampal-birthday-unseen-photos-2826204-2025-11-26",
      "headline": "Gabriella gives a glimpse of family time with Arjun Rampal on his birthday On actor Arjun Rampal's birthday, his partner Gabriella Demetriades posted a personal tribute on social media. She offered a glimpse into their family life by sharing unseen photos with each other and their kids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/go-won-hee-and-husband-part-ways-after-two-years-agency-confirms-amicable-split-2826209-2025-11-26",
      "headline": "Welcome to Waikiki star Go Won-hee confirms split from husband after two years South Korean actor Go Won-hee and her husband have officially separated after two years of marriage, according to a statement released by her agency Ghost Studio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-79-sanjana-refuses-to-apologise-bharani-misses-captaincy-2826177-2025-11-26",
      "headline": "Bigg Boss Telugu 9 Day 79: Sanjana refuses to apologise, Bharani misses captaincy After the explosive Day 78 nominations, emotions ran high in the Bigg Boss house as Sanjana refused to apologise for her controversial remark about Ritu, setting off another round of confrontations before the captaincy tasks kicked off with former contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sunny-sanskari-ki-tulsi-kumari-on-ott-release-when-and-where-to-watch-varun-dhawan-janhvi-kapoor-film-2826203-2025-11-26",
      "headline": "Sunny Sanskari Ki Tulsi Kumari on OTT: When and where to watch Varun-Janhvi's film After a theatrical release in October, the third instalment in the Dulhania franchise, Sunny Sanskari Ki Tulsi Kumari, will premiere on Netflix in November. The film features Varun Dhawan and Janhvi Kapoor, with an ensemble cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-joins-un-women-india-to-combat-digital-violence-against-women-and-girls-2826192-2025-11-26",
      "headline": "Samantha joins UN Women India to combat digital violence against women and girls Actor Samantha Ruth Prabhu collaborated with UN Women India for the 2025 16 Days of Activism campaign, highlighting the growing issue of online abuse targeting women and girls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-reflects-on-saiyaara-fame-i-cry-once-a-week-looking-at-fan-edits-2826176-2025-11-26",
      "headline": "Aneet Padda reflects on Saiyaara fame: I cry once a week looking at fan edits Actor Aneet Padda discussed the emotional impact of her growing fan base after 'Saiyaara'. The 23-year-old revealed that she often cries at fan-made edits while preparing for her next project, 'Shakti Shalini'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-death-halts-apne-sequel-anil-sharma-confirms-cancellation-2826159-2025-11-26",
      "headline": "Without Dharamji, impossible: Anil Sharma halts Apne sequel after actor's death Director Anil Sharma recently shared that the planned sequel will not be made after the death of veteran actor Dharmendra, marking a personal and professional loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hugh-jackman-wolverine-return-marvel-multiverse-avengers-rumours-2826164-2025-11-26",
      "headline": "Hugh Jackman teases Wolverine comeback, refuses to shut the door Actor Hugh Jackman has addressed ongoing speculation about his future as Wolverine, following his recent return in Deadpool & Wolverine and amid rumours of further appearances in upcoming Marvel films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/agra-director-kanu-behl-refuses-intimacy-coordinator-for-sex-scenes-read-why-2825984-2025-11-26",
      "headline": "Agra director Kanu Behl refuses intimacy coordinator for sex scenes. Read why Director Kanu Behl, in an exclusive interview with India Today, talks of his movi 'Agra', which offers a raw look at sexual repression stemmed from characters he observed closely in his life. He spoke of why the intense sex scenes in the film are vital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stephen-trailer-gomanthi-shankar-netflix-thriller-explores-guilt-morality-2826147-2025-11-26",
      "headline": "Stephen trailer: Gomanthi Shankar's Netflix thriller explores guilt, morality The trailer for the upcoming Tamil thriller 'Stephen' has been released. Directed by first-time filmmaker Mithun Balaji, the film features Gomathi Shankar in his debut leading role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-release-date-trailer-audio-launch-cast-2026-pongal-2826156-2025-11-26",
      "headline": "Thalapathy Vijay's Jana Nayagan trailer to be launched on December 31: Report Anticipation builds among fans as rumors circulate regarding the December release dates for the second single and trailer of Thalapathy Vijay's upcoming film 'Jana Nayagan', amidst the absence of official confirmation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dharmendra-honoured-56th-iffi-closing-ceremony-sholay-celebrations-2826121-2025-11-26",
      "headline": "IFFI 2025: Dharmendra to be honoured at Goa fest but 4K Sholay screening cancelled Organisers of the International Film Festival of India (IFFI) will pay respects to Dharmendra at the fest's closing ceremony. Meanwhile, the special screening of the classic film Sholay has been cancelled due to technical reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/erotic-scenes-no-nudity-pisasu-2-andrea-jeremiah-clarifies-content-2826113-2025-11-26",
      "headline": "Andrea Jeremiah on Pisasu 2: There are erotic scenes in the film, but no nudity Andrea Jeremiah has addressed questions regarding the presence of nude scenes in Mysskin's film 'Pisasu 2', explaining that while the script originally included such scenes, they were ultimately not filmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hulu-renews-the-secret-lives-of-mormon-wives-for-20-episodes-season-4-early-2026-2826110-2025-11-26",
      "headline": "The Secret Lives of Mormon Wives renewed for 2 more seasons at Hulu Hulu has ordered 20 additional episodes of the reality series The Secret Lives of Mormon Wives, set to be split into Seasons 4 and 5, with the next season premiering in early 2026."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-guatam-gambhir-press-conference-2826243-2025-11-26",
      "headline": "Still the right man for Test job? Up to the BCCI to decide, says Gautam GambhirGautam Gambhir faced tough media questions after India's 0-2 Test series loss to South Africa in Guwahati. The defeat intensified scrutiny on his coaching as India suffer historic home whitewashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/please-wait-ill-call-you-rahul-gandhis-whatsapp-text-to-dk-shivakumar-amid-tussle-2826178-2025-11-26",
      "headline": "Rahul Gandhi's text to Shivakumar ahead of Congress's Dec 1 decision on Karnataka CMAmid Karnataka's leadership tussle and a decision due before the December 1 Parliament session, Rahul Gandhi replied to DK Shivakumar saying, \"Please wait, I will call you.\" DK Shivakumar is also seeking a meeting with Sonia Gandhi on November 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uri-hydro-plant-attack-pakistan-cisf-foiled-operation-sindoor-2826089-2025-11-26",
      "headline": "The 19 Bahadur: How CISF foiled Pakistan attack on Uri hydro plantUri Pakistan attack: After India launched Operation Sindoor, Pakistan targeted the Uri hydroelectric power projects in Jammu and Kashmir. However, a CISF team of 19 foiled the Pakistani attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-nifty-up-why-reasons-us-fed-rate-cut-optimism-crude-oil-wall-street-bse-nse-2826141-2025-11-26",
      "headline": "Sensex jumps 900 points: 5 reasons why stock market is rising todayThe S&P BSE Sensex jumped 751.75 points to 85,338.76, while the NSE Nifty50 rose 237.25 points to 26,122.05 by 11:08 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/joe-rogan-raves-about-ellora-kailasa-temple-carved-top-to-bottom-monolith-rock-here-why-it-is-unique-2826186-2025-11-26",
      "headline": "Fu**ing insane: Joe Rogan raves about Kailasa Temple. Here's why it's uniqueTop American influencer and podcast host Joe Rogan raved about the Kailasa Temple in Maharashtra, saying his \"mind was blown\" by its symmetry and architecture. The 8th-century temple is the world's largest monolithic structure, carved top-down from a single rock."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nia-arrests-faridabad-resident-for-harbouring-red-fort-blast-terrorist-dr-umar-un-nabi-2826201-2025-11-26",
      "headline": "Al-Falah ward boy is 7th arrest in Delhi blast case, had aided bomber Dr UmarThe National Investigation Agency arrested a Faridabad resident for allegedly harbouring Delhi bomber immediately before the Delhi Red Fort car bomb blast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-industrial-scale-fraud-what-former-us-embassy-official-lawmaker-reveal-chennai-hydrabad-techie-visa-applications-2826235-2025-11-26",
      "headline": "H-1B is industrial-scale fraud: Sensational revelation by US official, ex-lawmakerFormer Congressman and economist Dave Brat and Indian-American diplomat Mahvash Siddiqui have alleged large-scale fraud in the H-1B visa programme, particularly at the Chennai consulate. Siddiqui claimed 80–90% of Indian H-1B applications were fraudulent, while Brat said just the Chennai district received 220,000 visas, far above the US cap. These claims raise fresh questions on visa integrity amid the Trump administration's crackdown on immigration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dont-judge-him-palaash-muchhal-cousin-after-wedding-smriti-put-on-hold-2826247-2025-11-26",
      "headline": "Don't judge him: Palaash Muchhal's cousin after wedding with Smriti is put on holdSinger Palaash Muchhal's cousin has urged the public not to speculate or judge amid swirling cheating rumours. The singer's wedding with cricketer Smriti Mandhana was postponed due to a family medical emergency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-midnight-rapido-ride-turns-into-heartwarming-tale-of-trust-in-captain-2826111-2025-11-26",
      "headline": "Bengaluru woman's midnight Rapido ride turns into tale of trust in her captainOn Instagram, Asha Mane shared a video documenting snippets from her 38-km Rapido journey, which she booked around 11:45 pm with just 6% phone battery left. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/shivakumar-vs-siddaramaiah-what-is-behind-karnataka-congress-crisis-november-revolution-2826264-2025-11-26",
      "headline": "Shivakumar vs Siddaramaiah: What's behind Karnataka Congress crisis?A leadership storm is sweeping Karnataka Congress, with Shivakumar loyalists camping in Delhi to push for a mid-term power shift despite public denials from both leaders. As the high command weighs its options ahead of December 1, the alleged 2.5-year power-sharing pact has reignited a tug-of-war between Siddaramaiah and Shivakumar camps."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/national-basketball-player-dies-haryana-rohtak-hoop-pole-collapse-sports-infrastructure-concerns-2826077-2025-11-26",
      "headline": "Teen dies in freak accident as basketball pole crushes him, tragedy on cameraThe incident occurred around 10 am at the sports ground in Haryana's Rohtak when the player was practising alone on the basketball court. The accident was captured on CCTV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/anxiety-gut-reaction-stress-hormones-bowel-urgency-2826134-2025-11-26",
      "headline": "Why you feel an instant urge to poop when anxious, science explainsFrom stress hormones to the gut–brain axis, there's real biology behind that sudden bathroom rush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-press-secretary-karoline-leavitt-family-member-detained-ice-immigration-2826140-2025-11-26",
      "headline": "White House press secretary Karoline Leavitt's family member detained by ICEBruna Caroline Ferreira, the mother of Karoline Leavitt's 11-year-old nephew, was detained by ICE agents earlier this month. Officials said her visa expired in June 1999."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-guwahati-whitewash-score-2826202-2025-11-26",
      "headline": "Humbled at home again: India lose Guwahati Test, whitewashed 0-2 by SAIndia vs South Africa, 2nd Test: South Africa rode on Simon Harmer's sensational six-wicket haul to decimate India by 408 runs in Guwahati on Wednesday. India slumped to their second successive whitewash in a home Test series in as many years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-pickup-overturns-tyre-burst-workers-injured-ias-officer-mahantesh-bilagi-dies-kalaburagi-accident-2826232-2025-11-26",
      "headline": "Video: Pickup truck veers off road, flips, lands on passengers after tyre burstA tyre burst caused a pickup vehicle to overturn on the Madikeri-Somwarpet highway in Karnataka, injuring several passengers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-cpm-candidate-10-year-sentence-greeted-by-cadre-bomb-attack-kannur-2826224-2025-11-26",
      "headline": "Video: Left cadre greets candidate after his conviction for bomb attack on copsA Kannur court sentenced CPM candidate VK Nishad and another man to 10 years for hurling bombs at police during a 2012 protest. Two others were acquitted. CPIM activists greeted the convicted men with slogans outside court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhopal-vit-university-violence-student-protests-jaundice-outbreak-2826227-2025-11-26",
      "headline": "Bhopal: Students vandalise VIT University, torch vehicles amid jaundice outbreakBhopal protest: The unrest at VIT University in Bhopal began on Tuesday night after around two dozen students fell ill with symptoms of jaundice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/love-war-leaked-photos-ranbir-kapoor-alia-bhatt-sanjay-leela-bhansali-2826207-2025-11-26",
      "headline": "Alia Bhatt-Ranbir Kapoor's retro looks from Love & War set spark buzzPhotos of Ranbir Kapoor in army attire and Alia Bhatt in retro glamour from Sanjay Leela Bhansali's upcoming film Love & War have gone viral, generating excitement among fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-jr-india-tour-taj-mahal-wildlife-bollywood-wedding-2826046-2025-11-26",
      "headline": "Trump Jr's India diary: Taj, temples, tigers and big Bollywood weddingDonald Trump Jr embarked on a dynamic week-long tour across India, engaging in heritage, conservation and high-profile events. His visit sparked social media buzz and hints at future business ties with Indian industrialists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-senyar-strait-of-malacca-indonesia-imd-bay-of-bengal-low-pressure-tamil-nadu-kerala-2826102-2025-11-26",
      "headline": "Cyclone Senyar forms over Strait of Malacca, heavy rain alert for region Live updatesCyclonic Storm Senyar formed over the Strait of Malacca after a deep depression intensified early Wednesday. IMD said the system will cross the Indonesia coast before weakening. A separate well-marked low is strengthening over the southwest Bay of Bengal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/google-meet-down-today-several-users-report-connectivity-issue-2826205-2025-11-26",
      "headline": "Google Meet down today: Several users report connectivity issueGoogle Meet faced a major web outage affecting thousands of desktop users today. The disruption left many unable to join calls, while mobile app users remained connected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-bilaspur-couple-murder-suicide-affair-lipstick-note-2826171-2025-11-26",
      "headline": "Couple found dead at home, lipstick message on wall; cops suspect murder-suicideA married couple was found dead in their Bilaspur home in a suspected murder-suicide. The husband's lipstick note accuses his wife of an extramarital affair, and names another man."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-divides-pakistan-lyari-residents-over-town-portrayal-2826185-2025-11-26",
      "headline": "Ranveer Singh's Dhurandhar divides Pakistan's Lyari residents over town's portrayalRanveer Singh's 'Dhurandhar', recreating Pakistan's Lyari gang wars, drew mixed reactions from locals who criticised actors' portrayals but acknowledged the film capturing their town's environment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/love-war-leaked-photos-ranbir-kapoor-alia-bhatt-sanjay-leela-bhansali-2826207-2025-11-26",
      "headline": "Alia Bhatt-Ranbir Kapoor's retro looks from Love & War set spark buzzPhotos of Ranbir Kapoor in army attire and Alia Bhatt in retro glamour from Sanjay Leela Bhansali's upcoming film Love & War have gone viral, generating excitement among fans. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-sack-2826239-2025-11-26",
      "headline": "Sack Gambhir? Pressure mounts as India lose Test series 0–2 to South Africa IND vs SA: India have been blanked at home for the second time in the Gautam Gambhir era. The calls for sacking the head coach are louder than ever after India surrendered at home against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-guatam-gambhir-press-conference-2826243-2025-11-26",
      "headline": "Still the right man for Test job? Up to the BCCI to decide, says Gautam Gambhir Gautam Gambhir faced tough media questions after India's 0-2 Test series loss to South Africa in Guwahati. The defeat intensified scrutiny on his coaching as India suffer historic home whitewashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-regains-no-1-icc-odi-batting-ranking-ahead-south-africa-series-2826242-2025-11-26",
      "headline": "Rohit Sharma back to No. 1 in ODI rankings ahead of South Africa series Former India captain Rohit Sharma has dethroned New Zealand star Daryl Mitchell to reclaim the top spot in the ICC ODI batting rankings ahead of the South Africa series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-india-2-0-guwahati-test-rishabh-pant-reaction-2826219-2025-11-26",
      "headline": "Can't take cricket for granted: Rishabh Pant lost for words after SA whitewash Stand-in India captain Rishabh Pant cut a dejected figure as he tried to process another series whitewash at home, admitting that the hosts had been outplayed in every department after a meek surrender on Day 5 of the second Test in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-wtc-points-table-gautam-gambhir-pakistan-2826213-2025-11-26",
      "headline": "India slip behind Pakistan, drop to No.5 in WTC standings after 0–2 loss to South Africa The Indian team fell behind Pakistan in the World Test Championships points table after their embarrassing whitewash against South Africa. The Rishabh Pant-led team lost by 408 runs against the Proteas in the second and final Test match of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-guwahati-whitewash-score-2826202-2025-11-26",
      "headline": "Humbled at home again: India lose Guwahati Test, whitewashed 0-2 by SA India vs South Africa, 2nd Test: South Africa rode on Simon Harmer's sensational six-wicket haul to decimate India by 408 runs in Guwahati on Wednesday. India slumped to their second successive whitewash in a home Test series in as many years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-dhruv-jurel-fails-bat-gambhir-kumble-2826191-2025-11-26",
      "headline": "Dhruv Jurel fails: Anil Kumble rues too many experiments under Gautam Gambhir IND vs SA: Youngster Dhruv Jurel, playing as a specialist batter against South Africa, failed in both Test matches. As criticism mounted on the youngster, legendary Anil Kumble came to the batter's defense and questioned India's team selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-guwahati-test-shukri-conrad-grovel-anil-kumble-dale-steyn-react-2826179-2025-11-26",
      "headline": "Didn't expect this from South Africa: Coach's grovel remark irks Anil Kumble IND vs SA: South Africa coach Shukri Conrad's use of the word 'grovel' has drawn sharp criticism from cricket legends Anil Kumble and Dale Steyn. The remark has stirred debate over its historic racial connotations and appropriateness during a dominant Test series in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/specially-abled-teen-creates-history-completes-400m-race-in-gandharbal-ytvd-2826129-2025-11-26",
      "headline": "Gandharbal's Glory: Teen Inspires After Completing Athletic Meet Post 15 Surgeries A 15-year-old specially-abled girl from Gandharbal has created history by completing a 400-meter track event at a recent athlete meet. This achievement is notable as it came after the teenager underwent multiple surgeries on her knees and legs. The report highlights that despite physical challenges, she participated and finished the race, bringing glory to the Gandharbal district. Her determination was recognized and she was felicitated by the Indian Army for her accomplishment. The story focuses on her journey and the significance of her participation in the athletic competition, positioning her as an inspirational figure for the region. The report from Srinagar covers the details of her story and the impact of her historic run at the Gandharbal athlete meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-virat-kohli-ranchi-saurabh-tiwary-airport-odis-2826127-2025-11-26",
      "headline": "Watch: Virat Kohli welcomed by ex-RCB teammate at Ranchi airport before SA ODIs India vs South Africa: Virat Kohli arrived in Ranchi on Wednesday for the ODI series opener, which will be played in the city on November 30. The former captain was welcomed by Saurabh Tiwary, his former RCB teammate and the secretary of the JSCA. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-ownership-dispute-ali-khan-tareen-exits-multan-sultans-pcb-legal-battle-2826106-2025-11-26",
      "headline": "PSL turmoil: Multan Sultans owner quits amid rift with Pakistan Cricket Board PSL: Ali Khan Tareen has confirmed his departure as Multan Sultans owner following the PCB's decision not to offer a renewal. The move comes amid ongoing tensions, legal notices, and public criticism, leaving the franchise's future uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-dhruv-jurel-fails-bat-gambhir-kumble-2826191-2025-11-26",
      "headline": "Dhruv Jurel fails: Anil Kumble rues too many experiments under Gautam Gambhir IND vs SA: Youngster Dhruv Jurel, playing as a specialist batter against South Africa, failed in both Test matches. As criticism mounted on the youngster, legendary Anil Kumble came to the batter's defense and questioned India's team selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-guwahati-test-shukri-conrad-grovel-anil-kumble-dale-steyn-react-2826179-2025-11-26",
      "headline": "Didn't expect this from South Africa: Coach's grovel remark irks Anil Kumble IND vs SA: South Africa coach Shukri Conrad's use of the word 'grovel' has drawn sharp criticism from cricket legends Anil Kumble and Dale Steyn. The remark has stirred debate over its historic racial connotations and appropriateness during a dominant Test series in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/specially-abled-teen-creates-history-completes-400m-race-in-gandharbal-ytvd-2826129-2025-11-26",
      "headline": "Gandharbal's Glory: Teen Inspires After Completing Athletic Meet Post 15 Surgeries A 15-year-old specially-abled girl from Gandharbal has created history by completing a 400-meter track event at a recent athlete meet. This achievement is notable as it came after the teenager underwent multiple surgeries on her knees and legs. The report highlights that despite physical challenges, she participated and finished the race, bringing glory to the Gandharbal district. Her determination was recognized and she was felicitated by the Indian Army for her accomplishment. The story focuses on her journey and the significance of her participation in the athletic competition, positioning her as an inspirational figure for the region. The report from Srinagar covers the details of her story and the impact of her historic run at the Gandharbal athlete meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-virat-kohli-ranchi-saurabh-tiwary-airport-odis-2826127-2025-11-26",
      "headline": "Watch: Virat Kohli welcomed by ex-RCB teammate at Ranchi airport before SA ODIs India vs South Africa: Virat Kohli arrived in Ranchi on Wednesday for the ODI series opener, which will be played in the city on November 30. The former captain was welcomed by Saurabh Tiwary, his former RCB teammate and the secretary of the JSCA. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-ownership-dispute-ali-khan-tareen-exits-multan-sultans-pcb-legal-battle-2826106-2025-11-26",
      "headline": "PSL turmoil: Multan Sultans owner quits amid rift with Pakistan Cricket Board PSL: Ali Khan Tareen has confirmed his departure as Multan Sultans owner following the PCB's decision not to offer a renewal. The move comes amid ongoing tensions, legal notices, and public criticism, leaving the franchise's future uncertain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/haryanas-rising-basketball-star-hardik-dies-in-freak-accident-on-court-in-rohtak-ytvd-2826079-2025-11-26",
      "headline": "Caught on CCTV: National-level player dies after basketball hoop falls on himThis report covers the death of 16-year-old national-level basketball player, in a tragic accident in Lakhan Majra, Rohtak. The incident occurred when a basketball pole crashed down on him while he was practicing alone on the court. The event, captured on CCTV, has raised serious questions about the quality and safety of sports infrastructure in the state. According to India Today's Aman Bharadwaj, 'people and sportsmen do question that how come the preparations being made, the infrastructure is being established, that the pole or the things in the basketball court, they are taking lives.' This is reportedly the second such incident in Haryana in a week, following a similar death in Bahadurgarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-pep-talk-india-south-africa-test-day-5-guwahati-2826073-2025-11-26",
      "headline": "Gautam Gambhir delivers fiery Day 5 pep talk as India fight to save Guwahati TestIndia head coach Gautam Gambhir delivered an intense pep talk before Day 5 of the 2nd Test against South Africa. India began the final day needing 522 runs to win while South Africa needed eight wickets to secure a historic 2-0 sweep of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-manchester-city-barcelona-lose-chelsea-napoli-bayer-2826026-2025-11-26",
      "headline": "Champions League: Chelsea thrash Barcelona, Leverkusen stun Manchester CityChampions League: Defensive lapses cost Manchester City and Barcelona dearly as both teams slumped to notable losses on Tuesday, undoing promising starts and leaving both giants facing growing scrutiny in the league phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-left-arm-seamer-struggles-india-vs-south-africa-test-2826012-2025-11-26",
      "headline": "How Yashasvi can learn from Sachin Tendulkar's SCG masterclass to regain formIND vs SA: Yashasvi Jaiswal's issues against left-arm seamers have resurfaced, with Marco Jansen removing him three times in four innings in the ongoing Test series, firmly exposing a growing weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-live-score-day-5-guwahati-updates-2826011-2025-11-26",
      "headline": "2nd Test Day 5 Highlights: South Africa complete 2-0 series whitewash over IndiaIndia (IND) vs South Africa (SA) 2nd Test Day 5 Highlights: Simon Harmer delivered a sensational spell, claiming a six-wicket haul that played a pivotal role in South Africa's commanding 408-run victory in the second Test, sealing a 2-0 series whitewash over India after 25 years. His relentless accuracy and control dismantled India's batting lineup, leaving the hosts with no answers on a challenging surface in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-doing-his-job-suresh-raina-defends-self-belief-lack-exclusive-2825977-2025-11-26",
      "headline": "Gambhir doing his job, but players need belief: Raina defends India coachIND vs SA: Suresh Raina has backed Gautam Gambhir at a time when results have placed the Indian coach firmly under the scanner. For Raina, the real fix lies with the players rediscovering belief and responsibility at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-cheteshwar-pujara-advice-focus-batting-2825955-2025-11-25",
      "headline": "India must focus on batting well, not the target: Pujara's advice for Guwahati TestIND vs SA: Cheteshwar Pujara has urged India to shift their focus from the target and concentrate on batting properly in Guwahati. India have been left with the daunting task of attempting a chase of 549 to save the series"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/bret-hart-shawn-michaels-vince-mcmahon-sexual-relationship-claim-montreal-row-wwe-2825954-2025-11-25",
      "headline": "Bret Hart alleges sexual relationship between Shawn Michaels and Vince McMahonBret Hart's allegation has once again put Shawn Michaels and Vince McMahon under an intense spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-live-score-day-5-guwahati-updates-2826011-2025-11-26",
      "headline": "2nd Test Day 5 Highlights: South Africa complete 2-0 series whitewash over IndiaIndia (IND) vs South Africa (SA) 2nd Test Day 5 Highlights: Simon Harmer delivered a sensational spell, claiming a six-wicket haul that played a pivotal role in South Africa's commanding 408-run victory in the second Test, sealing a 2-0 series whitewash over India after 25 years. His relentless accuracy and control dismantled India's batting lineup, leaving the hosts with no answers on a challenging surface in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-doing-his-job-suresh-raina-defends-self-belief-lack-exclusive-2825977-2025-11-26",
      "headline": "Gambhir doing his job, but players need belief: Raina defends India coachIND vs SA: Suresh Raina has backed Gautam Gambhir at a time when results have placed the Indian coach firmly under the scanner. For Raina, the real fix lies with the players rediscovering belief and responsibility at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-cheteshwar-pujara-advice-focus-batting-2825955-2025-11-25",
      "headline": "India must focus on batting well, not the target: Pujara's advice for Guwahati TestIND vs SA: Cheteshwar Pujara has urged India to shift their focus from the target and concentrate on batting properly in Guwahati. India have been left with the daunting task of attempting a chase of 549 to save the series"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/bret-hart-shawn-michaels-vince-mcmahon-sexual-relationship-claim-montreal-row-wwe-2825954-2025-11-25",
      "headline": "Bret Hart alleges sexual relationship between Shawn Michaels and Vince McMahonBret Hart's allegation has once again put Shawn Michaels and Vince McMahon under an intense spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pathum-nissanka-unbeaten-98-leads-sri-lanka-win-over-zimbabwe-pakistan-t20i-tri-series-2825943-2025-11-25",
      "headline": "Pathum Nissanka's historic 98 keep Sri Lanka alive in tri-series with win vs ZimbabweSL vs ZIM: Pathum Nissanka's unbeaten 98 not only powered Sri Lanka to a nine-wicket win over Zimbabwe but also saw him surpass Kusal Perera as the nation's all-time leading T20I run-scorer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ravindra-jadeja-press-conference-guwahati-test-vs-south-africa-2825936-2025-11-25",
      "headline": "Trusting our defence will be key: Ravindra Jadeja hopes India save Guwahati TestIND vs SA, 2nd Test: In the press conference after the fourth day's play, Ravindra Jadeja said that India have a decent chance of drawing the second Test against South Africa if they manage to show effectiveness with their defensive game on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-wants-india-to-face-australia-in-t20-world-cup-final-2825925-2025-11-25",
      "headline": "India vs Australia in Ahmedabad: Surya picks T20 World Cup finalists, sledges RohitSuryakumar Yadav boldly named Australia as India's preferred T20 World Cup final opponents, even as Rohit Sharma stressed he simply wants India to reach the summit and come out on top against any team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-full-schedule-mens-t20-world-cup-2825870-2025-11-25",
      "headline": "Men's T20 World Cup 2026: Complete India schedule for mega eventIndia will begin their campaign in the Men's T20 World Cup 2026 against the United States on February 7 with their marquee clash against Pakistan on February 15 in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hinnaswamy-snubbed-again-bengaluru-misses-t20-world-cup-2026-2825899-2025-11-25",
      "headline": "T20 World Cup 2026: Chinnaswamy dropped again, Bengaluru remains off hosting dutiesThe M Chinnaswamy Stadium has once again been excluded from a major ICC event, with Bengaluru missing out on hosting duties for the T20 World Cup 2026. The omission comes months after the IPL 2025 stampede and follows similar venue changes during the Women's World Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-schedule-announced-india-vs-pakistan-2825892-2025-11-25",
      "headline": "T20 World Cup 2026 schedule: Check venue, date for IND vs PAK matchThe ICC announced the full schedule and venues of the upcoming T20 World Cup 2026. The headlining fixture that is India vs Pakistan is set to be played on February 15 in Colombo, Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-brand-ambassador-mens-t20-world-cup-2825882-2025-11-25",
      "headline": "Rohit Sharma named tournament ambassador for Men's T20 World Cup 2026Rohit Sharma has been named the tournament ambassador for the Men's T20 World Cup 2026. ICC chairman Jay Shah made the announcement at an event in Mumbai on Tuesday, November 25, where the tournament schedule was also unveiled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-guwahati-test-south-africa-coach-shukri-conrad-grovel-2825867-2025-11-25",
      "headline": "Wanted India to grovel: South Africa coach makes controversial remark in GuwahatiIND vs SA: South Africa coach Shukri Conrad sparked outrage in Guwahati after declaring he wanted India to \"grovel\", reigniting a historically loaded and provocative term in the wake of his side's dominant display on Day 4 of the second Test.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}