{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/securities-and-exchange-board-of-india-employees-silent-protest-mumbai-toxic-work-environment-2594534-2024-09-05",
      "headline": "Sebi employees stage silent protest at Mumbai office against 'toxic environment'Visuals showed scores of disgruntled employees gathered outside the main building, but within the Sebi headquarters' campus, staging a peaceful protest against the board's top management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prime-minister-narendra-modi-singapore-business-leaders-investment-opportunities-in-india-2594552-2024-09-05",
      "headline": "PM asks Singapore business leaders to look for investment opportunities in IndiaDuring the interaction, PM Modi said India had made transformative progress in the last 10 years and would continue on the same path given its strengths of political stability, policy predictability, ease of doing business, and its reform-oriented economic agenda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nris-face-double-tax-if-they-miss-filing-this-form-details-ddta-form-10f-trc-2594457-2024-09-05",
      "headline": "NRIs face double tax if they miss filing this form. Check detailsNRIs may face double taxation on the same income if their claim for tax relief under DTAA is denied. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bizarre-ipos-of-2024-sme-listings-resourceful-automobile-boss-packing-hariom-atta-spices-2594417-2024-09-05",
      "headline": "Bizarre IPOs of 2024: SME listings that no one saw comingWhile mainboard IPOs are the ones which attract the big bucks, the trend this year has been different with retail inventors breaking their banks for SME IPOs in a bizarre phenomenon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-bonus-share-issue-approved-11-ratio-for-shareholders-2594372-2024-09-05",
      "headline": "Reliance Industries approves 1:1 bonus shares for shareholdersThe announcement was made following the company's annual general meeting (AGM), where chairman Mukesh Ambani, had hinted at this move as a way to reward investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/markets-closing-bell-sensex-nifty-end-lower-as-cautious-investors-await-us-economic-data-2594315-2024-09-05",
      "headline": "Sensex, Nifty end lower as cautious investors await US economic dataThe S&P BSE Sensex lost 151.48 points to close at 82,201.16, while the NSE Nifty50 ended 53.60 points lower to end at 25,145.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rapido-indias-latest-unicorn-with-usd-11-billion-valuation-series-e-funding-2594291-2024-09-05",
      "headline": "Rapido becomes India's latest unicorn with $1.1 billion valuation The latest funding round saw participation from investors including WestBridge Capital, Think Investments and Invus Opportunities, alongside existing investor Nexus Ventures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rama-steel-tubes-shares-jump-20-percent-today-heres-why-partnership-onix-renewable-2594261-2024-09-05",
      "headline": "Rama Steel Tubes shares jump 20% today. Here's why Rama Steel has developed specialised steel structures and tracker tubes that are crucial for the long-term success of solar projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-jump-4-percent-key-triggers-icici-securities-target-price-2594227-2024-09-05",
      "headline": "Explained: Why Suzlon Energy shares jumped on 4% todaySuzlon Energy's stock rose 3.03% to Rs 76.43 on the BSE at 1:42 pm, after reaching an intraday high of Rs 77 earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-4-percent-anand-rathi-stock-target-price-24-percent-upside-2594206-2024-09-05",
      "headline": "Ola Electric shares jump 5% today. Will the rally continue?Ola Electric share price: Brokerage firm Anand Rathi has said that the stock looks \"oversold\" and that it has great potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-bonus-issue-board-approval-today-key-details-2594178-2024-09-05",
      "headline": "RIL board set to approve 1st bonus issue since 2017 today. Check detailsThe oil-to-telecom giant, led by Mukesh Ambani, is expected to propose a 1:1 bonus share issue, where investors will receive one bonus share for each share they own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shree-tirupati-balajee-ipo-opens-good-or-bad-subscribe-skip-expert-view-2594149-2024-09-05",
      "headline": "Shree Tirupati Balajee IPO opens for bidding: Should you subscribe?Shree Tirupati Balajee's IPO is a book-built issue comprising a fresh issue of 1.48 crore shares totalling Rs 122.43 crore and an offer for sale of 57 lakh shares amounting to Rs 47.23 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-slash-tax-rates-on-life-health-insurance-report-2594111-2024-09-05",
      "headline": "GST Council may reduce tax rates on life, health insurance premiums: ReportThe GST Council is expected to review recommendations from the fitment panel, which has been examining the 18% GST rate on health and life insurance products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-filing-rules-apply-from-september-2024-details-negative-liability-validation-bank-accounts-2594098-2024-09-05",
      "headline": "New GST filing rules apply from September 2024: All you need to know These new rules include adjustments to the reporting of high-value transactions, the validation of bank accounts, and an important update allowing the reporting of negative liability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-surges-brokerage-target-price-jp-morgan-overweight-2594084-2024-09-05",
      "headline": "Explained: Why Zomato shares surged over 7% in early tradeZomato share price: The food delivery giant's shares have surged in 2024, fuelled by optimistic brokerage outlooks, particularly for its quick commerce unit, Blinkit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-trade-flat-as-investors-remain-cautious-zomato-shares-jump-6-2594079-2024-09-05",
      "headline": "Sensex, Nifty trade flat as investors remain cautious; Zomato shares jump 6%The S&P BSE Sensex was down 26.89 points to 82,325.75 at 10:27 am, while the NSE Nifty50 fell 1.85 points to 25,196.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gala-precision-engineering-ipo-allotment-date-step-by-step-guide-to-check-status-gmp-today-2594078-2024-09-05",
      "headline": "Gala Precision Engineering IPO allotment: Step-by-step guide to check statusGala Precision Engineering IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-5-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2594067-2024-09-05",
      "headline": "Gold, silver price today, September 5, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 5 September 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-services-eyes-ipo-worth-usd-7-8-billion-by-end-of-fy24-report-hdfc-bank-2593812-2024-09-04",
      "headline": "HDB Financial Services eyes IPO worth $7–8 billion by end of FY24: ReportThe IPO is expected to be a mix of secondary sale and fresh capital, aiming for a valuation in the range of $7–8 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shree-tirupati-balajee-ipo-details-price-band-issue-size-opening-date-gmp-2593792-2024-09-04",
      "headline": "Shree Tirupati Balajee IPO: All you need to know before subscribingShree Tirupati Balajee's IPO is a book-built issue comprising a fresh issue of 1.48 crore shares totalling Rs 122.43 crore and an offer for sale of 57 lakh shares amounting to Rs 47.23 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/jammu-and-kashmir-polls-farooq-abdullah-national-conference-interview-article-70-2594577-2024-09-05",
      "headline": "Peace should be without troops: Farooq Abdullah jabs Centre ahead of J&K pollsFormer Jammu and Kashmir Chief Minister Farooq Abdullah has urged for peace to be established in the region without the deployment of troops. His remarks came ahead of the upcoming Assembly elections.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-day-8-india-medal-tally-kapil-parmar-judo-harvinder-singh-2594639-2024-09-06",
      "headline": "Paralympics: Kapil Parmar clinches judo bronze as India's medal tally hits 25Judoka Kapil Parmar was the star of the show as India's medal tally hit 25 on September 5, Thursday. Kapil became the first Judoka to win a medal at the Paralympics for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-amroha-school-principal-nursery-school-student-non-veg-food-suspend-2594579-2024-09-05",
      "headline": "UP school principal suspends nursery student for bringing non-veg foodThe incident came to light after a video of a heated argument between the principal and the child's mother surfaced online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-semi-final-live-updates-aryna-sabelenka-emma-navarro-jessica-pegula-karolina-muchova-2594656-2024-09-06",
      "headline": "US Open Semi-finals Live Updates: Karolina Muchova wins first set against PegulaUS Open 2024 Semi-finals Live Updates: World No.2 Aryna Sabalenka has qualified for the final at Flushing Meadows after beating Emma Navarro 6-3, 7-6 (7-2). USA's Jessica Pegula and Karolina Muchova will now face each other at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bizarre-ipos-of-2024-sme-listings-resourceful-automobile-boss-packing-hariom-atta-spices-2594417-2024-09-05",
      "headline": "Bizarre IPOs of 2024: SME listings that no one saw comingWhile mainboard IPOs are the ones which attract the big bucks, the trend this year has been different with retail inventors breaking their banks for SME IPOs in a bizarre phenomenon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hunter-biden-son-joe-biden-pleads-guilty-in-tax-evasion-case-2594676-2024-09-06",
      "headline": "Joe Biden's son Hunter pleads guilty in $1.4 million tax evasion caseIn a statement after the hearing, Biden said he pleaded guilty to spare his family from having to sit through a trial that would have aired messy details from a period of his life where he was suffering from drug addiction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/bihar-news-court-orders-arrest-of-constable-for-rs-20-bribe-saharsa-railway-station-1990-2594625-2024-09-05",
      "headline": "Court orders arrest of Bihar ex-cop who took Rs 20 as bribe 34 years agoSpecial Vigilance Judge Sudesh Srivastava directed the Director General of Police (DGP) to arrest and present the accused, Suresh Prasad Singh, before the court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-beats-emma-navarro-semi-final-report-2594674-2024-09-06",
      "headline": "Aryna Sabalenka powers past spirited Emma Navarro to book final berthUS Open 2024: Aryna Sabalenka made her way through to the final at Flushing Meadows after beating USA's Emma Navarro 6-3, 7-6 (7-2) on Thursday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/call-me-bae-review-ananya-panday-series-prime-video-2594643-2024-09-06",
      "headline": "'Call Me Bae' Review: Glitzy, desi Emily looking for purposeReleased-Fri Sep 06, 2024Ananya Panday-starrer 'Call Me Bae', which also marks her series debut, is now streaming on Prime Video. Deliberating on whether to watch it? Read the review first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-barabanki-road-accident-multi-vehicle-collision-cars-auto-dead-child-injured-2594677-2024-09-06",
      "headline": "5 of family, including child, dead in multi-vehicle collision in UPFive members of the same family, including a child, died and three others were critically injured after a speeding car collided with two vehicles in Barabanki. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/arvind-kejriwal-bail-plea-supreme-court-delhi-high-court-liquor-policy-case-cbi-2594438-2024-09-05",
      "headline": "Bail to Arvind Kejriwal will demoralise High Court: CBI argument in Supreme CourtThe CBI has expressed concerns over the potential demoralisation of the Delhi High Court if the Supreme Court granted bail to Delhi Chief Minister Arvind Kejriwal in the liquor policy case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/mumbais-lalbaugcha-raja-ganpati-idol-unveiled-ahead-of-ganesh-chaturthi-festival-video-2594629-2024-09-05",
      "headline": "Watch: Mumbai's Lalbaugcha Raja unveiled ahead of Ganesh ChaturthiLalbaugcha Raja, Mumbai most popular Ganesh idol, was unveiled on Thursday ahead of Ganesh Chaturthi. Devotees visit the Lalbaugcha Raja for darshan during the 10-day Ganesh festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/colin-gray-father-of-atlanta-georgia-suspected-school-shooter-killed-four-arrested-2594681-2024-09-06",
      "headline": "Father of US teen who killed 4 in Georgia school shooting arrestedThe father, Colin Gray, 54, was charged with four counts of involuntary manslaughter, two counts of second-degree murder and eight counts of cruelty to children."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rg-kar-case-trinamool-counters-bribery-charge-doctor-parents-video-2594428-2024-09-05",
      "headline": "RG Kar case: Trinamool counters bribery charge with doctor's parents' videoThe party's counter comes a day after the trainee doctor's parents stated that Kolkata Police had offered them money at their residence on the day their daughter died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/nostradamus-allan-lichtman-predicts-democratic-kamala-harris-will-win-presidential-race-republican-donald-trump-white-house-2594460-2024-09-05",
      "headline": "Nostradamus of US polls predicts a Kamala Harris victoryRenowned election forecaster Allan Lichtman, known for his accurate predictions using the 'Keys to the White House' model, has predicted that Vice President and Democratic nominee Kamala Harris will win the 2024 US presidential election, defeating Republican nominee Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/thalapathy-goat-greatest-of-all-time-diljit-dosanjh-music-album-goat-but-who-is-original-goat-muhammad-ali-roger-federer-virat-kohli-serena-williams-2594404-2024-09-05",
      "headline": "Thalapathy is GOAT, Diljit is GOAT, but who's the OG GOAT?Thalapathy Vijay's last film before he takes the political plunge was released on Thursday. It is called GOAT. Vijay is GOAT, Punjabi singer Diljit Dosanjh is GOAT, as are Virat Kohli and Roger Federer. But who is the OG GOAT? When and for whom was the acronym first used?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/securities-and-exchange-board-of-india-employees-silent-protest-mumbai-toxic-work-environment-2594534-2024-09-05",
      "headline": "Sebi employees stage silent protest at Mumbai office against 'toxic environment'Visuals showed scores of disgruntled employees gathered outside the main building, but within the Sebi headquarters' campus, staging a peaceful protest against the board's top management."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bahraich-wolves-revenge-tendency-loss-of-habitat-uttar-pradesh-2594400-2024-09-05",
      "headline": "UP forest official says revenge-taking habit may be behind Bahraich wolf terrorSanjay Pathak, general manager of UP Forest Corporation, said wolves have a tendency to seek revenge if their homes or children have been harmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/alarming-inventory-levels-but-pv-oems-continue-to-increase-dispatches-to-dealers-says-fada-2594556-2024-09-05",
      "headline": "Alarming inventory levels but PV OEMs continue to increase dispatches to dealers, says FADAThe PV wholesales (despatches from OEMs to dealerships) increased to 350,000-355,000 units in August 2024 from around 341,000 units in July 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/what-does-an-okinawa-diet-tweaked-for-the-indian-plate-look-like-2594125-2024-09-05",
      "headline": "What does an Okinawa diet tweaked for the Indian plate look like?From Japan to your plate, the Okinawa diet can be easily adapted for Indians by incorporating similar principles. Experts are here to guide you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/kapil-parmar-wins-india-first-ever-paralympic-medal-in-judo-2594520-2024-09-05",
      "headline": "Kapil Parmar wins India's first-ever Paralympic medal in JudoJudoka Kapil Parmar scripted history by winning the bronze medal in the men's -60kg J1 category at the Paris 2024 Paralympics on Thursday. Kapil's historic achievement has taken India's medal tally to 25, including 25 gold, 9 silver, and 11 bronze.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/2-students-dead-3-lose-limbs-school-bus-collides-karnataka-government-ksrtc-bus-2594675-2024-09-06",
      "headline": "2 students dead, 3 lose limbs in Karnataka school bus crashA Loyola School bus carrying 40 students collided with a Karnataka State Road Transport Corporation (KSRTC) bus in Raichur district. Two students were killed and three others lost their limbs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-cristiano-ronaldo-900th-goal-powers-portugal-win-over-croatia-2594673-2024-09-06",
      "headline": "Cristiano Ronaldo's 900th goal powers Portugal to win over CroatiaNations League: Cristiano Ronaldo made his 900th goal in his career as Portugal defeated Croatia 2-1 on Thursday. Ronaldo scored in the 34th minute of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-box-office-day-1-collection-vijay-the-greatest-of-all-time-rs-100-crore-worldwide-2594686-2024-09-06",
      "headline": "'GOAT' box office Day 1: Vijay's film takes a bumper opening worldwideThalapathy Vijay and director Venkat Prabhu's 'GOAT' aka 'The Greatest of All Time' is off to a flying start at the box office. Reportedly, the film has surpassed Rs 100 crore at the box office worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/call-me-bae-review-ananya-panday-series-prime-video-2594643-2024-09-06",
      "headline": "'Call Me Bae' Review: Glitzy, desi Emily looking for purposeReleased-Fri Sep 06, 2024Ananya Panday-starrer 'Call Me Bae', which also marks her series debut, is now streaming on Prime Video. Deliberating on whether to watch it? Read the review first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bts-jhope-jung-hoseok-buys-2-luxury-apartments-worth-rs-125-crore-in-seoul-report-2594642-2024-09-06",
      "headline": "BTS' J-Hope buys 2 luxury apartments worth Rs 125 crore in Seoul: ReportBTS member J-Hope has made a significant real estate investment by purchasing two luxury apartments in Seoul for around Rs 125 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bengali-actor-rituparna-sengupta-on-being-harassed-at-rg-kar-protest-says-i-could-have-died-2594635-2024-09-05",
      "headline": "Actor Rituparna Sengupta on being harassed at RG Kar protest: Could have diedBengali actor Rituparna Sengupta faced harassment and 'Go Back' slogans at a protest rally demanding justice for a trainee doctor's rape-murder. The actor was forced to leave the protest after being pushed and heckled by the crowd."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-emma-navarro-us-open-2024-karolina-muchova-jessica-pegula-2594689-2024-09-06",
      "headline": "US Open: Aryna Sabalenka unbothered to face any opponent in 2nd successive finalAryna Sabalenka is not worried about facing any opponent in the US Open final after she advanced through to the summit clash with a 6-3, 7-6 (2) victory over Emma Navarro."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruled-out-jos-buttler-frustrated-with-injury-as-he-works-hard-to-get-back-2594688-2024-09-06",
      "headline": "Ruled out Jos Buttler 'frustrated' with injury as he works hard to get backJos Buttler was ruled out from the T20I series vs Australia and expressed his frustration on missing out on a key series. He is recovering from a right calf injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-beats-emma-navarro-semi-final-report-2594674-2024-09-06",
      "headline": "Aryna Sabalenka powers past spirited Emma Navarro to book final berthUS Open 2024: Aryna Sabalenka made her way through to the final at Flushing Meadows after beating USA's Emma Navarro 6-3, 7-6 (7-2) on Thursday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-cristiano-ronaldo-900th-goal-powers-portugal-win-over-croatia-2594673-2024-09-06",
      "headline": "Cristiano Ronaldo's 900th goal powers Portugal to win over CroatiaNations League: Cristiano Ronaldo made his 900th goal in his career as Portugal defeated Croatia 2-1 on Thursday. Ronaldo scored in the 34th minute of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sara-errani-andrea-vavassori-mixed-doubles-title-2594658-2024-09-06",
      "headline": "Italy's Sara Errani and Andrea Vavassori win mixed doubles titleUS Open: Sara Errani and Andrea Vavassori won the mixed doubles title after beating USA's Taylor Townsend and Donald Young 7-6 (0), 7-5 on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-semi-final-live-updates-aryna-sabelenka-emma-navarro-jessica-pegula-karolina-muchova-2594656-2024-09-06",
      "headline": "US Open Semi-finals Live Updates: Karolina Muchova wins first set against PegulaUS Open 2024 Semi-finals Live Updates: World No.2 Aryna Sabalenka has qualified for the final at Flushing Meadows after beating Emma Navarro 6-3, 7-6 (7-2). USA's Jessica Pegula and Karolina Muchova will now face each other at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-9-schedule-prachi-yadav-para-athletics-simran-2594655-2024-09-06",
      "headline": "India at Paralympics 2024 schedule: Simran, Prachi, Dipesh in focusParalympics 2024: Simran, who finished fourth in the women's 100m T12 final, will be one of the athletes to watch out for when India step out on the ninth day of the quadrennial event in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-qualifies-diamond-league-final-brussels-2594653-2024-09-06",
      "headline": "Neeraj Chopra qualifies for Diamond League final Diamond League: Neeraj Chopra advanced to the final to be held in Brussels on September 13 and 14. Earlier, he put in his season's best throw of 89.49 metres in Lausanne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-day-8-india-medal-tally-kapil-parmar-judo-harvinder-singh-2594639-2024-09-06",
      "headline": "Paralympics: Kapil Parmar clinches judo bronze as India's medal tally hits 25Judoka Kapil Parmar was the star of the show as India's medal tally hit 25 on September 5, Thursday. Kapil became the first Judoka to win a medal at the Paralympics for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-dhananjaya-de-silva-urges-sri-lanka-joe-root-solve-batting-woes-2594650-2024-09-06",
      "headline": "Dhananjaya wants Sri Lanka batters to take inspiration from RootENG vs SL: Skipper Dhananjaya de Silva said that the Sri Lankan batters need to look at Joe Root, the leading run-scorer of the series, and learn how to convert their starts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-cherishes-close-friendship-ben-stokes-bazball-era-2594648-2024-09-06",
      "headline": "McCullum cherishes 'close friendship' with Ben Stokes in Bazball era Brendon McCullum talked about his relationship with Ben Stokes over the last two years since taking over as the head coach of the England men's Test team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-9-schedule-prachi-yadav-para-athletics-simran-2594655-2024-09-06",
      "headline": "India at Paralympics 2024 schedule: Simran, Prachi, Dipesh in focusParalympics 2024: Simran, who finished fourth in the women's 100m T12 final, will be one of the athletes to watch out for when India step out on the ninth day of the quadrennial event in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-qualifies-diamond-league-final-brussels-2594653-2024-09-06",
      "headline": "Neeraj Chopra qualifies for Diamond League final Diamond League: Neeraj Chopra advanced to the final to be held in Brussels on September 13 and 14. Earlier, he put in his season's best throw of 89.49 metres in Lausanne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-day-8-india-medal-tally-kapil-parmar-judo-harvinder-singh-2594639-2024-09-06",
      "headline": "Paralympics: Kapil Parmar clinches judo bronze as India's medal tally hits 25Judoka Kapil Parmar was the star of the show as India's medal tally hit 25 on September 5, Thursday. Kapil became the first Judoka to win a medal at the Paralympics for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-dhananjaya-de-silva-urges-sri-lanka-joe-root-solve-batting-woes-2594650-2024-09-06",
      "headline": "Dhananjaya wants Sri Lanka batters to take inspiration from RootENG vs SL: Skipper Dhananjaya de Silva said that the Sri Lankan batters need to look at Joe Root, the leading run-scorer of the series, and learn how to convert their starts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-cherishes-close-friendship-ben-stokes-bazball-era-2594648-2024-09-06",
      "headline": "McCullum cherishes 'close friendship' with Ben Stokes in Bazball era Brendon McCullum talked about his relationship with Ben Stokes over the last two years since taking over as the head coach of the England men's Test team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-born-ireland-simi-singh-dealing-life-threatening-illness-2594637-2024-09-05",
      "headline": "Ireland star Simi Singh dealing with 'life-threatening' illnessIreland cricketer Simi Singh, who's born in India, is currently going through a life threatening health issue. Cricket Ireland confirmed the news on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cole-palmer-left-out-of-chelseas-uefa-europa-conference-league-squad-2594630-2024-09-05",
      "headline": "Cole Palmer left out of Chelsea's UEFA Europa Conference League squadCole Palmer was one of the big names who has been left out of Chelsea's squad for the UEFA Europa Conference League group stage matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-simran-finishes-4th-in-womens-100m-t12-final-2594619-2024-09-05",
      "headline": "Simran misses podium finish, finishes 4th in Women's 100m T12 finalIndia's Simran Sharma narrowly missed out on a podium finish in the women's 100m T12 final at the 2024 Paris Paralympics, placing fourth at the Stade de France on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uswnt-legend-alex-morgan-retires-from-professional-football-2594594-2024-09-05",
      "headline": "USWNT legend Alex Morgan announces retirement from professional footballThe US Women's football legend Alex Morgan has announced her retirement on social media after sharing her pregnancy news. The 35-year-old will retire as a two-time Women's World Cup winner, and an Olympic gold medallist.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sports-minister-mansukh-mandaviya-india-best-medal-haul-paris-paralympics-2594560-2024-09-05",
      "headline": "Sports Minister Mandaviya lauds India's best-ever medal haul at Paris ParalympicsUnion Sports Minister Dr. Mansukh Mandaviya praised the Indian contingent for their record-breaking performance at the Paris Paralympics. India secured 25 medals, including five golds, surpassing their previous best from the Tokyo Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-archery-harvinder-singh-pooja-khanna-lose-bronze-medal-match-2594555-2024-09-05",
      "headline": "Paris Paralympics 2024: Harvinder-Pooja suffer heartbreak in bronze medal matchHarvinder Singh and Pooja Khanna suffered heartbreak in the bronze medal match as they lost to Slovenia's Dejan Fabcic and Ziva Lavrinc in a shootout at the Paris Paralympics 2024 on September 5, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-t20-world-cup-trophy-tour-bengaluru-touchdown-on-september-6-2594540-2024-09-05",
      "headline": "ICC Women's T20 World Cup Trophy Tour: Bengaluru touchdown on September 6The ICC Women's T20 World Cup 2024 Trophy Tour has started in Dubai, featuring the trophy at iconic landmarks. The tour will continue to India, Sri Lanka, and Bangladesh before returning to the UAE for the tournament's start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-judo-who-is-kapil-parmar-bronze-medal-2594531-2024-09-05",
      "headline": "Who is Kapil Parmar? How teacher's advice made Judoka a Paralympics medallistKapil Parmar listened to his teacher's advice to take up judo certainly changed his life as the Judoka brought home India's first medal in the discipline on September 5, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/sports-minister-mansukh-mandaviya-india-best-medal-haul-paris-paralympics-2594560-2024-09-05",
      "headline": "Sports Minister Mandaviya lauds India's best-ever medal haul at Paris ParalympicsUnion Sports Minister Dr. Mansukh Mandaviya praised the Indian contingent for their record-breaking performance at the Paris Paralympics. India secured 25 medals, including five golds, surpassing their previous best from the Tokyo Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-archery-harvinder-singh-pooja-khanna-lose-bronze-medal-match-2594555-2024-09-05",
      "headline": "Paris Paralympics 2024: Harvinder-Pooja suffer heartbreak in bronze medal matchHarvinder Singh and Pooja Khanna suffered heartbreak in the bronze medal match as they lost to Slovenia's Dejan Fabcic and Ziva Lavrinc in a shootout at the Paris Paralympics 2024 on September 5, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-t20-world-cup-trophy-tour-bengaluru-touchdown-on-september-6-2594540-2024-09-05",
      "headline": "ICC Women's T20 World Cup Trophy Tour: Bengaluru touchdown on September 6The ICC Women's T20 World Cup 2024 Trophy Tour has started in Dubai, featuring the trophy at iconic landmarks. The tour will continue to India, Sri Lanka, and Bangladesh before returning to the UAE for the tournament's start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-judo-who-is-kapil-parmar-bronze-medal-2594531-2024-09-05",
      "headline": "Who is Kapil Parmar? How teacher's advice made Judoka a Paralympics medallistKapil Parmar listened to his teacher's advice to take up judo certainly changed his life as the Judoka brought home India's first medal in the discipline on September 5, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-rishabh-pant-interview-rahul-dravid-balanced-gautam-gambhir-aggressive-2594530-2024-09-05",
      "headline": "Dravid was very balanced, Gambhir is aggressive about winning: Rishabh Pant Speaking on the sidelines of the Duleep Trophy match in Bengaluru, Rishabh Pant said Rahul Dravid was balanced as a professional during his stint as head coach. The wicketkeeper said Gautam Gambhir is someone who doesn't settle for anything less than victories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/kapil-parmar-wins-india-first-ever-paralympic-medal-in-judo-2594520-2024-09-05",
      "headline": "Kapil Parmar wins India's first-ever Paralympic medal in JudoJudoka Kapil Parmar scripted history by winning the bronze medal in the men's -60kg J1 category at the Paris 2024 Paralympics on Thursday. Kapil's historic achievement has taken India's medal tally to 25, including 25 gold, 9 silver, and 11 bronze.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/musheer-khan-hundred-reaction-rishabh-pant-advice-kuldeep-yadav-2594508-2024-09-05",
      "headline": "Musheer explains how Rishabh's advice helped him negate KuldeepYoung batter Musheer Khan credited Rishabh Pant's advice for his match-saving century against Shubman Gill's side in the Duleep Trophy. Musheer's unbeaten 105 rescued India B from a precarious position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-new-england-coach-backs-jos-buttler-captaincy-2594506-2024-09-05",
      "headline": "New England coach Brendon McCullum wants to put 'a smile back' on Jos ButtlerNew England white-ball coach Brendon McCullum has claimed that his job would be to put a smile back on Jos Buttler's face after his torrid time as the captain. Buttler came under criticism after England's poor World Cup campaigns. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}