{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2025-deadline-know-penalties-and-benefits-you-lose-for-missing-the-due-date-2787482-2025-09-15",
      "headline": "ITR 2025 deadline: Know penalties and benefits you lose for missing the due dateThe deadline to file Income Tax Returns (ITR) for 2025 is here, and missing it can cost more than just a late fee. From penalties to lost tax perks, here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-deadline-today-september-15-how-much-to-pay-and-penalty-for-delay-2787458-2025-09-15",
      "headline": "Advance tax deadline today: How much to pay and penalty for delayThe second instalment of advance tax for financial year 2026 is due on 15 September. Here's what individuals need to pay, who is liable, and the consequences of missing the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/value-stocks-to-buy-on-dalal-street-top-picks-auto-psu-railways-nbfc-bajaj-finance-2787450-2025-09-15",
      "headline": "Looking for value-based stocks to buy on Dalal Street? Here are the top picksExperts believe the current market offers good opportunities, especially in sectors that have seen recent corrections and are expected to benefit from domestic demand, GST reforms, and a good monsoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-today-key-faqs-for-last-minute-filers-2787427-2025-09-15",
      "headline": "ITR filing deadline today: Key FAQs for last-minute filersToday marks the final chance to file Income Tax Returns for AY 2025–26. As the deadline closes in, last-minute filers are rushing to the portal. Here are the answers to the most common questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/dev-accelerator-ipo-allotment-finalised-strong-subscription-listing-2025-2787414-2025-09-15",
      "headline": "Dev Accelerator IPO allotment today: Step-by-step guide to check status onlineThe share allotment for Dev Accelerator IPO was finalised on September 15, 2025. Investors can check their allotment status using official BSE or registrar websites following outlined procedures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-54-points-higher-nifty-above-25100-eternal-rises-1-percent-2787372-2025-09-15",
      "headline": "Sensex opens 54 points higher, Nifty above 25,100; Eternal rises 1%The S&P BSE Sensex was up by 57.17 points to 81,961.87, while the NSE Nifty50 added 5.35 points to 25,119.35 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-allotment-check-status-gmp-listing-date-profit-shares-rise-market-debut-2787348-2025-09-15",
      "headline": "Urban Company IPO allotment out today: Check status as GMP jumps ahead of debutUrban Comapny IPO allotment follows a strong response, with bidding exceeding 100 times during the three-day subscription period from September 10 to 12, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-20-reforms-big-win-for-every-citizen-finance-minister-nirmala-sitharaman-2787197-2025-09-14",
      "headline": "Tax reforms for rising Bharat: GST 2.0 big win for citizens, says Nirmala SitharamanThe Union Finance Minister said that GST reforms will be implemented much ahead of Prime Minister Narendra Modi's instructions of launching them before Deepavali festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tempest-k-drama-political-thriller-jun-ji-hyun-gang-dong-won-2787493-2025-09-15",
      "headline": "Tempest review: Jun Ji-hyun and Gang Dong-won headline a taut political spy dramaRelease Date:Wed Sep 10, 2025'Tempest' review: 'Tempest' is a political thriller focusing on a diplomat's wife navigating betrayal after an assassination. The series explores complex geopolitics and personal survival amid rising tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-upendra-and-priyanka-upendra-phone-hacked-2787483-2025-09-15",
      "headline": "Upendra, wife's phone hacked, actor urges contacts not to transfer moneyKannada actor-director Upendra announced on his Instagram stories that a hacker may have hacked his and his wife Priyanka's phones. The two urged their contacts not to respond to the hacker's money requests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sofia-vergara-eye-emergency-2025-emmys-stephen-graham-wins-best-actor-netflix-adolescence-2787438-2025-09-15",
      "headline": "Sofia Vergara skips Emmys 2025 after sudden eye allergy emergencySofía Vergara faced an unexpected eye emergency just hours before the 2025 Emmys, leading to her hospitalisation and absence from the event. Despite her setback, the ceremony saw memorable wins and historic moments, making it a night to cherish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-coolie-criticising-rajinikanth-cameo-team-denies-2787430-2025-09-15",
      "headline": "Aamir Khan hasn't seen Coolie yet: Actor's team denies criticising Rajinikanth filmAamir Khan Productions has issued a clarification, refuting fake news attributing remarks to Aamir Khan about the film Coolie. A doctored news clip claiming that Khan regretted signing the Rajinikanth-starrer had been going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-2-when-and-where-to-watch-adam-brody-kristen-bells-show-2787418-2025-09-15",
      "headline": "Nobody Wants This 2: When and where to watch Adam Brody, Kristen Bell's show'Nobody Wants This' is returning for a second season this October, delighting fans who loved its honest take on relationships and emotional struggles. The new season is set to dive deeper into themes of love, family, and self-discovery, with its release in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-cinema-2025-a-year-of-detox-reflection-and-slow-transformation-2787308-2025-09-15",
      "headline": "Kannada cinema 2025: Missing superstars, one Rs 100-crore hit and what lies aheadNine months in, Kannada cinema this year have mostly been about the little guy's shot at triumph. While some films gained attention, it has only been 'Su From So' that truly left a mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-collection-day-3-teja-sajja-film-nears-rs-50-crore-solid-first-weekend-in-india-2787387-2025-09-15",
      "headline": "Mirai box office Day 3: Teja Sajja film nears Rs 50 crore after solid 1st weekendTeja Sajja's 'Mirai' made a strong impact at the Indian box office during its first weekend. The fantasy action adventure is poised to cross the Rs 50 crore nett mark, showcasing rising audience interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/john-oliver-emmy-speech-censored-twice-during-live-broadcast-2787380-2025-09-15",
      "headline": "John Oliver's Emmy speech censored twice during live broadcastJohn Oliver was censored twice during his short, 15-second Emmy acceptance speech on live TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jake-gyllenhaal-surprises-youngest-emmy-nominee-owen-cooper-lucky-duck-gift-2787360-2025-09-15",
      "headline": "Owen Cooper overjoyed as Jake Gyllenhaal surprises him before Emmys 2025Jake Gyllenhaal surprised 15-year-old actor Owen Cooper before the 2025 Emmys. Cooper, the youngest ever nominee for Outstanding Supporting Actor in a Limited Series or Movie, received a special gift from his \"number one\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stephen-graham-signs-off-emmy-speech-with-namaste-after-adolescence-win-2787365-2025-09-15",
      "headline": "Stephen Graham signs off Emmy speech with a Namaste after Adolescence winStephen Graham, actor and co-creator of 'Adolescence', signed off his thank-you speech with \"Namaste\" after winning Best Lead Actor in a Limited or Anthology Series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/stephen-colbert-wins-best-talk-series-at-emmys-2025-2-months-after-cancellation-2787361-2025-09-15",
      "headline": "Anyone hiring, Stephen Colbert quips, gets standing ovation for Talk Series EmmyStephen Colbert signed off with laughs and tears at the 77th Emmys as 'The Late Show' finally scores its first Emmy after ten years. Even with the show's curtain call looming, Colbert promises one last joyride, celebrating a decade of sharp wit, real talk, and unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/noah-wyle-wins-lead-actor-emmy-for-the-pitt-britt-lower-takes-best-drama-actress-prize-for-severance-2787353-2025-09-15",
      "headline": "Emmys 2025: Noah Wyle wins Best Actor for The Pitt, Britt Lower for SeveranceNoah Wyle won Outstanding Lead Actor in a Drama Series for his performance in 'The Pitt', while Britt Lower bagged Outstanding Lead Actress in a Drama Series for her role in 'Severance'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-second-runner-up-tiff-2025-neeraj-ghaywan-indian-film-2787343-2025-09-15",
      "headline": "Homebound is 2nd runner-up at Toronto Film fest, director Neeraj Ghaywan thrilledDirector Neeraj Ghaywan's 'Homebound' secured second runner-up in the International People's Choice category at TIFF 2025. The film received a standing ovation at its North American premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/go-birds-free-palestine-hannah-einbinder-fiery-emmy-moment-2787334-2025-09-15",
      "headline": "Go Birds, f*** ICE, free Palestine: Hannah Einbinder's fiery Emmy momentAt the Emmy Awards 2025, actor Hannah Einbinder used her win to spotlight Gaza and immigrant rights in the US. Read her full speech highlights here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/emmy-awards-2025-red-carpet-sydney-sweeney-pedro-pascal-adam-brody-red-ca-2787333-2025-09-15",
      "headline": "Emmy Awards 2025: Sydney Sweeney, Pedro Pascal and more dazzle on the red carpetThe 77th Emmy Awards brought together television's biggest stars for a night filled with excitement, nervous anticipation, and major wins. Held at the Peacock Theater in Los Angeles, the evening blended glamour, celebration, and a few history-making moments as stars from the year's most popular shows took centre stage. Here are the top moments from Emmy 2025's red carpet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/owen-cooper-15-makes-history-as-youngest-male-actor-to-win-emmy-for-role-in-adolescence-2787329-2025-09-15",
      "headline": "Owen Cooper, 15, makes history as youngest male actor to win EmmyAt just 15, Owen Cooper became the youngest male acting winner in Emmy history with his Adolescence role. Here's a look at other young Emmy record-holders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmys-awards-2025-the-studio-severance-dominate-first-wins-2787324-2025-09-15",
      "headline": "Emmy Awards 2025: The Studio dominates with 11 wins, Adolescence takes 6The 77th Primetime Emmy Awards kicked off with Apple TV+ frontrunners 'The Studio' and 'Adolescence' leading the charge. Check the winners here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/77th-primetime-emmy-awards-live-updates-severance-the-penguin-the-white-lotus-2787278-2025-09-14",
      "headline": "Emmys 2025 highlights: The Studio dominates with 13 wins77th Emmy Awards Highlights: The 2025 Primetime Emmy Awards, celebrating the best of American TV, took place in Los Angeles on September 15 (IST). This year 'The Studio', 'The Pitt' and 'Adolescence' clinched top honours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/morgan-wallen-dedicates-song-to-late-charlie-kirks-family-at-edmonton-concert-glbs-2787309-2025-09-15",
      "headline": "Morgan Wallen dedicates song to late Charlie Kirk's family at Edmonton concertCountry singer Morgan Wallen paid tribute to Erika Kirk, widow of activist Charlie Kirk, during his Edmonton concert, dedicating a song just days after the tragedy."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/waqf-act-some-provision-paused-certain-parts-need-protection-while-we-hear-pleas-supreme-court-2787416-2025-09-15",
      "headline": "Supreme Court partly pauses Waqf Act as it prepares to hear pleas against itOn May 22, the Supreme Court reserved its interim order on the Act after arguments from the two sides for three straight days. The petitions filed challenge the constitutionality of the changes made to the Waqf law by amendments passed by Parliament earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-protest-handshake-controversy-2787400-2025-09-15",
      "headline": "Pakistan lodge formal protest against India players, match refereeThe Pakistan cricket team has launched a formal protest against the Indian players for refusing to shake hands at the end of the match. The team has reportedly also lodged a complaint against the match referee Andy Pycroft."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/chandramouli-nagamallaiah-texas-beheading-donald-trump-reacts-illegal-cuban-immigrant-2787325-2025-09-15",
      "headline": "Time for being soft on illegal immigrants over: Trump on Indian man's beheadingIn a strongly worded statement on his Truth Social platform, Donald Trump said Chandra Nagamallaiah was \"brutally beheaded\" by an \"illegal alien from Cuba who should never have been in our country\". He described the victim as a \"well respected person in Dallas\" and promised that the accused would be prosecuted to the fullest extent of the law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-low-interest-how-many-watched-viewership-numbers-2787440-2025-09-15",
      "headline": "Boycott or not, few really care about India vs Pakistan anymoreAsia Cup 2025: Boycott or not, the India vs Pakistan rivalry is losing its edge. Once fiery underdogs, Pakistan now offer little resistance, and Sunday's defeat was yet another reminder that the contest is increasingly one-sided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/new-pixel-and-iphone-are-here-so-is-the-beginning-of-an-end-for-smartphones-2787476-2025-09-15",
      "headline": "New Pixel and iPhone are here, so is the beginning of an end for smartphonesAfter close to 20 years of glorious run, smartphones as technology have become stagnant and are ripe to be replaced with something else. At least that is the impression the latest Google Pixels and Apple iPhones offer given how incremental they are with their updates. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/finance-ministry-official-navjot-singh-killed-wife-critical-after-bmw-hits-their-bike-in-delhi-2787284-2025-09-14",
      "headline": "Finance ministry official killed, wife critical after BMW hits their bike in DelhiThe finance ministry official and his wife were returning home after visiting Bangla Sahib Gurdwara when their bike was hit by a BMW."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-waqf-act-verdict-non-muslism-presence-dispute-land-controversial-section-2787437-2025-09-15",
      "headline": "Waqf Act: Supreme Court hits pause on these controversial sectionsThe Supreme Court ruled that executive officers cannot decide Waqf land disputes, stressing that only tribunals can adjudicate property rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-suryakumar-yadav-handshake-salman-agha-2787310-2025-09-15",
      "headline": "Beyond the scorecard: How Suryakumar Yadav's handshake snub stung PakistanAsia Cup 2025, IND vs PAK: Suryakumar Yadav's handshake snub set the tone, his bold statements amplified it, and Pakistan's decision to skip the post-match ceremony underlined just how deeply they were stung. India's commanding display, coupled with their skipper's defiance, delivered a double blow to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-official-pr-video-canadian-vlogger-caleb-friesen-road-cleanup-sparks-outrage-bbmp-majestic-footpath-2787435-2025-09-15",
      "headline": "Bengaluru official's video with Canadian vlogger after road cleanup sparks outrageThat it took a foreign national to spotlight Bengaluru's crumbling pedestrian infrastructure has sparked outrage on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-your-partner-a-serial-spender-heres-how-to-help-without-starting-world-war-iii-2787398-2025-09-15",
      "headline": "Is your partner a serial spender? Here's how to help (without starting World War III)It's not out of the blue to have problems with your partner when it comes to money, but here's a better way to sort it than just taking digs at them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-today-key-faqs-for-last-minute-filers-2787427-2025-09-15",
      "headline": "ITR filing deadline today: Key FAQs for last-minute filersToday marks the final chance to file Income Tax Returns for AY 2025–26. As the deadline closes in, last-minute filers are rushing to the portal. Here are the answers to the most common questions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/telangana-heavy-rain-floods-hyderabad-roads-three-missing-in-parsigutta-and-nampally-drains-2787368-2025-09-15",
      "headline": "Hyderabad roads turn into rivers, traffic crawls amid heavy rain; 3 missingHeavy rain lashed Hyderabad, flooding roads and disrupting traffic on Sunday night. Several were reported missing, prompting a major search. Siddipet recorded 245.5 mm of rain while several Hyderabad localities crossed 120 mm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-cinema-2025-a-year-of-detox-reflection-and-slow-transformation-2787308-2025-09-15",
      "headline": "Kannada cinema 2025: Missing superstars, one Rs 100-crore hit and what lies aheadNine months in, Kannada cinema this year have mostly been about the little guy's shot at triumph. While some films gained attention, it has only been 'Su From So' that truly left a mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-national-anthem-controversy-2787337-2025-09-15",
      "headline": "Asia Cup: DJ plays 'Jalebi Baby' instead of Pak national anthem, video is viralPakistan players and fans were left baffled after the DJ at the Dubai International Stadium played jalebi baby instead of the country's national anthem. This is the not the first time that a goof-up like this happened in an international event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/california-73-year-old-sikh-woman-harjit-kaur-detained-by-us-agency-sparks-community-protests-2787481-2025-09-15",
      "headline": "Protests as Sikh woman, 73, detained by immigration officials after 30 years in USA 73-year-old Sikh woman, Harjit Kaur, was detained by US immigration authorities in California during a routine check-in, sparking protests from her family and community. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2024-gen-z-and-the-new-terms-of-engagement-2786447-2025-09-12",
      "headline": "From the India Today archives (2024) | Gen Z and the new terms of engagementThey overturned power in Bangladesh last year and have just pulled off a reset in Nepal. How Generation Z thinks and works"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/indian-jingles-fade-digital-ads-rise-record-ad-spends-2024-2787468-2025-09-15",
      "headline": "Proof you're a true 90s kid: You read this in the 'Washing Powder Nirma' tuneCadbury once made us dance on cricket pitches; today's ads barely make us pause the scroll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maoist-commander-with-rs-1-crore-bounty-2-others-killed-in-encounter-with-forces-in-jharkhand-2787362-2025-09-15",
      "headline": "Maoist commander with Rs 1 crore bounty, 2 others killed in encounter in JharkhandA top CPI (Maoist) commander carrying a Rs 1 crore bounty and two other senior rebels were killed in a joint security operation in Jharkhand's Hazaribagh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-russia-strategic-partnership-grows-despite-us-tariffs-2787283-2025-09-14",
      "headline": "Attempts to break India-Russia ties destined to fail: Moscow amid Trump pressureThe Russian Foreign Ministry praised India for standing firm against constant pressure from the US and Nato to stop purchasing oil from Russia, and for continuing its commitments despite threats, warning that any attempt to disturb the ties is \"destined to fail.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/stephen-colbert-wins-best-talk-series-at-emmys-2025-2-months-after-cancellation-2787361-2025-09-15",
      "headline": "Anyone hiring, Stephen Colbert quips, gets standing ovation for Talk Series EmmyStephen Colbert signed off with laughs and tears at the 77th Emmys as 'The Late Show' finally scores its first Emmy after ten years. Even with the show's curtain call looming, Colbert promises one last joyride, celebrating a decade of sharp wit, real talk, and unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-tracking-massive-asteroid-2025-fa22-bigger-than-qutub-minar-flying-towards-earth-2787473-2025-09-15",
      "headline": "Massive asteroid bigger than Qutub Minar flying towards EarthFA22 follows a moderately elongated, slightly tilted orbit around the sun, with an orbital period of roughly 1.85 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmys-awards-2025-the-studio-severance-dominate-first-wins-2787324-2025-09-15",
      "headline": "Emmy Awards 2025: The Studio dominates with 11 wins, Adolescence takes 6The 77th Primetime Emmy Awards kicked off with Apple TV+ frontrunners 'The Studio' and 'Adolescence' leading the charge. Check the winners here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/no-sunrise-shubhanshu-shukla-explains-why-the-nights-turn-white-in-space-2787413-2025-09-15",
      "headline": "Shubhanshu Shukla explains why the nights turn white in spaceShukla describes that normally, crew aboard the International Space Station witness about 16 sunrises and sunsets within a 24-hour period as the laboratory races around Earth. But this isn't always the case. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-100m-sprint-analysis-2787464-2025-09-15",
      "headline": "Tokyo night of triumphs: Upsets and new champions crownedNew champions were crowned on a hot and humid evening in Tokyo. Tamberi fell to an injury, while Oblique Seville stunned the crowd in men's 100m."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-pakistan-handshake-controversy-former-cricketers-react-2787480-2025-09-15",
      "headline": "Asia Cup 2025: How Pakistan reacted to India's handshake snubIndia refused to shake hands with Pakistan after their tense Asia Cup match. This has sparked criticism from former Pakistani cricketers and raised questions on sportsmanship amid political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-low-interest-how-many-watched-viewership-numbers-2787440-2025-09-15",
      "headline": "Boycott or not, few really care about India vs Pakistan anymoreAsia Cup 2025: Boycott or not, the India vs Pakistan rivalry is losing its edge. Once fiery underdogs, Pakistan now offer little resistance, and Sunday's defeat was yet another reminder that the contest is increasingly one-sided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-launched-formal-protest-against-india-players-over-handshake-snub-2787424-2025-09-15",
      "headline": "Pakistan launches formal protest against India players over handshake snubPakistan has lodged a protest with the Asian Cricket Council after Indian cricket players did not shake hands with their opponents following an Asia Cup match. The Indian captain, Surya Kumar Yadav, who led the team to victory, chose to forgo the post-match custom. Speaking after the game, Yadav dedicated the win to the victims of the Pahalgam terror attacks and the armed forces. He said, \"We stand by with the victims of the families of Pehelgam terror attack and we express our solidarity... we want to dedicate today's win to all our armed forces who showed a lot of bravery.\" The gesture is being seen as a message of solidarity from the Indian team. The complaint by Pakistan comes after a match where the Indian team dominated in all departments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-uae-vs-oman-elimination-clash-preview-2787209-2025-09-15",
      "headline": "UAE, Oman desperate for redemption after nightmare startsUAE and Oman face a do-or-die Group A match in the Asia Cup 2025 after heavy losses to India and Pakistan, with both teams needing a win to stay in the tournament. The Abu Dhabi pitch offers balanced conditions, promising a competitive contest as both sides seek redemption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-2025-saim-ayub-shaheen-afridi-pakistan-shine-batting-struggles-2787421-2025-09-15",
      "headline": "Saim Ayub, Shaheen Afridi shine vs India, but Pakistan's issues lie right hereAsia Cup 2025, IND vs PAK: Saim Ayub took three wickets, and Shaheen Shah Afridi scored an unbeaten 33, but their performances raise more concerns than provide good news for Pakistan cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-gautam-gambhir-comparisons-competition-2787403-2025-09-15",
      "headline": "Gautam Gambhir on Asia Cup mismatch: Can't compare apples to orangesIndia head coach Gautam Gambhir applauded his team's dominant victory over Pakistan in the Asia Cup 2025 group stage. He emphasised honesty and resilience as key values guiding Indian cricket's future amid tense political backdrop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-protest-handshake-controversy-2787400-2025-09-15",
      "headline": "Pakistan lodge formal protest against India players, match refereeThe Pakistan cricket team has launched a formal protest against the Indian players for refusing to shake hands at the end of the match. The team has reportedly also lodged a complaint against the match referee Andy Pycroft."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-handshake-controversy-shoaib-akhtar-salman-agha-2787393-2025-09-15",
      "headline": "Salman Agha was right to skip post-match ceremony: Shoaib AkhtarFormer Pakistan fast bowler Shoaib Akhtar expressed disappointment at Suryakumar Yadav for not shaking hands with Pakistan captain Salman Agha. The incident prompted Salman Agha to skip the post-match presentation ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-harbhajan-singh-national-celebration-2787370-2025-09-15",
      "headline": "Every time India beats Pakistan, a moment of national celebration: Harbhajan SinghIndia secured a commanding victory over Pakistan in the Asia Cup 2025 match in Dubai. The win highlighted the strength of India's young players and their spin attack amidst political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-gautam-gambhir-comparisons-competition-2787403-2025-09-15",
      "headline": "Gautam Gambhir on Asia Cup mismatch: Can't compare apples to orangesIndia head coach Gautam Gambhir applauded his team's dominant victory over Pakistan in the Asia Cup 2025 group stage. He emphasised honesty and resilience as key values guiding Indian cricket's future amid tense political backdrop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-protest-handshake-controversy-2787400-2025-09-15",
      "headline": "Pakistan lodge formal protest against India players, match refereeThe Pakistan cricket team has launched a formal protest against the Indian players for refusing to shake hands at the end of the match. The team has reportedly also lodged a complaint against the match referee Andy Pycroft."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-handshake-controversy-shoaib-akhtar-salman-agha-2787393-2025-09-15",
      "headline": "Salman Agha was right to skip post-match ceremony: Shoaib AkhtarFormer Pakistan fast bowler Shoaib Akhtar expressed disappointment at Suryakumar Yadav for not shaking hands with Pakistan captain Salman Agha. The incident prompted Salman Agha to skip the post-match presentation ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-harbhajan-singh-national-celebration-2787370-2025-09-15",
      "headline": "Every time India beats Pakistan, a moment of national celebration: Harbhajan SinghIndia secured a commanding victory over Pakistan in the Asia Cup 2025 match in Dubai. The win highlighted the strength of India's young players and their spin attack amidst political tensions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}