{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-rises-sees-3-month-high-at-133-in-december-up-from-071-in-november-2850671-2026-01-12",
      "headline": "India's retail inflation hits 3-month high of 1.33% in DecemberIndia's retail inflation rose to 1.33% in December from 0.71% in November, as the decline in food prices slowed, government data showed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-302-points-nifty-above-25750-as-market-snaps-losing-streak-2850647-2026-01-12",
      "headline": "Sensex jumps 302 points, Nifty above 25,750 as market snaps losing streakAt the close, the Sensex settled at 83,878.17, up 301.93 points, while the Nifty ended at 25,790.25, gaining 106.95 points.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-is-it-time-for-capital-gains-clarity-and-gst-relief-for-real-estate-2850602-2026-01-12",
      "headline": "Budget 2026: Is it time for capital gains clarity, and GST relief for real estate?As the countdown to Budget 2026 begins, real estate players are seeking clarity on capital gains taxation and GST relief to support long-term growth and investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rebounds-over-800-points-how-stock-market-staged-a-sharp-comeback-2850593-2026-01-12",
      "headline": "Sensex rebounds over 800 points from day's low: 4 things investors need to knowThe recovery capped one of the most volatile trading days in recent weeks and came after intense selling pressure had pushed markets into oversold territory during the morning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-know-the-cost-of-missing-the-july-31-itr-deadline-2850573-2026-01-12",
      "headline": "Income tax return filing: Know the cost of missing the July 31 ITR deadlineFiling your income tax return after July 31 can cost more than you expect. From late fees and interest to delayed refunds and lost tax benefits, missing the ITR deadline makes compliance more expensive and restrictive for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-ipo-latest-gmp-subscription-status-and-all-other-details-2850585-2026-01-12",
      "headline": "Bharat Coking Coal IPO: Latest GMP, subscription status and what it signalsFor now, the subscription data and GMP suggest that the Bharat Coking Coal IPO remains one of the most closely watched offerings, with sentiment clearly tilted towards a strong debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-smarter-tax-slabs-matter-more-than-big-cuts-2850549-2026-01-12",
      "headline": "Budget 2026: Why smarter tax slabs matter more than big cutsAs nominal incomes rise, taxpayers drift into higher brackets without any improvement in real purchasing power. This bracket creep amounts to a quiet tightening of tax burden, dampening consumption without any explicit policy decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-nearly-3000-points-in-6-days-what-is-really-driving-the-sell-off-2850534-2026-01-12",
      "headline": "Sensex down nearly 3,000 points in 6 days: What's really driving the sell-offThe past six days have been a reminder that markets do not move in straight lines. When uncertainty rises and confidence weakens, even strong long-term stories can go through uncomfortable phases. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-employers-can-address-new-labour-codes-take-home-salary-and-build-employee-trust-2850519-2026-01-12",
      "headline": "How employers can address New labour code's take-home salary and build employee trustFor employers, the reform means more disciplined salary design and tighter governance. Compensation structures that previously leaned heavily on allowances now require rebalancing. Finance leaders will need to review salary templates, update payroll logic, and ensure CTCs align with the wage definition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-tumble-key-reasons-why-stock-market-is-falling-today-2850467-2026-01-12",
      "headline": "Sensex tumbles over 600 points: 3 reasons why the stock market is fallingAt around 11:48 am, the Sensex was trading at 82,937.81, down 638.43 points, while the Nifty stood at 25,494.30, lower by 189 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-record-levels-what-next-investors-buy-sell-explained-2850457-2026-01-12",
      "headline": "Gold, silver prices at record levels: What should investors expect next?With prices at record highs, the real question for investors is not what gold and silver have done, but whether this rally is merely pausing or setting up for another leg higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-price-selling-pressure-explained-2850443-2026-01-12",
      "headline": "Explained: Why HDFC Bank shares remain under selling pressureAs of 10:24 am, shares of the private lender were trading at Rs 932.80, down Rs 6.20, or 0.66 per cent, adding to losses seen over recent sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-ipo-day-2-gmp-key-dates-2850428-2026-01-12",
      "headline": "Bharat Coking Coal IPO day 2: Check GMP, key dates and should you invest?For investors, the Bharat Coking Coal IPO appears to be a play on listing gains and medium-term stability rather than a deep long-term value bet at current valuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-india-latest-rates-buy-sell-key-details-2850423-2026-01-12",
      "headline": "Gold, silver prices near record highs: Should you buy now or wait?In India, gold prices remain firm while silver continues to see sharper ups and downs. These levels have made buyers cautious, especially those looking at jewellery purchases or small investments rather than short-term trading."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-25700-as-dalal-streets-weak-run-continues-2850405-2026-01-12",
      "headline": "Sensex, Nifty fall for 6th straight day as D-Street's turbulent run continuesAt around 9:21 am, the Sensex was trading at 83,252.86, down 323.38 points, or 0.39 per cent, while the Nifty stood at 25,592.60, lower by 90.70 points. Losses were broad-based, reflecting rising investor caution amid persistent domestic concerns and unsettled global cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-delay-concerns-notice-taxpayers-2850401-2026-01-12",
      "headline": "Income tax refund delays: Why many taxpayers are still waitingComplaints over refunds stuck at the \"processing\" stage have been trending across social media platforms and grievance portals, bringing renewed attention to the pace of return processing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-pitches-gujarat-as-investment-hub-karan-adani-mukesh-ambani-unveil-big-ticket-bets-saurashtra-kutch-2850260-2026-01-11",
      "headline": "PM pitches Gujarat as investment hub; Adani Group, Reliance unveil big-ticket betsPM Modi said that India's growth story is being powered by an expanding middle class and rising purchasing power, alongside structural reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-old-tax-regime-survival-new-tax-regime-deductions-income-expectations-2849988-2026-01-11",
      "headline": "Budget 2026: Will old tax regime survive and should new regime get deductions?Over the past few years, the government has steadily pushed the new tax regime as the default option while keeping the old regime alive for those with existing commitments and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-silent-debt-crisis-easy-loans-bnpl-apps-emi-burden-expert-panel-report-2849529-2026-01-10",
      "headline": "Drowning in debt: How easy loans are turning into an EMI nightmare for IndiansMonth after month, salaries go to EMIs, essentials shrink, and families realise that what once felt temporary has become the new normal. Read on to understand how this silent debt crisis is unfolding within Indian households."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sip-investments-hit-record-high-in-december-2025-amfi-2849472-2026-01-09",
      "headline": "SIP investments hit record high in December 2025: AMFIThe latest data from the Association of Mutual Funds in India (AMFI) for December 2025 shows steady participation from retail investors, record SIP contributions and sustained interest in equity and hybrid schemes."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-thiruvothu-talks-of-therapy-and-how-she-overcame-suicidal-thoughts-2850645-2026-01-12",
      "headline": "Parvathy Thiruvothu talks of therapy and how she overcame suicidal thoughts Parvathy Thiruvothu recently spoke about her struggle with mental health. She stressed the need to have the right therapist in such situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-manager-series-2-review-tom-hiddleston-amazon-prime-spy-thriller-2850675-2026-01-12",
      "headline": "The Night Manager S2 review: Tom Hiddleston returns in a less biting sequelRelease Date:Mon Jan 12, 2026 The Night Manager season 2 debuts on Prime Video with Tom Hiddleston returning. The series shifts tone while expanding its spy universe, stirring mixed reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yash-namit-malhotra-ramayana-film-partnership-global-release-diwali-2026-2850676-2026-01-12",
      "headline": "Yash, Namit Malhotra celebrate creative partnership in run up to Ramayana release Actor-producer Yash and Namit Malhotra celebrate their creative partnership as the Ramayana film nears release. Their collaboration aims to elevate Indian cinema on the global stage with an ambitious two-part epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-many-years-did-timothee-chalamet-train-for-marty-supreme-role-2850537-2026-01-12",
      "headline": "How many years did Timothee Chalamet train for Marty Supreme role? Read here Timothee Chalamet's preparation for his Golden Globe-winning role as a budding table tennis player in Marty Supreme involved years of quiet, rigorous training. The learning process included technicalities of the game and also an unfortunate eye infection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nidhhi-agerwal-praises-prabhas-kind-fun-nature-raja-saab-2850613-2026-01-12",
      "headline": "Nidhhi Agerwal: Prabhas is the most non-judgmental person you can talk to Nidhhi Agerwal shares her experience working with Prabhas in The Raja Saab. She highlights his kind nature and fans' excitement for his comedy comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunil-grover-aamir-khan-mimicry-vir-das-happy-patel-leads-to-hilarious-office-mix-up-2850638-2026-01-12",
      "headline": "Sunil Grover's Aamir Khan mimicry leads to hilarious office mix-up. Watch A new promo for Happy Patel features Sunil Grover again impersonating Aamir Khan. This time, he managed to successfully fool Vir Das and others. The confusion led to a humorous misunderstanding that ended with Aamir himself being escorted from his own office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/will-smith-expresses-interest-bollywood-collaboration-shah-rukh-khan-salman-khan-2850606-2026-01-12",
      "headline": "Will Smith says he wants Shah Rukh Khan to cast him in a Bollywood film Oscar-winning actor Will Smith voiced his desire to work with Shah Rukh Khan in a Bollywood film during his visit to Dubai for the premiere of National Geographic's new series Pole to Pole."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mardaani-3-trailer-rani-mukerji-leads-a-gritty-mission-to-find-missing-girls-2850617-2026-01-12",
      "headline": "Mardaani 3 trailer: Rani Mukerji leads a gritty mission to find missing girls The trailer for Mardaani 3, starring Rani Mukerji as Shivani Shivaji Roy, has been released. The film, directed by Abhiraj Minawala and produced by Aditya Chopra, continues the franchise's focus on socially relevant issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nupur-sanon-stebin-ben-hindu-wedding-video-from-udaipur-goes-viral-2850603-2026-01-12",
      "headline": "Nupur Sanon, Stebin Ben's Hindu wedding video from Udaipur goes viral. Watch A video from Nupur Sanon and Stebin Ben's Hindu wedding in Udaipur has emerged on social media. The video shows the couple's joyful celebration dressed in ethnic clothes following their earlier white wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/prashant-tamang-natural-death-died-in-sleep-says-wife-martha-aley-2850600-2026-01-12",
      "headline": "Singer Prashant Tamang's wife Martha confirms his death was natural Martha Aley, wife of singer and actor Prashant Tamang, has clarified that his death was due to natural causes and occurred while he was asleep. She expressed gratitude for the widespread support from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/leonardo-dicaprio-viral-k-pop-comment-during-golden-globes-break-sparks-buzz-2850582-2026-01-12",
      "headline": "Leonardo DiCaprio's viral K-Pop comment during Globes break sparks buzz Leonardo DiCaprio's night at the 2026 Golden Globes saw him engaging with K-pop references and receiving light-hearted jokes from host Nikki Glaser, while his film One Battle After Another secured multiple nominations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-reality-show-farah-khan-celebrity-contestants-fan-prize-money-2850581-2026-01-12",
      "headline": "Exclusive: All about Farah Khan-hosted new reality show The 50 Farah Khan hosts The 50, a reality show with 50 celebrity contestants competing in entertaining tasks. Fans can vote and potentially win a share of the prize money, changing the non-fiction TV landscape in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/k-pop-exclusive-idid-wins-the-aegyo-battle-push-back-love-for-tandoori-chicken-india-2850595-2026-01-12",
      "headline": "K-pop Exclusive: IDID wins the 'aegyo' battle, Push Back, love for tandoori chicken, India In this India Today interview with Bhavna Agarwal, members of the K-pop group IDID discuss their journey from trainees to debuting as a group under Starship Entertainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-box-office-collection-day-3-detailed-report-lowest-first-sunday-for-prabhas-in-four-years-2850597-2026-01-12",
      "headline": "The Raja Saab box office Day 3: Lowest first Sunday for Prabhas in 4 years Prabhas's The Raja Saab earned Rs 19.1 crore on its first Sunday, marking the actor's lowest Sunday opening in four years. The horror-comedy has seen a steady drop amid negative reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-talks-about-turning-down-hindi-films-after-beyond-the-clouds-2850588-2026-01-12",
      "headline": "Malavika Mohanan talks about turning down Hindi films after Beyond the Clouds Malavika Mohanan opened up about being selective with her Bollywood projects after Beyond the Clouds, saying her choices are driven by creative instinct rather than industry size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hans-zimmer-hits-out-at-golden-globes-over-best-score-omission-feels-ignorant-2850546-2026-01-12",
      "headline": "Hans Zimmer on Golden Globes snub: You don't have a movie without composers Hans Zimmer voiced his disappointment following the Golden Globes' decision to exclude the Best Original Score award from its televised ceremony. The composer said that he wouldn't talk to the person who came up with the last-minute decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/owen-cooper-16-becomes-youngest-golden-globe-supporting-actor-winner-2850545-2026-01-12",
      "headline": "Owen Cooper, 16, becomes youngest Golden Globe Supporting Actor winner At just 16, Owen Cooper has smashed a Golden Globe record, becoming the youngest Supporting Actor winner in TV history. His breakout role in Netflix's Adolescence has officially made him the industry's new young star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naveen-kaushik-shares-bts-moments-from-dhurandhar-climax-fight-scene-2850555-2026-01-12",
      "headline": "Naveen Kaushik shares BTS moments from Dhurandhar's climax fight scene Naveen Kaushik won praise for his role as Donga in Aditya Dhar's blockbuster spy thriller Dhurandhar and recently shared fun behind-the-scenes moments from the film's climactic action sequence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parasakthi-film-release-cleared-cbfc-online-sabotage-claims-dev-ramnath-2850529-2026-01-12",
      "headline": "Did we stop Jana Nayagan? Parasakthi actor slams Vijay fans over negative reviews Actor and producer Dev Ramnath raises concerns over coordinated negative reviews and online campaigns targeting the film Parasakthi, following its release ahead of Pongal."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protest-internet-blackout-kill-switch-jamming-kills-starlink-elon-musk-china-russia-technology-help-2850566-2026-01-12",
      "headline": "Iran uses kill switch to jam Starlink as protests rage on. Did China or Russia help?As anti-Khamenei protests in Iran enter the third week, the Ayatollah's clerical regime has reportedly activated a military-grade \"kill switch\", which cut off Elon Musk's Starlink and plunged 80 million Iranians into digital darkness. Experts say the sophisticated jamming technology could likely have been supplied by Russia or China."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/annamalai-hits-back-at-raj-thackeray-over-rasmalai-jab-who-is-he-to-threaten-me-bmc-elections-2850560-2026-01-12",
      "headline": "Who's he to threaten me: Annamalai hits back at Raj Thackeray over 'rasmalai' jabThe war of words escalated ahead of Maharashtra's civic polls after Raj Thackeray mocked K Annamalai at a Mumbai rally, calling him 'rasmalai'. The BJP leader also rejected accusations that his remarks undermined Marathi pride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-set-to-move-to-new-office-seva-teerth-on-makar-sankranti-new-pmo-address-soon-2850531-2026-01-12",
      "headline": "PM Modi to move to his new office on Makar Sankranti, a first since IndependenceThe relocation of the Prime Minister's Office will mark the end of an era, as it has been located in the South Block since India's independence in 1947."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/king-trump-proves-india-choice-westminster-system-right-opinion-american-governance-machinery-checks-balances-comedy-2850669-2026-01-12",
      "headline": "King Trump proves India's choice of Westminster system rightNow and then, there are calls to replace India's parliamentary system with a US-style presidency. But Donald Trump's tenure shows how fragile American checks and balances can be."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sorry-kolkata-bikaner-is-indias-undisputed-mithai-capital-2850578-2026-01-12",
      "headline": "Sorry, Kolkata. Bikaner is India's undisputed mithai capitalWhile Kolkata remains famous for its traditional chhena sweets, Bikaner has built a diverse and enduring sweet empire that caters to global tastes. This desert city's innovative approach to sweets and snacks is redefining India's culinary landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-news-uae-warns-of-islamic-radicalisation-in-uk-universities-cuts-students-scholarships-britain-college-ban-2850496-2026-01-12",
      "headline": "UAE warns of Islamic radicalisation in UK universities, ends students' scholarshipsThe United Arab Emirates has decided to end funding for Emirati students studying in UK-based universities due to fears they might get radicalised by Islamic terrorist group Muslim Brotherhood in British educational institutions. Ties between the UK and the UAE have become strained over multiple issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/paxsilica-invite-for-india-as-us-trade-talks-resume-says-new-envoy-sergio-gor-2850615-2026-01-12",
      "headline": "Left to mop up Trump's mess, Ambassador Gor says India is indispensable to USAmid the ongoing tensions between the two countries over tariffs and President Trump's continuous rant, Gor shared a message of friendship, saying \"real friends always resolve their differences in the end.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/india-space-power-bank-pslv-c62-mission-takeme2space-orbital-data-centre-server-room-2850339-2026-01-12",
      "headline": "Not just DRDO satellite, India lost a comic server as PSLV failsAn Indian startup revealed an exclusive plan to build a massive server room in the stars. This cosmic power bank would have allowed satellites to plug in and process data in real time. However, the mission failed due to technical glitches during the rocket launch. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-film-praised-karan-johar-yami-gautam-outstanding-performance-emotional-storytelling-2850435-2026-01-12",
      "headline": "Yami, I am a fan for life: Karan Johar calls Haq an exceptionally empowering filmFilmmaker Karan Johar shares high praise for Yami Gautam and the film Haq, highlighting its moving narrative and powerful performances after watching it on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-the-acting-president-of-venezuela-truth-social-post-nicolas-maduro-us-2850430-2026-01-12",
      "headline": "Donald Trump declares himself acting president of VenezuelaDonald Trump's surprising claim emerged weeks after the US carried out a so-called \"large-scale\" military strike in Venezuela, capturing President Nicolas Maduro and his wife, Cilia Flores and bringing them to New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-pslv-c62-launch-failure-mission-anomaly-anvesha-satellite-lost-sriharikota-news-2850476-2026-01-12",
      "headline": "Isro PSLV-C62 mission fails to deliver: What went wrong in space?India's first space mission of 2026 ended in heartbreak as the PSLV-C62 rocket suffered a critical third stage anomaly. Strategic satellites including DRDO's Anvesha are feared lost after the vehicle deviated from its path.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/raj-thackeray-warns-up-bihar-migrants-against-hindi-imposition-ill-kick-you-2850377-2026-01-12",
      "headline": "I'll kick you: Raj Thackeray warns UP, Bihar migrants against Hindi impositionRaj Thackeray and Uddhav Thackeray have joined forces to safeguard Marathi pride in the upcoming Brihanmumbai Municipal Corporation elections. Their rally highlights concerns over Hindi imposition and BJP's influence in Mumbai's political and economic landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-travel-vlogger-bumps-into-rahul-gandhi-at-vietnam-airport-shares-pics-2850616-2026-01-12",
      "headline": "Indian travel vlogger bumps into Rahul Gandhi at Vietnam airport, shares picsDaksh, a 20-year-old travel vlogger, found himself sharing not just an airport lounge but also a flight with Rahul Gandhi in Hanoi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/priyanka-chopra-jonas-nick-jonas-golden-globes-2026-dior-gown-outfit-2850349-2026-01-12",
      "headline": "All eyes on Priyanka Chopra as she brings blue glam to the Golden Globes in DiorPriyanka Chopra Jonas wore a custom blue Dior gown featuring an intriguing mix of metallic and matte details at the 2026 Golden Globe Awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-rises-sees-3-month-high-at-133-in-december-up-from-071-in-november-2850671-2026-01-12",
      "headline": "India's retail inflation hits 3-month high of 1.33% in DecemberIndia's retail inflation rose to 1.33% in December from 0.71% in November, as the decline in food prices slowed, government data showed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-pakistan-is-scared-as-protests-kill-over-500-in-iran-ayatollah-ali-khamenei-regime-change-us-israel-trump-reza-pahlavi-2850557-2026-01-12",
      "headline": "Why Pakistan is on the edge as protests kill over 500 in IranThe anti-Khamenei protests in Iran, in which over 500 have been killed, have raised alarm in Pakistan with the unrest reaching the Sistan-Baluchestan province. Islamabad fears there could be a spillover in its Balochistan even as unverified reports claim the presence of American troops in Pakistan for an Iran operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/raghav-chadha-turns-blinkit-delivery-rider-for-a-day-shares-stay-tuned-teaser-2850527-2026-01-12",
      "headline": "Raghav Chadha turns Blinkit delivery rider for a day, shares 'stay tuned' teaserIn a short teaser posted on his X account, Raghav Chadha is seen changing into a Blinkit T-shirt and jacket before taking a delivery bag from a rider."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-wakes-up-to-biting-cold-as-minimum-temperature-drops-to-32degc-cold-wave-alert-issued-2850400-2026-01-12",
      "headline": "Delhi's coldest morning at 3.2°C; Gurgaon wakes up to frost on lawns and carsDelhi and several northern states are experiencing the coldest temperatures of the season, prompting cold wave alerts and school closures. The India Meteorological Department warns that severe cold and dense fog will continue to impact the region over the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aabhas-maldahiyar-book-row-bhopal-literature-festival-babur-the-quest-for-hindustan-cancellation-pm-modi-2850648-2026-01-12",
      "headline": "How author of Babur book got cancelled in BJP-ruled MPAuthor Aabhas Maldahiyar's attempt to challenge the \"Marxist fabrication\" and \"expose a forged historical narrative\" on Babur, ended with threats, cancellation and condemnation without the critics even reading the book. People associated with the BJP and the RSS said the row showed how ignorance, misinformation and noise could hurt a cause, meant to challenge Babur's portrayal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-venezuela-greenland-western-hemisphere-us-expansionism-china-taiwan-2850610-2026-01-12",
      "headline": "Trump is normalising conquest. China may followTrump's actions in Venezuela and intent to annex Greenland chip away at the moral authority the US relies on to deter aggression on foreign soil. It may embolden Beijing to test boundaries -- putting Taiwan in the line of fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/is-this-jennifer-lawrences-boldest-look-yet-a-naked-dress-at-golden-globes-2850382-2026-01-12",
      "headline": "Is this Jennifer Lawrence's boldest look yet? A naked dress at Golden GlobesJennifer Lawrence made an appearance at the Golden Globes in a sheer, barely there gown which seems to have grabbed a lot of attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-many-years-did-timothee-chalamet-train-for-marty-supreme-role-2850537-2026-01-12",
      "headline": "How many years did Timothee Chalamet train for Marty Supreme role? Read hereTimothee Chalamet's preparation for his Golden Globe-winning role as a budding table tennis player in Marty Supreme involved years of quiet, rigorous training. The learning process included technicalities of the game and also an unfortunate eye infection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/trump-i-am-not-grabbing-karoline-leavitt-joke-turbulent-flight-raises-eyebrows-video-viral-2850644-2026-01-12",
      "headline": "Trump's 'not grabbing Karoline' joke on turbulent flight raises eyebrowsTrump smiled as he made the remark, and Karoline Leavitt was seen smiling back, a moment that social media users noticed immediately. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/golden-globes-stars-protest-ice-violence-be-good-pins-renee-good-2850498-2026-01-12",
      "headline": "Celebrities wear Be Good pins at Golden Globes 2026. Here's what it meansAt the 83rd Golden Globe Awards, celebrities such as Mark Ruffalo and Wanda Sykes wore 'Be Good' pins on the red carpet. Read on to know what it means. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-nabi-snaps-bangladesh-reporter-over-questions-on-mustafizur-ipl-row-2850666-2026-01-12",
      "headline": "Mohammad Nabi snaps at Bangladesh reporter over questions on Mustafizur IPL row Veteran Afghanistan all-rounder Mohammad Nabi lost his cool at a Bangladesh reporter after being asked an unwarranted question about the IPL controversy involving Mustafizur Rahman and Kolkata Knight Riders (KKR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wojciech-szczesny-smoking-leaked-lamine-yamal-instagram-live-real-madrid-vs-fc-barcelona-2850656-2026-01-12",
      "headline": "Watch: Lamine Yamal leaks another Szczesny smoking clip after Super Cup win Lamine Yamal accidentally went live from Barcelona's dressing room and briefly caught Wojciech Szczesny smoking after the Super Cup final win over Real Madrid. The clip was quickly cut but spread rapidly online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-matches-behind-closed-doors-navi-mumbai-municipal-elections-security-concerns-2850646-2026-01-12",
      "headline": "WPL games to have no spectators during Navi Mumbai municipal elections: Report Two Women's Premier League matches will be held without spectators this week due to the Navi Mumbai municipal corporation elections on January 15. The decision follows concerns over security as police resources are diverted for election duties, and ticket sales haven't gone live for matches on January 14, 15, and 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-walks-the-talk-shreyas-iyer-praise-2850640-2026-01-12",
      "headline": "Virat Kohli walks the talk: Shreyas Iyer praises India icon's consistency IND vs NZ: Shreyas Iyer praised Virat Kohli's consistency after the latter's composed 93 guided India to a four-wicket win over New Zealand. Kohli also crossed 28,000 international runs and climbed to second on the all-time list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-board-player-curfew-ashes-drinking-saga-report-2850622-2026-01-12",
      "headline": "England players face curfew after drinking saga during Ashes: Report The England and Wales Cricket Board is reportedly considering introducing a player curfew, among other measures, as it looks to address culture concerns following recent off-field controversies in the humiliating Ashes tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-badoni-replaces-washington-sundar-india-squad-new-zealand-odis-2850596-2026-01-12",
      "headline": "Ayush Badoni gets maiden ODI call-up, replaces injured Washington Sundar Indian selectors have named uncapped youngster Ayush Badoni as the replacement for all-rounder Washington Sundar, who has been ruled out of the ODI series against New Zealand after suffering a rib injury in the series opener in Vadodara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harshit-rana-cut-out-noise-trolls-ajinkya-rahane-reveals-kkr-training-2850591-2026-01-12",
      "headline": "Harshit Rana's mantra to cut out noise: Rahane reveals how pacer battles trolls Ajinkya Rahane revealed how Harshit Rana battled social media trolling during a difficult IPL phase. The KKR captain said the pacer cut out the noise and responded with decisive all-round performances for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hassan-eisakhil-mohammad-nabi-first-father-son-pair-batting-top-tier-t20-league-2850571-2026-01-12",
      "headline": "Nabi, Eisakhil become first father-son duo to bat together in top-tier T20 league Hassan Eisakhil played a memorable knock for Noakhali Express in the Bangladesh Premier League, batting alongside his father Mohammad Nabi to become the first father-son pair to share the crease in a top-tier T20 league."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-batting-mastery-praised-kyle-jamieson-india-vs-new-zealand-2850543-2026-01-12",
      "headline": "Virat Kohli is on a different level, you can't contain greats like him: Kyle Jamieson New Zealand all-rounder Kyle Jamieson admitted he could only stand back in admiration of Virat Kohli's mastery, saying the Indian great operates on a different level, one where elite batters inevitably find a way to dominate, no matter how hard bowlers try to rein them in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/michael-carrick-emerges-as-favourite-for-manchester-united-interim-manager-job-2850493-2026-01-12",
      "headline": "Carrick emerges as favourite for Manchester United interim manager job: Report Manchester United have intensified their search for an interim manager following meetings with Michael Carrick and Ole Gunnar Solskjaer. Reports suggest Carrick has emerged as the leading candidate, with further discussions planned to finalise the appointment ahead of the Manchester derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-parts-ways-jan-zelezny-launches-vel-foundation-2850453-2026-01-12",
      "headline": "Flying solo? Why Neeraj split with Zelezny and what's next for javelin star Neeraj Chopra has ended his coaching partnership with Jan Železný after just one year. He has launched the Vel foundation to back emerging athletes and take charge of his training and legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-kylian-mbappe-guard-of-honour-refuses-watch-viral-video-controversy-2850447-2026-01-12",
      "headline": "Watch: Mbappe pulls away Real Madrid teammates, refuses guard of honour for BarcelonaKylian Mbappe sparked controversy after appearing to pull Real Madrid teammates away from offering Barcelona a guard of honour. The incident followed Madrid's 3-2 defeat in the Spanish Super Cup final in Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-royal-challengers-vs-up-warriorz-today-match-preview-predicted-xi-live-streaming-pitch-condition-2850431-2026-01-12",
      "headline": "WPL 2026: Fresh from MI escape, RCB face tough questions against UP WarriorzWPL 2026, Gujarat Giants Women vs UP Warriorz Women Match Today: RCB will look to carry forward their winning momentum when they take on Meg Lanning's Warriorz, who will be eager to bounce back after their defeat to the Gujarat Giants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harshit-rana-all-rounder-grooming-number-2850389-2026-01-12",
      "headline": "Harshit Rana opens up on India grooming him as an all-rounder, eyes ODI No.7 roleIND vs NZ: Harshit Rana revealed India are grooming him as an all-rounder in the ODI setup. The pacer said he is confident of contributing 30–40 runs down the order after his impactful outing against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-india-vs-new-zealand-1st-odi-player-of-the-match-trophies-mom-home-gurugram-2850370-2026-01-12",
      "headline": "No room for trophies at Virat Kohli's home? They stay at his mom's Gurugram placeVirat Kohli combined a match-winning 93 with a touching revelation off the field, saying he sends every award from his international career to his mother's Gurugram home. The Indian great guided India to a nervy four-wicket win over New Zealand in the first ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bruno-fernandes-x-account-hacked-manchester-united-reacts-anti-ineos-posts-2850360-2026-01-12",
      "headline": "Hacker hits Bruno: Man United react after rogue X posts on INEOS, Bonnie BlueA series of erratic posts appeared on Bruno Fernandes's X account late on Sunday before being deleted. Manchester United later confirmed the account had been hacked, urged supporters not to engage with the content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-spanish-super-cup-raphinha-hansi-flick-faith-brace-2850357-2026-01-12",
      "headline": "Raphinha repays Hansi Flick's faith with Super Cup final brace vs Real MadridRaphinha repaid Hansi Flick's faith with a match-winning brace as Barcelona edged Real Madrid 3-2 to claim the Spanish Super Cup. His goals proved decisive in a dramatic final marked by late pressure, a red card and relentless Madrid attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-aggressive-batting-counterattack-limited-overs-cricket-2850350-2026-01-12",
      "headline": "Unburdened, unlocked: Virat Kohli reinvents his ODI game in fearless final actIndia vs New Zealand: No longer weighed down by milestones or expectation, Virat Kohli now bats on instinct and intent. Since returning to ODI action last October, he has scored at a strike rate of 103, significantly higher than his career strike rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-batting-no-6-pressure-perks-india-vs-new-zealand-2850333-2026-01-12",
      "headline": "KL Rahul and perks of batting at No.6: India star explains advantage of roleKL Rahul explained the perks and pressure that comes with batting for at No.6 and playing the finisher's role for the side. Rahul helped India beat New Zealand in the Baroda ODI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-narrow-loss-gujarat-giants-wpl-jemimah-rodrigues-powerplay-bowling-2850328-2026-01-11",
      "headline": "Jemimah dejected after DC lose thriller vs Gujarat: Tough pill to swallowJemimah Rodrigues was dejected after the Delhi Capitals lost back-to-back games following their four-run defeat to the Gujarat Giants on Sunday in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-fan-craze-ms-dhoni-comment-india-vs-new-zealand-2850326-2026-01-11",
      "headline": "Happens to MS Dhoni too: Virat Kohli reveals a unique problem because of fans' crazeVirat Kohli opened up on the fan craze for him during the Baroda ODI against New Zealand on Sunday, January 11 and compared to the situation to the one MS Dhoni faces during CSK matches in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-laura-wolvaardt-gujarat-giants-win-delhi-capitals-wpl-2026-2850324-2026-01-11",
      "headline": "Sophie Devine's 95, last over heroics hand Delhi Capitals back-to-back defeatsWPL 2026, DC vs GG: Delhi Capitals slumped to back-to-back defeats in the tournament after the Gujarat Giants beat them by four runs on Sunday in Navi Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-washington-sundar-ruled-out-injury-baroda-2850320-2026-01-11",
      "headline": "IND vs NZ: After Rishabh Pant, India lose Washington Sundar for New Zealand ODIsFollowing the injury of Rishabh Pant, India was dealt with another blow as Washington Sundar was ruled out of the remainder of the New Zealand series due to a side strain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naz-on-indias-nervy-win-virat-kohlis-dismissal-set-the-cat-amongst-the-pigeons-ytvd-2850314-2026-01-11",
      "headline": "India vs New Zealand 1st ODI: Kohli's 93, Dropped Catches & Rahul Seal Tense Win | IND-NZ ODIIn a special report, India Today's Consulting Editor, Nikhil Naz, breaks down India's tense four-wicket victory over New Zealand in the first ODI at Baroda. Naz points out that while India appeared to be cruising towards an easy win, the match became a '50-50 sort of an encounter' following the dismissal of Virat Kohli for 93. He states, 'While he was there on the crease, it looked like India are in cruise control, driver's seat, cruising to an easy win.' Naz also highlights that dropped catches by an otherwise proficient New Zealand side proved critical. He notes that the visiting team was not at full strength, with several key players missing, yet they still managed to give India a tough fight before KL Rahul finished the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-odi-match-report-virat-kohli-harshit-rana-baroda-2850294-2026-01-11",
      "headline": "IND vs NZ: India survive scare in 301 chase after Virat Kohli's rare 90s blunderIndia survived an almighty scare from New Zealand in Baroda as Virat Kohli's 93 was enough to seal the win and take a 1-0 lead in the series. Harshit's all-round performance and KL Rahul's calmness came in clutch for the hosts as Kyle Jamieson's four-wicket haul got the Blackcaps interested in the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nandini-sharma-first-hat-trick-delhi-capitals-wpl-gujarat-giants-2850291-2026-01-11",
      "headline": "Who is Nandini Sharma? Delhi Capitals bowler scripts history with WPL hat-trickWPL 2026, DC v GG: Nandini Sharma became the first Delhi Capitals' bowler to take a hat-trick in the history of the tournament. She finished with figures of 4-0-33-5 after dismissing Kanika Ahuja, Rajeshwari Gayakwad, and Renuka Singh in the last over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-misses-century-again-wpl-giants-vs-capitals-2850278-2026-01-11",
      "headline": "Sophie Devine struck by 90s curse again, falls short of historic WPL hundredWPL 2026, DC vs GG: Sophie Devine fell short of a Women's Premier League century again, scoring 95 off 42 balls against Delhi Capitals before succumbing to the 90s curse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-1st-odi-sanjay-bangar-hindi-national-language-social-media-backlash-vadodara-2850277-2026-01-11",
      "headline": "Sanjay Bangar calls Hindi national language during commentary, gets reality checkIND vs NZ, 1st ODI: Sanjay Bangar sparked backlash after saying he preferred the \"national language\" during commentary, with many pointing out that the Constitution recognises 22 languages and India has no national language."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/conor-bradley-knee-injury-liverpool-right-back-sidelined-2850257-2026-01-11",
      "headline": "Liverpool's Bradley set to be out for the season after knee injury vs ArsenalConor Bradley will undergo surgery and faces an uncertain timeline for return after suffering a knee injury during Liverpool's 0-0 Premier League draw with Arsenal. The defender was stretchered off following an off-the-ball incident in stoppage time, with media reports indicating the injury could be season-ending."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}