{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ashok-kumar-pal-senior-reliance-power-executive-and-anil-ambani-aide-arrested-by-ed-in-money-laundering-case-2801353-2025-10-11",
      "headline": "Anil Ambani aide and senior Reliance Power executive arrested by EDThe arrest of Ashok Pal, who serves as the executive director at Reliance Power, is related to a suspected fake bank guarantee racket worth Rs 68.2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-history-nehru-jinnah-bose-allied-to-save-steel-company-trusts-rift-news-noel-tata-2801102-2025-10-10",
      "headline": "Tata History: When Nehru, Jinnah, and Bose allied to save steel companyStarting as a company trading in cotton and opium, the Tata Group has weathered colonial economic warfare, nationalist politics, labor upheaval, and insurgent crises. But it has always emerged stronger through vision, sacrifice, and resilience. In the final episode of our series on the group, we revisit two storms that threatened to sink the Tata brand and image. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-328-points-higher-nifty-above-25250-cipla-sbi-lead-gains-2801059-2025-10-10",
      "headline": "Sensex, Nifty end higher as financial stocks rally; Cipla, SBI among top gainersSensex ends 328 points higher, Nifty above 25,250; Cipla, SBI lead gains"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/convenience-or-debt-trap-the-hidden-cost-of-bpnl-easy-credit-and-festive-offers-2800924-2025-10-10",
      "headline": "Convenience or debt trap? The hidden cost of BPNL, easy credit and festive offersEvery festive season, easy credit makes everything—from gadgets to holidays—look affordable. But behind the glitter of BNPL schemes and \"no-cost EMIs\" lies a growing debt trap that's quietly eroding financial freedom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-internal-rift-trustee-vijay-singh-calls-is-unprecedented-different-era-report-2801034-2025-10-10",
      "headline": "Tata Trusts trustee Vijay Singh calls internal rift unprecedented: ReportVijay Singh, who serves as a trustee and vice-chairman of Tata Trusts, said that the act of voting on internal matters went against the long-standing principles followed during Ratan Tata's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wework-india-slips-5-in-debut-trade-amid-valuation-governance-concerns-2801006-2025-10-10",
      "headline": "WeWork India slips 5% in debut trade amid valuation, governance concernsCorporate governance firm InGovern warned investors of WeWork India's fragile financials, negative cash flow, high lease liabilities, and the absence of fresh capital infusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/buy-borrow-die-the-wealth-cheat-code-the-rich-do-not-share-explains-ca-2800989-2025-10-10",
      "headline": "Buy, borrow, die: The wealth cheat code the rich don't share, explains CAEver wondered how wealthy families keep growing their wealth while others struggle with taxes and inflation? CA reveals a simple three-step strategy: Buy, Borrow, Die. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-gmp-400-step-by-step-guide-check-allotment-status-2800980-2025-10-10",
      "headline": "LG Electronics IPO GMP touches Rs 400: Here's how to check allotment statusLG IPO: The GMP is an indicator of market sentiment, showing the expected difference between the IPO price and the likely listing price. With the upper price band set at Rs 1,140, a GMP of Rs 400 suggests the shares could debut at around Rs 1,540, implying potential listing gains of roughly 35%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tcs-reports-20000-layoffs-employees-advocacy-group-questions-transparency-2800976-2025-10-10",
      "headline": "TCS reports 20,000 layoffs, employees' advocacy group questions transparencyThe IT giant's employee strength fell from 6,13,069 on June 30 to 5,93,314, according to Q2FY26 data posted on its website."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stopping-pf-contributions-what-it-means-for-your-retirement-savings-2800953-2025-10-10",
      "headline": "Stopping PF contributions? What it means for your retirement savingsPausing your PF contributions may seem harmless, but it can slow down your retirement savings. Even if your money stays safe, missing deposits could mean losing valuable interest and tax benefits over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-employees-demand-founder-ankur-jain-ouster-unpaid-dues-delayed-salaries-2800909-2025-10-10",
      "headline": "What's brewing at Bira 91? Over 250 employees seek removal of founder, says reportEmployees cited \"corporate governance failure, lack of transparency, delays in salaries and dues,\" as well as cases filed by creditors indicating deteriorating financials and pending vendor payments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-vs-lg-ipo-gmp-which-one-is-likely-to-give-better-returns-2800897-2025-10-10",
      "headline": "Tata Capital IPO vs LG IPO GMP: Which one is likely to give better returns? Tata Capital's IPO, priced between Rs 310–Rs 326, shows modest grey market premiums of Rs 6–Rs 7, indicating limited listing gains. LG Electronics India's IPO, at Rs 1,140, boasts Rs 380 GMP, suggesting strong upside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-slips-again-3-reasons-why-the-crypto-market-is-down-2800895-2025-10-10",
      "headline": "Bitcoin slips again. 3 reasons why the crypto market is downBitcoin's price has slipped again this week, signalling renewed volatility in the digital asset space. From rising US inflation worries to ETF outflows, here's what's dragging crypto prices lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tata-trusts-explained-structure-legacy-boardroom-history-2800839-2025-10-10",
      "headline": "The legacy of Tata Trusts, beyond the boardroomTata Trusts is one of India's oldest, largest, and most influential philanthropic foundations.  A group of public charitable trusts set up by members of the Tata family, the present-day Trusts trace their origin to the working-class-focused JN Endowment Fund, started by Jamsetji Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-start-flat-trade-green-financial-stocks-2800834-2025-10-10",
      "headline": "Sensex, Nifty trade higher after flat start as banks lead gainsThe S&P BSE Sensex gained 232.01 points to 82,404.11, while the NSE Nifty50 added 70.60 points to 25,252.40 as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/uk-pm-paytm-praise-superstar-indian-fintech-industry-global-fintech-festival-2800821-2025-10-10",
      "headline": "UK PM Keir Starmer calls Paytm the 'Superstar' of Indian fintech industryUK Prime Minister Keir Starmer said that the rise of Indian fintech companies on the world stage driven by technological innovation, digital inclusion, and entrepreneurial scale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-allotment-out-today-live-check-status-online-record-bid-gmp-rises-listing-date-2800811-2025-10-10",
      "headline": "LG Electronics IPO allotment live: Check status online, GMP surges ahead of listingLG Electronics IPO closed for bidding on Thursday, created a record by attracting bids worth Rs 4.4 lakh crore, making it the most subscribed IPO in India by value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-board-meeting-today-october-10-noel-tata-mehli-mistry-what-to-expect-2800797-2025-10-10",
      "headline": "Tata Trusts board meets today amid internal turmoil: Here's what to expectThe board meeting follows days of internal disagreement and comes just a day after the first death anniversary of Ratan N. Tata, the former chairman who led the Trusts for several decades until his death last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-denials-material-change-clause-hidden-in-fine-print-2800524-2025-10-10",
      "headline": "Hidden in fine print: The clause that lets insurers quietly increase your premiumA little-known \"Material Change\" clause in health policies lets insurers increase premiums or restrict coverage after a claim. However, policyholders can challenge such actions to safeguard renewability and long-term benefits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-sanctions-over-50-entities-including-indians-over-links-to-iran-oil-trade-glbs-2800775-2025-10-10",
      "headline": "US sanctions over 50 entities, including Indians, over links to Iran oil tradeAmong those sanctioned are Varun Pula, Soniya Shrestha, and Iyappan Raja, all Indian nationals accused of facilitating shipments of Iranian oil and LPG. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-shares-taimur-ali-khan-chooses-sports-over-acting-2801406-2025-10-11",
      "headline": "Kareena Kapoor shares Taimur chooses sports over acting: He has no clue about actors Kareena Kapoor shared that her son Taimur Ali Khan has no interest in acting and prefers sports and other activities instead. Despite being the child of Bollywood superstars, Taimur is exploring his own passions at school."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billie-eilish-pulled-into-crowd-during-miami-concert-video-goes-viral-2801397-2025-10-11",
      "headline": "Fans pull Billie Eilish into crowd during Miami concert, safely rescued by security During her Miami concert on October 9, Billie Eilish was pulled into the crowd by a fan but was quickly rescued by security and continued her performance. The incident left the singer visibly shaken, highlighting ongoing safety concerns she has faced in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-update-nandhini-walks-out-after-full-blown-meltdown-2801392-2025-10-11",
      "headline": "Bigg Boss Tamil 9: Nandhini walks out after full-blown meltdown  'Bigg Boss Tamil' Season 9 contestant Nandhini exited the show after a meltdown, citing her inability to act or play along for content. Her departure left both contestants and fans emotional, with many praising her for prioritising her mental health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-shares-glimpse-of-ring-amid-her-engagement-with-vijay-deverakonda-2801368-2025-10-11",
      "headline": "Rashmika shares glimpse of ring amid engagement buzz with Vijay Deverakonda Rashmika Mandanna and Vijay Deverakonda are engaged and planning to marry in February 2026, following an intimate ceremony in Hyderabad. Rashmika recently shared the first glimpse of her engagement ring, delighting fans and subtly confirming the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diwali-2025-at-box-office-the-lights-are-on-but-where-are-biggies-thamma-ek-deewane-ki-deewaniyat-bison-mahayoddha-rama-2801367-2025-10-11",
      "headline": "Diwali 2025 box office: The lights are on, but where are the biggies? As Diwali 2025 lights up theatres across India, Bollywood bets on 'Thamma', 'Ek Deewane Ki Deewaniyat', and 'Mahayoddha Rama', while the South stays unusually silent. Trade experts decode how the festival's once-guaranteed box office magic is evolving -- from star-driven spectacles to content-led cinema -- and what the changing festive calendar means for India's biggest movie season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-teri-mitti-performance-wins-hearts-at-mera-desh-pehle-event-gujarat-2801358-2025-10-11",
      "headline": "Akshay Kumar's Teri Mitti performance wins hearts at Gujarat event. Watch Akshay Kumar moved audiences with a performance of 'Teri Mitti' at 'Mera Desh Pehle' event in Gujarat. Dressed in traditional attire, he left a lasting impact with his emotional tribute to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/happy-birthday-amitabh-bachchan-how-the-icon-stays-relevant-in-the-era-of-gen-z-2801229-2025-10-11",
      "headline": "Happy Birthday Amitabh Bachchan: How the icon stays relevant in the era of Gen Z Amitabh Bachchan turns 83 on October 11. A look at how the legend of cinema has seamlessly moved from his larger-than-life image of yore to one of the biggest phenomena on Indian reality TV"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-collection-day-9-rishab-shetty-film-surpasses-rs-350-crore-in-india-2801346-2025-10-11",
      "headline": "Kantara Chapter 1 box office Day 9: Rishab's film surpasses Rs 350 crore in India Rishab Shetty's 'Kantara Chapter 1' continues its dream run, crossing Rs 350 crore in India and Rs 500 crore worldwide. The film regained momentum in its second week, with strong occupancy across all languages and regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/kantara-chapter-1-rishab-shetty-performance-devotion-cinematic-brilliance-review-2801274-2025-10-11",
      "headline": "A love letter to Kantara Chapter 1: An unforgettable theatrical experience 'Kantara Chapter 1' has grossed over Rs 500 crore at the worldwide box office. But for those who truly loved the film, it means more than just pride in the number — it's about the emotions the film leaves you with. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/decoding-karan-johar-homebound-question-what-is-theatre-worthy-anymore-2801176-2025-10-11",
      "headline": "Decoding Karan Johar's Homebound question: What's theatre-worthy anymore? After 'Homebound's' critical acclaim but box office failure, Karan Johar reflected on whether passion-driven cinema still has space in theatres. IndiaToday.in spoke to trade experts who weighed in on the balance between art and commerce, the changing post-pandemic audience, and what makes a film \"theatre-worthy\" today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-48-day-47-written-updates-kunickaa-sadanand-romance-nehal-chudasama-captaincy-2801301-2025-10-10",
      "headline": "Bigg Boss 19 episode 48: Kunickaa gets candid on romance, Nehal wins captaincy After a twist in this week's captaincy task, Nehal Chudasama became the new captain of 'Bigg Boss 19'. Meanwhile, Kunickaa Sadanand opened up about her love life and Gaurav Khanna won a car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-ayushmann-khurrana-tahira-kashyap-bollywood-celebrity-karwa-chauth-celebration-2801317-2025-10-10",
      "headline": "Priyanka-Nick to Ayushmann-Tahira, here's how Bollywood celebrated Karwa Chauth Celebrity couples like Priyanka Chopra and Nick Jonas, Ayushmann Khurrana and Tahira Kashyap, shared Karwa Chauth photos. Check out their special moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-prabhas-kalki-2898-ad-sequel-deepika-padukone-exit-2801278-2025-10-10",
      "headline": "Alia likely to join Prabhas's Kalki 2898 AD sequel after Deepika's exit: Report Actor Alia Bhatt is reportedly in advanced discussions to join the sequel of 'Kalki 2898 AD'. The makers had earlier cited creative and commitment differences for actor Deepika Padukone's exit from the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varinder-ghuman-suffered-cardiac-arrest-after-routine-surgery-hospital-statement-2801238-2025-10-10",
      "headline": "Varinder Ghuman suffered cardiac arrest after shoulder surgery, says hospital Punjabi actor and well-known bodybuilder Varinder Singh Ghuman died following a sudden cardiac arrest after a routine shoulder surgery in Amritsar. An official statement issued by the hospital confirmed Ghuman had no prior health issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-star-studded-karwa-chauth-celebration-video-sunita-kapoor-home-2801227-2025-10-10",
      "headline": "Shilpa Shetty gives glimpse into star-studded Karwa Chauth celebration. Watch Actor Shilpa Shetty on Friday gave a glimpse into Karwa Chauth celebrations at Sunita Kapoor's home. Several well-known Bollywood personalities attended the festive event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-the-bads-of-bollywood-respectful-satire-netflix-india-top-2801216-2025-10-10",
      "headline": "Wanted to be self-deprecating, not disrespectful: Aryan Khan on Ba***ds of Bollywood Aryan Khan's directorial debut, 'The Ba***ds of Bollywood', delivered a sharp yet respectful satire on the Hindi film industry. Speaking about the show's tone, the young filmmaker said the team was careful to keep the humour self-deprecating without ever crossing into disrespect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/trisha-krishnan-shuts-down-marriage-rumours-with-a-witty-instagram-post-2801199-2025-10-10",
      "headline": "Plan my honeymoon too: Trisha Krishnan shuts down marriage rumours with wit Trisha Krishnan addressed rumours about her marriage plans with wit and clarity, dismissing speculations of an impending wedding to a Chandigarh businessman. The actor shared a clever post on Instagram to hit back at those speculating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-pays-heartfelt-tribute-to-late-tiger-3-co-star-varinder-singh-ghuman-2801193-2025-10-10",
      "headline": "Salman Khan pays heartfelt tribute to late Tiger 3 co-star Varinder Singh Ghuman Actor Varinder Singh Ghuman, India's first vegetarian professional bodybuilder and noted actor, died suddenly at 47 due to cardiac arrest. His 'Tiger 3' co-star Salman Khan mourned his death in an emotional post."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/had-no-role-government-amid-row-over-female-journalists-being-banned-at-taliban-presser-in-delhi-2801365-2025-10-11",
      "headline": "Had no role: Government after women journalists barred at Taliban presserThe government clarified it had no role in the Taliban press conference in Delhi where women journalists were barred, sparking outrage over gender bias and India's image. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-surendra-rajput-nobel-peace-prize-rahul-gandhi-also-fights-for-democracy-2801315-2025-10-10",
      "headline": "Rahul Gandhi also fights for democracy: Congress leader's post on Nobel Peace PrizeThe Congress has long maintained that Rahul Gandhi is fighting against the \"dictatorship\" of the NDA government as he has, taken on the ruling dispensation over several key issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-police-officer-adgp-puran-kumar-suicide-rohtak-sp-removed-2801432-2025-10-11",
      "headline": "Senior Haryana cop sacked after being named in IPS officer suicide caseSenior Haryana cop Narendra Bijarniya removed after being named in FIR in police officer suicide case"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-2-live-score-commentary-scorecard-yashasvi-jaiswal-new-delhi-2801349-2025-10-11",
      "headline": "Day 2 Live: Gill and Jurel in complete controlIndia vs West Indies Live score, 2nd Test Day 2: India skipper Shubman Gill has kept India in firm control of Day 2 with his fiery batting, absorbing the impact of losing Yashasvi Jaiswal and Nitish Kumar Reddy. With Dhruv Jurel in equal fiery mode since coming on, it has only got worse for the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/decoding-karan-johar-homebound-question-what-is-theatre-worthy-anymore-2801176-2025-10-11",
      "headline": "Decoding Karan Johar's Homebound question: What's theatre-worthy anymore?After 'Homebound's' critical acclaim but box office failure, Karan Johar reflected on whether passion-driven cinema still has space in theatres. IndiaToday.in spoke to trade experts who weighed in on the balance between art and commerce, the changing post-pandemic audience, and what makes a film \"theatre-worthy\" today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-durgapur-medical-student-raped-inside-hospital-premises-rg-kar-case-redux-2801401-2025-10-11",
      "headline": "Medical student dragged, raped on hospital premises in BengalThe incident in Bengal's Durgapur, the biggest industrial hub of the state, is reminiscent of the 2024 RG Kar case where a junior doctor was raped and murdered, triggering nationwide outrage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/tehreek-e-labbaik-tlp-lahore-islamabad-march-pakistan-army-proxy-imran-khan-gaza-asim-munir-qamar-javed-bajwa-2801134-2025-10-11",
      "headline": "What's Tehreek-e-Labbaik, Pak army's proxy that's taken nation hostage?Tehreek-e-Labbaik Pakistan (TLP), an extremist Islamist group, has repeatedly held Pakistan hostage through violent protests. The TLP is a proxy of the military regime and has been used by it to shape political outcomes. It held violent protests in Lahore that killed two, and forced the fortification of Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/machado-accepted-it-in-my-honour-trump-reacts-to-missing-2025-nobel-peace-prize-glbs-2801339-2025-10-11",
      "headline": "Didn't say give it to me: Trump quips on his call with Nobel winner MachadoDonald Trump may have been snubbed for the 2025 Nobel Peace Prize, but the US President remains unfazed in his campaign to project himself as a peacemaker. It was amply reflected in his call with Nobel winner Maria Corina Machado."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/indias-hidden-speakeasy-bars-with-secret-doors-password-entries-2801145-2025-10-11",
      "headline": "Inside the world of India's 'hidden' barsCalled speakeasies, hidden bars are fuelling India's latest F&B obsession - a taste for mystery on the menu. Delhi, especially, has no shortage of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/tcs-cuts-nearly-20000-jobs-its-biggest-layoff-ever-story-in-5-points-2801402-2025-10-11",
      "headline": "Confirmed, TCS has cut nearly 20,000 jobs in recent layoffs: Story in 5 pointsTCS has executed its steepest-ever layoffs, reducing its workforce below 6 lakh employees in the last 3 months. The cuts reflect pressures from AI adoption and uncertain US trade policies affecting India's IT industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-needs-an-fda-style-drug-regulator-now-2801371-2025-10-11",
      "headline": "India needs an FDA-style drug regulator — NowIndia's recurring drug scandals expose deep cracks in its regulatory framework. From contaminated syrups to inconsistent quality checks, the country urgently needs a strong, independent FDA-like body to ensure medicine safety and restore public trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/jodhpur-engineering-university-awards-120-marks-in-100-mark-paper-sparks-outrage-2801394-2025-10-11",
      "headline": "Jodhpur engineering university awards 120 marks in 100-mark paper, sparks outrageStudents at MBM Engineering University in Jodhpur were stunned after results showed marks as high as 120 in a 100-mark exam, prompting a government probe and student protests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-shares-glimpse-of-ring-amid-her-engagement-with-vijay-deverakonda-2801368-2025-10-11",
      "headline": "Rashmika shares glimpse of ring amid engagement buzz with Vijay DeverakondaRashmika Mandanna and Vijay Deverakonda are engaged and planning to marry in February 2026, following an intimate ceremony in Hyderabad. Rashmika recently shared the first glimpse of her engagement ring, delighting fans and subtly confirming the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-us-will-hit-chinese-imports-with-additional-100-tariff-from-november-glbs-2801335-2025-10-11",
      "headline": "Trump escalates trade war, slaps 100% tariff on Chinese goods from November 1Trump on Friday announced a 100 per cent tariff on all Chinese imports and new export controls on critical software from November 1, citing China's aggressive trade stance and escalating tensions between the two nations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-missing-shefali-verma-batting-struggles-smriti-mandhana-indw-vs-saw-2801399-2025-10-11",
      "headline": "Are India missing the Shafali Verma firepower amid batting woes?Women's World Cup: India's batting options are limited, yet they chose to overlook Shafali Verma for the mega event. On Thursday, India tasted their first defeat in Vizag at the hands of Laura Wolvaardt's South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadavs-facebook-profile-briefly-suspended-samajwadi-party-slams-bjp-2801414-2025-10-11",
      "headline": "Akhilesh Yadav's Facebook profile briefly suspended, Samajwadi Party slams BJPSamajwadi Part chief Akhilesh Yadav's verified account, followed by over 8 million people, was suddenly deactivated around 6 pm on Friday. It was restored on Saturday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diwali-2025-at-box-office-the-lights-are-on-but-where-are-biggies-thamma-ek-deewane-ki-deewaniyat-bison-mahayoddha-rama-2801367-2025-10-11",
      "headline": "Diwali 2025 box office: The lights are on, but where are the biggies?As Diwali 2025 lights up theatres across India, Bollywood bets on 'Thamma', 'Ek Deewane Ki Deewaniyat', and 'Mahayoddha Rama', while the South stays unusually silent. Trade experts decode how the festival's once-guaranteed box office magic is evolving -- from star-driven spectacles to content-led cinema -- and what the changing festive calendar means for India's biggest movie season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-532-11-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/several-feared-dead-missing-after-massive-blast-at-tennessee-explosives-plant-glbs-2801329-2025-10-11",
      "headline": "Massive explosion at US munitions plant shakes homes miles away, 18 feared deadA massive explosion at a Tennessee explosives plant left 18 people feared dead. The blast destroyed a building, rattled nearby homes, and prompted an ongoing investigation into the cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/why-30-30-3-method-can-be-the-ultimate-gut-hack-you-need-2799940-2025-10-11",
      "headline": "Why the 30-30-3 method can be the ultimate gut hack you needAnother day, another wellness trend on the block, and this one's for a happy gut. As gut health takes on the wellness world, the 30-30-3 framework might just be the hack you didn't know you needed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/kantara-chapter-1-rishab-shetty-performance-devotion-cinematic-brilliance-review-2801274-2025-10-11",
      "headline": "A love letter to Kantara Chapter 1: An unforgettable theatrical experience'Kantara Chapter 1' has grossed over Rs 500 crore at the worldwide box office. But for those who truly loved the film, it means more than just pride in the number — it's about the emotions the film leaves you with. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/starship-super-heavy-launch-on-october-14-what-is-elon-musk-trying-to-achieve-2801369-2025-10-11",
      "headline": "Starship Super Heavy launch: What is Elon Musk trying to achieve?On this flight, the Super Heavy booster will attempt new landing burn engine configurations not previously demonstrated in flight. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ashok-kumar-pal-senior-reliance-power-executive-and-anil-ambani-aide-arrested-by-ed-in-money-laundering-case-2801353-2025-10-11",
      "headline": "Anil Ambani aide and senior Reliance Power executive arrested by EDThe arrest of Ashok Pal, who serves as the executive director at Reliance Power, is related to a suspected fake bank guarantee racket worth Rs 68.2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gary-kasparov-vs-viswanathan-anand-clutch-chess-st-louis-reaction-2801417-2025-10-11",
      "headline": "Garry Kasparov beats old rival Vishy Anand, exceeds own expectations at 62Garry Kasparov defeated Viswanathan Anand 13–11 at the Clutch Chess: The Legends exhibition in St Louis. The 62-year-old expressed surprise at his own performance but stopped short of declaring a comeback. The event reunited the two former rivals, 30 years after their World Championships match in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-shares-taimur-ali-khan-chooses-sports-over-acting-2801406-2025-10-11",
      "headline": "Kareena Kapoor shares Taimur chooses sports over acting: He has no clue about actorsKareena Kapoor shared that her son Taimur Ali Khan has no interest in acting and prefers sports and other activities instead. Despite being the child of Bollywood superstars, Taimur is exploring his own passions at school."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-shares-glimpse-of-ring-amid-her-engagement-with-vijay-deverakonda-2801368-2025-10-11",
      "headline": "Rashmika shares glimpse of ring amid engagement buzz with Vijay DeverakondaRashmika Mandanna and Vijay Deverakonda are engaged and planning to marry in February 2026, following an intimate ceremony in Hyderabad. Rashmika recently shared the first glimpse of her engagement ring, delighting fans and subtly confirming the news."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-missing-shefali-verma-batting-struggles-smriti-mandhana-indw-vs-saw-2801399-2025-10-11",
      "headline": "Are India missing the Shafali Verma firepower amid batting woes? Women's World Cup: India's batting options are limited, yet they chose to overlook Shafali Verma for the mega event. On Thursday, India tasted their first defeat in Vizag at the hands of Laura Wolvaardt's South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gary-kasparov-vs-viswanathan-anand-clutch-chess-st-louis-reaction-2801417-2025-10-11",
      "headline": "Garry Kasparov beats old rival Vishy Anand, exceeds own expectations at 62 Garry Kasparov defeated Viswanathan Anand 13–11 at the Clutch Chess: The Legends exhibition in St Louis. The 62-year-old expressed surprise at his own performance but stopped short of declaring a comeback. The event reunited the two former rivals, 30 years after their World Championships match in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nonkululeko-mlaba-reprimanded-icc-sendoff-womens-world-cup-south-africa-india-harleen-deol-2801413-2025-10-11",
      "headline": "South Africa spinner reprimanded for Harleen Deol send-off The ICC reprimanded South African left-arm spinner Nonkululeko Mlaba after she gave Harleen Deol a send-off in Thursday's clash at the Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket Stadium in Visakhapatnam. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-yashasvi-jaiswal-run-out-video-shubman-gill-2801396-2025-10-11",
      "headline": "Yashasvi Jaiswal distraught after mix-up with Shubman Gill, run out for 175 India vs West Indies, 2nd Test: Yashasvi Jaiswal was run-out for 175 as early as the second over of the day's play in New Delhi. The left-handed opener was involved in a horrible mix-up with captain Shubman Gill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/vedanta-delhi-half-marathon-prashant-saxena-cancer-survivor-story-2801370-2025-10-11",
      "headline": "Beating cancer twice, running strong: Prashant Saxena's Delhi Half Marathon tale After beating cancer twice, Prashant Saxena is now aiming to inspire others by continuing to conquer the Delhi half marathon. Thee 51-year-old opens up on his fight with cancer, how running became his passion and goals for future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-2-live-score-commentary-scorecard-yashasvi-jaiswal-new-delhi-2801349-2025-10-11",
      "headline": "Day 2 Live: Gill and Jurel in complete control India vs West Indies Live score, 2nd Test Day 2: India skipper Shubman Gill keeps India in firm control of the Day 2 morning session with his fiery batting, absorbing the impact of losing Yashasvi Jaiswal and Nitish Kumar Reddy. Nitish had earlier delivered a quick, impactful innings after Jaiswal's early dismissal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-vs-west-indies-dismissal-curse-himself-sanjay-bangar-2801345-2025-10-11",
      "headline": "KL Rahul will curse himself for his dismissal vs WI in Delhi Test: Sanjay Bangar Former India coach Sanjay Bangar believes KL Rahul will be furious with himself after his stumping in the Delhi Test. Bangar praised Rahul's start but highlighted technical lapses that cost him a bigger score."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-scold-security-young-fan-shivaji-park-training-session-viral-video-2801343-2025-10-11",
      "headline": "Watch: Rohit Sharma scolds security for stopping young fan from meeting him Rohit Sharma's training session at Shivaji Park took an emotional turn when he stopped security from blocking a young fan. The Indian star's protective reaction quickly went viral, as he continues to prepare for Australia ODIs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-yashasvi-jaiswal-eyes-record-innings-india-test-cricket-highest-score-sehwag-2801298-2025-10-11",
      "headline": "Jaiswal eyeing uncharted territory: Ex-IND opener hints at record-breaking knock IND vs WI: Yashasvi Jaiswal impressed with unbeaten 173 on Day 1 against West Indies in Delhi. His disciplined approach hints at a possible record-breaking innings for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-yashasvi-jaiswal-test-cricket-versatility-delhi-knock-2801268-2025-10-11",
      "headline": "Zen mode in Tests: Yashasvi Jaiswal shows verstality is his strong suit in Delhi Yashasvi Jaiswal has always been known to be a player who has excelled as an aggressive opener in Test cricket. But during the second match of the series against the West Indies, Jaiswal showed that versatility is actually his biggest feature while batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-2-live-score-commentary-scorecard-yashasvi-jaiswal-new-delhi-2801349-2025-10-11",
      "headline": "Day 2 Live: Gill and Jurel in complete control India vs West Indies Live score, 2nd Test Day 2: India skipper Shubman Gill keeps India in firm control of the Day 2 morning session with his fiery batting, absorbing the impact of losing Yashasvi Jaiswal and Nitish Kumar Reddy. Nitish had earlier delivered a quick, impactful innings after Jaiswal's early dismissal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-vs-west-indies-dismissal-curse-himself-sanjay-bangar-2801345-2025-10-11",
      "headline": "KL Rahul will curse himself for his dismissal vs WI in Delhi Test: Sanjay Bangar Former India coach Sanjay Bangar believes KL Rahul will be furious with himself after his stumping in the Delhi Test. Bangar praised Rahul's start but highlighted technical lapses that cost him a bigger score."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-scold-security-young-fan-shivaji-park-training-session-viral-video-2801343-2025-10-11",
      "headline": "Watch: Rohit Sharma scolds security for stopping young fan from meeting him Rohit Sharma's training session at Shivaji Park took an emotional turn when he stopped security from blocking a young fan. The Indian star's protective reaction quickly went viral, as he continues to prepare for Australia ODIs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-yashasvi-jaiswal-eyes-record-innings-india-test-cricket-highest-score-sehwag-2801298-2025-10-11",
      "headline": "Jaiswal eyeing uncharted territory: Ex-IND opener hints at record-breaking knock IND vs WI: Yashasvi Jaiswal impressed with unbeaten 173 on Day 1 against West Indies in Delhi. His disciplined approach hints at a possible record-breaking innings for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-yashasvi-jaiswal-test-cricket-versatility-delhi-knock-2801268-2025-10-11",
      "headline": "Zen mode in Tests: Yashasvi Jaiswal shows verstality is his strong suit in Delhi Yashasvi Jaiswal has always been known to be a player who has excelled as an aggressive opener in Test cricket. But during the second match of the series against the West Indies, Jaiswal showed that versatility is actually his biggest feature while batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/ankita-dhyani-steeplechase-silver-university-games-world-athletics-aims-2028-olympics-2801322-2025-10-10",
      "headline": "Ankita Dhyani: Learning from 2025, aiming for Asian Games and beyondAnkita Dhyani had a mixed 2025 with successes and setbacks in steeplechase events. She remains focused on upcoming Asian and Commonwealth Games as she targets the 2028 Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-sophie-devine-new-zealand-comeback-india-shock-defeat-south-africa-2801311-2025-10-10",
      "headline": "Anything can happen: Devine eyes NZ World Cup comeback after India's shock defeatSophie Devine believes that New Zealand can put together a comeback charge, reflecting on how South Africa turned the tides in their favour to take down the tournament hosts, India earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-crown-jewel-2025-perth-five-headline-matches-global-streaming-2801308-2025-10-10",
      "headline": "WWE Crown Jewel: Match card, when and where to watch and all you need to knowWWE Crown Jewel 2025 is all set to emanate from Perth, Australia with a stacked card featuring some of the biggest stars. With the Crown Jewel championships set to be defended and John Cena in action, the event is expected to be a blockbuster. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-will-be-desperate-to-dismiss-chamari-athapaththu-tammy-beaumont-2801309-2025-10-10",
      "headline": "England will be desperate to dismiss Chamari Athapaththu: Tammy BeaumontEngland batter Tammy Beaumont said that they would be desperate to get the wicket of Chamari Athapaththu during the clash between both sides on Saturday, October 11. Athapaththu has been the star player for Sri Lanka over the past few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-day-1-tough-day-west-indies-floyd-reifer-delhi-2801299-2025-10-10",
      "headline": "Tough day for West Indies, but key lessons in bowling long spells: Floyd ReiferWest Indies batting coach Floyd Reifer acknowledged the challenges faced by his bowlers but emphasised the opportunity for growth and learning in sub-continental conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/gulveer-singh-2025-asian-gold-world-athletics-heartbreak-2026-goals-2801302-2025-10-10",
      "headline": "Gulveer calls 2025 a good year despite World Athletics Championships heartbreakGulveer Singh said that he finds 2025 a good year for him personally, despite the World Athletics Championships heartbreak. Gulveer just missed out on making it to the final of the 5,000m event by a whisker. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kasparov-jokes-anand-chess-children-indian-chess-academy-gukesh-2801288-2025-10-10",
      "headline": "Kasparov quips Anand's real challenge is managing India's chess childrenGarry Kasparov talked about Viswanathan Anand's influence on young Indian chess players. Anand's academy continues to nurture talent even as the rivalry heats up on the board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-bangladesh-vs-new-zealand-match-report-sophie-devine-2801281-2025-10-10",
      "headline": "NZ vs BAN: New Zealand finally get off the mark as Bangladesh capitulate in GuwahatiAn all-round bowling performance from New Zealand helped them get off the mark and thrash Bangladesh by 100 runs in the Women's World Cup 2025 on Friday, October 10. Devine continued to be impressive with the bat for the White Ferns and found support from Brooke Halliday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-day-1-tough-day-west-indies-floyd-reifer-delhi-2801299-2025-10-10",
      "headline": "Tough day for West Indies, but key lessons in bowling long spells: Floyd ReiferWest Indies batting coach Floyd Reifer acknowledged the challenges faced by his bowlers but emphasised the opportunity for growth and learning in sub-continental conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/gulveer-singh-2025-asian-gold-world-athletics-heartbreak-2026-goals-2801302-2025-10-10",
      "headline": "Gulveer calls 2025 a good year despite World Athletics Championships heartbreakGulveer Singh said that he finds 2025 a good year for him personally, despite the World Athletics Championships heartbreak. Gulveer just missed out on making it to the final of the 5,000m event by a whisker. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kasparov-jokes-anand-chess-children-indian-chess-academy-gukesh-2801288-2025-10-10",
      "headline": "Kasparov quips Anand's real challenge is managing India's chess childrenGarry Kasparov talked about Viswanathan Anand's influence on young Indian chess players. Anand's academy continues to nurture talent even as the rivalry heats up on the board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-bangladesh-vs-new-zealand-match-report-sophie-devine-2801281-2025-10-10",
      "headline": "NZ vs BAN: New Zealand finally get off the mark as Bangladesh capitulate in GuwahatiAn all-round bowling performance from New Zealand helped them get off the mark and thrash Bangladesh by 100 runs in the Women's World Cup 2025 on Friday, October 10. Devine continued to be impressive with the bat for the White Ferns and found support from Brooke Halliday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-full-big-bash-league-season-sydney-thunder-2801247-2025-10-10",
      "headline": "Ravichandran Ashwin confirmed to play full Big Bash League season for Sydney ThunderRavichandran Ashwin will play the entire Big Bash League season with Sydney Thunder after going unsold in the ILT20 auction. His full-season commitment boosts Thunder's title hopes and highlights his post-retirement cricket journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-wi-sai-sudharsan-mentally-tough-never-under-pressure-sitanshu-kotak-2801234-2025-10-10",
      "headline": "Sai Sudharsan is someone who's mentally tough, never under pressure: Sitanshu KotakIndia's batting coach, Sitanshu Kotak, believes that Sai Sudharsan is a player who has the mental resilience and never comes to bat under pressure. This comes after his splendid knock against the West Indies in Delhi on Day 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-patient-innings-india-west-indies-test-cricket-no-3-position-2801213-2025-10-10",
      "headline": "The art of letting it go: How Sai Sudharsan broke the shackles in Test cricketSai Sudharsan showcased patience and maturity in India's second Test against West Indies, building a 193-run stand with Yashasvi Jaiswal. Learning from past experiences, he reacted calmly, making a strong case for the number three spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kerala-ranji-trophy-2025-26-sanju-samson-azharuddeen-2801222-2025-10-10",
      "headline": "Sanju Samson to play for Kerala vs Maharashtra in Ranji Trophy opener: ReportIndia wicket-keeper Sanju Samson is all set to play for Kerala in their Ranji Trophy opener against Maharashtra, which will begin on October 15. Kerala have named Mohammed Azharudeen as their new captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-pacer-marufa-akter-cricket-journey-hardship-international-success-2801206-2025-10-10",
      "headline": "Marufa Akter breaks down recalling dark times: Couldn't even afford new clothesWomen's World Cup: Bangladesh pacer Marufa Akter said she overcame a childhood of financial struggles and social exclusion, and is now proud to make her mark on the international stage. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-yashasvi-jaiswal-173-not-out-second-test-delhi-2025-2801210-2025-10-10",
      "headline": "Won't play bad shots: Yashasvi Jaiswal's tea time message revealed by batting coachIndia batting coach Sithanshu Kothak heaped praise on Yashasvi Jaiswal and revealed the tea-time chat he had with the southpaw during Day one of the second Test against the West Indies. Jaiswal scored his 7th century on Friday, October 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-dehlhi-test-crowd-rohit-sharma-shivaji-park-2801188-2025-10-10",
      "headline": "Fans mock empty stands at Delhi Test, say Rohit's Mumbai training had bigger crowdThe India–West Indies Test series continues to suffer from poor crowd attendance, with Delhi's stadium nearly empty on Day 1 of the second Test. Meanwhile, in Mumbai, Rohit Sharma drew hundreds of fans to his training session at the iconic Shivaji Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tammy-beaumont-england-vs-sri-lanka-colombo-pitch-womens-world-cup-2025-2801179-2025-10-10",
      "headline": "How England will look to tackle tricky Colombo pitch? Tammy Beaumont revealsTammy Beaumont said that England have done their homework on the Colombo pitch and will be looking to implement their methods during the clash against Sri Lanka on Saturday, October 11. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}