{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bangladesh-economy-adani-power-supply-cut-explainer-power-development-board-2626922-2024-11-02",
      "headline": "Explained: How Adani Power's supply cut impacts crisis-hit Bangladesh economyAdani Power's supply cut to Bangladesh intensifies existing economic challenges, raising concerns about energy security and financial stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-power-plant-bangladesh-electricity-supply-cut-unpaid-bills-gautam-adani-2626866-2024-11-02",
      "headline": "Adani Power cuts half of Bangladesh electricity supply over unpaid duesThe power reduction comes at a challenging time for Bangladesh, which reported a shortfall of over 1,600 megawatts (MW) overnight. The 1,496 MW Adani plant is currently generating just 700 MW from one of its two units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-samvat-2081-stock-market-sensex-nifty-key-stocks-strategies-2626541-2024-11-01",
      "headline": "Muhurat Trading 2024: Markets end on strong note; all sectoral indices in greenMuhurat Trading 2024 has concluded, marking the arrival of Samvat 2081. The session, which took place from 6:00 PM to 7:00 PM, ended on a strong note, with the Sensex surging 335 points and the Nifty closing at 24,300. Investors actively participated, reflecting the festive spirit of the Hindu New Year through token investments aimed at attracting prosperity. All the sectoral indices ended the session in green, with M&M, ONGC, Adani Ports and BEL emerging as the top gainers. On the other hand, the top losers were Dr Reddy's, HCLTech, Britannia, Tech Mahindra and Adani Enterprises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-timings-strategies-tips-stock-picks-and-key-details-2626384-2024-11-01",
      "headline": "Muhurat Trading 2024: Check timings, stock recommendations, all key detailsMuhurat Trading today: The pre-opening session will begin at 5:45 PM, and all intraday positions will be automatically squared off 15 minutes before the session's close, necessitating careful planning for same-day trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-top-stock-picks-trading-strategies-expert-insights-key-levels-timing-2626371-2024-11-01",
      "headline": "Muhurat trading 2024: Check stock picks, trading strategy and expert insightsMuhurat trading is not just a unique market session; it's a cherished tradition where investors make token investments to invoke the blessings of Goddess Lakshmi, the goddess of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bibek-debroy-dies-aged-69-visionary-economist-policy-reformer-author-2626283-2024-11-01",
      "headline": "Bibek Debroy dies at 69: A visionary economist and policy reformer Bibek Debroy's life was marked by significant contributions to economic policy and classical literature, shaping India's intellectual landscape and leaving a lasting impact on future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/19-kg-lpg-commercial-gas-cylinder-price-hike-delhi-mumbai-chennai-kolkata-new-rate-2626197-2024-11-01",
      "headline": "19 kg LPG commercial cylinders to get costlier from today. Check pricesThe prices of 19-kg commercial LPG cylinders have been revised across the country, including in metro cities like Delhi, Mumbai, Kolkata, and Chennai, effective November 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-550-points-lower-nifty-dips-as-it-stocks-slide-2626082-2024-10-31",
      "headline": "Sensex ends over 550 points lower, Nifty dips as IT stocks slideThe S&P BSE Sensex dropped by 553.12 points to close at 79,389.06, while the NSE Nifty50 fell 135.50 points, settling at 24,205.35. Broader market indices also declined as volatility weighed on investor sentiment across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-share-price-gain-10-percent-today-usfda-approval-goa-facility-stock-benefit-explained-2625958-2024-10-31",
      "headline": "Explained: Why Cipla share price surged up to 10% todayCipla share price: The stock rose by 9.88% to reach a day high of Rs 1,557.45 on the Bombay Stock Exchange (BSE).  At 10:41 am, shares of Cipla were up 8.24% at Rs 1,534.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-nbfc-hdfc-bank-arm-files-for-rs-12500-crore-ipo-check-details-2625953-2024-10-31",
      "headline": "HDFC Bank's HDB Financial files Rs 12,500 crore IPO. Check detailsHDFC Bank, holding a 94.6% stake in HDB Financial, will sell shares worth up to Rs 10,000 crore, while HDB Financial plans to issue fresh shares totalling Rs 2,500 crore, as outlined in the filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-openig-dalal-street-sensex-nifty-fall-fii-outflow-weak-q2-results-overvaluation-2625947-2024-10-31",
      "headline": "Diwali fireworks missing from Dalal Street as Sensex, Nifty fall The S&P BSE Sensex was down 199.13 points to 79,743.05 at 10:07 am, while the NSE Nifty50 fell 126 points to 24,340.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-diwali-celebration-drone-show-noida-headquarters-ceo-vijay-shekhar-sharma-2625873-2024-10-31",
      "headline": "Paytm lights up Noida skies with dazzling Diwali drone showPaytm celebrated Diwali with a dazzling drone show at its Noida headquarters, featuring messages like \"Happy Diwali\" and \"Paytm karo\" in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-snap-two-day-rally-dull-q2-earnings-disrupy-momentum-2625669-2024-10-30",
      "headline": "Sensex, Nifty snap 2-day rally as dull Q2 earnings disrupt momentum The BSE Sensex fell 0.5% to close at 79,966, while the NSE Nifty 50 index declined by the same margin to 24,350, as market sentiment weakened due to ongoing foreign selling and lacklustre corporate earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-2024-stocks-to-buy-recmmendations-stoxbox-strong-fundamentals-share-price-trends-2625626-2024-10-30",
      "headline": "StoxBox's Diwali picks: 5 stocks to light up your portfolioGet ready to brighten your portfolio this Diwali with these five promising stocks that are expected to deliver strong future performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-market-value-down-122-billion-dollars-since-july-32-percent-tumble-decoded-2625551-2024-10-30",
      "headline": "Falling behind in AI race has cost Samsung $122 billion: Report Samsung has lost $122 billion in market value since July, a tumble of 32% that makes it the largest decline among global chipmakers this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elcid-share-price-692535-percent-rise-india-most-expensive-stock-surpassing-mrf-2625536-2024-10-30",
      "headline": " Elcid's 66,92,535% surge makes it India's most expensive stock, surpassing MRFElcid Investments, based in Mumbai, is a non-banking financial company (NBFC) with a strong connection to Asian Paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-ports-share-price-top-gainers-nifty50-q2-results-2625465-2024-10-30",
      "headline": "Adani Enterprises, Adani Ports: Why Adani stocks are gaining todayAdani Enterprises shares rose 4.42% to Rs 2,974.50 on the National Stock Exchange (NSE) at 11:41 am, while APSEZ saw a 2.62% lift to Rs 1,408.65. All other Adani Group companies also traded in the green, supported by these positive cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-brings-102-tonnes-of-gold-from-bank-of-england-home-on-dhanteras-2625444-2024-10-30",
      "headline": "RBI's 102-tonne gold haul this Dhanteras: What's behind the move?The RBI recently relocated 102 tonnes of gold from the Bank of England's vaults to secure facilities within India as it now hold a total of 855 tonnes in reserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-today-gains-despite-disappointing-q2-results-2625446-2024-10-30",
      "headline": "Explained: Why Maruti Suzuki share price gained over 2% despite weak Q2 resultsMaruti Suzuki's quarterly report revealed a 17% year-on-year decline in net profit to Rs 3,103 crore, falling short of market expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-q2-earnings-diwali-adani-stocks-bel-2625435-2024-10-30",
      "headline": "Sensex, Nifty in red as Q2 earnings dampen Diwali spirit; Adani stocks gainThe NSE Nifty 50 dropped 0.24% to 24,411.9 points, while the BSE Sensex declined 0.28% to 80,142.11 by 9:57 am. Seven out of the 13 major sectors showed losses, while small-cap and mid-cap indices performed better, rising 1% and 0.5%, respectively. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/pro-khalistani-hindu-temple-attack-canada-bramption-indian-high-commission-ottawa-consular-camp-work-2627553-2024-11-04",
      "headline": "Indian mission condemns disruption of consular camp outside Canada templeThe Indian Mission voiced dismay over disruptions affecting routine consular events, which it said are organised with full cooperation from local partners to meet demand from Indian nationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/devotees-attacked-at-hindu-temple-in-canada-brampton-justin-trudeau-condemns-acts-of-violence-2627524-2024-11-04",
      "headline": "Pro-Khalistani mob attacks devotees at Hindu temple in Canada, Trudeau condemnsA group of devotees, including women and children, at the Hindu Sabha Mandir was targeted by alleged Khalistani supporters. Videos showed a group of men wielding sticks and attacking devotees outside the temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/raj-thackeray-mns-candidates-mumbai-assembly-elections-bjp-shiv-sena-ncp-congress-2627479-2024-11-03",
      "headline": "Raj Thackeray's party to contest 25 seats in Mumbai. Will it be a game-changer?Maharashtra Navnirman Sena's entry into Mumbai's Assembly race, contesting 25 of 36 seats, raises concerns for the BJP and Shiv Sena as it intensifies competition, potentially influencing vote shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-wankhede-test-gautam-gambhir-3-0-whitewash-2627529-2024-11-04",
      "headline": "Rohit Sharma needs to be clear about his role as opener in TestsIndia captain Rohit Sharma, in recent times, has led from the front with the bat as an opener as his role was well-defined. But the Indian captain seems stuck in the Test team as he doesn't know his role yet in the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/us-election-can-american-media-love-letter-tip-presidential-race-2627472-2024-11-03",
      "headline": "Press endorsements: Can US media love letters tip the election scales?The 2024 US election endorsements spotlight a complex relationship between the media and public trust, with signs that traditional endorsements may no longer carry the influence they once did."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-air-quality-today-pollution-smog-severe-very-poor-aqi-2627537-2024-11-04",
      "headline": "Delhi pollution at season's worst as air quality drops to 'severe'Delhi's air quality deteriorated on Monday, with several areas recording \"severe\" levels of pollution. The AQI crossed the 400 mark, and the IMD forecast mist and smog conditions for the next few days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-election-2024-donald-trump-white-house-2020-election-loss-republican-democrat-kamala-harris-2627516-2024-11-04",
      "headline": "'Shouldn't have left' White House after 2020 election loss: Donald TrumpMultiple reports suggest that Republican Candidate Donald Trump may claim premature victory on election day, as he did in 2020. Kamala Harris said that her campaign is prepared to counter it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/udhayanidhi-stalins-remarks-north-vs-south-films-bjp-counterattack-2627482-2024-11-03",
      "headline": "Udhayanidhi Stalin's remarks on North vs South films spark BJP counterattackTamil Nadu Deputy Chief Minister Udhayanidhi Stalin stirred yet another row by comparing film industries in North to film industries in the South. He said Bollywood has overshadowed the film industries of other languages in North India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-us-election-saturday-night-live-laugh-democratic-candidate-2627520-2024-11-04",
      "headline": "Kamala Harris jokes with 'herself' about her cackle on Saturday Night LiveWhen Kamala Harris's impostor Maya Rudolph burst into a loud, familiar imitation of Kamala's cackle, the Democratic candidate responded, 'I don't really laugh like that do I?'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-probes-suspected-leak-classified-gaza-documents-prime-minister-benjamin-netanyahu-aide-2627531-2024-11-04",
      "headline": "Israel probes suspected leak of classified Gaza documents by Netanyahu's aideIsraeli Prime Minister Benjamin Netanyahu has denied any wrongdoing by his office staffers and said in a statement on Saturday that he was only made aware of the leaked document by the media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-under-trial-prisoner-with-legs-tied-by-chain-escapes-from-hotel-in-gajpati-viral-video-2627498-2024-11-03",
      "headline": "Video: Legs chained, under-trial prisoner escapes police custody in OdishaAccording to the police, the accused escaped from police custody when he was staying in a hotel with the cops who brought him from Nagpur for a court hearing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-dj-ganesh-autographed-laptop-birthday-party-2627573-2024-11-04",
      "headline": "Shah Rukh Khan gifts DJ Ganesh autographed laptop with 'special note'Shah Rukh Khan celebrated his 59th birthday with family and fans on November 2. DJ Ganesh received a special gift—an autographed laptop from the actor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/jaipur-dil-luminati-concert-diljit-dosanjh-apologises-to-fans-for-ticket-scam-2627490-2024-11-03",
      "headline": "Diljit Dosanjh apologises to fans affected by ticket frauds at Jaipur concertDiljit Dosanjh is currently on his Dil-Luminati Tour, which took place in Delhi last week and is set to cover cities across India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-polls-joe-biden-slams-donlad-trump-his-supporters-in-pennsylvania-scranton-kamala-harris-2627478-2024-11-03",
      "headline": "Joe Biden slams Trump, his supporters: These are guys you'd like to smack in a**Speaking in Pennsylvania, Joe Biden slammed Donald Trump and his supporters for demanding tax cuts and said that these are the kind of people he \"would like to smack in the a**\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-umpires-real-heroes-in-high-pressure-mumbai-test-2627499-2024-11-03",
      "headline": "Michael Gough, Richard Illingworth real heroes in high-pressure Mumbai TestOn-field umpires Richard Illingworth and Michael Gough had tremendous shifts in the 3rd Test match between India and New Zealand in Mumbai. Gough and Illingworth got a total of 11 DRS decisions right in the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/viral-video-diljit-dosanjh-fans-jaipur-concert-pg-balcony-dil-luminati-india-tour-2627561-2024-11-04",
      "headline": "Viral video: Diljit Dosanjh's fans watch Jaipur concert from PG balcony A group of boys gathered on the balcony of a nearby PG to enjoy Diljit Dosanjh's Jaipur performance, recording videos as they watched the show. The Punjabi singer is currently on the India leg of his Dil-Luminati Tour.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhopal-shopkeeper-attack-man-thrash-saree-seller-calling-uncle-in-front-of-wife-2627465-2024-11-03",
      "headline": "Bhopal man thrashes shopkeeper for calling him 'uncle' in front of wifeThe accused had come to a saree shop with his wife. He got infuriated after the shopkeeper asked him about his preferred price range for sarees and addressed him as 'uncle'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/presidential-election-2024-donald-trump-kamala-harris-democrat-republican-jd-vance-biden-us-polls-2627346-2024-11-03",
      "headline": "Kamala Harris makes closing pitch at Black church, Trump focusses on rural votesUS Election Live Updates: As the 2024 US presidential race hurtles toward the final weekend, Democrat Kamala Harris and Republican Donald Trump find themselves neck-and-neck in a contest that has gripped the nation. With polls showing a razor-thin margin, both candidates have turned their attention to the critical battleground states in the Sun Belt, hoping to secure every last undecided vote.\r\n\r\nKamala Harris made an unexpected appearance on the \"Saturday Night Live\" TV comedy show that added a light-hearted twist to the tense campaign atmosphere. Appearing on the show alongside actor Maya Rudolph, who portrayed her in sketches, Harris and her lookalike exchanged playful takes on her name. Dressed alike in black suits and pearls, the two chanted lines like \"Keep Calm-ala and carry on-ala\", and talked about voters' desire to \"end the drama-la\" in politics. \r\n\r\nMeanwhile, Donald Trump took a more traditional approach to rally support. Speaking to a crowd in Gastonia, North Carolina, he emphasised the struggles his campaign has faced. \"We have overcome every attack, every abuse, and even two assassination attempts,\" Trump told the audience, describing the race as a fierce battle for the country's future. \"And now it all comes down to this,\" he declared. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wriddhiman-saha-to-retire-from-all-forms-of-cricket-after-ongoing-ranji-trophy-2627545-2024-11-04",
      "headline": "Wriddhiman Saha to retire from all forms of cricket after ongoing Ranji TrophyIndia wicketkeeper Wriddhiman Saha said he would retire from all forms of the game after the ongoing edition of the Ranji Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/pakistani-serials-hook-indians-gen-z-popular-vcr-to-netflix-era-mahira-fawad-khan-humsafar-drama-streaming-youtube-2626454-2024-11-03",
      "headline": "Why even Indian Gen Z is binging on Pakistani serialsFor Indians, most things to do with Pakistan have been a love-hate affair. However, Pakistani serials have received enduring love from Indians over the decades and across generations. This is why even the Gen Z in India binge on Pakistani serials along with their Netflix dope."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-woman-stabs-husbands-1nd-wife-over-50-times-on-diwali-in-rewa-arrested-2627441-2024-11-03",
      "headline": "Woman stabs husband's first wife over 50 times following argumentA woman was arrested in Madhya Pradesh's Rewa for stabbing her husband's first wife over 50 times after an argument on Diwali. The victim was critically injured in the attack and was undergoing treatment at a hospital in Prayagraj."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-wazirabad-bihar-sapaul-bus-catches-fire-up-hathras-yamuna-expressway-2627536-2024-11-04",
      "headline": "Bus goes up in flames in UP's Hathras, driver, passengers jump to safetyPolice suspect the fire on the bus, going from Delhi to Bihar, started from the luggage kept on the roof of the bus."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-hathras-boy-stomach-nail-blade-metal-battery-surgery-died-aligarh-2627518-2024-11-04",
      "headline": "Batteries, blades among 56 objects removed from UP boy's stomach, patient dies The boy's family and the medical community are equally baffled as to how these metal items ended up in his stomach. There were no signs of injury to his mouth or throat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-dj-ganesh-autographed-laptop-birthday-party-2627573-2024-11-04",
      "headline": "Shah Rukh Khan gifts DJ Ganesh autographed laptop with 'special note'Shah Rukh Khan celebrated his 59th birthday with family and fans on November 2. DJ Ganesh received a special gift—an autographed laptop from the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/madhavan-and-ajith-kumar-rare-pic-from-diwali-2024-celebrations-2627566-2024-11-04",
      "headline": "Madhavan and Ajith Kumar's rare pic from Diwali 2024 celebrationsMadhavan and his wife Sarita hosted a colourful Diwali party at their home in Dubai. Ajith Kumar attended the bash and a photo of him with Madhavan and others is doing the rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/viral-video-diljit-dosanjh-fans-jaipur-concert-pg-balcony-dil-luminati-india-tour-2627561-2024-11-04",
      "headline": "Viral video: Diljit Dosanjh's fans watch Jaipur concert from PG balcony A group of boys gathered on the balcony of a nearby PG to enjoy Diljit Dosanjh's Jaipur performance, recording videos as they watched the show. The Punjabi singer is currently on the India leg of his Dil-Luminati Tour.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-bhulaiyaa-3-box-office-kartik-aaryan-enters-rs-100-crore-club-sngham-again-ajay-devgn-rohit-shetty-2627551-2024-11-04",
      "headline": "Bhool Bhulaiyaa 3 box office Day 3: Kartik Aaryan's film enters Rs 100-crore club Kartik Aaryan's latest release Bhool Bhulaiyaa 3 achieved a new feat after it entered the Rs 100-crore club in its opening weekend. The film released alongside Singham Again on November 1 in theatres. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/coach-gautam-gambhir-performance-scanner-disaster-sri-lanka-india-2627572-2024-11-04",
      "headline": "Coach Gambhir's performance under scanner after disaster in Sri Lanka and IndiaCoach Gautam Gambhir finds himself under intense scrutiny following India's unprecedented series defeats against Sri Lanka and New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-sanjay-manjrekar-rohit-sharma-gautam-gambhir-mumbai-3-0-whitewash-2627559-2024-11-04",
      "headline": "Sanjay Manjrekar finds major flaw in Rohit Sharma's technique amid Test debacleFormer India cricketer Sanjay Manjrekar has highlighted a major flaw in the batting technique of India captain Rohit Sharma amid his poor Test run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruud-van-nistelrooy-future-manchester-united-incoming-ruben-amorim-2627558-2024-11-04",
      "headline": "Van Nistelrooy yet to discuss his Manchester United future with incoming boss Ruud van Nistelrooy acknowledged that his future at Old Trafford remains undecided under incoming manager Ruben Amorim, as his interim tenure continued with a 1-1 draw against Chelsea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wriddhiman-saha-to-retire-from-all-forms-of-cricket-after-ongoing-ranji-trophy-2627545-2024-11-04",
      "headline": "Wriddhiman Saha to retire from all forms of cricket after ongoing Ranji TrophyIndia wicketkeeper Wriddhiman Saha said he would retire from all forms of the game after the ongoing edition of the Ranji Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-under-coach-gautam-gambhir-so-far-a-mixed-bag-2627492-2024-11-04",
      "headline": "India under coach Gautam Gambhir so far: A mixed bagLet us have a look at how Gautam Gambhir's era has panned out for Indian cricket. India have played two T20I, Test series and one ODI series under his coaching so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-ind-vs-nz-bcci-basit-ali-border-gavaskar-trophy-2627538-2024-11-04",
      "headline": "Virat, Rohit have been given free hand: Basit Ali on BCCI's double standardsFormer Pakistan cricketer Basit Ali has highlighted BCCI's double standards for players as star batters Virat Kohli and Rohit Sharma have been given free hand to play domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-wankhede-test-gautam-gambhir-3-0-whitewash-2627529-2024-11-04",
      "headline": "Rohit Sharma needs to be clear about his role as opener in TestsIndia captain Rohit Sharma, in recent times, has led from the front with the bat as an opener as his role was well-defined. But the Indian captain seems stuck in the Test team as he doesn't know his role yet in the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aslam-inamdar-gaurav-khatri-help-puneri-paltan-to-win-over-u-mumba-2627509-2024-11-03",
      "headline": "Aslam Inamdar, Gaurav Khatri help Puneri Paltan to win over U MumbaPuneri Paltan triumphed over U Mumba 35-28 in the 'Maha Maharashtra Derby,' with skipper Aslam Inamdar and Mohit Goyat's raiding skills sealing the win, supported by Gaurav Khatri's defense as they claimed their fourth victory this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-dhruv-jurel-to-play-second-india-a-match-at-mcg-ahead-of-australia-series-2627502-2024-11-03",
      "headline": "KL Rahul, Jurel to play second India A match at MCG ahead of Australia seriesKL Rahul and Dhruv Jurel are all set to travel to Australia for the India A match against Australia A, starting November 7, PTI reports suggest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-umpires-real-heroes-in-high-pressure-mumbai-test-2627499-2024-11-03",
      "headline": "Michael Gough, Richard Illingworth real heroes in high-pressure Mumbai TestOn-field umpires Richard Illingworth and Michael Gough had tremendous shifts in the 3rd Test match between India and New Zealand in Mumbai. Gough and Illingworth got a total of 11 DRS decisions right in the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-ind-vs-nz-bcci-basit-ali-border-gavaskar-trophy-2627538-2024-11-04",
      "headline": "Virat, Rohit have been given free hand: Basit Ali on BCCI's double standardsFormer Pakistan cricketer Basit Ali has highlighted BCCI's double standards for players as star batters Virat Kohli and Rohit Sharma have been given free hand to play domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-wankhede-test-gautam-gambhir-3-0-whitewash-2627529-2024-11-04",
      "headline": "Rohit Sharma needs to be clear about his role as opener in TestsIndia captain Rohit Sharma, in recent times, has led from the front with the bat as an opener as his role was well-defined. But the Indian captain seems stuck in the Test team as he doesn't know his role yet in the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aslam-inamdar-gaurav-khatri-help-puneri-paltan-to-win-over-u-mumba-2627509-2024-11-03",
      "headline": "Aslam Inamdar, Gaurav Khatri help Puneri Paltan to win over U MumbaPuneri Paltan triumphed over U Mumba 35-28 in the 'Maha Maharashtra Derby,' with skipper Aslam Inamdar and Mohit Goyat's raiding skills sealing the win, supported by Gaurav Khatri's defense as they claimed their fourth victory this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-dhruv-jurel-to-play-second-india-a-match-at-mcg-ahead-of-australia-series-2627502-2024-11-03",
      "headline": "KL Rahul, Jurel to play second India A match at MCG ahead of Australia seriesKL Rahul and Dhruv Jurel are all set to travel to Australia for the India A match against Australia A, starting November 7, PTI reports suggest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-umpires-real-heroes-in-high-pressure-mumbai-test-2627499-2024-11-03",
      "headline": "Michael Gough, Richard Illingworth real heroes in high-pressure Mumbai TestOn-field umpires Richard Illingworth and Michael Gough had tremendous shifts in the 3rd Test match between India and New Zealand in Mumbai. Gough and Illingworth got a total of 11 DRS decisions right in the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-advices-attacking-rohit-sharma-to-trust-his-technique-post-failures-vs-new-zealand-2627476-2024-11-03",
      "headline": "Dinesh Karthik advices 'attacking' Rohit to trust his technique post failuresDinesh Karthik offered his word of advice to Rohit Sharma and asked him to trust his technique alongside his attacking style of play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-odi-series-live-streaming-squads-rizwan-babar-azam-2627474-2024-11-03",
      "headline": "Australia vs Pakistan ODI series Live Streaming: All you need to knowAUS vs PAK: Australia and Pakistan are all set to lock horns in the three-match ODI series. The MCG, Adelaide Oval and Perth Stadium will host the matches on November 4, 8 and 10 respectively."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/fans-slam-virat-kohli-rohit-sharma-after-historic-series-loss-ask-duo-to-retire-2627471-2024-11-03",
      "headline": "Fans slam Virat, Rohit after historic series loss, ask duo to retire'Retire' trend on social media after India lost their first ever Test series against New Zealand at home. A section of fans pinned the blame on Rohit Sharma and Virat Kohli and called them out for their poor returns with the bat in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/one-of-greatest-ever-test-series-victory-michael-vaughan-hails-new-zealand-2627467-2024-11-03",
      "headline": "One of greatest ever Test series victory: Michael Vaughan hails New ZealandMichael Vaughan hailed New Zealand's Test series win over India as \"one of the greatest ever Test series victory\". The Kiwis beat India 3-0 in a three-match Test series at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-poor-form-duleep-trophy-sunil-gavaskar-india-vs-new-zealand-2627464-2024-11-03",
      "headline": "Rohit, Virat going through bad patch, could have played Duleep Trophy: GavaskarSenior India batters Rohit Sharma and Virat Kohli are going through a rough patch, said Sunil Gavaskar after India's historic Test series loss against New Zealand. Gavaskar further hinted that the senior players could have played Duleep Trophy matches before the home Test season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-nz-tom-latham-rejoices-series-win-vs-india-says-will-sink-in-bit-more-when-we-get-home-2627463-2024-11-03",
      "headline": "Tom Latham rejoices series win vs India: Will sink in bit more when we get homeIND vs NZ, 3rd Test: Tom Latham was over the moon after New Zealand beat India 3-0 in the historic Test series on Indian soil. The Black Caps recorded the cleansweep after winning the Mumbai Test by 25 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-writes-heartfelt-parting-message-for-rr-after-not-being-retained-2627461-2024-11-03",
      "headline": "Jos Buttler writes heartfelt parting message for RR after not being retained Jos Buttler penned a heartfelt parting message for Rajasthan Royals and shared it via his Instagram handle. He was not retained by RR during the IPL 2025 retention announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-latham-press-conference-rishabh-pant-india-vs-new-zealand-2627456-2024-11-03",
      "headline": "Didn't believe game was over: Latham admits Pant fear factor in 3rd TestIND vs NZ: Tom Latham said that until Rishabh Pant was batting on Day 3, New Zealand did not believe that the Mumbai Test was over. Pant scored 64 runs before Ajaz Patel dismissed him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-poor-form-duleep-trophy-sunil-gavaskar-india-vs-new-zealand-2627464-2024-11-03",
      "headline": "Rohit, Virat going through bad patch, could have played Duleep Trophy: GavaskarSenior India batters Rohit Sharma and Virat Kohli are going through a rough patch, said Sunil Gavaskar after India's historic Test series loss against New Zealand. Gavaskar further hinted that the senior players could have played Duleep Trophy matches before the home Test season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-nz-tom-latham-rejoices-series-win-vs-india-says-will-sink-in-bit-more-when-we-get-home-2627463-2024-11-03",
      "headline": "Tom Latham rejoices series win vs India: Will sink in bit more when we get homeIND vs NZ, 3rd Test: Tom Latham was over the moon after New Zealand beat India 3-0 in the historic Test series on Indian soil. The Black Caps recorded the cleansweep after winning the Mumbai Test by 25 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jos-buttler-writes-heartfelt-parting-message-for-rr-after-not-being-retained-2627461-2024-11-03",
      "headline": "Jos Buttler writes heartfelt parting message for RR after not being retained Jos Buttler penned a heartfelt parting message for Rajasthan Royals and shared it via his Instagram handle. He was not retained by RR during the IPL 2025 retention announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-latham-press-conference-rishabh-pant-india-vs-new-zealand-2627456-2024-11-03",
      "headline": "Didn't believe game was over: Latham admits Pant fear factor in 3rd TestIND vs NZ: Tom Latham said that until Rishabh Pant was batting on Day 3, New Zealand did not believe that the Mumbai Test was over. Pant scored 64 runs before Ajaz Patel dismissed him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/embrace-the-lows-dejected-rishabh-pant-determined-to-bounce-back-2627448-2024-11-03",
      "headline": "Embrace the lows: Dejected Rishabh Pant determined for India to bounce backRishabh Pant shared a heartfelt Instagram story after India's home Test series loss and wanted to convey that the team would bounce back stronger next time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-whitewash-rohit-sharma-virat-kohli-dropping-2627392-2024-11-03",
      "headline": "Numbers don't lie: Is it time to drop Virat Kohli and Rohit Sharma from Tests? India vs New Zealand: Virat Kohli and Rohit Sharma managed 93 and 91 runs, respectively, in India's embarrassing 0-3 beating. Is it time to move on from the senior pros who don't seem to be doing enough to work on their shortcomings in the red-ball format?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bcci-australia-test-series-senior-players-2627439-2024-11-03",
      "headline": "Rohit, Virat out? BCCI to take a call on senior players after Australia Tests IND vs NZ: India lost to New Zealand 3-0 in the Test series after losing by 25 runs at the Wankhede Stadium. The BCCI could take a call on senior players if India don't qualify for the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-latham-calls-victory-vs-india-new-zealand-crickets-greatest-series-win-2627438-2024-11-03",
      "headline": "Tom Latham calls victory vs India \"New Zealand cricket's greatest series win\"Tom Latham called New Zealand's victory over India their greatest ever series win. New Zealand beat India by 25 runs in the 3rd Test at Wankhede Stadium. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}