{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-ppf-rules-october-1-minots-individuals-with-multiple-accounts-nris-2608769-2024-09-30",
      "headline": "New PPF rules effective October 1: What you need to knowThe new rules aim to streamline the management of PPF accounts, particularly for minors, individuals with multiple accounts, and Non-Resident Indians (NRIs). Here's a closer look at the changes and what they mean for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-changes-from-october-1-what-investors-need-to-know-2608745-2024-09-30",
      "headline": "Stock market changes from October 1: What investors need to knowThe changes include revised transaction charges by stock exchanges, an increase in Securities Transaction Tax (STT), and new taxation rules governing share buybacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1200-points-nifty-tumbles-investors-lose-rs-4-lakh-crore-2608722-2024-09-30",
      "headline": "Bloodbath on D-Street: Sensex slips 1,200 points; investors lose Rs 4 lakh croreThe S&P BSE Sensex fell 1,272.07 points to 84,299.78 at the closing bell, while the NSE Nifty50 settled 361.65 points lower at 25,810.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-below-rs-100-buy-the-dip-avoid-experts-take-2608711-2024-09-30",
      "headline": "Ola Electric shares slip below Rs 100. Buy the dip or avoid? The stock was down 2.59% at Rs 99.55 on the Bombay Stock Exchange (BSE), marking a sharp decline from its record high of Rs 157.53 on August 20, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-oil-corporation-withdraws-rs-22000-crore-rights-issue-2608689-2024-09-30",
      "headline": "Indian Oil Corporation withdraws Rs 22,000 crore rights issueIOC decided to withdraw the rights issue following the Ministry of Petroleum & Natural Gas (MoP&NG) informing that no funds have been allocated for capital support to Oil Marketing Companies (OMCs) in the 2024-25 budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-board-meeting-today-agenda-futures-and-options-new-asset-class-controversy-madhabi-puri-buch-2608637-2024-09-30",
      "headline": "Sebi board meeting today. What's on the agenda?On the agenda are discussions surrounding tighter norms for Futures & Options (F&O) trading, the introduction of a 'New Asset Class,' and the much-anticipated mutual fund lite regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-lists-at-25-percent-premium-over-ipo-price-hold-or-sell-2608629-2024-09-30",
      "headline": " Manba Finance lists at 25% premium over IPO price. Hold or sell? Will Manba Finance shares continue to rise after listing on Dalal Street or is it time to cash in on your gains? Here's all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-allotment-step-by-step-guide-to-check-application-status-latest-gmp-2608615-2024-09-30",
      "headline": "KRN Heat Exchanger IPO allotment: Step-by-Step guide to check statusKRN Heat Exchanger IPO allotment: Investors who participated in the KRN Heat Exchanger IPO can check their allotment status through the websites of the Bombay Stock Exchange and Bigshare Services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1000-points-nifty-falls-it-financial-shares-2608562-2024-09-30",
      "headline": "Sensex crashes over 1,000 points. What's making D-Street bulls nervous?Stock market crash: The Sensex was down 1,018.81 points to 84,553.04 at 11:50 am and the Nifty50 tanked 290.20 points to trade at 25,888.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-settles-legal-dispute-with-bharatpe-ends-all-company-ties-2608545-2024-09-30",
      "headline": "Ashneer Grover settles with BharatPe after ugly legal battle, ends ties to firmThe resolution comes after a tumultuous period marked by allegations of financial misconduct against Ashneer Grover and his family during his tenure at BharatPe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-becomes-worlds-third-richest-person-enters-200-billion-dollar-club-2608535-2024-09-30",
      "headline": "Mark Zuckerberg becomes world's fourth-richest person, enters $200 billion clubMark Zuckerberg's net worth has surged to $200 billion, positioning him as the fourth-richest person globally, right behind Amazon founder Jeff Bezos,, Tesla CEO Elon Musk and LVMH Chairman Bernard Arnault.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-report-deadline-extension-october-7-who-benefits-2608529-2024-09-30",
      "headline": "Income tax audit report deadline extended to October 7. Who benefits? Income tax audit report deadline: Originally set for September 30, 2024, the new deadline is now October 7, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-share-price-listing-at-25-percent-premium-subscribe-or-not-2608518-2024-09-30",
      "headline": "Manba Finance shares list at 25% premium over IPO priceManba Finance IPO listing: Despite making a decent debut on the stock exchanges, the listing fell short of what the GMP had indicated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-slumps-700-points-nifty-falls-below-26000-amid-profit-booking-2608512-2024-09-30",
      "headline": "Sensex slumps 700 points, Nifty falls below 26,000 amid profit bookingThe S&P BSE Sensex was down 685.85 points to 84,886 at 10:14 am, while the NSE Nifty50 fell 191.60 points to 25,987.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-modi-vs-modi-in-godfrey-phillips-family-saga-2608095-2024-09-29",
      "headline": "Modi vs Modi: The succession war brewing at Godfrey PhillipsAs the legal showdown unfolds, it's Modi vs Modi in a gripping battle that tests family bonds and determines the future of Godfrey Phillips India, highlighting ambition, legacy, and loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akriti-chopra-zomato-co-founder-and-chief-people-officer-resigns-2607590-2024-09-27",
      "headline": "Akriti Chopra, Zomato co-founder and Chief People's Officer, resignsIn an email to Zomato CEO Deepinder Goyal, Akriti Chopra announced her decision to resign with immediate effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-lebanon-us-ground-operations-airstrike-2609058-2024-10-01",
      "headline": "Limited ground operations against Hezbollah, Israel told USIndications grew on Monday that Israel was on the verge of sending ground troops into Lebanon, two weeks into an assault on the Iranian-backed Hezbollah militia that culminated in the assassination of its leader, Sayyed Hassan Nasrallah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-speaks-to-benjamin-netanyahu-israel-hezbollah-conflict-2608914-2024-09-30",
      "headline": "Terrorism has no place in our world: PM Modi speaks to NetanyahuPM Modi expressed his concerns about the escalating tensions in West Asia, emphasising that \"terrorism has no place in our world.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-muda-land-scam-siddaramaiahs-wife-bm-parvathi-return-land-sites-2609021-2024-09-30",
      "headline": "Nothing more important than him: Siddaramaiah's wife offers to give up 14 plotsThis came after the Enforcement Directorate (ED) filed a money laundering case against the Karnataka Chief Minister and others over the Mysuru Urban Development Authority (MUDA) land scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zakir-naik-pakistan-islamic-preacher-red-carpet-welcome-islamabad-hate-speech-2609054-2024-09-30",
      "headline": "Watch: Controversial preacher Zakir Naik gets red carpet welcome in PakistanZakir Naik, who is wanted in India on charges of hate speech and inciting communal disharmony, is scheduled to deliver public speeches in Islamabad, Karachi, and Lahore.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ground-report-lebanon-beirut-israel-hezbollah-conflict-rafik-hariri-university-hospital-2608920-2024-09-30",
      "headline": "How Lebanon's largest public hospital is dealing with heavy casualtiesIndia Today TV's Ashraf Wani, the only Indian reporter on the ground in Lebanon, spoke to Dr Jihad Saadeh, Director of the Rafik Hariri University Hospital, about the ongoing Israeli airstrikes and how the healthcare system is dealing with the casualties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/kolkata-rg-kar-financial-fraud-case-sealdah-court-cbi-2608943-2024-09-30",
      "headline": "Kolkata court raps CBI over RG Kar rape case: Shouldn't be so casualThe court denied the CBI's request for extended custody, ordering both accused to remain in judicial custody for four more days. The next hearing is set for October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/earth-mini-moon-can-you-see-it-with-naked-eyes-2608886-2024-09-30",
      "headline": "Earth gets a second moon: Who can see it?This celestial visitor, dubbed a \"mini-moon,\" was first detected on August 7 by Nasa's Asteroid Terrestrial-Impact Last Alert System (ATLAS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-slams-rahul-gandhis-remark-ayodhya-2609045-2024-09-30",
      "headline": "Your family did naach gaana all their lives: Yogi Adityanath attacks Rahul GandhiAdityanath said the 500-year-long wait for the Ram temple was over with the consecration of the idol of Ram Lalla at the magnificent Ram temple in Ayodhya this year. Thousands of Hindus made sacrifices to see a grand temple built in Ayodhya, he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/your-period-lasts-only-two-days-should-you-be-worried-2608725-2024-09-30",
      "headline": "Your period lasts only two days. Should you be worried?The fact that your period lasts just two days makes you anxious? Here's what you might need to know."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-jhansi-bajaj-finance-worker-dies-by-suicide-work-pressure-salary-deduction-2608819-2024-09-30",
      "headline": "Work pressure, threat of salary deduction: Bajaj Finance staff dies by suicide In a suicide note, Tarun Saxena stated that his seniors at work have been putting pressure on him to meet his targets for the last two months and threatening him with salary deductions. However, Bajaj Finance is yet to react to the allegations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-on-hezbollah-sayyed-hassan-nasrallah-lebanon-beirut-benjamin-netanyahu-2607687-2024-09-27",
      "headline": "Israel asks civilians in southern Beirut to evacuate immediatelyIsraeli Airstrikes On Hezbollah Live Updates: Hamas has claimed that one of its leaders was killed in Israel's airstrike in Lebanon on Monday morning. At least four people were killed after Israel struck a building in Beirut on Monday morning, in what was its first attack on a residential area in Beirut's Kola district since the escalation of the conflict with Hezbollah. The Popular Front for the Liberation of Palestine claimed that three of its leaders were killed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-israel-iran-hezbollah-lebanon-war-tyrants-2608994-2024-09-30",
      "headline": "Netanyahu's 'solidarity' message to Iranians: Rule of tyrants will end soonIn a three-minute video clip released by his office, Benjamin Netanyahu emphasised that there is nowhere in Middle East where Israel cannot reach to protect its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trams-kolkata-photos-farewell-october-151-years-west-bengal-government-announced-2608640-2024-09-30",
      "headline": "Once upon a tram... Now, Kolkata bids a teary farewellTrams once plied across most cities in India, but it was Kolkata that held onto its slowness. If the Victoria Memorial defines Kolkata's skyscape, the trams came to become a marker of its cityscape. After clutching onto trams for 151 years, Kolkata is bidding adieu to it. Tracing the tram journey in images."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-news-animal-cruelty-stray-dog-killed-police-arrest-accused-biting-daughter-video-2608909-2024-09-30",
      "headline": "Beaten, burnt, dragged and crushed: Man kills stray dog for biting daughterAccording to the police, the accused first beat the dog with sticks, then threw hot embers at her. Not stopping there, he tied the injured dog to the back of his bike with ropes and dragged her across the streets of Nayapura."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/my-life-back-on-track-dalit-student-on-supreme-courts-help-over-missed-iit-seat-2608848-2024-09-30",
      "headline": "My life back on track: Dalit student on Supreme Court's help over missed IIT seatThe Supreme Court on Monday ordered IIT Dhanbad to grant admission to a Dalit student who lost his seat after missing the deadline to deposit the fee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rg-kar-rape-murder-case-supreme-court-west-bengal-government-cctvs-toilets-hospitals-safety-measure-2608865-2024-09-30",
      "headline": "Supreme Court raps Bengal over 'tardy' progress on security at hospitalsA three-judge bench, led by Chief Justice of India DY Chandrachud, questioned the West Bengal government's delay in fulfilling safety requirements at hospitals in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-tells-pakistani-fan-borders-made-by-politicians-punjabis-love-all-2608497-2024-09-30",
      "headline": "Diljit Dosanjh tells Pakistani fan: Borders made by politicians, Punjabis love allA video of Diljit Dosanjh interacting with a Pakistani fan at his Manchester concert is being shared widely on the internet. In the video, the singer says for him, India and Pakistan are one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-day-4-score-rohit-sharma-yashasvi-r-ashwin-bazball-2608804-2024-09-30",
      "headline": "India play Bazball Pro Max in shortened Kanpur Test in bid to force resultIndia vs Bangladesh, Kanpur Test: India scored 8.22 runs per over, breaking a series of word records in a bid to force a favourable result in the rain-curtailed Test. R Ashwin weaved magic with the new ball as Bangladesh ended the day at 26 for 2, still trailing India's total by 26 runs on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-observation-andhra-pradesh-tirupati-temple-laddu-row-2608641-2024-09-30",
      "headline": "Tirupati laddu: Why go to press without proof on ghee, Supreme Court asks Andhra\"At least, the Gods should be kept away from politics,\" the Supreme Court said, questioning Chief Minister Chandrababu Naidu's public statement on laddus when an investigation had already been ordered.   "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/ahmedabad/story/gujarat-ahmedabad-businessman-duped-rs-13-crore-fake-notes-bearing-anupam-kher-image-2608844-2024-09-30",
      "headline": "Businessman duped of Rs 1.3 crore with fake notes bearing Anupam Kher's imageA gold and silver trader in Ahmedabad was duped of Rs 1.3 crore after fraudsters contacted him to purchase gold and used fake currency notes featuring Bollywood actor Anupam Kher's image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/agra-cop-disguises-herself-as-tourist-to-take-late-night-auto-ride-to-test-women-safety-2608643-2024-09-30",
      "headline": "Disguised as tourist, woman cop takes late-night auto ride in Agra. And then...A woman cop disguised herself as a tourist and took a late-night auto ride to test the emergency services in Agra. Read on to know what happened next. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williamss-rescue-spacecraft-docked-why-she-can-not-return-immediately-2608642-2024-09-30",
      "headline": "Why Sunita Williams cannot return from Space on Dragon immediatelyThe SpaceX Crew-9 mission, carrying NASA astronaut Nick Hague and Roscosmos cosmonaut Alexander Gorbunov, was specifically launched to provide a safe return option for Williams and Wilmore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/video/ground-report-rescue-teams-race-to-find-survivors-after-israeli-strike-in-lebanon-2608766-2024-09-30",
      "headline": "Ground Report: Rescue teams race to find survivors after Israeli strike in LebanonRescue teams, racing against time, are digging through the debris, hoping to find survivors. While the chances of discovering anyone alive seem slim, the search continues with urgency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-high-court-probe-against-nirmala-sitharaman-bjp-leaders-in-electoral-bonds-2608801-2024-09-30",
      "headline": "High Court pauses probe against Nirmala Sitharaman in electoral bonds caseObserving that there was no direct threat against the complainant, the Karnataka High Court on Monday issued a pause on the probe related to the electoral bond extortion case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/mithun-chakraborty-on-dadasaheb-phalke-honour-his-journey-and-more-2609020-2024-09-30",
      "headline": "Mithun Chakraborty on Dadasaheb Phalke honour, his journey and moreIn an exclusive interview with India Today's Consulting Editor Rajdeep Sardesai, veteran Bollywood actor Mithun Chakraborty talked about winning the Dadasaheb Phalke Award, his journey and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-ashton-beverly-hills-cop-star-dies-at-76-2608921-2024-09-30",
      "headline": "John Ashton, Beverly Hills Cop star, dies at 76John Ashton, beloved for his role as Detective John Taggart in the 'Beverly Hills Cop' films, has passed away at the age of 76. The actor's family announced his death, which occurred in Fort Collins, Colorado, on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukesh-khanna-on-ranveer-singh-cannot-play-shaktimaan-2608879-2024-09-30",
      "headline": "Mukesh Khanna on Ranveer Singh: Terrific actor, but can't play ShaktimaanActor Mukesh Khanna recently opened up about playing Shaktimaan and said that he doesn't think Bollywood star Ranveer Singh is the right choice to play the iconic role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/alia-bhatt-kiran-rao-shoot-for-kareena-kapoors-chat-show-2608881-2024-09-30",
      "headline": "Pics: Alia Bhatt, Kiran Rao shoot for Kareena Kapoor's chat showBollywood actor Alia Bhatt and filmmaker Kiran Rao shot for Kareena Kapoor's show What Women Want Season 5 at Mehboob Studios. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nasser-hussain-calls-for-joe-roots-odi-return-with-champions-trophy-looming-2609050-2024-09-30",
      "headline": "Nasser Hussain calls for Joe Root's ODI return with Champions Trophy looming Nasser Hussain has called for Joe Root's return to the ODI side with the upcoming Champions Trophy in Pakistan. He sought more clarity over the roles of Ben Stokes and Root in ODI side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-set-to-return-for-inaugural-international-masters-league-sachin-tendulkar-set-to-return-for-inaugural-international-masters-league-2609042-2024-09-30",
      "headline": "Sachin Tendulkar set to return for inaugural International Masters LeagueThe International Masters League is set to bring cricket legends back on the field, reigniting old rivalries and delighting fans across the globe. With icons like Sachin Tendulkar and Sunil Gavaskar leading the charge, the tournament promises unforgettable action and nostalgia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-mehidy-hasan-miraz-test-t20-kanpur-2609031-2024-09-30",
      "headline": "India came with mindset of winning, played Test like a T20: Mehidy IND vs BAN, 2nd Test: Mehidy Hasan Miraz praised India for playing with a positive mindset, but also said that Bangladesh need to get themselves to safety by batting as long as possible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-retention-policies-is-uncapped-rule-bending-towards-ms-dhoni-2608996-2024-09-30",
      "headline": "IPL 2025 retention policies: Is uncapped player rule bending towards MS Dhoni?The IPL 2025 retention rules are here and one rule which got the fans buzzing was the retention of uncapped players for Rs 4 crore. India Today's Diya Kakkar and Rishabh Beniwal discuss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bangladesh-mehidy-hasan-miraz-kanpur-test-press-conference-funny-2608981-2024-09-30",
      "headline": "Stung by bee, Mehidy Hasan Miraz reveals funny incident in Kanpur TestIND vs BAN: Mehidy Hasan Miraz said that he was stung by a bee while batting. The 26-year-old scored 20 runs in the first innings of the Kanpur Test and built a 54-run partnership with Mominul Haque."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/great-to-see-captain-leading-from-front-morkel-hails-rohits-six-hitting-spree-2608978-2024-09-30",
      "headline": "Great to see captain leading from front: Morkel hails Rohit's six-hitting spreeMorne Morkel hailed Rohit Sharma for his aggressive style of batting right from the start to set the tone for India's 1st innings. Rohit hit six sixes and a boundary as he scored 23 runs from 11 balls. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-press-conference-r-ashwin-ravindra-morne-morkel-2608949-2024-09-30",
      "headline": "Ashwin, Jadeja make you work hard: Morne Morkel hails India spin duo IND vs BAN, 2nd Test: Bowling coach Morne Morkel said that Ravindra Jadeja and Ravi Ashwin can be dangerous customers to deal with and can be tough to score off when bowling in tandem. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/morne-morkel-hails-complete-package-ravindra-jadeja-as-he-completes-300-wickets-2608937-2024-09-30",
      "headline": "Morne Morkel hails 'complete package' Ravindra Jadeja as he completes 300 wicketsMorne Morkel hailed Ravindra Jadeja as a complete package for his all-round skills in the red-ball format. Jadeja completed the 300 Test wickets milestone during India's 2nd Test against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-ravindra-jadeja-kanpur-test-record-2608938-2024-09-30",
      "headline": "Proud of myself: Jadeja basks in joy after 'special' 300 Test wicketsIND vs BAN: Ravindra Jadeja said that that he was proud of himself after he reached the landmark of 300 Test wickets in the Kanpur Test against Bangladesh. Jadeja said that the hard work he has put over the years have paid dividends. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-sarfaraz-khan-dhruv-jurel-yash-dayal-irani-cup-2608917-2024-09-30",
      "headline": "Sarfaraz Khan, Dhruv Jurel, Yash Dayal released for Irani CupSarfaraz Khan, Dhruv Jurel and Yash Dayal have been included in their respective squads for the Irani Cup 2024 clash between Mumbai and Rest of India to be held from Tuesday, October 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-rajeev-shukla-overseas-2608899-2024-09-30",
      "headline": "BCCI considering holding IPL auction overseas: Rajeev Shukla Rajeev Shukla said that the BCCI is keeping the option of hosting the IPL 2025 auction both in India and overseas. On Saturday, the Indian board announced the retention rules ahead of the upcoming season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-press-conference-r-ashwin-ravindra-morne-morkel-2608949-2024-09-30",
      "headline": "Ashwin, Jadeja make you work hard: Morne Morkel hails India spin duo IND vs BAN, 2nd Test: Bowling coach Morne Morkel said that Ravindra Jadeja and Ravi Ashwin can be dangerous customers to deal with and can be tough to score off when bowling in tandem. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/morne-morkel-hails-complete-package-ravindra-jadeja-as-he-completes-300-wickets-2608937-2024-09-30",
      "headline": "Morne Morkel hails 'complete package' Ravindra Jadeja as he completes 300 wicketsMorne Morkel hailed Ravindra Jadeja as a complete package for his all-round skills in the red-ball format. Jadeja completed the 300 Test wickets milestone during India's 2nd Test against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-ravindra-jadeja-kanpur-test-record-2608938-2024-09-30",
      "headline": "Proud of myself: Jadeja basks in joy after 'special' 300 Test wicketsIND vs BAN: Ravindra Jadeja said that that he was proud of himself after he reached the landmark of 300 Test wickets in the Kanpur Test against Bangladesh. Jadeja said that the hard work he has put over the years have paid dividends. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-sarfaraz-khan-dhruv-jurel-yash-dayal-irani-cup-2608917-2024-09-30",
      "headline": "Sarfaraz Khan, Dhruv Jurel, Yash Dayal released for Irani CupSarfaraz Khan, Dhruv Jurel and Yash Dayal have been included in their respective squads for the Irani Cup 2024 clash between Mumbai and Rest of India to be held from Tuesday, October 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-rajeev-shukla-overseas-2608899-2024-09-30",
      "headline": "BCCI considering holding IPL auction overseas: Rajeev Shukla Rajeev Shukla said that the BCCI is keeping the option of hosting the IPL 2025 auction both in India and overseas. On Saturday, the Indian board announced the retention rules ahead of the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahuls-place-was-never-in-danger-parthiv-patel-praises-kanpur-heroics-2608892-2024-09-30",
      "headline": "KL Rahul's place was never in danger: Parthiv Patel praises Kanpur heroicsParthiv Patel praised KL Rahul for his attacking knock on Day 4 of the 2nd Test between India and Bangladesh. He further said that Rahul's place was never in danger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-virat-kohli-we-know-parthiv-patel-kanpur-cameo-2608877-2024-09-30",
      "headline": "We saw the Virat Kohli we know: Parthiv Patel praises India star after Kanpur cameoParthiv Patel praised Virat Kohli's brisk 47 in Kanpur, highlighting the star batter's return to form. Kohli's composed knock, despite narrowly missing a fast fifty, played a crucial role in India's push for a lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kanpur-stadium-green-park-rajeev-shukla-desginated-test-centres-2608863-2024-09-30",
      "headline": "Rajeev Shukla defends Kanpur Test venue, plays down designated centres in IndiaIndia vs Bangladesh: BCCI vice-president Rajeev Shukla defended Kanpur as a Test venue even as questions were raised about the facilities at Green Park after two days of the match were washed out due to a wet outfield. He also played down the idea of having designated Test centres in India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-shan-masood-test-series-changes-2608847-2024-09-30",
      "headline": "Shan Masood rules out major changes, backs players for England Tests PAK vs ENG: Shan Masood said that Pakistan should try and stay optimistic amid their dismal run in Test cricket. After losing to Bangladesh at home, Masood's men will face England in a three-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ousmane-dembele-paris-saint-germain-luis-enrique-fallout-dropped-arsenal-champions-league-2608817-2024-09-30",
      "headline": "Dembele dropped from PSG squad for Arsenal after Enrique fallout: ReportsOusmane Dembele's exclusion from PSG's Champions League clash against Arsenal, following a fallout with coach Luis Enrique, raises questions about his future at the club, as PSG faces one of their biggest tests of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-virat-kohli-records-stats-2608810-2024-09-30",
      "headline": "Stat Pack: Rohit Sharma's India plunder records in Kanpur Test IND vs BAN: India showed intent on Day 4 of the Kanpur Test as they made 285 for nine in 34.4 overs in the first innings. Rohit Sharma, Yashasvi Jaiswal, Virat Kohli and KL Rahul put the opposition batters under pressure by batting aggressively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-day-4-score-rohit-sharma-yashasvi-r-ashwin-bazball-2608804-2024-09-30",
      "headline": "India play Bazball Pro Max in shortened Kanpur Test in bid to force resultIndia vs Bangladesh, Kanpur Test: India scored 8.22 runs per over, breaking a series of word records in a bid to force a favourable result in the rain-curtailed Test. R Ashwin weaved magic with the new ball as Bangladesh ended the day at 26 for 2, still trailing India's total by 26 runs on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/government-will-decide-on-indias-travel-to-pak-for-champions-trophy-bcci-2608798-2024-09-30",
      "headline": "Government will decide on India's travel to Pak for Champions Trophy: BCCIBCCI's stance on India's participation in the 2025 ICC Champions Trophy in Pakistan remains undecided, as any tour will depend on government approval. Speculations grew that the BCCI might push for the tournament to be relocated elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ousmane-dembele-paris-saint-germain-luis-enrique-fallout-dropped-arsenal-champions-league-2608817-2024-09-30",
      "headline": "Dembele dropped from PSG squad for Arsenal after Enrique fallout: ReportsOusmane Dembele's exclusion from PSG's Champions League clash against Arsenal, following a fallout with coach Luis Enrique, raises questions about his future at the club, as PSG faces one of their biggest tests of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-rohit-sharma-virat-kohli-records-stats-2608810-2024-09-30",
      "headline": "Stat Pack: Rohit Sharma's India plunder records in Kanpur Test IND vs BAN: India showed intent on Day 4 of the Kanpur Test as they made 285 for nine in 34.4 overs in the first innings. Rohit Sharma, Yashasvi Jaiswal, Virat Kohli and KL Rahul put the opposition batters under pressure by batting aggressively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-day-4-score-rohit-sharma-yashasvi-r-ashwin-bazball-2608804-2024-09-30",
      "headline": "India play Bazball Pro Max in shortened Kanpur Test in bid to force resultIndia vs Bangladesh, Kanpur Test: India scored 8.22 runs per over, breaking a series of word records in a bid to force a favourable result in the rain-curtailed Test. R Ashwin weaved magic with the new ball as Bangladesh ended the day at 26 for 2, still trailing India's total by 26 runs on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/government-will-decide-on-indias-travel-to-pak-for-champions-trophy-bcci-2608798-2024-09-30",
      "headline": "Government will decide on India's travel to Pak for Champions Trophy: BCCIBCCI's stance on India's participation in the 2025 ICC Champions Trophy in Pakistan remains undecided, as any tour will depend on government approval. Speculations grew that the BCCI might push for the tournament to be relocated elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-mehidy-hasan-miraz-kanpur-test-record-2608788-2024-09-30",
      "headline": "Mehidy Hasan Miraz becomes 4th Bangladesh bowler with 300 wickets IND vs BAN: Mehidy Hasan Miraz had figures of 6.4-0-41-4 in the first innings of the Kanpur Test. He dismissed Akash Deep to join Mashrafe Mortaza, Shakib Al Hasan and Mustafizur Rahman in the elite list of Bangladeshi bowlers with 300 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/did-akashdeep-hit-sixes-with-virat-kohlis-bat-fans-speculate-after-kanpur-cameo-2608778-2024-09-30",
      "headline": "Did Akash Deep hit sixes with Kohli's bat? Fans speculate after Kanpur cameoAkash Deep sent the fans into frenzy with his two sixes on Day 4 of the 2nd Test between India and Bangladesh in Kanpur. The fans speculated if this was the same bat which Kohli gifted him after the 1st Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-second-test-michael-vaughan-bazball-kanpur-2608760-2024-09-30",
      "headline": "IND vs BAN: Michael Vaughan says India playing Bazball, fans troll England legendMichael Vaughan got trolled by fans as he claimed that India was playing Bazball in Kanpur against Bangladesh on Monday, September 30. India batters put the Bangladeshi bowlers to the sword with their aggressive batting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-kl-rahul-shuts-critics-with-quickfire-fifty-on-day-4-in-kanpur-2608754-2024-09-30",
      "headline": "IND vs BAN: KL Rahul shuts critics with quickfire fifty on Day 4 in KanpurKL Rahul shut down his critics with a quickfire fifty on Day 4 of the 2nd Test between India and Bangladesh in Kanpur. This was Rahul's fastest and 15th Test fifty for India in whites. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}