{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-production-low-cost-model-y-shanghai-china-price-war-sale-drop-india-entry-2693558-2025-03-14",
      "headline": "Tesla planning low-cost Model Y in China. Will India get it too?Production will take place at Tesla's Shanghai factory, its largest production hub, and mass production is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-share-price-jump-15-percent-wall-street-investors-welcome-new-ceo-lip-bu-tan-2693524-2025-03-14",
      "headline": "Intel shares jump 15% as investors welcome new CEO Lip-Bu TanIntel shares closed at $23.70, jumping 14.60% as investors placed their bet on the newly announced CEO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/holi-2025-stock-ideas-these-2-shares-piramal-pharma-ptc-india-could-deliver-up-to-16-percent-gains-2693471-2025-03-14",
      "headline": "Holi 2025 stock ideas: These 2 shares could deliver up to 16% gainsFor Holi 2025, Bajaj Broking has recommended two stocks that could see a 16% upside in the next 12 months amid a market correction that has seen Sensex and Nifty on a downward trend.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-indices-slip-as-trump-eu-tariff-threat-sparks-concerns-2693356-2025-03-13",
      "headline": "Wall Street indices slip as Trump's EU tariff threat raises concernsAt the opening bell, the S&P 500 dipped 0.9 points, or 0.09%, at the open to 5,594.45​, the Dow Jones Industrial Average dropped 70.9 points, or 0.17%, at the open to 41,280.05 and Nasdaq Composite fell 49.9 points, or 0.28%, to 17,598.565."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/found-old-share-certificates-at-home-chandigarh-man-here-is-how-you-can-encash-them-2693296-2025-03-13",
      "headline": "Old share certificates in your drawer? Here's how you can encash themThe stock value of old shares can be calculated by multiplying the number of stocks held by the current market price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/check-sbi-latest-lending-rates-for-march-2025-mclr-and-base-rate-2693293-2025-03-13",
      "headline": "Check SBI's latest lending rates for March 2025: MCLR and base rateThe updated MCLR rates will directly influence interest rates on various financial products, including home loans, personal loans, and other credit facilities offered by the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-close-for-holi-march-14-nse-bse-holiday-trading-equity-2693243-2025-03-13",
      "headline": "BSE, NSE holiday: Is stock market closed for Holi on March 14, 2025?Since there is some uncertainty over whether Holi 2025 falls on Friday or Saturday, it is important to check the official list of stock market holidays for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/policies-are-a-nightmare-zerodha-ceo-nithin-kamath-on-why-life-insurance-is-getting-tougher-2693227-2025-03-13",
      "headline": "Policies are a nightmare: Nithin Kamath on why life insurance is getting tougherSince the onset of COVID-19, insurance companies have faced an increase in claims, which has led them to reassess their underwriting policies and tighten their approval process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-bse-nse-dalal-street-auto-it-stocks-drag-markets-2693194-2025-03-13",
      "headline": "Sensex, Nifty erase early gains to end lower; Auto, IT stocks weigh on marketsThe S&P BSE Sensex lost 200.85 points to end at 73,828.91, while the NSE Nifty50 was down by 73.30 points to close at 22,397.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-sensex-nifty-market-correction-make-sense-to-stop-investing-in-mutual-funds-expert-advice-2693167-2025-03-13",
      "headline": "Does it make sense to stop investing in mutual funds amid market correction?Sensex and Nifty are down nearly 15% from their September all-time highs as volatility continues to make its presence felt, and market correction is the flavour being served on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/march-15-advance-tax-deadline-are-you-required-to-pay-2693153-2025-03-13",
      "headline": "March 15 advance tax deadline: Are you required to pay?Salaried individuals, freelancers, and businesses must pay advance tax if their total tax liability (after TDS/TCS) exceeds Rs 10,000 in FY 2024-25."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-agency-confirms-he-dated-kim-sae-ron-denies-his-role-in-her-death-official-statement-2693538-2025-03-14",
      "headline": "Kim Soo-hyun's agency confirms he dated Kim Sae-ron, denies his role in her deathSouth Korean actor Kim Soo-hyun has been facing a lot of backlash for his alleged involvement in pushing his former girlfriend Kim Sae-ron to the brink of death. His agency has now clarified that the two were indeed dating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-confirms-his-kaun-banega-crorepati-return-amid-retirement-rumours-2693526-2025-03-14",
      "headline": "Amitabh Bachchan confirms his KBC return amid retirement rumoursAmid speculation of Shah Rukh Khan or Aishwarya Rai hosting the next season of Kaun Banega Crorepati, Amitabh Bachchan has confirmed his return as the host. The veteran actor expressed gratitude for the love and support he received over the past 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-embraces-holi-spirit-sends-wishes-to-fans-2693516-2025-03-14",
      "headline": "Singer Shawn Mendes embraces Holi spirit in India, sends wishes to fansSinger Shawn Mendes is in India for Holi. The artiste, who recently performed at Lollapalooza India, extended his Holi wishes on Friday with a vibrant selfie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-admits-feeling-unqualified-unequipped-in-self-critical-post-2693506-2025-03-14",
      "headline": "Justin Bieber admits feeling 'unqualified, unequipped' in self-critical postSinger Justin Bieber opened up about his inner struggles and feelings of inadequacy amid ongoing health concerns, admitting to often feeling like a fraud despite his success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arjit-singh-martin-garrix-new-single-angles-for-each-other-full-song-out-2693494-2025-03-14",
      "headline": "Home studio to stardom: Arijit Singh, Martin Garrix unveil new singleSinger Arijit Singh and Dutch DJ and record producer, Martin Garrix, collaborated for a new single, 'Angels For Each Other'. The duo unveiled the song ahead of Holi. Garrix lent his vocals for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-its-okay-to-not-be-okay-costar-seo-yeji-dating-rumours-2693389-2025-03-13",
      "headline": "Kim Soo-hyun's co-star Seo Ye-ji on rumours of dating him: Please stopA recent controversy involving K-drama actor Kim Soo-hyun has dragged his former co-star Seo Ye-ji into the limelight. She addressed rumours linking her to the actor and expressed her frustration on her fancafe, clarifying that she has no personal ties with Kim Soo-hyun."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ratna-pathak-shah-karwa-chauth-comment-roshesh-rajesh-kumar-2693342-2025-03-13",
      "headline": "Liberal women like Ratna Pathak Shah often question sanskriti: Actor Rajesh KumarActor Ratna Pathak Shah's remarks on Karva Chauth in 2022 sparked a debate, leading to a response from her co-star Rajesh Kumar, who defended traditional customs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/siddharth-test-character-promo-cricketer-arjun-look-unveiled-by-r-ashwin-2693260-2025-03-13",
      "headline": "It's do or die for Siddharth as cricketer Arjun in Test promo. WatchCricketer R Ashwin unveiled the character promo of Siddharth as Arjun in Netflix's upcoming project, Test. The film will stream on Netflix from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-kardashian-received-22kg-wedding-invite-from-ambanis-i-dont-know-them-2693247-2025-03-13",
      "headline": "Kim, Khloe Kardashian didn't know Ambanis, yet attended the weddingKim Kardashian and Khloe recall their time in India from last year when they flew down to attend the grand wedding of Anant Ambani and Radhika Merchant. Kim reveals that she didn't know the Ambani family and still decided to participate in the festivities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-making-socially-responsible-songs-we-are-artistes-not-scholars-2693059-2025-03-13",
      "headline": "Honey Singh on making socially responsible songs: We are artistes, not scholarsSinger and rapper Yo Yo Honey Singh, in an interview with India Today Digital, got candid about crafting socially responsible songs for the youth. The singer added how his attempts to craft such songs failed to resonate with the audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-faces-backlash-amid-kim-sae-ron-controversy-loses-brand-deals-report-2693077-2025-03-13",
      "headline": "Kim Soo-hyun faces backlash amid Kim Sae-ron controversy, loses brand deals: ReportKim Soo-hyun is embroiled in controversy over his alleged past relationship with the late Kim Sae-ron. The actor faces backlash, losing followers and brand deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-marvel-art-of-filmmaking-2692923-2025-03-13",
      "headline": "The art of filmmaking with Daredevil Born Again – A technical marvelDaredevil Born Again has captivated audiences with its unique approach to cinematography and storytelling. The show, consisting of seven episodes, is streaming on JioHotstar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/maui-police-chief-accused-of-covering-up-alleged-diddy-odell-beckham-jr-assault-glbs-2692903-2025-03-12",
      "headline": "Maui Police chief accused of covering up alleged Diddy, Odell Beckham Jr. assaultMaui Police Chief John Pelletier is accused of covering up an alleged gang rape involving Sean 'Diddy' Combs, Odell Beckham Jr, and Druski. The lawsuit claims Pelletier attempted to conceal the 2018 assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/prajakta-koli-vrishank-khanal-haldi-unseen-photos-2692862-2025-03-12",
      "headline": "More photos from Prajakta Koli-Vrishank Khanal's Haldi out. Seen yet?Prajakta Koli's friend has shared more photos from her and Vrishank Khanal's Haldi ceremony on Instagram. Check out the pictures here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/durgesh-kumar-no-offers-despite-projects-panchayat-laapataa-ladies-2692859-2025-03-12",
      "headline": "Panchayat actor Durgesh Kumar 'struggling' despite hit projects in 25-year careerActor Durgesh Kumar, known for his roles in Panchayat and Laapataa Ladies, shared that he still struggles to find significant roles despite his success. He said that he still has to chase casting directors for auditions despite recognition in his 25-year-long career in the industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/aditi-sharma-on-separation-estranged-husband-affair-rumours-apollena-costar-2692814-2025-03-12",
      "headline": "TV actor Aditi Sharma responds to allegations of cheating from estranged husbandAditi Sharma refuted her estranged husband Abhineet Kaushik's allegations of infidelity, asserting that their marital issues stem from his insecurities and not her actions. She also claimed that she faced 'serious problems' in the four months of marriage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-so-hyun-kim-sae-ron-relationship-confirmed-by-dispatch-actress-begged-him-debt-notice-gold-medalist-2692787-2025-03-12",
      "headline": "Kim So-hyun's relationship with Kim Sae-ron confirmed by Dispatch. DetailsA news report by Dispatch shed light on the controversy surrounding Kim Soo-hyun and Kim Sae-ron's alleged past relationship and the financial and emotional turmoil Kim Sae-ron faced, which might have led up to her tragic death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-nmixx-makes-a-bold-comeback-with-high-horse-2692646-2025-03-12",
      "headline": "K-pop group NMIXX makes a bold comeback with High HorseK-pop group NMIXX is making a bold comeback with High Horse. And this time, they have a surprise for their desi fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-khloe-kardashian-anant-ambani-radhika-merchant-wedding-the-kardashians-6-2692550-2025-03-12",
      "headline": " Kim, Khloe Kardashian search for their missing diamond at Ambani wedding. WatchIn the latest promo of The Kardashian Season 6, Kardashian sisters, Kim and Khloe, are seen panicking over their missing diamond as they attend the grand Anant Ambani-Radhika Merchant wedding in Mumbai. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/world-knows-epicenter-of-global-terrorism-lies-india-response-pakistan-sponsoring-terrorism-baloch-train-hijack-2693518-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World knows the epicentre of terror: India slams Pakistan over train hijack claimIndia on Friday dismissed Pakistan's terrorism allegations, stating the world knows the true \"epicentre of global terrorism\". This came after Islamabad accused India of backing terror but did not directly link it to the Balochistan train attack that killed 21."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-vadodara-drunk-driver-kills-woman-injures-others-ram-car-screams-another-round-viral-video-cctv-2693530-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drunk driver's rampage caught on camera, kills woman, screams 'another round'The driver, a student from Varanasi, came out of the car that was severely damaged following the accident, and screamed \"another round\" multiple times by throwing his arms in the air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-vladimir-putin-thanks-words-of-gratitude-donald-trump-pm-narendra-modi-grateful-noble-mission-2693514-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin thanks PM Modi, Trump for 'noble mission' to resolve Ukraine conflictRussian President Vladimir Putin, in his first reaction to America's 30-day Ukraine ceasefire proposal, thanked Donald Trump and Indian Prime Minister Narendra Modi for their \"noble mission\" to resolve the conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-budget-2025-bjp-aiadmk-stage-walkout-over-rupee-symbol-tasmac-scam-2693567-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP, AIADMK walkout in Tamil Nadu assembly over rupee symbol move, liquor scamThe BJP and AIADMK walked out of the Tamil Nadu Assembly during the Budget 2025-26 session, protesting the DMK's move to replace the rupee symbol and alleged TASMAC corruption. BJP's Annamalai called the budget an \"eyewash,\" while AIADMK raised Rs 1,000 crore TASMAC scam allegations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mangaluru-man-arrested-for-deliberately-ramming-car-into-neighbors-bike-injuring-passerby-in-attemped-murder-2693528-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Car driver rams, drags neighbour's bike, sends woman flying in MangaluruA retired BSNL employee, was arrested for allegedly ramming his car into his neighbour's motorcycle in Mangaluru amid a longstanding dispute. The impact also injured a pedestrian woman. Police have registered cases for attempted murder and negligent driving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-new-captain-delhi-capitals-2693511-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Axar Patel replaces Rishabh Pant as Delhi Capitals captainIPL 2025: Delhi Capitals have named Axar Patel as their new skipper before the upcoming edition of the tournament. Axar has taken charge after the Capitals failed to make their way through to the play-offs three seasons in a row from 2022 to 2024.  \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/volodymyr-zelenskyy-vladimir-putin-donald-trump-russia-ukraine-war-ceasefire-deal-terms-scared-reactions-2693487-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zelenskyy rips Putin for truce terms: Doesn't want it but scared to tell TrumpUkrainian President Volodymyr Zelenskyy has slammed his Russian counterpart Vladimir Putin for the latter seeking clarifications and conditions on the US's ceasefire proposal, saying he is preparing to reject it but is afraid to tell that to Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-inzamam-ul-haq-boycott-boards-2693505-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stop sending your players: Inzamam asks other boards to boycott IPLInzamam-ul-Haq said that if India don't send their players to take part in foreign T20 leagues, other boards from around the world should take a similar chance and stop sending players to the Indian Premier League (IPL). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/how-the-maratha-deccan-became-the-ulcer-of-aurangzeb-empire-sambhaji-chhava-shivaji-2692362-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How the Maratha Deccan became the ulcer of Aurangzeb's empireAurangzeb inherited one of the largest empires in history — but his tallest ambition of annexing the Deccan region was among the reasons for the ruin of the Mughal empire. His \"obsession\" with the Deccan drained resources, alienated allies, and left him battling the Marathas, who were relentless in their struggle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fire-atlantis-apartment-building-gujarat-rajkot-deaths-trapped-rescue-ops-2693550-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fire breaks out at apartment building in Rajkot, 3 killed, 50 rescuedA massive fire broke out in the Aslantis building on 150 Feet Ring Road during Holi, trapping over 30 people. At least three lost their lives as flames engulfed the sixth floor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-confirms-his-kaun-banega-crorepati-return-amid-retirement-rumours-2693526-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amitabh Bachchan confirms his KBC return amid retirement rumoursAmid speculation of Shah Rukh Khan or Aishwarya Rai hosting the next season of Kaun Banega Crorepati, Amitabh Bachchan has confirmed his return as the host. The veteran actor expressed gratitude for the love and support he received over the past 25 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-new-hairstyle-aalim-hakim-rcb-viral-2693527-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli reveals his new hairstyle ahead of IPL 2025Virat Kohli's new side fade hairstyle, revealed ahead of IPL 2025, has gone viral. With RCB entering the 18th season under new captain Rajat Patidar, fans are hopeful that the symbolic connection to Kohli's jersey number 18 signals long-awaited success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-bengaluru-girlfriend-relationship-2693508-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Gauri Spratt, Aamir Khan's girlfriend from BengaluruAamir Khan introduced his girlfriend, Gauri Spratt, to the media on the eve of his 60th birthday. The two have been dating for over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-production-low-cost-model-y-shanghai-china-price-war-sale-drop-india-entry-2693558-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tesla planning low-cost Model Y in China. Will India get it too?Production will take place at Tesla's Shanghai factory, its largest production hub, and mass production is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-claims-his-workplace-favours-women-and-it-is-triggering-his-misogyny-viral-reddit-post-2693549-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man claims his workplace favours women and it's 'triggering his misogyny'. Viral postIn his post titled \"I feel like my workplace is triggering my misogyny\", the man described himself as a \"fairly feminist person\" up until several experiences that he had faced at his workplace of late. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-budget-2025-26-announces-language-museum-mk-stalin-nep-three-language-policy-2693547-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil Nadu budget announces language museum after replacing rupee symbolTamil Nadu will set up the 'Agaram – Museum of Languages' in Madurai to showcase Tamil's antiquity and evolution. Meanwhile, the state accuses the Centre of withholding education funds and vows to uphold its two-language policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-total-lunar-eclipse-live-moon-turns-blood-red-in-stunning-cosmic-event-2693152-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch LIVE: Total Lunar Eclipse turns the Moon blood redA total lunar eclipse occurs when the Earth's shadow covers the entire Moon, blocking direct sunlight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bhopal/story/bhopal-thar-roxx-celebrate-friend-birthday-arrested-2693456-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bhopal man steals Rs 21 lakh Thar to celebrate friend's birthday, gets caughtA man named Tulsiram was arrested in Bhopal for stealing a Thar Roxx worth ₹21 lakh after its owner's death, attempting to sell it but getting caught before finalising the deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/american-airlines-plane-catches-fire-passengers-evacuate-onto-wings-video-surfaces-2693484-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: American Airlines plane catches fire, passengers evacuate onto wingsAn American Airlines plane caught fire at a Denver airport gate on Thursday, forcing an emergency evacuation. Thick smoke billowed as passengers fled, but firefighters contained the blaze, and no injuries were reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-eyes-more-troops-in-panama-to-fulfil-goal-of-reclaiming-canal-says-report-2693488-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump eyes more troops in Panama to fulfil goal of 'reclaiming' canal: ReportThe White House has ordered the US military to plan a troop increase in Panama to support President Trump's goal of \"reclaiming\" the canal, reportedly to curb China's influence and secure US control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/over-57-of-corporate-men-in-india-face-vitamin-b12-deficiency-survey-2693333-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 57% of corporate men in India face vitamin B12 deficiency: SurveyA recent study found that more than 57% of corporate men suffer from vitamin B12 deficiency, a crucial nutrient for energy and brain function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/total-lunar-eclipse-these-cities-will-witness-moon-turn-blood-red-2692666-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Total lunar eclipse: These cities will witness Moon turn blood redThe total lunar eclipse on March 14 will occur during the full moon phase, which coincides with the culmination of Holi celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/be-happy-review-abhishek-bachchan-remo-dsouza-nora-fatehi-film-prime-video-2693441-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Be Happy review: Abhishek Bachchan dances, but the story tripsReleased-Fri Mar 14, 2025Be Happy promises an emotional father-daughter tale but stumbles with a half-baked story and predictable tropes. Abhishek Bachchan delivers a heartfelt performance, but even he can't save this lacklustre dance-drama. Weak storytelling makes it forgettable in the realm of OTT content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-marrying-at-60-hiring-security-for-gauri-spratt-amid-media-madness-2693573-2025-03-14",
      "headline": "Aamir Khan on marrying at 60, hiring security for Gauri Spratt amid 'media madness' Aamir Khan answered the media's question about marrying Gauri Spratt at 60. The actor also talked about preparing his new partner to deal with the media attention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-hounoured-united-kingdom-government-lifetime-achievement-award-2693570-2025-03-14",
      "headline": "Chiranjeevi to be honoured with Lifetime Achievement Award by UK governmentMegastar Chiranjeevi will be conferred with the Lifetime Achievement Award by the UK government. The event will take place on March 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhanush-kriti-sanon-celebrate-holika-dahan-amid-tere-ishk-mein-delhi-shoot-watch-2693564-2025-03-14",
      "headline": "Dhanush-Kriti Sanon celebrate Holika Dahan amid Tere Ishk Mein Delhi shoot. WatchDhanush and Kriti Sanon are currently shooting for their upcoming film, 'Tere Ishk Mein', in Delhi. On Thursday, the team celebrated the Holka Dahan festivities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooneys-new-hair-colour-for-broadway-role-divides-fans-2693561-2025-03-14",
      "headline": "George Clooney's new hair colour for Broadway role divides fansGeorge Clooney debuted a new hair colour for his Broadway role, sparking mixed reactions. Even his family isn't entirely on board with the change."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-harmanpreet-kaur-mi-vs-gujarat-giants-manjrekar-2693554-2025-03-14",
      "headline": "Harmanpreet showed why she is one of the most dangerous hitters: ManjrekarWPL 2025: Former Indian batter Sanjay Manjrekar heaped praise on Harmanpreet Kaur after her 36-run knock off 12 balls in the Eliminator against Gujarat Giants on Thursday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-hazratullah-zazai-daughter-dies-2693536-2025-03-14",
      "headline": "Afghanistan batter Hazratullah Zazai's daughter diesAfghanistan batter Hazratullah Zazai lost his daughter and his teammate Karim Janat confirmed the news on his social media handle. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-new-hairstyle-aalim-hakim-rcb-viral-2693527-2025-03-14",
      "headline": "Virat Kohli reveals his new hairstyle ahead of IPL 2025Virat Kohli's new side fade hairstyle, revealed ahead of IPL 2025, has gone viral. With RCB entering the 18th season under new captain Rajat Patidar, fans are hopeful that the symbolic connection to Kohli's jersey number 18 signals long-awaited success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-inzamam-ul-haq-boycott-boards-2693505-2025-03-14",
      "headline": "Stop sending your players: Inzamam asks other boards to boycott IPLInzamam-ul-Haq said that if India don't send their players to take part in foreign T20 leagues, other boards from around the world should take a similar chance and stop sending players to the Indian Premier League (IPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-champions-trophy-no-wrong-ricky-ponting-2693519-2025-03-14",
      "headline": "New Zealand didn't do anything wrong in Champions Trophy: Ricky PontingRicky Ponting praised New Zealand's strong Champions Trophy campaign, highlighting their consistency and resilience despite losing to India in the final. He now sees them as a top-four contender in any major ICC event, crediting key players for their standout performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-new-captain-delhi-capitals-2693511-2025-03-14",
      "headline": "Axar Patel replaces Rishabh Pant as Delhi Capitals captainIPL 2025: Delhi Capitals have named Axar Patel as their new skipper before the upcoming edition of the tournament. Axar has taken charge after the Capitals failed to make their way through to the play-offs three seasons in a row from 2022 to 2024.  \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-bruno-fernandes-hat-trick-manchester-united-2693489-2025-03-14",
      "headline": "Bruno Fernandes hat-trick powers Manchester United to quarter-finalsEuropa League: Bruno Fernandes scored a hat-trick as Manchester United beat Real Sociedad 4-1 and advanced to the quarterfinals where they will face Olympique Lyonnais. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-venkatesh-iyer-kkr-price-tag-2693486-2025-03-14",
      "headline": "Venkatesh Iyer not bogged down by huge price tag: Really doesn't matterIPL 2025: Venkatesh Iyer said that he won't be overawed by the massive price tag of Rs 23.75 crore when he steps out to play for the three-time champion Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-2025-mirra-andreeva-youngest-semi-final-2693482-2025-03-14",
      "headline": "Sensational Mirra Andreeva youngest in 20 years to reach semi-finalIndian Wells Masters 2025: Teen sensation Mirra Andreeva defeated Ukraine's Elina Svitolina in straight sets and will now be up against World No.2 Iga Swiatek in the all-important semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-mentor-dwayne-bravo-admits-messaging-gautam-gambhir-2693451-2025-03-14",
      "headline": "KKR mentor Dwayne Bravo admits messaging Gautam Gambhir for tips ahead of IPL 2025Kolkata Knight Riders' new mentor, Dwayne Bravo, has admitted messaging Gautam Gambhir for tips ahead of the upcoming season of the IPL. Gambhir guided KKR to their third IPL title in the previous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ucla-comes-into-its-first-league-tournament-after-winless-big-ten-start-glbs-2693447-2025-03-13",
      "headline": "UCLA comes into its first league tournament after winless Big Ten startUCLA made its debut in the Big Ten this season, leaving behind the manageable travel schedule of the West Coast-based Pac-12 for repeated trips to the Midwest and East Coast, which Cronin griped about."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-bruno-fernandes-hat-trick-manchester-united-2693489-2025-03-14",
      "headline": "Bruno Fernandes hat-trick powers Manchester United to quarter-finalsEuropa League: Bruno Fernandes scored a hat-trick as Manchester United beat Real Sociedad 4-1 and advanced to the quarterfinals where they will face Olympique Lyonnais. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-venkatesh-iyer-kkr-price-tag-2693486-2025-03-14",
      "headline": "Venkatesh Iyer not bogged down by huge price tag: Really doesn't matterIPL 2025: Venkatesh Iyer said that he won't be overawed by the massive price tag of Rs 23.75 crore when he steps out to play for the three-time champion Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-2025-mirra-andreeva-youngest-semi-final-2693482-2025-03-14",
      "headline": "Sensational Mirra Andreeva youngest in 20 years to reach semi-finalIndian Wells Masters 2025: Teen sensation Mirra Andreeva defeated Ukraine's Elina Svitolina in straight sets and will now be up against World No.2 Iga Swiatek in the all-important semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-mentor-dwayne-bravo-admits-messaging-gautam-gambhir-2693451-2025-03-14",
      "headline": "KKR mentor Dwayne Bravo admits messaging Gautam Gambhir for tips ahead of IPL 2025Kolkata Knight Riders' new mentor, Dwayne Bravo, has admitted messaging Gautam Gambhir for tips ahead of the upcoming season of the IPL. Gambhir guided KKR to their third IPL title in the previous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ucla-comes-into-its-first-league-tournament-after-winless-big-ten-start-glbs-2693447-2025-03-13",
      "headline": "UCLA comes into its first league tournament after winless Big Ten startUCLA made its debut in the Big Ten this season, leaving behind the manageable travel schedule of the West Coast-based Pac-12 for repeated trips to the Midwest and East Coast, which Cronin griped about."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-mumbai-indians-vs-gujarat-giants-hayley-matthews-nat-sciver-brunt-2693437-2025-03-13",
      "headline": "WPL: All round Hayley Matthews guides Mumbai to final with 47-run win over GujaratMumbai Indians qualified for the final of the Women's Premier League 2025 by beating Gujarat Giants by 47 runs in the Eliminator fixture at Brabourne Stadium in Mumbai. Hayley Matthews starred with both bat and ball in Mumbai's dominating win."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/acc-tournament-dukes-cooper-flagg-leaves-quarterfinal-game-against-georgia-tech-with-ankle-injury-glbs-2693430-2025-03-13",
      "headline": "ACC tournament: Duke's Cooper Flagg leaves quarterfinal game against Georgia tech with ankle injuryDuke star Cooper Flagg left Thursday's Atlantic Coast Conference Tournament quarterfinal game with a left ankle injury and had to be helped to the locker room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-minnesota-fires-coach-ben-johnson-over-56-71-record-in-four-years-glbs-2693423-2025-03-13",
      "headline": "NCAA Tournament: Minnesota fires coach Ben Johnson over 56-71 record in four yearsMinnesota fired coach Ben Johnson on Thursday after four years of repeatedly rebuilding rosters at his alma mater without coming close to an NCAA Tournament appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-julian-alvarez-penalty-controversy-atletico-real-madrid-2693414-2025-03-13",
      "headline": "Champions League: UEFA to discuss penalty rules after Alvarez VAR controversyChampions League 2025: UEFA, the governing body of European football, has said it will discuss penalty rules the game's lawmakers following controversy over the much-debated double touch rule, which led to Julian Alvarez's penalty being disallowed in Atletico Madrid's defeat to Real Madrid on Wednesday, March 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-and-ayesha-currys-bond-shines-as-they-cheer-on-daughter-riley-at-volleyball-tournament-glbs-2693341-2025-03-13",
      "headline": "NBA: Stephen Curry and Ayesha Curry's bond shines as they cheer on daughter Riley at volleyball tournamentStephen Curry attended her daughter's volleyball match along with her spouse Ayesha Curry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-who-is-on-top-of-the-rookie-ladder-this-season-glbs-2693350-2025-03-13",
      "headline": "NBA: Who is on top of the rookie ladder this season?NBA rookie ladder provides solid contributions, but there is no clear breakout star yet. While some players have shown first-class performances, no single player has dominated the conversation like in previous years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-a-smith-names-his-top-5-nba-duos-glbs-2693354-2025-03-13",
      "headline": "NBA: Stephen A Smith names his top 5 NBA duosESPN Stephen A. Smith names his top 5 NBA duos in an NBA countdown show. His rankings focus on a mix of individual talent, team success, and playoff positions, thus making some surprising choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iml-2025-yuvraj-singh-sixes-india-vs-australia-semifinal-raipur-2693405-2025-03-13",
      "headline": "IML: Yuvraj Singh smashes 7 sixes to hurt Australia in another knockout gameIML 2025, India vs Australia: Yuvraj Singh hit 59 off just 30 balls as India Masters posted 220 against Australia in the semi-final in Raipur on Thursday. Yuvraj hit three sixes in an over, taking fans down memory lane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-and-ayesha-currys-bond-shines-as-they-cheer-on-daughter-riley-at-volleyball-tournament-glbs-2693341-2025-03-13",
      "headline": "NBA: Stephen Curry and Ayesha Curry's bond shines as they cheer on daughter Riley at volleyball tournamentStephen Curry attended her daughter's volleyball match along with her spouse Ayesha Curry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-who-is-on-top-of-the-rookie-ladder-this-season-glbs-2693350-2025-03-13",
      "headline": "NBA: Who is on top of the rookie ladder this season?NBA rookie ladder provides solid contributions, but there is no clear breakout star yet. While some players have shown first-class performances, no single player has dominated the conversation like in previous years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-a-smith-names-his-top-5-nba-duos-glbs-2693354-2025-03-13",
      "headline": "NBA: Stephen A Smith names his top 5 NBA duosESPN Stephen A. Smith names his top 5 NBA duos in an NBA countdown show. His rankings focus on a mix of individual talent, team success, and playoff positions, thus making some surprising choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iml-2025-yuvraj-singh-sixes-india-vs-australia-semifinal-raipur-2693405-2025-03-13",
      "headline": "IML: Yuvraj Singh smashes 7 sixes to hurt Australia in another knockout gameIML 2025, India vs Australia: Yuvraj Singh hit 59 off just 30 balls as India Masters posted 220 against Australia in the semi-final in Raipur on Thursday. Yuvraj hit three sixes in an over, taking fans down memory lane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-patriots-release-center-star-c-david-andrews-glbs-2693388-2025-03-13",
      "headline": "NFL: Patriots release center star David AndrewsDavid Andrews, centre player released by the New England Patriots"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-county-championship-northamptonshire-2025-ipl-england-tour-2693382-2025-03-13",
      "headline": "After IPL 2025, Yuzvendra Chahal to return to County Championship in EnglandAfter his first stint with Punjab Kings in IPL 2025, Yuzvendra Chahal will play for Northamptonshire in County Championship and One-Day Cup. The leg-spinner will begin his second stint with Northants from June 22, the club said on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-cooper-kupp-released-by-the-rams-glbs-2693381-2025-03-13",
      "headline": "NFL: Cooper Kupp released by the RamsCooper Kupp, Super Bowl 56 MVP winner released by the Rams"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-quaterback-aaron-rodgers-released-by-the-jets-glbs-2693375-2025-03-13",
      "headline": "NFL: Quaterback Aaron Rodgers released by the JetsQuaterback Aaron Rodgers was released by the Jets. He's now a first-time free agent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harry-brook-banned-delhi-capitals-dc-2693371-2025-03-13",
      "headline": "Harry Brook becomes first player banned for withdrawing after auctionStar England batter Harry Brook has been banned for two years from the Indian Premier League (IPL) after withdrawing from the upcoming season of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/all-england-open-lakshya-sen-beats-jonathan-christie-reaches-quarters-2693352-2025-03-13",
      "headline": "All England 2025: Lakshya Sen knocks out defending champion to reach quartersAll England Open 2025: Unseeded Lakshya Sen came up with a sensational display in men's singles second-round, knocking out defending champion Jonathan Christie in straight games."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/is-luka-doncic-playing-tonight-nba-injury-updates-for-lakers-vs-bucks-glbs-2693330-2025-03-13",
      "headline": "Is Luka Doncic Playing tonight? NBA injury updates for Lakers vs BucksLuka Doncic listed as questionable for the Lakers and Bucks due to an ankle injury "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-2025-mark-wood-injury-update-four-months-out-2693329-2025-03-13",
      "headline": "Fast bowler Mark Wood likely to miss India Test series, out of action for 4 monthsFast bowler Mark Wood is likely to miss the five-Test series against India at home in June-August. Wood underwent surgery after a long-standing knee injury flared up during the Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/west-virginia-coach-bans-players-from-dancing-on-tiktok-glbs-2693325-2025-03-13",
      "headline": "West Virginia coach bans players from dancing on TikTokWest Virginia football coach Rich Rodriguez banned players from dancing on TikTok, emphasizing discipline and team image. While allowing the app, he prioritizes football over social media engagement for his athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-starc-agrees-india-had-advantage-in-dubai-2693307-2025-03-13",
      "headline": "Mitchell Starc agrees India had clear advantage in Dubai during Champions TrophyAustralia fast bowler Mitchell Starc agrees that India had a clear advantage in Dubai during the ICC Champions Trophy 2025. India played all of their matches at the same venue after refusing to travel to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-india-vs-england-test-series-navjot-singh-sidhu-2693309-2025-03-13",
      "headline": "Play Varun Chakravarthy in England Test series: Navjot Singh SidhuNavjot Singh Sidhu backed Varun Chakravarthy to exploit England's spin weakness in the upcoming Test series, urging India's head coach Gautam Gambhir to make strategic selections despite the IPL season."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}