{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8-years-of-gst-top-5-achievements-you-should-know-2748325-2025-06-30",
      "headline": "8 years of GST: Top 5 achievements you should knowSince its launch, GST has strengthened India's revenue and expanded the taxpayer base, with collections reaching a record Rs 22.08 lakh crore in 2024–25, as per PIB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-submits-ceo-shortlist-to-rbi-after-leadership-exits-report-2748281-2025-06-30",
      "headline": "IndusInd Bank submits CEO shortlist to RBI after leadership exits: ReportThe candidates include Rajiv Anand, Rahul Shukla, and Anup Saha — all experienced financial sector leaders. The move comes after the abrupt exits of CEO Sumant Kathpalia and deputy Arun Khurana in April, following a $230 million hit from years of misaccounting in internal derivative trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rural-india-holds-steady-as-urban-consumption-slows-finds-equirus-securities-2748257-2025-06-30",
      "headline": "Rural India holds steady as urban consumption slows, finds Equirus SecuritiesThe mood remains subdued overall, but analysts note an undercurrent of recovery in rural pockets, led by fast-moving consumer goods (FMCG), electric mobility and segments of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-without-a-ca-5-common-mistakes-that-you-must-avoid-2748218-2025-06-30",
      "headline": "Filing ITR without a CA? 5 common mistakes that you must avoidMany people mix up the financial year and assessment year. For income earned in 2024-25, the assessment year will be 2025-26. Pick this carefully or your return will not be valid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-down-slightly-jio-financial-rises-1-2748161-2025-06-30",
      "headline": "Sensex falls over 100 points, Nifty down slightly; Jio Financial rises 1%The BSE Sensex was trading 56.62 points lower at 84,002.28 around 9:24 am. It had fallen over 100 points right after opening. The NSE Nifty50 also fell and was trading 10.55 points lower at 25,627.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gautam-adani-celebrates-three-birthdays-every-year-2748051-2025-06-29",
      "headline": "Why Gautam Adani celebrates three birthdays every yearBaffling as it may seem, apart from the day he was born, Adani celebrates two other dates. They are dates when he actually snatched life from the jaws of death. These were times when he repeatedly stared down the abyss and emerged unscathed, yet profoundly transformed. Here then is the story of Adani's three birthdays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-silambarasan-49th-film-sequel-to-dhanush-vada-chennai-vetri-maaran-clarifies-2748337-2025-06-30",
      "headline": "Is Silambarasan's 49th film a sequel to Dhanush's Vada Chennai? Vetri Maaran clarifiesSilambarasan's upcoming film 'STR49' is confirmed to be a distinct project set in the same universe as 'Vada Chennai', but not its sequel, according to director Vetri Maaran. He also opened up about his close bond with actor Dhanush. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exclusive-ateez-calls-golden-hour-era-bold-and-playful-message-to-indian-atinys-2748200-2025-06-30",
      "headline": "Exclusive: ATEEZ calls GOLDEN HOUR era 'bold and playful'; message to Indian ATINYsK-pop sensation ATEEZ continues to break new ground with their historic Billboard entry and evolving artistry. Their latest album, GOLDEN HOUR : Part.3, showcases maturity and creativity, while they acknowledge the love they receive from Indian ATINYs. Read the full exclusive interview with ATEEZ. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/charlize-therone-slams-jeff-bezos-lauren-sanchez-wedding-2748247-2025-06-30",
      "headline": "Charlize Theron roasts Bezos-Sanchez's lavish wedding: They suck and we're coolActor Charlize Theron slammed the guests who attended Jeff Bezos and Lauren Sanchez's wedding. The wedding is estimated to have cost $50 million."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-batman-2-makers-finally-finish-script-2748316-2025-06-30",
      "headline": "The Batman 2 makers finally finish script, share update on Robert Pattinson's filmThree years after 'The Batman' premiered in cinemas, director Matt Reeves and screenwriter Mattson Tomlin have now officially completed the script. The sequel is one step closer to moving into production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anti-ageing-skin-glow-medicines-found-at-shefali-jariwalas-house-police-2748292-2025-06-30",
      "headline": "Shefali Jariwala's death probe: Anti-ageing, skin glow medicines, fasting in focusShefali Jariwala was found dead at her residence on June 27. The police officials collected anti-ageing and skin-glow medicines from her place during their investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-teaser-prithviraj-sukumaran-ibrahim-ali-khan-fight-terrorism-in-kashmir-2748269-2025-06-30",
      "headline": "Sarzameen teaser: Ibrahim plays terrorist, Prithviraj a soldier in high-stakes dramaPrithviraj Sukumaran, Kajol and Ibrahim Ali Khan's upcoming film 'Sarzameen' is officially announced by JioHoistar. The movie will stream from July 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-label-hybe-is-coming-to-india-new-subsidiary-to-open-in-second-half-of-2025-2748263-2025-06-30",
      "headline": "BTS' label HYBE is coming to India: New subsidiary to open in second half of 2025HYBE is setting up a subsidiary in India by 2025 to tap into the country's vibrant music market and digitally savvy youth. This strategic expansion seeks to blend K-pop's global success formula with India's rich cultural diversity, potentially transforming the local music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukones-old-interview-demanding-work-life-balance-surfaces-amid-sandeep-reddy-vanga-row-2748239-2025-06-30",
      "headline": "Deepika Padukone's old interview demanding work-life balance surfaces amid Vanga rowActor Deepika Padukone had been advocating for work-life balance long before she walked out of filmmaker Sandeep Reddy Vanga's upcoming film 'Spirit.' An old interview of the actor has resurfaced, in which she spoke about the importance of fixed working hours for a film's cast and crew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-celebrates-25-years-in-industry-with-refugee-posters-2748249-2025-06-30",
      "headline": "Forever to go: Kareena Kapoor celebrates 25 years in industry with Refugee postersKareena Kapoor Khan celebrated 25 years in Bollywood, marking a journey of versatility and enduring stardom. She shared nostalgic posters from her debut film 'Refugee' as fans and celebrities joined in the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vishnu-manchu-admits-poor-vfx-kannappa-reacts-to-criticism-2748188-2025-06-30",
      "headline": "Vishnu Manchu admits to poor VFX in Kannappa, reacts to criticismActor Vishnu Manchu recently addressed the criticism over his latest release 'Kannappa'. He talked about the production challenges, and shared that he had to remove a few scenes due to poor VFX."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-25-years-refugee-premiere-with-kareena-kapoor-locked-in-projector-room-2748231-2025-06-30",
      "headline": "When Abhishek, Kareena were locked in projector room during Refugee premiereAs 'Refugee' completes 25 years, Abhishek Bachchan reflects on his debut and shares a memorable incident where he and Kareena Kapoor had to hide in a theatre projector room due to excited fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-amar-upadhyay-kyunki-saas-bhi-bahu-thi-2-premiere-postponed-2748230-2025-06-30",
      "headline": "Smriti Irani, Amar Upadhyay's Kyunki Saas Bhi...2 premiere postponed. Here's whyActors Smriti Irani and Amar Upadhyay's 'Kyunki Saas Bhi Kabhi Bahu Thi 2' premiere has been postponed. Upadhayay confirmed the development and shared the reason behind the delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-husband-parag-tyagi-family-immerse-actors-ashes-in-sea-2748222-2025-06-30",
      "headline": "Heartbroken Parag Tyagi immerses Shefali Jariwala's ashes into sea, her family joinsAn emotional Parag Tyagi and Shefali Jariwala's family were seen performing the last rites by immersing her ashes. The actor died on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-responds-to-trolls-reveals-why-he-stays-silent-on-family-rumours-2748201-2025-06-30",
      "headline": "Negativity sells: Abhishek Bachchan explains his silence over family rumoursAbhishek Bachchan has spoken out against online trolls for the first time, shedding light on his decision to remain silent about rumours involving his family. He emphasised the importance of peace and privacy over engaging with baseless speculation. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-backs-varun-dhawan-stand-shefali-jariwala-death-coverage-2748169-2025-06-30",
      "headline": "Janhvi Kapoor backs Varun Dhawan's stand on Shefali Jariwala's death coverageActor Janhvi Kapoor backed Varun Dhawan's plea to respect privacy during grief. The latter had called out the media over insensitive coverage of actor Shefali Jariwala's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-box-office-collection-day-3-detailed-report-vishnu-manchu-film-wraps-up-a-decent-1st-weekend-2748191-2025-06-30",
      "headline": "Kannappa box office Day 3: Vishnu Manchu's film wraps up a decent 1st weekend'Kannappa' finished its opening weekend at the box office on a decent note, collecting more than all the fresh releases in India. The film is now looking at passing the crucial Monday test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-box-office-day-3-brad-pitt-film-races-to-144-million-worldwide-2748184-2025-06-30",
      "headline": "F1 box office Day 3: Brad Pitt's racing drama off to a roaring $144 million startBrad Pitt's 'F1' is racing into the hearts of audiences. Directed by Joseph Kosinski, the film is climbing the box office charts, earning impressive numbers along the way.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-controversy-over-birth-scene-all-you-need-to-know-about-netflix-show-criticism-2748175-2025-06-30",
      "headline": "Squid Game Season 3 is receiving backlash over a birth scene. Here's all about itThe latest season of Netflix's 'Squid Game' is facing criticism for Kim Jun Hee's childbirth scene. The childbirth happens during a challenge in the series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-collection-day-10-detailed-report-aamir-khan-film-beats-ghajini-creates-new-record-in-2nd-weekend-2748172-2025-06-30",
      "headline": "Sitaare Zameen Par box office Day 10: Aamir's film beats Ghajini, creates new recordAamir Khan's 'Sitaare Zameen Par' recorded a fabulous second weekend at the box office, and collected around Rs 122 crore in ten days. It also surpassed the lifetime earnings of Khan's sixth highest-grossing film, 'Ghajini'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-pakistan-bangladesh-meeting-regional-seeks-replace-saarc-multilateral-organisation-india-south-asia-afghanistan-kunming-2748301-2025-06-30",
      "headline": "China, Pakistan, Bangladesh working to replace Saarc with new regional blocChina, Pakistan and Bangladesh have formed a nexus and are trying to create a regional grouping to replace Saarc, which includes India as a member. The three plan to get other South Asian nations to become part of the grouping. Saarc activities came to a halt after India boycotted the summit in Pakistan over the Uri terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-case-accused-admitted-to-law-college-despite-low-rank-alleges-bjp-2748225-2025-06-30",
      "headline": "Who gave him seat? BJP flags rape-accused student's low rank, targets TrinamoolMalviya alleged that Zaib Ahmed was admitted to South Calcutta Law College despite securing a \"dismal\" rank of 2634 in the Calcutta University Law Entrance Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anti-ageing-skin-glow-medicines-found-at-shefali-jariwalas-house-police-2748292-2025-06-30",
      "headline": "Shefali Jariwala's death probe: Anti-ageing, skin glow medicines, fasting in focusShefali Jariwala was found dead at her residence on June 27. The police officials collected anti-ageing and skin-glow medicines from her place during their investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/how-can-india-build-ai-like-chatgpt-by-doing-what-mark-zuckerberg-is-doing-2748270-2025-06-30",
      "headline": "How can India build AI like ChatGPT? By doing what Mark Zuckerberg is doingThere is an urgency in the AI space and Mark Zuckerberg knows it. In recent months, he has embarked on a mission - build an AI system that is the best in the world. India can learn from him.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/animals-are-wealth-of-life-pashu-inappropriate-president-droupadi-murmu-2748332-2025-06-30",
      "headline": "'Pashu' is inappropriate, animals are 'jeevan dhan': President Droupadi MurmuPresident Droupadi Murmu on Monday said she feels that using the word 'pashu' for animals was 'inappropriate' and referred to them as 'jeevan dhan' or wealth of life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/10-killed-after-a-fire-broke-out-following-a-reactor-explosion-at-chemical-factory-in-telangana-2748291-2025-06-30",
      "headline": "8 dead, several injured after reactor explodes at Telangana chemical factoryAn explosion at Telangana chemical factory blast killed at least 8 workers and injured several others, prompting a major rescue effort and orders for relief from Chief Minister Revanth Reddy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/maharashtra-tourist-pahalgam-tourist-attacked-maharashtra-bail-sick-mentality-anantnag-court-bail-2748327-2025-06-30",
      "headline": "'Treated so shockingly': 70-year-old tourist gagged, raped in Pahalgam hotelA 70-year-old woman tourist was raped in Jammu and Kashmir's Pahalgam as a reflection of moral decay that threatens the region's cultural integrity and reputation as a tourist destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zohran-mamdani-eating-with-hands-viral-video-us-politician-go-back-to-third-world-remark-2748328-2025-06-30",
      "headline": "Go back to Third World: US politician on Zohran Mamdani's eating with hands videoA video of Zohran Mamdani eating with his hands during an interview has sparked debate online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-murdered-by-live-in-partner-body-dumped-20-km-away-accused-nabbed-within-20-hours-2748251-2025-06-30",
      "headline": "Live-in partner killed Bengaluru woman, took body on bike to dump in garbage truckThe Bengaluru police reportedly solved a murder case where a woman's body was found in a garbage truck. According to the police, the woman's live-in partner killed her and then dumped her body in a garbage truck to get rid of the evidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-5-storey-building-collapses-in-shimla-amid-heavy-rain-2748209-2025-06-30",
      "headline": "Video: 5-storey building collapses in Shimla amid heavy rainHeavy rains have battered Shimla, leading to the collapse of a five-storey building in the Bhattakufar area. Fortunately, no casualties were reported as the structure had been vacated in advance by the administration due to safety concerns. Several nearby buildings also remain at risk amid ongoing four-lane highway construction in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-constitution-assembly-did-not-include-term-secular-rss-preamble-indira-gandhi-emergency-2747289-2025-06-30",
      "headline": "Why framers of India's Constitution didn't include secular in itAs the 50th anniversary of the Emergency rekindles debate over secularism, it is worth recalling that the framers of the Constitution debated and decided against the inclusion of the term 'secular' in it. Here's why the Constituent Assembly decided not to use 'secular' to define the nature of the State."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-returns-to-hera-pheri-3-calls-akshay-kumar-his-longtime-friend-2748153-2025-06-30",
      "headline": "Paresh Rawal returns to Hera Pheri 3, calls Akshay Kumar his longtime friendActor Paresh Rawal confirmed that he was back to lead 'Hera Pheri 3' with Akshay Kumar and Suniel Shetty. The actor's announcement came over a month after his abrupt exit from the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/massive-protest-in-dhaka-after-hindu-woman-cumilla-raped-by-bangladesh-nationalist-party-politician-2748118-2025-06-30",
      "headline": "Massive protest in Bangladesh after Hindu woman raped by local politicianA video of one of the protests showed students clapping and shouting slogans, demanding 'direct action' against the perpetrators. So far, the police have arrested five individuals, including the main accused, Fazor Ali-a member of the Khaleda Zia-led Bangladesh Nationalist Party (BNP)-in connection with the rape of a 21-year-old woman in Cumilla."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/newlywed-tn-tiruppur-woman-dies-by-suicide-over-alleged-dowry-harassment-husband-inlaws-in-custody-2748168-2025-06-30",
      "headline": "Newlywed bride dies by suicide over dowry torture, had given Volvo car, 800 gm goldA 27-year-old newlywed woman died by suicide allegedly due to dowry-related harassment by her husband and in-laws. Police found her body in a parked car after she consumed pesticide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-dk-shivakumar-hold-hands-show-unity-amid-congress-leadership-rumours-2748280-2025-06-30",
      "headline": "On good terms, no matter what: Siddaramaiah, DK Shivakumar put up united frontAmid mounting speculation about a possible leadership change in Karnataka, Chief Minister Siddaramaiah reassured the public that he and Deputy Chief Minister DK Shivakumar remain on good terms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-controversy-over-birth-scene-all-you-need-to-know-about-netflix-show-criticism-2748175-2025-06-30",
      "headline": "Squid Game Season 3 is receiving backlash over a birth scene. Here's all about itThe latest season of Netflix's 'Squid Game' is facing criticism for Kim Jun Hee's childbirth scene. The childbirth happens during a challenge in the series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/quiet-revolution-94-crore-indians-social-security-schemes-ilo-lakhpati-didi-jeevan-beema-modi-ayushman-bharat-awas-yojana-2748217-2025-06-30",
      "headline": "How a quiet revolution has given a safety net to 94 crore IndiansFrom 19% in 2015 to 64% in 2025, India has quietly expanded its social security net to include 94.3 crore people, second only to China in absolute numbers. This silent revolution has been acknowledged by the International Labour Organisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-new-york-mayor-jews-support-israel-palestine-intifada-democratic-2748299-2025-06-30",
      "headline": "Why US's most Jewish city picked vocal Israel critic Zohran Mamdani for MayorZohran Mamdani's rise as the Democratic nominee for New York mayor, despite his outspoken criticism of Israel, marks a dramatic shift in Democratic politics, especially among younger Jewish voters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/enemies-will-be-avenged-irans-top-cleric-issues-fatwa-against-trump-netanyahu-2748134-2025-06-30",
      "headline": "Enemies of God: Iran's top cleric issues fatwa against Trump, NetanyahuShirazi called on Muslims across the world to unite and strongly oppose these enemies, American and Israeli leaders, and their actions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-travel-improves-memory-2748223-2025-06-30",
      "headline": "Turns out, your brain loves a good vacationExperts say that travelling frequently can help improve memory retention and lower the risk of cognitive decline. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-monsoon-weather-updates-himachal-on-red-alert-schools-shut-as-landslides-and-rain-cripple-daily-life-2748260-2025-06-30",
      "headline": "Himachal on red alert; schools shut as landslides and rain cripple daily lifeThree deaths have been reported in the last 24 hours in Himachal due to heavy rains, taking the total toll to 20 since the monsoons began. The weather department has said heavy to very heavy rains are likely to occur at a few places in the districts of Kangra, Mandi, Solan and Sirmaur till Monday evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/sleeping-naked-is-more-than-a-trend-heres-what-science-says-2748289-2025-06-30",
      "headline": "What happens to your body when you sleep naked every night?Body positivity, better sleep, and boosted intimacy. Stripping down for bed may be the simplest health hack you're ignoring-and science agrees.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-luke-williams-southern-brave-hundred-women-coach-2748326-2025-06-30",
      "headline": "RCB head coach joins Southern Brave for Hundred Women's 2025Southern Brave have roped in Luke Williams as their head coach and Marcus Trescothick as their batting coach for the 2025 edition of the Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmood-red-ball-head-coach-2748265-2025-06-30",
      "headline": "Pakistan appoint former all-rounder as 'acting coach' for Test teamPakistan have appointed former all-rounder Azhar Mahmood as their acting red-ball head coach. Pakistan finished at the bottom in the 2023-25 edition of the World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-prepares-england-test-pietersen-guidance-dual-spin-2748221-2025-06-30",
      "headline": "Armed with English wisdom, Kuldeep makes bold promise ahead of Test comebackEngland vs India: Spinner Kuldeep Yadav recalled his experience of learning from Kevin Pietersen about the nuances of bowling in England. The wrist-spinner might make his way into the XI for the second Test, starting July 02 in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-india-birmingham-record-2748226-2025-06-30",
      "headline": "Can India make a comeback in Birmingham?  Here's what history suggestsENG vs IND: Shubman Gill's India are looking to make a comeback in the five-match Test series after losing the opening Test at Headingley in Leeds by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-1-schedule-streaming-carlos-alcaraz-aryna-sabalenka-2748160-2025-06-30",
      "headline": "Day 1, Schedule and Live Streaming: Alcaraz, Sabalenka, Paolini in actionWimbledon 2025 Day 1: Carlos Alcaraz, Aryna Sabalenka and Jasmine Paolini are amongst the top names to be in action in their respective first round matches of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-1-schedule-streaming-carlos-alcaraz-aryna-sabalenka-2748160-2025-06-30",
      "headline": "Day 1, Schedule and Live Streaming: Alcaraz, Sabalenka, Paolini in actionWimbledon 2025 Day 1: Carlos Alcaraz, Aryna Sabalenka and Jasmine Paolini are amongst the top names to be in action in their respective first round matches of the grass court major. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}