{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/if-we-look-closely-zoho-founder-and-ceo-sridhar-vembu-on-finding-rural-talent-2717362-2025-04-30",
      "headline": "'If we look closely...': Zoho's Sridhar Vembu on finding rural talentZoho's CEO, Sridhar Vembu, believes that India's path to development must include creating jobs and opportunities in smaller towns and villages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-group-stocks-trading-price-target-q4-results-brokerage-reports-2717352-2025-04-30",
      "headline": "5 Adani stocks get new targets after Q4 results: What should investors do?With Gautam Adani-led Adani Enterprises Ltd set to announce its earnings report soon, stock brokerages have already reviewed the performance of five listed companies from the group and shared fresh price targets and advice for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/varun-beverages-q4-results-key-things-to-expect-from-pepsico-bottler-2717316-2025-04-30",
      "headline": "Varun Beverages Q4 net profit at Rs 726 crore; firm announces interim dividendThe company posted a net profit of Rs 726 crore, up 35% year-on-year, driven by higher volumes and peak-season demand. Revenue for the quarter came in at Rs 5,680 crore, a 29% jump YoY, slightly ahead of most analyst estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vivad-se-vishwas-20-deadline-ends-today-last-call-to-settle-income-tax-disputes-2717298-2025-04-30",
      "headline": "Vivad Se Vishwas 2.0 deadline ends today: Last call to settle income tax disputesVivad Se Vishwas 2.0 is a dispute resolution scheme run by the Income Tax Department. It gives taxpayers a chance to settle ongoing tax-related cases by avoiding the prolonged litigation process and simply paying the disputed tax amount."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/akshaya-tritiya-2025-gold-price-today-should-you-buy-or-avoid-yellow-metal-rate-2717296-2025-04-30",
      "headline": "Akshaya Tritiya 2025: Is falling gold price an opportunity to buy more?Akshaya Tritiya is considered a good day to buy gold. But with gold prices now close to all-time highs, near Rs 96,000 per 10 grams, many buyers are thinking twice before making big purchases this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-day-3-latest-subscription-gmp-struggling-should-you-subscribe-2717291-2025-04-30",
      "headline": "Ather Energy IPO ends today: Should you subscribe or avoid?Ather Energy is struggling to generate investor interest, with sluggish IPO subscription levels and a muted grey market premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-shares-tank-over-5-after-q4-results-what-should-investors-do-2717259-2025-04-30",
      "headline": "Bajaj Finance shares tank over 5% after Q4 results. Buy, hold or sell?The stock reacted to a set of numbers that, while solid on paper, failed to match elevated market expectations. In the fourth quarter of FY25, Bajaj Finance reported a 19% year-on-year jump in net profit to Rs 4,546 crore, driven by a 22% rise in net interest income to Rs 9,807 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bajaj-finserv-share-price-falls-6-percent-today-after-q4-results-2717237-2025-04-30",
      "headline": "Explained: Why Bajaj Finserv shares tumbled 6% after Q4 resultsIn its Q4FY25 earnings, Bajaj Finserv reported a 14% year-on-year (YoY) rise in both net profit and revenue, posting Rs 2,417 crore in profit and Rs 36,595 crore in revenue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-falls-further-as-easing-trade-tensions-dampen-appeal-2717229-2025-04-30",
      "headline": "Gold price falls further as easing trade tensions dampen appealSpot gold was down 0.2% at $3,308.32 an ounce, as of 0242 GMT. US gold futures GCcv1 lost 0.5% to $3,317.50. The dollar edged 0.1% higher against a basket of currencies, making bullion more expensive for overseas buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-falls-over-3-after-ceo-resigns-2717226-2025-04-30",
      "headline": "IndusInd Bank share price falls nearly 3% after CEO resignsSumant Kathpalia's resignation marks a dramatic turn in the bank's ongoing troubles related to internal derivatives trades that were improperly accounted for, raising questions about internal oversight and risk management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-198-points-lower-nifty-below-24300-indusind-bank-falls-2-percent-2717225-2025-04-30",
      "headline": "Sensex, Nifty recover early losses as FII inflows lift market sentimentThe S&P BSE Sensex added 83.58 points to 80,371.96, while the NSE Nifty50 gained 18.70 points to 24,354.65 as of 9:45 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-stock-market-today-nse-bse-trading-what-to-expect-2717208-2025-04-30",
      "headline": "Sensex, Nifty opening: Stock markets to rise or fall today?Gift Nifty futures were trading at 24,323.5 at 8:10 am. This suggests that Nifty50 will likely start the day close to Tuesday's closing level of 24,335.95. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/mouni-roy-on-botched-surgery-claims-people-are-writing-rubbish-vicious-things-2717332-2025-04-30",
      "headline": "Mouni Roy on botched surgery claims: People are writing rubbish, vicious thingsActor Mouni Roy recently responded to trolls who accused her of having cosmetic surgery, saying she feels sorry for them.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/content-creator-misha-agarwal-suicide-sister-she-felt-worthless-when-followers-fell-2717324-2025-04-30",
      "headline": "Influencer Misha Agarwal's sister on her suicide: She felt worthless when followers fellContent creator Misha Agarwal died by suicide just before her 25th birthday, her sister revealed. She shared that Misha had been under immense pressure due to a decline in her social media followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-says-parents-lost-respect-in-a-second-i-put-them-through-that-2717320-2025-04-30",
      "headline": "Apoorva Mukhija says parents 'lost respect in a second': I put them through thatApoorva Mukhija became emotional in a promo for her interview with We Are Yuvaa, discussing the backlash from the India's Got Latent controversy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-deaddiction-centre-drug-abuse-claims-2717314-2025-04-30",
      "headline": "Actor Shine Tom Chacko admitted to de-addiction centre amid drug abuse claimsMalayalam actor Shine Tom Chacko has been admitted to a rehab centre following drug abuse allegations by co-star Vincy Aloshious. He was earlier arrested and released on bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-teaser-akshay-kumar-abhishek-bachchan-riteish-deshmukh-nana-patekar-laugh-riot-killer-twist-this-time-2717287-2025-04-30",
      "headline": "Housefull 5 teaser: Akshay Kumar's laugh riot gets a killer twist this timeAkshay Kumar's family entertainer, 'Housefull 5' teaser is finally out. The film will release in theatres on June 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-shah-rukh-khan-to-reunite-for-5th-time-in-king-shooting-details-out-report-2717250-2025-04-30",
      "headline": "Deepika Padukone-SRK to reunite for 5th time in King, shooting details out: ReportShah Rukh Khan and Deepika Padukone seem to be paired together for the fifth time. The two will reportedly be seen alongside Suhana Khan in her debut film 'King'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-not-in-favour-of-pakistani-artistes-in-india-at-this-moment-i-would-say-no-2717274-2025-04-30",
      "headline": "Javed Akhtar on Pakistani artistes in India: At this moment, I would say noVeteran screenwriter and lyricist Javed Akhtar shared his views on whether Pakistani artistes should be allowed to perform in India. He stated that it's a 'one-way traffic'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-melbourne-concert-delay-700-people-wont-perform-2717235-2025-04-30",
      "headline": "Neha Kakkar refused to perform for just '700 people' in Melbourne: Event plannerSinger Neha Kakkar allegedly refused to perform at the Melbourne concert. One of the event organisers claimed that she wasn't satisfied with the turnout of 700 people and wanted to wait till the stadium filled up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-12-detailed-report-akshay-kumar-film-rs-70-crore-strong-rs-100-crore-possible-2717218-2025-04-30",
      "headline": "Kesari 2 box office Day 12: Akshay's film Rs 70 crore strong; Rs 100 crore possible?'Kesari Chapter 2' is doing well during the weekdays, and while it is already Rs 70 crore strong, it will be interesting to see if it manages to surpass the benchmark of Rs 100 crore by the end of this weekend or next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thunderbolts-review-marvel-fun-filler-avenger-2717201-2025-04-30",
      "headline": "Thunderbolts review: Marvel's fun filler till the next Avenger dropsReleased-Thu May 01, 2025Florence Pugh simply stole the show with her performance in 'Thunderbolts*'.  The film offers a mix of entertainment and depth, making it a worthwhile addition to the franchise. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-on-wife-shalini-success-i-took-wrong-decisions-2717190-2025-04-30",
      "headline": "Ajith credits wife Shalini for his success: There were times I took wrong decisionsActor Ajith Kumar, in an exclusive interview with India Today, credited his wife Shalini for his success. He stated that she stood by him even when he took wrong decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tiktoks-delaney-rowe-sparks-romance-buzz-with-actor-bj-novak-glbs-2717180-2025-04-30",
      "headline": "TikTok's Delaney Rowe sparks romance buzz with actor B.J. NovakB.J. Novak and TikTok star Delaney Rowe are rumoured to be dating after multiple public sightings, though reps haven't confirmed. Fans on social media continue speculating about their relationship status.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/first-look-dwayne-johnson-unrecognizable-as-mark-kerr-in-the-smashing-machine-glbs-2717178-2025-04-30",
      "headline": "First Look: Dwayne Johnson unrecognizable as Mark Kerr in The Smashing MachineDwayne Johnson transforms to play MMA legend Mark Kerr in The Smashing Machine, a gritty A24 sports drama exploring fame, addiction, and resilience. The film hits theaters October 3, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ken-carson-announces-2025-arena-tour-after-more-chaos-tops-billboard-200-glbs-2717166-2025-04-30",
      "headline": "Ken Carson announces 2025 Arena tour after 'More Chaos' tops Billboard 200Following his chart-topping album More Chaos, Ken Carson announces a 30-city North American arena tour starting July 2025, marking a milestone moment in his rapidly rising hip-hop career.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sam-asghari-debuts-romance-with-brooke-irvine-at-lgbtq-hotel-opening-glbs-2717159-2025-04-30",
      "headline": "Sam Asghari debuts romance with Brooke Irvine at LGBTQ+ Hotel OpeningSam Asghari debuted his relationship with Brooke Irvine at a Puerto Vallarta LGBTQ+ hotel launch, expressing allyship, joining stars like Demi Lovato, and reflecting on life post-Britney Spears.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-fan-builds-temple-on-her-38th-birthday-in-andhra-pradesh-2717040-2025-04-29",
      "headline": "Fan builds temple for Samantha on her 38th birthday in Andhra Pradesh. WatchA temple in the name of actor Samantha has been constructed by a fan in Bapatla, Andhra Pradesh. The fan marked the actor's 38th birthday by organising a meal for orphans.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-calls-hera-pheri-deshbhakti-film-it-keeps-the-country-happy-2717016-2025-04-29",
      "headline": "Suniel Shetty calls Hera Pheri 'Deshbhakti' film: It keeps the country happyAt the trailer launch of 'Kesari Veer', Suniel Shetty shared his thoughts on 'Hera Pheri', describing it as a patriotic film. The actor stated that the movie promotes joy and mental well-being, which, in his view, embodies true 'deshbhakti'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-3-confirmed-producer-bhushan-kumar-kumar-mangat-ajay-devgn-2716965-2025-04-29",
      "headline": "Producers Bhushan Kumar and Kumar Mangat confirm Raid 3Ajay Devgn returns as the righteous officer Amey Patnaik in Raid 2, set to release on May 1, as producers confirm a third instalment is already in the works. The sequel brings a fresh cast with Riteish Deshmukh as the antagonist and Vaani Kapoor replacing Ileana D'Cruz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-on-being-honoured-with-padma-bhushan-still-plain-middle-class-at-heart-2716983-2025-04-29",
      "headline": "Ajith Kumar on Padma Bhushan honour: Still plain middle class at heartTamil actor Ajith Kumar was honoured with the Padma Bhushan on Monday. In an exclusive conversation with India Today, the 'Vidaamuyarchi' actor described the recognition as \"surreal and overwhelming\"."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-today-tracks-hafiz-saeeds-safe-haven-in-lahore-2717350-2025-04-30",
      "headline": "World Exclusive: India Today reveals LeT chief Hafiz Saeed's Lahore hideoutIndia Today has also accessed satellite pictures and video footage that shows how India's most wanted terrorist hides in plain sight. His personal security also confirmed to India Today that they were deployed to protect Hafiz. The place is under 24x7 security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pm-modi-to-chair-super-cabinet-ccpa-ccs-meet-today-first-since-pulwama-attack-2717228-2025-04-30",
      "headline": "PM's 'super cabinet' meets just after top security body huddle over J&K attack  Live UpdatesPrime Minister Narendra Modi is chairing key Cabinet Committee on Security (CCS) and Cabinet Committee on Political Affairs (CCPA), meetings amid tensions with Pakistan after the Pahalgam terror attack that killed 26 people. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-lashkar-commander-farooq-ahmad-role-nia-2717255-2025-04-30",
      "headline": "Lashkar commander's network played key role in Pahalgam attack: NIA sourcesLashkar-e-Taiba commander Farooq Ahmad's house in Kupwara was recently demolished by security forces as part of its crackdown on the terror ecosystem in Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakisitan-panic-fear-bunker-hide-radar-system-pahalgam-terror-attacks-pm-modi-was-shehbaz-sharif-asim-munir-2717076-2025-04-30",
      "headline": "Pakistan turns panicistanIndia's display of resolve after the Pahalgam terror attacks in which 26 people were killed has spread panic among Pakistan's military and civilian authorities. The panic mode is on full display as Islamabad scurries officials to several world capitals, moves terrorists nourished by it into bunkers, pleads for a neutral probe and rushes forces to the border with India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-3/???#google_vignette",
      "headline": "When Kashmir turned crimson with blood of PanditsIn part 3 of our series on the history of terror in Kashmir, we revisit the winter of 1989, when the blood of Kashmiris flowed through the Valley, leading to the biggest exodus in Independent India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-commissioner-elected-maharashtra-1994-batch-ips-officer-deven-bharti-2717318-2025-04-30",
      "headline": "Deven Bharti, who led 26/11 attacks probe, is new Mumbai police commissionerA 1994 batch IPS officer from Bihar, Deven Bharti has been serving as the Mumbai Police special commissioner since 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/digital-access-fundamental-right-supreme-court-kyc-disabled-acid-attack-victims-2717295-2025-04-30",
      "headline": "Digital access fundamental right: Top court on KYC norms for acid attack victimsThe Supreme Court issued a slew of directions to ease banking and e-governance services for acid attack survivors with visual challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ishaq-dar-pakistan-got-the-resistance-front-removed-un-security-council-statement-pahalgam-attack-2717266-2025-04-30",
      "headline": "How Pak got terror outfit's name dropped from UN statement on Pahalgam attackPakistani Foreign Minister Ishaq Dar said as a non-permanent member of the UN Security Council, Islamabad pushed to water down the language in the US-proposed statement, which originally named and shamed The Resistance Front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/fake-sangeet-wedding-parties-delhi-gen-z-2717038-2025-04-30",
      "headline": "Shaadi without a couple? Welcome to Delhi's fake wedding party sceneDelhi's party scene has a new trend: fake weddings. Guests dress in ethnic wear, dance to dhol beats, and celebrate. No couple or vows needed, just the vibe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/cisce-icse-class-10-isc-class-12-results-2025-declared-announced-check-scores-direct-link-download-2717278-2025-04-30",
      "headline": "Class 10 ICSE, Class 12 ISC results declared. Direct link to download scorecardsCISCE ISC Class 12th, ICSE Class 10th Result 2025 Direct Link at cisce.org, results.cisce.org Live Updates: The websites to check and access the CISCE 2025 Class 10 and Class 12 results are cisce.org and DigiLocker. The CISCE Class 10 and Class 12 result rechecking window will be activated after the declaration of results today.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-india-has-full-support-go-after-pahalgam-attack-perpetrators-appeal-for-calm-pakistan-links-throat-slit-gesture-2717283-2025-04-30",
      "headline": "UK says India has 'full support' to go after perpetrators of Pahalgam attackAsked about \"cross-border links to Pakistan\" in the Pahalgam terror attack, British Foreign Minister Hamish Falconer said, \"We want to see the perpetrators held to justice properly, and we will be supporting India to do so.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-not-in-favour-of-pakistani-artistes-in-india-at-this-moment-i-would-say-no-2717274-2025-04-30",
      "headline": "Javed Akhtar on Pakistani artistes in India: At this moment, I would say noVeteran screenwriter and lyricist Javed Akhtar shared his views on whether Pakistani artistes should be allowed to perform in India. He stated that it's a 'one-way traffic'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-slap-video-rinku-singh-dc-vs-kkr-2717216-2025-04-30",
      "headline": "Kuldeep slaps Rinku on live TV, KKR star's shocked reaction is viralDelhi Capitals' spinner Kuldeep Yadav slapped Rinku Singh on live TV after the DC vs KKR match on Tuesday, April 29. Rinku was taken aback by the playful slap from Kuldeep and stared at him with a look of bewilderment in his eyes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/think-bihar-breeds-ias-toppers-this-state-outsmarts-it-2717277-2025-04-30",
      "headline": "Think Bihar breeds IAS toppers? This state outsmarts itUP's larger population base, broader access to educational resources, and longer history of administrative participation have given it a consistent edge.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-origin-uk-mp-lord-meghnad-desai-calls-for-india-to-take-over-pok-kashmir-pahalgam-terror-attack-2717290-2025-04-30",
      "headline": "Taking back PoK only solution: India-born British MP on Pahalgam horrorIndian-origin British politician, Lord Meghnad Desai, has urged the Indian government to take over Pakistan-occupied Kashmir (PoK) to resolve the longstanding Kashmir issue permanently. Following the deadly Pahalgam terror attack that killed 26 innocent civilians, Desai emphasised that reclaiming the PoK is the only way to solve the problem."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-satyendar-jain-manish-sisodia-delhi-government-classroom-construction-scam-anti-corruption-2717309-2025-04-30",
      "headline": "Case against AAP's Satyendar Jain, Manish Sisodia in classroom construction scamAn Anti-Corruption case has been registered against AAP leaders Manish Sisodia and Satyendar Jain over an alleged Rs 2,000 crore scam involving inflated costs and procedural violations in the construction of 12,748 classrooms under the Delhi government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/us-angry-restaurant-owner-chases-customer-who-did-not-leave-tip-hurls-abuse-viral-video-2717261-2025-04-30",
      "headline": "Video: Angry restaurant owner chases customer who didn't leave tip, abuses himIn the video, the owner, Kenny Chou, was seen chasing the customer down the street and reprimanding him for not leaving a tip on a $20 meal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashok-khemka-ias-officer-haryana-retires-robert-vadra-land-deal-57-transfers-2717215-2025-04-30",
      "headline": "57 transfers in 34 years, senior IAS officer Ashok Khemka retires todaySenior IAS officer Ashok Khemka, known for his integrity and a career spanning 34 years marked by 57 transfers, including his bold stand in the Robert Vadra land deal, is retiring today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-urges-india-pakistan-to-not-escalate-the-situation-over-pahalgam-terror-attack-glbs-2717164-2025-04-30",
      "headline": "US sidesteps question after Pakistan Minister's 'dirty work' admissionAmid rising tensions after the Pahalgam terror attack, the US is urging India and Pakistan to avoid escalation. Secretary of State Marco Rubio plans to speak with both nations' foreign ministers as Washington pushes for peace through diplomatic channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-army-ceasefire-violation-jammu-and-kashmir-pahalgam-terrorist-attack-tensions-2717182-2025-04-30",
      "headline": "Pak fires along International Border for first time, Army retaliates: SourcesThe Pakistan Army engaged in cross-border firing along the International Border and Line of Control in Jammu and Kashmir, escalating tensions after the Pahalgam terror attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/watch-elderly-woman-tries-to-enter-cockpit-gets-knocked-to-ground-by-crew-glbs-2717189-2025-04-30",
      "headline": "Watch: Elderly woman tries to enter cockpit, gets knocked to ground by crewChaos broke out on an American Airlines flight when a woman tried to storm the cockpit over a delay. She was tackled by crew and was later removed by police. The incident delayed the flight from São Paulo to New York by over 2 hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-techie-kills-wife-son-in-us-seattle-washington-dies-by-suicide-mysuru-entrepreneur-2717099-2025-04-29",
      "headline": "Indian-origin CEO shoots wife and son at US home, then kills selfHarshavardhana Kikkeri, a Microsoft alumnus from Mysuru, died by suicide after allegedly shooting his wife and son at their townhouse near Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/three-chinese-astronauts-land-successfully-after-six-months-in-space-2717299-2025-04-30",
      "headline": "Three Chinese astronauts land successfully after six months in spaceShenzhou crewed spaceflights have been a regular fixture of the country's space program for the past two decades and have increased in frequency in recent years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vivad-se-vishwas-20-deadline-ends-today-last-call-to-settle-income-tax-disputes-2717298-2025-04-30",
      "headline": "Vivad Se Vishwas 2.0 deadline ends today: Last call to settle income tax disputesVivad Se Vishwas 2.0 is a dispute resolution scheme run by the Income Tax Department. It gives taxpayers a chance to settle ongoing tax-related cases by avoiding the prolonged litigation process and simply paying the disputed tax amount."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-arsenal-vs-psg-mikel-arteta-reaction-paris-2717333-2025-04-30",
      "headline": "Arsenal will need to do something special in Paris to reach UCL final: ArtetaMikel Arteta feels that his Arsenal side will need to do something special in Paris to make it to the final of the Champions League after their home loss to PSG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-form-dip-ipl-2025-points-table-2717317-2025-04-30",
      "headline": "Delhi Capitals suffering due to inconsistent top-order: Shaun PollockDelhi Capitals have dropped form in IPL 2025 due to their inconsistent batting order, said Shaun Pollock after the team's match against Kolkata Knight Riders. DC have lost 3 of their last 4 games.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-harshit-rana-sunil-narine-aakash-chopra-2717311-2025-04-30",
      "headline": "Harshit needs to step up for KKR, he's not a newcomer anymore: Aakash ChopraAakash Chopra feels that Harshit Rana needs to step up for KKR in the ongoing season of IPL 2025. The former cricketer said that Harshit isn't a newcomer anymore and needs to repay the faith Kolkata has put in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-birthday-yuvraj-singh-rcb-csk-2717284-2025-04-30",
      "headline": "Rohit Sharma birthday: Yuvraj Singh, RCB and CSK lead the way with wishesThe cricketing world and fans wished Rohit Sharma on his 38th birthday on Wednesday, April 30. Rohit continues to show his class during the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-retirement-ipl-2025-adam-gilchrist-2717263-2025-04-30",
      "headline": "He has nothing to prove: Gilchrist wants MS Dhoni to retire from IPLFormer Australia wicketkeeper Adam Gilchrist has said that MS Dhoni should retire from the Indian Premier League next season. Gilchrist stated that Dhoni should call time on his career because he has nothing left to prove."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-kkr-anukul-roy-press-conference-sunil-narine-2717243-2025-04-30",
      "headline": "Narine single-handedly brought KKR back in the game vs DC: Anukul RoyIPL 2025: KKR spinner Anukul Roy praised Sunil Narine for single-handedly winning their match against Delhi Capitals. Narine picked up three wickets and scored a quickfire 27 runs to hand KKR and important victory in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-preview-predicted-xi-team-news-chepauk-pitch-weather-report-2717241-2025-04-30",
      "headline": "CSK vs PBKS: Punjab look to breach fallen fortress Chepauk as Chennai need winIt's a high-stakes match for CSK as they look to keep their faint play-off hopes alive with PBKS paying a visit to Chepauk on Wednesday, April 30.  A loss could end Chennai's IPL 2025 campaign, while Punjab looks to get back into the top two. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-slap-video-rinku-singh-dc-vs-kkr-2717216-2025-04-30",
      "headline": "Kuldeep slaps Rinku on live TV, KKR star's shocked reaction is viralDelhi Capitals' spinner Kuldeep Yadav slapped Rinku Singh on live TV after the DC vs KKR match on Tuesday, April 29. Rinku was taken aback by the playful slap from Kuldeep and stared at him with a look of bewilderment in his eyes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-kkr-vipraj-nigam-press-conference-axar-patel-2717214-2025-04-30",
      "headline": "IPL 2025: DC will try to make comeback and finish in top two, says Vipraj NigamDelhi Capitals all-rounder Vipraj Nigam has said that the team will try to make a comeback in their remaining matches and aim to finish in the top two after their latest loss to Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-ajinkya-rahane-injury-anukul-roy-press-conference-2717205-2025-04-30",
      "headline": "Ajinkya Rahane injury: Anukul Roy provides update on KKR skipper after DC winAnukul Roy has provided an update on KKR skipper Ajinkya Rahane, who suffered an injury during the win over DC in Delhi on Tuesday, April 29. KKR beat DC by 14 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-kkr-anukul-roy-press-conference-sunil-narine-2717243-2025-04-30",
      "headline": "Narine single-handedly brought KKR back in the game vs DC: Anukul RoyIPL 2025: KKR spinner Anukul Roy praised Sunil Narine for single-handedly winning their match against Delhi Capitals. Narine picked up three wickets and scored a quickfire 27 runs to hand KKR and important victory in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-preview-predicted-xi-team-news-chepauk-pitch-weather-report-2717241-2025-04-30",
      "headline": "CSK vs PBKS: Punjab look to breach fallen fortress Chepauk as Chennai need winIt's a high-stakes match for CSK as they look to keep their faint play-off hopes alive with PBKS paying a visit to Chepauk on Wednesday, April 30.  A loss could end Chennai's IPL 2025 campaign, while Punjab looks to get back into the top two. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-slap-video-rinku-singh-dc-vs-kkr-2717216-2025-04-30",
      "headline": "Kuldeep slaps Rinku on live TV, KKR star's shocked reaction is viralDelhi Capitals' spinner Kuldeep Yadav slapped Rinku Singh on live TV after the DC vs KKR match on Tuesday, April 29. Rinku was taken aback by the playful slap from Kuldeep and stared at him with a look of bewilderment in his eyes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-kkr-vipraj-nigam-press-conference-axar-patel-2717214-2025-04-30",
      "headline": "IPL 2025: DC will try to make comeback and finish in top two, says Vipraj NigamDelhi Capitals all-rounder Vipraj Nigam has said that the team will try to make a comeback in their remaining matches and aim to finish in the top two after their latest loss to Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-kkr-ajinkya-rahane-injury-anukul-roy-press-conference-2717205-2025-04-30",
      "headline": "Ajinkya Rahane injury: Anukul Roy provides update on KKR skipper after DC winAnukul Roy has provided an update on KKR skipper Ajinkya Rahane, who suffered an injury during the win over DC in Delhi on Tuesday, April 29. KKR beat DC by 14 runs. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}