{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-sharply-lower-amid-trade-war-fears-after-trump-tariffs-2703618-2025-04-03",
      "headline": "Wall Street opens sharply lower amid trade war fears after Trump tariffsWall Street's major indexes fell sharply after President Trump's new tariffs raised trade war fears. The Dow dropped 2.66%, the S&P 500 declined 3.32%, and the Nasdaq plunged 4.50%, reflecting market uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-nomination-updation-now-free-says-finance-minister-nirmala-sitharaman-2703506-2025-04-03",
      "headline": "PPF nomination updation now free, says Nirmala SitharamanIt is important to add a nominee to the PPFaccount so that the money is transferred in a smooth manner in the event of the death of the PPF account holder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-liberation-day-reciprocal-tariff-announcement-india-at-27-percent-pakistan-29-percent-tariff-2703432-2025-04-03",
      "headline": "Trump's 'Liberation Day' tariff: India at 27%, but where does Pakistan stand?Asian nations have been the hardest hit by Trump's latest tariff move. The new duties aim to cut the US trade deficit and change global supply chains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-loses-300-points-as-trump-tariffs-weigh-but-nifty-holds-23200-amid-limited-impact-2703450-2025-04-03",
      "headline": "Sensex, Nifty snap 2-day winning streak as D-Street sees limited tariff impactThe S&P BSE Sensex fell 322.08 points to close at 76,295.36, while the NSE Nifty50 shed 82.25 points to end at 23,250.10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-us-calculate-reciprocal-tariff-for-different-countries-explanation-factors-reasons-2703440-2025-04-03",
      "headline": "Explained: How Trump's administration calculated reciprocal tariffsIn a statement released on Wednesday night, the United States Trade Representative (USTR) explained how the tariffs were determined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-shares-video-on-x-alleges-fraud-conspiracy-legal-battle-2703395-2025-04-03",
      "headline": "Byju Raveendran alleges conspiracy caught on video amid legal woesThe video he shared is one minute and 44 seconds long and appears to be a screen recording of a virtual meeting involving Byju's shareholders and their lawyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-asia-countries-hardest-hit-china-vietnam-thailand-south-korea-india-2703307-2025-04-03",
      "headline": "Trump's tariff list: Here's why Asian countries took the biggest hitTrump tariff: Besides China, which now faces a total tariff of 54%, Vietnam has been hit with 46%, Thailand with 37%, South Korea with 25%, and India with 27%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-order-india-gets-key-exemptions-on-several-critical-minerals-ytvd-2703245-2025-04-03",
      "headline": "Trump's tariff order: India gets key exemptions on several critical mineralsTrump's new tariff order exempts India on copper, lumber, and critical minerals. The order imposes a 26% lower tariff on India compared to China, but experts question the calculation methods. Former diplomat Ashok Sajjanar criticises the non-transparent system and highlights the impact on strategic partnerships in the Indo-Pacific region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-analyzes-impact-of-us-tariff-mixed-bag-not-a-setback-commerce-ministry-ytvd-2703226-2025-04-03",
      "headline": "Mixed bag, not a setback: India's first response to Trump's tariffThe Commerce Ministry of India is analysing the impact of the 27% tariff imposed by the US. The ministry states it's a mixed bag and not a setback. Exemptions are expected in sectors like pharmaceuticals, semiconductors, and critical minerals. The tariff ranges from 10% to 27% across various sectors. India aims to sign a Bilateral Trade Agreement with the US by fall this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pharmaceutical-stocks-rising-today-donald-trump-reciprocal-tariff-exempt-glanf-pharma-cipla-dr-reddys-2703255-2025-04-03",
      "headline": "Sun Pharma, Gland, Cipla, Dr Reddy's: Why pharma stocks are rising todayShares of Sun Pharma, Dr Reddy's Laboratories, Gland Pharma, and Cipla rose sharply during early trade, defying the weak trend visible on the broader markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-tanks-500-points-nifty-below-23200-it-stocks-worst-hit-hcltech-infosys-2703240-2025-04-03",
      "headline": "Trump tariffs roil Dalal Street: Sensex, Nifty fall as IT stocks worst hitThe S&P BSE Sensex fell 344.27 points to 76,273.17, while the NSE Nifty50 lost 80.60 points to 23,251.75 as of 9:31 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-canada-north-korea-and-mexico-among-countries-missing-from-donald-trump-reciprocal-tariff-list-2703234-2025-04-03",
      "headline": "Why Russia, Canada and these countries were not part of Trump's tariff hit listThe exclusion has raised eyebrows, especially as major trade partners like India (27%), the European Union (20%), and Vietnam (46%) have been slapped with hefty duties. So, why were these countries spared?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-commerce-ministry-official-mixed-bag-not-setback-response-donald-trump-reciprocal-tariffs-announcement-analysing-impact-2703214-2025-04-03",
      "headline": "Mixed bag, not setback: Government official on Trump's tariffs on IndiaThe new tariffs announced by US President Donald Trump include a universal 10% duty on all imports into the US starting from April 5, with an additional 16% to be applied from April 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-3-dalal-street-donald-trump-reciprocal-tariff-2703207-2025-04-03",
      "headline": "Stock market opening on April 3: Will Sensex, Nifty fall after Trump tariff?The stock market extended its gains for the second consecutive session in its last session. The Sensex surged 592.93 points to close at 76,617.44, while the NSE Nifty50 rose 166.65 points to end at 23,332.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-3-maruti-suzuki-airtel-hdfc-bank-spicejet-trump-tariff-26-percent-2703202-2025-04-03",
      "headline": "Stocks to watch on April 3: Shares in focus; Maruti Suzuki, Airtel, HDFC BankThe stock market will closely track developments today as several companies such as Maruti Suzuki, HDFC Bank, SpiceJet, and more remain in focus due to key announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-26-percent-reciprocal-tariff-impact-decoded-sectors-at-risk-trade-deal-2703199-2025-04-03",
      "headline": "What Donald Trump's 27% reciprocal tariff means for IndiaThe 27% reciprocal tariff imposed by US President Donald Trump is a big blow to India's exports, affecting multiple industries. Here's what it means for the Indian economy and also a look at the key sectors at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-swings-in-final-hours-of-trading-before-trumps-tariff-announcement-glbs-2703078-2025-04-02",
      "headline": "Wall Street swings in final hours of trading before Trump's tariff announcementUS stocks remained volatile on Wednesday morning in anticipation of President Donald Trump's tariff announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-mundra-port-sets-record-with-200-mmt-annual-cargo-handling-business-update-2703051-2025-04-02",
      "headline": "Adani's Mundra Port sets record with 200-MMT annual cargo handlingMundra Port's growing cargo volume further cements its role as India's largest trade gateway. The steady rise in throughput reflects APSEZ's investment in supply chain and logistics infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poonam-gupta-is-rbi-new-deputy-governor-all-you-need-to-know-2702977-2025-04-02",
      "headline": "Poonam Gupta is RBI's new Deputy Governor: All you need to knowPoonam Gupta is a well-known economist with nearly 20 years of experience at the World Bank and the International Monetary Fund (IMF). She has also been a government adviser in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rally-despite-us-donald-trump-liberation-day-reciprocal-tariffs-2702917-2025-04-02",
      "headline": "Sensex, Nifty rally as stock market ignores US tariff threat: 3 key takeawaysThe Sensex and Nifty witnessed a strong rally despite uncertainty around Trump's 'Liberation Day' tariff announcement. Broader market indices also mirrored the uptrend, and to everyone's surprise, volatility took a backseat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/received-a-wrong-tax-demand-notice-here-is-how-to-rectify-it-online-2702895-2025-04-02",
      "headline": "Received a wrong tax demand notice? Here's how to rectify it onlineThis feature was introduced in January 2025 and allows taxpayers to request corrections through the e-filing Income Tax Return (ITR) portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-gain-ahead-of-us-donald-trump-liberation-day-tariff-annoucement-2702885-2025-04-02",
      "headline": "Sensex ends nearly 600 points higher, Nifty settles above 23,300; Zomato up 5%The S&P BSE Sensex surged 592.93 points to close at 76,617.44, while the NSE Nifty50 added 166.65 points to end at 23,332.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forbes-billionaires-list-2025-mukesh-ambani-net-worth-richest-in-world-elon-musk-jeff-bezos-mark-zuckerberg-2702884-2025-04-02",
      "headline": "Forbes Billionaires List 2025: Mukesh Ambani drops out of top 10. Check rankingThe 2025 list shows that the world has 3,028 billionaires, an increase of 247 compared to last year. The combined wealth of these billionaires stands at $16.1 trillion, which is nearly $2 trillion more than in 2024. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-money-for-home-office-staff-rs-35-crore-dog-tito-care-rs-12-lakh-report-2702838-2025-04-02",
      "headline": "Ratan Tata leaves over Rs 3 crore for home and office staff in his willIn his will, Ratan Tata set aside nearly Rs 3.5 crore for his home and office staff, including domestic helpers, drivers, and office assistants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-check-target-price-52-week-high-buy-or-sell-2702828-2025-04-02",
      "headline": "Zomato share price rises 3%. Check target price, 52-week high, buy or sell?Today's gain comes on the back of developments such as Goldman Sachs buying a stake in Zomato and a report indicating that the company has laid off 600 customer support employees.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-now-open-for-nps-subscribers-here-is-how-to-apply-2702780-2025-04-02",
      "headline": "Unified Pension Scheme now open for NPS subscribers. Here's how to applyCentral government employees who have worked for more than 10 years are entitled to a guaranteed pension of Rs 10,000 per month. Additionally, those with 10–25 years of service will receive a pension that is in line with the years they served."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-consumer-products-stock-price-rises-8-percent-today-key-reasons-explained-2702773-2025-04-02",
      "headline": "Explained: Why Tata Consumer Products share price gained 8% todayAt around 11:34 am, shares were trading 7.47% higher at Rs 1,066 on the Bombay Stock Exchange (BSE), after hitting an intraday high of Rs 1,073.55 earlier in the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-activity-in-march-expands-at-fastest-pace-in-8-months-2702741-2025-04-02",
      "headline": "Manufacturing activity in March expands at fastest pace in 8 monthsThe HSBC India Manufacturing Purchasing Managers' Index (PMI), compiled by S&P Global, bounced to 58.1 in March from 56.3 in February, higher than a preliminary estimate of 57.6 and firmly above 50.0 which separates growth from contraction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-400-points-nifty-rise-reasons-why-trump-tariff-liberation-day-failed-to-spook-dalal-street-investors-2702732-2025-04-02",
      "headline": "Sensex jumps 600 points: Why stock market is rising despite tariff concernsStock market today: The main indices on Dalal Street opened on a positive note on Wednesday despite concerns over Donald Trump's 'Liberation Day' tariff announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/white-house-confirms-new-reciprocal-tariffs-set-to-begin-soon-ytvd-2702722-2025-04-02",
      "headline": "White House confirms new reciprocal tariffs set to begin soonThe White House has confirmed that new reciprocal tariffs are set to begin in the next few hours. Donald Trump stated that India is likely to reduce its tariffs. The President's economic vision aims to improve American competitiveness, reduce trade deficits, and protect economic and national security. India is taking a wait-and-watch approach to assess the impact of these tariffs before considering any retaliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-liberation-day-donald-trump-announcements-impact-india-global-trade-explained-2702697-2025-04-02",
      "headline": "Countdown begins for Trump's 'Liberation Day' tariffs: What's at stake?Uncertainty grows as the world braces for Donald Trump's 'Liberation Day' tariffs. Global stock markets are volatile, major economies face tough choices, and fears of a trade war threaten to disrupt global commerce."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-are-dirty-15-nations-list-donald-trump-tariff-liberation-day-april-2-2702686-2025-04-02",
      "headline": "'Dirty 15' list: Which countries will suffer most from Trump's tariffs?The Trump administration has claimed that existing trade rules favour other countries at the expense of the US, and the new tariffs are seen as a response to these concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-over-200-points-nifty-above-23200-as-dalal-street-braces-for-liberation-day-tariffs-2702685-2025-04-02",
      "headline": "Sensex gains 400 points, Nifty climbs as tariff impact fails to rattle D-StreetThe S&P BSE Sensex gained 436.11 points to 76,460.62, while NSE Nifty50 added 106.30 points to 23,272.00 as of 9:34 am.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-april-2-what-to-expect-from-sensex-nifty-today-donald-trump-tariff-2702655-2025-04-02",
      "headline": "Sensex, Nifty opening today: What to expect from D-Street on Trump tariff day?Nifty and Sensex fell 1.5% and 1.8%, respectively, in the last session, marking their biggest single-day percentage fall in a month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-2-shares-in-focus-trump-tariff-dalal-street-sensex-nifty-2702642-2025-04-02",
      "headline": "Stocks to watch on April 2: Shares in focus; Tata Motors, Swiggy, Coal IndiaShares of companies such as Maruti Suzuki, Tata Motors, Tata Steel, Tata Consumer, Swiggy, Godavari Power, and Indian Bank will be in focus due to key developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-rules-know-all-the-rates-slabs-deductions-zero-tax-on-incomes-up-to-rs-12-lakh-and-more-2702350-2025-04-02",
      "headline": "New Income Tax rules: Know all rates, slabs, deductions and moreThe government has amended the income tax slabs under the new tax regime for FY 2025-26. According to the new structure, those earning up to Rs 4 lakh will pay no taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-loser-key-insights-sensex-nifty-technical-indicators-2702333-2025-04-01",
      "headline": "1st trading day of FY26 ends in bloodbath: Top gainers, losers, key insightsThe S&P BSE Sensex ended nearly 1,400 points lower, while the NSE Nifty50 closed below 23,200. The uncertainty surrounding the Trump administration's expected reciprocal tariff imposition on imported goods triggered a significant sell-off, causing the domestic market to underperform other global indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-nearly-1400-points-nifty-tumbles-350-points-hcltech-tanks-4-percent-2702286-2025-04-01",
      "headline": "Sensex falls nearly 1,400 points, Nifty tumbles 350 points; HCLTech tanks 4%The S&P BSE Sensex plunged 1,390.41 points to close at 76,024.51, while the NSE Nifty50 tanked 353.65 points to end at 23,165.70. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zeenat-aman-recalls-shooting-pukar-song-in-titillating-outfit-2703654-2025-04-03",
      "headline": "Zeenat Aman recalls shooting Pukar song in 'titillating outfit'Veteran actor Zeenat Aman took her fans on a nostalgic journey as she recalled the filming of the iconic song Samundar Mein Naha Ke with Amitabh Bachchan. The shoot was Amitabh Bachchan's comeback after his life-threatening accident on the Coolie set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bruce-springsteen-surprises-fans-with-tracks-ii-the-lost-albums-announcement-glbs-2703655-2025-04-03",
      "headline": "Bruce Springsteen surprises fans with Tracks II: The Lost Albums announcementBruce Springsteen is set to release Tracks II: The Lost Albums, a massive seven-album collection featuring 83 songs, including 74 previously unheard tracks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-gosling-on-project-hail-mary-2703662-2025-04-03",
      "headline": "Ryan Gosling on his next, Project Hail Mary: Massive in scopeHollywood star Ryan Gosling is gearing up for his next, Project Hail Mary. The film star called it a massive and ambitious project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jesse-eisenberg-kieran-culkins-a-real-pain-an-ode-to-shared-humanity-and-loss-2703588-2025-04-03",
      "headline": "Jesse Eisenberg, Kieran Culkin's A Real Pain: An ode to shared humanity and lossIn A Real Pain, Jesse Eisenberg and Kieran Culkin star as estranged cousins on a poignant journey through Poland. The film delves into themes of grief, heritage, and the enduring bonds that connect us across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-bond-film-in-works-by-amazon-mgm-exotic-new-chapter-2703637-2025-04-03",
      "headline": "James Bond film in works by Amazon MGM, makers promise an exotic new chapterA new James Bond movie is in the works by Amazon MGM. The makers have promised a brand-new exciting chapter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-odyssey-universal-hypes-christopher-nolan-film-as-once-in-a-generation-epic-2703638-2025-04-03",
      "headline": "The Odyssey: Universal hypes Christopher Nolan film as 'once-in-a-generation' epicUniversal Pictures teased Christopher Nolan's ambitious adaptation of The Odyssey at CinemaCon, promising a cinematic masterpiece. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jack-trailer-siddu-jonnalagadda-turns-spy-in-this-action-entertainer-2703616-2025-04-03",
      "headline": "Jack trailer: Siddu Jonnalagadda turns a spy in this action entertainerActor Siddu Jonnalagadda, known for his roles in the Tillu franchise, steps into a more intense role with the upcoming movie, Jack. The action-comedy, directed by Bommarillu Bhaskar, follows a thrilling mission to eliminate terrorists, blending humour, action, and suspense."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/glen-powell-mother-debunks-his-dating-rumours-with-sydney-sweeney-2703600-2025-04-03",
      "headline": "Glen Powell's mother debunks his dating rumours with Sydney SweeneyCyndy Powell addressed the swirling rumours about her son Glen Powell and actress Sydney Sweeney, confirming they are just friends. She highlights their longstanding friendship, dismissing any romantic speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivaji-satam-journey-as-acp-pradyuman-to-end-in-cid-exclusive-2703583-2025-04-03",
      "headline": "Actor Shivaji Satam's journey as ACP Pradyuman to end in CIDVeteran actor Shivaji Satam's journey will end soon on the iconic Sony TV show CID. Satam essayed the character of ACP Pradyuman in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/badshah-raveena-tandon-dances-to-kabhi-tu-chhalia-lagta-hai-video-2703544-2025-04-03",
      "headline": "Indian Idol 15: Badshah, Raveena Tandon groove to Kabhi Tu Chhalia Lagta HaiIndian Idol 15 is set for a spectacular conclusion with Badshah and Raveena Tandon grooving to classic hits. The finale promises electrifying performances by the top six contestants, airing on April 5 and 6 on Sony TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tigmanshu-dhulia-recalls-time-as-shekhar-kapurs-assistant-serving-srk-tea-2703580-2025-04-03",
      "headline": "Tigmanshu Dhulia recalls time as Shekhar Kapur's assistant, serving SRK teaTigmanshu Dhulia reflected on his early days working with Shekhar Kapur, shedding light on the director's shift from Hindi films to Hollywood. He also shared a humorous anecdote about making terrible tea for Shah Rukh Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/drake-granted-access-to-kendrick-lamars-contracts-by-court-glbs-2703578-2025-04-03",
      "headline": "Drake granted access to Kendrick Lamar's contracts by courtDrake wins access to Universal Music Group's confidential records in his defamation lawsuit over Kendrick Lamar's 'Not Like Us.' The lawsuit claims UMG knowingly profited from false accusations against him. With the case moving forward, a key hearing is set for June 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/david-schwimmer-admits-he-didnt-have-a-great-response-to-friends-theme-song-2703565-2025-04-03",
      "headline": "David Schwimmer admits he 'didn't have a great response' to Friends theme songActor David Schwimmer opened up about his reaction to the theme song of Friends. He revealed that listening to it repeatedly took a toll on him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-cynthia-erivo-unveil-1st-wicked-for-good-trailer-at-cinemacon-glbs-2703571-2025-04-03",
      "headline": "Ariana Grande, Cynthia Erivo unveil 1st Wicked For Good trailer at CinemaConWicked For Good, the highly anticipated sequel, continues the magical saga with Cynthia Erivo and Ariana Grande. Unveiled at CinemaCon, the film picks up from the first movie's dramatic cliffhanger, diving deeper into Elphaba and Glinda's journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/where-to-watch-the-most-celebrated-val-kilmer-films-online-glbs-2703563-2025-04-03",
      "headline": "Where to watch the most celebrated Val Kilmer films onlineFrom action-packed thrillers to cult classics, Val Kilmer's legendary career spanned decades of unforgettable performances. Despite being known for his on-set challenges, his undeniable talent made every role iconic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fox-extends-family-guy-and-the-simpsons-for-four-more-seasons-glbs-2703546-2025-04-03",
      "headline": "Fox extends Family Guy and The Simpsons for four more seasonsFox has renewed The Simpsons, Family Guy, Bob's Burgers, and American Dad for four more seasons, extending the legacy of these iconic animated sitcoms. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-minecraft-movie-review-does-jason-momoas-star-power-make-it-worth-watching-glbs-2703535-2025-04-03",
      "headline": "A Minecraft Movie review: Does Jason Momoa's star power make it worth watching?Jason Momoa leads a wild adventure in A Minecraft Movie, blending video game nostalgia with Hollywood action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/reese-witherspoon-announces-legally-blonde-prequel-elle-show-in-production-2703469-2025-04-03",
      "headline": "Reese Witherspoon announces Legally Blonde prequel Elle, show in productionReese Witherspoon has confirmed the production of 'Elle', a prequel to Legally Blonde. The series will delve into the formative years of Elle Woods, portrayed by Lexi Minetree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-cameo-nani-hit-3-to-play-lead-role-in-hit-4-2703505-2025-04-03",
      "headline": "Actor Karthi to be seen in Nani's HIT 3, will headline Part 4: ReportReports are rife that actor Karthi has played a cameo role in Nani's HIT 3, which will release in theatres on May 1. An official confirmation is still awaited."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jdu-leader-mohammed-qasim-ansari-resigns-over-partys-support-to-waqf-bill-all-trust-lost-2703645-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 JDU leaders resign over party's support to Waqf bill: 'Trust of Muslims lost'Senior JD(U) leaders Mohammed Qasim Ansari and Mohammed Nawaz Malik resigned from the party over its support for the Waqf Amendment Bill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-vowing-to-oppose-first-naveen-patnaiks-party-leaves-waqf-bill-vote-to-mps-2703592-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leave it to your conscience: BJD's message to MPs on Waqf Bill vote in U-turnThe BJD has announced that its Rajya Sabha MPs will vote on the Waqf (Amendment) Bill based on their conscience, without a party whip."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-muhammad-yunus-bangladesh-seated-together-official-dinner-thailand-bimstec-summit-2703641-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi, Bangladesh's Yunus seated together at official dinner in ThailandThe seating arrangement of PM Modi and Muhammad Yunus has fuelled speculation about a possible bilateral meeting on the sidelines of BIMSTEC summit in Thailand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-jamnagar-iaf-jet-crash-pilot-siddharth-yadav-engaged-days-ago-military-family-2703636-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pilot who died in Gujarat crash got engaged 10 days ago, was to marry in NovemberOn March 23, Flight Lieutenant Siddharth Yadav got engaged, and his wedding was planned for November 2. However, a technical malfunction in the Jaguar fighter jet led to a crash, claiming the life of the 28-year-old pilot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-tabled-rajya-sabha-after-lok-sabha-pm-modi-sonia-gandhi-amit-shah-mallikarjun-kharge-2703305-2025-04-03#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Live: Mallikarjun Kharge slams Waqf bill, says legislation brought to torment minoritiesWaqf Bill In Rajya Sabha Live Updates: The Waqf (Amendment) Bill has been tabled in Rajya Sabha, a day after it was passed in Lok Sabha following a 12-hour marathon debate. The Bill was passed after all amendments moved by the opposition members were rejected by voice votes. It was passed after division of votes -- 288 in favour and 232 against. Follow indiatoday.in for more updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-live-score-today-match-updates-kolkata-2703541-2025-04-03#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "KKR vs SRH live score: Hyderabad 9 for 3 in 2.3 ov chasing 201IPL 2025, Kolkata Knight Riders (KKR) vs Sunrisers Hyderabad (SRH) Live Score: Kolkata have struck early with the ball in the second innings of the match. Travis Head, Abhishek Sharma and Ishan Kishan have been sent back early in the second innings. SRH are in deep trouble in 201 chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-kerala-catholics-back-waqf-amendment-bill-2703524-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Kerala Catholics back Waqf (Amendment) BillAt stake is the future of 600 Christian families in Munambam, a suburb in Kochi, after the State Waqf Board staked claim over their land, measuring over 400 acres"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/american-tourist-arrested-andaman-nicobar-island-north-sentinal-sentinelese-tourist-john-allen-chau-death-2703573-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The last time an American visited the restricted Andaman islands, it led to his deathAfter a tourist from the US was arrested for entering Andaman's restricted island, a look back at the 2018 tragedy when an American attempted to contact the Sentinelese."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-made-donald-trump-go-full-rhetoric-half-on-tariff-global-trade-war-why-next-india-howard-lutnick-2703615-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Recession fears? What made Trump go full on rhetoric but half on tariffUS President Donald Trump promised reciprocal tariffs, but while his rhetoric was full, the tariffs imposed seemed half-hearted. There is a reason that prevented Trump from walking the talk on tariffs. It's not a global trade war, but the fear back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/l2-empuraan-controversy-it-happens-only-in-kerala-bjp-surprise-stance-suresh-gopi-rajeev-chandrashekhar-2702890-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "It happens only in Kerala: BJP's surprise stance on Empuraan rowUnlike its usual hardline stance on rows involving right-wing sentiments or the 2002 Gujarat riots, the BJP in Kerala has taken a surprisingly measured stance in the L2: Empuraan row. This is what makes Kerala different and why the BJP is taking an unusual approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivaji-satam-journey-as-acp-pradyuman-to-end-in-cid-exclusive-2703583-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Shivaji Satam's journey as ACP Pradyuman to end in CIDVeteran actor Shivaji Satam's journey will end soon on the iconic Sony TV show CID. Satam essayed the character of ACP Pradyuman in the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/donald-trump-india-reciprocal-tariffs-opposition-congress-attacks-government-2703316-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Customer phas gaya: Congress chief's quip on Modi-Trump bonhomie amid tariffThe opposition blasted the BJP-led government as Donald Trump announced a 27% reciprocal tariff on Indian imports, citing unfair trade practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-reacts-us-donald-trump-reciprocal-tariff-carefully-examining-implications-talks-with-us-trade-team-liberation-day-2703409-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Carefully examining implications, in talks with US: India on Trump's tariffsThe statement by the Finance Ministry further revealed that discussions are underway between Indian and US trade teams to finalise a mutually beneficial, multi-sectoral Bilateral Trade Agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-supreme-court-upholding-dismissal-bengal-teachers-distorted-2703445-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not all are guilty: Mamata Banerjee on top court's ruling against 25,000 teachersMamata Banerjee questioned the blanket dismissal of nearly 25,000 teachers in Bengal, asserting that not all appointees were guilty of wrongdoing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-announces-panchayat-season-4-release-date-2703423-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Panchayat makers announce Season 4 release date on show's 5th anniversaryThe much-loved TVF series Panchayat celebrates its 5th anniversary with the announcement of Season 4, set to release in July, 2025. Prime Video marked the occasion by sharing a promotional video starring Jitendra Kumar and Jia Manek.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/myanmar-earthquake-video-man-jumps-between-collapsing-skyscrapers-to-save-family-2703498-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar earthquake video: Man jumps between collapsing skyscrapers to save familyKwon Young Jun jumped across a shattered 600ft walkway connecting the two skyscrapers soon after the devastating 7.7-magnitude earthquake struck neighbouring Thailand."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-faces-rajya-sabha-test-kiren-rijiju-seeks-oppositions-support-2703389-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Bill faces Rajya Sabha test, Kiren Rijiju says all properties for Muslims onlyThe Waqf (Amendment) Bill was tabled in the Rajya Sabha on Thursday, a day after it cleared the Lok Sabha after a 12-hour debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-maharashtras-state-fish-silver-pomfret-is-vanishing-from-meals-2703448-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Maharashtra's 'state' fish silver pomfret is vanishing from mealsOver-fishing, pollution and climate change have taken a heavy toll, pulling the annual catch down to 40 tonnes in 2024 from 1,200 tonnes four decades ago"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/matcha-the-beverage-from-japan-has-now-reached-shark-tank-india-can-it-replace-your-morning-coffee-2703052-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Japan's matcha is on Shark Tank India too. Can it replace your morning coffee?Once exclusive to Japanese households, matcha has now found its way into India's thriving wellness scene. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-fighter-jet-crash-cctv-footage-gujarat-jamnagar-2703495-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sharp dive, then fire lights up sky: Video captures IAF jet's crash in JamnagarThe CCTV footage shows the fighter jet flying crashing to the ground. Moments later, a bright explosion lights up the night sky, confirming the intensity of the impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-reciprocal-tariff-trump-inner-circle-has-fall-guy-ready-india-trade-liberation-day-howard-lutnick-who-is-he-2702864-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What if Trump's reciprocal tariff gambit fails, US has a fall guy readyUS President Donald Trump announced reciprocal tariffs on over 180 countries, including India. The additional tariffs will make imports to the US costlier. What if the entire tariff move backfires? Trump's inner circle has lined up a fall guy. And that is Commerce Secretary Howard Lutnick. This is why Lutnick suits this purpose best."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/ramayana-in-india-ramakien-in-thailand-the-epics-journey-to-the-east-2703547-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ramayana in India, Ramakien in Thailand: The epic's journey to the EastThe epic of Lord Rama, known as the Ramayana in India, travelled far beyond its homeland, finding deep cultural roots in Thailand, where it evolved into the Ramakien. More than just a retelling, the Thai version of the saga blends Hindu and Buddhist influences with local traditions, shaping a narrative uniquely its own. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-akash-deep-lucknow-super-giants-mumbai-indians-2703658-2025-04-03",
      "headline": "Lucknow pacer Akash Deep declares himself fit before Mumbai Indians clashIPL 2025, LSG vs MI: Lucknow Super Giants pacer Akash Deep said that he has recovered from his back injury and has become fit before the clash against Mumbai Indians on Friday at the Ekana Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-kamindu-mendis-ambidextrous-bowling-kolkata-2703657-2025-04-03",
      "headline": "KKR vs SRH: Kamindu Mendis creates history as 1st ambidextrous wicket-taker in IPLSRH's Kamindu Mendis created history as he became the first ambidextrous bowler in IPL to pick up a wicket in a game. Kamindu was making his debut in the contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-form-kieron-pollard-press-conference-2703644-2025-04-03",
      "headline": "Rohit Sharma has earned the right to not be pressurised: MI coach Kieron PollardMumbai Indians batting coach Kieron Pollard has backed Rohit Sharma to turnaround his poor start to the IPL 2025 season. Rohit has failed as a batter for MI in the first 3 games of the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-playing-xis-hyderabad-kamindu-mendis-pat-cummins-2703620-2025-04-03",
      "headline": "IPL 2025: SRH make two changes for KKR clash after poor start to seasonAfter a poor start to their IPL 2025 campaign, Sunrisers Hyderabad have decided to make 2 changes to their lineup for the clash against Kolkata Knight Riders on April 3 in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-eden-gardens-pitch-controversy-2703619-2025-04-03",
      "headline": "After Eden pitch controversy, KKR lay spin threat for SRH in KolkataIPL 2025: Kolkata Knight Riders laid a spin trap for SunRisers Hyderabad at the Eden Gardens. KKR's move comes after Ajinkya Rahane expressed his dissatisfaction with the wicket after the first match against RCB.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-philadelphia-76ers-confirm-knee-surgery-for-star-joel-embiid-glbs-2703589-2025-04-03",
      "headline": "NBA: Philadelphia 76ers star Joel Embiid set for Knee surgery, will be re-evaluated in six weeksThe Philadelphia 76ers have officially announced that star center Joel Embiid will undergo arthroscopic surgery next week to address lingering issues in his left knee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dorian-finney-smith-named-finalist-for-nba-sportsmanship-award-amid-strong-lakers-performance-glbs-2703591-2025-04-03",
      "headline": "Dorian Finney-Smith named finalist for NBA sportsmanship award amid strong Lakers performanceDorian Finney-Smith's impact on the Lakers earns him a spot as a finalist for the 2025 NBA Sportsmanship Award. Recognized for his defense, leadership, and three-point shooting, he joins Kyrie Irving, Shai Gilgeous-Alexander, and others in the race for the hono"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-mumbai-to-goa-switch-reasons-explained-2703587-2025-04-03",
      "headline": "Why Yashasvi Jaiswal made shocking switch from Mumbai to Goa? Reasons explained Yashasvi Jaiswal sent shockwaves in Indian cricket as the young opener decided to make the switch from Mumbai to Goa. While Jaiswal has come out with his own statement, India Today has learnt that there is more than meets the eye. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-how-will-kickoff-and-overtime-work-in-2025-glbs-2703577-2025-04-03",
      "headline": "NFL: How will kickoff and overtime work in 2025?NFL has made a few changes for the 2025 season including kickoff and overtime after implementing a one-year trial last season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-quits-ipl-2025-returns-south-africa-gujarat-titans-2703574-2025-04-03",
      "headline": "Kagiso Rabada exits IPL, flies back to South AfricaGujarat Titans fast bowler Kagiso Rabada has exited the Indian Premier League due to personal reasons. The South African fast bowler has returned home, confirmed Gujarat via a statement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-chairman-asian-cricket-council-2703560-2025-04-03",
      "headline": "PCB chairman Mohsin Naqvi appointed as new ACC presidentPakistan Cricket Board (PCB) chairman Mohsin Naqvi has replaced Shammi Silva as the new president of the Asian Cricket Council. Naqvi will assume his role from April 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dorian-finney-smith-named-finalist-for-nba-sportsmanship-award-amid-strong-lakers-performance-glbs-2703591-2025-04-03",
      "headline": "Dorian Finney-Smith named finalist for NBA sportsmanship award amid strong Lakers performanceDorian Finney-Smith's impact on the Lakers earns him a spot as a finalist for the 2025 NBA Sportsmanship Award. Recognized for his defense, leadership, and three-point shooting, he joins Kyrie Irving, Shai Gilgeous-Alexander, and others in the race for the hono"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-mumbai-to-goa-switch-reasons-explained-2703587-2025-04-03",
      "headline": "Why Yashasvi Jaiswal made shocking switch from Mumbai to Goa? Reasons explained Yashasvi Jaiswal sent shockwaves in Indian cricket as the young opener decided to make the switch from Mumbai to Goa. While Jaiswal has come out with his own statement, India Today has learnt that there is more than meets the eye. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-how-will-kickoff-and-overtime-work-in-2025-glbs-2703577-2025-04-03",
      "headline": "NFL: How will kickoff and overtime work in 2025?NFL has made a few changes for the 2025 season including kickoff and overtime after implementing a one-year trial last season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-quits-ipl-2025-returns-south-africa-gujarat-titans-2703574-2025-04-03",
      "headline": "Kagiso Rabada exits IPL, flies back to South AfricaGujarat Titans fast bowler Kagiso Rabada has exited the Indian Premier League due to personal reasons. The South African fast bowler has returned home, confirmed Gujarat via a statement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-chairman-asian-cricket-council-2703560-2025-04-03",
      "headline": "PCB chairman Mohsin Naqvi appointed as new ACC presidentPakistan Cricket Board (PCB) chairman Mohsin Naqvi has replaced Shammi Silva as the new president of the Asian Cricket Council. Naqvi will assume his role from April 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-live-score-today-match-updates-kolkata-2703541-2025-04-03",
      "headline": "KKR vs SRH live score: Hyderabad 9 for 3 in 2.3 ov chasing 201IPL 2025, Kolkata Knight Riders (KKR) vs Sunrisers Hyderabad (SRH) Live Score: Kolkata have struck early with the ball in the second innings of the match. Travis Head, Abhishek Sharma and Ishan Kishan have been sent back early in the second innings. SRH are in deep trouble in 201 chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kendrick-perkins-names-the-clippers-as-thunders-biggest-threat-glbs-2703545-2025-04-03",
      "headline": "NBA: Kendrick Perkins names the Clippers as Thunder's biggest threatThe Los Angeles Clippers are heating up at the right time, and one former NBA champion believes they are the biggest challenge for the Oklahoma City Thunder in the Western Conference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-goa-rumours-baseless-untrue-mumbai-cricket-association-2703540-2025-04-03",
      "headline": "Suryakumar Yadav to Goa rumours baseless and untrue: MCA clarify stanceMumbai Cricket Association dismissed reports of Suryakumar Yadav's switch to Goa as baseless, confirming his continued commitment to Mumbai cricket amid growing speculation. The batter previously denied the rumours in a sharp post on social media on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-ravindra-jadeja-jersey-smile-post-controversy-2703516-2025-04-03",
      "headline": "Sanjay Manjrekar wears Ravindra Jadeja's jersey No.8 with a smileFormer batter Sanjay Manjrekar wore Ravindra Jadeja's jersey No.8 'with a smile' six years after calling the Indian all-rounder a \"bits and pieces\" during the ODI World Cup in 2019. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-pat-cummins-captain-confidence-nitish-kumar-reddy-2703504-2025-04-03",
      "headline": "Captain Pat Cummins instils confidence in SRH: Nitish Kumar Reddy praisesNitish Kumar Reddy praised Pat Cummins' calm leadership as a vital factor for Sunrisers Hyderabad, expressing confidence ahead of their crucial IPL 2025 clash against Kolkata Knight Riders at Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-travis-head-on-his-love-hate-relationship-with-indian-fans-2703459-2025-04-03",
      "headline": "Head on his love-hate relationship with Indian fans: Doesn't spur me on anymoreStar Australia batter Travis Head recently opened on his love-hate relationship with the Indian fans after giving them several heart breaks with his performances over the last two years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-on-mohammed-siraj-rcb-vs-gt-2703444-2025-04-03",
      "headline": "Mohammed Siraj was hurt after Champions Trophy snub, we saw that fire: SehwagFormer India opener Virender Sehwag said that Gujarat Titans' seamer Mohammed Siraj was hurt after not being picked in India's ICC Champions Trophy 2025 squad and the fire was visible during his spell against Royal Challengers Bengaluru (RCB)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ai-predicts-winner-of-kkr-vs-srh-clash-2703429-2025-04-03",
      "headline": "IPL 2025: AI predicts winner of KKR vs SRH clashIPL 2025: As Kolkata Knight Riders (KKR) and Sunrisers Hyderabad (SRH) prepare to lock horns in Match 14 of the Indian Premier League 2025 (IPL 2025), we asked AI to predict the winner of the highly anticipated clash and got some interesting answers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-pat-cummins-captain-confidence-nitish-kumar-reddy-2703504-2025-04-03",
      "headline": "Captain Pat Cummins instils confidence in SRH: Nitish Kumar Reddy praisesNitish Kumar Reddy praised Pat Cummins' calm leadership as a vital factor for Sunrisers Hyderabad, expressing confidence ahead of their crucial IPL 2025 clash against Kolkata Knight Riders at Eden Gardens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-travis-head-on-his-love-hate-relationship-with-indian-fans-2703459-2025-04-03",
      "headline": "Head on his love-hate relationship with Indian fans: Doesn't spur me on anymoreStar Australia batter Travis Head recently opened on his love-hate relationship with the Indian fans after giving them several heart breaks with his performances over the last two years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-on-mohammed-siraj-rcb-vs-gt-2703444-2025-04-03",
      "headline": "Mohammed Siraj was hurt after Champions Trophy snub, we saw that fire: SehwagFormer India opener Virender Sehwag said that Gujarat Titans' seamer Mohammed Siraj was hurt after not being picked in India's ICC Champions Trophy 2025 squad and the fire was visible during his spell against Royal Challengers Bengaluru (RCB)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ai-predicts-winner-of-kkr-vs-srh-clash-2703429-2025-04-03",
      "headline": "IPL 2025: AI predicts winner of KKR vs SRH clashIPL 2025: As Kolkata Knight Riders (KKR) and Sunrisers Hyderabad (SRH) prepare to lock horns in Match 14 of the Indian Premier League 2025 (IPL 2025), we asked AI to predict the winner of the highly anticipated clash and got some interesting answers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-lsg-vs-mi-suryakumar-yadav-ayodhya-temple-wife-devisha-2703388-2025-04-03",
      "headline": "IPL 2025: MI star Suryakumar Yadav visits Ayodhya temple with wife DevishaSuryakumar Yadav visited the divine Ram Mandir in Ayodhya ahead of MI's clash with LSG, seeking blessings after his blistering knock against KKR at the iconic Wankhede stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-gt-sai-sudharsan-praises-sai-kishore-2703367-2025-04-03",
      "headline": "Sai Kishore's tactical preparation puts him ahead of other bowlers: Sai SudharsanGujarat Titans' Sai Sudharsan praised R Sai Kishore's pre-match preparation, calling it a major reason behind his success in the Indian Premier League 2025 (IPL 2025) so far. The left-arm spinner is the highest wicket-taker for Gujarat so far with six wickets from three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/srh-assistant-coach-ryan-cook-on-teams-aggressive-batting-kkr-vs-srh-2703341-2025-04-03",
      "headline": "Up and down performances happen when you play so aggressively: SRH Assistant CoachSunrisers Hyderabad (SRH) assistant coach Ryan Cook has said that the team is bound to have mixed performances with their all-out aggressive approach. However, they will continue to bat the same way and will look to put the bowlers under pressure"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-assistant-coach-ryan-cook-on-mohammed-shami-kkr-vs-srh-2703329-2025-04-03",
      "headline": "SRH Assistant coach backs Mohammed Shami to find his form back vs KKR in KolkataSunrisers Hyderabad (SRH) assistant coach Ryan Cook has backed their ace pacer Mohammed Shami to find his form back in the upcoming fixture against Kolkata Knight Riders (KKR) at Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-2024-final-bowlers-doom-andre-russell-mitchell-starc-2703324-2025-04-03",
      "headline": "KKR vs SRH: When Kolkata bowlers spelt doom for Hyderabad in 2024 finalKKR and SRH are set to renew their rivalry in IPL 2025 at Eden Gardens, with Kolkata aiming to repeat their 2024 final triumph, while Hyderabad seeks revenge. Both teams need momentum after a shaky start to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-match-pitch-report-weather-forecast-eden-gardens-2703296-2025-04-03",
      "headline": "KKR vs SRH, pitch, weather report IPL 2025: High-scoring thriller in Kolkata?Eden Gardens gears up for a high-octane clash as defending champions KKR take on arch-rivals SRH, aiming to avenge last season's IPL final defeat. Expect a run-fest on the spin-friendly pitch under humid Kolkata skies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-srh-match-preview-ipl-2025-kolkata-knight-riders-royal-challengers-bengaluru-2703290-2025-04-03",
      "headline": "KKR vs SRH Match Preview, IPL 2025: Kolkata take on hard-hitting Hyderabad at homeIPL 2025, Kolkata Knight Riders vs Sunrisers Hyderabad Match Preview: Having won one match early in the season, both KKR and SRH have failed to continue their winning momentum. Both teams will be eager to bounce back to winning ways as they take on each other in Match 15 of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-is-a-bcci-central-contract-grades-salary-benefits-explained-2703277-2025-04-03",
      "headline": "What is a BCCI central contract? Grades, salary, benefits explainedThe BCCI is expected to announce its annual retainership contracts in April. Shreyas Iyer is expected to make a comeback after being excluded last season. But what exactly is a BCCI contract, and how does it work? Here's a look.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-today-match-kkr-vs-srh-live-updates-buildup-2703269-2025-04-03",
      "headline": "KKR vs SRH buzz Live: Travishek, Kishan fall as KKR in controlIPL 2025 Today Match Live Updates, KKR vs SRH buzz: Kolkata Knight Riders are taking on SunRisers Hyderabad at the Eden Gardens. Here, we are keeping a track of the buzz around the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-rohit-sharma-and-the-inevitable-ravages-of-age-2703261-2025-04-03",
      "headline": "IPL 2025: MS Dhoni, Rohit Sharma and the inevitable ravages of ageMS Dhoni and Rohit Sharma stand at opposite ends of cricket's inevitable battle with time-one thriving on legacy, the other struggling against decline. As Dhoni remains a spectacle fans refuse to let go of, Rohit faces the harsh truth of fading reflexes and diminishing returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-head-coach-andy-flower-on-mohammed-siraj-rcb-vs-gt-2703250-2025-04-03",
      "headline": "We all love and rate Siraj highly, wish him all the success in the world: Andy FlowerRoyal Challengers Bengaluru (RCB) head coach Andy Flower praised Mohammed Siraj after his three-wicket haul in Match 14 of the Indian Premier League 2025 (IPL 2025). Siraj picked up 3/19 in four overs in his first outing against RCB after leaving the franchise and played a key role in Gujarat's eight wicket win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/reliance-partners-with-blast-a-game-changer-for-indian-esports-2703247-2025-04-03",
      "headline": "Reliance partners with Blast: A game-changer for Indian Esports?Reliance's partnership with BLAST could be the turning point for Indian Esports, bringing global tournaments and structured pathways for players. But with challenges in infrastructure and competition, will it truly redefine the scene?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}