{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-highe-lt-shares-rise-4-percent-india-us-trade-deal-2763608-2025-07-30",
      "headline": "Sensex closes 144 points higher, Nifty above 24,800; L&T up 4%The S&P BSE Sensex gained 143.91 points to close at 81,481.86, while the NSE Nifty50 added 33.95 points to end at 24,855.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/mb-engineering-ipo-subscription-gmp-details-review-apply-or-not-listing-gains-2763566-2025-07-30",
      "headline": "M&B Engineering IPO: Should you subscribe? Check GMP, subscription on Day 1The IPO consists of a fresh equity issue worth Rs 275 crore and an offer-for-sale (OFS) worth Rs 375 crore by the company's promoters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-government-staff-opt-for-unified-pension-scheme-low-adoption-explained-2763603-2025-07-30",
      "headline": "Only 1.35% central government staff opt for Unified Pension Scheme. Here's whyAs of July 20, 2025, only 30,989 employees have chosen UPS out of approximately 23 lakh (2.3 million) employees enrolled in NPS, marking a participation rate of just 1.35%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sumit-kumar-health-insurance-rejection-star-health-manipal-hospital-2762528-2025-07-30",
      "headline": "Admitted by the doctor, denied by the insurerWhile his wife was hospitalised, Sumit Kumar, a Pune-based business consultant, was battling paperwork, policy fine print, and silence from his insurer. This is his story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-review-price-band-good-bad-listing-latest-gmp-listing-gains-day-1-subscription-2763504-2025-07-30",
      "headline": "NSDL IPO fully booked: Should you subscribe or skip Rs 4,000 crore listing?National Securities Depository Ltd (NSDL) aims to raise Rs 4,011.60 crore through a complete offer for sale (OFS) of 5.01 crore equity shares by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-day-1-check-latest-subscription-status-gmp-and-more-2763484-2025-07-30",
      "headline": "NSDL IPO Day 1: Check latest subscription status, GMP and moreIn the grey market, NSDL's shares are commanding a premium of Rs 126, implying an estimated listing price of Rs 926—around 15.75 percent higher than the issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-ceos-salary-in-focus-amid-mass-layoff-plan-here-is-how-much-he-earns-2763478-2025-07-30",
      "headline": "TCS CEO's salary in focus amid mass layoff plan. Here's how much he earnsTCS recently confirmed it will let go of about 2% of its workforce in FY26, which translates to roughly 12,000 employees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-hiring-new-20000-jobs-freshers-it-sector-vacancy-ceo-salil-parekh-report-ai-tcs-layoff-2763457-2025-07-30",
      "headline": "Infosys to hire 20,000 freshers in 2025, focus on AI: ReportInfosys CEO said that the IT firm has made early investments in AI and training its staff. So far, the company has trained about 2.75 lakh employees at different levels in AI and related areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-3-online-filing-begins-are-you-eligible-and-what-is-new-2763419-2025-07-30",
      "headline": "ITR-3 online filing begins: Are you eligible and what's new?The Income Tax Department has kick-started online filing for ITR-3, bringing relief to taxpayers with more complex income sources. If you're wondering whether this applies to you and what's changed this year, here's everything in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-advice-newly-married-couple-five-tips-about-money-savings-2763406-2025-07-30",
      "headline": "Talk money like you talk love: Investment advisor's advice for newlywedsAn investment advisor's advice to young couples goes beyond numbers. Abhishek Kumar emphasises that financial clarity is just as essential as emotional honesty when building a strong, lasting marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gng-electronics-share-price-listing-gains-50-percent-market-debut-sell-hold-review-2763400-2025-07-30",
      "headline": "GNG Electronics shares make bumper debut at 50% premium. Sell or hold?GNG Electronics shares listed at Rs 355 apiece on the NSE. This is nearly 50% higher than the IPO price of Rs 237 per share, giving early investors a sizeable gain on debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/international-monetary-fund-imf-lifts-indias-growth-forecast-for-2025-and-2026-to-64-percent-2763396-2025-07-30",
      "headline": "IMF lifts India's growth forecast for 2025 and 2026 to 6.4%India's steady growth projection comes as a bright spot in the global economic landscape, with the IMF stressing that policy continuity, labour reforms, and infrastructure investment will be crucial going forward."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-vetri-maaran-film-not-shelved-filming-to-begin-mid-september-2763604-2025-07-30",
      "headline": "Simbu-Vetri Maaran film not shelved, film to begin shooting in mid-SeptemberVetri Maaran's upcoming film starring Silambarasan TR aka Simbu, is confirmed to start shooting in September despite rumours of shelving and financial issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jeremy-renner-hints-mcu-return-hawkeye-season-two-accident-recovery-marvel-2763539-2025-07-30",
      "headline": "Jeremy Renner hints at return in Hawkeye 2 after fatal accident: I feel strongerActor Jeremy Renner is prepared to reprise his role as Hawkeye in the MCU after recovering from fatal snowmobile accident. He made a hint at returning to future Marvel projects as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-debut-film-parineeta-set-to-re-release-in-theatres-after-20-years-2763581-2025-07-30",
      "headline": "Vidya Balan's debut film Parineeta to re-release in theatres after 20 yearsVidya Balan's iconic film 'Parineeta' is set to re-release in theatres. The film's comeback in theatres marks its 20th anniversary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-thi-reboot-episode-1-review-tulsi-cant-catch-a-break-new-episode-old-misogyny-2763538-2025-07-30",
      "headline": "Kyunki Tulsi can't catch a break. New episode, old misogyny25 years later, Tulsi still wakes up the house while Mihir goes for a jog. It seems like patriarchy doesn't just survive, but gets a glow-up in 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-anupamaa-family-drama-nostalgia-2763498-2025-07-30",
      "headline": "When Kyunki reboot gave us serious Anupamaa vibes'Kyunki Saas Bhi Kabhi Bahu Thi' reboot has premiered, starring Smriti Irani as Tulsi. Here's how the new show reminded us of Rupali Ganguly's 'Anupamaa'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-teams-up-farhan-akhtar-big-budget-action-film-excel-entertainment-2763513-2025-07-30",
      "headline": "Sunny Deol to team up with Farhan Akhtar for next action film. Details insideActor Sunny Deol is reportedly set to star in a big-budget action film backed by Farhan Akhtar's Excel Entertainment. The shooting of the film is expected to begin in December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/isha-koppikar-recalls-being-slapped-14-times-by-nagarjuna-for-a-scene-in-chandralekha-2763483-2025-07-30",
      "headline": "Isha Koppikar recalls being slapped 14 times by Nagarjuna for a scene in ChandralekhaActor Isha Koppikar opened up about shooting a challenging scene with Nagarjuna in 'Chandralekha'. Koppikar shared that she was slapped 14 times to achieve the desired emotional expression in the film."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-wife-surpiya-menon-identity-of-troll-harassing-7-years-2763555-2025-07-30",
      "headline": "Prithviraj Sukumaran's wife reveals identity of troll harassing her for 7 yearsSupriya Menon, wife of Prithviraj Sukumaran, recently called out a troll who has been repeatedly targeting her for seven years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-movie-premiere-hyderabad-fan-75-foot-cutout-2763562-2025-07-30",
      "headline": "Vijay Deverakonda gets 75-foot cutout ahead of Kingdom release. Viral picsA massive 75-foot cutout of actor Vijay Deverakonda has been erected at Sudarshan 35mm theatre in Hyderabad, stirring excitement among fans ahead of the release of the spy action drama 'Kingdom'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gong-yoo-cleared-of-harassment-accuser-sentenced-for-false-claims-2763552-2025-07-30",
      "headline": "Goblin star Gong Yoo cleared of harassment, accuser sentenced for false claimsSouth Korean actor Gong Yoo has been cleared of wrongdoing after a woman falsely accused him of harassment. The Daejeon District Court sentenced the woman to six months in prison."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rohman-shawl-shuts-down-troll-calling-him-sushmita-sen-shadow-we-shine-together-2763490-2025-07-30",
      "headline": "Rohman Shawl shuts down troll calling him Sushmita Sen's shadow: We shine togetherActor Rohman Shawl recently responded to a troll who made a remark on his relationship with ex-partner Sushmita Sen. The social media user had referred to him as a shadow of the actor-former Miss Universe.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jungkook-flaunts-chest-tattoo-physique-stuns-trainer-ma-sun-ho-2763427-2025-07-30",
      "headline": "Jungkook flaunts chest tattoo and sculpted physique, wows trainer Ma Sun-hoJungkook has returned to South Korea, most likely on July 21, the same day V is also reported to have arrived, as they continue working on group music with their BTS bandmates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanishaa-mukerji-slams-saiyaara-paid-reactions-claim-mohit-suri-ahaan-panday-aneet-padda-2763456-2025-07-30",
      "headline": "Actor Tanishaa Mukerji slams Saiyaara's paid reactions claim: It's Bollywood bashingMohit Suri's 'Saiyaara' has become a major box office hit, winning the hearts of young audiences. Actor Tanishaa Mukerji defended the film after online claims accused the makers of faking emotional reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-shares-salim-khan-early-doubts-salman-khan-stardom-2763522-2025-07-30",
      "headline": "Farah Khan shares Salim Khan's early doubts about Salman's stardomFilmmaker Farah Khan shared that Salim Khan once doubted Salman Khan's Bollywood future, much like Saqib Saleem's father did. The filmmaker shared this during a chat with Huma Qureshi and Saqib about their struggles convincing their parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoor-moving-post-on-husband-anand-ahuja-birthday-find-me-in-every-lifetime-2763506-2025-07-30",
      "headline": "Find me in every lifetime: Sonam Kapoor's moving post on husband Anand's birthdaySonam Kapoor celebrated her husband Anand Ahuja's birthday with a heartfelt social media tribute, expressing deep affection and joy he brings to her life. Anil Kapoor also wished his son-in-law on the big day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-pratap-bajwa-sara-ali-khan-boyfriend-gurudwara-visit-video-2763482-2025-07-30",
      "headline": "Who is Arjun Pratap Bajwa? All about Sara Ali Khan's companion for Gurudwara visitSara Ali Khan's recent Gurudwara visit with Arjun Pratap Bajwa in Delhi has reignited dating rumours, leaving fans curious. Arjun, an actor-musician with a political lineage, is steadily gaining attention in Bollywood circles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-and-khushi-kapoor-trolled-for-ramp-walk-at-india-couture-week-2763437-2025-07-30",
      "headline": "Sara Ali Khan and Khushi Kapoor trolled for ramp walk at India Couture WeekActors Sara Ali Khan and Khushi Kapoor faced the wrath of social media users for their ramp walk at India Couture Week. The videos of their ramp walk went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-kim-taehyung-v-teases-surprise-for-army-in-august-ahead-of-bts-2025-reunion-2763476-2025-07-30",
      "headline": "BTS' Kim Taehyung hints at surprise for ARMY in AugustBTS member V hinted at a surprise for ARMYs this August during a recent Weverse live session. His emotional openness and cryptic posts have sparked widespread fan speculation ahead of BTS' 2025 reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-telugu-debut-historical-action-film-ashwin-gangaraju-2763459-2025-07-30",
      "headline": "Rishab Shetty is a rebel with a cause in director Ashwin Gangaraju's film. Poster outActor-director Rishab Shetty has joined hands with Sithara Entertainments for a film directed by Ashwin Gangaraju. The film is set in 18th-century Bengal and promises to be a grand-scale action drama."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-earthquake-live-updates-tsunami-in-russia-after-quake-evacuations-ordered-in-japan-us-on-alert-2763325-2025-07-30",
      "headline": "Live: Tsunami hits California, over 1-foot wave recorded after powerful Russia quakeOne of the world's strongest earthquakes since 2011 struck Russia's Far East early Wednesday, with a powerful 8.8-magnitude tremor jolting the Kamchatka Peninsula and triggering tsunami alerts across the northern Pacific. The quake, the strongest in the region since 1952, was followed by intense aftershocks, with seismologists warning of further tremors up to magnitude 7.5 in the coming weeks. A tsunami wave hit North Kurilsk, flooding parts of the settlement and a local fishing facility. Evacuations were reported across Kamchatka, the Kuril Islands, and parts of Japan, while tsunami sirens sounded as far as Alaska, Hawaii, and even New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-rajya-sabha-jaishankar-modi-op-sindoor-lok-sabha-rahul-gandhi-congress-2763392-2025-07-30",
      "headline": "Live: They fired bullets, we fed them biryani, says JP Nadda on UPA terror inactionParliament Session 2025 Live Updates: As the Monsoon Session of Parliament enters its eighth day on Wednesday, the Rajya Sabha is expected to witness key interventions by senior ministers, with External Affairs Minister Dr S Jaishankar expected to open the debate on Operation Sindoor at 1 pm, followed by Leader of the House JP Nadda around 3 pm. Union Home Minister Amit Shah is also likely to deliver the concluding speech in Parliament later in the day. The expected addresses come a day after high-voltage exchanges in both Houses, where Prime Minister Narendra Modi and Amit Shah led the government's offensive on the Operation Sindoor narrative. On the Opposition front, leaders including Rahul Gandhi, Priyanka Gandhi, and Akhilesh Yadav attempted to mount a counterattack, questioning the government's handling of the India-Pakistan conflict. Stay tuned to IndiaToday.in as we bring you the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-china-tango-as-upa-gave-up-pok-jaishankars-china-guru-jibe-at-congress-2763503-2025-07-30",
      "headline": "Took tuitions from Chinese envoys: Jaishankar's 'China guru' jibe at Jairam RameshThe minister took a 'China guru' jibe at Jairam Ramesh for repeatedly making claims about China and Pakistan and highlighted how the country is today paying for the mistakes made during the Congress rule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ca-buys-helium-dies-by-suicide-dont-be-sad-death-is-most-beautiful-2763494-2025-07-30",
      "headline": "Death most beautiful: CA buys helium for Rs 3,500, dies by suicide at Delhi AirbnbThe man, identified as Dheeraj Kansal, worked at a company in Gurugram and had sourced the gas from a supplier in Ghaziabad after searching for it on IndiaMART."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-goa-homestays-for-tourists-are-on-minister-line-of-fire-covid-michael-lobo-rohan-khaunte-bnb-tourism-2762916-2025-07-30",
      "headline": "Why Goa homestays for tourists are in minister's line of fireBJP MLA Michael Lobo raised concerns in Goa Assembly about illegal homestays disrupting neighbourhoods and straining infrastructure. Tourism Minister Rohan Khaunte urged locals to report violators. The core problem lies in residential flats bought during the pandemic being misused as tourist rentals in violation of state rules."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assamese-actor-nandini-kashyap-arrested-hit-and-run-samiul-haque-death-2763596-2025-07-30",
      "headline": "Caught on CCTV: Student dies after Assam actor Nandini Kashyap hits him with SUVAssamese actor Nandini Kashyap has been arrested for a hit-and-run incident that killed 21-year-old student Samiul Haque in Guwahati. Eyewitnesses claimed the vehicle did not stop after hitting him.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-ben-stokes-injury-playing-xi-2763607-2025-07-30",
      "headline": "Ben Stokes to miss 5th Test against India as England make four changes to playing XIBen Stokes will miss the Oval Test against England due to a shoulder injury as the hosts make four changes for the match against India. Along with Stokes, Jofra Archer has also been rested for the match against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dhankhar-dhamaka-the-inside-story-of-what-forced-the-vice-president-out-2763052-2025-07-29",
      "headline": "Dhankhar dhamaka: The inside story of what forced the vice-president outAmong the reasons: an impeachment motion against a judge, purported internal dissent and some power play"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-thi-reboot-episode-1-review-tulsi-cant-catch-a-break-new-episode-old-misogyny-2763538-2025-07-30",
      "headline": "Kyunki Tulsi can't catch a break. New episode, old misogyny25 years later, Tulsi still wakes up the house while Mihir goes for a jog. It seems like patriarchy doesn't just survive, but gets a glow-up in 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sumit-kumar-health-insurance-rejection-star-health-manipal-hospital-2762528-2025-07-30",
      "headline": "Admitted by the doctor, denied by the insurerWhile his wife was hospitalised, Sumit Kumar, a Pune-based business consultant, was battling paperwork, policy fine print, and silence from his insurer. This is his story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dharmasthala-mass-burial-case-no-human-remains-found-at-first-2-sites-in-probe-sit-begins-exhumation-at-third-location-2763537-2025-07-30",
      "headline": "Another dig, another dud in Dharmasthala case: No human remains at third siteNo human remains were found at the first three sites dug up in the Dharmasthala mass burial probe. The SIT has now begun exhumation at a fourth location, as the investigation continues under close watch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/kargil-war-veteran-family-harassed-pune-police-mob-show-documents-rohingyas-2763517-2025-07-30",
      "headline": "Show documents: Kargil War veteran's family 'harassed' by mob, cops in PuneA mob of 30 to 40 unidentified men allegedly stormed a war veteran's home in Pune late at night, demanding documents and threatening to brand the family as illegal Rohingya immigrants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/chhattisgarh-government-school-teachers-fail-spell-eleven-english-words-class-viral-video-2763438-2025-07-30",
      "headline": "Chhattisgarh government school teachers fail to spell 'eleven' in class. Watch videoThe Chhattisgarh government school staff, including two teachers and the headmaster, were seen fumbling with even the most elementary questions in a viral video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-chief-electoral-officer-sir-reminder-blo-voter-list-tmc-chief-cm-mamata-banerjee-assembly-election-2763148-2025-07-30",
      "headline": "Why idea of free-fair polls in Bengal is ghorar dimAt a recent meeting, West Bengal CM Mamata Banerjee reminded block-level officers (BLOs) that they were state government employees. Bengal is the only state to have a Chief Electoral Officer's office under the Home and Hill Affairs Department. These and large-scale illegal immigration make the dream of free-fair polls in Mamata's Bengal nothing but bunkum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-ceos-salary-in-focus-amid-mass-layoff-plan-here-is-how-much-he-earns-2763478-2025-07-30",
      "headline": "TCS CEO's salary in focus amid mass layoff plan. Here's how much he earnsTCS recently confirmed it will let go of about 2% of its workforce in FY26, which translates to roughly 12,000 employees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-origin-nikhil-ravishankar-appointed-as-next-ceo-air-new-zealand-aviation-greg-foran-university-of-auckland-2763524-2025-07-30",
      "headline": "Air New Zealand names Indian-origin Nikhil Ravishankar as CEONikhil Ravishankar, an Indian-origin tech executive, has been named the next CEO of Air New Zealand, taking charge on October 20, after five years as the airline's Chief Digital Officer. His appointment comes at a time when the airline is navigating industry pressures ranging from climate change to rising costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/neeraj-chopra-self-taught-english-journey-phone-app-coaches-2763602-2025-07-30",
      "headline": "I Googled It: How Neeraj Chopra taught himself EnglishNeeraj Chopra taught himself English using a phone app and his coaches. His journey highlights how persistence and belief can break language barriers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nisar-mission-launch-live-updates-isro-nasa-earth-observation-climate-change-2763521-2025-07-30",
      "headline": "LIVE: GSLV-F16 on pad with Nisar, Isro doing final checksWhat sets today's launch apart is not just the technology, but the mission's immediate relevance to society. Data from NISAR will be open-source and near real-time, democratising access for Indian scientists, policymakers, disaster relief agencies, and farmers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-oval-fight-curator-2763337-2025-07-30",
      "headline": "Oval outrage: How much is too much from coach Gautam Gambhir?India vs England: Gautam Gambhir's public demeanour has been under intense scrutiny throughout the Test series against England. From taking a confrontational tone against journalists to a bust-up against the Oval groundstaff, how much is too much from Gambhir?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tsunami-watch-is-now-in-effect-after-magnitude-8-earthquake-struck-off-russia-us-geological-survey-glbs-2763311-2025-07-30",
      "headline": "Monster 8.8 earthquake in Russia sparks Pacific tsunami alert: Japan, US on edgeA massive 8.8-magnitude undersea quake off Russia's Kamchatka Peninsula triggered tsunami waves of up to 4 metres, prompting evacuations and alerts across Japan and several Pacific nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-thought-i-was-having-a-heart-attack-the-culprit-was-critical-iron-deficiency-vitamin-d-menopause-iron-foods-2763432-2025-07-30",
      "headline": "I thought I was having a heart attack. The culprit was critical iron deficiencyThis is how a simple blood test revealed the real cause behind months of breathlessness, chest pain, and fatigue "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/who-is-govindachami-the-convict-who-made-kannur-jailbreak-2763106-2025-07-29",
      "headline": "Who is Govindachami, the convict who made Kannur jailbreak?Serving life sentence in a 2011 rape-murder case, the one-handed convict had fled from the high-security block of the Central Prison in Kannur, only to be rearrested"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/saudi-arabian-man-slams-indigo-travel-agency-rescheduled-flight-disappears-viral-linkedin-post-2763518-2025-07-30",
      "headline": "Saudi man slams IndiGo, travel agency after rescheduled flight 'disappears'In a post on LinkedIn, a man from Saudi Arabia slammed IndiGo and a travel agency after he claimed his rescheduled flight \"disappeared\" from the system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-principal-booked-under-posco-for-raping-class-9-student-survivor-3-months-pregnant-2763422-2025-07-30",
      "headline": "Andhra school principal rapes Class 9 student, survivor 3 months pregnantA private school principal in Andhra Pradesh's Konaseema district raped a minor student. The assault surfaced after medical tests confirmed the Class 9 girl was three months pregnant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-vetri-maaran-film-not-shelved-filming-to-begin-mid-september-2763604-2025-07-30",
      "headline": "Simbu-Vetri Maaran film not shelved, film to begin shooting in mid-SeptemberVetri Maaran's upcoming film starring Silambarasan TR aka Simbu, is confirmed to start shooting in September despite rumours of shelving and financial issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jeremy-renner-hints-mcu-return-hawkeye-season-two-accident-recovery-marvel-2763539-2025-07-30",
      "headline": "Jeremy Renner hints at return in Hawkeye 2 after fatal accident: I feel strongerActor Jeremy Renner is prepared to reprise his role as Hawkeye in the MCU after recovering from fatal snowmobile accident. He made a hint at returning to future Marvel projects as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-debut-film-parineeta-set-to-re-release-in-theatres-after-20-years-2763581-2025-07-30",
      "headline": "Vidya Balan's debut film Parineeta to re-release in theatres after 20 yearsVidya Balan's iconic film 'Parineeta' is set to re-release in theatres. The film's comeback in theatres marks its 20th anniversary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-teams-up-farhan-akhtar-big-budget-action-film-excel-entertainment-2763513-2025-07-30",
      "headline": "Sunny Deol to team up with Farhan Akhtar for next action film. Details insideActor Sunny Deol is reportedly set to star in a big-budget action film backed by Farhan Akhtar's Excel Entertainment. The shooting of the film is expected to begin in December. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-ben-stokes-injury-playing-xi-2763607-2025-07-30",
      "headline": "Ben Stokes to miss 5th Test against India as England make four changes to playing XIBen Stokes will miss the Oval Test against England due to a shoulder injury as the hosts make four changes for the match against India. Along with Stokes, Jofra Archer has also been rested for the match against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-luis-diaz-moves-to-bayern-munich-from-liverpool-2763590-2025-07-30",
      "headline": "Bayern Munich announce the signing of Luis Diaz from LiverpoolBayern Munich have announced the signing of Luis Diaz from Liverpool on Wednesday, July 30. Diaz joins Bayern on a four-year deal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-rankings-abhishek-sharma-no1-t20i-batter-travis-head-2763549-2025-07-30",
      "headline": "Abhishek dethrones SRH buddy Head to become No.1 ranked T20I batterAbhishek Sharma dethroned his Sunrisers Hyderabad opening partner Travis Head to become the No.1 ranked T20I batter in the latest ICC rankings on Wednesday, July 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bharat-arun-bowling-coach-kkr-to-lsg-2763534-2025-07-30",
      "headline": "LSG rope in Bharat Arun as bowling coach amidst KKR restructure: ReportFormer India bowling coach Bharat Arun has joined Lucknow Super Giants, reported Cricbuzz on Wedneday, July 30. Arun leaves Kolkata Knight Riders, where he had served since the 2022 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-ravindra-jadeja-batting-role-sanjay-bangar-2763531-2025-07-30",
      "headline": "Jadeja at No.5? Sanjay Bangar on all-rounder's batting role in Indian teamSanjay Bangar feels that India can use Ravindra Jadeja as a pure batter in the side and use him in the No.5 role during the Oval Test. Jadeja has been one a golden run with the bat during the ongoing series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-rested-5th-test-india-england-series-2763462-2025-07-30",
      "headline": "India unlikely to risk Bumrah at Oval as medical staff advises rest: ReportIndia are unlikely to play Jasprit Bumrah in the fifth Test against England. The BCCI medical team wants to manage his workload and protect him as a longterm asset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-gautam-gambhir-lee-fortis-spat-r-ashwin-2763463-2025-07-30",
      "headline": "England have given serious advantage to India: Ashwin on Gambhir vs Oval curatorR Ashwin feels that the spat between Gautam Gambhir and Oval pitch curator Lee Fortis has given India a serious advantage heading into the final Test of the series. Gambhir and Fortis had a war of words on July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wcl-india-vs-pakistan-australia-john-hastings-wides-video-2763412-2025-07-30",
      "headline": "Watch: Australia pacer bowls 18 balls in single over, including 12 widesWCL 2025: Australia lost to Pakistan by 10 wickets in their final match of WCL group-stage. Pacer John Hastings bowled an 18-ball over, where he gave away 12 wides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-curator-spat-gautam-gambhir-aakash-chopra-2763409-2025-07-30",
      "headline": "Find it humiliating: Aakash Chopra slams Oval pitch curator for double standardsFormer cricketer Aakash Chopra criticised Oval pitch curator Lee Fortis over his double standards during a spat with Indian coach Gautam Gambhir. The Indian coach had a war of words with Fortis on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-stats-preview-shubman-gill-2763386-2025-07-30",
      "headline": "Shubman Gill eyes Sunil Gavaskar's 54-year-old India record: Stats PreviewENG vs IND: Shubman Gill is on the verge of several milestones in his career going into India's fifth and final Test against England, starting July 31 at the Old Trafford in Manchester. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-rested-5th-test-india-england-series-2763462-2025-07-30",
      "headline": "India unlikely to risk Bumrah at Oval as medical staff advises rest: ReportIndia are unlikely to play Jasprit Bumrah in the fifth Test against England. The BCCI medical team wants to manage his workload and protect him as a longterm asset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-gautam-gambhir-lee-fortis-spat-r-ashwin-2763463-2025-07-30",
      "headline": "England have given serious advantage to India: Ashwin on Gambhir vs Oval curatorR Ashwin feels that the spat between Gautam Gambhir and Oval pitch curator Lee Fortis has given India a serious advantage heading into the final Test of the series. Gambhir and Fortis had a war of words on July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wcl-india-vs-pakistan-australia-john-hastings-wides-video-2763412-2025-07-30",
      "headline": "Watch: Australia pacer bowls 18 balls in single over, including 12 widesWCL 2025: Australia lost to Pakistan by 10 wickets in their final match of WCL group-stage. Pacer John Hastings bowled an 18-ball over, where he gave away 12 wides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-pitch-curator-spat-gautam-gambhir-aakash-chopra-2763409-2025-07-30",
      "headline": "Find it humiliating: Aakash Chopra slams Oval pitch curator for double standardsFormer cricketer Aakash Chopra criticised Oval pitch curator Lee Fortis over his double standards during a spat with Indian coach Gautam Gambhir. The Indian coach had a war of words with Fortis on Tuesday, July 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-stats-preview-shubman-gill-2763386-2025-07-30",
      "headline": "Shubman Gill eyes Sunil Gavaskar's 54-year-old India record: Stats PreviewENG vs IND: Shubman Gill is on the verge of several milestones in his career going into India's fifth and final Test against England, starting July 31 at the Old Trafford in Manchester. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}