{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-bankim-brahmbhatt-indian-origin-ceo-blackrock-loan-fraud-united-states-2811790-2025-11-01",
      "headline": "The 'missing' Indian-origin CEO behind Rs 4,200 crore BlackRock loan fraudBankim Brahmbhatt, the Indian-origin CEO of a US-based telecom company, is facing a lawsuit in the US filed by HPS, the private credit investment arm of BlackRock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-shine-again-after-slow-start-will-they-continue-to-rise-2811504-2025-11-01",
      "headline": "Gold and silver shine again after slow start. Will they continue to rise?After a dull opening, both gold and silver managed to regain some shine during the day. Will the upward trend continue?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-links-anil-ambani-rana-kapoor-in-rs-2796-crore-yes-bank-loss-case-2811693-2025-11-01",
      "headline": "CBI links Anil Ambani, Rana Kapoor in Rs 2,796-crore Yes Bank loss caseThe CBI has accused industrialist Anil Ambani of approving favours to Yes Bank founder Rana Kapoor's family, causing huge financial losses to the bank. This development highlights alleged corruption and risky investments linked to Ambani's companies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-466-points-nifty-below-25750-bel-jumps-4-2811380-2025-10-31",
      "headline": "Sensex, Nifty continue losing streak amid profit booking; BEL jumps 4%The S&P BSE Sensex closed 465.75 points lower at 83,938.71, while the NSE Nifty50 fell 155.75 points to 25,722.10. Selling pressure was broad-based, with most sectoral indices ending in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-crosses-full-subscription-on-day-1-qibs-drive-demand-2811374-2025-10-31",
      "headline": "Lenskart IPO crosses full subscription on Day 1; QIBs drive demandThe IPO opened today and closes on November 4. Lenskart has set a price band of Rs 382 to Rs 402 per share, with a lot size of 37 shares for retail bidders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-leads-indias-crypto-investments-in-q3-2025-report-2811359-2025-10-31",
      "headline": "Gen Z leads India's crypto investments in Q3 2025: ReportThe 18–25 age group has officially overtaken the 26–35 bracket as the most active investors in crypto. For them, digital assets are no longer a risky experiment — they're becoming part of a serious investment plan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/from-groww-to-icici-amc-key-ipos-to-watch-this-november-2025-2811333-2025-10-31",
      "headline": "From Groww to ICICI AMC: Key IPOs to watch this November 2025Bengaluru-based investing platform Groww is set to launch its IPO worth Rs 6,632.3 crore. The issue includes a fresh issue of Rs 1,060 crore and an offer for sale of Rs 5,572.3 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/5x-income-rule-first-home-loan-affordability-2811330-2025-10-31",
      "headline": "Buying your first house? Check the 5x annual income rule and avoid EMI trapA rising number of first-time buyers are running the affordability math more cautiously. From the 5X income rule to avoiding EMI strain, housing decisions are shifting toward sustainability rather than stretch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hni-india-rebrands-as-kokuyo-workplace-india-targets-leadership-in-asia-by-2030-2811280-2025-10-31",
      "headline": "HNI India rebrands as Kokuyo Workplace India, targets leadership in Asia by 2030The rebranding marks a key step in Kokuyo's plan to make India a central hub for its Asia-Pacific operations. The move comes after Kokuyo's acquisition of HNI India earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-crisis-employees-letter-salaries-unpaid-beer-cafe-investors-2811262-2025-10-31",
      "headline": "Employees unpaid, control slipping: Bira 91's bad hangoverThe taps are dry, employees unpaid, and investors have taken charge. The question isn't how Bira 91 got here anymore. It's whether it can get out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-loan-vs-gold-overdraft-which-one-truly-saves-you-money-2811260-2025-10-31",
      "headline": "Gold loan vs gold overdraft: Which one truly saves you money?Gold loans and gold overdrafts both help unlock the value of your jewellery when you need cash fast. But they don't work the same way — and one could quietly cost you more than you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-aadhaar-to-bank-rules-7-key-financial-changes-starting-november-1-2811219-2025-10-31",
      "headline": "From Aadhaar to bank rules: 7 key financial changes starting November 1As November begins, a fresh set of financial rules will come into effect that could impact your daily money matters. From Aadhaar updates and bank nomination changes to new GST slabs and card fees — here's a quick look at what's changing from November 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/air-india-seeks-rs-10000-crore-support-from-tata-singapore-airlines-after-crash-report-2811203-2025-10-31",
      "headline": "Air India seeks Rs 10,000 crore lifeline from Tata, SIA after crash: ReportThe request comes at a sensitive moment for the airline, which has been trying to rebuild its reputation, modernise its ageing fleet and streamline operations since being taken over by the Tata Group in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/meta-plans-record-30-billion-bond-sale-to-fund-costly-ai-push-2811194-2025-10-31",
      "headline": "Meta plans record $30 billion bond sale to stay ahead in AI rcaseThe move comes as Meta signals that its capital expenditure in 2026 will be \"notably larger\" than next year, underscoring how aggressively it is investing to stay ahead in the AI race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-2025-gmp-latest-price-band-and-should-you-apply-2811181-2025-10-31",
      "headline": "Lenskart IPO opens: Check GMP, price band, and should you apply?The total issue size is about Rs 7,278 crore, of which roughly Rs 2,150 crore is a fresh issue, while the rest is an offer for sale by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-future-outlook-precious-metals-volatility-rates-in-india-world-2811180-2025-10-31",
      "headline": "Gold prices shaky, silver steady. What next for precious metals?Gold is wobbling as the dollar strengthens, while silver holds firm on industrial demand cues. With central banks still buying and the Fed unpredictable, where do precious metals go next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-flat-in-volatile-trade-ntpc-falls-over-25-2811165-2025-10-31",
      "headline": "Sensex, Nifty open flat in volatile trade; NTPC, Cipla among top losersAt around 9:24 am, the S&P BSE Sensex was up just 21.15 points at 84,425.61, while the NSE Nifty50 edged higher by 7.35 points to 25,885.20. Broader market indices also hovered marginally higher, mirroring the lack of conviction at the headline level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-remain-stable-will-prices-gain-after-us-fed-rate-cut-2810903-2025-10-31",
      "headline": "Gold and silver prices remain stable: Will prices gain after US Fed rate cut?Gold and silver prices steadied on Thursday after a choppy start, as investors weighed the impact of the US Federal Reserve's latest rate cut and awaited further clarity on global economic cues."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/one-year-of-singham-again-arjun-kapoor-celebrates-love-for-danger-lanka-2811907-2025-11-01",
      "headline": "One year of Singham Again: Arjun Kapoor celebrates love for Danger Lanka Actor Arjun Kapoor reflected on his experience playing Danger Lanka in 'Singham Again' as the film completed a year of release. He expressed his gratitude to director Rohit Shetty, the cast, and the audience with a special post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/peddi-janhvi-kapoor-first-look-poster-ram-charan-2811914-2025-11-01",
      "headline": "Janhvi Kapoor turns Achiyyamma for Ram Charan's Peddi. Poster out The first look poster of Janhvi Kapoor from the much-anticipated film 'Peddi' has been released. The film, directed by Buchi Babu Sana and featuring Ram Charan, is set for release on March 27, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-the-epic-release-sparks-fan-frenzy-scenes-recreated-in-theatres-2811884-2025-11-01",
      "headline": "Baahubali: The Epic release sparks fan frenzy, scenes recreated in theatres As SS Rajamouli's 'Baahubali: The Epic' hit theatres, audiences recreated some of the memorable scenes in theatres. The videos of their enthusiastic re-creations are now taking social media by storm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-reluctant-traveller-season-3-review-eugene-levy-proves-adventure-has-no-age-limit-2811865-2025-11-01",
      "headline": "The Reluctant Traveller S3 review: Eugene Levy charms with wit and wanderlustRelease Date:Fri Oct 31, 2025 Actor Eugene Levy embraces adventure in the third season of 'The Reluctant Traveller'. The series blends humour and heartfelt moments as Levy explores diverse cultures worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-begins-shooting-549th-film-with-sooraj-barjatya-2811825-2025-11-01",
      "headline": "Anupam Kher teams up with Sooraj Barjatya for his 549th film, watch video Veteran actor Anupam Kher begins work on his 549th film, teaming up once again with acclaimed filmmaker Sooraj Barjatya. The announcement signifies a major milestone in Kher's extensive cinematic career and his longstanding association with Barjatya and Rajshri Films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/taecyeon-marry-longtime-girlfriend-private-seoul-wedding-next-spring-2811802-2025-11-01",
      "headline": "2PM's Taecyeon announces wedding plans with longtime girlfriend Taecyeon, a member of the South Korean group 2PM, will marry his longtime partner in a private ceremony in Seoul next spring, according to his agency 51K. The announcement comes after the couple was seen together in Paris earlier this year and has opted for a ceremony attended only by close friends and family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tremembe-series-review-a-quiet-unsettling-look-inside-brazil-most-notorious-prison-2811747-2025-11-01",
      "headline": "Tremembe review: A quiet, unsettling look inside Brazil's most notorious prisonRelease Date:Fri Oct 31, 2025 'Tremembe' is a powerful Brazilian drama about life inside a high-security prison, showing what happens after the crimes are forgotten. With strong performances and realistic storytelling, it's a gripping watch about guilt, power, and survival."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-karur-stampede-responsibility-upcoming-film-adhik-ravichandran-2811795-2025-11-01",
      "headline": "Ajith Kumar reacts to Karur stampede, says society shares the blame Actor Ajith Kumar comments on the September Karur stampede, emphasising societal responsibility and addressing the culture of gatherings. He also discusses upcoming projects with director Adhik Ravichandran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/diljit-dosanjh-supports-punjab-flood-victims-kaun-banega-crorepati-17-2811786-2025-11-01",
      "headline": "KBC 17: Can you answer the question that stumped Diljit Dosanjh? Singer Diljit Dosanjh impresses on 'Kaun Banega Crorepati 17', securing Rs 50 lakh for Punjab flood victims and responding thoughtfully to questions from host Amitabh Bachchan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-truth-bomb-on-bollywood-burnout-reignites-talk-on-fairer-shifts-2811607-2025-11-01",
      "headline": "Deepika Padukone's 8-hour stand: Can Bollywood agree on an ideal work culture? Deepika Padukone's call for an 8-hour workday has sparked a conversation. But can an industry obsessed with success arrive at a consensus over work ethics?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/do-bigha-zameen-balraj-sahni-journey-from-privilege-to-the-heart-of-india-struggle-2811761-2025-11-01",
      "headline": "Do Bigha Zameen: Balraj Sahni's journey from privilege to the heart of India's struggle Bimal Roy's 'Do Bigha Zameen' (1953) redefined Indian cinema, transforming Balraj Sahni into the voice of India's struggling poor — a timeless story of dignity, loss and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-revives-iconic-rk-studios-to-preserve-family-legacy-and-boost-mumbai-film-industry-2811739-2025-11-01",
      "headline": "Ranbir Kapoor to relaunch RK Studios with his directorial debut: Report Bollywood actor Ranbir Kapoor is preparing to relaunch the historic RK Studios, with plans for his directorial debut and collaborations involving top industry figures. The move marks a continuation of his family's cinematic legacy and aims to re-establish RK Studios as a creative force in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-directorial-debut-the-bads-of-bollywood-features-rajat-bedi-star-studded-cast-netflix-2811731-2025-11-01",
      "headline": "Farah Khan says Aryan Khan was obsessed with Rajat Bedi since childhood Farah Khan has spoken about Aryan Khan's decision to include Rajat Bedi in his first web series as a director, highlighting the personal connection and professional opportunity involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mass-jathara-review-old-formula-fresh-energy-and-ravi-teja-back-in-rhythm-2811684-2025-11-01",
      "headline": "Mass Jathara review: Old formula, fresh energy, and Ravi Teja back in rhythmRelease Date:Sat Nov 01, 2025 'Mass Jathara' isn't trying to fix the mass commercial template, it's embracing it. Ravi Teja headlines a celebration of entertainment and nostalgia where every whistle, punchline, and throwback moment feels intentional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-security-assessed-khalistani-threats-diljit-dosanjh-kaun-banega-crorepati-2811719-2025-11-01",
      "headline": "Central agencies assess threat to Amitabh Bachchan post Diljit meeting Agencies are evaluating security for Amitabh Bachchan following threats from Sikh separatist groups after his televised interaction with Diljit Dosanjh, as concerns rise over the safety of both public figures and upcoming events abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-stars-ambani-jamnagar-halloween-party-creative-costumes-2811713-2025-11-01",
      "headline": "Halloween 2025: Alia and Deepika unite as Nita Ambani channels Audrey Hepburn Bollywood stars marked Halloween 2025 with an elaborate celebration in Jamnagar, featuring high-profile guests and creative costumes. Notable appearances included Alia Bhatt as Lara Croft, Deepika Padukone as Lady Singham, and Nita Ambani as Audrey Hepburn, with fans and celebrities alike praising the standout looks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-epic-remastered-women-architects-kingdom-fate-ss-rajamouli-prabhas-anushka-shetty-ramya-krishnan-2811433-2025-11-01",
      "headline": "Baahubali The Epic is much more than tale of two brothers, it has women at its core SS Rajamouli's 'Baahubali: The Epic', though it is centred on Prabhas and Rana Daggubati, it is the women in their lives who call the shots. With the re-mastered film hitting the screens on October 31, the film yet again places focus on the women of Mahishmati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-celebrates-thamma-success-kids-are-my-best-critics-rashmika-mandanna-2811669-2025-10-31",
      "headline": "Ayushmann Khurrana celebrates Thamma's success: Kids are my best critics In an exclusive interaction with India Today, actor Ayushman Khurrana spoke about how his latest release 'Thamma' won the hearts of his children and became their favourite. The film also starring Rashmika Mandanna, released in theatres on October 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-malik-lashes-out-malti-chahar-after-she-calls-him-gutter-2811667-2025-10-31",
      "headline": "BB 19 Episode 69: Amaal Malik lashes out at Malti after she calls him gutter In the latest episode of 'Bigg Boss 19', Amaal Malik locks horns with Malti Chahar after she called him a gutter. On the other hand, Pranit More was declared the new captain of the house.  "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/venkateswara-swamy-temple-stampede-andhra-pradesh-reactions-opposition-chandrababu-naidu-2811815-2025-11-01",
      "headline": "Private temple, no permission: Andhra CM blames organisers after stampede kills 10Andhra Pradesh Chief Minister expressed deep sorrow over the tragic incident that claimed ten lives at the Venkateswara Swamy Temple on Saturday morning. He said that the event organisers did not inform authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-hostage-crisis-rohit-arya-controversial-past-rent-dispute-erratic-behaviour-2811721-2025-11-01",
      "headline": "Skeletons tumble out: Mumbai hostage-taker's rental dispute, erratic behaviourRohit Arya, who held 17 children hostage at a Powai studio in Mumbai, has a controversial past. The 38-year-old was shot dead by police during the rescue operation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jd-vance-erika-kirk-viral-intimate-hug-usha-vance-divorce-speculation-theories-2811844-2025-11-01",
      "headline": "See similarities of husband in JD: Erika Kirk's mushy hug with Vance sparks buzzWhat turned heads at the Turning Point USA event was the intimate hug between JD Vance and Erika Kirk, the widow of Trump aide Charlie Kirk, and her glowing words for the vice president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hyderabad-airport-bomb-threat-email-linked-to-ltte-isi-operatives-indigo-flight-diverted-2811911-2025-11-01",
      "headline": "Bomb threat to Hyderabad airport linked to LTTE-ISI a hoax, IndiGo flight divertedThe Airport Operations Control Center received an alert regarding a threat email sent to the facility's customer support account at around 5.25 am on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/when-delaying-divorce-becomes-a-strategy-for-the-childs-education-2811339-2025-11-01",
      "headline": "Why Indian parents delay divorce until kids are 'old enough'Parents often make an unspoken pact: hold on until the child finishes Class 10 or 12.  On paper, it sounds noble and selfless - but children still sense the emotional shutdown at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-cleared-delhi-cloud-seeding-plan-after-experts-said-not-feasible-2811675-2025-11-01",
      "headline": "Who cleared a Rs 34-crore cloud seeding plan after experts said 'not feasible'?Three expert agencies advised against it. Delhi did it anyway, spending Rs 34 crore of public money on a winter cloud seeding experiment that produced no rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/work-permit-h1b-civic-test-three-changes-two-months-by-us-trump-administration-will-hit-indians-in-america-hard-here-is-how-2811876-2025-11-01",
      "headline": "Work permit, H-1B, Civic Test: 3 changes in 2 months by US will hit Indians hardThe US has changed work permit rules overnight, doing away with automatic extension of certain Employment Authorisation Documents (EADs). Earlier, the Trump administration hiked annual H-1B visa fees and mandated stricter scrutiny for Green Card holders seeking US citizenship. These three moves in two months will hit Indians hard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/india-rohan-bopanna-retirement-professional-tennis-2811849-2025-11-01",
      "headline": "Goodbye, but not the end: Rohan Bopanna, 2-time Grand Slam champion, retiresIndian tennis icon Rohan Bopanna has officially announced his retirement from professional tennis, bringing to a close a remarkable career that spanned over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-vance-usha-vance-conversion-remark-row-hindu-american-foundation-2811843-2025-11-01",
      "headline": "Why not engage with Hinduism too? Hindu body jabs Vance over wife's faith remarkThe Hindu American Foundation criticised Vice President JD Vance's remarks on his wife Usha Vance's faith, urging him to respect the rights of Hindus to practice. JD Vance had hoped that his wife would convert to Christianity one day, sparking a huge backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-tickets-where-to-buy-2811765-2025-11-01",
      "headline": "Where are the tickets? Fans hit out at BCCI over final's ticketsWomen's World Cup: The India vs South Africa final is on Sunday, November 2. However, the tickets for the match were closed off. Frustrated fans have hit out at the BCCI over logistical issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/what-triggered-deadly-stampede-at-andhras-venkateswara-swamy-temple-that-killed-9-2811803-2025-11-01",
      "headline": "What triggered stampede at Andhra's Venkateswara Swamy Temple? Glaring lapses exposedThe stampede occurred as a large crowd gathered at the temple on the occasion of Ekadashi, Andhra Chief Minister's Office said in a statement. Overcrowding because of the heavy rush led to the tragic incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/do-bigha-zameen-balraj-sahni-journey-from-privilege-to-the-heart-of-india-struggle-2811761-2025-11-01",
      "headline": "Do Bigha Zameen: Balraj Sahni's journey from privilege to the heart of India's struggleBimal Roy's 'Do Bigha Zameen' (1953) redefined Indian cinema, transforming Balraj Sahni into the voice of India's struggling poor — a timeless story of dignity, loss and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/china-influencers-need-degrees-could-that-work-in-india-2811909-2025-11-01",
      "headline": "China now requires influencers to have degrees. Could that work in India?Anyone can advise millions online if they have the follower count. China's new law makes influencers hold formal qualifications before giving advice on health, law, education or finance. Should India follow suit? What would be the risks and benefits? And how would it play out locally?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-air-pollution-biggest-killer-deaths-data-air-quality-2811822-2025-11-01",
      "headline": "Toxic air Delhi's biggest killer: 1 in 7 deaths linked to pollution in 2023Deaths due to particulate matter pollution have remained persistently high in Delhi, more often than not exceeding those caused by hypertension or diabetes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/why-lawrence-bishnoi-gang-upping-the-ante-canada-surrey-shooting-businessman-punjabi-singer-india-kapil-sharma-2810673-2025-11-01",
      "headline": "Why Bishnoi Gang is upping the ante in Canada?Even though Lawrence Bishnoi is in a jail in India, his gang has gone berserk in Canada. From shootings at Kapil Sharma's Kap's Cafe and a Punjabi singer's residence to killing an Indian-origin businessman, the Bishnoi Gang is asserting its deadly presence in Canada. But what's behind its latest spree of violence in Canada?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-truth-bomb-on-bollywood-burnout-reignites-talk-on-fairer-shifts-2811607-2025-11-01",
      "headline": "Deepika Padukone's 8-hour stand: Can Bollywood agree on an ideal work culture?Deepika Padukone's call for an 8-hour workday has sparked a conversation. But can an industry obsessed with success arrive at a consensus over work ethics?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-538-01-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/australian-woman-stuck-in-traffic-praises-indian-uber-driver-for-sweet-gesture-viral-video-2811828-2025-11-01",
      "headline": "Video: Australian woman stuck in traffic praises Indian Uber driver for sweet gestureAn Australian woman shared a touching experience with her Indian Uber driver during Chhath Puja traffic, where she was stuck for two hours. She applauded his kind gesture, which won hearts on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/south-delhi-luxury-property-rise-colonial-planning-elite-zones-2811394-2025-11-01",
      "headline": "I am from South Delhi – why is the south side of every city posh?South side neighbourhoods in major Indian metros have long been associated with wealth and prestige. This status stems from deliberate colonial planning and continues to influence property values and urban identity today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bachchu-kadu-nagpur-stir-brings-agrarian-agenda-back-to-maharashtra-politics-2811816-2025-11-01",
      "headline": "Bachchu Kadu's Nagpur stir brings agrarian agenda back to Maharashtra politicsThe agitation has brought the farmers' issues to the forefront of Maharashtra's politics, stuck in the quagmire of communal discourse aimed at diverting people's attention from real issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/indian-railways-to-launch-4-new-vande-bharat-trains-on-key-routes-2811863-2025-11-01",
      "headline": "Indian Railways to launch 4 new Vande Bharat trains on key routesIndian Railways is set to introduce four additional Vande Bharat Express trains, expanding the network and improving connectivity across several states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tejashwi-yadav-multiple-deputy-chief-ministers-muslim-dalit-representation-in-bihar-rjd-jdu-nitish-kumar-nda-india-bloc-2811895-2025-11-01",
      "headline": "Tejashwi Yadav confirms multiple Deputy CMs in Bihar, also from Muslim communityRJD leader and Opposition Chief Minister candidate Tejashwi Yadav confirmed in an India Today interview that the Mahagathbandhan will have multiple Deputy Chief Ministers, including one from the Muslim community, if it comes to power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/bjp-dividing-people-by-religion-states-language-kanimozhi-hits-out-at-pm-modi-2811922-2025-11-01",
      "headline": "BJP dividing people by religion, states, languages: Kanimozhi hits out at PM ModiDMK MP Kanimozhi accused Prime Minister Narendra Modi and the BJP of dividing people along lines of religion, language, and state for electoral gain. She said the party's politics has always been \"divisive,\" contrasting it with Tamil Nadu's record of treating migrants peacefully and with unity."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-south-africa-final-harmanpreet-kaur-focus-on-small-wins-2811943-2025-11-01",
      "headline": "Chase small wins: Harmanpreet Kaur's mantra to curb pressure in home World Cup final Under immense home pressure, India captain Harmanpreet Kaur urges her team to stay calm, focus on small goals, and enjoy the biggest moment of their careers as they take on South Africa in the Women's World Cup final at a packed DY Patil Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-3rd-t20i-predicted-xi-arshdeep-singh-axar-patel-2811933-2025-11-01",
      "headline": "India vs Australia, 3rd T20I Predicted XI: Will Arshdeep finally get a chance? India vs Australia, 3rd T20I Predicted XI: India could make at least one change to their playing XI for the third T20I against Australia at the Bellerive Oval in Hobart on Sunday. With conditions expected to favour seamers, the team management might finally hand a game to Arshdeep Singh, whose exclusion so far has raised eyebrows."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-india-vs-south-africa-final-rain-reserve-day-rules-2811925-2025-11-01",
      "headline": "Women's World Cup: What happens if rain washes out India vs South Africa final? India and South Africa will battle for the ICC Women's World Cup 2025 title on November 2 at Navi Mumbai. However, rain could spoil the party for both teams in the all-important encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rohan-bopanna-retires-oldest-grand-slam-masters-winner-indian-tennis-2811928-2025-11-01",
      "headline": "Rohan Bopanna bids goodbye to professional tennis: Glorious career in numbers Rohan Bopanna, one of India's most enduring tennis icons, has announced his retirement at 45, ending a remarkable two-decade career defined by passion and perseverance. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-womens-world-cup-final-live-streaming-predicted-xis-pitch-weather-report-2811917-2025-11-01",
      "headline": "India vs South Africa: DY Patil pitch report, Navi Mumbai weather forecast India vs South Africa, Women's World Cup Final: In a clash to crown a new champion, India and South Africa will lock horns in a historic final at the DY Patil Stadium in Navi Mumbai on Sunday. Here's everything you need to know about the title clash on November 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunidhi-chauhan-icc-womens-world-cup-2025-final-mid-innings-show-navi-mumbai-2811913-2025-11-01",
      "headline": "Sunidhi Chauhan to perform at mid-innings break in Women's World Cup final Indian music powerhouse Sunidhi Chauhan will light up the ICC Women's World Cup 2025 final between India and South Africa in Navi Mumbai with a high-octane mid-innings performance. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-plans-reward-india-women-world-cup-2025-final-equal-pay-news-2811905-2025-11-01",
      "headline": "BCCI tipped to match men's Rs 125 crore reward if India win Women's World Cup: Report The BCCI is reportedly planning a cash reward for the Indian women's cricket team if they win the 2025 Women's ODI World Cup, with discussions underway to match the Rs 125 crore prize given to the men's team after their 2024 T20 World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erling-haaland-manchester-city-halloween-2811898-2025-11-01",
      "headline": "Halloween special: Haaland walks streets of Manchester dressed as the joker Manchester City's Erling Haaland celebrated Halloween in style. He dressed up as The Joker from the Batman movies and went around the streets of Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-final-womens-world-cup-2811888-2025-11-01",
      "headline": "Stars are aligned for India to win Women's World Cup final: Dinesh Karthik Stars are aligned for India to win the Women's ODI World Cup, believes former cricketer Dinesh Karthik. The Women's World Cup is set to crown a new ODI champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-whitewash-england-3-0-odi-series-top-order-struggles-ashes-2811875-2025-11-01",
      "headline": "England's ODI slide continues as New Zealand seal 3-0 series sweep New Zealand skittled England's top order on their way to a nervy two-wicket win in the third one-day international in Wellington, completing a 3-0 series sweep and sending the tourists to Australia with serious questions over their batting form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-team-historic-icc-womens-world-cup-2025-title-record-prize-money-2811851-2025-11-01",
      "headline": "Women's World Cup Prize Money: How much money will winners and runners-up earn? The ICC Women's Cricket World Cup 2025 final brings unprecedented prize money, awarding Rs 37.3 crore to the winners and Rs 18.6 crore to the runners-up as part of a landmark pay parity initiative. This record payout marks a major step towards gender equality in cricket and surpasses the prize pools of previous men's and women's tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-plans-reward-india-women-world-cup-2025-final-equal-pay-news-2811905-2025-11-01",
      "headline": "BCCI tipped to match men's Rs 125 crore reward if India win Women's World Cup: Report The BCCI is reportedly planning a cash reward for the Indian women's cricket team if they win the 2025 Women's ODI World Cup, with discussions underway to match the Rs 125 crore prize given to the men's team after their 2024 T20 World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erling-haaland-manchester-city-halloween-2811898-2025-11-01",
      "headline": "Halloween special: Haaland walks streets of Manchester dressed as the joker Manchester City's Erling Haaland celebrated Halloween in style. He dressed up as The Joker from the Batman movies and went around the streets of Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-final-womens-world-cup-2811888-2025-11-01",
      "headline": "Stars are aligned for India to win Women's World Cup final: Dinesh Karthik Stars are aligned for India to win the Women's ODI World Cup, believes former cricketer Dinesh Karthik. The Women's World Cup is set to crown a new ODI champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-whitewash-england-3-0-odi-series-top-order-struggles-ashes-2811875-2025-11-01",
      "headline": "England's ODI slide continues as New Zealand seal 3-0 series sweep New Zealand skittled England's top order on their way to a nervy two-wicket win in the third one-day international in Wellington, completing a 3-0 series sweep and sending the tourists to Australia with serious questions over their batting form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-team-historic-icc-womens-world-cup-2025-title-record-prize-money-2811851-2025-11-01",
      "headline": "Women's World Cup Prize Money: How much money will winners and runners-up earn? The ICC Women's Cricket World Cup 2025 final brings unprecedented prize money, awarding Rs 37.3 crore to the winners and Rs 18.6 crore to the runners-up as part of a landmark pay parity initiative. This record payout marks a major step towards gender equality in cricket and surpasses the prize pools of previous men's and women's tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/india-rohan-bopanna-retirement-professional-tennis-2811849-2025-11-01",
      "headline": "Goodbye, but not the end: Rohan Bopanna, 2-time Grand Slam champion, retiresIndian tennis icon Rohan Bopanna has officially announced his retirement from professional tennis, bringing to a close a remarkable career that spanned over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-praises-benching-jemimah-rodrigues-for-fiery-world-cup-innings-2811834-2025-11-01",
      "headline": "Dropping Jemimah Rodrigues against England was a great move: Former India pacerFormer India fast bowler Varun Aaron has praised the team management's decision to bench Jemimah Rodrigues during the World Cup group stage. This move ignited Jemimah's aggression and focus, leading to her match-winning century against Australia that helped India chase a historic total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-jasprit-bumrah-2nd-t20i-robin-uthappa-mcg-2811809-2025-11-01",
      "headline": "Jasprit Bumrah is wayward when desperate for wickets: Uthappa after MCG T20IFormer India batter Robin Uthappa made an interesting observation about Jasprit Bumrah, suggesting that the pacer tends to lose his rhythm when he tries too hard to take wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-surpasses-rohit-sharma-top-t20i-run-scorer-2811789-2025-11-01",
      "headline": "Babar surpasses Rohit, scripts history on T20I comeback vs South AfricaPakistan batter Babar Azam etched his name in the history books by surpassing Rohit Sharma and becoming the highest run scorer in the history of T20Is. He achieved the feat during the 2nd T20I against South Africa in Lahore as Pakistan levelled the series with a nine-wicket victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-icc-womens-cricket-world-cup-2025-final-ind-vs-sa-india-weakness-2811773-2025-11-01",
      "headline": "Into the final, but flaws remain: India must peak in the World Cup showdownWomen's World Cup 2025: Team India is just one step away from attaining the glory that has evaded them in their entire cricketing history. As they prepare to take on South Africa in the final, India need to ensure that they fix the chinks in the armour to turn the World Cup dream into a reality on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-tickets-where-to-buy-2811765-2025-11-01",
      "headline": "Where are the tickets? Fans hit out at BCCI over final's ticketsWomen's World Cup: The India vs South Africa final is on Sunday, November 2. However, the tickets for the match were closed off. Frustrated fans have hit out at the BCCI over logistical issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-discharged-from-hospital-2811748-2025-11-01",
      "headline": "Shreyas Iyer discharged from Sydney hospital. Here's when he can fly homeIndia batter Shreyas Iyer has been discharged from Sydney hospital on Saturday, November 1, the BCCI has informed. Iyer had undergone a minor procedure after bruising his spleen during the 3rd ODI match against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-abhishek-sharma-harshit-rana-2811740-2025-11-01",
      "headline": "Pathan calls for better game awareness after Abhishek Sharma after big blunderAbhishek Sharma was the lone fighter in India's 2nd T20I match against Australia in Melbourne. Irfan Pathan, however, was not happy with the batter's game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-icc-womens-cricket-world-cup-2025-final-ind-vs-sa-india-weakness-2811773-2025-11-01",
      "headline": "Into the final, but flaws remain: India must peak in the World Cup showdownWomen's World Cup 2025: Team India is just one step away from attaining the glory that has evaded them in their entire cricketing history. As they prepare to take on South Africa in the final, India need to ensure that they fix the chinks in the armour to turn the World Cup dream into a reality on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-tickets-where-to-buy-2811765-2025-11-01",
      "headline": "Where are the tickets? Fans hit out at BCCI over final's ticketsWomen's World Cup: The India vs South Africa final is on Sunday, November 2. However, the tickets for the match were closed off. Frustrated fans have hit out at the BCCI over logistical issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-discharged-from-hospital-2811748-2025-11-01",
      "headline": "Shreyas Iyer discharged from Sydney hospital. Here's when he can fly homeIndia batter Shreyas Iyer has been discharged from Sydney hospital on Saturday, November 1, the BCCI has informed. Iyer had undergone a minor procedure after bruising his spleen during the 3rd ODI match against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-abhishek-sharma-harshit-rana-2811740-2025-11-01",
      "headline": "Pathan calls for better game awareness after Abhishek Sharma after big blunderAbhishek Sharma was the lone fighter in India's 2nd T20I match against Australia in Melbourne. Irfan Pathan, however, was not happy with the batter's game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/saishiva-sankaran-indian-f4-racing-f1-dreams-max-verstappen-2811595-2025-11-01",
      "headline": "Max Verstappen fan Saishiva Sankaran hoping to race alongside idol in F1A young star in the making, Saishiva Sankaran shares his ultimate dream of making to Formula One and racing alongside his idol Max Verstappen. Saishiva has been making a splash in Indian Racing League with the Speed Demons Delhi team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-fracture-comeback-india-vs-south-africa-2811717-2025-11-01",
      "headline": "I am fully recovered: Rishabh Pant gives green signal for Test returnIndia wicketkeeper batter Rishabh Pant has given a green signal for his return to Test cricket. Pant said that he has fully recovered from his frustrating foot injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-odi-world-cup-final-2811695-2025-11-01",
      "headline": "Turning trolls into believers: Indian women's team makes people dream againBattling trolls and persistent questions about pay parity with the men's team, Harmanpreet Kaur and her players have transformed scepticism into belief. Anchored by composure and quiet resilience, they now stand on the brink of rewriting Indian cricket's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-t20i-lahore-saim-ayub-faheem-ashaf-salman-mirza-level-series-2811673-2025-10-31",
      "headline": "PAK vs SA: Saim Ayub, Faheem Ashraf star as Pakistan crush South Africa in 2nd T20IPakistan bounced back in style as Salman Mirza and Faheem Ashraf destroyed South Africa's batting before Saim Ayub's fluent fifty sealed a nine-wicket win, setting up a thrilling series decider in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/saturday-nights-main-event-2025-match-card-cm-punk-vs-jey-uso-cody-rhodes-vs-drew-mcintyre-where-to-watch-2811705-2025-11-01-2811670-2025-10-31",
      "headline": "WWE Saturday Night's Main Event: Matchcard, livestreaming details and moreThe 41st edition of Saturday Night's Main Event is all set to emanate from the Delta Center in Salt Lake City, Utah, USA with four major titles being defended at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-super-cup-east-bengal-goalless-draw-mohun-bagan-semifinal-2811662-2025-10-31",
      "headline": "AIFF Super Cup: East Bengal hold Mohun Bagan to reach semifinals on goal differenceEast Bengal produced a disciplined defensive show to hold Mohun Bagan goalless and secure a semifinal spot in the AIFF Super Cup on goal difference, as Oscar Bruzon's men stood tall under late pressure in a tense Kolkata derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-dominate-zimbabwe-second-t20i-seal-series-2-0-2811659-2025-10-31",
      "headline": "ZIM vs AFG: Afghanistan seal series with seven-wicket in second T20IAfghanistan secured the T20I series against Zimbabwe with a comprehensive seven-wicket victory in Harare, chasing down 126 with two overs to spare. Rashid Khan was the star of the show with the ball as Afghanistan continued to impress in the format. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}