{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-shares-fall-10-percent-q2-results-explained-weak-sales-outlook-2618253-2024-10-17",
      "headline": "Explained: Why Bajaj Auto shares crashed 10% todayBajaj Auto shares dropped over 10% in early trade, following the company's Q2FY25 financial results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-early-trade-infosys-tcs-bajaj-auto-eicher-motors-rvnl-2618237-2024-10-17",
      "headline": "Sensex, Nifty decline in early trade; Infosys gains, Bajaj Auto sinks 9%The S&P BSE Sensex was down 315.93 points to 81,185.43 at 9:52 am, while the NSE Nifty50 fell 143.15 points to trade at 24,828.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-day-2-check-latest-subscription-gmp-expected-listing-gains-2617934-2024-10-16",
      "headline": "Hyundai IPO Day 2: Check latest subscription, GMPHyundai Motors India IPO: The bidding for the public issue will close on Thursday, with the allotment expected to be finalised by October 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-funds-sip-at-rs-100-does-it-make-sense-investment-tips-money-wealth-2617902-2024-10-16",
      "headline": "Mutual Fund SIPs at Rs 100: Does it make sense?A lower investment amount makes investing more accessible to a broader section of the population, particularly small-scale and first-time investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-partners-with-ey-india-to-address-post-sales-issues-report-2617851-2024-10-16",
      "headline": "Ola Electric partners with EY India to address post-sales issues: ReportEY India, one of the country's leading consultancy firms, has been engaged by Ola Electric to improve its after-sales services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-auto-it-stocks-technical-levels-indices-2617838-2024-10-16",
      "headline": "Sensex, Nifty end lower as auto and IT stocks drag; Trent down 4%The S&P BSE Sensex fell 318.76 points to 81,501.36, while the NSE Nifty50 ended 86.05 points lower to settle at 24,971.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-3-percent-basic-salary-impact-salary-of-central-government-employees-2617832-2024-10-16",
      "headline": "DA hiked by 3%: How will it impact salary of central government employeesThis decision to hike the DA was taken on Wednesday during a Cabinet meeting chaired by Prime Minister Narendra Modi, and was confirmed by Union Information & Broadcasting Minister Ashwini Vaishnaw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-3-reasons-you-should-not-expect-big-listing-gains-latest-gmp-subscription-2617801-2024-10-16",
      "headline": "Expecting big listing gains from Hyundai IPO? 3 reasons you shouldn'tDespite the buzz surrounding the offering, investor response has been lukewarm, raising questions about its short-term performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-msp-for-rabi-crops-for-marketing-season-2025-26-2617752-2024-10-16",
      "headline": "Cabinet approves MSP for rabi crops for marketing season 2025-26The decision was taken to ensure better income for farmers and to promote the cultivation of key crops during the Rabi season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dearness-allowance-hiked-by-3-per-cent-for-central-government-employees-ahead-of-diwali-bonanza-2617745-2024-10-16",
      "headline": "Central government employees get early Diwali gift with 3% DA hikeDearness Allowance hike: The additional 3% increase is expected to ease the financial burden on government employees amid rising inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-3-percent-announcement-union-cabinet-likely-today-diwali-gift-all-you-need-to-know-2617737-2024-10-16",
      "headline": "DA hike announcement likely today. Here's what we know It could be an early Diwali for central government employees and pensioners, as the government is set to make an official announcement about the 3% DA hike today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-itr-e-filing-portal-30-launching-soon-features-date-ease-tax-procedure-all-you-need-to-know-2617710-2024-10-16",
      "headline": " New ITR e-filing portal 3.0 launching soon: All you need to knowAccording to an internal circular dated October 8, 2024, the new portal, part of Project IEC 3.0, will replace the current system and introduce advanced features for smoother and more secure filing of income tax returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-no-spectrum-auction-much-appreciated-telecom-minister-jyotiraditya-scindia-2617679-2024-10-16",
      "headline": "Much appreciated: Elon Musk after government confirms 'no spectrum auction'In a recent announcement by Telecom Minister Jyotiraditya Scindia, confirmed that India would allocate spectrum administratively, following global norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-gmp-rises-marginally-should-you-subscribe-latest-subscription-2617665-2024-10-16",
      "headline": "Hyundai IPO: GMP rises marginally, should you subscribe? Hyundai Motors India IPO: The share price has been set between Rs 1,865 and Rs 1,960 per share. With this IPO, Hyundai aims to raise a massive Rs 27,856 crore, making it the largest public offering in India's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/7th-pay-commission-how-much-da-hike-central-government-employees-before-diwali-2024-2617663-2024-10-16",
      "headline": "How much DA hike will central government employees get? Details hereDearness Allowance, a key component of compensation for over one crore central government employees and pensioners, is designed to shield them from inflationary pressures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-16-2024-precious-metals-record-hike-on-mcx-2617660-2024-10-16",
      "headline": "Gold, silver price today, October 16, 2024: Precious metals record hike on MCXGold Price Today October 16, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pvr-inox-share-price-falls-analysts-bullish-bhool-bhulaiyaa-3-pushpa-2-movie-releases-2617652-2024-10-16",
      "headline": "Explained: Why analysts are bullish on PVR Inox despite falling share pricePVR Inox shares: Although PVR Inox shares have fallen over 5% this year, several brokerages are optimistic about the company"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-share-price-ofs-begins-key-details-for-investors-2617636-2024-10-16",
      "headline": "Cochin Shipyard shares down 4% today as 2-day OFS begins. Check detailsCochin Shipyard share price: The OFS, which started on October 16, is open only to non-retail investors today. The floor price for the sale is set at Rs 1,540 per share, a 7.89% discount to Tuesday's closing price of Rs 1,672."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-market-opening-update-stocks-to-watch-fii-outflows-2617626-2024-10-16",
      "headline": "Sensex, Nifty witness volatile trade as FII outflow dents sentimentsThe S&P BSE Sensex was up 50.20 points to 81,870.32 at 9:51 am, while the NSE Nifty50 rose 15.35 points to trade at 25,072.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-favours-administrative-allocation-spectrum-amid-elon-musk-ambani-showdown-2617515-2024-10-16",
      "headline": "No spectrum auction: Government after Elon Musk objects to Mukesh Ambani's pitchTelecom Minister Jyotiraditya Scindia has announced that India will follow the global trend of administrative spectrum allocation. The decision came after Starlink CEO Elon Musk objected to Ambani's Reliance Jio lobbying for the auction route."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-justin-trudeau-ministry-of-external-affairs-mea-hardeep-singh-nijjar-murder-probe-2618149-2024-10-17",
      "headline": "India calls out Trudeau's cavalier behaviour after he admits to no proof on NijjarThe Ministry of External Affairs slammed Trudeau's handling of the situation, stating that Canada had failed to provide any evidence to support its allegations against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-canada-row-old-letter-by-gurpatwant-singh-pannun-sikhs-for-justice-justin-trudeau-expulsion-india-envoy-2618245-2024-10-17",
      "headline": "In letter to Trudeau, terrorist Pannun had asked for Indian envoy's sackingSikhs for Justice called Khalistani terrorist Hardeep Singh Nijjar a \"peace-loving\" and a \"law-abiding Canadian citizen\" in the letter to Prime Minister Justin Trudeau. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/india-canada-row-prime-minister-justin-trudeau-one-india-canada-policy-government-attack-hardeep-singh-nijjar-admission-2618153-2024-10-17",
      "headline": "'One India' is Canada's policy, but…: Trudeau's double-talk at depositionWhile testifying before Canada's foreign interference inquiry, Justin Trudeau admitted that his country only had intelligence and no proof against India in the killing of Khalistani terrorist Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/former-one-direction-member-liam-payne-dies-by-falling-from-buenos-aires-argentina-hotel-balcony-2618131-2024-10-17",
      "headline": "Ex-One Direction member Liam Payne dies at 31 after falling from hotel balconyArgentine newspapers reported, quoting officials, that police were called to the scene following an emergency report of \"an aggressive man possibly under the influence of drugs and alcohol\". Later, emergency medical workers confirmed Payne's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/2024-us-presidential-election-vice-president-kamala-harris-america-ready-woman-commnander-in-chief-2618177-2024-10-17",
      "headline": "Is America ready for a woman Commander in Chief?The US has elected 46 Presidents since 1789, all white men barring one. For a nation that calls itself the world's oldest democracy, the fact that it has never elected a woman President speaks to the deep-rooted misogyny that persists in American society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/chandra-arya-khalistani-extremism-hindu-canadians-threat-canada-india-diplomatic-row-justin-trudeau-2618219-2024-10-17",
      "headline": "What about Hindu Canadians? Lawmaker's swipe at Trudeau on Khalistan threatIndian-origin MP Chandra Arya expressed concern over the Khalistani threat faced by Hindu Canadians and called on the Trudeau government to address the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-canada-diplomatic-row-justin-trudeau-hardeep-singh-nijjar-killing-rcmp-probe-2618128-2024-10-17",
      "headline": "Audacity of Justin Trudeau: Took Canada to 'war' on back of a crowdsourced probe!Prime Minister Justin Trudeau's latest move — calling for public help in a diplomatic crisis — is nothing short of embarrassing for Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-making-very-big-films-so-his-parents-can-watch-from-heaven-2618230-2024-10-17",
      "headline": "Shah Rukh Khan making 'very big films' so his parents can watch from heavenShah Rukh Khan shared that he pursued Devdas for his late mother. He said he wanted to create big films for his parents to see from heaven."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-state-department-matthew-miller-khalistani-terrorist-gurpatwant-singh-pannun-murder-plot-accused-individual-2618204-2024-10-17",
      "headline": "Individual accused of Pannun murder plot no longer employed by India: USIn November 2023, US prosecutors charged Indian national Nikhil Gupta for his involvement in the conspiracy, alongside an Indian government official, to target Khalistani terrorist Gurpatwant Singh Pannun in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/paris-hilton-charlie-puth-and-fans-react-to-liam-payne-death-cant-believe-this-2618193-2024-10-17",
      "headline": "Can't believe this: Paris Hilton, Charlie Puth and fans react to Liam Payne's deathBritish singer Liam Payne, 31, died on October 16 after reportedly falling from a hotel balcony in Buenos Aires. Shocked fans and celebrities shared their grief on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nayab-singh-saini-haryana-chief-minister-oath-council-of-ministers-swearing-in-ceremony-pm-modi-bjp-2618155-2024-10-17",
      "headline": "Nayab Saini's oath as Haryana Chief Minister today, PM, BJP brass to attend Live UpdatesNayab Singh Saini will take oath as Haryana Chief Minister for the second time today. The swearing in ceremony wil be attended by Prime Minister Narendra Modi, Union Home Minister Amit Shah, and other top BJP leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-chennai-is-flagged-as-point-of-global-concern-in-this-environmental-report-2617935-2024-10-16",
      "headline": "Why Chennai is flagged as point of global concern in this environmental reportWWF's Living Planet Report 2024 raises concerns on India's shrinking wetlands leading to drought and floods, while praising initiatives on sustainable agriculture"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-justice-of-india-dy-chandrachud-proposes-justice-sanjiv-khanna-as-his-successor-2618187-2024-10-17",
      "headline": "Chief Justice proposes Justice Sanjiv Khanna as his successor Upon approval by the government, Justice Sanjiv Khanna will become the 51st Chief Justice of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-many-calories-do-indians-need-in-a-day-2617747-2024-10-17",
      "headline": "How many calories do Indians need in a day?Social media has always preached that if we eat less and move more, we will lose weight. But how many calories do Indians actually need in a day? Let experts guide you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-canada-diplomatic-standoff-opposition-jairam-ramesh-congress-government-justin-trudeau-2618065-2024-10-16",
      "headline": "Take Opposition into confidence: Congress to government amid India-Canada rowIn a post on X (formerly Twitter), Congress leader Jairam Ramesh said that the Union government should come clean in view of the allegations levelled by Justin Trudeau amid the ongoing diplomatic standoff between the two countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jewellery-cash-property-worth-crores-lokayukta-raids-junior-auditor-ramesh-hingorani-bhopal-2618178-2024-10-17",
      "headline": "Jewellery, cash worth Rs 90 lakh found in raids on junior auditor in BhopalThe raids on premises linked to Ramesh Hingorani were conducted following a disproportionate assets complaint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-canada-diplomatic-row-justin-trudeau-face-panel-probe-china-foreign-interference-canadian-election-2617967-2024-10-16",
      "headline": "Is Trudeau making India the fall guy to shield China?The panel probing foreign interference in Canada's elections of 2019 and 2021 found China to be the biggest threat. Canadian Prime Minister Justin Trudeau is deposing before it today. Is Trudeau using the Nijjar killing case to project India as the fall guy and save China?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-pregnant-flaunts-baby-bump-bfi-london-film-festival-2618171-2024-10-17",
      "headline": "Actor Radhika Apte is pregnant, flaunts baby bump at BFI London Film FestivalActor Radhika Apte attended the BFI London Film Festival 2024 recently. She flaunted her baby bump for the first time in the UK premiere of her upcoming film, Sister Midnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/video/watch-lady-justice-statue-stands-tall-at-supreme-court-with-blindfold-taken-off-2618116-2024-10-17",
      "headline": "Watch: Lady Justice Statue stands tall at Supreme Court with blindfold taken offA video of the Lady Justice Statue at the Supreme Court has gone viral as it has undergone a landmark change with its blindfold removed and a copy of the Constitution replacing the sword it traditionally held in one of her hands, in a departure from the familiar sight people had about the statue. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-boy-detained-issuing-hoax-bomb-threats-flights-airlines-2617968-2024-10-16",
      "headline": "Chhattisgarh boy detained over bomb hoax on 3 flightsInitial investigation revealed that there was a dispute between the boy and his friend over money. Due to this, the boy allegedly made threatening posts on social media using the photo of his friend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/serie-a-paul-pogba-ban-reduction-juventus-return-france-world-cup-2026-2618175-2024-10-17",
      "headline": "Paul Pogba keeps World Cup 2026 dream alive after doping ban reductionPaul Pogba has claimed that he still keeps the World Cup 2026 dream alive and is eager to make a return to the playing field with Juventus. Pogba last played a match almost a year ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bts-member-j-hope-gets-discharged-from-military-jin-welcomes-him-watch-2618254-2024-10-17",
      "headline": "Watch: BTS member J-hope gets discharged from military, Jin welcomes himJ-Hope of BTS has been discharged from military service, and welcomed by Jin. He expressed gratitude to fans and shared insights from his military life. Jin's solo album is set for November 15, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-making-very-big-films-so-his-parents-can-watch-from-heaven-2618230-2024-10-17",
      "headline": "Shah Rukh Khan making 'very big films' so his parents can watch from heavenShah Rukh Khan shared that he pursued Devdas for his late mother. He said he wanted to create big films for his parents to see from heaven."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/paris-hilton-charlie-puth-and-fans-react-to-liam-payne-death-cant-believe-this-2618193-2024-10-17",
      "headline": "Can't believe this: Paris Hilton, Charlie Puth and fans react to Liam Payne's deathBritish singer Liam Payne, 31, died on October 16 after reportedly falling from a hotel balcony in Buenos Aires. Shocked fans and celebrities shared their grief on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vettaiyan-box-office-day-7-rajinikanth-film-ends-week-1-with-rs-11880-crore-in-india-2618194-2024-10-17",
      "headline": "Vettaiyan box office Day 7: Rajinikanth's film ends Week 1 with Rs 118.80 croreSuperstar Rajinikanth's Vettaiyan ended Week 1 with Rs 118.80 crore nett at the domestic box office. The film remained steady on Wednesday, October 16."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-virat-kohli-duck-number-three-bengaluru-2618242-2024-10-17",
      "headline": "IND vs NZ: Virat Kohli out for 0 after batting at No. 3 after 8 yearsVirat Kohli's return to the number three spot ended in disaster as the star batter was dismissed for a 9-ball duck against New Zealand in the Bengaluru Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/diana-edulji-welcomes-neetu-david-in-icc-hall-of-fame-cant-think-of-anyone-more-deserving-2618229-2024-10-17",
      "headline": "Edulji welcomes David in ICC Hall of Fame: Can't think of anyone more deservingDiana Edulji welcomed Neetu David in the ICC Hall of Fame as she became only the 2nd Indian woman to be inducted. She penned a heartfelt note and said that she couldn't think of anyone better than her join the Hall of Fame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-shweta-sehrawat-up-warriorz-exclusive-interview-2618058-2024-10-17",
      "headline": "Alyssa Healy is very approachable, never felt pressure under her: Shweta Sehrawat In an exclusive chat with IndiaToday.in, Shweta Sehrawat spoke about her goals of aiming to break into the national team with strong performances on the domestic circuit. The 20-year-old plays under Alyssa Healy for the UP Warriorz in the Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-hyderabad-dale-steyn-announces-exit-bowling-coach-2618221-2024-10-17",
      "headline": "Dale Steyn confirms exit as SRH bowling coach: Won't be returning for IPL 2025Former South Africa pacer Dale Steyn has announced that he won't be returning for the IPL 2025 season as the bowling coach of SRH. Steyn had taken up the role in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-shubman-gill-injury-kl-rahul-number-three-bengaluru-2618208-2024-10-17",
      "headline": "IND vs NZ: Shubman Gill misses Bengaluru Test, KL Rahul expected to bat at No.3Shubman Gill hasn't recovered from neck stiffness and will miss the Bengaluru Test against New Zealand. KL Rahul is expected to take Gill's slot as the No.3 batter for India at the Chinnaswamy stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-1st-test-rohit-sharma-aims-for-a-fresh-start-vs-new-zealand-with-world-test-championship-final-in-mind-2618205-2024-10-17",
      "headline": "Rohit aims for a fresh start vs NZ with World Test Championship final in mindIndian captain Rohit Sharma said that the Indian team aim for a fresh start against New Zealand with the World Test Championship 2023-25 final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/serie-a-paul-pogba-ban-reduction-juventus-return-france-world-cup-2026-2618175-2024-10-17",
      "headline": "Paul Pogba keeps World Cup 2026 dream alive after doping ban reductionPaul Pogba has claimed that he still keeps the World Cup 2026 dream alive and is eager to make a return to the playing field with Juventus. Pogba last played a match almost a year ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-two-bengaluru-weather-live-updates-chinnaswamy-stadium-2618154-2024-10-17",
      "headline": "1st Test Day 2 Weather updates: Rain returns to halt 1st sessionIND vs NZ, 1st Test Day 2 Weather updates: The rain has returned to the Chinnaswamy stadium as India were left reeling at 13 for 3. The covers have come back firmly in Bengaluru as both teams have returned back to the dressing room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyanka-patil-fatima-sana-india-pakistan-adorable-gifts-2618118-2024-10-17",
      "headline": "Do what you love: Shreyanka, Fatima win hearts with adorable exchangesWomen's T20 World Cup: India's Shreyanka Patil and Pakistan's Fatima Sana exchanged adorable messages for each other, showing the friendship between them. Both India and Pakistan failed to qualify for the semi-finals after crashing out in the league stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-retention-plans-ms-dhoni-capped-r-ashwin-idea-2618106-2024-10-16",
      "headline": "Retain MS Dhoni as capped player: R Ashwin gives IPL retention mantra for CSKIPL 2025: Ravichandran Ashwin has offered a unique perspective on Chennai Super Kings' (CSK) retention strategy ahead of the mega auction, suggesting that MS Dhoni should be retained as a capped player rather than as an uncapped player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/serie-a-paul-pogba-ban-reduction-juventus-return-france-world-cup-2026-2618175-2024-10-17",
      "headline": "Paul Pogba keeps World Cup 2026 dream alive after doping ban reductionPaul Pogba has claimed that he still keeps the World Cup 2026 dream alive and is eager to make a return to the playing field with Juventus. Pogba last played a match almost a year ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-two-bengaluru-weather-live-updates-chinnaswamy-stadium-2618154-2024-10-17",
      "headline": "1st Test Day 2 Weather updates: Rain returns to halt 1st sessionIND vs NZ, 1st Test Day 2 Weather updates: The rain has returned to the Chinnaswamy stadium as India were left reeling at 13 for 3. The covers have come back firmly in Bengaluru as both teams have returned back to the dressing room. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyanka-patil-fatima-sana-india-pakistan-adorable-gifts-2618118-2024-10-17",
      "headline": "Do what you love: Shreyanka, Fatima win hearts with adorable exchangesWomen's T20 World Cup: India's Shreyanka Patil and Pakistan's Fatima Sana exchanged adorable messages for each other, showing the friendship between them. Both India and Pakistan failed to qualify for the semi-finals after crashing out in the league stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-retention-plans-ms-dhoni-capped-r-ashwin-idea-2618106-2024-10-16",
      "headline": "Retain MS Dhoni as capped player: R Ashwin gives IPL retention mantra for CSKIPL 2025: Ravichandran Ashwin has offered a unique perspective on Chennai Super Kings' (CSK) retention strategy ahead of the mega auction, suggesting that MS Dhoni should be retained as a capped player rather than as an uncapped player. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/grace-harris-opening-australia-grateful-selectors-faith-2618104-2024-10-16",
      "headline": "Grace Harris on opening for Australia: Grateful to selectors for showing faith in me Women's T20 World Cup 2024: Grace Harris thanked the national selectors for trusting her to open the batting. Harris played as an opener in Alyssa Healy's absence and scored 40 runs off 41 balls against India at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umpires-semi-finals-australia-v-south-africa-west-indies-v-new-zealand-2618095-2024-10-16",
      "headline": "Lauren Agenbag, Claire Polosak among umpires for World Cup semi-finals Nimali Perera, Jacquline Williams, Lauren Agenbag and Claire Polosak are the four on-field umpires for the Women's T20 World Cup 2024 semi-finals on October 17 and 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-2nd-test-ben-duckett-multan-host-crumble-2618085-2024-10-16",
      "headline": "Pakistan could crumble in 3rd innings: Ben Duckett backs England to win 2nd TestEngland opener Ben Duckett believes Pakistan are \"under pressure\" and could \"crumble,\" despite the home side finishing day two of the second Test in Multan in a stronger position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-test-bengaluru-weather-forecast-rain-day-2-2618056-2024-10-16",
      "headline": "1st Test Bengaluru Weather Update: Will rain play spoilsport on Day 2?India vs New Zealand, Bengaluru Weather Forecast: The opening day of the first Test between India and New Zealand was washed out due to rain, with no play possible. Weather forecasts indicated a 50 percent chance of rain on the second day, leaving the teams and fans hopeful for some action despite the uncertain conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-sajid-khan-harry-brook-multan-test-2618031-2024-10-16",
      "headline": "Sajid Khan reveals how he plotted Harry Brook's dismissal in MultanPAK vs ENG: Sajid Khan talked about the tactics that Pakistan employed to dismiss Harry Brook, who was fresh from scoring a triple hundred in the opening Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-tuchel-aims-to-give-england-a-second-star-on-their-shirt-2618010-2024-10-16",
      "headline": "Time to put second star on England shirt, says new coach Thomas TuchelThomas Tuchel, England's newly appointed head coach, walked into Wembley Stadium on Wednesday with a clear and bold ambition: to lead the nation to World Cup glory in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-day-2-sajid-khan-reaction-2618002-2024-10-16",
      "headline": "Root's dream wicket, passion for Pakistan: Sajid Khan relishes Test comebackPakistan spinner Sajid Khan is relishing his Test comeback after picking up the dream wicket of Joe Root in a devastating spell against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-sajid-khan-shikhar-dhawan-celebration-2617994-2024-10-16",
      "headline": "Watch: Sajid Khan, cameraman imitate Dhawan's thigh-five celebrationPAK vs ENG: Pakistan off-spinner Sajid Khan imitated Shikhar Dhawan's thigh-five celebration after picking up the wicket of Harry Brook on Day 2 of the second Test in Multan Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-sajid-khan-harry-brook-multan-test-2618031-2024-10-16",
      "headline": "Sajid Khan reveals how he plotted Harry Brook's dismissal in MultanPAK vs ENG: Sajid Khan talked about the tactics that Pakistan employed to dismiss Harry Brook, who was fresh from scoring a triple hundred in the opening Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-tuchel-aims-to-give-england-a-second-star-on-their-shirt-2618010-2024-10-16",
      "headline": "Time to put second star on England shirt, says new coach Thomas TuchelThomas Tuchel, England's newly appointed head coach, walked into Wembley Stadium on Wednesday with a clear and bold ambition: to lead the nation to World Cup glory in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-day-2-sajid-khan-reaction-2618002-2024-10-16",
      "headline": "Root's dream wicket, passion for Pakistan: Sajid Khan relishes Test comebackPakistan spinner Sajid Khan is relishing his Test comeback after picking up the dream wicket of Joe Root in a devastating spell against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-sajid-khan-shikhar-dhawan-celebration-2617994-2024-10-16",
      "headline": "Watch: Sajid Khan, cameraman imitate Dhawan's thigh-five celebrationPAK vs ENG: Pakistan off-spinner Sajid Khan imitated Shikhar Dhawan's thigh-five celebration after picking up the wicket of Harry Brook on Day 2 of the second Test in Multan Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-ben-duckett-success-subcontinent-ben-stokes-multan-pitch-2617987-2024-10-16",
      "headline": "Fearless Ben Duckett reveals secret to Test success: 'No punishment if I get out'Pakistan vs England, 2nd Test: Opener Ben Duckett, who continued his love affair with Pakistan, credited the backing from coach Brendon McCullum and captain Ben Stokes for playing without fear. Duckett hit a rapid hundred on Day 2 of the Multan Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyanka-patil-india-dream-hungrier-exit-2617971-2024-10-16",
      "headline": "Hurts, but makes us hungrier: Shreyanka keeps World Cup dream aliveWomen's T20 World Cup: Shreyanka Patil was gutted after India crashed out in the group stages, but also pledged to bounce back strongly and keep alive the dreams of winning the title.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-neetu-david-hall-of-fame-2617957-2024-10-16",
      "headline": "Meet Neetu David: India's latest member in ICC Hall of FameNeetu David joined the ICC Hall of Fame for cricketers on October 16 and became the second Indian woman after Diana Edulji to join the elite list. She played 10 Tests and 97 ODIs from 1995 to 2008. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-2nd-test-score-sajid-khan-noman-ali-collapse-2617936-2024-10-16",
      "headline": "2nd Test: Sajid Khan triggers England collapse and hopes of Pakistan fightback Pakistan (PAK) vs England (ENG), 2nd Test: Off-spinner Sajid Khan picked four wickets to trigger an England collapse late on Day 2. Ben Duckett hit a hundred, but England conceded advantage on Wednesday afternoon in Multan. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}