{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zupee-lays-off-30-percent-of-staff-as-it-adapts-to-india-online-gaming-act-2785826-2025-09-11",
      "headline": "Zupee lays off 30% of staff as it adapts to India's Online Gaming ActZupee has rolled out a comprehensive relief package for employees affected by the layoffs. The support plan includes financial assistance beyond the standard notice period, with extra compensation based on years of service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/will-diwali-light-up-dalal-street-for-investors-2785768-2025-09-11",
      "headline": "Will Diwali light up Dalal Street for investors?While the festival is often seen as a time for good fortune, experts say the stock market doesn't necessarily follow festive trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-slides-to-all-time-low-as-us-tariffs-bite-2785745-2025-09-11",
      "headline": "Rupee slides to all-time low as US tariffs biteThe Indian rupee hit a record low of 88.44 against the US dollar on Thursday, pressured by US tariffs and heavy foreign investor outflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-nifty50-longest-winning-streak-us-india-trade-optimism-oil-gas-gains-2785730-2025-09-11",
      "headline": "Sensex, Nifty extend gains amid optimism over US-India trade dealThe NSE Nifty50 rose by 32.40 points to close at 25,005.5, while the BSE Sensex increased by 123.58 points, settling at 81,548.73."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-switch-now-allowed-but-rules-apply-unified-pension-scheme-national-pension-scheme-2785701-2025-09-11",
      "headline": "UPS to NPS switch now allowed, but rules applyCentral government employees who opted for the UPS can now switch back to the NPS, the government has announced. However, this flexibility comes with specific rules and conditions that employees must follow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phone-buying-loan-rbi-new-lone-mobile-lock-small-lenders-bajaj-finance-emi-2785683-2025-09-11",
      "headline": "Buying a phone on loan? Non-payment may lock your deviceCurrently, over one-third of consumer electronics, including mobile phones, are purchased on small-ticket loans in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-pay-income-tax-with-credit-card-all-you-need-to-know-2785649-2025-09-11",
      "headline": "Should you pay income tax with credit card? All you need to knowAs the tax filing deadline approaches, many taxpayers scramble to pay their dues. While net banking and UPI are common, using a credit card is also an option, but it comes with costs and benefits you should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-even-small-income-slips-can-trigger-big-tax-notices-explains-tax-advisor-2785585-2025-09-11",
      "headline": "Why even small income slips can trigger big tax notices, explains tax advisorThink a small slip in your tax return won't matter? Think again. Even missing Rs 5,000 bank interest has invited income tax notices. A tax advisor breaks down why AIS mismatches are a growing headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-in-limbo-why-so-many-employees-struggle-to-access-their-savings-2785558-2025-09-11",
      "headline": "PF crisis: What makes withdrawing your own money so difficultFor decades, the Provident Fund has been seen as a loyal companion, quietly growing with every paycheque, waiting to support employees in tough times or after retirement. But when the time comes to withdraw it, many workers discover that accessing their savings is anything but simple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/looking-to-invest-in-it-stocks-here-are-the-top-picks-2785577-2025-09-11",
      "headline": "Looking to invest in IT stocks? Here are the top picksDespite recent concerns around tariffs announced by US President Donald Trump in April, experts remain positive on the IT sector's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/punjabi-artistes-are-indias-passport-to-world-because-beats-break-borders-2785724-2025-09-11",
      "headline": "Punjabi artistes are India's passport to world, because beats break bordersPunjabi beats are rewriting pop culture's playlist globally. If you see that the world's dancing to it now, it's purely because of the global dominance of Punjabi artistes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baseer-ali-awez-darbar-fight-bigg-boss-19-captaincy-task-2785773-2025-09-11",
      "headline": "Awez Darbar warns Baseer Ali to lower his tone in Bigg Boss 19. Watch promoYou know the upcoming episode of a reality show is going to be an interesting one when a contestant ends his silence with a roar. A promo for the upcoming episode of 'Bigg Boss 19' promises exactly that and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-were-once-kicked-out-of-new-zealand-cafe-says-jemimah-rodrigues-2785788-2025-09-11",
      "headline": "Anushka-Virat were once kicked out of New Zealand cafe, says Jemimah RodriguesDuring their visit to New Zealand, Virat Kohli and Anushka Sharma were reportedly asked to leave a cafe after a lengthy conversation with Indian women cricketers Jemimah Rodrigues and Smriti Mandhana. The incident was shared by Rodrigues in a latest interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-rip-teaser-matt-damon-ben-affleck-stuck-in-money-morality-and-mayhem-2785721-2025-09-11",
      "headline": "The Rip teaser: Matt Damon, Ben Affleck stuck in money, morality and mayhemHollywood's BFF Ben Affleck and Matt Damon are reuniting in the crime thriller 'The Rip'. The crime thriller is set to release on Netflix in January 2025, exploring themes of trust and betrayal among Miami police officers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-advance-booking-latest-update-and-box-office-records-burst-through-the-roof-in-india-2785757-2025-09-11",
      "headline": "Demon Slayer: Infinity Castle advance booking bursts through the roof in India'Demon Slayer: Infinity Castle' advance booking smashes records in India, set to redefine animated film success. The pre-sales in India crossed Rs 10 crore, breaking non-Hollywood records and signalling the anime's growing box office impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mimi-chakraborty-bikini-bengali-nandita-roy-shiboprosad-mukherjee-bold-raktabeej-2-2785709-2025-09-11",
      "headline": "Mimi Chakraborty becomes first actor to wear bikini in a Bengali filmMimi Chakraborty has made headlines by becoming the first Bengali actor to shoot in a bikini for a Bengali film. She was seen in a swimwear for a song titled 'Choker Neele'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-dilip-royal-treatment-udaipur-mewar-king-youtube-vlog-2785638-2025-09-11",
      "headline": "Dilip's royal treatment from King of Mewar leaves Farah Khan speechless. WatchFilmmaker Farah Khan's latest vlog captured a unique experience with the King of Mewar. The video featured her cook Dilip receiving royal attention as she was humorously sidelined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-song-tenu-ki-pata-manoj-pahwa-diljit-dosanjh-badshah-2785684-2025-09-11",
      "headline": "The Ba***ds of Bollywood song Tenu Ki Pata: Manoj Pahwa is star of Diljit's song 'Tenu Ki Pata' is the third song released from Aryan Khan's upcoming series 'The Ba***ds of Bollywood'. Sung by Diljit Dosanjh, the track prominently features Manoj Pahwa and has further raised anticipation for the series' premiere."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-dead-girls-review-netflix-mexican-show-is-wickedly-funny-bloodbath-you-wont-see-coming-2785624-2025-09-11",
      "headline": "The Dead Girls review: A wickedly funny bloodbath you won't see comingRelease Date:Wed Sep 10, 2025Netflix's 'The Dead Girls' is a darkly funny crime thriller from Mexico based on true events. Packed with murder, satire and stellar performances, it's a must-watch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/financial-detriment-harming-dignity-delhi-high-court-protects-aishwarya-rais-personality-rights-2785687-2025-09-11",
      "headline": "No misuse of name, image: High Court protects Aishwarya Rai's personality rightsThe Delhi High Court has granted Bollywood actor Aishwarya Rai Bachchan protection over her personality rights, ruling that unauthorised commercial use of her name, image, or likeness violates her right to live with dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kaantha-release-delayed-after-lokah-chapter-1-box-office-success-2785673-2025-09-11",
      "headline": "Dulquer Salmaan's Kaantha postponed due to Lokah's success, new date to be outDulquer Salmaan and Rana Daggubati announced the postponement of 'Kaantha' to allow 'Lokah' to continue its successful run. New release date will be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-gupta-says-bollywood-star-was-fired-from-south-film-due-to-high-entourage-2785663-2025-09-11",
      "headline": "Sanjay Gupta says a Bollywood star was fired from South film due to high entourageDirector Sanjay Gupta revealed a Bollywood star was fired from a South film due to costly entourage demands. The producer scrapped the project after discovering hidden expenses from multiple vans brought from Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-summer-i-turned-pretty-why-millennial-women-are-bingeing-belly-jeremiah-conrad-love-story-like-teenagers-2785631-2025-09-11",
      "headline": "Why millennial women are bingeing on The Summer I Turned Pretty like teenagersMillennial women can't get enough of 'The Summer I Turned Pretty'. Between Belly's endless love triangle, Conrad vs Jeremiah debates, and the nostalgia of teenage summers, the Prime Video hit has become the ultimate guilty pleasure - bills and burnout be damned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-shoots-rajinikanth-jailer-2-poses-pictures-with-fans-2785658-2025-09-11",
      "headline": "Shiva Rajkumar shoots for Rajinikanth's Jailer 2, poses for pics with fansKannada actor Shiva Rajkumar, whose cameo in Rajinikanth's 2023 blockbuster 'Jailer' had gone viral, will be reprising his role in the sequel. He has started shooting for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-to-record-a-song-for-rishab-shetty-kantara-chapter-1-2785598-2025-09-11",
      "headline": "Diljit Dosanjh to record a song for Rishab Shetty's Kantara Chapter 1Singer Diljit Dosanjh is set to sing a song for director-actor Rishab Shetty's 'Kantara: Chapter 1'. The collaboration between Diljit and Hombale Films adds to the cultural diversity and pan India appeal of the upcoming film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/zombie-reddy-2-will-be-made-for-global-audiences-says-teja-sajja-2785276-2025-09-11",
      "headline": "Exclusive: Zombie Reddy 2 will be made for global audiences, says Teja SajjaActor Teja Sajja confirmed that 'Zombie Reddy 2' is on the cards, with the team planning to scale up their experiment into a pan-India spectacle aimed at global audiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-18-mridul-tiwari-shehbaz-badesha-farrhana-bhatt-ashnoor-kaur-2785610-2025-09-11",
      "headline": "Bigg Boss 19 episode 18: Mridul- Shehbaz clash, Farrhana-Ashnoor rivalry heats upMridul Tiwari and Shehbaz Badesha came close to a physical fight in the latest episode of 'Bigg Boss 19.' What led to the huge clash? Find out in the written update for the latest episode of the reality show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/after-death-hoax-kajal-aggarwal-makes-first-public-appearance-2785629-2025-09-11",
      "headline": "After death hoax, Kajal Aggarwal makes first public appearanceActor Kajal Aggarwal, after dismissing false reports claiming she died in a road accident, made her first public appearance in Mumbai days after the rumours surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/britney-spears-fires-back-at-trolls-over-messy-home-shame-on-those-who-judged-me-2785607-2025-09-11",
      "headline": "Britney Spears fires back at trolls over messy home: Shame on those who judged mePop icon Britney Spears faced renewed criticism over her home's condition, prompting her to defend her personal space and lifestyle on social media. She hit back at trolls in a new latest post. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/high-powered-rifle-used-to-kill-charlie-kirk-recovered-suspect-appears-college-aged-will-be-caught-fbi-2785846-2025-09-11",
      "headline": "Rifle used to kill Charlie Kirk recovered, suspect appears college-aged: FBIThe shooting took place while Kirk was speaking onstage at an outdoor event called \"Prove Me Wrong\" before an audience of roughly 3,000 at Utah Valley University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gen-z-picks-kulman-ghising-to-lead-nepal-interim-government-after-sushila-karki-steps-aside-2785671-2025-09-11",
      "headline": "Nepal Gen Z divided? After Sushila Karki, Kulman Ghising propped up for top job  Live UpdatesA group of Gen Z protesters proposed former Nepal Electricity Authority chief Kulman Ghising to head Nepal's interim government, citing his administrative experience and notable achievements in the energy sector."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/charlie-kirk-will-get-presidential-medal-of-freedom-trump-after-influencer-shot-dead-in-utah-college-campus-2785865-2025-09-11",
      "headline": "Charlie Kirk to get Presidential Medal of Freedom: Trump after influencer killedCharlie Kirk will get Presidential Medal of Freedom: Trump after influencer shot dead in Utah college campus"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/10-naxalites-including-senior-leader-gunned-down-in-encounter-in-chhattisgarhs-gariyaband-2785841-2025-09-11",
      "headline": "10 Naxals, including senior leader, gunned down in Chhattisgarh's encounterIn Gariyaband, Chhattisgarh, 10 Naxals, including senior CC member Manoj alias Modem Balkrishna, were killed in a joint operation. The operation is part of the intensified Naxal eradication campaign in the Mainpur forest region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/pm-narendra-modi-us-president-donald-trump-sweet-talk-what-next-2785681-2025-09-11",
      "headline": "What next after Trump-Modi sweet talk?The two leaders have taken tentative first steps towards stabilising the partnership and announced the resumption of trade negotiations. They may have walked the relationship back from the brink after weeks of sharp rhetoric and punitive measures from the US side, but the road ahead is not easy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/qatar-backstab-hamas-israel-trump-theories-coordinated-strike-gaza-war-2785596-2025-09-11",
      "headline": "Did Qatar backstab Hamas? 3 theories behind the brazen Israeli attackIsrael targeting Hamas's political leadership in Qatar was brazen as well as unprecedented. There are three major theories on why the strike could have possibly been a coordinated plot. We explain the different perspectives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/e20-fuel-criticism-was-paid-political-campaign-against-me-supreme-court-gave-clarity-nitin-gadkari-2785584-2025-09-11",
      "headline": "Paid campaign against me: Nitin Gadkari on E20 petrol furore onlineNitin Gadkari blamed a \"paid social media campaign\" against E20 blending on political motives, and urged people to stop paying attention to misinformed claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gen-z-factions-clash-outside-nepal-army-headquarters-amid-leadership-dispute-2785755-2025-09-11",
      "headline": "Gen Z factions clash outside Nepal Army HQ amid leadership disputeGroups of young demonstrators, who have spearheaded Nepal's biggest protests in decades, got into heated arguments over who would lead the interim government. The argument outside Army headquarters soon spiralled into scuffles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/british-vlogger-nepal-is-on-fire-video-makes-internet-say-it-will-script-history-harry-gen-z-protests-2785836-2025-09-11",
      "headline": "British vlogger's 'Nepal is on fire' video makes Internet say it will script historyThe British vlogger, who has been documenting his experiences on his social media account 'wehatethecold', was in for a shock once he arrived in Nepal amid the chaos and destruction that has gripped the country since September 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/india-delicate-diplomatic-balancing-act-after-israel-qatar-strike-the-lowdown-2785705-2025-09-11",
      "headline": "India's delicate diplomatic balancing act after Israel's Qatar strikeIndia's rare condemnation of Israel's airstrike on Qatar has sparked debate on its Middle East stance. What is India's current move in the complex geopolitical dance? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-farmer-duped-fighting-russia-ukraine-war-loses-earnings-floods-2785834-2025-09-11",
      "headline": "Duped into fighting Russia war, Punjab man returns home to flood devastationSarabjit Singh, a farmer from Punjab, was misled into joining the Russian army. Back home, the devastating floods swept away his remaining savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-genz-protests-pm-pick-sushila-karki-chief-justice-impeachment-husband-plane-hijack-2785697-2025-09-11",
      "headline": "When Nepal PM contender's husband hijacked plane carrying actor Mala SinhaAn intriguing aspect of Sushila Karki's life is the chequered past of her husband, who was involved in Nepal's first plane hijacking in which famous Bollywood actor Mala Sinha was on board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-an-obesity-doctor-and-i-know-weight-loss-management-tricks-beyond-calories-gym-sleep-2785112-2025-09-11",
      "headline": "I'm an obesity doctor and here's my realistic, guilt-free guide to weight lossIn this DocYard column, renowned bariatric surgeon Dr. Muffazal Ladkawala explains the actual reason behind obesity and how small habits and the right mindset can help one manage weight amid a busy schedule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-opium-capital-poppy-cultivation-balochistan-afghan-farmers-taliban-ban-2022-terror-funding-global-heroin-market-2785171-2025-09-11",
      "headline": "How Pakistan has become opium capital of the world with Afghan expertiseSprawling poppy fields in Pakistan's Balochistan have overtaken those in Afghanistan, which produced 80% of the world's opium. The Taliban's 2022 ban on poppy farming in Afghanistan pushed cultivators into Pakistan. With Afghan expertise and share-croppers, Pakistan has become the world's new opium hub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-meets-uttarakhand-flood-victims-families-announces-rs-1200-crore-aid-package-2785828-2025-09-11",
      "headline": "PM meets Uttarakhand flood victims' families, announces Rs 1,200 crore aid packagePM Modi visits Dehradun, announces Rs 1,200 crore aid, ex-gratia, and support for flood victims; urges restoration of infrastructure after Uttarakhand flash floods and landslides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/punjabi-artistes-are-indias-passport-to-world-because-beats-break-borders-2785724-2025-09-11",
      "headline": "Punjabi artistes are India's passport to world, because beats break bordersPunjabi beats are rewriting pop culture's playlist globally. If you see that the world's dancing to it now, it's purely because of the global dominance of Punjabi artistes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-denies-bcci-president-rumours-september-elections-2785840-2025-09-11",
      "headline": "Sachin Tendulkar dismisses talk of contesting for BCCI president postSachin Tendulkar has dismissed rumours linking him to the BCCI president role. His management confirmed no nomination has been made ahead of the 28 September elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-korea-kim-jong-un-likely-to-name-daughter-successor-kim-ju-ae-nis-heres-more-beti-bachao-beti-padhao-2785706-2025-09-11",
      "headline": "Beti badhao in North Korea: Kim Jong Un likely to name daughter successorNorth Korean leader Kim Jong Un will most likely name his daughter, Kim Ju Ae, his successor, said South Korea's spy agency. The Korean society is highly patriarchal, and Kim's move will be a Beti Badhao, or promote the daughter, initiative. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/who-gets-to-be-called-a-doctor-inside-indias-healthcare-title-wars-mbbs-bams-physiotherapists-2785620-2025-09-11",
      "headline": "Who gets to be called a doctor? Inside India's healthcare title warsIn India, the title \"Doctor\" isn't just a professional label, it's a symbol of authority, aspiration, and public trust. A recent health ministry directive has reopened an old wound in the healthcare world — Who truly deserves to wear that badge?  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gharivali-doctor-village-thane-produces-over-20-doctors-plans-hospital-2785628-2025-09-11",
      "headline": "Gharivali: The village where almost every home has a doctorA tiny village on the outskirts of Thane has produced over two dozen doctors and counting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/society/story/dealing-with-friends-who-turn-nasty-after-a-few-drinks-2785726-2025-09-11",
      "headline": "⁠Dealing with friends who turn nasty after a few drinksWe all have that one friend who can't handle their drinks and ends up embarrassing themselves — and you. If that sounds familiar, you probably need to read this."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-is-nepal-protests-india-trained-army-chief-ashok-raj-sigdel-at-helm-in-crisis-kp-oli-resignation-gen-z-2785159-2025-09-11",
      "headline": "Who is Nepal's India-trained army chief holding the country togetherAs Nepal faces its worst political turmoil in years, Army chief General Ashok Raj Sigdel has emerged as a key figure, holding the Himalayan nation together. General Sigdel engaged the young protesters in dialogue and acted swiftly to restore order after deadly clashes. Sigdel received military training in both India and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-shot-dead-moment-of-gun-attack-video-viral-screams-panic-utah-manhunt-shooter-2785458-2025-09-11",
      "headline": "Gunshot, screams, panic: Video captures moment Charlie Kirk was shot deadCharlie Kirk, founder of Turning Point USA, was answering a question about gun violence when a single gunshot rang out. As he abruptly slumped in his seat, chaos broke out."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-south-africa-harry-brook-explains-jofra-archer-rested-1st-t20i-2785854-2025-09-11",
      "headline": "England's Harry Brook explains why Jofra Archer was not risked in 1st T20IEngland captain Harry Brook said it would have been 'stupid' to play Jofra Archer in the rain-affected first T20I against South Africa, with the Ashes coming up this winter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shivam-dube-impact-player-teammates-trolled-watch-video-india-vs-uae-2785851-2025-09-11",
      "headline": "Watch: Shivam Dube wins Impact Player award at Asia Cup, gets trolled by teammatesShivam Dube's three-wicket burst against UAE earned him the Impact Player medal in India's Asia Cup opener. His teammates celebrated the feat with cheers and playful teasing inside the dressing room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-bangladesh-vs-hong-kong-live-score-updates-abu-dhabi-2785845-2025-09-11",
      "headline": "BAN vs HK Live: Bangladesh opt to bowl against unchanged Hong KongBangladesh vs Hong Kong, Asia Cup Live score: Bangladesh have won the toss and have elected to bopwl first against an unchanged Hong Kong from their Afghanistan clash, in their crucial Group B clash on Thursday, September 11 at the Sheikh Zayed Stadium in Abu Dhabi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-joins-hampshire-for-final-two-rounds-of-county-championship-2785839-2025-09-11",
      "headline": "Named as Asia Cup reserve, Sundar signs county contract with HampshireIndia's Washington Sundar has joined Hampshire for their last two matches of the 2025 Championship campaign, the English county side announced on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-denies-bcci-president-rumours-september-elections-2785840-2025-09-11",
      "headline": "Sachin Tendulkar dismisses talk of contesting for BCCI president postSachin Tendulkar has dismissed rumours linking him to the BCCI president role. His management confirmed no nomination has been made ahead of the 28 September elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-final-day-1-central-zone-kumar-kartikeya-saransh-jain-dominate-south-zone-2785821-2025-09-11",
      "headline": "Duleep Trophy Final: Saransh, Kartikeya run riot as Central Zone dominate Day 1Saransh Jain and Kumar Kartikeya ripped through South Zone with nine wickets between them to set up Central Zone's dominance in the Duleep Trophy final. Central Zone closed Day 1 on 50 without loss, trailing by 99 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-urges-calm-ahead-india-pakistan-asia-cup-clash-2785766-2025-09-11",
      "headline": "Kapil Dev urges for restraint before India vs Pakistan: Players should do their jobsKapil Dev has appealed for restraint before the India-Pakistan Asia Cup match, urging focus on cricket over politics. The two teams are scheduled to meet in a Group A clash on Sunday at Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-charged-74-fa-breaches-football-agent-rules-third-party-investments-2785737-2025-09-11",
      "headline": "FA charge Chelsea with 74 breaches of rules on agents and intermediariesEngland's Football Association on Thursday brought 74 charges against Chelsea, alleging breaches of its rules on football agents, the use of intermediaries, and third-party investment in players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gujarat-teacher-drives-grassroots-chess-development-with-personal-funding-2785733-2025-09-11",
      "headline": "Sandip Upadhyay: How a Maths school teacher is helping chess become popular in GujaratA Gujarat teacher is transforming chess education in village schools through personal funding and dedication. His efforts are nurturing young talent and setting a model for grassroots sports growth in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-stuns-kodai-naraoka-lakshya-sen-beats-prannoy-hong-kong-open-2785713-2025-09-11",
      "headline": "Ayush Shetty stuns World No. 9 Naraoka, Lakshya knocks out PrannoyHong Kong Open 2025: Ayush Shetty produced the best performance of his career to stun world number 9 Kodai Naraoka at the Super 500 badminton tournament. Ayush will meet Lakshya Sen in an all-Indian quarter-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ajay-jadeja-questions-uae-performance-one-sided-hammering-india-2785691-2025-09-11",
      "headline": "Should Asia Cup be an 8-team event? Ajay Jadeja feels one-sided games raise doubtsAjay Jadeja has said that the India vs UAE clash lacked any competitiveness, raising questions over whether the Asia Cup should be an eight-team contest. He further noted that though India is a superior team, there was no fight shown by the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-urges-calm-ahead-india-pakistan-asia-cup-clash-2785766-2025-09-11",
      "headline": "Kapil Dev urges for restraint before India vs Pakistan: Players should do their jobsKapil Dev has appealed for restraint before the India-Pakistan Asia Cup match, urging focus on cricket over politics. The two teams are scheduled to meet in a Group A clash on Sunday at Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-charged-74-fa-breaches-football-agent-rules-third-party-investments-2785737-2025-09-11",
      "headline": "FA charge Chelsea with 74 breaches of rules on agents and intermediariesEngland's Football Association on Thursday brought 74 charges against Chelsea, alleging breaches of its rules on football agents, the use of intermediaries, and third-party investment in players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gujarat-teacher-drives-grassroots-chess-development-with-personal-funding-2785733-2025-09-11",
      "headline": "Sandip Upadhyay: How a Maths school teacher is helping chess become popular in GujaratA Gujarat teacher is transforming chess education in village schools through personal funding and dedication. His efforts are nurturing young talent and setting a model for grassroots sports growth in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-stuns-kodai-naraoka-lakshya-sen-beats-prannoy-hong-kong-open-2785713-2025-09-11",
      "headline": "Ayush Shetty stuns World No. 9 Naraoka, Lakshya knocks out PrannoyHong Kong Open 2025: Ayush Shetty produced the best performance of his career to stun world number 9 Kodai Naraoka at the Super 500 badminton tournament. Ayush will meet Lakshya Sen in an all-Indian quarter-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ajay-jadeja-questions-uae-performance-one-sided-hammering-india-2785691-2025-09-11",
      "headline": "Should Asia Cup be an 8-team event? Ajay Jadeja feels one-sided games raise doubtsAjay Jadeja has said that the India vs UAE clash lacked any competitiveness, raising questions over whether the Asia Cup should be an eight-team contest. He further noted that though India is a superior team, there was no fight shown by the opposition."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}