{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-indices-slip-as-trump-eu-tariff-threat-sparks-concerns-2693356-2025-03-13",
      "headline": "Wall Street indices slip as Trump's EU tariff threat raises concernsAt the opening bell, the S&P 500 dipped 0.9 points, or 0.09%, at the open to 5,594.45​, the Dow Jones Industrial Average dropped 70.9 points, or 0.17%, at the open to 41,280.05 and Nasdaq Composite fell 49.9 points, or 0.28%, to 17,598.565."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/found-old-share-certificates-at-home-chandigarh-man-here-is-how-you-can-encash-them-2693296-2025-03-13",
      "headline": "Old share certificates in your drawer? Here's how you can encash themThe stock value of old shares can be calculated by multiplying the number of stocks held by the current market price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/check-sbi-latest-lending-rates-for-march-2025-mclr-and-base-rate-2693293-2025-03-13",
      "headline": "Check SBI's latest lending rates for March 2025: MCLR and base rateThe updated MCLR rates will directly influence interest rates on various financial products, including home loans, personal loans, and other credit facilities offered by the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-close-for-holi-march-14-nse-bse-holiday-trading-equity-2693243-2025-03-13",
      "headline": "BSE, NSE holiday: Is stock market closed for Holi on March 14, 2025?Since there is some uncertainty over whether Holi 2025 falls on Friday or Saturday, it is important to check the official list of stock market holidays for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/policies-are-a-nightmare-zerodha-ceo-nithin-kamath-on-why-life-insurance-is-getting-tougher-2693227-2025-03-13",
      "headline": "Policies are a nightmare: Nithin Kamath on why life insurance is getting tougherSince the onset of COVID-19, insurance companies have faced an increase in claims, which has led them to reassess their underwriting policies and tighten their approval process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-bse-nse-dalal-street-auto-it-stocks-drag-markets-2693194-2025-03-13",
      "headline": "Sensex, Nifty erase early gains to end lower; Auto, IT stocks weigh on marketsThe S&P BSE Sensex lost 200.85 points to end at 73,828.91, while the NSE Nifty50 was down by 73.30 points to close at 22,397.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-sensex-nifty-market-correction-make-sense-to-stop-investing-in-mutual-funds-expert-advice-2693167-2025-03-13",
      "headline": "Does it make sense to stop investing in mutual funds amid market correction?Sensex and Nifty are down nearly 15% from their September all-time highs as volatility continues to make its presence felt, and market correction is the flavour being served on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/march-15-advance-tax-deadline-are-you-required-to-pay-2693153-2025-03-13",
      "headline": "March 15 advance tax deadline: Are you required to pay?Salaried individuals, freelancers, and businesses must pay advance tax if their total tax liability (after TDS/TCS) exceeds Rs 10,000 in FY 2024-25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-to-calculate-advance-tax-and-pay-it-before-filing-your-itr-deadline-march-15-steps-2693128-2025-03-13",
      "headline": "Filing your advance tax? Here's how to calculate itAdvance tax is applicable when the total tax liability for a financial year exceeds Rs 10,000. It is computed based on the estimated income for the year and paid in instalments as per the due dates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-upi-linked-to-an-inactive-mobile-number-this-is-how-npci-protects-you-2693107-2025-03-13",
      "headline": "Is your UPI linked to an inactive mobile number? Here's how NPCI protects youBy March 31, 2025, all banks and payment service providers (PSPs) offering UPI services must update their databases to remove inactive or recycled mobile numbers. The move aims to reduce errors and prevent fraud caused by mobile number churn."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/starlink-india-entry-partnership-spacex-bharti-airtel-reliance-jio-what-it-means-for-india-telecom-sector-2693090-2025-03-13",
      "headline": "Airtel and Jio team up with SpaceX to bring Starlink: What it means for telcosSpaceX is still awaiting permission from the government to officially launch Starlink's services in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-form-16-necessary-for-itr-filing-what-to-do-if-you-do-not-have-it-2693072-2025-03-13",
      "headline": "Is Form 16 necessary for ITR filing? What to do if you don't have it?Form 16 provides details of the deducted tax amount and submission date and helps in ITR filing by ensuring accurate income and tax details, reducing the chances of errors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/extra-work-from-home-wfh-days-at-infosys-needs-manager-nod-report-2693017-2025-03-13",
      "headline": "Extra work from home days at Infosys needs manager's nod: ReportThis comes as the Bengaluru-based IT company rolled out a new mandate on Monday, which requires its employees to work from the office at least 10 days a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-share-price-rise-18-percent-today-after-this-announcement-check-here-asset-monetisation-2692996-2025-03-13",
      "headline": "Explained: Why MTNL share price rose 18% todayOver the past year, the stock has gained 18.61%. Year-to-date (YTD), the stock has declined by 15.66%. In the last six months, the stock has dropped 23.25%  and in the last three months, it has fallen 25.95%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lip-bu-tan-new-intel-ceo-march-18-ai-semiconductor-2692980-2025-03-13",
      "headline": "Who is Lip-Bu Tan, industry veteran named Intel CEO?Lip-Bu Tan, who officially takes over on March 18, has extensive experience in the chip sector and is known for investing in promising tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-why-sensex-and-nifty-are-struggling-after-gaining-in-early-trade-2692977-2025-03-13",
      "headline": "Explained: Why Sensex, Nifty are giving up early gains almost every dayStock market today: Despite multiple signals pointing to a strong opening, the Sensex and Nifty couldn't hold on to early gains. Right now, they are barely 0.10% higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-nearly-200-points-nifty-above-22500-indusind-bank-gains-over-2-2692961-2025-03-13",
      "headline": "Sensex, Nifty gain momentum on inflation relief, IndusInd Bank falls 2%The S&P BSE Sensex gained 250.89 points to 74,280.65, while the NSE Nifty50 added 59.70 points to 22,530.20 as of 10 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-slams-freebies-culture-job-creation-innovative-entrepreneurs-remove-poverty-india-2692954-2025-03-13",
      "headline": "Not freebies, job creation will omit poverty from India: Narayana MurthyInfosys co-founder Narayana Murthy has slammed the freebies of culture, saying that job creation by innovative entrepreneurs will help eliminate poverty from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-13-infosys-bel-ola-electric-tata-motors-and-more-2692948-2025-03-13",
      "headline": "Stocks to watch today: Infosys, BEL, Ola Electric, Tata Motors and moreStocks to watch today (March 13): Infosys, Tata Motors, and Bharat Electronics Limited are likely to be in focus today as domestic markets gear up for a mildly positive start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-opening-prediction-on-march-13-3-key-factors-to-watch-dalal-street-expectation-2692943-2025-03-13",
      "headline": "Will Sensex, Nifty recover today? 3 things to know ahead of stock market openingStock market opening prediction today: Sensex and Nifty are likely to open higher after positive US and domestic retail inflation data. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-deadline-only-3-days-left-to-pay-last-instalment-of-advance-tax-march-15-2692712-2025-03-13",
      "headline": "Income tax deadline: Only 3 days left to pay last instalment of advance taxMaking timely payments is crucial when it comes to tax compliance to avoid penalties and interest. Also, meeting deadlines ensures last-minute stress and a smooth tax filing process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-on-edge-inflation-eases-but-global-retaliation-hits-stocks-hard-glbs-2692795-2025-03-12",
      "headline": "Wall Street on edge: Inflation eases, but global retaliation hits stocks hardAfter jumping to a big early gain on an encouraging inflation update, Wall Street gave back much of it after other countries announced their retaliations following President Donald Trump's latest escalation in his trade war.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-higher-as-softer-inflation-data-boosts-investor-confidence-tesla-leads-market-surge-2692768-2025-03-12",
      "headline": "Wall Street opens higher as softer inflation data boosts investor confidenceAt the opening bell, the S&P 500 rose 52.8 points, or 0.95%, to 5,624.84 and the Dow Jones Industrial Average was up by 144.0 points, or 0.35%, to 41,577.5. The Nasdaq Composite also witnessed a rise of 275.3 points, or 1.58%, to 17,711.41."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/equity-mutual-fund-inflows-fall-26-percent-in-february-amid-market-volatility-2692736-2025-03-12",
      "headline": "Equity mutual fund inflows fall 26% in February amid market volatilityMarket fluctuations impacted mutual fund inflows across categories, with equity and hybrid funds seeing a decline. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-to-7-month-low-in-february-2692648-2025-03-12",
      "headline": "Retail inflation eases to 7-month low of 3.61% in FebruaryRetail inflation in February has cooled to a seven-month low, and it has also fallen below the RBI's medium-term target for the first time in six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tds-rules-changing-from-april-1-higher-tax-free-limits-on-fd-interest-lottery-insurance-commission-mutual-funds-2692626-2025-03-12",
      "headline": "TDS rules from April 1: Higher tax-free limits on FD interest, lotteryTo benefit senior citizens, the government has doubled the TDS threshold for interest income from Rs 50,000 to Rs 1 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-marginally-lower-it-stocks-infosys-tumble-2692622-2025-03-12",
      "headline": "Sensex, Nifty end marginally lower as IT stocks tumble; Infosys falls over 4%The S&P BSE Sensex ended 72.56 points lower at 74,029.76, while the NSE Nifty50 settled 27.40 points lower at 22,470.50. All the other broader market indices also ended in negative territory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/temasek-takes-a-bit-of-haldirams-buy-10-percent-stake-for-1-billion-dollar-2692580-2025-03-12",
      "headline": "Temasek takes a bit of Haldiram's, buys 10% stake for $1 billion: ReportTemasek, which has already invested in Manipal Hospitals and fast-food giant Devyani International (operator of KFC and Pizza Hut in India), is now looking to cash in on the growing snacks market with its Haldiram's bet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-rolls-out-premium-economy-fares-starting-at-rs-599-for-a-limited-time-2692556-2025-03-12",
      "headline": "Air India rolls out premium economy fares starting at Rs 599 for a limited timeThese premium economy fares are above regular economy fares on domestic flights for a limited time. Prices vary based on routes and demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-top-7-billionaires-lose-34-billion-amid-stock-market-slump-2692540-2025-03-12",
      "headline": "India's top 7 billionaires lose $34 billion amid stock market slumpMukesh Ambani, India's richest person, lost $3.13 billion this year, though he still remains India's richest man with a net worth of $87.5 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dalal-street-falls-sensex-nifty-3-factors-behind-stock-market-correction-2692512-2025-03-12",
      "headline": "Sensex falls over 400 points. 3 factors behind today's stock market slumpStock market today: At around 12:42 pm, the S&P BSE Sensex was down 439.77 points to 73,662.55 and the Nifty50 was trading 150.50 points lower at 22,347.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-some-investors-hnis-choosing-fixed-deposits-over-sips-2692474-2025-03-12",
      "headline": "Why are some investors choosing fixed deposits over SIPs?Many stock market experts suggest that mid-cap and small-cap stocks are currently expensive, which has triggered a correction in the last six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-recover-sharply-after-massive-crash-key-factors-to-know-2692479-2025-03-12",
      "headline": "Explained: Why IndusInd Bank share price is rising today after 27% crashIndusIndi Bank stock price: The stock surged nearly 14% from its intraday low, climbing to Rs 690 on the National Stock Exchange (NSE), breaking a five-day losing streak.At around 12 pm, shares of the company were up 3.18% to Rs 676.80 on the NSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/billionaires-present-at-donald-trump-oath-taking-see-fortunes-dip-elon-musk-mark-zuckerberg-2692454-2025-03-12",
      "headline": "5 billionaires at Trump's swearing-in see over $200 billion vanish in weeks   The start of Donald Trump's second term has been brutal for some of the world's richest billionaires, including those present at his swearing-in ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/jio-and-airtel-sign-deals-with-elon-musks-starlink-for-satellite-internet-in-india-ytvd-2692431-2025-03-12",
      "headline": "Jio and Airtel sign deals with Elon Musk's Starlink for satellite internet in IndiaJio and Airtel have signed separate agreements with Elon Musk's Starlink to bring satellite internet to India. The partnerships aim to provide high-speed broadband to remote and underserved areas. Starlink's service rollout depends on government approval. The deals could improve connectivity for education, healthcare, and businesses in regions lacking fibre-optic infrastructure. Starlink uses a constellation of 6,900 satellites for global broadband coverage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-shares-gain-after-jios-starlink-internet-announcement-details-here-2692424-2025-03-12",
      "headline": "Reliance shares gain after Jio's deal with Elon Musk's SpaceX for StarlinkRIL shares were up over 1% in early trade but gave up some gains due to market volatility. Around 10 am, the stock was trading 0.35% higher at Rs 1,251.50."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-tcs-wipro-why-are-major-it-stocks-falling-today-key-reasons-2692420-2025-03-12",
      "headline": "Infosys, TCS, Wipro: Why are major IT stocks falling today?At around 9:50 am, Infosys shares were down 3.5% and Wipro fell over 3.35%. HCLTech was down over 2.4% and TCS tumbled nearly 2%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-in-green-as-dalal-street-ignores-us-tariff-threats-airtel-shares-gain-over-3-2692407-2025-03-12",
      "headline": "Sensex, Nifty swing between gains and losses in volatile session; IT stocks downThe S&P BSE Sensex, which was up nearly 300 points in early trade, fell 91.43 points to trade at 74,010.37 around 9:30 am. The Nifty50 also fell 40.60 points to trade at 22,457.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-jio-signs-deal-with-elon-musk-spacex-to-bring-starlink-high-speed-satellite-internet-to-india-2692399-2025-03-12",
      "headline": "After Airtel, Jio signs deal with Elon Musk's SpaceX to bring Starlink to IndiaThe partnership aims to expand broadband access across India, especially in remote areas. Jio, which handles more mobile data than any other operator, will use Starlink's satellite network to strengthen its internet services."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-admits-feeling-unqualified-unequipped-in-self-critical-post-2693506-2025-03-14",
      "headline": "Justin Bieber admits feeling 'unqualified, unequipped' in self-critical postSinger Justin Bieber opened up about his inner struggles and feelings of inadequacy amid ongoing health concerns, admitting to often feeling like a fraud despite his success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arjit-singh-martin-garrix-new-single-angles-for-each-other-full-song-out-2693494-2025-03-14",
      "headline": "Home studio to stardom: Arijit Singh, Martin Garrix unveil new singleSinger Arijit Singh and Dutch DJ and record producer, Martin Garrix, collaborated for a new single, 'Angels For Each Other'. The duo unveiled the song ahead of Holi. Garrix lent his vocals for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-its-okay-to-not-be-okay-costar-seo-yeji-dating-rumours-2693389-2025-03-13",
      "headline": "Kim Soo-hyun's co-star Seo Ye-ji on rumours of dating him: Please stopA recent controversy involving K-drama actor Kim Soo-hyun has dragged his former co-star Seo Ye-ji into the limelight. She addressed rumours linking her to the actor and expressed her frustration on her fancafe, clarifying that she has no personal ties with Kim Soo-hyun."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ratna-pathak-shah-karwa-chauth-comment-roshesh-rajesh-kumar-2693342-2025-03-13",
      "headline": "Liberal women like Ratna Pathak Shah often question sanskriti: Actor Rajesh KumarActor Ratna Pathak Shah's remarks on Karva Chauth in 2022 sparked a debate, leading to a response from her co-star Rajesh Kumar, who defended traditional customs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/siddharth-test-character-promo-cricketer-arjun-look-unveiled-by-r-ashwin-2693260-2025-03-13",
      "headline": "It's do or die for Siddharth as cricketer Arjun in Test promo. WatchCricketer R Ashwin unveiled the character promo of Siddharth as Arjun in Netflix's upcoming project, Test. The film will stream on Netflix from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-kardashian-received-22kg-wedding-invite-from-ambanis-i-dont-know-them-2693247-2025-03-13",
      "headline": "Kim, Khloe Kardashian didn't know Ambanis, yet attended the weddingKim Kardashian and Khloe recall their time in India from last year when they flew down to attend the grand wedding of Anant Ambani and Radhika Merchant. Kim reveals that she didn't know the Ambani family and still decided to participate in the festivities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-making-socially-responsible-songs-we-are-artistes-not-scholars-2693059-2025-03-13",
      "headline": "Honey Singh on making socially responsible songs: We are artistes, not scholarsSinger and rapper Yo Yo Honey Singh, in an interview with India Today Digital, got candid about crafting socially responsible songs for the youth. The singer added how his attempts to craft such songs failed to resonate with the audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-faces-backlash-amid-kim-sae-ron-controversy-loses-brand-deals-report-2693077-2025-03-13",
      "headline": "Kim Soo-hyun faces backlash amid Kim Sae-ron controversy, loses brand deals: ReportKim Soo-hyun is embroiled in controversy over his alleged past relationship with the late Kim Sae-ron. The actor faces backlash, losing followers and brand deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-marvel-art-of-filmmaking-2692923-2025-03-13",
      "headline": "The art of filmmaking with Daredevil Born Again – A technical marvelDaredevil Born Again has captivated audiences with its unique approach to cinematography and storytelling. The show, consisting of seven episodes, is streaming on JioHotstar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/maui-police-chief-accused-of-covering-up-alleged-diddy-odell-beckham-jr-assault-glbs-2692903-2025-03-12",
      "headline": "Maui Police chief accused of covering up alleged Diddy, Odell Beckham Jr. assaultMaui Police Chief John Pelletier is accused of covering up an alleged gang rape involving Sean 'Diddy' Combs, Odell Beckham Jr, and Druski. The lawsuit claims Pelletier attempted to conceal the 2018 assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/prajakta-koli-vrishank-khanal-haldi-unseen-photos-2692862-2025-03-12",
      "headline": "More photos from Prajakta Koli-Vrishank Khanal's Haldi out. Seen yet?Prajakta Koli's friend has shared more photos from her and Vrishank Khanal's Haldi ceremony on Instagram. Check out the pictures here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/durgesh-kumar-no-offers-despite-projects-panchayat-laapataa-ladies-2692859-2025-03-12",
      "headline": "Panchayat actor Durgesh Kumar 'struggling' despite hit projects in 25-year careerActor Durgesh Kumar, known for his roles in Panchayat and Laapataa Ladies, shared that he still struggles to find significant roles despite his success. He said that he still has to chase casting directors for auditions despite recognition in his 25-year-long career in the industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/aditi-sharma-on-separation-estranged-husband-affair-rumours-apollena-costar-2692814-2025-03-12",
      "headline": "TV actor Aditi Sharma responds to allegations of cheating from estranged husbandAditi Sharma refuted her estranged husband Abhineet Kaushik's allegations of infidelity, asserting that their marital issues stem from his insecurities and not her actions. She also claimed that she faced 'serious problems' in the four months of marriage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-so-hyun-kim-sae-ron-relationship-confirmed-by-dispatch-actress-begged-him-debt-notice-gold-medalist-2692787-2025-03-12",
      "headline": "Kim So-hyun's relationship with Kim Sae-ron confirmed by Dispatch. DetailsA news report by Dispatch shed light on the controversy surrounding Kim Soo-hyun and Kim Sae-ron's alleged past relationship and the financial and emotional turmoil Kim Sae-ron faced, which might have led up to her tragic death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-nmixx-makes-a-bold-comeback-with-high-horse-2692646-2025-03-12",
      "headline": "K-pop group NMIXX makes a bold comeback with High HorseK-pop group NMIXX is making a bold comeback with High Horse. And this time, they have a surprise for their desi fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-khloe-kardashian-anant-ambani-radhika-merchant-wedding-the-kardashians-6-2692550-2025-03-12",
      "headline": " Kim, Khloe Kardashian search for their missing diamond at Ambani wedding. WatchIn the latest promo of The Kardashian Season 6, Kardashian sisters, Kim and Khloe, are seen panicking over their missing diamond as they attend the grand Anant Ambani-Radhika Merchant wedding in Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/aditi-sharma-rumoured-boyfriend-samarthya-gupta-breaks-silence-amid-infidelity-allegation-by-abhineet-kaushik-2692520-2025-03-12",
      "headline": "TV actor Aditi Sharma's rumoured boyfriend breaks silence amid infidelity allegationApollena actor Aditi Sharma's co-star Samarthya Gupta has denied rumours of an affair with her, calling the allegations baseless and harmful. Aditi's husband had alleged infidelity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-sae-rons-unpublished-statement-emerges-after-dating-rumours-with-kim-soo-hyun-2692490-2025-03-12",
      "headline": "Kim Sae-ron's unpublished statement emerges after dating rumours with Kim Soo-hyunAlmost a month after South Korean actor Kim Sae-ron's death, her aunt has alleged K-drama star Kim Soo-hyun was in a relationship with Sae-ron, and that they began dating when she was only a minor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/did-ekta-kapoor-just-take-a-jibe-at-ram-kapoor-in-a-video-about-ozempic-2692464-2025-03-12",
      "headline": "Did Ekta Kapoor just take a jibe at Ram Kapoor in a video about Ozempic?Filmmaker Ekta Kapoor on Tuesday shared a video on Instagram in which she was seen talking about her weight gain and if she should follow artificial methods to lose some weight. There was also a Ram Kapoor connection. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/world-knows-epicenter-of-global-terrorism-lies-india-response-pakistan-sponsoring-terrorism-baloch-train-hijack-2693518-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World knows the epicentre of terror: India slams Pakistan over train hijack claimWorld knows where epicenter of global terrorism lies: India hits back at Pakistan's 'sponsoring terror' charge"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-vladimir-putin-thanks-words-of-gratitude-donald-trump-pm-narendra-modi-grateful-noble-mission-2693514-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin thanks Trump, PM Modi amid Ukraine ceasefire talks: We're gratefulRussian President Vladimir Putin, in his first reaction to America's 30-day Ukraine ceasefire proposal, thanked Donald Trump and Indian Prime Minister Narendra Modi for their \"noble mission\" to resolve the conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-eyes-more-troops-in-panama-to-fulfil-goal-of-reclaiming-canal-says-report-2693488-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump eyes more troops in Panama to fulfil goal of 'reclaiming' canal: ReportThe White House has ordered the US military to plan a troop increase in Panama to support President Trump's goal of \"reclaiming\" the canal, reportedly to curb China's influence and secure US control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-new-captain-delhi-capitals-2693511-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Axar Patel replaces Rishabh Pant as Delhi Capitals captainIPL 2025: Delhi Capitals have named Axar Patel as their new skipper before the upcoming edition of the tournament. Axar has taken charge after the Capitals failed to make their way through to the play-offs three seasons in a row from 2022 to 2024.  \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/american-airlines-plane-catches-fire-passengers-evacuate-onto-wings-video-surfaces-2693484-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: American Airlines plane catches fire, passengers evacuate onto wingsAn American Airlines plane caught fire at a Denver airport gate on Thursday, forcing an emergency evacuation. Thick smoke billowed as passengers fled, but firefighters contained the blaze, and no injuries were reported."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/volodymyr-zelenskyy-vladimir-putin-donald-trump-russia-ukraine-war-ceasefire-deal-terms-scared-reactions-2693487-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zelenskyy rips Putin for truce terms: Doesn't want it but scared to tell TrumpUkrainian President Volodymyr Zelenskyy has slammed his Russian counterpart Vladimir Putin for the latter seeking clarifications and conditions on the US's ceasefire proposal, saying he is preparing to reject it but is afraid to tell that to Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bhopal/story/bhopal-thar-roxx-celebrate-friend-birthday-arrested-2693456-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bhopal man steals Rs 21 lakh Thar to celebrate friend's birthday, gets caughtA man named Tulsiram was arrested in Bhopal for stealing a Thar Roxx worth ₹21 lakh after its owner's death, attempting to sell it but getting caught before finalising the deal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-rupee-symbol-debate-dmk-shares-old-book-with-letter-as-proof-2693509-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DMK defends rupee symbol move, shares proof of Tamil letter's historic useAfter criticism over Tamil Nadu's budget using Tamil letter for Ru instead of the official rupee symbol, the DMK IT Wing defended it, citing Tamil linguistic history. The party shared an image of a book from 1935 which allegedly used the letter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-bengaluru-girlfriend-relationship-2693508-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Gauri Spratt, Aamir Khan's girlfriend from BengaluruAamir Khan introduced his girlfriend, Gauri Spratt, to the media on the eve of his 60th birthday. The two have been dating for over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nirmala-sitharaman-rupee-symbol-tamil-nadu-budget-language-row-dmk-government-mk-stalin-2693409-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nirmala Sitharaman's 'secessionist sentiment' dig at DMK over rupee symbol moveFinance Minister Nirmala Sitharaman attacked Tamil Nadu Chief Minister MK Stalin over the official rupee symbol switch in the state Budget document, saying it \"promoted secessionist sentiments under the pretence of regional pride\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lilavati-hospital-mumbai-fraud-case-founding-family-controversy-conflict-court-affairs-2693336-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lilavati Hospital's founding family torn by controversy, conflict, court affairsThe allegations emerged from an FIR filed by the Lilavati Kirtilal Mehta Medical Trust (LKMMT) against 17 people, including seven former trustees, equipment suppliers and vendors for embezzling over Rs 1,250 crore over the past two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/over-57-of-corporate-men-in-india-face-vitamin-b12-deficiency-survey-2693333-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 57% of corporate men in India face vitamin B12 deficiency: SurveyA recent study found that more than 57% of corporate men suffer from vitamin B12 deficiency, a crucial nutrient for energy and brain function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/total-lunar-eclipse-these-cities-will-witness-moon-turn-blood-red-2692666-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Total lunar eclipse: These cities will witness Moon turn blood redThe total lunar eclipse on March 14 will occur during the full moon phase, which coincides with the culmination of Holi celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/global/story/columbia-university-suspends-expels-students-pro-palestinian-protests-2693485-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Columbia University expels students, revokes degrees over pro-Palestine protestsColumbia University said that a judicial board brought a range of sanctions against students who occupied Hamilton Hall last year to protest against the war in Gaza."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-pinarayi-vijayan-cpim-opposes-jio-airtels-deal-with-elon-musks-spacex-to-bring-starlink-satellite-to-india-over-security-concerns-2693479-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CPIM slams Jio, Airtel's deal with Elon Musk's Starlink, cites security risksThe CPI(M) has opposed Jio and Airtel collaboration with Elon Musk's Starlink, citing concerns over spectrum allocation and national security. Warning against monopolisation and strategic risks, the party urged the government to block the deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/be-happy-review-abhishek-bachchan-remo-dsouza-nora-fatehi-film-prime-video-2693441-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Be Happy review: Abhishek Bachchan dances, but the story tripsReleased-Fri Mar 14, 2025Be Happy promises an emotional father-daughter tale but stumbles with a half-baked story and predictable tropes. Abhishek Bachchan delivers a heartfelt performance, but even he can't save this lacklustre dance-drama. Weak storytelling makes it forgettable in the realm of OTT content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-return-nasa-spacex-plan-crew-10-mission-launch-to-bring-back-astronauts-today-2693478-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nasa, SpaceX plan Crew-10 mission launch today to bring back Sunita WilliamsThe announcement came just 24 hours after SpaceX scrubbed the launch of the Crew-10 mission from the Kennedy Space Center in Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-swallows-ornament-at-jewellery-store-in-theft-attempt-in-bihar-video-2693455-2025-03-14#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "On camera: Woman swallows ornament at jewellery store in theft attempt in BiharThe woman, under the pretext of checking on the rings, started swallowing them one after another after seizing the right opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-football-jersey-gift-john-abraham-the-diplomat-film-meeting-2693397-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar's jersey gift, 'interesting' talks with John Abraham on The DiplomatExternal Affairs Minister S Jaishankar met actor John Abraham and had an \"interesting conversation\" with him on his upcoming film, The Diplomat. Jaishankar was gifted a football jersey by the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/does-three-language-formula-in-new-education-policy-actually-impose-hindi-2693131-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Does three-language formula in NEP actually impose Hindi?Tamil Nadu has alleged that the New Education Policy 2020 is an attempt at imposing Hindi in the Tamil-speaking state. What is the history of India's policy on language in education, and how does NEP 2020 differ? Is it really a bid to impose Hindi? A look at all sides of the debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/one-nation-one-script-indias-language-war-nep-tamil-nadu-hindi-row-2693162-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One nation, one script: Time to gut India's language warIndia's linguistic diversity is both its strength and its struggle. Since Independence, language has been a political flashpoint, from Tamil Nadu's anti-Hindi agitations to debates over the National Education Policy. With 22 official scripts complicating communication, is it time to adopt a single script?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/all-england-open-lakshya-sen-beats-jonathan-christie-reaches-quarters-2693352-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All England 2025: Lakshya Sen knocks out defending champion to reach quartersAll England Open 2025: Unseeded Lakshya Sen came up with a sensational display in men's singles second-round, knocking out defending champion Jonathan Christie in straight games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-to-hold-special-exam-for-students-celebrating-holi-on-march-15-2693422-2025-03-13#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE to hold special exam for students celebrating Holi on March 15CBSE has announced a special exam for students who cannot attend their board exams on March 15 due to Holi celebrations in certain regions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-embraces-holi-spirit-sends-wishes-to-fans-2693516-2025-03-14",
      "headline": "Singer Shawn Mendes embraces Holi spirit in India, sends wishes to fansSinger Shawn Mendes is in India for Holi. The artiste, who recently performed at Lollapalooza India, extended his Holi wishes on Friday with a vibrant selfie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-bengaluru-girlfriend-relationship-2693508-2025-03-14",
      "headline": "Who is Gauri Spratt, Aamir Khan's girlfriend from BengaluruAamir Khan introduced his girlfriend, Gauri Spratt, to the media on the eve of his 60th birthday. The two have been dating for over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-admits-feeling-unqualified-unequipped-in-self-critical-post-2693506-2025-03-14",
      "headline": "Justin Bieber admits feeling 'unqualified, unequipped' in self-critical postSinger Justin Bieber opened up about his inner struggles and feelings of inadequacy amid ongoing health concerns, admitting to often feeling like a fraud despite his success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/court-state-vs-a-nobody-review-nani-priyadarshi-courtroom-drama-2693475-2025-03-14",
      "headline": "Court review: A thought-provoking drama that falls short on courtroom thrillsReleased-Fri Mar 14, 2025Court - State vs A Nobody review: Presented by Telugu star Nani, this courtroom drama steadily captures the audience's attention before entering the court to make an emotional case, but falls short when it comes to making the case compelling and smart. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-new-captain-delhi-capitals-2693511-2025-03-14",
      "headline": "Axar Patel replaces Rishabh Pant as Delhi Capitals captainIPL 2025: Delhi Capitals have named Axar Patel as their new skipper before the upcoming edition of the tournament. Axar has taken charge after the Capitals failed to make their way through to the play-offs three seasons in a row from 2022 to 2024.  \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-bruno-fernandes-hat-trick-manchester-united-2693489-2025-03-14",
      "headline": "Bruno Fernandes hat-trick powers Manchester United to quarter-finalsEuropa League: Bruno Fernandes scored a hat-trick as Manchester United beat Real Sociedad 4-1 and advanced to the quarterfinals where they will face Olympique Lyonnais. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-venkatesh-iyer-kkr-price-tag-2693486-2025-03-14",
      "headline": "Venkatesh Iyer not bogged down by huge price tag: Really doesn't matterIPL 2025: Venkatesh Iyer said that he won't be overawed by the massive price tag of Rs 23.75 crore when he steps out to play for the three-time champion Kolkata Knight Riders (KKR). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-2025-mirra-andreeva-youngest-semi-final-2693482-2025-03-14",
      "headline": "Sensational Mirra Andreeva youngest in 20 years to reach semi-finalIndian Wells Masters 2025: Teen sensation Mirra Andreeva defeated Ukraine's Elina Svitolina in straight sets and will now be up against World No.2 Iga Swiatek in the all-important semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-mentor-dwayne-bravo-admits-messaging-gautam-gambhir-2693451-2025-03-14",
      "headline": "KKR mentor Dwayne Bravo admits messaging Gautam Gambhir for tips ahead of IPL 2025Kolkata Knight Riders' new mentor, Dwayne Bravo, has admitted messaging Gautam Gambhir for tips ahead of the upcoming season of the IPL. Gambhir guided KKR to their third IPL title in the previous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ucla-comes-into-its-first-league-tournament-after-winless-big-ten-start-glbs-2693447-2025-03-13",
      "headline": "UCLA comes into its first league tournament after winless Big Ten startUCLA made its debut in the Big Ten this season, leaving behind the manageable travel schedule of the West Coast-based Pac-12 for repeated trips to the Midwest and East Coast, which Cronin griped about."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-mumbai-indians-vs-gujarat-giants-hayley-matthews-nat-sciver-brunt-2693437-2025-03-13",
      "headline": "WPL: All round Hayley Matthews guides Mumbai to final with 47-run win over GujaratMumbai Indians qualified for the final of the Women's Premier League 2025 by beating Gujarat Giants by 47 runs in the Eliminator fixture at Brabourne Stadium in Mumbai. Hayley Matthews starred with both bat and ball in Mumbai's dominating win."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/acc-tournament-dukes-cooper-flagg-leaves-quarterfinal-game-against-georgia-tech-with-ankle-injury-glbs-2693430-2025-03-13",
      "headline": "ACC tournament: Duke's Cooper Flagg leaves quarterfinal game against Georgia tech with ankle injuryDuke star Cooper Flagg left Thursday's Atlantic Coast Conference Tournament quarterfinal game with a left ankle injury and had to be helped to the locker room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-minnesota-fires-coach-ben-johnson-over-56-71-record-in-four-years-glbs-2693423-2025-03-13",
      "headline": "NCAA Tournament: Minnesota fires coach Ben Johnson over 56-71 record in four yearsMinnesota fired coach Ben Johnson on Thursday after four years of repeatedly rebuilding rosters at his alma mater without coming close to an NCAA Tournament appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-julian-alvarez-penalty-controversy-atletico-real-madrid-2693414-2025-03-13",
      "headline": "Champions League: UEFA to discuss penalty rules after Alvarez VAR controversyChampions League 2025: UEFA, the governing body of European football, has said it will discuss penalty rules the game's lawmakers following controversy over the much-debated double touch rule, which led to Julian Alvarez's penalty being disallowed in Atletico Madrid's defeat to Real Madrid on Wednesday, March 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-and-ayesha-currys-bond-shines-as-they-cheer-on-daughter-riley-at-volleyball-tournament-glbs-2693341-2025-03-13",
      "headline": "NBA: Stephen Curry and Ayesha Curry's bond shines as they cheer on daughter Riley at volleyball tournamentStephen Curry attended her daughter's volleyball match along with her spouse Ayesha Curry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-mumbai-indians-vs-gujarat-giants-hayley-matthews-nat-sciver-brunt-2693437-2025-03-13",
      "headline": "WPL: All round Hayley Matthews guides Mumbai to final with 47-run win over GujaratMumbai Indians qualified for the final of the Women's Premier League 2025 by beating Gujarat Giants by 47 runs in the Eliminator fixture at Brabourne Stadium in Mumbai. Hayley Matthews starred with both bat and ball in Mumbai's dominating win."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/acc-tournament-dukes-cooper-flagg-leaves-quarterfinal-game-against-georgia-tech-with-ankle-injury-glbs-2693430-2025-03-13",
      "headline": "ACC tournament: Duke's Cooper Flagg leaves quarterfinal game against Georgia tech with ankle injuryDuke star Cooper Flagg left Thursday's Atlantic Coast Conference Tournament quarterfinal game with a left ankle injury and had to be helped to the locker room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-minnesota-fires-coach-ben-johnson-over-56-71-record-in-four-years-glbs-2693423-2025-03-13",
      "headline": "NCAA Tournament: Minnesota fires coach Ben Johnson over 56-71 record in four yearsMinnesota fired coach Ben Johnson on Thursday after four years of repeatedly rebuilding rosters at his alma mater without coming close to an NCAA Tournament appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-julian-alvarez-penalty-controversy-atletico-real-madrid-2693414-2025-03-13",
      "headline": "Champions League: UEFA to discuss penalty rules after Alvarez VAR controversyChampions League 2025: UEFA, the governing body of European football, has said it will discuss penalty rules the game's lawmakers following controversy over the much-debated double touch rule, which led to Julian Alvarez's penalty being disallowed in Atletico Madrid's defeat to Real Madrid on Wednesday, March 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-and-ayesha-currys-bond-shines-as-they-cheer-on-daughter-riley-at-volleyball-tournament-glbs-2693341-2025-03-13",
      "headline": "NBA: Stephen Curry and Ayesha Curry's bond shines as they cheer on daughter Riley at volleyball tournamentStephen Curry attended her daughter's volleyball match along with her spouse Ayesha Curry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-who-is-on-top-of-the-rookie-ladder-this-season-glbs-2693350-2025-03-13",
      "headline": "NBA: Who is on top of the rookie ladder this season?NBA rookie ladder provides solid contributions, but there is no clear breakout star yet. While some players have shown first-class performances, no single player has dominated the conversation like in previous years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-a-smith-names-his-top-5-nba-duos-glbs-2693354-2025-03-13",
      "headline": "NBA: Stephen A Smith names his top 5 NBA duosESPN Stephen A. Smith names his top 5 NBA duos in an NBA countdown show. His rankings focus on a mix of individual talent, team success, and playoff positions, thus making some surprising choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iml-2025-yuvraj-singh-sixes-india-vs-australia-semifinal-raipur-2693405-2025-03-13",
      "headline": "IML: Yuvraj Singh smashes 7 sixes to hurt Australia in another knockout gameIML 2025, India vs Australia: Yuvraj Singh hit 59 off just 30 balls as India Masters posted 220 against Australia in the semi-final in Raipur on Thursday. Yuvraj hit three sixes in an over, taking fans down memory lane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-patriots-release-center-star-c-david-andrews-glbs-2693388-2025-03-13",
      "headline": "NFL: Patriots release center star David AndrewsDavid Andrews, centre player released by the New England Patriots"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-county-championship-northamptonshire-2025-ipl-england-tour-2693382-2025-03-13",
      "headline": "After IPL 2025, Yuzvendra Chahal to return to County Championship in EnglandAfter his first stint with Punjab Kings in IPL 2025, Yuzvendra Chahal will play for Northamptonshire in County Championship and One-Day Cup. The leg-spinner will begin his second stint with Northants from June 22, the club said on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-cooper-kupp-released-by-the-rams-glbs-2693381-2025-03-13",
      "headline": "NFL: Cooper Kupp released by the RamsCooper Kupp, Super Bowl 56 MVP winner released by the Rams"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-quaterback-aaron-rodgers-released-by-the-jets-glbs-2693375-2025-03-13",
      "headline": "NFL: Quaterback Aaron Rodgers released by the JetsQuaterback Aaron Rodgers was released by the Jets. He's now a first-time free agent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harry-brook-banned-delhi-capitals-dc-2693371-2025-03-13",
      "headline": "Harry Brook becomes first player banned for withdrawing after auctionStar England batter Harry Brook has been banned for two years from the Indian Premier League (IPL) after withdrawing from the upcoming season of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-county-championship-northamptonshire-2025-ipl-england-tour-2693382-2025-03-13",
      "headline": "After IPL 2025, Yuzvendra Chahal to return to County Championship in EnglandAfter his first stint with Punjab Kings in IPL 2025, Yuzvendra Chahal will play for Northamptonshire in County Championship and One-Day Cup. The leg-spinner will begin his second stint with Northants from June 22, the club said on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-cooper-kupp-released-by-the-rams-glbs-2693381-2025-03-13",
      "headline": "NFL: Cooper Kupp released by the RamsCooper Kupp, Super Bowl 56 MVP winner released by the Rams"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-quaterback-aaron-rodgers-released-by-the-jets-glbs-2693375-2025-03-13",
      "headline": "NFL: Quaterback Aaron Rodgers released by the JetsQuaterback Aaron Rodgers was released by the Jets. He's now a first-time free agent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harry-brook-banned-delhi-capitals-dc-2693371-2025-03-13",
      "headline": "Harry Brook becomes first player banned for withdrawing after auctionStar England batter Harry Brook has been banned for two years from the Indian Premier League (IPL) after withdrawing from the upcoming season of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/all-england-open-lakshya-sen-beats-jonathan-christie-reaches-quarters-2693352-2025-03-13",
      "headline": "All England 2025: Lakshya Sen knocks out defending champion to reach quartersAll England Open 2025: Unseeded Lakshya Sen came up with a sensational display in men's singles second-round, knocking out defending champion Jonathan Christie in straight games."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/is-luka-doncic-playing-tonight-nba-injury-updates-for-lakers-vs-bucks-glbs-2693330-2025-03-13",
      "headline": "Is Luka Doncic Playing tonight? NBA injury updates for Lakers vs BucksLuka Doncic listed as questionable for the Lakers and Bucks due to an ankle injury "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-2025-mark-wood-injury-update-four-months-out-2693329-2025-03-13",
      "headline": "Fast bowler Mark Wood likely to miss India Test series, out of action for 4 monthsFast bowler Mark Wood is likely to miss the five-Test series against India at home in June-August. Wood underwent surgery after a long-standing knee injury flared up during the Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/west-virginia-coach-bans-players-from-dancing-on-tiktok-glbs-2693325-2025-03-13",
      "headline": "West Virginia coach bans players from dancing on TikTokWest Virginia football coach Rich Rodriguez banned players from dancing on TikTok, emphasizing discipline and team image. While allowing the app, he prioritizes football over social media engagement for his athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-starc-agrees-india-had-advantage-in-dubai-2693307-2025-03-13",
      "headline": "Mitchell Starc agrees India had clear advantage in Dubai during Champions TrophyAustralia fast bowler Mitchell Starc agrees that India had a clear advantage in Dubai during the ICC Champions Trophy 2025. India played all of their matches at the same venue after refusing to travel to Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-india-vs-england-test-series-navjot-singh-sidhu-2693309-2025-03-13",
      "headline": "Play Varun Chakravarthy in England Test series: Navjot Singh SidhuNavjot Singh Sidhu backed Varun Chakravarthy to exploit England's spin weakness in the upcoming Test series, urging India's head coach Gautam Gambhir to make strategic selections despite the IPL season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-navjot-singh-sidhu-on-rohit-sharmas-test-future-2693263-2025-03-13",
      "headline": "Navjot Singh Sidhu on Rohit Sharma's Test future: Did his replacement score 150?Former India cricketer turned commentator Navjot Singh Sidhu feels that Rohit Sharma should continue as Test captain on the England tour in June as India don't have his replacement yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-calls-ab-de-villiers-criticism-odi-world-cup-2693242-2025-03-13",
      "headline": "Why would Rohit Sharma retire? AB de Villiers surprised by criticismFormer South Africa captain AB de Villiers lashed out at critics of Rohit Sharma, saying he was not able to understand why there are questions over the India captain's place in the side in one-day internationals. Rohit led India to Champions Trophy triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahmudullah-retirement-bangladesh-cricket-era-2693223-2025-03-13",
      "headline": "Mahmudullah retires: The last pillar falls as Bangladesh's inspiring era endsMahmudullah Riyad, Bangladesh's man of ICC events, retired from ODIs on Wednesday, March 12, pulling the curtains down on his 18-year-long international career after the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-ceo-venky-mysore-venkatesh-iyer-captaincy-2693226-2025-03-13",
      "headline": "IPL 2025: Venky Mysore reveals why KKR didn't appoint Venkatesh Iyer as skipperKolkata Knight Riders (KKR) CEO revealed why they didn't appoint Venkatesh Iyer as skipper for the upcoming IPL 2025. Ajinkya Rahane has been entrusted with leadership duties for KKR in the upcoming season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rahul-dravid-crutches-rajasthan-royals-training-camp-injured-2693200-2025-03-13",
      "headline": "Watch: Injured coach Rahul Dravid joins Rajasthan Royals camp in crutchesRahul Dravid joined Rajasthan Royals' training camp on crutches after injuring his leg during a club match. Despite the setback, the former India coach remains focused on helping captain Sanju Samson and Kumar Sangakkara guide RR to IPL success."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}