{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amanta-healthcare-ipo-latest-subscription-80-times-gmp-final-day-allotment-listing-date-2781470-2025-09-03",
      "headline": "Amanta Healthcare IPO booked 80x: Check GMP, subscription status on final dayAmanta Healthcare launched its book-built issue of Rs 126 crore, entirely a fresh issue of 1 crore shares. The bidding window opened on September 1 and closed on September 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/gold-or-stock-market-where-to-put-money-now-record-high-price-equity-gst-cut-2781430-2025-09-03",
      "headline": "Gold vs stock market: Where should you put your money now?Market expert explained that gold and silver are usually considered when there is fear of a big market collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jane-street-appeals-against-sebis-market-ban-2781407-2025-09-03",
      "headline": "Jane Street appeals against Sebi's market banThe dispute began in July when Sebi temporarily restricted Jane Street from trading in Indian markets. The regulator had accused the firm of manipulating key stock indexes, one of its strongest actions against a foreign investor in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-410-points-higher-nifty-above-24700-tata-steel-jumps-6-percent-2781360-2025-09-03",
      "headline": "Sensex ends 410 points higher, Nifty above 24,700; Tata Steel jumps 6%The S&P BSE Sensex added 409.83 points to end at 80,567.71, while the NSE Nifty50 gained 135.45 points to close at 24,715.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-series-how-to-improve-credit-score-money-tips-personal-finance-loans-2781355-2025-09-03",
      "headline": "CIBIL Decoded: Why your credit score dropped and how to fix itWhether it is taking a loan, applying for a credit card, or even renting a house, your credit score often comes into play, affecting your personal finances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-right-time-to-invest-is-always-now-explains-expert-2781341-2025-09-03",
      "headline": "Why the right time to invest is always 'now', explains expertMany people wait for the 'perfect' time to start investing, hoping the market will feel safe. But an expert says that moment never really comes, and delaying could cost more than you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-services-sector-logs-15-year-high-inflation-fears-resurface-2781281-2025-09-03",
      "headline": "India's services sector logs 15-year high, inflation fears resurfaceBusiness confidence for the year ahead improved to a three-month-high, helped by expectations of strong demand and higher marketing investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/at-gst-council-meet-opposition-ruled-states-seek-revenue-protection-compensation-plan-sources-2781265-2025-09-03",
      "headline": "Opposition states demand revenue protection at GST Council meet: SourcesThese states have stressed that companies must not profiteer from lower GST rates and that benefits should be passed directly to consumers. They are also pressing for a clear compensation plan to ensure that states do not face massive revenue shortfalls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-3-crucial-decisions-to-watch-out-for-2781234-2025-09-03",
      "headline": "GST Council meeting: 3 crucial decisions to watch out forBig changes may be on the way as the GST Council begins its two-day meeting. From reducing GST slabs to easing compliance, the decisions taken could directly affect consumers and businesses alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rate-cut-common-goods-consumer-benefit-state-vs-centre-nirmala-sitharaman-2781225-2025-09-03",
      "headline": "GST Council meet: Rate cuts may spark clash between Centre and statesThe GST Council Meeting is underway and is expected to lower taxes on daily goods. Lower taxes could encourage spending and give the economy a push, but states worry about their already tight finances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-will-major-tax-overhaul-upset-state-revenues-2781166-2025-09-03",
      "headline": "GST Council meeting: Will major tax overhaul upset state revenues?Initial estimates indicate that states could see annual revenue declines from the proposed cuts, though long-term benefits are expected to outweigh the short-term losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/video/gst-20-implementation-tax-cut-consumer-goods-dussehra-september-5-diwali-bonanza-experts-answer-2781153-2025-09-03",
      "headline": "Will GST 2.0 be implemented by Dussehra? Experts answerThe GST Council Meeting will take place from September 2-4, with a lot of buzz about benefits to consumers with a reduction in tax on daily goods before the festive season begins. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tv-actor-ashish-kapoor-arrested-on-rape-charges-in-pune-2781566-2025-09-03",
      "headline": "TV actor Ashish Kapoor arrested on rape charges in PuneTelevision actor Ashish Kapoor was arrested on rape charges after a woman, who met him through Instagram, accused him of sexually assaulting her during a house party in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-cheers-as-deepika-padukone-becomes-1st-indian-jury-member-for-louis-vuitton-prize-2781564-2025-09-03",
      "headline": "Ranveer cheers as Deepika becomes 1st Indian jury member for Louis Vuitton PrizeActor Deepika Padukone became the first Indian jury member for Louis Vuitton Prize 2025. Her actor-husband Ranveer Singh posted an adorable comment on her recent post from the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-shares-magical-encounter-with-shreya-ghoshal-and-mm-keeravaani-2781443-2025-09-03",
      "headline": "Anupam Kher shares magical encounter with Shreya Ghoshal and MM KeeravaaniAnupam Kher shared a touching video of his \"magical encounter\" with Shreya Ghoshal and MM Keeravaani, where the duo's impromptu singing left fans mesmerised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-leela-bhansali-to-film-love-war-climax-in-sicily-italy-2781512-2025-09-03",
      "headline": "Sanjay Leela Bhansali to film Love & War climax in Sicily, ItalySanjay Leela Bhansali will shoot the climax of 'Love & War' in Sicily, Italy, featuring Ranbir Kapoor, Alia Bhatt, and Vicky Kaushal. The film is scheduled for a release on March 20, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-and-anurag-kashyap-break-the-internet-with-new-condom-ad-2781524-2025-09-03",
      "headline": "Samay Raina and Anurag Kashyap break the internet with new condom adComedian Samay Raina has made waves in Indian advertising with a bold condom-branded campaign featuring filmmaker Anurag Kashyap. The ad's unapologetic tone and witty banter have resonated with audiences. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahan-shetty-says-being-suniel-shetty-son-brings-both-privilege-and-pressure-2781397-2025-09-03",
      "headline": "Ahan Shetty on nepotism: Being Suniel's son brings both privilege and pressureAhan Shetty admitted that being Suniel Shetty's son gives him opportunities but also brings higher expectations and scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nishaanchi-trailer-anurag-kashyap-unleashes-mayhem-with-mafia-politics-and-rivalry-2781506-2025-09-03",
      "headline": "Nishaanchi trailer: Anurag Kashyap unleashes mayhem with mafia, politics and rivalryThe trailer of director Anurag Kashyap's 'Nishaanchi' shows debutant Aaishvary Thackeray in a double-role. The film is set in the hinterlands of Uttar Pradesh from the early 2000s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhukar-zende-charles-sobhraj-capture-netflix-inspector-zende-manoj-bajpayee-2781456-2025-09-03",
      "headline": "Real-life story of Inspector Zende, the man who nabbed Charles Sobhraj twiceNetflix's 'Inspector Zende' brings to life the story of Mumbai cop Madhukar Zende who captured serial killer Charles Sobhraj twice. Here's all you need to know about the former police officer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-prays-for-strength-stands-with-punjab-amid-flood-crisis-2781479-2025-09-03",
      "headline": "Shah Rukh Khan prays for strength, stands with Punjab amid flood crisisShah Rukh Khan has come forward to support Punjab amid severe floods causing widespread devastation. Sharing a post on Instagram on Wednesday, the superstar prayed for strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-life-with-walter-boys-season-2-review-love-loss-and-the-rise-of-cole-as-the-real-hero-2781464-2025-09-03",
      "headline": "My Life With Walter Boys 2 review: Love, loss and Cole's rise as the real heroRelease Date:Thu Aug 28, 2025Netflix's teen drama 'My Life With Walter Boys Season 2' takes Jackie's story forward with more heartbreak, complicated romances, and the ever-intense love triangle between Alex and Cole."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/disha-vakani-taarak-mehta-dayaben-makes-rare-public-appearance-at-lalbaugcha-2781442-2025-09-03",
      "headline": "Disha Vakani, Taarak Mehta's Dayaben, makes rare public appearance at LalbaugchaDisha Vakani made a rare appearance at Mumbai's Lalbaugcha Raja during Ganesh Utsav, sparking fan excitement. Away from television since 2018, her return remains uncertain as the show's creator cites her family commitments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/28-years-later-trailer-humanity-battles-virus-zombies-post-apocalyptic-horror-2781378-2025-09-03",
      "headline": "28 Years Later The Bone Temple trailer: Humans fight against virus, zombiesDirector Nia DaCosta's '28 Years Later: The Bone Temple' has resumed the epic saga with new dangers. The post-apocalyptic film is the third instalment in the coming-of-age horror series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/andhera-actor-karanvir-malhotra-reveals-working-office-boy-in-melbourne-film-festival-2781408-2025-09-03",
      "headline": "Andhera actor Karanvir Malhotra reveals working like an office boy in MelbourneActor Karanvir Malhotra, in an exclusive interaction, spoke about his initial career struggles. He recalled putting up posters outside grocery stores in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranvir-shorey-advises-against-dating-refers-meghalaya-honeymoon-murder-2781331-2025-09-03",
      "headline": "Ranvir Shorey advises against dating, refers to Meghalaya honeymoon murderActor Ranvir Shorey recently expressed his views on the current dating trends. The actor stated that this is not the right time to invest in relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-zaid-darbar-welcome-second-child-a-baby-boy-zehaan-2781336-2025-09-03",
      "headline": "Gauahar Khan, Zaid Darbar announce birth of second child, a baby boyActor Gauahar Khan and her husband Zaid Darbar welcomed their second child on September 1. The couple shared the news with a joint post on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-recalls-working-with-irrfan-in-debut-film-chocolate-2781295-2025-09-03",
      "headline": "Vivek Agnihotri recalls working with Irrfan in debut film Chocolate: I miss himFilmmaker Vivek Agnihotri recalled working with Irrfan Khan in his debut film 'Chocolate', praising the late actor's spontaneous style and unique screen presence. He also shared memories of Irrfan's off-set persona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baseer-farhanas-fight-to-flirt-chemistry-is-the-spicy-twist-bigg-boss-19-needed-2781322-2025-09-03",
      "headline": "Baseer-Farhana's fight-to-flirt chemistry is the spicy twist Bigg Boss 19 neededBaseer Ali Khan and Farhana Bhatt's fiery clashes in 'Bigg Boss 19' are slowly giving way to flirtatious banter and unexpected chemistry. And we are in for it with popcorn!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bridgerton-star-simone-ashley-kiss-with-mystery-man-at-us-open-2781107-2025-09-03",
      "headline": "Bridgerton's Simone Ashley kiss with mystery man at US Open, pics go viralHollywood star Simone Ashley once again made headlines for her personal life after being seen sharing a kiss with a mystery man at the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-part-2-review-a-gothic-return-that-fumbles-under-pressure-2781343-2025-09-03",
      "headline": "Wednesday Season 2 Part 2 review: A gothic return that fumbles under pressureNetflix's 'Wednesday' season 2 part 2 concludes with a stylish but overambitious finale. The season sets up new cliffhangers while struggling with pacing and character depth."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/death-toll-rises-to-37-as-punjab-sees-worst-floods-since-1988-over-35-lakh-impacted-2781533-2025-09-03",
      "headline": "37 dead, over 3.5 lakh impacted as Punjab sees worst floods since 1988Ongoing floods in Punjab have claimed 37 lives, as continued heavy rainfall and rising river levels disrupt daily life across several districts. The worst-affected districts include Gurdaspur, Pathankot, Fazilka, Kapurthala, Tarn Taran, Ferozepur, Hoshiarpur and Amritsar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-targes-india-trade-repeats-zero-tariff-claims-2781459-2025-09-03",
      "headline": "India kills us with tariffs: Trump repeats claim of 'no duty' offer from New DelhiDonald Trump claimed that India, like China and Brazil, \"kills\" the US with tariffs. He said that the tariff gives the US \"tremendous negotiating power.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hot-mic-captures-vladimir-putin-xi-jinping-musing-on-immortality-kim-jong-un-beijing-parade-2781534-2025-09-03",
      "headline": "'Longer you live...': Hot mic catches Putin, Xi musing on immortality, Kim looks onA hot microphone captured a rare unscripted exchange between Russian President Vladimir Putin and Chinese President Xi Jinping — a conversation about organ transplants, longevity, and even the prospect of immortality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rainfall-floods-delhi-ncr-causes-traffic-chaos-waterlogging-yamuna-levels-imd-alerts-weather-forecast-2781422-2025-09-03",
      "headline": "Heavy rain and waterlogging batter Delhi-NCR, Yamuna continues to swellThe water level of River Yamuna in Delhi rose to 207.33 meters by 6 pm on Wednesday, becoming the third-highest level ever recorded in the city's history. Floodwaters also entered relief camps in the Yamuna Bazaar area by evening, prompting evacuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maratha-quota-protest-mumbai-is-manoj-jarange-patil-really-a-achievement-big-historic-win-explained-voices-2781290-2025-09-03",
      "headline": "Has Jarange Patil really won the Maratha quota battle?Maratha quota activist Manoj Jarange Patil called the Maharashtra government's nod to accord the Kunbi status a breakthrough. However, the gains are narrowly tailored for only those Marathas with traceable records and would leave out millions. Is this victory big enough for Patil, who was turned away empty-handed several times?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-11-quarterfinal-live-updates-iga-swiatek-jannik-sinner-new-york-2781540-2025-09-03",
      "headline": "US Open Live: Alex de Minaur takes on Felix Auger-Aliassime, Swiatek up nextUS Open 2025, Day 11 Live Updates: Iga Swiatek will be taking on Amanda Anisimova in the women's singles quarterfinals to start things off. Meanwhile, Jannik Sinner will be in action later on as he takes on Lorenzo Musetti."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sending-resignation-as-brs-member-says-k-kavitha-day-after-being-suspended-over-alleged-anti-party-activities-2781244-2025-09-03",
      "headline": "Conspiracies against me: K Kavitha quits BRS, drops bombshells after suspensionK Kavitha resigned from her MLC post a day after being suspended from the party, intensifying the turmoil within the KCR-led outfit. She accused her cousins Harish Rao and Santosh Kumar of conspiring against her father, weakening the party, and plotting to divide their family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jarange-patil-fast-folds-up-but-can-fadnavis-douse-the-simmering-maratha-fire-2781475-2025-09-03",
      "headline": "Jarange-Patil fast folds up, but can Fadnavis douse the simmering Maratha fire?Manoj Jarange-Patil's mass mobilisation in Mumbai got over with the Mahayuti regime ceding some ground, but the wider question of social acceptance of CM Devendra Fadnavis lingers\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-koreas-great-clean-up-kim-jong-uns-aides-erase-dna-after-talks-with-putin-2781377-2025-09-03",
      "headline": "Kim Jong Un's aides erased DNA after talks with Putin? Video sparks buzzThe unusual spectacle unfolded on Wednesday, shortly after the North Korean and Russian leaders held talks following a grand military parade in Beijing, where Chinese President Xi Jinping showcased his nation's growing diplomatic clout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-korea-kim-jong-un-train-slow-moving-beijing-russia-foreign-trips-secrets-specifications-explained-what-is-inside-2781489-2025-09-03",
      "headline": "Why North Korea's Kim prefers his slow-moving train for trips, what's inside?North Korea's leader Kim Jong Un prefers his slow-moving, green armoured train, The Sun, because it is far safer than the country's aging planes. It doubles as a secure office on wheels, and continues a family tradition from his grandfather's time. It even has space to carry his luxury limousines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tv-actor-ashish-kapoor-arrested-on-rape-charges-in-pune-2781566-2025-09-03",
      "headline": "TV actor Ashish Kapoor arrested on rape charges in PuneTelevision actor Ashish Kapoor was arrested on rape charges after a woman, who met him through Instagram, accused him of sexually assaulting her during a house party in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-victory-day-military-parade-weapons-hypersonic-missiles-fighter-jets-drones-all-details-2781446-2025-09-03",
      "headline": "Hypersonic missiles to under-sea drones: China parades its military muscleWith 20 world leaders in attendance, including Russia's Putin, Xi Jinping paraded an impressive array of drones and advanced hypersonic missiles as China hosted its Victory Day parade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-couple-spends-rs-59-lakh-monthly-shares-expense-list-in-viral-video-2781135-2025-09-03",
      "headline": "Bengaluru couple spends Rs 5.9 lakh monthly, shares expense list in viral videoIn a now-viral video, a Bengaluru-based couple broke down their expenses for the month of August in detail.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-trade-row-trump-tariff-finland-president-warns-india-sco-summit-west-global-south-2781263-2025-09-03",
      "headline": "If we don't engage...: Finland President cautions Trump over Indian foreign policyPointing to last week's SCO summit in China, Finland President Alexander Stubb said the gathering of leaders of the Global South underscored how the bloc is positioning itself against Western influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-aap-mla-reveals-why-he-escaped-cops-denies-opening-fire-feared-encounter-2781551-2025-09-03",
      "headline": "Feared encounter: Punjab AAP MLA reveals why he escaped cops, denies opening fireAAP MLA Harmeet Singh Pathanmajra has denied reports suggesting he fired at police to escape custody. Instead, he alleged that attempts are being made to portray him as a gangster. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/mahua-moitra-ex-partner-pet-dog-custody-delhi-high-court-asks-why-dont-you-settle-it-together-2781452-2025-09-03",
      "headline": "Why don't you settle it? Court to Mahua Moitra, ex-partner over pet dog custodyDuring the hearing, Justice Manoj Jain issued a notice to Mahua Moitra and sought her response while suggesting that the two settle their differences outside the courtroom. \"Why don't you sit together and sort it out? What relief is she seeking in the suit?\" the judge asked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-victoris-unveiled-new-mid-size-suv-with-5-star-bncap-rating-adas-2781271-2025-09-03",
      "headline": "Maruti Suzuki Victoris unveiled: New mid-size SUV with 5-Star BNCAP Rating, ADASMaruti Suzuki has unveiled the Victoris, a new mid-size SUV for its Arena network. Positioned above the Brezza and Grand Vitara, it boasts premium features, multiple powertrains, and a 5-star BNCAP rating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putins-message-amid-ukraine-war-ready-for-talks-if-zelenskyy-comes-to-moscow-2781561-2025-09-03",
      "headline": "Ready for talks if Zelenskyy comes to Moscow: Putin's message amid Ukraine warSpeaking in China at the end of a visit there, Vladimir Putin said that he perceived \"a certain light at the end of the tunnel\" given what he said were sincere efforts by the United States to find a settlement to Europe's biggest land war since World War Two."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/persecuted-minorities-from-afghanistan-bangladesh-pak-who-came-by-2024-will-be-allowed-to-stay-government-2781231-2025-09-03",
      "headline": "CAA cut-off date extended, persecuted minorities who came by 2024 can stay onHindus, Sikhs, Buddhists, Jains, Parsis and Christians from Afghanistan, Pakistan and Bangladesh who entered India on or before December 31, 2024 will be allowed to stay in the country, the government said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-pinarayi-vijayan-is-covering-all-the-bases-for-2026-kerala-polls-2781490-2025-09-03",
      "headline": "How Pinarayi Vijayan is covering all the bases for 2026 Kerala pollsKerala CM Pinarayi Vijayan and the incumbent LDF are strategising how to negate anti-incumbency while pushing the development narrative and consolidating vote-banks\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-life-with-walter-boys-season-2-review-love-loss-and-the-rise-of-cole-as-the-real-hero-2781464-2025-09-03",
      "headline": "My Life With Walter Boys 2 review: Love, loss and Cole's rise as the real heroRelease Date:Thu Aug 28, 2025Netflix's teen drama 'My Life With Walter Boys Season 2' takes Jackie's story forward with more heartbreak, complicated romances, and the ever-intense love triangle between Alex and Cole."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/humans-getting-paid-to-fix-ai-mistakes-freelance-job-trend-2781209-2025-09-03",
      "headline": "AI made the mess. Now humans are getting paid to clean itAI generates content fast but often badly. An MIT report and freelance-platform data show people are earning by fixing AI output, creating a new clean-up niche in the gig economy. Looks like the AI job takeover isn't going to be very successful yet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/ai-predicts-shocking-climate-future-for-pakistan-its-not-armys-fault-2781488-2025-09-03",
      "headline": "AI predicts shocking future for Pakistan. It's not Army's faultAs a nation in the Global South, Pakistan faces limitations in infrastructure and technology to accurately forecast these challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ex-playboy-model-claims-american-air-flight-attendant-told-her-button-up-shirt-boarding-airline-reacts-2781538-2025-09-03",
      "headline": "Ex-Playboy model claims flight attendant told her to 'button up', airline reactsSarah Blake Cheek, an ex-Playboy model, claimed that an American Airlines flight attendant asked her to button up her shirt before boarding because her attire was deemed inappropriate.   "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kamindu-mendis-late-blitz-secures-sri-lanka-win-over-zimbabwe-harare-t20i-2781569-2025-09-03",
      "headline": "Kamindu Mendis guides Sri Lanka to thrilling T20 win over ZimbabweKamindu Mendis' late innings helped Sri Lanka recover from a collapse to win the opening T20I against Zimbabwe in Harare. The victory puts Sri Lanka 1-0 up in the series, leaving Zimbabwe to regret missed chances in a closely fought contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/imane-khelif-genetic-sex-testing-controversy-world-boxing-championships-liverpool-2781558-2025-09-03",
      "headline": "Imane Khelif to miss World Championships amid sex testing eligibility rowAlgerian boxer Imane Khelif will not compete at the World Boxing Championships in Liverpool due to ongoing disputes over mandatory genetic sex testing. The controversy raises questions about fairness and inclusion in female boxing competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-17-year-old-karabo-meso-world-cup-squad-2023-2781545-2025-09-03",
      "headline": "South Africa pick 17-year-old Karabo Meso in Women's ODI World Cup squadSouth Africa have named 17-year-old Karabo Meso in their 15-member World Cup squad. The team aims to blend youth and experience to make a strong title push in India and Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-11-quarterfinal-live-updates-iga-swiatek-jannik-sinner-new-york-2781540-2025-09-03",
      "headline": "US Open Live: Alex de Minaur takes on Felix Auger-Aliassime, Swiatek up nextUS Open 2025, Day 11 Live Updates: Iga Swiatek will be taking on Amanda Anisimova in the women's singles quarterfinals to start things off. Meanwhile, Jannik Sinner will be in action later on as he takes on Lorenzo Musetti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-ashes-return-injury-push-limits-few-risks-2781539-2025-09-03",
      "headline": "Pat Cummins ready to risk it all to get fit by Ashes: Willing to take a few risksAustralia captain Pat Cummins vows to push his limits to recover from a back injury and be fit for the Ashes 2025 opener against England in Perth, determined not to miss the iconic Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-agm-president-ipl-chairman-election-september-2781511-2025-09-03",
      "headline": "High-stakes BCCI AGM to decide new president, IPL chairman in SeptemberThe BCCI Annual General Meeting in September will decide new office bearers including president and IPL chairman. The leadership changes come amid mandatory cooling-off rules and potential impact of the National Sports Governance Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-korea-hockey-asia-cup-live-updates-super-4s-harmanpreet-singh-2781505-2025-09-03",
      "headline": "India vs Korea Live: Mandeep equalises for India, 2-2 in the final quarterIndia vs Korea, Hockey Asia Cup Live updates: Mandeep Singh has equalised for India after their relentless attacking efforts for the majority of the match. The exciting Super 4 clash is in the dying minutes of the final quarter and it is game on in Rajgir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jules-kounde-urges-football-bodies-to-rethink-crowded-calendar-2781495-2025-09-03",
      "headline": "France's Jules Kounde warns overloaded football calendar risks player wellbeingBarcelona and French defender Jules Kounde has called on football's governing bodies to reconsider the congested match calendar. He warns that the relentless schedule is harming players, clubs, and the wider football community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohammed-salah-liverpool-fan-transfer-news-alexander-isak-florian-wirtz-darwin-nunez-luis-diaz-2781455-2025-09-03",
      "headline": "Mohammed Salah fires back at Liverpool fan's transfer jibe: Celebrate great signingsMohammed Salah hit out at a Liverpool fan for their social media post comparing their former players to their latest arrivals. The Egyptian called on the supporters to celebrate their old stars and also their new arrivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-n-srinivasan-return-chairman-big-boost-kasi-viswanathan-2781435-2025-09-03",
      "headline": "Ex-BCCI boss N Srinivasan returns as CSK chairman in 'big boost' for IPL teamN Srinivasan returns as CSK chairman, bringing decades of cricket administration experience. The former BCCI chief will guide Chennai Super Kings' rebuild after their IPL 2025 struggles, overseeing international ventures and lending strategic insight to the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-korea-hockey-asia-cup-live-updates-super-4s-harmanpreet-singh-2781505-2025-09-03",
      "headline": "India vs Korea Live: Mandeep equalises for India, 2-2 in the final quarterIndia vs Korea, Hockey Asia Cup Live updates: Mandeep Singh has equalised for India after their relentless attacking efforts for the majority of the match. The exciting Super 4 clash is in the dying minutes of the final quarter and it is game on in Rajgir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jules-kounde-urges-football-bodies-to-rethink-crowded-calendar-2781495-2025-09-03",
      "headline": "France's Jules Kounde warns overloaded football calendar risks player wellbeingBarcelona and French defender Jules Kounde has called on football's governing bodies to reconsider the congested match calendar. He warns that the relentless schedule is harming players, clubs, and the wider football community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohammed-salah-liverpool-fan-transfer-news-alexander-isak-florian-wirtz-darwin-nunez-luis-diaz-2781455-2025-09-03",
      "headline": "Mohammed Salah fires back at Liverpool fan's transfer jibe: Celebrate great signingsMohammed Salah hit out at a Liverpool fan for their social media post comparing their former players to their latest arrivals. The Egyptian called on the supporters to celebrate their old stars and also their new arrivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-n-srinivasan-return-chairman-big-boost-kasi-viswanathan-2781435-2025-09-03",
      "headline": "Ex-BCCI boss N Srinivasan returns as CSK chairman in 'big boost' for IPL teamN Srinivasan returns as CSK chairman, bringing decades of cricket administration experience. The former BCCI chief will guide Chennai Super Kings' rebuild after their IPL 2025 struggles, overseeing international ventures and lending strategic insight to the franchise."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}