{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-nasdaq-fall-to-lowest-levels-in-over-six-months-amid-tariff-worries-glbs-2701933-2025-03-31",
      "headline": "S&P 500, Nasdaq fall to lowest levels in over six months amid tariff worriesUS stocks tumbled to their lowest levels in over six months as worries over new tariffs weighed on investor sentiment. With fears of a global slowdown and rising inflation, the S&P 500 and Nasdaq saw sharp declines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-drops-in-what-causing-indians-to-spend-less-2701752-2025-03-31",
      "headline": "Credit card spending drops. What's causing Indians to spend less?Big credit card issuers like HDFC Bank, SBI Cards, and ICICI Bank witnessed fewer new customers in February. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-could-lead-to-another-round-of-stock-market-correction-key-things-to-know-2701667-2025-03-31",
      "headline": "US reciprocal tariffs: Will Dalal Street face more turbulence from April 2?US reciprocal tariffs have put Dalal Street on edge as investors brace for potential market swings. With FPIs cautious and auto stocks under pressure, domestic markets could face more turbulence in the near term.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-stock-market-impact-9-stocks-to-watch-buy-sell-hold-investor-advice-expert-view-2701644-2025-03-31",
      "headline": "Trump tariffs could hit these 9 stocks. Should you sell?The IT sector is under pressure due to concerns over Trump's trade policies and potential increases in H-1B visa costs. Indian IT firms earn over 50% of their revenue from the US, making them vulnerable to higher hiring costs and reduced outsourcing contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-primark-boss-paul-marchant-resigns-after-error-of-judgement-2701626-2025-03-31",
      "headline": "UK's Primark boss resigns after 'error of judgement' in social settingThe group said on Monday that Paul Marchant had cooperated with an investigation led by external lawyers, acknowledged his \"error of judgement\" and accepted that his actions fell below the standards expected by AB Foods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/claiming-hra-but-not-paying-tds-beware-of-tax-notices-and-penalties-2701582-2025-03-31",
      "headline": "Claiming HRA but not paying TDS? Beware of tax notices and penaltiesThe landlord's PAN must be mentioned in the TDS challan. However, if the PAN is missing or inactive, the TDS is levied at 20% under Section 206AA. On the other hand, for Non-Resident Indian (NRI) landlords, the rate of TDS is 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-fy26-slow-start-4-listings-sme-platform-desco-infratech-shri-ahimsa-naturals-atc-energies-2701574-2025-03-31",
      "headline": "IPO market off to a slow start in FY26, but these 4 firms to debut soonThe IPO pipeline for FY26 could be worth nearly Rs 2 lakh crore. Some major companies, including Zepto, Reliance Jio, and LG Electronics, are reportedly in the process of finalising their listing plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldiram-stake-sale-temasek-pwc-expansion-snacks-packaged-foods-market-2701531-2025-03-31",
      "headline": "Haldiram's to sell stake to Singapore's Temasek, says PwCThis stake sale is expected to help Haldiram expand both in India and internationally, strengthening its position in the highly competitive snacks and packaged foods market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-to-get-costlier-may-1-rs-23-charges-go-up-check-new-rbi-rules-here-2701499-2025-03-31",
      "headline": "ATM withdrawals to cost Rs 23 from May 1 as RBI hikes fee. Check detailsATM cash withdrawal will see an increase from the current charge of Rs 21 per transaction. Despite the fee hike, customers will continue to receive a limited number of free ATM transactions every month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-eid-2025-is-nse-bse-closed-for-trading-monday-dalal-street-sensex-nifty-2701479-2025-03-31",
      "headline": "Is stock market closed today for Eid?The stock market follows a five-day workweek, operating from Monday to Friday. Regular trading hours are from 9:15 am to 3:30 pm. Markets remain closed on weekends and designated public holidays as per the official schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sukanya-samriddhi-yojana-ssy-help-save-rs-20-lakh-in-15-years-for-your-daughter-education-2700387-2025-03-28",
      "headline": "How this scheme can help you save Rs 20 lakh in 15 years for daughterIf you are planning for your daughter's higher education expenses, the Sukanya Samriddhi Yojana (SSY) can be a great savings option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-youngest-billionaire-razorpay-founders-harshil-mathur-shashank-kumar-age-34-2700382-2025-03-28",
      "headline": "Razorpay's Shashank Kumar, Harshil Mathur become India's youngest billionairesHarshil Mathur and Shashank Kumar met at IIT Roorkee, where they shared an interest in technology and problem-solving. Their journey into fintech began in 2014 when they launched Razorpay to simplify digital payments in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-30-points-lower-nifty-flat-in-early-trade-infosys-mahindra-down-up-to-3-percent-2700328-2025-03-28",
      "headline": "Sensex, Nifty fall in early trade over Trump tariff threats; Infosys down 2%The S&P BSE Sensex lost 282.59 points to 77,323.84, while the NSE Nifty50 was down 84.70 points to 23,507.25 as of 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-services-unavailable-on-march-31-fund-transfer-cash-deposit-withdrawal-rtgs-neft-financial-year-end-2700325-2025-03-28",
      "headline": "Planning a bank transfer on March 31? Here's why it may not workWhile banks will remain open, transactions like fund transfers, cash deposits, and withdrawals may not go through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-28-infosys-tata-motors-bel-adani-power-hcltech-and-more-2700293-2025-03-28",
      "headline": "Stocks to watch today: Infosys, Tata Motors, BEL, Adani Power, HCLTech and moreMarkets are set for a strong start on March 6 as key stocks like Infosys, Tata Motors, and Adani Power grab attention. Trade talks, global deals, and company moves could shape today's trading session. Here's what investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-on-march-28-sensex-nifty-trends-expert-view-key-factors-2700290-2025-03-28",
      "headline": "Sensex, Nifty today: Will positive run continue on stock market?Stock market opening today: The Sensex and Nifty gained in the previous session amid reports of positive talks between Indian and US officials about a trade deal. Analysts have noted that the focus during today's trading session will be on upcoming tariff developments and the India-US trade deal outcome.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-suspends-wto-financial-contributions-report-glbs-2700200-2025-03-27",
      "headline": "US suspends WTO financial contributions: ReportThe Trump administration has reportedly suspended financial contributions to The World Trade Organisation amid efforts to cut back government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-as-auto-tariffs-hurt-gm-help-tesla-and-others-glbs-2700188-2025-03-27",
      "headline": "Wall Street drifts as auto tariffs hurt GM, help Tesla and othersDonald Trump's auto tariffs impacted Wall Street on Thursday morning, with autogiant General Motors falling by 6.8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-25-auto-tariff-which-indian-companies-will-pay-the-price-glbs-2700039-2025-03-27",
      "headline": "Trump's 25% auto tariff: Which Indian companies will pay the priceUS President Donald Trump's 25% tariff on car imports will affect a few Indian companies, including Tata Motors, Eicher Motors, and Samvardhana Motherson. These firms ship components to the US and Europe's markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-close-higher-top-gainers-and-losers-donald-trump-tariff-impact-and-more-2700007-2025-03-27",
      "headline": "Sensex, Nifty close higher: Top gainers and losers, tariff impact and key driversStock market today: Some of the top gainers during today's session were Bajaj Finserv, IndusInd Bank, NTPC, L&T, Ultratech Cement, Hero MotoCorp, Adani Enterprises and BPCL. On the other hand, some of the top losers were Tata Motors, Sun Pharma, Eicher Motors, Apollo Hospitals, Bharti Airtel, Kotak Mahindra Bank and HCLTech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-318-points-higher-nifty-just-below-23600-tata-motors-down-5-2699968-2025-03-27",
      "headline": "Sensex ends 318 points higher, Nifty just below 23,600; Tata Motors down 5%Stock market closing bell: The S&P BSE Sensex ended 317.93 points higher at 77,606.43, while the NSE Nifty50 rose 105.10 points to settle at 23,591.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-greater-noida-flats-to-get-costlier-registration-fees-increase-20-30-percent-2699948-2025-03-27",
      "headline": "Noida, Greater Noida flat registration fees may rise 20-30%According to a draft notification, circle rates in Noida could see a 20% hike, while in Greater Noida, the increase may go up to 30%. The move is expected to make property transactions more expensive in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-only-follows-dharmendra-after-his-father-wants-to-remake-his-3-films-2701968-2025-03-31",
      "headline": "Salman Khan only follows Dharmendra after his father, wants to remake his 3 filmsBollywood superstar Salman Khan recently revealed his admiration for veteran actor Dharmendra, stating he follows him more than Dharmendra's own sons. Salman also expressed interest in remaking three of Dharmendra's iconic films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-performs-at-wankhede-ahead-of-mi-vs-kkr-match-father-chunky-reacts-2701947-2025-03-31",
      "headline": "Ananya Panday performs at Wankhede ahead of MI vs KKR match, father Chunky reactsActor Ananya Panday lit up the Wankhede Stadium with her dance performance before the IPL match between KKR and MI. Her energetic moves thrilled Bollywood fans and added glamour to the cricket event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-vibes-with-indian-auto-driver-to-new-hit-azizam-2701944-2025-03-31",
      "headline": "Nothing, just Ed Sheeran vibing with Indian auto driver to new song AzizamSinger Ed Sheeran is set to release his first single of 2025, Azizam, soon. Ahead of the release, he shared a video from his visit to India, where he is seen vibing to the track's lyrics with an autorickshaw driver during a ride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-prithviraj-sukumaran-l2-empuraan-beats-chhaava-to-become-fastest-rs-200-crore-grosser-in-2025-2701919-2025-03-31",
      "headline": "L2 Empuraan races past Chhaava to become 2025's fastest Rs 200 crore grosserMohanlal and Prithviraj Sukumaran's L2: Empuraan raced past the box office records of Vicky Kaushal's Chhaava to become the fastest film to enter the Rs 200 crore club. The film hit theatres on March 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sardar-2-teaser-karthi-takes-on-sj-suryah-in-ps-mithran-sequel-2701890-2025-03-31",
      "headline": "Sardar 2 teaser: Karthi takes on 'Black Dagger' SJ Suryah in PS Mithran's sequelThe teaser of Sardar 2, starring Karthi, was unveiled on Eid 2025. The clip introduces SJ Suryah as the main antagonist, who takes on the Indian spy Sardar, played by Karthi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exploring-final-destination-the-only-franchise-where-death-holds-a-grudge-2701182-2025-03-31",
      "headline": "Exploring Final Destination: The only franchise where Death holds a grudgeThe Final Destination series stands out in the horror genre by making Death the unstoppable antagonist. The twist in Final Destination 5 redefined the timeline, proving the franchise's unique narrative depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-leads-eid-ul-fitr-2025-wishes-from-bollywood-priyanka-chopra-varun-dhawan-join-2701872-2025-03-31",
      "headline": "Shah Rukh Khan leads Eid wishes from Bollywood, Priyanka Chopra, Varun Dhawan joinOn the auspicious occasion of Eid-ul-Fitr on March 31, celebrities including Shah Rukh Khan, Salman Khan, Aamir Khan, Varun Dhawan, Jr NTR, Mahesh Babu, and Priyanka Chopra, extended wishes to their fans via their respective social media handles. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-crazy-fan-encounter-entered-house-had-scissors-2701871-2025-03-31",
      "headline": "Malaika Arora recounts 'crazy' fan entering her house: She had scissorsMalaika Arora recounts a frightening fan encounter, when a female fan entered her house and sat in her living room, without permission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-6-review-ted-black-hero-entry-but-he-is-no-harvey-spectoryet-2701839-2025-03-31",
      "headline": "Suits LA Episode 6: Ted Black's hero entry, but he's no Harvey Spector...yet! In the latest episode of 'Suits LA', we see Ted Black finally winning it all, including our hearts - something that was required for the show to mark its presence among the ardent fans of 'Suits'. However, it still doesn't show any sign of Harvey Spector on the West Coast. Spoilers ahead for those who haven't watched a single episode from the season so far!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-cancels-mexico-show-due-to-severe-food-poisoning-apologises-to-fans-2701818-2025-03-31",
      "headline": "Zayn Malik cancels Mexico show due to severe food poisoning: Sorry to let you downZayn Malik was forced to cancel his Mexico City concert after suffering from severe food poisoning. The singer expressed his heartbreak and gratitude towards fans for their understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-eid-2025-waves-fans-from-galaxy-through-bulletproof-glass-check-viral-pics-2701813-2025-03-31",
      "headline": "Salman Khan makes mandatory Eid appearance, greets fans through bulletproof glassActor Salman Khan greeted his fans on Eid. The superstar waved to the fans while standing behind the bulletproof glass that he got installed at his Galaxy apartment earlier this year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-controversy-over-riot-depiction-timeline-2701788-2025-03-31",
      "headline": "Explained: Mohanlal's Empuraan controversy over riot depictionMohanlal and director Prithviraj Sukumaran's 'L2: Empuraan' is in the midst of a political storm over sequences that appear to be references to the 2002 Gujarat riots. From backlash from right-wing factions to the film being re-edited, here's all that happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-funny-reaction-not-bringing-cook-dilip-at-lakme-fashion-week-watch-2701760-2025-03-31",
      "headline": "Watch: Farah Khan's funny reaction as paps ask about not bringing cook Dilip at LFWAt Lakme Fashion Week, Farah Khan had a hilarious reaction when asked about her cook, Dilip. The viral moment left fans joking that Dilip is now a bigger star than Farah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-press-conference-for-kim-sae-ron-everything-that-he-said-about-death-controversy-case-lawsuit-to-denying-allegations-2701749-2025-03-31",
      "headline": "Lawsuit to denying allegations, everything Kim Soo-hyun said on Kim Sae-ron caseFor the first time since Kim Sae-ron's death snowballed into a big controversy, Korean actor Kim Soo-hyun spoke about what all happened, asking fans to give him a fair chance to present his side of the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tanmay-bhat-trolls-ranveer-allahbadia-rebirth-post-ashish-chanchlani-comments-2701751-2025-03-31",
      "headline": "Tanmay Bhat trolls Ranveer Allahbadia on rebirth post, Ashish Chanchlani commentsRanveer Allahbadia's recent posts announcing his comeback had comments from several people, including Ashish Chanchlani and Apoorva Mukhija, who were a part of the same India's Got Latent episode as him. Tanmay Bhat also dropped cheeky comments on one of the posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-joins-the-ghibli-trend-shares-ai-edited-pics-from-his-fan-meet-2701726-2025-03-31",
      "headline": "Amitabh Bachchan hops on Ghibli trend, shares AI edited pics from his fan meetVeteran actor Amitabh Bachchan is the latest to share his Ghibli edits, sharing his thoughts on this popular trend. The latest trend has taken over the internet for the last few days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/45-teaser-a-mythology-inspired-showdown-between-shiva-rajkumar-upendra-for-raj-b-shetty-2701684-2025-03-31",
      "headline": "45 teaser: Mythology-inspired showdown between Shiva Rajkumar, UpendraThe teaser of '45', starring Shiva Rajkumar, Upendra and Raj B Shetty, was released on March 30, 2025, marking the festive occasion of Ugadi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-on-adapting-to-social-media-challenges-2701721-2025-03-31",
      "headline": "Prajakta Koli on adapting to social media's challenges: You either swim or surfPrajakta Koli opens up about social media scrutiny, adapting to feedback, and learning from mistakes. She reflects on evolving as a creator while balancing authenticity and audience accountability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-breaks-silence-in-kim-sae-ron-death-case-gets-emotional-took-me-so-long-2701693-2025-03-31",
      "headline": "Emotional Kim Soo-hyun says sorry, speaks on Kim Sae-ron death: Took me so longKim Soo-hyun said in a press conference that he feels distressed for the late actor and his ex-girlfriend Kim Sae-ron. He accepted his relationship with Sae-ron, but maintained that she wasn't a minor when they dated each other four years ago. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/security-forces-terrorists-jammu-kashmir-kathua-encounter-gunfight-2701966-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3 terrorists trapped in fresh gunfight in J&K's Kathua, third operation in 9 daysA fresh exchange of fire was reported between security forces and terrorists in the Ramkot area in Jammu and Kashmir's Kathua district. This is the third such gunbattle in the district in the past nine days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/well-fly-again-sunita-williams-and-butch-wilmore-confident-in-starliners-future-2701994-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams and Butch Wilmore confident in Starliner's futureBoth astronauts expressed humility and honor in returning home, emphasizing their confidence in Nasa's decision-making process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-sunita-williams-shares-insights-about-living-286-days-in-space-2701740-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch LIVE: Feeling good, says Sunita Williams in first address since space returnDuring their extended mission, Williams and Wilmore traveled over 121 million miles, completed 4,576 orbits around Earth, and spent a total of 286 days in space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-indias-northeast-states-seven-sisters-bid-to-lure-chinese-investments-xi-jinping-2701830-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yunus refers to India's northeast states in bid to lure China; eyebrows raisedMuhammad Yunus, head of Bangladesh's interim government, referred to the seven states in northeast India, seeking to attract Chinese investment to his country. He positioned Bangladesh as the \"only guardian of the ocean\" and said China could use it as a gateway for economic expansion. Eyebrows were raised at his reference to \"landlocked\" Indian states during his China visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-ashwani-kumar-comments-reactions-2701931-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ashwani Kumar relishes dream debut: 1 banana for lunch, 4 wickets for dinnerMumbai Indians' Ashwani Kumar bowled an incredible spell on debut at the Wankhede Stadium. Ashwani became the first ever Indian bowler to pick up 4 wickets in his debut match in the IPL. In the mid-innings interview, he revealed the nervy moments before the match."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-officers-reach-kunal-kamra-home-eknath-shinde-joke-row-2701821-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cops visit Kunal Kamra's Mumbai home amid row, comedian calls it 'waste of time'Several cops visited Kunal Kamra's residence after he failed to appear for questioning in Mumbai. The comedian called the move a \"waste of time\", adding he hasn't lived there for 10 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-dead-toll-in-firecracker-explosion-triggered-by-cylinder-blast-2701975-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7 of family dead in firecracker explosion triggered by cylinder blast in BengalSeven people, including three children, died in a firecracker explosion triggered by a cylinder blast in South 24 Parganas, West Bengal. Four remain missing. Police are investigating, while officials assess the cause of the incident.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-rejects-new-york-times-report-on-hals-russia-link-calls-it-misleading-2701898-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India rejects New York Times report on HAL's Russia link, calls it 'misleading'India has dismissed The New York Times report alleging HAL supplied sensitive technology to a Russian arms agency, calling it misleading. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/girl-dies-run-over-hyundai-car-driven-teen-delhi-paharganj-accused-arrested-2701778-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Toddler dies after being crushed under car driven by 15-year-old neighbourA two-year-old girl died after she was hit by a Hyundai Venue car driven by her 15-year-old neighbour in central Delhi's Paharganj. The teen and his father, the owner of the vehicle, were arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-lok-sabha-senior-ministers-india-bloc-leaders-parliament-2701916-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf bill to be presented in Lok Sabha on April 2: SourcesThe amended Waqf Bill is set to be tabled in the Lok Sabha on April 2. The BJP is engaging with India Bloc leaders to secure support. The bill has faced opposition, with critics calling it unconstitutional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-woman-hacked-husband-whatsapp-raped-blackmailed-women-arrested-2701935-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wife hacks husband's WhatsApp, learns he sexually abused women, gets him arrestedA 24-year-old woman from Nagpur got her husband, 32, arrested after she hacked into his WhatsApp and found out he blackmailed and allegedly sexually abused several women, including a 19-year-old."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-trivendra-rawats-illegal-mining-charge-says-about-uttarakhand-bjp-2701763-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What Trivendra Rawat's 'illegal mining' charge says about Uttarakhand BJPRawat, replaced as Uttarakhand CM in 2021, has since had several of his government's key decisions overturned by Pushkar Singh Dhami\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-leads-eid-ul-fitr-2025-wishes-from-bollywood-priyanka-chopra-varun-dhawan-join-2701872-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shah Rukh Khan leads Eid wishes from Bollywood, Priyanka Chopra, Varun Dhawan joinOn the auspicious occasion of Eid-ul-Fitr on March 31, celebrities including Shah Rukh Khan, Salman Khan, Aamir Khan, Varun Dhawan, Jr NTR, Mahesh Babu, and Priyanka Chopra, extended wishes to their fans via their respective social media handles. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-does-india-look-from-space-sunita-williams-answers-2701996-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How does India look from space? Sunita Williams answersWilliams expressed excitement about reconnecting with India and her enthusiasm for India's growing role in space exploration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-score-ashwani-kumar-ryan-rickelton-mumbai-2701956-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Debutant Ashwani Kumar fires as MI decimate KKR to open account in styleIPL 2025, MI vs KKR match report: Ashwani Kumar's four-wicket haul and Ryan Rickelton's unbeaten 62 helped Mumbai Indians hammer Kolkata Knight Riders by 8 wickets. The five-time champions won their first game of the season in style, making a big statement of intent. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ifs-nidhi-tewari-appointed-pm-modis-private-secretary-all-we-know-about-her-2701637-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Nidhi Tewari, IFS officer appointed as PM Modi's private secretary?Nidhi Tewari, a 2014-batch IFS officer, is currently serving as Deputy Secretary in the Prime Minister's Office (PMO)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-6-review-ted-black-hero-entry-but-he-is-no-harvey-spectoryet-2701839-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suits LA Episode 6: Ted Black's hero entry, but he's no Harvey Spector...yet! In the latest episode of 'Suits LA', we see Ted Black finally winning it all, including our hearts - something that was required for the show to mark its presence among the ardent fans of 'Suits'. However, it still doesn't show any sign of Harvey Spector on the West Coast. Spoilers ahead for those who haven't watched a single episode from the season so far!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/imd-summer-season-hotter-than-usual-temperatures-heatwave-days-india-2701837-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "April to be hotter than usual with 3 heatwave days in Delhi, 6 in Bengal, BiharMost parts of India, including Odisha, West Bengal, Bihar, Jharkhand, Delhi and other parts of northwest India may face more heatwave days from April to June, the IMD said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-toll-death-injured-bangkok-mandalay-epicentre-2701811-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar quake toll crosses 2,000, search for survivors onThe death toll from the 7.7 magnitude earthquake, which struck Myanmar on March 28, crossed the 2,000-mark and over 3,900 people were injured. Rescuers were racing against time to search for more survivors three days after the temblor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/not-able-to-create-ghibli-style-images-here-is-a-prompt-that-should-work-2701560-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not able to create Ghibli style images? Here is a prompt that should workA primary reason why some users are unable to generate Ghibli-style images is that they are not using the right prompt. Here is how to quickly create Ghibli style images on ChatGPT or Grok AI."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/sikandar-is-a-drab-sluggish-being-human-campaign-for-salman-khan-2701698-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Sikandar' is a drab, sluggish 'being human' campaign for Salman KhanThe A.R. Murugadoss film shows the limitations of Salman Khan's charisma and how the old formula of 'protagonist as the eternal saviour' desperately needs an update\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/message-from-maha-kumbh-bjp-rss-bonhomie-pm-narendra-modi-mohan-bhagwat-up-cm-yogi-adityanath-2701728-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Message from the Maha Kumbh and the BJP-RSS bonhomieThe unprecedented gathering at the Maha Kumbh in Prayagraj must have sent a powerful signal to the BJP and the RSS. Like he did after the game-changing UP election in 2017, PM Narendra Modi acknowledged this ground message from Prayagraj during his visit to the RSS headquarters in Nagpur. It's time for the two to ride the wave together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-bjp-tmc-eid-event-kolkata-ganda-dharm-remark-2701796-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "At Eid event, Mamata Banerjee says BJP creating 'ganda dharm', party hits backWest Bengal Chief Minister Mamata Banerjee lashed out at the BJP, accusing it of spreading divisive politics and creating a 'ganda dharm'. The BJP hit back, accusing her of doing appeasement politics and calling her an anti-Hindu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thiland-earthquake-probe-against-chinese-firm-after-bangkok-skyscraper-collapsed-in-friday-quake-2701683-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stolen papers, China link emerge in probe into Bangkok quake high-rise collapseThai authorities are investigating a Chinese-backed firm after a 33-storey high-rise in Bangkok collapsed during Myanmar's 7.7-magnitude earthquake, killing 17. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-mi-vs-kkr-wankhede-2701997-2025-04-01",
      "headline": "IPL 2025 Points Table, March 31: MI jump to sixth spot after thrashing KKRMumbai Indians' emphatic win over Kolkata Knight Riders propelled them to the sixth spot in the IPL points table, while the defending champions struggle at the bottom after managing just one win in three games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-ravindra-jadeja-insta-story-ms-dhoni-2701988-2025-04-01",
      "headline": "Ravindra Jadeja's Insta story after CSK's loss to RR goes viral: Things will changeIPL 2025: A day after Chennai Super Kings flopped in Guwahati, Ravindra Jadeja shared an Instagram story, promising fans of a strong comeback. He shared a photo of himself and MS Dhoni from Sunday's defeat to Rajasthan Royals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-dropped-mumbai-indians-michael-vaughan-2701984-2025-04-01",
      "headline": "Rohit Sharma would be dropped from MI if not for his name: VaughanMichael Vaughan questioned Rohit Sharma's place in Mumbai Indians' lineup, stating that without his heritage-rich name and IPL legacy, his ongoing form would have seen him dropped. Vaughan highlights Rohit's lack of fifties and centuries in IPL as a major concern for MI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-indian-with-most-t20-runs-virat-kohli-suresh-raina-mi-vs-kkr-ipl-2701979-2025-03-31",
      "headline": "Suryakumar Yadav becomes 5th Indian batter to hit 8000 T20 runsMumbai Indians batter Suryakumar Yadav joined an elite list during the team's match against KKR. Suryakumar reached 8000 T20 runs during his rapid 27* off 9 balls at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-ashwani-kumar-mumbai-scouting-team-hardik-pandya-2701977-2025-03-31",
      "headline": "Hardik Pandya, fans praise MI's scouting team: Better search engine than GoogleIPL 2025, MI vs KKR: Captain Hardik Pandya heaped praise on Mumbai Indians' scouting team after 23-year-old Ashwani Kumar shone on debut. The left-arm pacer is the latest in the assembly line of exciting talents unearthed by the five-time champions.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-elgton-jenkins-moving-to-center-for-2025-says-packers-gm-glbs-2701976-2025-03-31",
      "headline": "NFL: Elgton Jenkins moving to center for 2025, says Packers GMPackers GM Brian Gutekunst confirmed Elgton Jenkins will shift from guard to center, strengthening Green Bay's offensive line and providing stability for quarterback Jordan Love in the 2025 NFL season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-flagg-broome-clayton-lead-star-studded-final-four-clash-between-no-1-seeds-glbs-2701974-2025-03-31",
      "headline": "March Madness 2025: Flagg, Broome, Clayton lead star-studded final four clash between no. 1 seedsThe Final Four features top-seeded powerhouses as Auburn, Florida, Houston, and UConn battle for supremacy. Players like Flagg, Broome, and Clayton are set to shine on college basketball's biggest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suryakumar-yadav-unreal-shot-ryan-rickleton-mi-vs-kkr-2701970-2025-03-31",
      "headline": "Suryakumar Yadav is a joke: Ryan Rickleton amazed with unreal shot vs KKRRyan Rickleton and Suryakumar Yadav's fiery partnership guided Mumbai Indians to a dominant win over Kolkata Knight Riders, with the latter's outrageous second-ball six leaving both his teammates and opponents stunned at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kevin-durant-injured-dillon-brooks-ejected-as-phoenix-suns-fall-to-houston-rockets-in-blowout-loss-glbs-2701969-2025-03-31",
      "headline": "NBA: Kevin Durant injured, Dillon Brooks ejected as Phoenix Suns fall to Houston Rockets in blowout lossThe Phoenix Suns' postseason hopes took a massive hit on Sunday night as all-star forward Kevin Durant suffered a left ankle injury during a game against the Houston Rockets on March 30 during a regular NBA game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-score-ashwani-kumar-ryan-rickelton-mumbai-2701956-2025-03-31",
      "headline": "Debutant Ashwani Kumar fires as MI decimate KKR to open account in styleIPL 2025, MI vs KKR match report: Ashwani Kumar's four-wicket haul and Ryan Rickelton's unbeaten 62 helped Mumbai Indians hammer Kolkata Knight Riders by 8 wickets. The five-time champions won their first game of the season in style, making a big statement of intent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-ashwani-kumar-comments-reactions-2701931-2025-03-31",
      "headline": "Ashwani Kumar relishes dream debut: 1 banana for lunch, 4 wickets for dinnerMumbai Indians' Ashwani Kumar bowled an incredible spell on debut at the Wankhede Stadium. Ashwani became the first ever Indian bowler to pick up 4 wickets in his debut match in the IPL. In the mid-innings interview, he revealed the nervy moments before the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-flagg-broome-clayton-lead-star-studded-final-four-clash-between-no-1-seeds-glbs-2701974-2025-03-31",
      "headline": "March Madness 2025: Flagg, Broome, Clayton lead star-studded final four clash between no. 1 seedsThe Final Four features top-seeded powerhouses as Auburn, Florida, Houston, and UConn battle for supremacy. Players like Flagg, Broome, and Clayton are set to shine on college basketball's biggest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suryakumar-yadav-unreal-shot-ryan-rickleton-mi-vs-kkr-2701970-2025-03-31",
      "headline": "Suryakumar Yadav is a joke: Ryan Rickleton amazed with unreal shot vs KKRRyan Rickleton and Suryakumar Yadav's fiery partnership guided Mumbai Indians to a dominant win over Kolkata Knight Riders, with the latter's outrageous second-ball six leaving both his teammates and opponents stunned at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kevin-durant-injured-dillon-brooks-ejected-as-phoenix-suns-fall-to-houston-rockets-in-blowout-loss-glbs-2701969-2025-03-31",
      "headline": "NBA: Kevin Durant injured, Dillon Brooks ejected as Phoenix Suns fall to Houston Rockets in blowout lossThe Phoenix Suns' postseason hopes took a massive hit on Sunday night as all-star forward Kevin Durant suffered a left ankle injury during a game against the Houston Rockets on March 30 during a regular NBA game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-score-ashwani-kumar-ryan-rickelton-mumbai-2701956-2025-03-31",
      "headline": "Debutant Ashwani Kumar fires as MI decimate KKR to open account in styleIPL 2025, MI vs KKR match report: Ashwani Kumar's four-wicket haul and Ryan Rickelton's unbeaten 62 helped Mumbai Indians hammer Kolkata Knight Riders by 8 wickets. The five-time champions won their first game of the season in style, making a big statement of intent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-ashwani-kumar-comments-reactions-2701931-2025-03-31",
      "headline": "Ashwani Kumar relishes dream debut: 1 banana for lunch, 4 wickets for dinnerMumbai Indians' Ashwani Kumar bowled an incredible spell on debut at the Wankhede Stadium. Ashwani became the first ever Indian bowler to pick up 4 wickets in his debut match in the IPL. In the mid-innings interview, he revealed the nervy moments before the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashwani-kumar-mi-vs-kkr-debut-record-indian-premier-league-2701917-2025-03-31",
      "headline": "MI's Ashwani Kumar becomes 1st Indian bowler to take 4 wickets on IPL debutIPL 2025, MI vs KKR: Left-arm fast bowler Ashwani Kumar became the first Indian man in the history of the Indian Premier League to take more than 3 wickets on debut in the tournament. He rattled Kolkata Knight Riders at the Wankhede Stadium on Monday, March 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-hardik-pandya-cheers-mumbai-wankhede-stadium-2701908-2025-03-31",
      "headline": "Watch: Mumbai Indians fans cheer for Hardik Pandya a year after booing sagaIPL 2025, MI vs KKR: A year after he was relentlessly booed by the home crowd, Hardik Pandya got a roaring reception when he stepped up for the toss in Mumbai Indians' first home game of the season on Monday, March 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-who-is-ashwani-kumar-2701896-2025-03-31",
      "headline": "Who is Ashwani Kumar? MI pacer picks up wicket in first ball on IPL debutFast bowler Ashwani Kumar picked up a wicket with the very first ball of his IPL career. Ashwani sent back KKR captain Ajinkya Rahane in the fourth over of the match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-vs-lucknow-super-giants-azmatullah-omarzai-2701864-2025-03-31",
      "headline": "Want to be a proper fast bowler: Pubjab Kings pacer Azmatullah OmarzaiAzmatullah Omarzai, the Afghan pacer for Punjab Kings, is determined to establish himself as a genuine fast bowler in the Indian Premier League (IPL) 2025, moving beyond his role as an all-rounder to become a key asset in the pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-speech-srh-ipl-2025-2701860-2025-03-31",
      "headline": "We are SRH, we don't play safe and score 160-170: Pat CumminsSunRisers Hyderabad captain Pat Cummins has backed the team's methods despite two losses in the Indian Premier League. Cummins issued a warcry and said that SRH were not the kind of team who played safe and score 160-170 runs per game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-rohit-sharma-impact-player-pep-talk-wankhede-stadium-2701857-2025-03-31",
      "headline": "MI vs KKR: Rohit Sharma named Impact Player after fiery pep talk in huddleIPL 2025, MI vs KKR: Mumbai Indians nominated Rohit Sharma as their impact player for Monday's clash at home. Rohit addressed the team huddle, giving his teammates a fiery pep talk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-intent-delhi-capitals-debut-hemang-badani-coach-2701834-2025-03-31",
      "headline": "KL Rahul 2.0? Hemang Badani lauds early glimpse in Delhi Capitals debutIPL 2025: Making his debut for Delhi Capitals on Sunday in Visakhapatnam, KL Rahul smashed 15 from just 5 deliveries in their successful chase of 164 against SunRisers Hyderabad. Rahul is expected to play an aggressor's role in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-kkr-live-score-ipl-match-today-updates-mumbai-hardik-ajinkya-2701831-2025-03-31",
      "headline": "MI vs KKR Highlights: Mumbai thrash Kolkata by 8 wickets at WankhedeMumbai Indians (MI) vs Kolkata Knight Riders (KKR) Highlights, IPL 2025: Mumbai Indians clinched a dominating 8-wicket win over Kolkata Knight Riders, with a high-class performance with both bat and ball. MI found match-winning heroes in debutant Ashwani Kumar's four-wicket -haul in the first innings, and then half-century star Ryan Rickleton in their 117 chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-speech-srh-ipl-2025-2701860-2025-03-31",
      "headline": "We are SRH, we don't play safe and score 160-170: Pat CumminsSunRisers Hyderabad captain Pat Cummins has backed the team's methods despite two losses in the Indian Premier League. Cummins issued a warcry and said that SRH were not the kind of team who played safe and score 160-170 runs per game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-rohit-sharma-impact-player-pep-talk-wankhede-stadium-2701857-2025-03-31",
      "headline": "MI vs KKR: Rohit Sharma named Impact Player after fiery pep talk in huddleIPL 2025, MI vs KKR: Mumbai Indians nominated Rohit Sharma as their impact player for Monday's clash at home. Rohit addressed the team huddle, giving his teammates a fiery pep talk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-intent-delhi-capitals-debut-hemang-badani-coach-2701834-2025-03-31",
      "headline": "KL Rahul 2.0? Hemang Badani lauds early glimpse in Delhi Capitals debutIPL 2025: Making his debut for Delhi Capitals on Sunday in Visakhapatnam, KL Rahul smashed 15 from just 5 deliveries in their successful chase of 164 against SunRisers Hyderabad. Rahul is expected to play an aggressor's role in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-kkr-live-score-ipl-match-today-updates-mumbai-hardik-ajinkya-2701831-2025-03-31",
      "headline": "MI vs KKR Highlights: Mumbai thrash Kolkata by 8 wickets at WankhedeMumbai Indians (MI) vs Kolkata Knight Riders (KKR) Highlights, IPL 2025: Mumbai Indians clinched a dominating 8-wicket win over Kolkata Knight Riders, with a high-class performance with both bat and ball. MI found match-winning heroes in debutant Ashwani Kumar's four-wicket -haul in the first innings, and then half-century star Ryan Rickleton in their 117 chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-varun-chakravarthy-sunil-narine-relationship-2701798-2025-03-31",
      "headline": "Sunil Narine will be MVP for Knight Riders IPL 2025 too: Varun ChakravarthyIPL 2025: Varun Charkavarthy spoke about his partnership with Sunil Narine in the IPL, backing the West Indies star to become the Most Valuable Player in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jakub-mensik-thanks-atp-physio-after-miami-open-title-win-for-miracle-treatment-2701789-2025-03-31",
      "headline": "Jakub Mensik thanks ATP physio after Miami Open title win for 'miracle' treatmentJakub Mensik thanked an ATP phyiso after winning the Miami Open title win on Sunday, March 30. Mensik was about to withdraw from the tournament due to a knee injury before the physio  helped him heal in quick time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-slammed-for-tossing-phone-after-selfie-rr-vs-csk-2701743-2025-03-31",
      "headline": "Watch: Riyan Parag slammed for tossing phone after selfie with security personnelRajasthan Royals' stand-in captain Riyan Parag was slammed for casually tossing the phone towards security personnel after clicking a selfie in Guwahati following his team's win over Chennai Super Kings (CSK)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-riyan-parag-captaincy-guwahati-2701733-2025-03-31",
      "headline": "Riyan Parag's bold claim: Always felt like I was captaining Rajasthan from Day 1Riyan Parag made the bold claim that he felt like he was captaining Rajasthan Royals from the time he joined the franchise. Riyan joined the franchise during the 2018 auction and has been a regular in the side since then. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-suggests-sending-naman-dhir-at-number-3-2701696-2025-03-31",
      "headline": "Rayudu suggests batting order shift for struggling MI: Send Naman Dhir at no 3Former India cricketer Ambati Rayudu has suggested Mumbai Indians to promote Naman Dhir at number three in the upcoming game against Kolkata Knight Riders (KKR) in Indian Premier League 2025 (IPL 2025)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-angkrish-raghuvanshi-wankhede-stadium-2701680-2025-03-31",
      "headline": "KKR want to forget past results at Wankhede vs MI: Angkrish RaghuvanshiAngkrish Raghuvanshi has said that KKR doesn't want to focus on their past results at the Wankhede stadium when they take on MI on Monday, March 31. KKR doesn't have a great record while playing at the iconic ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-shreyas-iyer-arshdeeps-heartwarming-meet-up-with-special-fan-2701650-2025-03-31",
      "headline": "Watch: Chahal, Shreyas Iyer, Arshdeep's heartwarming meet up with 'special' fanPunjab Kings cricketers Yuzvendra Chahal, Shreyas Iyer and Arshdeep Singh met with a special fan ahead of their game against Lucknow Super Giants (LSG) on April 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-chennai-super-kings-fielding-ambati-rayudu-2701648-2025-03-31",
      "headline": "CSK's mistakes in IPL 2025 have been painful to watch: Rayudu after RR lossAmbati Rayudu launched a scathing attack on Chennai Super Kings' fielding efforts on Sunday, March 30 during their loss against the Rajasthan Royals in Guwahati. CSK were sloppy on the field against RR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shardul-thakur-asks-for-fair-chance-for-bowlers-2701623-2025-03-31",
      "headline": "Shardul Thakur asks for fair chance for bowlers amid run fests in IPL 2025Lucknow Super Giants (LSG) all-rounder Shardul Thakur asked for the restoration of balance between bat and ball amid the ongoing run fests in the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-csk-stephen-fleming-press-conference-2701616-2025-03-31",
      "headline": "3 pretty good moments: Stephen Fleming reflects on turning points in RR vs CSKStephen Fleming reflected on the main turning points in CSK's loss to RR in Guwahati on Sunday, March 30. CSK lost the match by 6 runs in Guwahati and Fleming pointed out his side's performance in the powerplay, Riyan Parag's catch of Shivam Dube and Wanindu Hasaranga's bowling performance as the main reasons for the defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-weather-forecast-pitch-report-mumbai-2701589-2025-03-31",
      "headline": "MI vs KKR, pitch, weather report: High-scoring game on cards in hot MumbaiMumbai Indians will welcome the Kolkata Knight Riders to the Wankhede stadium on Monday, March 31. MI are looking for their first win of the season while KKR will aim to continue their momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-kkr-match-preview-ipl-2025-mumbai-indians-vs-kolkata-knight-riders-2701558-2025-03-31",
      "headline": "IPL 2025 preview MI vs KKR: Battered Mumbai desperate to get campaign going at homeIPL 2025, Mumbai Indians vs Kolkata Knight Riders Match Preview: Mumbai will look for their maiden win of the Indian Premier League 2025 (IPL 2025) as they take on Kolkata in Match 12 of the Indian Premier League 2025 (IPL 2025)."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}