{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-listings-fall-flat-is-ipo-market-losing-its-charm-hyundai-swiggy-ntpc-green-energy-2633955-2024-11-15",
      "headline": "Is the IPO craze over? Stock market correction hits public listingsSubscription figures for IPOs have dropped in recent months. Global economic uncertainty, rising interest rates, and tighter liquidity have made investors cautious."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-details-10-things-to-know-before-subscribing-review-price-gmp-2633922-2024-11-15",
      "headline": "NTPC Green Energy IPO: 10 things to know before subscribingNTPC Green Energy is a wholly-owned subsidiary of NTPC Ltd, focusing on renewable energy projects through both organic growth and acquisitions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-i-dont-believe-in-work-life-balance-6-day-workweek-debate-2633876-2024-11-15",
      "headline": "I don't believe in work-life balance: Narayana MurthyNarayana Murthy said that hard work is key to national progress, citing Prime Minister Narendra Modi's long work hours as an example. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atv-projects-india-lic-multibagger-stock-rs-1-lakh-investment-now-worth-rs-8-lakh-2633835-2024-11-15",
      "headline": "Rs 1 lakh investment now worth Rs 8 lakh: Check this LIC-backed penny stockATV Projects India has shown remarkable growth over recent years, making it one of the standout multibagger stocks in the Indian market. Since the start of 2024, the stock has risen by over 110%, moving from Rs 15.25 to Rs 32.50 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-free-fall-good-time-to-invest-mutual-funds-2633831-2024-11-15",
      "headline": "Stock markets in free fall: Is it a good time to invest in mutual funds?With the Sensex and Nifty tumbling nearly 10% from their peaks, investors are wondering: Could this market correction be a blessing in disguise for mutual fund investors?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-crisis-dalal-street-sensex-nifty-outlook-brokerage-expert-views-2633803-2024-11-15",
      "headline": "Stock markets in correction phase: More turbulence ahead on Dalal Street?The Sensex and Nifty have tumbled nearly 10% from their recent peaks, leaving investors wondering: Is this just a healthy pause, or should they brace for more turbulence?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-hikes-home-loan-interest-rates-by-5-basis-points-check-details-november-15-2633789-2024-11-15",
      "headline": "SBI hikes home loan interest rates by 5 basis points. Check details  The change in interest rates is effective from November 15, and will make borrowing costs slightly higher for customers seeking loans from the State Bank of India (SBI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-share-price-target-rs-2000-brokerages-bullish-icici-motilal-oswal-2633769-2024-11-15",
      "headline": "Signature Global shares at over Rs 2,000? These 2 brokerages are bullishShares of Signature Global rose nearly 3.5% in the previous trading session after multiple brokerages raised their target price. Its total market capitalisation stands at 18,238.99 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-wants-rbi-to-cut-interest-rates-shaktikanta-das-responds-mpc-meeting-december-2633674-2024-11-15",
      "headline": "Piyush Goyal wants RBI to cut interest rates. Shaktikanta Das respondsUnion Minister Piyush Goyal described the link between food inflation and interest rates as an 'absolutely flawed theory.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-infosys-founder-stands-firm-on-6-day-workweek-pm-modi-2633642-2024-11-15",
      "headline": "I'll take this with me to grave: Narayana Murthy defends 6-day workweek viewNarayana Murthy, who has been vocal about his views on work ethics and productivity, expressed disappointment over India's move from a six-day workweek to a five-day one in 1986. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wolf-in-sheeps-clothing-kutniti-report-flags-elon-musk-starlink-us-military-intelligence-ties-india-entry-plans-2633628-2024-11-15",
      "headline": "'Wolf in sheep's clothing': Report flags Starlink's US military tiesStarlink operates through a constellation of satellites to provide internet access worldwide, a model distinct from traditional telecom services that rely on ground-based towers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-nse-bse-closed-today-holiday-guru-nanak-jayanti-no-trading-sensex-nifty-2633616-2024-11-15",
      "headline": "Stock markets closed today for Guru Nanak Jayanti holiday?Sensex and Nifty, have faced a six-session losing streak, marked by selling pressure from foreign institutional investors (FIIs) and worries over rising retail inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/siemens-may-cut-up-to-5000-jobs-amid-ongoing-struggles-2633486-2024-11-14",
      "headline": "Siemens layoffs: Tech giant may cut up to 5,000 jobs amid ongoing strugglesThe company's Q4 FY 2024 results highlighted the impact of global geopolitical and macroeconomic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-six-straight-sessions-fii-selling-continues-fmcg-shares-2633390-2024-11-14",
      "headline": "Sensex, Nifty fall for 6th straight session as FMCG stocks decline sharplyThe S&P BSE Sensex ended 110.64 points lower at 77,580.31 at the closing bell, while the NSE Nifty50 fell 26.35 points to 23,532.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-poor-service-standards-bureau-of-indian-standards-investigation-2633362-2024-11-14",
      "headline": "More trouble for Ola Electric, faces probe over poor service standards: ReportThis comes after the Central Consumer Protection Authority (CCPA) issued a notice to the SoftBank-backed e-scooter maker following a high volume of complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-aerospace-giant-reduce-workforce-by-17000-warn-letter-2633348-2024-11-14",
      "headline": "Boeing layoffs: Aerospace giant to reduce workforce by 17,000Boeing Layoffs: The aerospace giant has faced financial challenges this year, pushing it to make these deep cuts to realign its current financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-icici-sbi-itc-titan-stocks-sector-safe-bet-market-fall-infrastructure-housing-finance-investing-tips-2633338-2024-11-14",
      "headline": "Markets in free fall: These sectors and stocks can be safe betsBoth the Sensex and Nifty indices have fallen around 10% from their 52-week peaks, marking a notable slump in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cypto-bull-run-memecoin-dogecoin-donald-trump-push-tokens-soaring-2633317-2024-11-14",
      "headline": "Donald Trump's crypto push: Not just Bitcoin, even these tokens are soaringThe bull run is not only crucial in terms of Bitcoin's valuation but also in its wider impact on the altcoin market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-phase-sensex-nifty-fall-sixth-stright-session-trump-factor-fii-selling-2633278-2024-11-14",
      "headline": "Trump factor, FII selling: Why Sensex, Nifty fell for 6th straight sessionThe benchmark Sensex dropped over 250 points, while the Nifty fell over 100 points during intraday trade, marking a significant 10% decline from their September peaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-changes-budget-2025-simpler-filing-lower-brackers-all-key-details-2633226-2024-11-14",
      "headline": "Can you expect major income tax changes in Budget 2025? Check detailsThe Finance Ministry has established 22 specialised sub-committees to examine various aspects of the Income Tax Act, with an aim to simplify tax structures, expand tax base, and balance revenue generation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fire-breaks-out-jhansi-hospital-children-ward-uttar-pradesh-2634235-2024-11-15",
      "headline": "10 children killed, 16 injured in fire at Jhansi hospitalThe fire, likely caused due to a short circuit, broke out in the neonatal intensive care unit of the Jhansi hospital."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cocaine-seized-delhi-amit-shah-reaffirms-drug-free-bharat-mission-2634133-2024-11-15",
      "headline": "Cocaine worth Rs 900 crore seized in Delhi, Amit Shah praises anti-drug effortsThe NCB recovered over 82 kg of cocaine from west Delhi and arrested two people in connection with the bust. The consignment was valued at around Rs 900 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-south-africa-vs-india-sanju-samson-tilak-varma-series-win-record-johannnesburg-2634245-2024-11-16",
      "headline": "Samson, Tilak power record-breaking India to T20i series win in South AfricaSouth Africa vs India, 4th T20I: Sanju Samson and Tilak Varma hit a hundred each as India posted 283 and hammered South Africa by 135 runs. On a record-breaking evening in Johannesburg, India completed a memorable series win and ended a memorable year in T20Is on a high. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/news-today/video/dharam-or-rozgar-whats-the-key-issue-in-maharashtra-election-rajdeep-sardesais-ground-report-2634183-2024-11-15",
      "headline": "Dharam or rozgar: What's the key issue in Maharashtra election? Rajdeep Sardesai's ground reportIn this episode of Maharashtra Majha, watch Rajdeep Sardesai's ground report from Nashik, Malegaon and Ahilyanagar as the state goes to polls next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-students-us-computer-science-masters-degree-scam-american-universities-colleges-reddit-x-debt-2633941-2024-11-15",
      "headline": "Indians going to US for master's degree a scam? Reddit user sparks stormA Reddit user, claiming to be a 26-year-old American woman, said 99% of the students in her computer science master's degree class were Indians. She asked if Indians going to the US for masters was a scam and sparked a massive debate on Reddit and X. People, including tech influencer Deedy Das, revealed the ground reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-and-ritika-sajdeh-blessed-with-baby-boy-2634244-2024-11-16",
      "headline": "Rohit Sharma and Ritika Sajdeh blessed with baby boyIndian captain Rohit Sharma and wife Ritika Sajdeh have been blessed with a baby boy. It remains to be seen if Rohit will make himself available for the 1st Test vs Australia in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/devendra-fadnavis-gautam-adani-meeting-bjp-ncp-government-talks-delhi-residence-ajit-pawar-sharad-pawar-2633977-2024-11-15",
      "headline": "Gautam Adani never attended our meetings: Devendra Fadnavis rejects chargeAfter Ajit Pawar claimed that Gautam Adani was present in the BJP-NCP government formation talks in 2019, Devendra Fadnavis clarified that the industrialist was never involved in such meetings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/up-deputy-chief-minister-brajesh-pathak-bypolls-muslims-bay-leaves-biryani-samajwadi-party-2634230-2024-11-16",
      "headline": "In jibe at Samajwadi Party, BJP leader likens Muslims to 'bay leaves' in biryaniThe Samajwadi Party treated the Muslims as 'bay leaves in a biryani' and 'threw you out of the plate', Uttar Pradesh Deputy Chief Minister and BJP leader Brajesh Pathak alleged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/haka-maori-tradition-history-significance-origin-new-zealand-cultural-con-2634105-2024-11-15",
      "headline": "Haka: How a Māori tradition became New Zealand's cultural iconThe haka is not merely a dance; it is a powerful narrative of the Māori people's resilience, heritage, and connection to their ancestors. Each step and chant is a declaration of identity, making the haka a timeless bridge between the past and the present. Here is more about its origin and significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/earthquake-hits-gujarat-tremors-felt-in-ahmedabad-gandhinagar-2634204-2024-11-15",
      "headline": "4.2 magnitude earthquake hits Gujarat, tremors felt in Ahmedabad, GandhinagarGujarat earthquake: The epicentre was 13 kilometres south-southwest of Patan in Gujarat's Banaskantha district, as per the Institute of Seismological Research, Gandhinagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-cancel-champions-trophy-tour-in-pakistan-occupied-kashmir-2633921-2024-11-15",
      "headline": "BCCI flags Pak board's plan to host Champions Trophy tour in POK: SourcesThe Indian cricket board has raised its concerns with the International Cricket Council over Pakistan's plan to host the Champions Trophy tour in Pakistan Occupied Kashmir (PoK). ICC sources have told India Today that it would announce plans for the trophy tour soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/middle-east-crisis-siege-mecca-grand-mosque-1979-blood-violence-split-muslim-world-saudi-arabia-radical-sunni-islam-2633693-2024-11-15",
      "headline": "How bloody siege of Mecca Grand Mosque 45 years ago split Muslim worldExactly 45 years ago, Mecca Grand Mosque, Islam's holiest place, was taken over by 200 armed men led by preacher Juhayman al-Utaybi. Blood would flow before the weeks-long siege ended. The events of 1979 turned Saudi Arabia into a radical Sunni country, and split the Muslim world, the impact of which is felt to this day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/jp-nadda-slams-congress-ajmal-kasab-biryani-mumbai-attacks-maharashtra-elections-2634172-2024-11-15",
      "headline": "Biryani was served to Kasab after 26/11 Mumbai attacks: JP Nadda slams CongressAddressing a poll rally in Thane, JP Nadda slammed Congress for mishandling national security during the UPA era, citing the 26/11 attacks. He praised PM Modi's decisive actions during incidents such as the Uri and Pulwama attacks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/srinagar-car-accident-students-killed-injured-cars-racing-jammu-kashmir-highway-2634054-2024-11-15",
      "headline": "2 killed as teens race on Srinagar highway, speeding car rams parked truckThe accident took place when four teenagers, in two SUVs, raced on the highway and one of the vehicles lost control and rammed a parked truck in Srinagar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-johannesburg-t20i-sa-vs-ind-sanju-samson-tilak-varma-world-records-2634214-2024-11-15",
      "headline": "In Stats: Sanju Samson, Tilak Varma smash world records in Johannesburg T20I blitz South Africa vs India, 4th T20I: Sanju Samson became the first man to hit three T20I hundreds in a calendar year as India posted their second-highest total of 283 in T20is on Friday. Tilak Varma smashed 120, the second-highest score by an Indian in T20is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-sabarmati-report-review-vikrant-massey-ridhi-dogra-raashi-khanna-2633911-2024-11-15",
      "headline": "The Sabarmati Report review: Even Vikrant Massey can't save this confused filmReleased-Fri Nov 15, 2024The Sabarmati Report, featuring Vikrant Massey, Ridhi Dogra and Raashii Khanna, delves into the Godhra incident while exploring the divide between English and vernacular journalists, ultimately highlighting the power of local journalism. Read the review before you decide whether to watch the film or not."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-jharkhand-assembly-elections-slogan-war-yogi-adityanath-batoge-to-katoge-pm-narendra-modi-ek-hai-to-safe-hai-mallikarjun-kharge-daroge-toh-maroge-2632843-2024-11-15",
      "headline": "How war of slogans in Maharashtra, Jharkhand has gone beyond bijli, paniFrom 'bijli, pani, sadak' to 'India Shining' and 'Ab ki Bar Modi Sarkar', slogans defined elections and described the politics of the day. What does the war of slogans ahead of the Maharashtra and Jharkhand Assembly reveal?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-vivek-ramaswamy-doge-hiring-applicants-x-80-hours-work-no-pay-high-iq-2633660-2024-11-15",
      "headline": "Elon Musk's DOGE is hiring on X: Need super-high IQ, willing to work 80+ hoursDOGE's recruitment post didn't outline required education or experience, focusing instead on applicants' dedication to hard work and their willingness to tackle the challenging issue of bureaucratic cost-cutting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dehradun-accident-college-students-partied-alcohol-raced-bmw-decapitated-speeding-drunk-driving-2633708-2024-11-15",
      "headline": "Dehradun accident: Students partied, raced BMW, decapitated in high-speed crashA newly surfaced video has raised questions about the circumstances leading to a deadly car crash in Dehradun earlier this week that claimed the lives of six college students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/artemis-missions/story/nasa-is-planning-to-lay-down-gas-pipeline-on-moons-south-pole-2634052-2024-11-15",
      "headline": "Nasa is planning to lay down gas pipeline on Moon's South PoleThe sustainability of the Artemis program, which aims to establish a permanent human presence on the Moon, heavily relies on the ability to utilize in-situ resources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-health-misinformation-thrives-on-social-media-2633207-2024-11-14",
      "headline": "Why health misinformation thrives on social mediaOn matters of health, if something looks too good to be true, then it probably is. Here's how to spot dodgy health influencers\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/mahayuti-vs-mva-who-has-the-edge-in-maharashtra-democratic-newsroom-debates-2634117-2024-11-15",
      "headline": "Mahayuti Vs MVA: Who has the edge in Maharashtra? Democratic Newsroom debatesIn this episode of Democratic Newsroom, the focus is on the upcoming Maharashtra assembly election, which is on November 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-vs-jake-paul-boxing-india-time-live-streaming-netflix-date-venue-fight-2634016-2024-11-15",
      "headline": "Mike Tyson vs Jake Paul LIVE streaming, India time: All you need to knowA dramatic weigh-in slap between Mike Tyson and Jake Paul heightened excitement for their blockbuster bout, highlighting the unusual pairing of the 58-year-old boxing legend against the 27-year-old YouTuber-turned-boxer in a clash of generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-wishes-gurupurab-at-hyderabad-concert-guru-nanak-jayanti-2634246-2024-11-16",
      "headline": "Watch: Diljit Dosanjh extends Gurupurab wishes to fans at Hyderabad concertPunjabi superstar Diljit Dosanjh celebrated Guru Nanak Jayanti with fans at his Hyderabad concert, sharing the three pillars of Guru Nanak's teachings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/rupali-ganguly-thanks-anupamaa-producer-rajan-shahi-for-support-amid-stepdaughter-controversy-2634198-2024-11-15",
      "headline": "Rupali Ganguly thanks Rajan Shahi for support amid stepdaughter controversyAnupamaa acor Rupali Ganguly is currently in the middle of a legal battle with his stepdaughter Esha Verma. She now commented on a social media post made by the show's producer, Rajan Shahi, about her strength and inspiring behaviour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/ott-releases-of-the-week-deadpool-and-wolverine-freedom-at-midnight-2634164-2024-11-15",
      "headline": "What to watch this week on OTT: Deadpool and Wolverine to Freedom at MidnightThis week's OTT offerings cater to a variety of tastes with superhero adventures like Deadpool and Wolverine, historical insights in Freedom at Midnight, and heartfelt narratives such as Beyond Goodbye. Whether you're after action, drama, or romance, these releases ensure an engaging viewing experience for everyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/choreographer-jani-master-shares-family-vacation-pics-after-bail-relieved-smiles-2634111-2024-11-15",
      "headline": "Choreographer Jani Master shares family vacation pics after bail: Relieved smilesChoreographer Jani Master, who is currently out on bail in a POCSO case, shared happy pictures of his family as they enjoyed a vacation together. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-suryakumar-yadavb-special-series-win-will-stay-forever-tilak-verma-2634248-2024-11-16",
      "headline": "Will stay with me forever: Suryakumar on special South Africa series winSuryakumar Yadav expressed immense pride in India's 3-1 T20I series win over South Africa, highlighting the team's execution of pre-planned strategies, brilliant performances by young players, and how the victory cemented a memorable chapter under his captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-south-africa-vs-india-sanju-samson-tilak-varma-series-win-record-johannnesburg-2634245-2024-11-16",
      "headline": "Samson, Tilak power record-breaking India to T20i series win in South AfricaSouth Africa vs India, 4th T20I: Sanju Samson and Tilak Varma hit a hundred each as India posted 283 and hammered South Africa by 135 runs. On a record-breaking evening in Johannesburg, India completed a memorable series win and ended a memorable year in T20Is on a high. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-and-ritika-sajdeh-blessed-with-baby-boy-2634244-2024-11-16",
      "headline": "Rohit Sharma and Ritika Sajdeh blessed with baby boyIndian captain Rohit Sharma and wife Ritika Sajdeh have been blessed with a baby boy. It remains to be seen if Rohit will make himself available for the 1st Test vs Australia in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-atp-finals-carlos-alcaraz-brink-of-exit-alexander-zverev-turin-2634243-2024-11-16",
      "headline": "ATP Finals: Carlos Alcaraz on the brink of elimination after losing to ZverevATP Finals 2024: Carlos Alcaraz, who won two Grand Slam titles in the year, might crash out of the prestigious season-ending tournament without making the semi-final. Alcaraz lost to Alexander Zverev in straight sets in his final group-stage match on Friday in Turin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-sanju-samson-six-hits-fans-face-injury-johannesburg-t20i-2634238-2024-11-15",
      "headline": "Watch: Fan in tears after Samson's six hits her on face in JohannesburgSanju Samson's century powered India to their highest-ever T20I total in South Africa, but a towering six that struck a fan added an emotional moment to the record-filled fourth match against the Proteas in Johannesburg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-johannesburg-t20i-sa-vs-ind-sanju-samson-tilak-varma-world-records-2634214-2024-11-15",
      "headline": "In Stats: Sanju Samson, Tilak Varma smash world records in Johannesburg T20I blitz South Africa vs India, 4th T20I: Sanju Samson became the first man to hit three T20I hundreds in a calendar year as India posted their second-highest total of 283 in T20is on Friday. Tilak Varma smashed 120, the second-highest score by an Indian in T20is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-ind-tilak-varma-emulates-sanju-samson-to-hit-2-consecutive-t20i-hundreds-2634174-2024-11-15",
      "headline": "SA vs IND: Tilak Varma emulates Sanju Samson to hit 2 consecutive T20I hundredsTilak Varma emulated Sanju Samson to hit 2 consecutive T20I hundreds. He reached the three-figure mark within 41 balls, making him the 3rd fastest centurion in the format among Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanju-samson-sa-vs-ind-johannesburg-t20i-record-two-hundreds-series-phil-salt-2634171-2024-11-15",
      "headline": "SA vs IND: Sanju Samson becomes 2nd man to hit 2 T20I hundreds in a seriesSouth Africa vs India, 4th T20I: Sanju Samson became only the second man in the history of T20I cricket to score more than one century in a bilateral series on Friday, November 15. Samson hit his third hundred in his last five matches in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-tata-steel-rapid-magnus-carlsen-wins-praggnanandhaa-runner-up-2634146-2024-11-15",
      "headline": "Magnus Carlsen wins Tata Steel Chess Rapid tournament, Pragg finishes runner-upLegendary Magnus Carlsen continued his love affair with the Tata Steel Chess Rapid tournament, winning it with a total of 7.5 out of 9 points. Praggnanandhaa finished second in the open section on Friday, November 15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ipl-mega-auction-full-list-players-base-price-2-crore-rishabh-pant-2634143-2024-11-15",
      "headline": "IPL 2025 mega auction: Full list of 81 players with Rs 2 crore base priceIPL mega auction: Rishabh Pant leads the list of players who have the highest reserve price of Rs 2 crore. A total of 574 players will go under the hammer for 204 slots over two days in Riyadh.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-no-jofra-archer-but-james-anderson-makes-it-to-574-player-shortlist-2634128-2024-11-15",
      "headline": "IPL auction: No Jofra Archer but James Anderson makes it to 574 player shortlistJofra Archer couldn't make it to the final list of players who are set to go under the hammer in the IPL 2025 auction. A total of 574 players have been shortlisted for the auction, starting November 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-ind-tilak-varma-emulates-sanju-samson-to-hit-2-consecutive-t20i-hundreds-2634174-2024-11-15",
      "headline": "SA vs IND: Tilak Varma emulates Sanju Samson to hit 2 consecutive T20I hundredsTilak Varma emulated Sanju Samson to hit 2 consecutive T20I hundreds. He reached the three-figure mark within 41 balls, making him the 3rd fastest centurion in the format among Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanju-samson-sa-vs-ind-johannesburg-t20i-record-two-hundreds-series-phil-salt-2634171-2024-11-15",
      "headline": "SA vs IND: Sanju Samson becomes 2nd man to hit 2 T20I hundreds in a seriesSouth Africa vs India, 4th T20I: Sanju Samson became only the second man in the history of T20I cricket to score more than one century in a bilateral series on Friday, November 15. Samson hit his third hundred in his last five matches in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-tata-steel-rapid-magnus-carlsen-wins-praggnanandhaa-runner-up-2634146-2024-11-15",
      "headline": "Magnus Carlsen wins Tata Steel Chess Rapid tournament, Pragg finishes runner-upLegendary Magnus Carlsen continued his love affair with the Tata Steel Chess Rapid tournament, winning it with a total of 7.5 out of 9 points. Praggnanandhaa finished second in the open section on Friday, November 15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ipl-mega-auction-full-list-players-base-price-2-crore-rishabh-pant-2634143-2024-11-15",
      "headline": "IPL 2025 mega auction: Full list of 81 players with Rs 2 crore base priceIPL mega auction: Rishabh Pant leads the list of players who have the highest reserve price of Rs 2 crore. A total of 574 players will go under the hammer for 204 slots over two days in Riyadh.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-no-jofra-archer-but-james-anderson-makes-it-to-574-player-shortlist-2634128-2024-11-15",
      "headline": "IPL auction: No Jofra Archer but James Anderson makes it to 574 player shortlistJofra Archer couldn't make it to the final list of players who are set to go under the hammer in the IPL 2025 auction. A total of 574 players have been shortlisted for the auction, starting November 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-mega-auction-timings-announcement-clash-perth-test-india-vs-australia-border-gavaskar-trophy-2634110-2024-11-15",
      "headline": "IPL 2025 mega auction timings announced: Will it clash with Perth Test?The IPL 2025 mega-auction coincides with India's Test series against Australia, setting the stage for an action-packed week as the BCCI announces a 574-player shortlist and logistics overlap with the Border-Gavaskar Trophy in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-bcci-announces-shortlist-of-574-players-366-indians-to-be-sold-2634077-2024-11-15",
      "headline": "IPL auction: BCCI announces shortlist of 574 players, 204 slots to be filledThe BCCI announced the shortlisted 574 players who will go under the hammer in the IPL 2025 mega auction. Out of 574 players, 364 are Indians who will get a chance to be sold in the auction.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-live-score-south-africa-vs-india-reactions-4th-t20i-johannesburg-2634049-2024-11-15",
      "headline": "4th T20I Highlights: India clinch series by 3-1 after 135-run win in JohannesburgSouth Africa (SA) vs India (IND), 4th T20I Highlights: India have won the T20I series against South Africa in a dominant fashion after their 135-run win over the Proteas in the Johannesburg clash. Starting with Sanju Samson and Tilak Verma's record-filled centuries in the first innings, the likes of Axar Patel and Arshdeep Singh did their job with the ball to script a historic win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-india-stance-hybrid-model-pcb-rajiv-shukla-bcci-2634048-2024-11-15",
      "headline": "BCCI vice-president Rajiv Shukla reiterates India's stance on Champions TrophyBCCI vice-president Rajiv Shukla reiterated India's stance on the ICC Champions Trophy situation and claimed that the board will act according to advice from the Indian government. India is refusing to travel to Pakistan for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/prajnesh-gunneswaran-india-tennis-player-announces-retirement-2633996-2024-11-15",
      "headline": "Asian Games medalist Prajnesh Gunneswaran announces retirement from tennisPrajnesh Gunneswaran, 35, announced his retirement from professional tennis on Friday, November 15. The former Asian Games bronze medalist reached a career-high of No. 75 in men's singles.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-names-rohit-sharma-as-hottest-indian-player-ahead-of-test-series-2634022-2024-11-15",
      "headline": "Travis Head names Rohit Sharma as 'hottest Indian player' ahead of Test seriesTravis Head named Rohit Sharma as the 'hottest Indian player' ahead of the upcoming Border Gavaskar Trophy series. Rohit's availability for the Perth Test remains uncertain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-vs-jake-paul-boxing-india-time-live-streaming-netflix-date-venue-fight-2634016-2024-11-15",
      "headline": "Mike Tyson vs Jake Paul LIVE streaming, India time: All you need to knowA dramatic weigh-in slap between Mike Tyson and Jake Paul heightened excitement for their blockbuster bout, highlighting the unusual pairing of the 58-year-old boxing legend against the 27-year-old YouTuber-turned-boxer in a clash of generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ruud-van-nistelrooy-sends-farewell-message-to-manchester-united-after-exit-2634006-2024-11-15",
      "headline": "Ruud van Nistelrooy sends farewell message to Manchester United after exitRuud van Nistelrooy sent a special farewell message to Manchester United and its supporters after his exit from the club. Van Nistelrooy served as United's interim manager for 4 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/prajnesh-gunneswaran-india-tennis-player-announces-retirement-2633996-2024-11-15",
      "headline": "Asian Games medalist Prajnesh Gunneswaran announces retirement from tennisPrajnesh Gunneswaran, 35, announced his retirement from professional tennis on Friday, November 15. The former Asian Games bronze medalist reached a career-high of No. 75 in men's singles.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-names-rohit-sharma-as-hottest-indian-player-ahead-of-test-series-2634022-2024-11-15",
      "headline": "Travis Head names Rohit Sharma as 'hottest Indian player' ahead of Test seriesTravis Head named Rohit Sharma as the 'hottest Indian player' ahead of the upcoming Border Gavaskar Trophy series. Rohit's availability for the Perth Test remains uncertain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-vs-jake-paul-boxing-india-time-live-streaming-netflix-date-venue-fight-2634016-2024-11-15",
      "headline": "Mike Tyson vs Jake Paul LIVE streaming, India time: All you need to knowA dramatic weigh-in slap between Mike Tyson and Jake Paul heightened excitement for their blockbuster bout, highlighting the unusual pairing of the 58-year-old boxing legend against the 27-year-old YouTuber-turned-boxer in a clash of generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ruud-van-nistelrooy-sends-farewell-message-to-manchester-united-after-exit-2634006-2024-11-15",
      "headline": "Ruud van Nistelrooy sends farewell message to Manchester United after exitRuud van Nistelrooy sent a special farewell message to Manchester United and its supporters after his exit from the club. Van Nistelrooy served as United's interim manager for 4 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-aus-vs-ind-border-gavaskar-trophy-2024-25-kl-rahul-rishabh-pant-2633993-2024-11-15",
      "headline": "BGT: Virat Kohli fails, Yashasvi Jaiswal stars in simulation practice in PerthStar India batter Virat Kohli was dismissed cheaply during team India's match simulation practice in Perth ahead of the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-scores-quickfire-36-after-4-wicket-haul-in-ranji-trophy-2633988-2024-11-15",
      "headline": "Mohammed Shami scores quickfire 36 after 4-wicket haul in Ranji TrophyMohammed Shami shone with the bat as well as ball in the Ranji Trophy match between Bengal and Madhya Pradesh in Indore. He contributed with a quick-fire 36 for Bengal on day 3 of the Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/icc-canels-champions-trophy-tour-in-pok-day-after-pakistans-announcement-full-details-2633970-2024-11-15",
      "headline": "BCCI complains to ICC about Pakistan's plan to host Champions Trophy tour in POKWhile the International Cricket Council has not yet officially announced the itinerary for the Champions Trophy tour, Pakistan Cricket Board on Thursday announced it would be held across multiple areas, including three in the Pakistan-occupied Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-slaps-jake-paul-fight-weigh-in-close-friend-reveals-reason-boxing-match-2633967-2024-11-15",
      "headline": "Why Mike Tyson slapped Jake Paul during the weigh-in? Close friend revealsDrama unfolded at the Tyson-Paul weigh-in as Mike Tyson slapped Jake Paul, adding fuel to their much-anticipated heavyweight bout. The altercation had fans buzzing ahead of their historic clash at AT&T Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}