{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-new-order-widebody-jets-airbus-boeing-expansion-tata-group-aviation-news-report-2696334-2025-03-20",
      "headline": "Air India in talks to buy more widebody jets from Airbus and Boeing: ReportThe potential order is expected to be worth billions of dollars and could help the airline expand its long-haul fleet as it undergoes a major transformation under Tata Group ownership. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-sensex-jumps-800-points-nifty-jumps-3-reasons-rally-on-dalal-street-2696295-2025-03-20",
      "headline": "Sensex soars over 800 points: 3 things stock market investors should knowShare market today: This week has been one of the best for Dalal Street this year. The S&P BSE Sensex surged 818.21 points to 76,267.26, while the NSE Nifty50 jumped 254.50 points to 23,162.10 at 1:33 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akasa-air-struggle-delay-delivery-boeing-planes-pilots-left-idle-no-work-aviation-news-india-report-2696283-2025-03-20",
      "headline": "Boeing plane delays clip Akasa Air's wings, pilots left waiting: ReportAkasa is among many global airlines affected by Boeing's production issues, which have been worsened by regulatory scrutiny and a workers' strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-advice-to-investors-amid-market-volatility-cut-your-losers-2696276-2025-03-20",
      "headline": "Nithin Kamath's advice to investors amid market volatility : 'Cut your losers'Zerodha's Nithin Kamath shared an essential trading rule that is knowing when to exit a bad trade. Kamath explained that traders often hold on to losing positions, hoping they will recover. But instead of hoping, traders should act with caution and cut their losses early."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/interglobe-aviation-share-price-hit-record-high-should-you-buy-hold-or-sell-indigo-shares-2696252-2025-03-20",
      "headline": "IndiGo shares soar after recent update, hit record high. Buy, sell or hold?In just 5 trading sessions, the stock has soared roughly 8%. IndiGo's stock is up over 10% this year and nearly 13% in a month. The latest jump in its share price came after the company recently shared its roadmap for FY30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-deal-with-emaar-india-mega-real-estate-deal-usd-14-billion-2696241-2025-03-20",
      "headline": "Adani group in $1.4 billion deal talks to buy Emaar's India business: ReportEmaar India has a strong presence in residential and commercial real estate across multiple states, including New Delhi, Punjab, Uttar Pradesh, Madhya Pradesh, Rajasthan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-simplifies-compounding-rules-relaxes-process-for-defaulters-2696224-2025-03-20",
      "headline": "Government simplifies compounding rules, relaxes process for tax defaultersThe move aims to provide relief to taxpayers, to settle matters smoothly with the tax authorities and reduce unnecessary litigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investor-crisis-on-dalal-street-explained-it-stocks-bleed-2696209-2025-03-20",
      "headline": "Exiting foreign investors hurt Dalal Street rally, especially IT stocksContinued selling by foreign portfolio investors (FPIs), which persisted in the first half of March, could hurt market sentiment. FPIs mostly sold information technology (IT) and consumer goods stocks, with lingering concerns over the US and Indian economies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-rate-cut-rbi-action-indian-economy-stock-market-impact-3-things-to-know-2696174-2025-03-20",
      "headline": "Will US Fed's rate pause derail RBI's liquidity easing plans?With the US Fed on hold, will RBI ease further? After cutting the repo rate to 6.25% last month, the first in nearly five years, markets are watching for the central bank's next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-it-stocks-rising-today-reason-infosys-wipro-hcltech-tcs-us-fed-interest-decision-2696166-2025-03-20",
      "headline": "Infosys, TCS, HCLTech gain up to 2%: Why are IT stocks rising today?IT sector stocks showcased strong performance in early trade with the Nifty IT index surging 1.56% as of 10 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tvs-motor-share-price-rising-company-board-interim-dividend-record-date-2696163-2025-03-20",
      "headline": "TVS Motor shares rise as board to consider interim dividend today. Check detailsTVS Motor shares were trading marginally higher in early trade as investors await today's board meeting to consider an interim dividend for FY25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-falls-reports-regulatory-scrutiny-ev-scooter-registrations-mismatch-2696157-2025-03-20",
      "headline": "Ola Electric share price falls after reports of regulatory scrutiny. Details hereOla Electric shares were trading 1.49% lower at Rs 53.02 on the Bombay Stock Exchange (BS) at 9:53 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-industry-box-office-collection-february-officer-on-duty-2696299-2025-03-20",
      "headline": "Malayalam cinema's February fiasco: 17 films, Rs 75 crore budget, Rs 23 crore returnsDo you think Malayalam cinema is belting out one thriller after another and raking in the moolah? A latest report from the producers' association says otherwise. 17 films were released in February, but only one of them was able to collect closer to its budget. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kjo-reveals-funny-reason-why-akshay-kumar-speaks-in-punjabi-during-negotiations-2696308-2025-03-20",
      "headline": "KJo reveals funny reason why Akshay Kumar speaks in Punjabi during negotiationsAt the trailer launch of Akaal, Karan Johar shared a funny story about Akshay Kumar's use of Punjabi to keep conversations private. He also highlighted Bollywood's Punjabi roots and his own linguistic background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-review-neeraj-pandey-netflix-prosenjit-chatterjee-jeet-2696284-2025-03-20",
      "headline": "Khakee The Bengal Chapter review: Consistent, pacy, binge-worthy thrillerReleased-Thu Mar 20, 2025Khakee The Bengal Chapter Review: Neeraj Pandey creates a gripping fictional crime thriller set in the 2000s Bengal political landscape, featuring a stellar ensemble cast. The series is now streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-trivia-for-trollers-90-per-cent-of-filmmakers-at-dharma-are-outsiders-2696298-2025-03-20",
      "headline": "KJo's trivia for trolls: 90 per cent of filmmakers at Dharma are outsidersFilmmaker Karan Johar shared a statement about announcing Dharma's 'proudest' film soon. He even wrote about launching Dharma's 24th debutant director along with the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/oscar-winning-actor-cate-blanchett-does-not-want-award-shows-to-air-2696286-2025-03-20",
      "headline": "Oscar-winning actor Cate Blanchett doesn't want award shows to airHollywood star Cate Blanchett wants to go back to the era of private award shows, where everything was not televisied or available for consumption on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-rajamouli-floored-by-mohanlal-empuraan-trailer-magnetic-fantastic-2696288-2025-03-20",
      "headline": "Rajinikanth, Rajamouli floored by Mohanlal's Empuraan trailer: Magnetic, fantasticRajinikanth and SS Rajamouli dedicated an appreciatory note to Mohanlal and Prithviraj Sukumara's 'L2: Empuraan'. They acknowledged the efforts of the film's team and wished them the best for release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imran-khan-makes-rare-appearance-with-girlfriend-lekha-washington-watch-video-2696265-2025-03-20",
      "headline": "Imran Khan makes rare appearance with girlfriend Lekha Washington. WatchActor Imran Khan and his girlfriend Lekha Washington were seen together in the city, making a rare public appearance. The couple was photographed holding hands and posing for cameras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-ranjeet-says-madhuri-dixit-was-terrified-to-shoot-with-him-never-touched-her-2696249-2025-03-20",
      "headline": "Actor Ranjeet says Madhuri Dixit was terrified to shoot with him: Never touched herVeteran actor Ranjeet recalled shooting with Madhuri Dixit on the sets of 'Prem Pratigya'. He shared that Dixit was so terrified of him that she first refused to shoot the scene initially. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-receives-maharashtrian-of-the-year-chandu-champion-2696255-2025-03-20",
      "headline": "Kartik Aaryan receives Maharashtrian Of The Year 2025 awardActor Kartik Aaryan was honoured with the Maharashtrian Of The Year award by Chief Minister Devendra Fadnavis, Deputy Chief Minister Eknath Shinde, and Governor CP Radhakrishnan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-lifetime-achievement-award-uk-parliament-pawan-kalyan-proud-brother-2696235-2025-03-20",
      "headline": "Chiranjeevi creates history at UK Parliament, Pawan Kalyan is a 'proud brother'Chiranjeevi became the first Indian celebrity to receive the UK's Lifetime Achievement Award. Pawan Kalyan and Sai Dharam Tej expressed pride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-murugadoss-describes-hectic-sikandar-shoot-salman-khan-death-threats-2696223-2025-03-20",
      "headline": "AR Murugadoss describes 'hectic' Sikandar shoot with Salman Khan amid death threatsSikandar director AR Murugadoss opened up about shooting with Salman Khan amid death threats. The filmmaker revealed that the schedule became more hectic and it involved managing huge crowds every day. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/aubrey-plaza-jeff-baena-separated-months-before-his-death-according-to-reports-2696206-2025-03-20",
      "headline": "Aubrey Plaza and Jeff Baena separated months before his death: ReportAubrey Plaza and Jeff Baena were reportedly separated months before his tragic death. New details have revealed the circumstances leading up to his death."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/officer-on-duty-netflix-kunchacko-boban-film-2696201-2025-03-20",
      "headline": "Officer on Duty on OTT: Story, cast and all we know about Kunchako Boban's filmMalayalam film Officer on Duty, featuring Kunchacko Boban, received rave reviews from critics and audiences alike.  The film is streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lisa-ray-accuses-air-india-of-refusing-medical-waiver-for-her-92-year-old-father-2696193-2025-03-20",
      "headline": "Where is empathy? Lisa Ray slams Air India after father denied medical waiverActor Lisa Ray called out Air India for denying a medical waiver to her 92-year-old father despite a doctor's certificate. The airline responded, saying they would review the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-on-hema-malini-advice-on-love-and-romance-after-divorce-2696172-2025-03-20",
      "headline": "We all want that feeling: Esha Deol on Hema Malini's advice on love and romanceActor Esha Deol shared Hema Malini's advice on romance and financial independence, stressing the importance of self-identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ibrahim-ali-khan-nadaaniyan-perfect-punishment-saif-ali-khan-attacker-comedian-2696149-2025-03-20",
      "headline": "Ibrahim's Nadaaniyan, a 'perfect punishment' for Saif's attacker, says comedianStandup comedian Pranit More mocked Ibrahim Ali Khan's Nadaaniyan, saying Saif Ali Khan's attacker should be punished by watching it twice. He also joked about Khushi Kapoor ruining co-stars' images."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-review-a-nightmarish-show-so-brilliant-it-haunts-you-2696050-2025-03-20",
      "headline": "Adolescence review: A nightmarish show so brilliant, it haunts youReleased-Fri Mar 14, 2025'Adolescence' is set in a UK town and yet the story doesn't feel distant, unlikely or alien. The new Netflix miniseries is here to stay with its heart-wrenching and mind-numbingly honest performances and narrative. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-trailer-mohanlal-savour-stephen-nedumpally-khureshi-abraam-prithviraj-sukumaran-drama-2696131-2025-03-20",
      "headline": "L2 Empuraan trailer: Mohanlal rises again as saviour in Prithviraj's explosive dramaThe much-awaited trailer of director Prithviraj Sukumaran's L2: Empuraan was released in the early hours of March 20. The under four-minute trailer highlights Mohanlal's return as the saviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-release-date-salman-khan-2696127-2025-03-20",
      "headline": "Salman Khan's Sikandar skips Friday, set for a rare Sunday release like Tiger 3Salman Khan's Sikandar will release on March 30, a Sunday, breaking the usual Friday trend. Directed by AR Murugadoss, the film also stars Rashmika Mandanna and Kajal Aggarwal."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disha-salian-death-father-bombay-high-court-probe-aaditya-thackeray-sushant-singh-rajput-2696238-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disha Salian's father seeks probe on Aaditya Thackeray, MLA says bid to defameDisha Salian, who was late actor Sushant Singh Rajput's former manager, was found dead in June 2020. The petition alleged that Disha was gang-raped and murdered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-x-sues-government-for-using-it-act-to-block-content-on-its-platform-2696285-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "X reportedly sues government for using IT Act to block content on its platformElon Musk's X has sued the Indian government for using the Information Technology Act to block certain content on the platform. X says the provision does not grant the government blocking powers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-meerut-woman-muskan-rastogi-killed-husband-lover-help-mislead-holi-texts-posing-as-him-2696184-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Papa is in drum, Meerut man's daughter told neighbours after wife killed himThe five-year-old daughter of the Meerut woman, who killed her husband with her lover's help, reportedly told neighbours that her father was inside the drum. The claim was made by the mother of victim, Saurabh Rajput."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-girl-rape-grabbing-breasts-breaking-pyjama-string-2696225-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grabbing girl's breasts, breaking pyjama string not rape: High CourtThe court held that while the acts were \"serious and shameful\", they did not meet the legal threshold for attempted rape, warranting trial under \"aggravated sexual assault\" and disrobing charges instead.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/story/bcci-champions-trophy-indian-team-cash-reward-2696185-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BCCI honours Champions Trophy-winning Indian team with cash reward of Rs 58 croreThe Board of Control for Cricket in India has announced a cash prize of Rs 58 crore for the Indian team that recently won the Champions Trophy after beating New Zealand in the final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaipur-woman-lover-kill-husband-affair-set-body-on-fire-cctv-footage-2696314-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaipur woman kills husband with lover. CCTV shows them carrying body on bikeJaipur police said Dhannalal Saini, a vegetable vendor, was killed after he got wind of his wife's illicit affair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/widely-popular-anti-diabetes-drug-mounjaro-tirzepatide-zepbound-eli-lilly-launched-india-2696237-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Popular anti-diabetes and obesity drug Mounjaro launched in IndiaPopular anti-diabetes and obesity drug Mounjaro, containing active ingredient tirzepatide, is now available in India in a single-dose vial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-student-green-card-deported-father-in-law-hamas-minister-palestine-us-trump-administration-2696246-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian student with Green Card to be deported, father-in-law was Hamas ministerBadar Khan Suri, an Indian student and Green Card holder in the US, is being deported. He is a postdoctoral fellow at Georgetown University in Washington, DC, and previously studied at Delhi's Jamia Milia Islamia. His lawyer claims the deportation is tied to his Palestinian spouse, with Gaza and Palestine being central to Suri's background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lisa-ray-accuses-air-india-of-refusing-medical-waiver-for-her-92-year-old-father-2696193-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where is empathy? Lisa Ray slams Air India after father denied medical waiverActor Lisa Ray called out Air India for denying a medical waiver to her 92-year-old father despite a doctor's certificate. The airline responded, saying they would review the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cop-killed-18-naxalites-gunned-down-during-encounter-in-chhattisgarhs-bijapur-2696277-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "22 Naxals killed, jawan dead during separate encounters in Chhattisgarh18 Naxals and a police jawan were killed in Bijapur after a joint team launched an encounter in the area, while 4 more Maoists were gunned down in Kanker after they opened fire on security forces. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-opposition-mps-dmk-delimitation-protest-house-t-shirt-slogans-om-birla-adjournments-uproar-2696281-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uproar in Lok Sabha after Opposition MPs' 'T-shirt with slogan' protestLok Sabha on Thursday witnessed several adjournments after Opposition MPs entered the House wearing T-shirts with slogans criticising the government written on them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/obc-quota-abused-muslims-west-bengal-will-conduct-fresh-survey-mamata-banerjee-reservation-2696177-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Bengal abuse OBC quota for Muslims? State says will conduct fresh surveyThe West Bengal government told the Supreme Court it would be conducting a fresh exercise to update the state's OBC list. Controversy erupted after 75 of the 77 communities added since 2010 were Muslims. The High Court scrapped the new certificates, saying religion seemed to be the sole criterion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-review-neeraj-pandey-netflix-prosenjit-chatterjee-jeet-2696284-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Khakee The Bengal Chapter review: Consistent, pacy, binge-worthy thrillerReleased-Thu Mar 20, 2025Khakee The Bengal Chapter Review: Neeraj Pandey creates a gripping fictional crime thriller set in the 2000s Bengal political landscape, featuring a stellar ensemble cast. The series is now streaming on Netflix."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/union-minister-nephew-shot-dead-by-brother-in-bihar-over-water-dispute-2696259-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Union Minister's nephew shot dead by brother in Bihar over water disputeWhat started as a dispute over water from a tap soon escalated into a physical altercation, with Jayjeet opening fire. Vishwajit died while being taken to the hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-forest-wildfires-season-explained-2696197-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is Tamil Nadu's fire season? Understanding its growing threatTamil Nadu's forests face an escalating wildfire crisis, with rising frequency and intensity. Driven by extreme heat, human activities, and dry conditions. But they are not a new phenomenon; they are making news now because these fires threaten ecosystems, livelihoods and safety."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-police-fir-rana-daggubati-prakash-raj-vijay-deverakonda-promoting-betting-apps-complaint-2696207-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rana Daggubati, Prakash Raj, other actors in dock for promoting betting appsPolice in Cyberabad, Telangana, filed cases against 25 individuals, including prominent actors, for allegedly promoting illegal betting apps. This move came amid a long-standing government crackdown on online gambling and its links to financial crimes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/conservationist-behind-pm-modis-project-cheetah-found-dead-in-saudi-flat-2696200-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Conservationist behind PM Modi's Project Cheetah found dead in Saudi flatVincent van der Merwe was in charge of getting the cheetahs brought from South Africa and Namibia acclimatised to Indian conditions. Despite the challenges and legal barriers involved in re-introducing the African cheetahs to Kuno National Park, he also expressed strong faith in the project."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-woman-body-tied-to-rock-found-in-canal-strangled-friend-seemapuri-2696194-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Body of missing Delhi woman found in canal tied to a rock, friend arrestedThe body of the woman, named Komal, was found in the Chhawla canal in Delhi's Seemapuri on March 17, five days since she went missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-breeder-s-sathish-buys-worlds-most-expensive-wolfdog-rs-50-crore-video-who-is-he-2696220-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru breeder S Sathish buys costliest wolfdog for Rs 50 crore. Who is he?Making it the first of its kind, the canine is a mix between a wild wolf and a Caucasian Shepherd, and is said to be the world's most expensive wolfdog. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-again-looking-to-launch-starliner-that-flew-sunita-william-to-space-2696280-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nasa again looking to launch Starliner that flew Sunita William to spaceThe technical issues on Starliner's debut crewed mission were the latest setback - and most visible so far - in Boeing's thorny development of a spacecraft that has cost the aerospace giant more than $2 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-review-a-nightmarish-show-so-brilliant-it-haunts-you-2696050-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adolescence review: A nightmarish show so brilliant, it haunts youReleased-Fri Mar 14, 2025'Adolescence' is set in a UK town and yet the story doesn't feel distant, unlikely or alien. The new Netflix miniseries is here to stay with its heart-wrenching and mind-numbingly honest performances and narrative. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-white-house-tammy-bruce-spy-chief-tulsi-gabbard-minorities-violence-remarks-bangladesh-welcome-2696084-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US responds after Bangladesh slams Tulsi Gabbard over minority persecution remarkAmid a controversy over US spy chief Tulsi Gabbard's remarks on minority persecution in Bangladesh, the White House appeared to tone down its criticism of Dhaka, saying it welcomed measures by the Muhammad Yunus-led interim government to ensure the safety of all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/india-textile-art-india-art-fair-india-design-id-2695631-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rise or resurgence? Textile art in India goes mainstreamKnown fashion labels like Tarun Tahiliani, Pero and Anavila at art and home decor exhibitions? It certainly says something about the rise...errr... resurgence of textile art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-case-court-hearing-2696271-2025-03-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Chahal arrives for divorce hearing at Mumbai court before IPL openerIPL 2025: Yuzvendra Chahal and his estranged wife, Dhanashree Verma, were seen entering the Mumbai court premises ahead of the hearing of their divorce plea on Thursday. Chahal will play for Punjab Kings in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-industry-box-office-collection-february-officer-on-duty-2696299-2025-03-20",
      "headline": "Malayalam cinema's February fiasco: 17 films, Rs 75 crore budget, Rs 23 crore returnsDo you think Malayalam cinema is belting out one thriller after another and raking in the moolah? A latest report from the producers' association says otherwise. 17 films were released in February, but only one of them was able to collect closer to its budget. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kjo-reveals-funny-reason-why-akshay-kumar-speaks-in-punjabi-during-negotiations-2696308-2025-03-20",
      "headline": "KJo reveals funny reason why Akshay Kumar speaks in Punjabi during negotiationsAt the trailer launch of Akaal, Karan Johar shared a funny story about Akshay Kumar's use of Punjabi to keep conversations private. He also highlighted Bollywood's Punjabi roots and his own linguistic background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-review-neeraj-pandey-netflix-prosenjit-chatterjee-jeet-2696284-2025-03-20",
      "headline": "Khakee The Bengal Chapter review: Consistent, pacy, binge-worthy thrillerReleased-Thu Mar 20, 2025Khakee The Bengal Chapter Review: Neeraj Pandey creates a gripping fictional crime thriller set in the 2000s Bengal political landscape, featuring a stellar ensemble cast. The series is now streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-trivia-for-trollers-90-per-cent-of-filmmakers-at-dharma-are-outsiders-2696298-2025-03-20",
      "headline": "KJo's trivia for trolls: 90 per cent of filmmakers at Dharma are outsidersFilmmaker Karan Johar shared a statement about announcing Dharma's 'proudest' film soon. He even wrote about launching Dharma's 24th debutant director along with the movie. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-loses-first-round-swiss-open-basel-racquet-2696330-2025-03-20",
      "headline": "Watch: PV Sindhu throws racquet in frustration after Swiss Open first-round exitSwiss Open 2025: PV Sindhu appeared frustrated after losing the first-round of the Super 300 in Basel on Wednesday. The star shuttle fought back from 9-16 down in the second game against lower-ranked Julie Dawall Jakobsen, but was not able to close out the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-bonus-point-news-2696316-2025-03-20",
      "headline": "Bonus point system to be pondered over for WTC 2025-27 cycleThe International Cricket Council (ICC) is expected to consider a new bonus points system at its upcoming board meeting in April. This system could place greater emphasis on larger victories, particularly in overseas matches, for the next World Test Championship (WTC) cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-nz-vs-pak-pakistan-odi-series-bowling-2696304-2025-03-20",
      "headline": "Watch: Rizwan turns fast bowler in intense nets session before New Zealand ODIsNZ vs PAK: Mohammad Rizwan had an intense training session where he batted, bowled and kept wickets before Pakistan's ODI series against New Zealand from March 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-case-court-hearing-2696271-2025-03-20",
      "headline": "Watch: Chahal arrives for divorce hearing at Mumbai court before IPL openerIPL 2025: Yuzvendra Chahal and his estranged wife, Dhanashree Verma, were seen entering the Mumbai court premises ahead of the hearing of their divorce plea on Thursday. Chahal will play for Punjab Kings in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lucknow-stadium-ms-dhoni-yellow-zaheer-khan-lsg-2696248-2025-03-20",
      "headline": "MS Dhoni effect: Zaheer Khan has hilarious reply to reporter ahead of IPL 2025IPL 2025: Lucknow Super Giants mentor Zaheer Khan said he wouldn't be surprised if the Shri Atal Bihari Vajpayee Stadium is filled with yellow shirts again when MS Dhoni's Chennai Super Kings visit on April 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-bangladesh-suspect-action-2696226-2025-03-20",
      "headline": "Shakib cleared of suspect bowling action in huge relief for BangladeshBangladesh's Shakib Al Hasan has been cleared of suspect bowling action after being reported last year while playing for Surrey in the County Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/miami-open-nick-kyrgios-emma-raducanu-win-2696211-2025-03-20",
      "headline": "Kyrgios earns first win in two and half years, Raducanu bounces backMiami Open 2024: Nick Kyrgios beat Mackenzie McDonald 3-6, 6-3, 6-4 and secured his maiden win since October 2022. Emma Raducanu also advanced to the second round and will face Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-sanju-samson-captaincy-rajasthan-royals-2696191-2025-03-20",
      "headline": "Riyan Parag to captain Rajasthan in 1st 3 games, injury concern for Sanju SamsonIPL 2025: Sanju Samson on Thursday, March 20, confirmed he will not lead Rajasthan Royals in the first three games of the season. Riyan Parag has been named their stand-in captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/story/bcci-champions-trophy-indian-team-cash-reward-2696185-2025-03-20",
      "headline": "BCCI honours Champions Trophy-winning Indian team with cash reward of Rs 58 croreThe Board of Control for Cricket in India has announced a cash prize of Rs 58 crore for the Indian team that recently won the Champions Trophy after beating New Zealand in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-narine-kkr-mvp-multiverse-mumbai-indians-2696169-2025-03-20",
      "headline": "IPL Multiverse: What if Sunil Narine became Mumbai's MVP instead of Kolkata?Sunil Narine is considered as Mr. KKR when it comes to the IPL as he has helped them win 3 titles. But what would have happened if MI had outbid KKR in 2012 to win the services of the mystery spinner?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-freedom-no-discrimination-title-2696167-2025-03-20",
      "headline": "KKR eye fourth title with 'freedom and no discrimination' philosophyIPL 2025: Kolkata Knight Riders (KKR) will defend their title as they get set to face Rajat Patidar's Royal Challengers Bengaluru (RCB) in the tournament opener on Saturday at the Eden Gardens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/miami-open-nick-kyrgios-emma-raducanu-win-2696211-2025-03-20",
      "headline": "Kyrgios earns first win in two and half years, Raducanu bounces backMiami Open 2024: Nick Kyrgios beat Mackenzie McDonald 3-6, 6-3, 6-4 and secured his maiden win since October 2022. Emma Raducanu also advanced to the second round and will face Emma Navarro. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-sanju-samson-captaincy-rajasthan-royals-2696191-2025-03-20",
      "headline": "Riyan Parag to captain Rajasthan in 1st 3 games, injury concern for Sanju SamsonIPL 2025: Sanju Samson on Thursday, March 20, confirmed he will not lead Rajasthan Royals in the first three games of the season. Riyan Parag has been named their stand-in captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/story/bcci-champions-trophy-indian-team-cash-reward-2696185-2025-03-20",
      "headline": "BCCI honours Champions Trophy-winning Indian team with cash reward of Rs 58 croreThe Board of Control for Cricket in India has announced a cash prize of Rs 58 crore for the Indian team that recently won the Champions Trophy after beating New Zealand in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunil-narine-kkr-mvp-multiverse-mumbai-indians-2696169-2025-03-20",
      "headline": "IPL Multiverse: What if Sunil Narine became Mumbai's MVP instead of Kolkata?Sunil Narine is considered as Mr. KKR when it comes to the IPL as he has helped them win 3 titles. But what would have happened if MI had outbid KKR in 2012 to win the services of the mystery spinner?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-freedom-no-discrimination-title-2696167-2025-03-20",
      "headline": "KKR eye fourth title with 'freedom and no discrimination' philosophyIPL 2025: Kolkata Knight Riders (KKR) will defend their title as they get set to face Rajat Patidar's Royal Challengers Bengaluru (RCB) in the tournament opener on Saturday at the Eden Gardens. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}