{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-hopeful-of-inking-trade-deal-but-new-delhi-firm-on-protecting-key-sectors-2752663-2025-07-08",
      "headline": "India, US hopeful of inking trade deal, but New Delhi firm on protecting key sectorsIndia and the United States are nearing a trade deal, with negotiations ongoing. India has taken a firm stance on protecting sensitive sectors, particularly wheat, maize, dairy, and genetically grown crops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-dearness-allowance-60-percent-central-government-employees-salary-rise-2752659-2025-07-08",
      "headline": "Will central government employees' dearness allowance reach 60%?The government revises the DA/DR rates twice a year, effective from January 1 and July 1. However, the official announcement generally comes a few months later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-kotak-bank-rise-3-percent-india-us-trade-2752641-2025-07-08",
      "headline": "Sensex closes 271 points higher, Nifty above 25,500; Kotak Bank up 3%The S&P BSE Sensex added 270 points to end at 83,712.51, while the NSE Nifty50 gained 61.20 points to close at 25,522.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fincluencer-explains-why-indias-rich-are-planning-to-retire-abroad-2752627-2025-07-08",
      "headline": "Fincluencer explains why India's rich are planning to retire abroadIndia's rich are rethinking where they retire and how they invest. Finfluencer Akshat Shrivastava says it's not a whim but a calculated response to India's tax structure on wealth and income."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salary-still-broke-financial-expert-sanjay-kathuria-on-lifestyle-inflation-2752583-2025-07-08",
      "headline": "Earning Rs 80,000 a month and still broke? Finance coach explains what's wrongMany in their 20s and 30s are earning more than generations before, but their money often disappears into lifestyle upgrades, digital conveniences, and impulse-driven choices. The result is a sense of helplessness despite a good paycheck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bill-gates-net-worth-trails-former-microsoft-ceo-steve-balmer-top-10-richest-world-2752559-2025-07-08",
      "headline": "Bill Gates no longer in world's top 10 richest; trails former Microsoft CEOBill Gates now ranks behind Michael Dell, who is at number 11 with $137 billion, and Steve Ballmer, his former Microsoft colleague, who is far ahead at number 5 with $172 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/all-you-need-to-know-about-uae-golden-visa-cost-application-process-documentation-2752538-2025-07-08",
      "headline": "All you need to know about UAE's Golden Visa: Cost, application, documentationUnlike earlier Golden Visas that required big investments in property or business, this new scheme allows skilled professionals to apply based on their talent and work experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-vs-sebi-all-you-need-to-know-about-the-case-2752537-2025-07-08",
      "headline": "Jane Street vs Sebi: All you need to know about the caseAt the heart of the controversy is a long-running investigation into the firm's index arbitrage strategy, one that Jane Street insists is standard and legal, but which Sebi believes may have distorted prices in India's rapidly growing equity derivatives market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-you-receive-a-tax-refund-now-if-you-file-your-itr-before-september-15-2752492-2025-07-08",
      "headline": "Filed your ITR early? Will you get a faster tax refund?Filing an ITR early improves your chances of a quicker refund, but only if your return is correct, complete and verified on time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sebi-vs-jane-street-to-challenge-trading-ban-slams-charges-as-inflammatory-2752400-2025-07-08",
      "headline": "Jane Street to challenge Sebi trading ban, slams charges as inflammatory: ReportIn an internal email to staff over the weekend, the US-based firm said it was \"beyond disappointed\" by Sebi's accusations, which it described as \"extremely inflammatory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expert-sanjay-bangar-ulips-high-premiums-not-tax-free-explained-2752383-2025-07-08",
      "headline": "Have lost their tax edge: Expert sounds the alarm on ULIPsThe tax expert said ULIPs no longer guarantee tax-free returns. Investors paying over Rs 2.5 lakh annually may face capital gains tax—making mutual funds a more efficient alternative."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wellness-romance-jennifer-aniston-and-jim-curtis-vacation-together-in-spain-glbs-2752881-2025-07-09",
      "headline": "Wellness & romance? Jennifer Aniston and Jim Curtis vacation together in SpainJennifer Aniston was spotted vacationing in Mallorca with hypnotist Jim Curtis, sparking dating rumors. Their shared interest in wellness and visible Instagram interactions hint at a deeper personal or romantic connection.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-diddy-combs-to-be-sentenced-october-3-after-federal-prostitution-conviction-glbs-2752873-2025-07-09",
      "headline": "Sean 'Diddy' Combs to be sentenced October 3 after federal prostitution convictionSean \"Diddy\" Combs was convicted on two federal charges of transporting individuals for prostitution. He remains in custody as prosecutors seek a harsher sentence, citing his violent history and abuse evidence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actress-humaira-asghar-found-dead-in-karachi-apartment-glbs-2752864-2025-07-09",
      "headline": "Pakistani actress Humaira Asghar found dead in Karachi apartmentPakistani actress Humaira Asghar was found dead in her Karachi apartment. Her decomposed body suggests she died weeks ago. Police await autopsy results and urge the public to avoid speculation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-and-jungkook-could-attend-sojang-defamation-case-hearing-2752759-2025-07-08",
      "headline": "BTS' V, Jungkook could attend Sojang defamation case hearing: ReportsBTS members V and Jungkook's defamation case against controversial YouTuber Sojang has taken a new turn, with the court now urging both sides to consider a possible settlement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jhonny-depp-breaks-silence-being-dropped-from-fantastic-beasts-2752709-2025-07-08",
      "headline": "Johnny Depp breaks silence on being fired from Fantastic BeastsFive years after being fired from the 'Fantastic Beasts' franchise, actor Johnny Depp spoke about the moment he was asked to step away, and what it meant to him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jitendra-kumar-reacts-to-sanvikaas-kiss-scene-comment-says-taken-out-of-context-2752767-2025-07-08",
      "headline": "Jitendra Kumar on Sanvikaa refusing Panchayat 4 kiss scene: Taken out of contextActor Jitendra Kumar clarified that Sanvikaa's comment about refusing a kiss scene in 'Panchayat 4' was taken out of context and said her consent was always a priority. He added that any scene, including a kiss, should only be included if it adds value to the story and connects with the audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-estranged-wife-aarti-reflects-on-life-in-new-post-about-love-peace-2752760-2025-07-08",
      "headline": "Ravi Mohan's estranged wife Aarti reflects on life in new post about love, peaceActor Ravi Mohan's estranged wife, Aarti Ravi, shared a self-reflective post amid their ongoing separation. Through a series of photos, she reflected on love, life, and finding peace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/upasana-konidela-women-choose-partner-sees-as-equal-find-your-ram-2752724-2025-07-08",
      "headline": "Upasana Konidela urges women to find a partner who sees them as equalUpasana Konidela shared a note dedicated to women finding a suitable partner for themselves. She also emphasised marital conflict as a major issue and urged emotional education for boys to build healthier homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-on-working-in-kyunki-saas-bhi-kabhi-bahu-thi-says-she-is-full-time-politician-calls-it-side-project-2752732-2025-07-08",
      "headline": "Kyunki is a side project: Smriti Irani says she is a full-time politicianSmriti Irani addressed the criticism of 'Kyunki Saas Bhi Kabhi Bahu Thi', and shared that the show discussed difficult issues. She said in an interview that she is still a full-time politician, and a part-time actor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-dipika-chikhlia-ram-arun-govil-playing-dashrath-out-of-context-ranbir-kapoor-2752624-2025-07-08",
      "headline": "Dipika Chikhlia on Arun Govil playing Dashrath in Ramayana: Really out of contextActor Dipika Chikhlia, who portrayed Goddess Sita in Ramanand Sagar's 'Ramayan' has reacted to Arun Govil's casting in 'Ramayana'. She expressed her views on Govil playing Dashrath in the Nitesh Tiwari directorial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-jr-ntr-wrap-up-war-2-shooting-share-emotional-notes-for-crew-2752734-2025-07-08",
      "headline": "Hrithik Roshan wraps War 2: 149 days of blood, sweat, injuries… all worth it!Hrithik Roshan has finished shooting for 'War 2', which will release in cinemas on August 14, 2025. Directed by Ayan Mukerji, the action-packed film also stars Kiara Advani and was shot across five countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jackie-shroff-recalls-why-dev-anand-replaced-him-with-mithun-chakraborty-as-lead-in-swami-dada-2752562-2025-07-08",
      "headline": "Jackie Shroff recalls why Dev Anand replaced him with Mithun as lead in Swami DadaJackie Shroff recalled that he was initially offered the second lead in 'Swami Dada' by Dev Anand but was later replaced by Mithun Chakraborty. Despite the demotion to a minor villain role, he accepted it out of respect for Dev Anand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srikanth-and-krishna-granted-conditional-bail-in-drug-case-2752717-2025-07-08",
      "headline": "Actors Srikanth and Krishna granted conditional bail in drug caseThe Madras High Court has granted conditional bail to actors Srikanth and Krishna in a high-profile drug-related case, providing them temporary relief amid ongoing investigations. The actors must comply with strict conditions, including daily appearances before the investigating officer, to ensure cooperation with the probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-is-ranveer-singh-playing-major-mohit-sharma-nsa-ajit-doval-2752528-2025-07-08",
      "headline": "Is Ranveer Singh playing this real-life spy in DhurandharActor Ranveer Singh's new look in Aditya Dhar's upcoming spy action-thriller 'Dhurandhar' has left audiences curious about his character. Is he playing National Security Advisor Ajit Doval? Social media users believe the actor might be portraying an unsung patriot in the film. IndiaToday.in shares insights on the two real-life characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-on-nepotism-industry-support-couldnt-say-no-to-flawed-scripts-2752686-2025-07-08",
      "headline": "Couldn't say no to flawed scripts: Vijay Deverakonda on nepotism, industry supportWith his upcoming film 'Kingdom' generating buzz, Vijay Deverakonda opened up about the challenges of navigating the industry without a support system and how that shaped his approach to scripts and creative control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-serious-relationship-with-girlfriend-gauri-spratt-marriage-plans-2752656-2025-07-08",
      "headline": "Aamir Khan on relationship with Gauri Spratt: I'm married to her in my heartBollywood actor Aamir Khan opened up about his relationship with Gauri Spratt in a recent interview. He discussed the possibility of getting married for the third time and said he is married to her in his heart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-surprises-fan-new-song-jump-deadline-world-tour-2752554-2025-07-08",
      "headline": "BLACKPINK surprises fans with new song JUMP during DEADLINE world tourK-pop girl group BLACKPINK surprised fans with a new song called 'JUMP' at their much-awaited 'DEADLINE World Tour'. The group also released a 30-second teaser of the song's music video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-praises-vishnu-vishal-oho-endhan-baby-calls-it-a-rare-love-story-2752569-2025-07-08",
      "headline": "Aamir Khan praises Vishnu Vishal's Oho Endhan Baby, calls it a rare love storyAmid growing buzz for the romantic drama 'Oho Endhan Baby', actor Aamir Khan watched the film and called it one of the most touching love stories he's seen, praising its emotional depth and message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-season-2-release-postponed-kay-kay-menon-announce-new-date-2752676-2025-07-08",
      "headline": "Special Ops Season 2 release postponed, Kay Kay Menon announce new dateThe much-awaited 'Special Ops Season 2', starring Kay Kay Menon as R&AW officer Himmat Singh, has been postponed. The new season will stream later in July. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-targets-brics-nations-with-10-per-cent-tariff-threat-2752822-2025-07-08",
      "headline": "'Anybody that is in Brics...': Trump's 10% tariff threat to India, bloc membersOn Monday, the White House said that Trump viewed the Brics as a growing threat to American interests and pledged to take all necessary steps to ensure the US is fairly treated on the world stage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fuel-ban-for-overage-vehicles-in-delhi-from-november-1-scheme-to-be-implemented-in-ncr-same-day-2752753-2025-07-08",
      "headline": "Fuel ban for overage vehicles in Delhi-NCR from November 1The fuel restrictions will also be implemented in the five districts of the National Capital Region (NCR) on the same day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/explosive-for-2019-pulwama-attack-bought-via-e-commerce-platform-global-terror-watchdog-fatf-2752782-2025-07-08",
      "headline": "Explosive for Pulwama attack bought via e-commerce platform: Global terror watchdogIn its latest global report on terror financing risks, FATF, the intergovernmental body that monitors money laundering and terror financing worldwide, said that digital tools and financial technologies are being exploited by terrorist entities to raise, move, and manage funds in increasingly sophisticated ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-carlos-alacaraz-beats-cameron-norrie-taylor-fritz-beats-kachanov-2752848-2025-07-08",
      "headline": "Alcaraz dominates Norrie, Fritz knocks out Khachanov to advance to semisCarlos Alcaraz and Taylor Fritz sealed their berths in the semi-final of Wimbledon 2025 following their victories over Cameron Norrie and Karen Khachanov, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-uae-slashed-golden-visa-fee-lifetime-residency-indians-attract-talent-2752749-2025-07-08",
      "headline": "From Rs 4 crore to Rs 23 lakh: Why UAE slashed golden visa fee for IndiansInitially started in 2019, the UAE golden visa scheme was mostly aimed towards attracting investors and entrepreneurs. By slashing the fee to just a fraction of the original cost, UAE has now opened its doors for India's upper middle-class professionals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gets-brazils-highest-honour-for-boosting-ties-2752829-2025-07-08",
      "headline": "PM Modi gets Brazil's highest honour for boosting tiesThe honour was presented by Brazilian President Luiz Inacio Lula da Silva, in recognition of PM Modi's notable contributions to strengthening bilateral relations and enhancing India-Brazil cooperation across key global platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/not-happy-with-putin-trump-blasts-russian-leader-over-ukraine-eyes-sanctions-glbs-2752867-2025-07-09",
      "headline": "Not happy with Putin: Trump blasts Russian leader over Ukraine, eyes sanctionsUS President Donald Trump criticised Putin over the Ukraine war's high death toll, dismissed diplomatic gestures as \"meaningless,\" hinted at stronger sanctions, and confirmed US approval to send defensive weapons to Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-says-it-did-not-issue-fresh-order-to-ban-accounts-x-took-more-than-21-hours-to-unblock-reuters-2752723-2025-07-08",
      "headline": "What block? We pursued X to get Reuters unblocked: Government counters chargeResponding to the ongoing controversy, an official spokesperson said there was \"no fresh blocking order\" and that the government had \"no intention to block any prominent international news channels, including Reuters and ReutersWorld\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-angry-america-dalai-lama-tariffs-tibet-india-marco-rubio-2752729-2025-07-08",
      "headline": "China's fresh 'back off' warning to US has a Dalai Lama connect, not tariffsAmid tensions between China and US over tariffs, Beijing lashed out at Washington accusing it of backing Tibetan separatism after Secretary of State Marco Rubio praised the Dalai Lama on his 90th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/kerala-nurse-nimisha-priya-to-be-executed-in-yemen-on-july-16-for-murder-2752786-2025-07-08",
      "headline": "Kerala nurse Nimisha Priya on death row in Yemen to be executed on July 16Kerala-born nurse Nimisha Priya is set to be executed in Yemen on July 16 for murdering a Yemeni man. Negotiations for forgiveness and blood money are ongoing. She has been in prison since 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raj-thackeray-issues-diktat-to-maharashtra-navnirman-sena-leaders-amid-marathi-row-2752846-2025-07-08",
      "headline": "Don't interact with media: Raj Thackeray's diktat to party leaders amid Marathi rowRecently, Raj Thackeray and the MNS received a lot of flak after videos of his party workers forcing a north Indian shopkeeper to speak Marathi and thrashing him for his inability to do so went viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-as-pakistan-israel-nominate-donald-trump-for-nobel-peace-prize-united-states-of-global-mischief-2752801-2025-07-08",
      "headline": "United States of Global Mischief: Owaisi as Pak, Israel nominate Trump for NobelCalling the move \"absurd\", Asaduddin Owaisi said both Asim Munir and benjamin Netanyahu represent regimes responsible for global instability and violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rocky-dog-saves-63-lives-in-himachal-pradesh-landslide-2752682-2025-07-08",
      "headline": "How heroic dog Rocky saved 63 lives during landslide in HimachalThe incident occurred between 12:30 am and 1:00 am in Siyathi village, in the Dharampur area. In a remarkable escape, all 63 villagers survived unharmed — a feat credited to the dog's alertness and the owner's quick response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-warns-un-that-afghanistan-could-become-a-terror-hub-terrorism-taliban-iskp-ttp-2752778-2025-07-08",
      "headline": "Pak flags a threat at UN: Afghanistan could become a terror hubPakistan, known to be the biggest exporter of terrorism, has warned the UN that Afghanistan risks becoming a terror hub. This is also a stunning statement, given Pakistan's military establishment was the prime sponsor and backer of the Taliban, whose offshoot is now targeting it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-couple-absconds-after-defrauding-bengaluru-investors-in-multi-crore-chit-fund-scam-2752611-2025-07-08",
      "headline": "How Kerala's 'Bunty aur Babli' pulled off multi-crore scam in BengaluruA Kerala couple allegedly behind a decades-long chit fund scam in Bengaluru has gone missing after investors stopped receiving promised returns. Police have launched a manhunt and registered a case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/paris-seine-france-cleanup-swimming-ban-delhi-yamuna-cleaning-revival-challenge-bjp-rekha-gupta-explained-2752295-2025-07-08",
      "headline": "Seine greets swimmers in Paris after 100 years. Will Delhi pass Yamuna test?The Seine, which flows through the heart of Paris, was sick for 100 years. For the first time since 1923, people were allowed to swim in the Seine. This is after an extensive clean-up of the river. The Yamuna is similarly polluted in Delhi. With Delhi CM Rekha Gupta intensifying the push, will Delhiites get to swim in the Yamuna anytime soon?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/rs-20-lakh-mba-rs-25k-salary-where-did-b-schools-go-wrong-2752667-2025-07-08",
      "headline": "Rs 20 lakh MBA, Rs 25K salary: Where did B-Schools go wrong? As India's B-schools mushroom, thousands of students graduate with crippling debt and dismal salaries. A hard look at the MBA dream gone wrong.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-new-york-city-old-tweet-showing-middle-finger-to-columbus-statue-sparks-new-row-with-italian-americans-2752535-2025-07-08",
      "headline": "Zohran Mamdani's old tweet giving the finger to Columbus statue sparks new rowA 2020 tweet in which he is seen showing the middle finger to a statue of Christopher Columbus has infuriated the Italian-American voter base, which makes up 8 percent of New York City's electorate,"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/traumatized-damage-to-babys-head-indian-origin-doctor-gynaecologist-premila-thampi-suspended-in-uk-britain-2752764-2025-07-08",
      "headline": "Indian-origin doctor suspended in UK for forcefully using forceps to deliver babyAn Indian-origin consultant gynaecologist was suspended after being found guilty of serious professional misconduct. She pressured a first-time mother at a UK hospital to accept forceps delivery despite the patient's clear request for a C-section. The woman claimed she was left traumatised, and the forceps caused damage to her baby's head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/sikhs-british-and-afghans-the-power-struggle-that-defined-indias-western-front-2752719-2025-07-08",
      "headline": "Sikhs, British and Afghans: The 19th century struggle for India's north-westThe 19th-century power struggle between the Sikhs, the British, and the Afghans shaped the political landscape of the time. Sikh ruler Ranjit Singh was in Kabul during a victory parade where the flag of Lahore was raised in 1838. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/travellers-no-longer-need-to-remove-shoes-at-tsa-airport-security-checkpoints-glbs-2752883-2025-07-09",
      "headline": "Travellers no longer need to remove shoes at TSA airport security checkpointsThe TSA's two-decade-old policy requiring shoe removal at US airport security checkpoints has ended. Homeland Security says new technology now allows safer, faster screening without footwear removal for most travellers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-judiciary-stares-at-potential-first-impeachment-of-a-high-court-judge-2752115-2025-07-07",
      "headline": "Why judiciary stares at potential first impeachment of a high court judgeFormer Delhi High Court judge Justice Yashwant Varma is in the dock—the fire at his outhouse now transcending a simple corruption scandal\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/expired-valium-at-home-drug-regulator-lists-17-unused-medicines-to-flush-now-anti-anxiety-diazepam-mental-health-cdsco-2752526-2025-07-08",
      "headline": "Expired Valium at home? Drug regulator lists 17 unused medicines to flush nowThat half-used strip of pills in your medicine cabinet isn't just clutter, it could be deadly. India's top drug regulator warns that expired medications can be fatal if taken by someone they weren't meant for. This isn't just a health advisory by CDSCO, it's an urgent call to action"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wellness-romance-jennifer-aniston-and-jim-curtis-vacation-together-in-spain-glbs-2752881-2025-07-09",
      "headline": "Wellness & romance? Jennifer Aniston and Jim Curtis vacation together in SpainJennifer Aniston was spotted vacationing in Mallorca with hypnotist Jim Curtis, sparking dating rumors. Their shared interest in wellness and visible Instagram interactions hint at a deeper personal or romantic connection.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-diddy-combs-to-be-sentenced-october-3-after-federal-prostitution-conviction-glbs-2752873-2025-07-09",
      "headline": "Sean 'Diddy' Combs to be sentenced October 3 after federal prostitution convictionSean \"Diddy\" Combs was convicted on two federal charges of transporting individuals for prostitution. He remains in custody as prosecutors seek a harsher sentence, citing his violent history and abuse evidence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actress-humaira-asghar-found-dead-in-karachi-apartment-glbs-2752864-2025-07-09",
      "headline": "Pakistani actress Humaira Asghar found dead in Karachi apartmentPakistani actress Humaira Asghar was found dead in her Karachi apartment. Her decomposed body suggests she died weeks ago. Police await autopsy results and urge the public to avoid speculation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-khan-shared-beach-pictures-in-nude-bodycon-bikini-2752774-2025-07-08",
      "headline": "When at the beach, pose like Kareena Kapoor Khan. Pics are proofKareena Kapoor is serving major style goals for anyone heading to the beach. The actor recently dropped a stunning series of photos in a sleek bodycon swimsuit. \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-3rd-odi-kusal-mendis-charith-asalanka-asitha-fernando-2752865-2025-07-09",
      "headline": "Kusal Mendis' century deflates Bangladesh as Sri Lanka seal series with 99-run winSri Lanka completed a dominating 99-run win over Bangladesh in the third ODI and completed a 2-1 series win. Kusal Mendis was adjudged Player of the Match for his scintillating innings of 124 (114)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-carlos-alacaraz-beats-cameron-norrie-taylor-fritz-beats-kachanov-2752848-2025-07-08",
      "headline": "Alcaraz dominates Norrie, Fritz knocks out Khachanov to advance to semisCarlos Alcaraz and Taylor Fritz sealed their berths in the semi-final of Wimbledon 2025 following their victories over Cameron Norrie and Karen Khachanov, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-reward-flop-show-international-players-payrise-domestic-contract-reduced-2752826-2025-07-08",
      "headline": "PCB reward flop show? Internationals get more pay, domestic contracts reducedThe Pakistan cricket board have made a rather bizarre move where they decided to increase the pay of their international stars and not give better rewards for their domestic players. This comes after Pakistan's disastrous performances in ICC tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-3rd-test-lords-jasprit-bumrah-breathes-fire-in-net-session-2752821-2025-07-08",
      "headline": "Jasprit Bumrah breathes fire in net session ahead of Lord's Test returnIndia fast bowler Jasprit Bumrah was seen breathing fire in the nets session ahead of his return in the third Test against England at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-aryna-sabalenka-vs-laura-siegemund-reaction-2752805-2025-07-08",
      "headline": "Book my tickets: When Aryna Sabalenka nearly gave up against valiant Laura SiegemundAryna Sabalenka staged a thrilling comeback to defeat 37-year-old Laura Siegemund in a Wimbledon quarter-final. The intense match tested Sabalenka's resilience as she made her way into the semi-final of the grass-court Grand Slam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-picks-novak-djokovic-to-emulate-his-audacious-cricketing-shots-2752800-2025-07-08",
      "headline": "Rishabh Pant picks Novak Djokovic to emulate his audacious cricketing shotsIndia wicketkeeper batter Rishabh Pant picked Tennis legend Novak Djokovic as the best man to emulate his audacious cricketing shots. Pant was recently spotted watching Wimbledon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-2nd-test-corbin-bosch-wiaan-mulder-south-africa-beat-zimbabwe-2752780-2025-07-08",
      "headline": "Bosch, Muthuswamy annihilate Zimbabwe as South Africa complete 2-0 whitewashSouth Africa completed a commanding 2-0 whitewash over Zimbabwe, beating them by a massive margin of an innings and 236 runs in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-withdraws-the-hundred-2025-workload-management-no-indians-2752768-2025-07-08",
      "headline": "Deepti Sharma opts out of The Hundred 2025, no Indians in frayStar Indian all-rounder Deepti Sharma has withdrawn from The Hundred in 2025, citing workload management. This means that there won't be any Indian players in the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-form-sitanshu-kotak-lords-2752763-2025-07-08",
      "headline": "Not just captaincy: Batting coach explains Shubman Gill's magical England formEngland vs India: Batting coach Sitanshu Kotak attributed Shubman Gill's exceptional form to a change in mindset and technical adjustments. The Indian captain has scored 585 runs in the first two Tests of the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sitanshu-kotak-on-lords-pitch-and-jofra-archer-threat-2752752-2025-07-08",
      "headline": "Indian batting coach unfazed by green Lord's pitch, admits Jofra Archer's threatIndian batting coach Sitanshu Kotak has revealed that India are unfazed by the green Lord's surface, England have prepared for the third Test but acknowledged Jofra Archer's threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-zimbabwe-pacer-fined-demerit-point-dangerous-throw-lhuan-dre-pretorious-2752711-2025-07-08",
      "headline": "Zimbabwe pacer fined, handed demerit point for dangerous play in 2nd TestZimbabwe pacer Kundai Matigimu was fined 15 per cent of his match fee and handed a demerit point after his dangerous throw at Lhuan dre Pretorious on Day 1 of the 2nd Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-2nd-test-corbin-bosch-wiaan-mulder-south-africa-beat-zimbabwe-2752780-2025-07-08",
      "headline": "Bosch, Muthuswamy annihilate Zimbabwe as South Africa complete 2-0 whitewashSouth Africa completed a commanding 2-0 whitewash over Zimbabwe, beating them by a massive margin of an innings and 236 runs in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-withdraws-the-hundred-2025-workload-management-no-indians-2752768-2025-07-08",
      "headline": "Deepti Sharma opts out of The Hundred 2025, no Indians in frayStar Indian all-rounder Deepti Sharma has withdrawn from The Hundred in 2025, citing workload management. This means that there won't be any Indian players in the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-form-sitanshu-kotak-lords-2752763-2025-07-08",
      "headline": "Not just captaincy: Batting coach explains Shubman Gill's magical England formEngland vs India: Batting coach Sitanshu Kotak attributed Shubman Gill's exceptional form to a change in mindset and technical adjustments. The Indian captain has scored 585 runs in the first two Tests of the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sitanshu-kotak-on-lords-pitch-and-jofra-archer-threat-2752752-2025-07-08",
      "headline": "Indian batting coach unfazed by green Lord's pitch, admits Jofra Archer's threatIndian batting coach Sitanshu Kotak has revealed that India are unfazed by the green Lord's surface, England have prepared for the third Test but acknowledged Jofra Archer's threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-sa-zimbabwe-pacer-fined-demerit-point-dangerous-throw-lhuan-dre-pretorious-2752711-2025-07-08",
      "headline": "Zimbabwe pacer fined, handed demerit point for dangerous play in 2nd TestZimbabwe pacer Kundai Matigimu was fined 15 per cent of his match fee and handed a demerit point after his dangerous throw at Lhuan dre Pretorious on Day 1 of the 2nd Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}