{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-meeting-agreements-trade-tariffs-american-experts-decode-takeaways-2680431-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Modi has pulled off magic in US, says Ashley Tellis: India Today ExclusiveModi-Trump meet: American foreign policy experts were unanimous in their verdict that the wide-ranging agreements, from defence equipment to trade, left no doubt that the US-India relationship was off to a very good start during Trump 2.0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-inked-finger-munich-security-conference-global-democracy-us-senator-2680414-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar schools West, shows inked finger after US Senator's democracy remarkParticipating in a panel discussion at the Munich Security Conference, External Affairs Minister S Jaishankar differed on the view that global democracy is under threat and said India is a thriving democratic society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankar-chief-justice-of-indias-involvement-executive-appointments-2680361-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vice President questions Chief Justice's involvement in executive appointmentsExecutive governance by judicial decree is a Constitutional paradox that the largest democracy on the planet cannot afford any longer, Vice President Jagdeep Dhankhar said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sheeshmahal-row-delhi-chief-minister-bungalow-used-by-arvind-kejriwal-faces-probe-2680438-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Sheeshmahal' row: Chief Minister's bungalow used by Arvind Kejriwal faces probeThe complaint by the BJP leader highlighted that government properties, including Plot Nos. 45 and 47 on Rajpur Road—previously housing senior officers and judges in Type-V flats—along with two bungalows on Flag Staff Road, were demolished and merged into the new residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-delivery-agent-grwm-video-goes-viral-internet-says-his-sass-is-contagious-2680447-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blinkit delivery agent's sassy style in GRWM video is off the charts. Watch videoA Blinkit delivery agent's GRWM video has gone viral on social media. The internet, impressed by his effortless confidence, says his sass is contagious. Scroll down to watch the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/openai-chatgpt-board-sam-altman-declines-elon-musk-sale-offer-2680441-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "OpenAI board declines Elon Musk's $97.4 billion offer: Not for saleOpenAI board declines Elon Musk's $97.4 billion offer: Not for sale"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williamss-homecoming-how-gravity-will-punish-her-for-returning-to-earth-2680172-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How gravity will punish Sunita Williams for returning to EarthButch Wilmore, a fellow astronaut, stuck in space with Williams, revealed how gravity will be the biggest challenge when the two astronauts return home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/influencer-claims-she-gave-birth-to-elon-musk-baby-5-months-ago-in-viral-x-post-2680419-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Influencer claims she gave birth to Elon Musk's baby 5 months ago in viral X postIn a now-viral post on X, influencer Ashley St. Clair publicly claimed that she gave birth to Elon Musk's child five months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-ozempic-curb-alcohol-cravings-new-study-2680146-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can Ozempic help curb alcohol cravings?A new study published in the journal JAMA Psychiatry found that semaglutide (sold under brand names like Ozempic and Wegovy) can help curb alcohol cravings. But the limitations of the study, such as the small sample size, can't be overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-vijay-gets-y-security-cover-bjp-annamalai-slams-tn-govt-2680380-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Vijay gets 'Y' security cover, BJP asks why DMK didn't do so on its ownActor-politician Vijay was accorded 'Y' security cover in Tamil Nadu by the Union Home Ministry. Under this coverage, there will be a security detail of eight personnel, including two commandos that will protect the Tamilaga Vettri Kazhagam chief round-the-clock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-virat-kohli-would-have-decilned-rcb-captaincy-rajat-patidar-kris-srikkanth-2680424-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kohli would have declined RCB captaincy to focus on batting: SrikkanthKris Srikkanth believes Virat Kohli himself would have opted out of RCB captaincy, prioritising his batting. He backs Rajat Patidar's appointment, highlighting reduced expectations and a fresh leadership approach ahead of the IPL 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chhaava-box-office-day-1-vicky-kaushal-film-breaks-records-biggest-2025-opener-stmp-2680430-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava Box Office: Vicky Kaushal's film breaks records, biggest 2025 openerVicky Kaushal's Chhaava opened to impressive numbers at the box office. The film broke records and emerged as the actor's biggest opener to date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/flights-carrying-deported-indians-from-us-spark-political-row-why-only-punjab-2680160-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Punjab, not Delhi? Bhagwant Mann on US deportation flights landing in AmritsarPunjab Chief Minister Bhagwant Mann slammed the Centre for choosing Amritsar as the landing site for deportation flights from the US. With two more flights set to arrive on February 15 and 16, he questioned if this was a deliberate attempt to defame Punjab. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-mirzapur-prayagraj-highway-collision-car-bus-killed-deaths-maha-kumbh-devotees-yogi-adityanath-cognisance-2680393-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "10 Kumbh devotees killed in car-bus collision on highway in PrayagrajAt least 10 people from Chhattisgarh's Korba, who were en route to the Maha Kumbh in Prayagraj, died after their car collided with a bus full of devotees from Madhya Pradesh's Rajgarh on the Mirzapur-Prayagraj highway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/barack-obama-valentine-day-post-divorce-rumours-michelle-obama-us-2680344-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Obamas' sweet post for each other on Valentine's Day amid divorce buzzBarack and Michelle Obama shut down divorce speculation with Valentine's Day posts, sharing a selfie and heartfelt messages on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-players-grandmaster-im-title-cash-prize-sports-ministry-scrap-explained-2680220-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why the Indian chess community is upset over scrapped cash prizesThe Indian chess community is upset after the Sports Ministry scrapped cash prizes for players achieving Grandmaster and International Master titles, a move critics say could discourage young talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-classics-india-2013-win-ms-dhoni-ishant-sharma-england-2680437-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy classics: When Dhoni-led India outsmarted England to win titleMS Dhoni's tactical prowess and some brave performances from Ravindra Jadeja and Virat Kohli saw India defeat England by 5 runs to win the Champions Trophy 2013 final in Birmingham. This was the last time India lifted the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/storms-droughts-displacement-how-climate-change-is-hitting-inedias-tribes-2680088-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How climate change is reshaping India's tribal landscapeIndia is home to 104 million Indigenous people, about 8.6% of the population, according to The Indigenous World 2023. Their strong connection to nature also makes them particularly vulnerable to extreme weather driven by climate change. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-army-bans-transgenders-military-gender-care-donald-trump-order-woke-culture-2680384-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Army bans transgenders from joining military after Trump's orderThe US Army officially barred transgender individuals from enlisting in the military and stopped providing gender-affirming care for transgender service members. This came after President Donald Trump's crackdown on \"woke culture\" in all US institutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-chief-minister-office-x-official-handle-renaming-row-arvind-kejriwal-2680306-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Chief Minister Office asks X to restore official handle after renaming rowEarlier, the Delhi BJP president demanded the Lieutenant Governor to seek a report from the IT department of the government on renaming the 'CMO Delhi' handle on X and its alleged use for putting up posts of former Delhi Chief Minister Arvind Kejriwal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-parambrata-chattopadhyay-wife-piya-announce-pregnancy-2680448-2025-02-15",
      "headline": "Actor Parambrata Chattopadhyay, wife Piya announce pregnancyBengali actor Parambrata Chattopadhyay and his wife Piya are expecting their first child. The got married in November 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chhaava-box-office-day-1-vicky-kaushal-film-breaks-records-biggest-2025-opener-stmp-2680430-2025-02-15",
      "headline": "Chhaava Box Office: Vicky Kaushal's film breaks records, biggest 2025 openerVicky Kaushal's Chhaava opened to impressive numbers at the box office. The film broke records and emerged as the actor's biggest opener to date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanam-teri-kasam-producer-deepak-mukut-sequel-claims-directors-radhika-rao-vinay-sapru-harshvardhan-rane-2680420-2025-02-15",
      "headline": "Sanam Teri Kasam producer reacts to sequel claims by directorsSanam Teri Kasam producer Deepak Mukut reacted to sequel claims by the director duo, Radhika Rao and Vinay Sapru. The producer stated that the film's rights rest with him and the directors have not reached out to him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-classics-india-2013-win-ms-dhoni-ishant-sharma-england-2680437-2025-02-15",
      "headline": "Champions Trophy classics: When Dhoni-led India outsmarted England to win titleMS Dhoni's tactical prowess and some brave performances from Ravindra Jadeja and Virat Kohli saw India defeat England by 5 runs to win the Champions Trophy 2013 final in Birmingham. This was the last time India lifted the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-virat-kohli-would-have-decilned-rcb-captaincy-rajat-patidar-kris-srikkanth-2680424-2025-02-15",
      "headline": "Kohli would have declined RCB captaincy to focus on batting: SrikkanthKris Srikkanth believes Virat Kohli himself would have opted out of RCB captaincy, prioritising his batting. He backs Rajat Patidar's appointment, highlighting reduced expectations and a fresh leadership approach ahead of the IPL 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-jake-fraser-mcgurk-poor-form-steve-smith-australia-squad-2680422-2025-02-15",
      "headline": "Champions Trophy: 'Dangerous' Jake Fraser-McGurk gets backing from Steve SmithSteve Smith has backed the 'dangerous' Jake Fraser-McGurk to succeed during the Champions Trophy for Australia after the young batter's poor run of form in ODIs. Fraser-McGurk failed in both the ODIs against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-freestyle-grand-slam-d-gukesh-ends-campaign-winless-loss-to-firouzja-2680408-2025-02-15",
      "headline": "D Gukesh finishes Freestyle campaign without a win after loss to FirouzjaWorld champion D Gukesh finished eighth at the Freestyle Chess Grand Slam, suffering a disappointing campaign without a single win after losing to Alireza Firouzja in the seventh-place playoff in Hamburg, Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-opening-pakistan-firm-tri-series-final-vs-new-zealand-head-coach-aqib-javed-2680404-2025-02-15",
      "headline": "Pakistan firm on Babar opening despite tri-series flop showPakistan head coach Aqib Javed backed Babar Azam to continue opening in the Champions Trophy, expressing confidence in his ability despite recent struggles in the Tri-Series against New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-rcb-vs-gg-richa-ghosh-kanika-ahuja-poistive-game-plan-record-run-chase-2680387-2025-02-15",
      "headline": "RCB's Richa reveals 'positive' game plan with Kanika Ahuja behind GG winRicha Ghosh credits a fearless mindset and coaching strategies for RCB's record WPL run chase, as she and Kanika Ahuja led a stunning comeback win over Gujarat Giants in the season opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-squad-analysis-predicted-xi-team-news-mitchell-santer-kane-williamson-2680023-2025-02-15",
      "headline": "Champions Trophy: Can New Zealand clinch second title without key stars?New Zealand face a fresh challenge in the Champions Trophy with a revamped squad, injury concerns, and a lack of spin options as they aim to secure their second ICC title since their 2000 triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-smriti-mandhana-ash-gardner-record-dismissal-cheeky-response-rcb-2680346-2025-02-15",
      "headline": "Mandhana's cheeky response on 'dinner' with Gardner after record dismissalWPL 2025: Smriti Mandhana cheekily said that she needed to find a way to get runs off Ash Gardner, who dismissed the Indian batter for the ninth time in Women's T20Is.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-gujarat-giants-richa-ghosh-ellyse-perry-2680304-2025-02-14",
      "headline": "Richa Ghosh, Ellyse Perry help RCB thrash Giants with historic run-chase WPL 2025: Royal Challengers Bengaluru (RCB) scripted history after notching the highest run-chase in the history of the tournament. Richa Ghosh and Ellyse Perry scored fifties to help RCB beat Gujarat Giants by six wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bayern-munich-jamal-musiala-contract-2680292-2025-02-14",
      "headline": "Bayern Munich ties Jamal Musiala to contract until 2030Bayern Munich star Jamal Musiala has committed his future to the club, signing a contract extension through June 2030. The 21-year-old midfielder, who arrived from Chelsea's youth system in 2019, secured a new deal ahead of his previous contract's expiration next season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-tri-series-final-score-champions-trophy-rehearsal-karachi-2680287-2025-02-14",
      "headline": "Tame Pakistan lose tri-series final to New Zealand in Champions Trophy rehearsalPakistan (PAK) vs New Zealand (NZ), ODI tri-series final: New Zealand were clinical with both bat and ball as they outclassed Pakistan in the final by five wickets. The two teams will meet in the Champions Trophy opener inKarachi on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-squad-analysis-predicted-xi-team-news-mitchell-santer-kane-williamson-2680023-2025-02-15",
      "headline": "Champions Trophy: Can New Zealand clinch second title without key stars?New Zealand face a fresh challenge in the Champions Trophy with a revamped squad, injury concerns, and a lack of spin options as they aim to secure their second ICC title since their 2000 triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-smriti-mandhana-ash-gardner-record-dismissal-cheeky-response-rcb-2680346-2025-02-15",
      "headline": "Mandhana's cheeky response on 'dinner' with Gardner after record dismissalWPL 2025: Smriti Mandhana cheekily said that she needed to find a way to get runs off Ash Gardner, who dismissed the Indian batter for the ninth time in Women's T20Is.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-gujarat-giants-richa-ghosh-ellyse-perry-2680304-2025-02-14",
      "headline": "Richa Ghosh, Ellyse Perry help RCB thrash Giants with historic run-chase WPL 2025: Royal Challengers Bengaluru (RCB) scripted history after notching the highest run-chase in the history of the tournament. Richa Ghosh and Ellyse Perry scored fifties to help RCB beat Gujarat Giants by six wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bayern-munich-jamal-musiala-contract-2680292-2025-02-14",
      "headline": "Bayern Munich ties Jamal Musiala to contract until 2030Bayern Munich star Jamal Musiala has committed his future to the club, signing a contract extension through June 2030. The 21-year-old midfielder, who arrived from Chelsea's youth system in 2019, secured a new deal ahead of his previous contract's expiration next season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-tri-series-final-score-champions-trophy-rehearsal-karachi-2680287-2025-02-14",
      "headline": "Tame Pakistan lose tri-series final to New Zealand in Champions Trophy rehearsalPakistan (PAK) vs New Zealand (NZ), ODI tri-series final: New Zealand were clinical with both bat and ball as they outclassed Pakistan in the final by five wickets. The two teams will meet in the Champions Trophy opener inKarachi on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/zinedine-zidane-france-coach-didier-deschamps-speculation-2026-2680280-2025-02-14",
      "headline": "Deschamps backs legendary Zinedine Zidane to succeed him as France coachFrance coach Didier Deschamps, who will bring an end to his 14-year stint in 2026, backed Zinedine Zidane to take up the role. Zidane has been out of managerial duty since stepping down as Real Madrid's coach in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-heartbroken-reaction-pak-vs-nz-video-viral-2680279-2025-02-14",
      "headline": "Watch: Babar Azam's heartbroken reaction in final goes viral PAK vs NZ: Babar Azam gave a resigned reaction during the final of the tri-nation series between New Zealand at Pakistan. Nathan Smith dismissed him after he scored 29 off 34 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-final-karachi-black-cat-interrupts-play-shaheen-afridi-2680259-2025-02-14",
      "headline": "Watch: Black cat halts play in ODI tri-series final in Karachi's National StadiumPakistan vs New Zealand, ODI tri-series final: Pakistan and New Zealand players were forced to take a break during the tense contest when a black cat ran onto the field, seemingly enjoying the spotlight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-shreyanka-patil-rcb-injury-ruled-out-2680236-2025-02-14",
      "headline": "RCB spinner Shreyanka Patil ruled out due to injury: Sources WPL 2025: Shreyanka Patil has been ruled out of the Women's Premier League after she failed to recover in time. Sneh Rana, who went unsold in the auction last year, has joined the RCB camp. Earlier, Sophie Molineux, Asha Sobhana, Kate Cross and Sophie Devine also missed out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-players-grandmaster-im-title-cash-prize-sports-ministry-scrap-explained-2680220-2025-02-14",
      "headline": "Explained: Why the Indian chess community is upset over scrapped cash prizesThe Indian chess community is upset after the Sports Ministry scrapped cash prizes for players achieving Grandmaster and International Master titles, a move critics say could discourage young talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-opener-fails-pakistan-vs-new-zealand-odi-tri-series-final-champions-trophy-2680184-2025-02-14",
      "headline": "After Babar fails in final, ex-captain calls for new opener in Champions TrophyPakistan vs New Zealand, ODI tri-series final: Babar Azam failed to get going in all three matches of the tri-series, including the final against New Zealand on Friday. Former captain Mohammad Hafeez said Babar should return to batting at No. 3 in the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ayushmann-khurana-ayushmann-khurana-wpl-2025-rcb-vs-gg-2680159-2025-02-14",
      "headline": "Ayushmann Khurana, Madhubanti Bagchi to light up opening dayWPL 2025: Madhubanti Bagchi and Ayushmann Khurana will perform at the Kotambi Stadium in Vadodara during the mid-innings break of the match on Friday between Gujarat Giants and Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-players-grandmaster-im-title-cash-prize-sports-ministry-scrap-explained-2680220-2025-02-14",
      "headline": "Explained: Why the Indian chess community is upset over scrapped cash prizesThe Indian chess community is upset after the Sports Ministry scrapped cash prizes for players achieving Grandmaster and International Master titles, a move critics say could discourage young talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-opener-fails-pakistan-vs-new-zealand-odi-tri-series-final-champions-trophy-2680184-2025-02-14",
      "headline": "After Babar fails in final, ex-captain calls for new opener in Champions TrophyPakistan vs New Zealand, ODI tri-series final: Babar Azam failed to get going in all three matches of the tri-series, including the final against New Zealand on Friday. Former captain Mohammad Hafeez said Babar should return to batting at No. 3 in the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ayushmann-khurana-ayushmann-khurana-wpl-2025-rcb-vs-gg-2680159-2025-02-14",
      "headline": "Ayushmann Khurana, Madhubanti Bagchi to light up opening dayWPL 2025: Madhubanti Bagchi and Ayushmann Khurana will perform at the Kotambi Stadium in Vadodara during the mid-innings break of the match on Friday between Gujarat Giants and Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lalit-modi-love-relationship-romantic-valentines-day-2680092-2025-02-14",
      "headline": "Lalit Modi finds love again as friendship turns romantic on Valentine's Day Indian businessman Lalit Modi, former IPL chairman, revealed his new relationship on social media on Valentine's Day, but did not disclose his partner's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-australia-2nd-odi-score-record-defeat-champions-trophy-lowest-asia-2680084-2025-02-14",
      "headline": "SL v AUS: Australia all out for lowest total in Asia before Champions TrophySri Lanka vs Australia, 2nd ODI: Australia were bowled out for 107 in less than 25 overs as they suffered a 174-run defeat to Sri Lanka and lost the series 0-2. Australia are looking shaky ahead of Champions Trophy, starting February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-new-zealands-injury-crisis-ben-sears-ruled-out-2680083-2025-02-14",
      "headline": "Key New Zealand pacer ruled out of Champions Trophy due to injuryNew Zealand's injury crisis deepend as fast bowler Ben Sears was ruled out of the Champions Trophy 2025. New Zealand already have injury concerns with other players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-class-different-from-the-rest-shardul-thakur-england-century-2680082-2025-02-14",
      "headline": "Rohit Sharma's class is different from the rest: Shardul ThakurShardul Thakur backed Rohit Sharma, dismissing concerns over his form, highlighting his class and recent century against England as proof of his resilience ahead of India's Champions Trophy campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rcb-wpl-2025-smriti-mandhana-2680068-2025-02-14",
      "headline": "Go out there and express yourself: Virat Kohli wishes RCB for WPL 2025WPL 2025: Virat Kohli sent his wishes for defending champions Royal Challengers Bengaluru (RCB), who will start their campaign on February 14 against Gujarat Giants (GG) at the Kotambi Stadium in Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-fastest-6000-odi-runs-virat-kohli-pakistan-vs-new-zealand-tri-series-final-2680057-2025-02-14",
      "headline": "Pakistan star Babar Azam faster than Virat Kohli to complete 6000 runs in ODIsFormer Pakistan captain Babar Azam completed 6,000 runs in his 123rd innings, which came in the ODI tri-series final against New Zealand in Karachi on Friday, February 14. He got to the landmark 13 innings faster than Virat Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-vs-japan-badminton-asia-team-championships-quarterfinal-score-hs-prannoy-2680045-2025-02-14",
      "headline": "India crash out of Badminton Asia Mixed Team Championships after losing to Japan India returned empty-handed from China after losing their quarterfinals to Japan 0-3. HS Prannoy lost a decisive match as India finished without a single win in their last-eight tie on Friday, February 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-karun-nair-ranji-trophy-ajit-agarkar-team-selection-2679994-2025-02-14",
      "headline": "Good to see clear statement from Agarkar: Karun Nair after Champions Tropyh snubVidarbha batter Karun Nair responded to national selector Ajit Agarkar statement about why he was not selected for the ICC Champions Trophy despite his sensational form in domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-international-masters-league-how-to-book-tickets-sachin-tendulkar-brain-lara-2679985-2025-02-14",
      "headline": "How to book tickets for International Masters League ft Tendulkar, LaraAs cricket legends are set to take the field again in the International Masters League, starting from February 22, fans can now get their hands on tickets for the matches on BookMyShow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-prize-money-icc-tournament-2679927-2025-02-14",
      "headline": "Champions Trophy winners to get USD 2.2 million as ICC increases prize poolThe ICC has increased the prize pool for the Champions Trophy which returns after a hiatus of nearly 8 years. The tournament is set to start from February 19 and has guaranteed a participation fee of $125,000.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}