{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/directorate-general-of-civil-aviation-suspends-akasa-air-officials-lapses-in-pilots-training-2656500-2024-12-27",
      "headline": "Aviation regulator suspends 2 Akasa Air officials for lapses in pilots trainingThe two senior executives of the airline have reportedly failed to ensure compliances with the civil aviation requirements, Directorate General of Civil Aviation said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-ceo-sridhar-vembu-revives-debate-on-70-hour-work-week-advocated-by-infosys-founder-narayana-murthy-2656318-2024-12-27",
      "headline": "Zoho CEO Sridhar Vembu revives debate on 70-hour work weekZoho CEO Sridhar Vembu weighs in on the 70-hour work week debate initiated by Infosys founder Narayana Murthy. Here's his perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-dearness-allowance-da-rise-again-in-2025-check-details-how-it-is-calculated-all-you-need-to-know-2656247-2024-12-27",
      "headline": "Will DA rise again in 2025? All you need to knowCentral government employees await a potential DA hike in January 2025, which could offer modest relief amid rising costs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rise-for-2nd-straight-day-as-auto-stocks-rally-2656246-2024-12-27",
      "headline": "Sensex, Nifty rise for 2nd straight day as auto stocks rally The S&P BSE Sensex settled 226.59 points higher at 78,690.07, while the NSE Nifty50 gained 63.20 points to end at 23,813.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-indian-economy-global-standing-key-reforms-1991-economic-liberalisation-2656166-2024-12-27",
      "headline": "How Manmohan Singh revitalised India's economy and global standingAs the chief architect of India's 1991 economic liberalisation, Manmohan Singh's policies helped steer India away from a severe financial crisis, positioning the country as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/osamu-suzuki-former-suzuki-motor-corporation-chairman-dies-at-94-2656153-2024-12-27",
      "headline": "Osamu Suzuki, former Suzuki Motor Corporation chairman, dies at 94Osamu Suzuki steered Suzuki Motor's rise, from pioneering Maruti 800 in India to building a global automotive legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-stock-market-benefitted-under-manmohan-singh-death-news-sensex-nifty-1991-2656149-2024-12-27",
      "headline": "How Indian stock market benefitted under Manmohan SinghManmohan Singh's policies, introduced during a time of economic crisis in the early 1990s, reshaped India's economy and transformed the Indian stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/15-income-tax-changes-in-2024-what-you-need-to-know-for-filing-itr-in-2025-income-tax-rules-stmp-2656139-2024-12-27",
      "headline": "10 income tax changes in 2024: What you need to know for filing ITR in 2025The 2024 income tax reforms introduce revised tax slabs, higher deductions, and simplified TDS and capital gains rules, making tax filing easier and offering potential savings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bumper-market-debut-for-mamata-machinery-should-you-book-profit-or-wait-2656140-2024-12-27",
      "headline": "Bumper stock market debut for Mamata Machinery: Should you book profit or wait? Mamata Machinery stock market listing: A 147% premium debut for Mamata Machinery leaves investors wondering: Is this the peak, or should they hold on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-stock-market-listing-long-term-bet-or-not-expert-views-2656116-2024-12-27",
      "headline": "DAM Capital Advisors makes strong market debut: Is it a long-term bet?DAM Capital Advisors market listing: The listing matched market predictions, as analysts and the grey market premium (GMP) had anticipated a 40%-50% premium, driven by robust demand and positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanathan-textiles-market-listing-31-percent-premium-over-ipo-price-hold-or-sell-2656091-2024-12-27",
      "headline": "Sanathan Textiles shares list at 31% premium over IPO price. Hold or sell? Sanathan Textiles stock market debut: The listing comes after the company's initial public offering (IPO) witnessed robust demand, with subscriptions exceeding 36 times the total shares on offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-strong-price-is-down-50-percent-on-some-trading-apps-today-explained-stmp-2656077-2024-12-27",
      "headline": "Explained: Why Mazagon Dock share price is down 50% on some trading apps todayMazagon Dock stock price: Certain trading apps may be displaying the unadjusted previous closing price, leading to the perception of a 50% fall. Adjusted for the split, Mazagon Dock shares were trading 2.13% lower on the Bombay Stock Exchange (BSE) at 11:09 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/transrail-lighting-ipo-share-price-listing-stock-open-at-36-percent-premium-dalal-street-debut-stmp-2656057-2024-12-27",
      "headline": "Transrail Lighting shares list at 36% premium on Dalal Street debut Transrail Lighting share price: The shares opened at Rs 585.15 per share on the Bombay Stock Exchange (BSE). The market debut aligns with market expectations, which was oversubscribed by 81 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-share-price-listing-strong-debut-39-percent-premium-nse-bse-rs-393-stmp-2656049-2024-12-27",
      "headline": "DAM Capital Advisors makes strong debut, shares list at 39% premium DAM Capital Advisors listing: On the BSE, the shares began trading at Rs 392.90, marking a 38.83% premium compared to the issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-listing-share-price-bumper-debut-147-percent-premium-rs-600-nse-bse-stmp-2656037-2024-12-27",
      "headline": "Mamata Machinery shares make bumper debut with 147% premium over IPO priceMamata Machinery listing: Shares of Mamata Machinery made a bumper debut and listed at Rs 600 per share on the NSE, a lot higher than the IPO issue price of Rs 243 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-auto-stocks-shine-tata-motors-bajaj-2656032-2024-12-27",
      "headline": "Sensex, Nifty open higher as auto stocks fuel early rally; Tata Motors up 2%The S&P BSE Sensex was up 323.12 points to 78,795.60, while the NSE Nifty50 gained 101.95 points to 23,852.15 as of 9:44 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-mamata-machinery-concord-transrail-sanathan-textiles-gmp-5-ipos-market-debut-today-2656022-2024-12-27",
      "headline": "Dam Capital to Mamata Machinery: GMPs of 5 IPOs ahead of D-Street debut todayThese initial public offerings (IPOs), which opened for subscription on December 19 and closed on December 23, collectively raised over Rs 2,900 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-death-3-key-economic-reforms-liberalisation-licence-raj-mnrega-shaped-modern-india-2656013-2024-12-27",
      "headline": "Manmohan Singh's key reforms that shaped Indian economyDr Manmohan Singh's tenure as Finance Minister in the early 1990s and later as Prime Minister from 2004 to 2014 introduced policies that continue to influence India's growth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-on-work-life-balance-spend-four-hours-with-family-2655881-2024-12-26",
      "headline": "Gautam Adani on work-life balance: Spend at least 4 hours with familyChairperson of Adani Group, Gautam Adani, shared his take on work-life balance and said one must try to spend at least four hours with their families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-relief-consideration-government-sources-2655736-2024-12-26",
      "headline": "Government may consider tax relief for income of up to Rs 10.50 lakh: ReportThe move, likely to be announced in the upcoming Budget 2025 on February 1, aims to boost consumption and address concerns over rising living costs amid a slowing economy."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-funeral-cremation-state-mourning-resting-place-congress-2656392-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India bids farewell to Manmohan Singh, last rites conducted with state honours Live UpdatesManmohan Singh was cremated with full state honours today. The Centre agreed to allocate space for a memorial of the former Prime Minister after a war of words broke out between the BJP and the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-bjp-welfare-schemes-mahila-samman-yojana-lt-governor-order-2656649-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Working to stop AAP: Arvind Kejriwal attacks BJP and Congress after probe orderFormer Delhi Chief Minister Arvind Kejriwal on Saturday (December 28) attacked the BJP and Congress and accused them of attempting to sabotage Aam Aadmi Party's (AAP) welfare schemes. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-fathers-sacrifices-melbourne-test-century-rescuing-2656624-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dreams come true at MCG: How father's sacrifice fuelled Nitish's journeyNitish Kumar Reddy's maiden Test century at the MCG was a historic and emotional moment, showcasing his resilience and honouring his father's sacrifices. The 21-year-old all-rounder scripted a remarkable recovery for India in the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-accidental-prime-minister-politician-sonia-gandhi-reforms-indo-us-nuclear-deal-2656396-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manmohan Singh: Accidental PM, but not an accidental politicianManmohan Singh served as the Prime Minister of India for 10 years, but people still perceive that he was politically naive. That couldn't be further from the truth. Singh survived in the Congress by picking his battles well even as astute politicians fell along the way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-cinema-2024-hits-misses-hema-committee-report-manjummel-boys-premalu-aavesham-bramayugam-2656297-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manjummel Boys to Aavesham: 2024 truly belonged to Malayalam cinema From big hits to bigger misses to the explosive Hema Committee report, Malayalam cinema experienced highs and lows in 2024. Here's a round-up of what transpired in Mollywood this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-memorial-row-congress-didnt-hold-condolence-meeting-for-father-says-pranab-mukherjees-daughter-2656559-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid Manmohan Singh's memorial row, Pranab Mukherjee's daughter's dig at CongressSharmistha Mukherjee criticised the party for demanding a separate memorial space for former Prime Minister Manmohan Singh while failing to convene a Working Committee meeting to condole her father's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-4th-test-day-3-report-nitish-reddy-sundar-pant-melbourne-2656604-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sparkling Nitish hundred, Sundar rearguard cut India's deficit on Day 3Australia vs India: Nitish Reddy's maiden Test hundred, combined with Washington Sundar's fighting fifty, helped India cut Australia's first-innings lead on Day 3 of the ongoing Boxing Day Test."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-lt-governor-aap-women-scheme-punjab-intel-officers-congress-elections-2656638-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's women scheme, Punjab intel officers in Delhi: Lt Governor orders probeThe directives were issued by Delhi's Lieutenant Governor to the chief secretary and the Commissioner of Police following complaints by Congress's Sandeep Dikshit. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/new-york-prison-beating-bodycam-footage-officers-beating-handcuffed-inmate-robert-brooks-death-2656645-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bodycam footage shows US prison officers thrashing handcuffed inmate before deathBody camera footage of the assault on Robert Brooks was made public by the New York attorney general, and shows correctional officers beating the handcuffed man, striking him in the chest with a shoe, and lifting him by the neck."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/valentina-gomez-executes-migrant-dummy-campaign-video-texas-republican-congress-immigrant-violent-crimes-2656595-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Republican candidate's mock execution of migrant in video: 'Deserve to be ended'In the video, Valentina Gomez is seen firing a handgun into the back of the head of a dummy tied to a chair with a black bag over its head. She asserts that undocumented persons who commit violent crimes \"deserve to be ended.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-boxing-day-stampede-perth-streetwear-store-viral-video-2656578-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Boxing Day heist: Owner's invite to 'rob' his store sparks all-out frenzyAs soon as the store in Perth opened its shutters on Thursday, hundreds of teens pushed and shoved their way into the shop, resulting in a massive stampede."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-founder-turns-cab-driver-3-am-sleepy-chauffeur-hands-over-keys-viral-video-2656566-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru man turns cab driver at 3 am as sleepy chauffeur hands over keys. VideoSharing a video in a post on Instagram, a Bengaluru-based founder narrated the story when he ended up driving his own cab at 3am after his drowsy driver could no longer stay awake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-farmer-leader-jagjit-dallewal-fast-health-condition-punjab-2656599-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not his well-wishers: Supreme Court raps farm leaders over Dallewal's healthFarmer leader Jagjit Singh Dallewal has been on a fast-unto-death since November 26 to press the Centre to accept the demand of MSP for crops."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-rain-temperature-dips-after-yellow-alert-winter-western-cyclonic-disturbances-2656536-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi records highest single-day December rainfall in 101 yearsRain continued to lash several places in Delhi-NCR on Saturday, causing average daily temperatures to drop sharply. The IMD has issued a 'yellow' alert for the weekend, predicting more showers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/photo/photos-jammu-and-kashmir-wrapped-in-white-after-seasons-first-snowfall-2656585-2024-12-28?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "In Pics: Srinagar wrapped in white after season's first snowfallSrinagar received the season's first snowfall on Friday, draping the valley in white and bringing cheer to locals and tourists alike. Under the influence of a western disturbance, light to moderate snowfall was recorded in most areas of Kashmir, including Srinagar and other areas.  The much-awaited snowfall brought relief and joy to the people. Tourists were thrilled to witness snow and many of them were seen playing and clicking photographs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-viral-photo-cricketer-nitish-kumar-reddy-family-australia-border-gavaskar-trophy-melbourne-cricket-ground-2656587-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Viral: Anushka Sharma's pic with cricketer Nitish Reddy's family in AustraliaActor Anushka Sharma's picture happily posing with Indian cricketer Nitish Kumar Reddy's family in Australia has gone viral. The actor accompanied her cricketer husband Virat Kohli for the 2024-25 Border-Gavaskar Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-entertainment-politics-cricket-440-28-12-2024?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-to-allocate-space-former-prime-minister-manmohan-singhs-memorial-after-row-2656522-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre breaks deadlock with late-night nod for Manmohan Singh's memorial The Congress's request for the cremation to be held at a separate memorial site was initially denied by the Centre, following which party leader Jairam Ramesh called it a \"deliberate insult to India's first Sikh Prime Minister\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/azerbaijan-airlines-plane-crash-kazakhstan-survivors-recall-ordeal-loud-bang-heard-2656419-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Heard loud bang, began to pray: Kazakhstan plane crash survivors recount ordealAn Azerbaijan Airlines plane crashed in Kazakhstan, killing 38 passengers after reportedly encountering two loud bangs mid-flight, survivors recalled.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-trolls-chess-federation-with-jeans-pant-rapid-blitz-championship-2656545-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Carlsen trolls Chess Federation with OOTD post after quitting championshipThe world's best chess player Magnus Carlsen quit the 2024 World Rapid and Blitz Championship after being fined by FIDE over dress code. Carlsen trolled the tournament with a cheeky post on social media after quitting.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/madras-high-court-orders-sit-probe-team-to-be-formed-in-anna-university-sexual-assault-case-2656628-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court orders probe team to be formed in Anna University sexual assault caseThe Madras High Court on Saturday (December 28) ordered the formation of a Special Investigation Team (SIT) comprising three women IPS officers to investigate the Anna University sexual assault case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/badshah-deletes-instagram-posts-after-honey-singh-breaks-silence-on-their-feud-2656588-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Badshah deletes Instagram posts after Honey Singh breaks silence on their feudAfter Honey Singh spoke out about his decade-long feud with Badshah, he deleted all his Instagram posts. Earlier, in an interview with India Today, Honey Singh dismissed Badshah's gesture to reconcile and end their feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/romeo-and-juliet-actor-olivia-hussey-dies-at-73-stmp-2656570-2024-12-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Romeo and Juliet actor Olivia Hussey dies at 73Veteran actor Olivia Hussey, best known for her role in Romeo and Juliet, passed away at the age of 73, surrounded by her loved ones. She was first diagnosed with breast cancer in 2008, which recurred in 2018.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khushi-kapoor-rumoured-boyfriend-vedang-raina-shine-at-cute-ugly-christmas-sweater-party-2656617-2024-12-28",
      "headline": "Khushi Kapoor, Vedang Raina spread Christmas cheer with 'cute ugly sweaters'Khushi Kapoor and her rumoured boyfriend, Vedang Raina, had the time of their lives at a fun-filled ugly Christmas sweater party. The adorable pictures from the bash are melting hearts online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-opposite-mahesh-babu-ss-rajamouli-untitled-next-stmp-2656632-2024-12-28",
      "headline": "Priyanka Chopra to star opposite Mahesh Babu in SS Rajamouli's next film: ReportPriyanka Chopra is reportedly believed to return to Indian cinema after six years with SS Rajamouli's next. The film will feature Mahesh Babu in the key role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-wife-natasha-leave-for-new-year-holiday-with-daughter-lara-2656613-2024-12-28",
      "headline": "Varun Dhawan, wife Natasha leave for New Year holiday with daughter LaraVarun Dhawan and his wife Natasha Dalal were seen at Mumbai airport today as they departed for their New Year vacation. In a video shared online, Natasha was seen holding their daughter, Lara, close while the paparazzi captured their pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-salman-khan-schools-kashish-kapoor-angle-allegations-avinash-mishra-eisha-singh-2656614-2024-12-28",
      "headline": "BB 18: Salman Khan schools Kashish over 'angle' allegations on Avinash In the latest episode of Bigg Boss 18, Salman Khan slammed Kashish Kapoor over her 'angle' allegations about Avinash Mishra. The actor stated that she has been the one who has been trying to make an 'angle' with Avinash. \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mitchell-starc-injury-concern-scott-boland-mcg-test-2656654-2024-12-28",
      "headline": "Mitchell Starc can play through a lot of pain: Boland on pacer's injury concernAUS vs IND: Australian fast bowler Scott Boland shared an update on Mitchell Starc, who faced troubles with his back on Day 3 of the Boxing Day Test at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-cricketing-brain-remains-same-sunil-gavaskar-melbourne-century-2656640-2024-12-28",
      "headline": "Pray to god Nitish's cricketing brain remains same: Gavaskar on MCG hundredNitish Kumar Reddy etched his name in history with a resilient maiden Test century, rescuing India on Day 3 of the Melbourne Test. His 105-run knock from No. 8 earned widespread praise, including admiration from cricket legend Sunil Gavaskar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-century-sundar-press-conference-2656636-2024-12-28",
      "headline": "Nitish Kumar Reddy's MCG century will be remembered forever: Sundar AUS vs IND: Washington Sundar lauded Nitish Kumar Reddy for scoring his maiden Test hundred in front of a packed crowd at the Melbourne Cricket Ground in the Boxing Day Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-washington-sundar-boxing-day-selection-mcg-test-50-2656635-2024-12-28",
      "headline": "Washington Sundar justifies Boxing Day selection with gritty 50 in MCG rearguardAustralia vs India: India's Washington Sundar justified his Boxing Day selection with a gritty Test fifty in the rare rearguard to help India cut their first-innings deficit on Day 3. Sunday shared a 127-run stand with the centurion Nitish Kumar Reddy in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-fathers-sacrifices-melbourne-test-century-rescuing-2656624-2024-12-28",
      "headline": "Dreams come true at MCG: How father's sacrifice fuelled Nitish's journeyNitish Kumar Reddy's maiden Test century at the MCG was a historic and emotional moment, showcasing his resilience and honouring his father's sacrifices. The 21-year-old all-rounder scripted a remarkable recovery for India in the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/arjun-erigaisi-in-joint-lead-in-world-rapid-and-blitz-chess-championship-2656611-2024-12-28",
      "headline": "Arjun Erigaisi in joint lead after Magnus quits World Rapid and Blitz Championship Indian grandmaster Arjun Erigaisi ended the day in joint lead after another impressive skill display at the ongoing World Rapid and Blitz Chess Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-4th-test-day-3-report-nitish-reddy-sundar-pant-melbourne-2656604-2024-12-28",
      "headline": "Sparkling Nitish hundred, Sundar rearguard cut India's deficit on Day 3Australia vs India: Nitish Reddy's maiden Test hundred, combined with Washington Sundar's fighting fifty, helped India cut Australia's first-innings lead on Day 3 of the ongoing Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-century-baahubali-celebration-mcg-2656603-2024-12-28",
      "headline": "Watch: Pushpa for fifty, Baahubali for hundred: Nitish rocks celebrations Border Gavaskar Trophy, IND vs AUS: Nitish Reddy struck the Pushpa pose after he scored a fifty at the Melbourne Cricket Ground. He followed it up with the Baahubali celebration after notching his century at the iconic venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-mcg-bgt-nitish-kumar-reddy-father-reaction-tears-hundred-boxing-day-2656600-2024-12-28",
      "headline": "Nitish Reddy's father in tears after prayers answered for son's MCG hundredIND vs AUS: Nitish Kumar Reddy's father was in tears after his son's nervy century in the Boxing Day Test. Nitish created history by becoming the first India No.8 to score a hundred in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-fathers-sacrifices-melbourne-test-century-rescuing-2656624-2024-12-28",
      "headline": "Dreams come true at MCG: How father's sacrifice fuelled Nitish's journeyNitish Kumar Reddy's maiden Test century at the MCG was a historic and emotional moment, showcasing his resilience and honouring his father's sacrifices. The 21-year-old all-rounder scripted a remarkable recovery for India in the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/arjun-erigaisi-in-joint-lead-in-world-rapid-and-blitz-chess-championship-2656611-2024-12-28",
      "headline": "Arjun Erigaisi in joint lead after Magnus quits World Rapid and Blitz Championship Indian grandmaster Arjun Erigaisi ended the day in joint lead after another impressive skill display at the ongoing World Rapid and Blitz Chess Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-4th-test-day-3-report-nitish-reddy-sundar-pant-melbourne-2656604-2024-12-28",
      "headline": "Sparkling Nitish hundred, Sundar rearguard cut India's deficit on Day 3Australia vs India: Nitish Reddy's maiden Test hundred, combined with Washington Sundar's fighting fifty, helped India cut Australia's first-innings lead on Day 3 of the ongoing Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-century-baahubali-celebration-mcg-2656603-2024-12-28",
      "headline": "Watch: Pushpa for fifty, Baahubali for hundred: Nitish rocks celebrations Border Gavaskar Trophy, IND vs AUS: Nitish Reddy struck the Pushpa pose after he scored a fifty at the Melbourne Cricket Ground. He followed it up with the Baahubali celebration after notching his century at the iconic venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-mcg-bgt-nitish-kumar-reddy-father-reaction-tears-hundred-boxing-day-2656600-2024-12-28",
      "headline": "Nitish Reddy's father in tears after prayers answered for son's MCG hundredIND vs AUS: Nitish Kumar Reddy's father was in tears after his son's nervy century in the Boxing Day Test. Nitish created history by becoming the first India No.8 to score a hundred in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-india-vs-australia-century-melbourne-2656590-2024-12-28",
      "headline": "Nitish Reddy hits maiden Test hundred, scripts history in Melbourne IND vs AUS: Nitish Kumar Reddy became the first No.8 batter to score a Test hundred at the Melbourne Cricket Ground. The youngster reached the landmark on Day 3 of the Boxing Day Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-justin-langer-virat-kohli-sachin-tendulkar-brian-lara-2656576-2024-12-28",
      "headline": "Justin Langer picks 'gladiatorial' Virat Kohli over Tendulkar, LaraIND vs AUS: Former Australia batter Justin Langer picked Virat Kohli as the best player he had ever seen. Langer picked Kohli ahead of Sachin Tendulkar and Brian Lara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-australia-squad-sophie-molineux-2656574-2024-12-28",
      "headline": "Australia name 14-member squad for Women's Ashes, Molineux misses outWomen's Ashes 2025: All-rounder Sophie Molineux missed out due to a knee injury as Australia named a strong 14-member squad for the upcoming multi-format series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-melbourne-test-nitish-reddy-no6-ravi-shastri-2656571-2024-12-28",
      "headline": "Nitish should be batting at No 6, will help balance the Indian side: Ravi ShastriFormer India head coach Ravi Shastri praised Nitish Reddy's fearless MCG knock, backing the youngster to bat at No. 6 in India's Test lineup. Nitish was batting at 85 unbeaten in the post-lunch session on Day 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-3-live-scores-reactions-melbourne-updates-boxing-day-2656496-2024-12-28",
      "headline": "Day 3 Highlights: Nitish Reddy, Washington Sundar keep India in the fightAustralia (AUS) vs India (IND) 4th Test, Day 3 Highlights: Nitish Reddy and Washington Sundar kept India in the fight at the MCG on Day 3 of the Test match."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-sunil-gavaskar-rishabh-pant-wicket-stupid-mcg-test-bgt-2656555-2024-12-28",
      "headline": "Stupid, Stupid, Stupid: Furious Gavaskar slams Pant for reckless dismissalIND vs AUS: Legendary Sunil Gavaskar was furious with India wicketkeeper-batter Rishabh Pant for throwing away his wicket on Day 3 of the MCG Test match. Gavaskar called Pant stupid and said the left-hander should have walked back to the Australian dressing room instead of the Indian one.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-nitish-kumar-reddy-maiden-fifty-pushpa-move-2656550-2024-12-28",
      "headline": "Watch: Nitish Reddy celebrates maiden Test fifty with Pushpa signature move AUS vs IND: Nitish Kumar Reddy celebrated with Allu Arjun's Pushpa move after scoring his maiden Test fifty off 81 balls in the Boxing Day Test against Australia at the iconic Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-melbourne-test-nitish-reddy-no6-ravi-shastri-2656571-2024-12-28",
      "headline": "Nitish should be batting at No 6, will help balance the Indian side: Ravi ShastriFormer India head coach Ravi Shastri praised Nitish Reddy's fearless MCG knock, backing the youngster to bat at No. 6 in India's Test lineup. Nitish was batting at 85 unbeaten in the post-lunch session on Day 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-3-live-scores-reactions-melbourne-updates-boxing-day-2656496-2024-12-28",
      "headline": "Day 3 Highlights: Nitish Reddy, Washington Sundar keep India in the fightAustralia (AUS) vs India (IND) 4th Test, Day 3 Highlights: Nitish Reddy and Washington Sundar kept India in the fight at the MCG on Day 3 of the Test match."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-sunil-gavaskar-rishabh-pant-wicket-stupid-mcg-test-bgt-2656555-2024-12-28",
      "headline": "Stupid, Stupid, Stupid: Furious Gavaskar slams Pant for reckless dismissalIND vs AUS: Legendary Sunil Gavaskar was furious with India wicketkeeper-batter Rishabh Pant for throwing away his wicket on Day 3 of the MCG Test match. Gavaskar called Pant stupid and said the left-hander should have walked back to the Australian dressing room instead of the Indian one.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-nitish-kumar-reddy-maiden-fifty-pushpa-move-2656550-2024-12-28",
      "headline": "Watch: Nitish Reddy celebrates maiden Test fifty with Pushpa signature move AUS vs IND: Nitish Kumar Reddy celebrated with Allu Arjun's Pushpa move after scoring his maiden Test fifty off 81 balls in the Boxing Day Test against Australia at the iconic Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cristiano-ronaldo-bold-manchester-united-ownership-claim-2656546-2024-12-28",
      "headline": "Cristiano Ronaldo makes bold Manchester United ownership claimCristiano Ronaldo has defended Ruben Amorim amid the Manchester United \"storm\" and made a very bold claim about his possible return to the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-trolls-chess-federation-with-jeans-pant-rapid-blitz-championship-2656545-2024-12-28",
      "headline": "Carlsen trolls Chess Federation with OOTD post after quitting championshipThe world's best chess player Magnus Carlsen quit the 2024 World Rapid and Blitz Championship after being fined by FIDE over dress code. Carlsen trolled the tournament with a cheeky post on social media after quitting.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-why-jeans-clad-magnus-carlsen-quit-rapid-blitz-championship-2656527-2024-12-28",
      "headline": "I'm out: Why jeans-clad Magnus Carlsen quit Rapid and Blitz ChampionshipMagnus Carlsen has explained his decision to quit the World Rapid and Blitz Championships 2024 after being fined $200 for violating the FIDE dress code for the event by wearing jeans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-bgt-jasprit-bumrah-sam-konstas-mcg-2656526-2024-12-28",
      "headline": "Bumrah breaks silence on Sam Konstas' onslaught from Day 1 of MCG TestIND vs AUS: Star India pacer Jasprit Bumrah breaks his silence on Sam Konstas after their incredible battle on Day 1 of the Boxing Day Test match. Unorthodox Konstas hit Bumrah for 2 sixes. This was the first time in 3 years that Bumrah was hit for a six in Test cricket.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}