{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-key-tax-benefits-under-section-80c-80d-24b-and-more-that-every-taxpayer-must-know-2719733-2025-05-05",
      "headline": "ITR filing 2025: Key tax benefits under Section 80C, 80D, and 24BIn case you are opting for the old tax regime, under Section 80C you can claim up to Rs 1.5 lakh of deductions every year. This section covers several popular options, like Public Provident Fund (PPF), Employees' Provident Fund (EPF), ELSS mutual fund, 5-year fixed deposits and premiums for life insurance, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/swiggy-share-price-jumps-six-percent-today-bolt-expansion-10-minuite-delivery-2719694-2025-05-05",
      "headline": "Explained: Why Swiggy share price jumped 6% todaySwiggy's stock may have surged nearly 6% today, but it's still down 40% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/to-save-crores-in-taxes-investment-banker-on-why-rich-are-buying-farmhouses-2719681-2025-05-05",
      "headline": "'To save crores in taxes': Investment banker on why rich are buying farmhousesIn India, any income from farming is completely tax-free. That means if someone says they earned money by selling vegetables, fruits, or milk from their farmland, they don't have to pay income tax on it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-to-list-tomorrow-check-allotment-status-latest-gmp-2719668-2025-05-05",
      "headline": "Ather Energy IPO to list tomorrow. Check allotment status, latest GMPAther Energy's IPO, which ran from April 28 to April 30, involved a mix of fresh equity worth Rs 2,626 crore and an offer for sale (OFS) of 1.1 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-2719650-2025-05-05",
      "headline": "Adani Ports shares jump 7% after Q4 results. Check target price, other detailsAdani Ports stock climbed to Rs 1,355 from its previous close of Rs 1,267.05, up 6.90% on the Bombay Stock Exchange (BSE). The upmove came after the company reported robust March quarter earnings and posted healthy operational growth in April, prompting several brokerages to raise their target prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-500-points-3-reasons-why-stock-market-is-rising-2719633-2025-05-05",
      "headline": "Sensex rises over 500 points. 3 reasons why stock market is risingForeign investor inflows, strong macro data, and improving global cues have fired up the bulls. While geopolitical risks linger, analysts say the rally could hold as long as key support levels stay intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kotak-mahindra-bank-tumbles-over-5-after-q4-miss-buy-hold-or-sell-2719611-2025-05-05",
      "headline": "Kotak Mahindra Bank tumbles over 5% after Q4 miss. Buy, hold or sell?Kotak Mahindra Bank shares fell over 5% in early trade on Monday as investors reacted negatively to the lender's Q4 financial results. Despite some positives in asset quality, softer loan growth and pressure on core income metrics weighed on investor sentiment, especially after the recent rally in the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-share-price-dips-nearly-2-after-q4-profit-miss-buy-hold-or-sell-2719605-2025-05-05",
      "headline": "SBI share price dips nearly 2% after Q4 profit miss. Buy, hold or sell?SBI's share price was down 1.54% to Rs 787.75 on the Bombay Stock Exchange (BSE) at 10:04 am. Earlier in the trading session, the stock declined to Rs 783 on the BSE, marking its sixth consecutive session in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-350-points-nifty-above-24400-adani-ports-gains-2-2719590-2025-05-05",
      "headline": "Sensex jumps over 350 points, Nifty above 24,400; Adani Ports gains nearly 3%The BSE Sensex rose 341 points to 80,843, while the Nifty50 advanced 84 points to 24,421 around 9:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-opening-today-what-to-expect-from-sensex-nifty-key-details-2719575-2025-05-05",
      "headline": "Stock market opening: Sensex, Nifty likely to gain amid easing trade tensionsStock market opening today: Markets look set to kick off the week on a bullish note, as easing global tensions, robust foreign inflows, and Wall Street gains provide the perfect cocktail for investor optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-adani-ports-sbi-kotak-bank-tata-motors-and-more-2719565-2025-05-05",
      "headline": "Stocks to watch today: Adani Ports, SBI, Kotak Bank, Tata Motors and moreMarkets may open strong as global cues turn favourable and earnings momentum continues. Key stocks across banking, auto, infra, and FMCG could dominate investor attention this Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-representatives-lobby-trump-officials-drop-265-million-bribery-fraud-case-2719554-2025-05-05",
      "headline": "Adani aides lobby Trump officials to drop $265 million bribery case: ReportAdani's representatives are trying to make the case that his prosecution does not align with Trump's priorities and should be reconsidered, Bloomberg News reported."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/devendra-fadnavis-praises-ranbir-kapoor-sai-pallavi-film-ramayana-2719744-2025-05-05",
      "headline": "Devendra Fadnavis praises Ranbir Kapoor, Sai Pallavi film RamayanaMaharashtra Chief Minister Devendra Fadnavis praised the upcoming film Ramayana, calling its production world-class after visiting the set. Directed by Nitesh Tiwari, the film stars Ranbir Kapoor, Sai Pallavi, and Yash in the lead roles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adnan-sami-says-pakistanis-told-him-we-hate-our-army-shuts-down-trolls-2719726-2025-05-05",
      "headline": "Adnan Sami says Pakistanis told him 'We hate our army', shuts down trollsSinger Adnan Sami, known for his strong anti-Pakistan stands, schooled X users trying to troll him for his Indian citizenship in the wake of the Pahalgam terror attack. He also narrated an incident involving Pakistanis criticising their army for 'destroying' the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-teams-up-with-ranveer-jr-ntr-trainer-lloyd-stevens-for-atlee-film-2719709-2025-05-05",
      "headline": "Allu Arjun teams up with Ranveer, Jr NTR's trainer Lloyd Stevens for Atlee's filmAllu Arjun has joined hands with celebrity fitness trainer Lloyd Stevens as he begins preparing for his next, a high-budget actioner with director Atlee. The film was announced on April "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-wife-gautami-kapoor-wanted-to-gift-daughter-sia-sex-toy-at-16-2719719-2025-05-05",
      "headline": "Actor Gautami Kapoor wanted to gift sex toy to daughter when she turned 16TV actor Gautami Kapoor shared in an interview that she openly discussed intimacy with her daughter Sia. She also considered gifting her a sex toy at 16 to encourage informed choices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-explores-sabka-apna-apna-normal-in-1st-poster-of-sitaare-zameen-par-2719696-2025-05-05",
      "headline": "Aamir Khan explores 'sabka apna apna normal' in 1st poster of Sitaare Zameen ParAamir Khan's Sitaare Zameen Par, a sequel to Taare Zameen Par, is set to release on June 20. The first official poster of the film has been unveiled with 10 debut actors under the direction of R.S. Prasanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-slams-bollywood-calls-them-chor-for-copying-south-content-2719664-2025-05-05",
      "headline": "Nawazuddin Siddiqui slams Bollywood, calls them 'chor' for copying south contentNawazuddin Siddiqui slammed Bollywood for lacking originality, accusing the industry of copying stories and songs, especially from South films. While promoting 'Costao', he called the current trend of sequels and remakes a sign of 'creative bankruptcy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-composer-mickey-j-meyer-reacts-to-criticism-for-his-music-defends-score-2719643-2025-05-05",
      "headline": "HIT 3 composer Mickey J Meyer reacts to criticism for his music, defends scoreMusic composer Mickey J Meyer, who composed music for the recent Telugu film HIT 3 starring Nani and Srinidhi Shetty, has responded to criticism over his music with a post on his X account. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/ajaz-khan-house-arrest-promised-role-in-ott-show-rape-case-filed-proposed-inside-house-police-maharashtra-mumbai-actor-2719653-2025-05-05",
      "headline": "Actor claims 'House Arrest' host Ajaz Khan promised role in show, raped her: CopsA fellow actor has alleged that actor Ajaz Khan raped her on the pretext of marriage and a role in his show 'House Arrest'. Mumbai police filed an FIR against the 'Bigg Boss'-fame actor, while the investigation is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-joins-kiara-advani-new-york-met-gala-debut-2719646-2025-05-05",
      "headline": "Sidharth Malhotra joins Kiara in New York as she gears up for Met Gala debutSidharth Malhotra is currently in New York along with his actor-wife Kiara Advani. She will be making her Met Gala debut on May 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-hilarious-met-gala-dig-proves-punjabi-humour-is-global-gold-video-2719619-2025-05-05",
      "headline": "Diljit Dosanjh's hilarious Met Gala dig proves Punjabi humour is global gold. VideoDiljit Dosanjh is all excited about his Met Gala debut, and he didn't hide that excitement in a new video on Instagram which is now going viral. The Punjabi singer-actor hilariously asked his fans not to send him wedding invites any more, because he's now got the most prestigious invite ever.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/met-gala-2025-dos-donts-shah-rukh-khan-fashion-biggest-night-2719596-2025-05-05",
      "headline": "Met Gala 2025: The dos, don'ts, and Shah Rukh Khan on fashion's biggest nightThe Met Gala 2025 promises glamour with India's biggest stars making waves. Shah Rukh Khan debuts alongside Priyanka Chopra in dazzling Indian outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-hari-hara-veera-mallu-shoot-trailer-songs-coming-soon-2719582-2025-05-05",
      "headline": "Pawan Kalyan joins Hari Hara Veera Mallu shoot, 'explosive' trailer coming soonAmid his busy schedule in politics, actor Pawan Kalyan has finally resumed the shooting of 'Hari Hara Veera Mallu'. The makers announced the same and added that only two days of shooting are left. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-vs-retro-box-office-collection-day-4-detailed-report-nani-leads-decent-hold-for-suriya-in-1st-weekend-2719576-2025-05-05",
      "headline": "HIT 3 vs Retro box office Day 4: Nani leads, decent hold for Suriya in 1st weekendBoth 'HIT: The Third Case' and 'Retro' finished their opening weekend on a decent note at the box office. However, it was Nani's film that emerged as the winner after crossing the benchmark of Rs 50 crore nett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-box-office-collection-day-4-detailed-report-ajay-devgan-film-wins-audience-in-1st-weekend-monday-crucial-2719566-2025-05-05",
      "headline": "Raid 2 box office Day 4: Ajay's film wins audience in 1st weekend, Monday crucial'Raid 2' performed well in its opening weekend at the box office. The film is now eyeing the benchmark of Rs 100 crore in India, but it will have to register a good Monday to achieve the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-back-on-instagram-after-meltdown-thanks-ananya-panday-raghav-juyal-siddhanth-chaturvedi-2719560-2025-05-05",
      "headline": "Babil Khan back on Instagram after meltdown, thanks Siddhant, Ananya and othersActor Babil Khan made his comeback on Instagram hours after he deleted his account. He had posted two videos of him having a meltdown, which left fans worrying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prakash-raj-abir-gulaal-ban-fawad-khan-central-censorship-2719544-2025-05-05",
      "headline": "Actor Prakash Raj stirs 'intolerance' debate amid Fawad Khan's Abir Gulaal banPrakash Raj has voiced strong criticism against the practice of banning films in India while talking about Fawad Khan's 'Abir Gulaal'. He warned that such censorship, fuelled by political pressure, threatens the freedom of expression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-raghv-juyal-support-babil-khan-his-viral-meltdown-video-2719446-2025-05-04",
      "headline": "Siddhant Chaturvedi, Raghav Juyal support Babil Khan after viral meltdown videoSiddhant Chaturvedi and Raghav Juyal reacted to Babil Khan's viral video. The two extended their support to the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-bradley-cooper-seal-romance-kiss-on-instagram-birthday-2719442-2025-05-04",
      "headline": "Gigi Hadid and Bradley Cooper seal romance with a kiss on InstagramSupermodel Gigi Hadid made Instagram official with Bradley Cooper. She shared a picture of the two kissing at her 30th birthday celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/taapsee-pannu-haseen-dillruba-3-in-works-kanika-dhillon-vikrant-massey-2719431-2025-05-04",
      "headline": "Taapsee Pannu's Haseen Dillruba 3 in works: ReportTaapsee Pannu and writer Kanika Dhillon are set to reunite again for Haseen Dilruba third part. As per a report, the scripting of the next part is officially in the works. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-slams-petitioner-fresh-plea-pahalgam-tourists-terror-attack-jammu-kashmir-sensitivity-gain-publicity-dismiss-2719748-2025-05-05",
      "headline": "Publicity: Court scolds petitioner again, rejects PIL for security of touristsThe Supreme Court had also rejected advocate Vishal Tiwari's petition last week seeking a judicial probe into the Pahalgam attack, which left 26 dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-begins-work-on-2-hydropower-projects-in-kashmir-blindsides-pak-report-2719680-2025-05-05",
      "headline": "India snubs Pak, begins work on 2 hydropower projects in Kashmir: ReportIndia did not inform Pakistan about the work at the Salal and Baglihar projects, which is being done for the first time since they were built, as the Indus Waters Treaty had blocked such work, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-tests-fatah-missile-with-120-km-range-amid-tensions-with-india-report-2719760-2025-05-05",
      "headline": "Pak tests Fatah missile with 120 km range amid tensions with India: ReportEscalating tensions with India, Pakistan has successfully tested a surface-to-surface ballistic missile with a 450-km range on Saturday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ajay-rai-rafale-jet-nimbu-mirchi-pahalgam-attack-response-action-bjp-condemns-war-of-words-2719667-2025-05-05",
      "headline": "Congress leader taunts Centre with nimbu-mirchi on toy Rafale, BJP feels the burnCongress leader Ajay Rai's use of a toy Rafale fighter jet, complete with dangling 'nimbu-mirchi', to criticise the government's response to the Pahalgam attack has invited the BJP's wrath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-5/",
      "headline": "The illusion of azaadi and Kashmir's historic deceptionIn part 5 of our series on the history of terrorism in Kashmir, we revisit the period between 1990 and 1996, when the Valley gave the illusion of a successful uprising"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/digha-jagannath-dham-controversy-mamata-banerjee-responds-2719742-2025-05-05",
      "headline": "We respect both Puri temple, Jagannath Dham: Mamata Banerjee reacts to rowAmid the controversy, the Odisha government also said on Sunday it intended to send a letter to Banerjee, requesting her to stop referring to the recently constructed Jagannath temple in Digha as \"Jagannath Dham\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pleas-challenging-waqf-amendment-act-hearing-today-centre-affidavit-aimplb-2719571-2025-05-05",
      "headline": "Will Supreme Court pause Waqf Amendment Act? Key hearing todayWith Chief Justice Khanna retiring on May 13, the bench has limited time to hold a final hearing, as the case involves arguments from several lawyers representing the petitioners and the Centre, which has already submitted a 1,300-page interim affidavit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/house-arrest-viral-video-obscenity-row-mumbai-police-summon-ullu-app-owner-actor-ajaz-khan-vhp-activist-files-case-2719757-2025-05-05",
      "headline": "House Arrest row: Mumbai Police summons Ajaz Khan, Ullu app ownerMumbai Police summoned Ullu app owner and 'House Arrest' host Ajaz Khan amid a row over obscene clips from the OTT show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-thar-driver-runs-over-security-guard-objected-to-honking-arrested-viral-video-2719750-2025-05-05",
      "headline": "Hit-and-run caught on CCTV: Thar driver runs over guard who objected to honkingAccording to the victim's statement to the police, a man driving a Thar SUV began honking loudly behind him. He requested the driver to stop honking, but moments later, he was run over by the Thar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-khalistan-event-deportation-of-hindus-pm-modi-amit-shah-jaishankar-caged-effigy-2719628-2025-05-05",
      "headline": "Anti-Hindu parade in Toronto by Khalistanis, caged effigies of PM, Amit ShahThe parade included a large truck with a mock-up of a jail that had effigies of PM Modi, Home Minister Amit Shah, and External Affairs Minister S Jaishankar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indians-leave-their-children-us-borders-heres-why-illegal-immigration-canada-mexico-cross-ice-donald-trump-2718611-2025-05-05",
      "headline": "Why Indians abandoning their children at US border is on Trump's radarThousands of parents, including those from India, leave their children on the US-Mexico or US-Canada border in the hope that they will be taken in and granted American citizenship. This risky act might no longer remain a ticket to citizenship as Trump's Immigration and Customs Enforcement (ICE) is cracking down on this route."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adnan-sami-says-pakistanis-told-him-we-hate-our-army-shuts-down-trolls-2719726-2025-05-05",
      "headline": "Adnan Sami says Pakistanis told him 'We hate our army', shuts down trollsSinger Adnan Sami, known for his strong anti-Pakistan stands, schooled X users trying to troll him for his Indian citizenship in the wake of the Pahalgam terror attack. He also narrated an incident involving Pakistanis criticising their army for 'destroying' the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-pm-meets-defence-secretary-as-india-prepares-action-plan-against-pak-2719725-2025-05-05",
      "headline": "PM meets Defence Secretary amid tensions with Pak over J&K attack: SourcesPahalgam Attack Live Updates: Prime Minister Narendra Modi on Monday met Defence Secretary Rajesh Kumar Singh as India prepares an action plan against Pakistan following the Pahalgaam terror attack in which 26 people died. He earlier met Air Chief Marshal AP Singh amid escalating tensions between India and Pakistan. His interaction with AP Singh came less than 24 hours after a separate meeting between the Prime Minister and Admiral Dinesh K Tripathi, the Chief of the Naval Staff. The Prime Minister had also met Army Chief General Upendra Dwivedi last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-red-fort-fatehpur-sikri-mughal-heir-petition-bahadur-shah-zafar-2719671-2025-05-05",
      "headline": "Why not Fatehpur Sikri also? Top court rejects Mughal heir's claim on Red FortThe petitioner, who claimed to be a descendant of Mughal emperor Bahadur Shah Zafar, sought the possession of the Red Fort, citing her lineage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-himanshi-narwal-wife-navy-officer-online-hate-trolls-ncw-2719595-2025-05-05",
      "headline": "As Pahalgam's poster child of justice faces hate, women panel's tough messageThe outpouring of support for Himanshi Narwal, wife of a Navy officer killed in the Pahalgam terror attack, soon turned into hate on social media after she asked people not to target Muslims and Kashmiris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/magnesium-supplements-doctor-wellness-industry-insomnia-sleep-bones-health-benefits-2717924-2025-05-05",
      "headline": "Do you really need magnesium? Your doctor might disagreeMagnesium supplements have suddenly exploded into the market, with dozens of influencer-backed companies promising everything from 'glowy skin' to 'increased productivity' to 'a better night's sleep.'\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/is-rahul-gandhi-an-indian-citizen-allahabad-high-court-to-hear-centres-response-today-2719720-2025-05-05",
      "headline": "Is Rahul Gandhi an Indian citizen? High Court to hear Centre's response todayThe Allahabad High Court, in its previous hearing, had asked the Central government to submit a clear response on whether Rahul Gandhi is an Indian citizen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/ajaz-khan-house-arrest-promised-role-in-ott-show-rape-case-filed-proposed-inside-house-police-maharashtra-mumbai-actor-2719653-2025-05-05",
      "headline": "Actor claims 'House Arrest' host Ajaz Khan promised role in show, raped her: CopsA fellow actor has alleged that actor Ajaz Khan raped her on the pretext of marriage and a role in his show 'House Arrest'. Mumbai police filed an FIR against the 'Bigg Boss'-fame actor, while the investigation is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-man-body-found-kugam-river-imtiaz-ahmed-family-alleges-custodial-death-pahalgam-attack-2719502-2025-05-04",
      "headline": "Suspected Lashkar terrorist drowns while fleeing, family alleges custodial deathThe death of a 23-year-old man in Jammu and Kashmir's Kulgam, who allegedly drowned while escaping police custody, has sparked widespread outrage and demands for a judicial probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/met-gala-2025-dos-donts-shah-rukh-khan-fashion-biggest-night-2719596-2025-05-05",
      "headline": "Met Gala 2025: The dos, don'ts, and Shah Rukh Khan on fashion's biggest nightThe Met Gala 2025 promises glamour with India's biggest stars making waves. Shah Rukh Khan debuts alongside Priyanka Chopra in dazzling Indian outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/possibility-of-terror-strikes-on-jails-in-jammu-security-heightened-sources-2719559-2025-05-05",
      "headline": "Jammu jails on high alert, security tightened after intel on terror strike: SourcesThese jails currently house several high-profile terrorists and their associates, who are known to provide support to terrorists through logistical help, shelter, and by facilitating their movement, even if they are not directly involved in attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-back-on-instagram-after-meltdown-thanks-ananya-panday-raghav-juyal-siddhanth-chaturvedi-2719560-2025-05-05",
      "headline": "Babil Khan back on Instagram after meltdown, thanks Siddhant, Ananya and othersActor Babil Khan made his comeback on Instagram hours after he deleted his account. He had posted two videos of him having a meltdown, which left fans worrying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-hilarious-met-gala-dig-proves-punjabi-humour-is-global-gold-video-2719619-2025-05-05",
      "headline": "Diljit Dosanjh's hilarious Met Gala dig proves Punjabi humour is global gold. VideoDiljit Dosanjh is all excited about his Met Gala debut, and he didn't hide that excitement in a new video on Instagram which is now going viral. The Punjabi singer-actor hilariously asked his fans not to send him wedding invites any more, because he's now got the most prestigious invite ever.  "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pants-lucknow-super-giants-lsg-qualification-scenario-2719761-2025-05-05",
      "headline": "IPL qualification scenario: Is Rishabh Pant and LSG's playoffs dream truly alive?Lucknow Super Giants (LSG) suffered their third consecutive loss in the Indian Premier League 2025 (IPL 2025) after being undone by Punjab Kings (PBKS) in Match 54 of the season. However, captain Rishabh Pant is still hopeful of making it to the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/srh-head-coach-daniel-vettori-stresses-on-importance-of-fielding-ahead-of-dc-clash-2719727-2025-05-05",
      "headline": "\"If we can field well vs DC, it'll have a huge bearing on the game: SRH head coachSunrisers Hyderabad (SRH) head coach Daniel Vettori has stressed the importance of good fielding ahead of their home fixture against Delhi Capitals. SRH still have an outside chance of making it to the play-offs despite being at the ninth spot, having six points from ten games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-dc-karun-nair-press-conference-2719721-2025-05-05",
      "headline": "Still batting well: Karun Nair not concerned with form before SRH clashIPL 2025, SRH vs DC: Karun Nair said that he isn't concerned with his form and is happy to have played cameos of late. Nair has scored 154 runs from six games at an average of 25.66 with a top score of 89 against Mumbai Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/daniel-vettori-brushes-off-fitness-concerns-for-mohammed-shami-2719711-2025-05-05",
      "headline": "Daniel Vettori brushes off fitness concerns for Mohammed Shami amid poor formSunrisers Hyderabad (SRH) head coach Daniel Vettori has brushed aside any fitness concerns for fast bowler Mohammed Shami amid his poor form in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-karun-nair-srh-vs-dc-press-conference-2719706-2025-05-05",
      "headline": "DC need to play with freedom, peak at the right time: Karun NairIPL 2025, SRH vs DC: Karun Nair said that Delhi Capitals need to play with freedom in their next game against Sunrisers Hyderabad as the race to book playoff berths intensifies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-chess-world-cup-exclusive-interview-2719682-2025-05-05",
      "headline": "Vidit Gujrathi relaxed before World Cup: Not taking too much pressureIn an interview with India Today during a visit to the Delhi Public School in Gautam Buddha Nagar for a chess tournament, Indian grandmaster Vidit Gujrathi opened up on his goals with the World Cup ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatres-father-yogesh-advises-son-not-to-imitate-vaibhav-suryavanshi-2719665-2025-05-05",
      "headline": "Ayush Mhatre advised not to imitate Vaibhav Suryavanshi by father YogeshChennai Super Kings' (CSK) batter Ayush Mhatre's father Yogesh has advised him not to imitate Vaibhav Suryavanshi following his breathtaking innings of 94 (48) vs Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-dc-hyderabad-predicted-xi-team-news-head-to-head-pitch-2719642-2025-05-05",
      "headline": "Delhi aim to gain lost momentum against out-of-form Hyderabad.IPL 2025, SRH vs DC: Pressure is on the Sunrisers Hyderabad, who are in a must-win position for a berth in the playoffs. Delhi Capitals will look to reclaim their spot in the top four when they meet the Orange Army on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-suggests-rishabh-pant-to-call-ms-dhoni-to-regain-form-2719635-2025-05-05",
      "headline": "Call MS Dhoni: Virender Sehwag's suggestion to Rishabh Pant for regaining formFormer India cricketer turned commentator Virender Sehwag has suggested struggling Rishabh Pant to call MS Dhoni to bounce back to form in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/lsgs-ayush-badoni-rues-poor-powerplay-after-37-run-loss-vs-pbks-in-dharamsala-2719612-2025-05-05",
      "headline": "LSG's Ayush Badoni rues poor powerplay after 37-run loss vs PBKS in DharamsalaLucknow Super Giants (LSG) batter Ayush Badoni rued his team's poor powerplay with the bat following their 37-run loss against Punjab Kings (PBKS). LSG lost three wickets in the powerplay and were restricted to 199/7 in their 20 overs chasing a target of 237."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsgs-ayush-badoni-delighted-with-his-valiant-74-vs-pbks-2719602-2025-05-05",
      "headline": "Ayush Badoni delighted with his valiant 74 vs PBKS: I always thrive under pressureLucknow Super Giants (LSG) batter Ayush Badoni revealed that he was delighted with his fiery innings of 74 against Punjab Kings (PBKS) in Match 54 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatres-father-yogesh-advises-son-not-to-imitate-vaibhav-suryavanshi-2719665-2025-05-05",
      "headline": "Ayush Mhatre advised not to imitate Vaibhav Suryavanshi by father YogeshChennai Super Kings' (CSK) batter Ayush Mhatre's father Yogesh has advised him not to imitate Vaibhav Suryavanshi following his breathtaking innings of 94 (48) vs Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-dc-hyderabad-predicted-xi-team-news-head-to-head-pitch-2719642-2025-05-05",
      "headline": "Delhi aim to gain lost momentum against out-of-form Hyderabad.IPL 2025, SRH vs DC: Pressure is on the Sunrisers Hyderabad, who are in a must-win position for a berth in the playoffs. Delhi Capitals will look to reclaim their spot in the top four when they meet the Orange Army on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-suggests-rishabh-pant-to-call-ms-dhoni-to-regain-form-2719635-2025-05-05",
      "headline": "Call MS Dhoni: Virender Sehwag's suggestion to Rishabh Pant for regaining formFormer India cricketer turned commentator Virender Sehwag has suggested struggling Rishabh Pant to call MS Dhoni to bounce back to form in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/lsgs-ayush-badoni-rues-poor-powerplay-after-37-run-loss-vs-pbks-in-dharamsala-2719612-2025-05-05",
      "headline": "LSG's Ayush Badoni rues poor powerplay after 37-run loss vs PBKS in DharamsalaLucknow Super Giants (LSG) batter Ayush Badoni rued his team's poor powerplay with the bat following their 37-run loss against Punjab Kings (PBKS). LSG lost three wickets in the powerplay and were restricted to 199/7 in their 20 overs chasing a target of 237."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsgs-ayush-badoni-delighted-with-his-valiant-74-vs-pbks-2719602-2025-05-05",
      "headline": "Ayush Badoni delighted with his valiant 74 vs PBKS: I always thrive under pressureLucknow Super Giants (LSG) batter Ayush Badoni revealed that he was delighted with his fiery innings of 74 against Punjab Kings (PBKS) in Match 54 of the Indian Premier League 2025 (IPL 2025)."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}