{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-to-boost-russian-oil-imports-in-september-despite-us-pressure-report-2778293-2025-08-28",
      "headline": "India to boost Russian oil imports in September despite US pressure: ReportIndia has become Russia's biggest oil customer since Western sanctions forced Moscow to redirect supplies in 2022. Cheaper Russian crude has helped Indian refiners keep costs down, but the trade has also attracted criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-extends-duty-free-cotton-imports-to-shield-textile-sector-from-us-tariffs-2778283-2025-08-28",
      "headline": "India extends duty-free cotton imports to shield textile sector from US tariffsFor mills, the duty-free extension offers much-needed relief. The earlier exemption, ending in September, was too short to allow large imports, as shipments from exporting nations often take more than a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-how-to-improve-grievance-loan-approval-emis-personal-finance-2778278-2025-08-28",
      "headline": "CIBIL Decoded: How delayed credit score updates can hit your loans and ratesA delay of even a few weeks in updating information with the credit bureau can decide whether a person gets a loan, how much interest they pay, or if they are denied altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-drops-1500-points-in-two-sessions-will-us-tariffs-keep-hitting-dalal-street-2778229-2025-08-28",
      "headline": "Sensex drops 1,500 points in two sessions: Will US tariffs keep hitting D-Street?Dalal Street remains volatile as global trade tensions collide with domestic pressures. Investors face uncertainty, with heavyweights under pressure, mid- and small-caps slipping, while cautious buying emerges at key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/more-taxes-coming-from-people-than-companies-finds-report-2778219-2025-08-28",
      "headline": "More taxes coming from people than companies, finds reportFor the first time, personal income tax collections in India have overtaken corporate tax, signalling a major shift in the country's tax landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-2-0-tax-slabs-reduction-state-revenue-loss-decoded-2778191-2025-08-28",
      "headline": "GST 2.0: Which states will take the biggest hit if taxes drop?GST 2.0 promises lower taxes and cheaper goods, but the real challenge looms for revenue-dependent states. The question is, who absorbs the shortfall when the proposals come into effect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-closes-706-points-lower-nifty-below-24600-hcltech-down-3-percent-2778184-2025-08-28",
      "headline": "Sensex closes 706 points lower; Nifty below 24,600; HCLTech down 3%The S&P BSE Sensex was down by 706 points to close at 80,080.57, while the NSE Nifty50 lost 211.15 points to end at 24,500.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-become-2nd-largest-economy-by-2038-report-2778125-2025-08-28",
      "headline": "India on track to become 2nd largest economy by 2038: ReportWith a combination of a young population, rising domestic consumption, fiscal discipline, and structural reforms, India appears well-positioned to climb the global economic ladder in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dont-miss-this-step-after-filing-itr-here-what-to-do-2778053-2025-08-28",
      "headline": "Don't miss this step after filing ITR: Here's what to doSimply filing your ITR is not enough. You must verify it within 30 days, else, missing this important step could mean delays, penalties, and even your return being declared invalid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cut-textile-fertiliser-us-tariff-rate-rationalisation-low-cost-tax-free-nil-slab-festive-season-2778026-2025-08-28",
      "headline": "GST 2.0 boost for textile, fertiliser sectors as Trump's 50% tariff kicks inThe textile and fertiliser industries are expected to be among the biggest beneficiaries of the upcoming GST 2.0 rationalisation amid US President Donald Trump's 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dividend-mismatch-with-ais-here-is-how-taxpayers-should-report-it-2778019-2025-08-28",
      "headline": "Dividend mismatch with AIS? Here's how taxpayers should report itFiling ITR often becomes confusing when dividend income in your personal records doesn't match what appears in AIS. Here's how to handle it while filing ITR."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/busan-international-film-festival-competition-spying-stars-nila-madhab-panda-indira-tiwari-2778287-2025-08-28",
      "headline": "Nila Madhab Panda's Spying Stars to compete at Busan International Film Festival'Spying Stars' is the only Indian co-production competing in the Busan International Film Festival's new competitive section. The film's themes of AI and humanity highlight a timely cinematic exploration amid changing festival formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pati-patni-aur-woh-do-shoot-disrupted-prayagraj-clash-locals-crew-ayushmann-sara-ali-khan-2778347-2025-08-28",
      "headline": "Pati Patni Aur Woh Do shoot disrupted by clash between crew and locals in PrayagrajFilming of Pati Patni Aur Woh 2 has started in Prayagraj amid tensions between locals and the film crew. Viral videos reveal physical fights and heated exchanges, raising concerns over shoot disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/lokah-chapter-1-chandra-review-kalyani-priyadarshan-dulquer-salmaan-film-dominic-arun-promising-world-building-hampered-by-cliches-2778345-2025-08-28",
      "headline": "Lokah Chapter 1 Chandra review: Promising world-building hampered by clichesRelease Date:Thu Aug 28, 2025Lokah Chapter 1: Chandra movie review:  Director Dominic Arun's 'Lokah Chapter 1: Chandra' is a superhero film starring Kalyani Priyadarshan, Naslen and Sandy in lead roles. Despite predictable and familiar screenplay, the film is technically strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anusha-dandekar-going-public-with-relationships-dealing-with-break-ups-trolls-2778304-2025-08-28",
      "headline": "Anusha Dandekar on going public with relationships, dealing with break-ups and trollsActor Anusha Dandekar opens up about her very public relationships and past break-ups. She discussed the balance between privacy and publicity and the mixed reactions she received online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nandamuri-balakrishna-akhanda-2-release-postponed-new-date-to-be-announced-soon-2778264-2025-08-28",
      "headline": "Nandamuri Balakrishna's Akhanda 2 release postponed, new date to be announced soonThe release of 'Akhanda 2', starring Balakrishna and directed by Boyapati Srinu, has been postponed. The makers promise a grand cinematic experience with a new date to be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-cancels-mohali-award-show-security-dispute-2778316-2025-08-28",
      "headline": "Honey Singh backs out of award show over security concerns: SourcesHoney Singh backed out of a Mohali award show due to denial of personal bodyguards. The cancellation has sparked a financial dispute between the artist and organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shilpa-shirodkar-supernatural-drama-jatadhara-2778309-2025-08-28",
      "headline": "Shilpa Shirodkar is driven by greed in first look from JatadharaShilpa Shirodkar stars as Shobha in the upcoming supernatural drama 'Jatadhara'. The film promises a mysterious storyline with a powerful female lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-8-conversation-that-never-was-belly-jeremiah-2778238-2025-08-28",
      "headline": "The Summer I Turned Pretty S3 episode 8: The conversation that never was In 'The Summer I Turned Pretty' Season 3, episode 8, Belly and Jeremiah's pre-wedding talk skipped over the real issues. Here's the messy, honest showdown that should have happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emma-heming-on-moving-bruce-willis-new-home-amid-dementia-hardest-decision-2778251-2025-08-28",
      "headline": "Emma Heming on moving Bruce Willis to new home amid dementia: Hardest decisionBruce Willis is living separately under full-time care as he battles frontotemporal dementia. His family has adjusted living arrangements to provide tailored support and maintain close bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sidharth-malhotra-fatherhood-diaper-duties-great-indian-kapil-show-param-sundari-janhvi-kapoor-2778265-2025-08-28",
      "headline": "Sidharth Malhotra shares fatherhood tales on The Great Indian Kapil ShowSidharth Malhotra appeared on The Great Indian Kapil Show to promote his film Param Sundari. He shared heartfelt stories about his new role as a father, bringing warmth and laughter to the episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-engagement-post-travis-kelce-becomes-most-reposted-instagram-2778121-2025-08-28",
      "headline": "Taylor Swift's engagement post with Kelce becomes most reposted on InstagramPop star Taylor Swift and athlete Travis Kelce's engagement post amassed over 1 million reposts in just six hours. While in the first hour alone, it received 14 million likes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-ashnoor-kaur-fears-abuse-ready-show-real-self-set-rules-2778242-2025-08-28",
      "headline": "Exclusive: Ashnoor Kaur fears abuse but ready for Bigg Boss 19 challengesAshnoor Kaur steps into Bigg Boss 19 with excitement and apprehension about the show's controversies. She aims to reveal her true self while advocating for respect and boundaries inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kingdom-ott-release-vijay-deverakonda-fans-disapointed-over-deleted-romantic-song-2778128-2025-08-28",
      "headline": "Kingdom OTT release: Vijay Deverakonda fans disappointed over deleted romantic songActor Vijay Deverakonda's 'Kingdom' recently disappointed fans after its OTT release as the the popular song 'Hridayam Laopala' and key fight scenes were edited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-shares-wife-akanksha-chamola-doesnt-want-kids-2778183-2025-08-28",
      "headline": "Gaurav Khanna shares wife Akanksha Chamola doesn't want kids: I have to stand by itBigg Boss 19 contestant Gaurav Khanna shared that while he wants to become a father, his wife Akanksha Chamola does not wish to have kids. Although he respected Akanksha's decision, he hasn't ruled out parenthood in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bon-appetit-your-majesty-review-yoona-lee-chae-min-royal-kitchen-comedy-netflix-2778224-2025-08-28",
      "headline": "Bon Appetit review: YoonA, Lee Chae-min's Kdrama is messy but flavourfulRelease Date:Sun Aug 24, 2025Bon Appetit, Your Majesty series review: Netflix's 'Bon Appetit, Your Majesty' follows a French chef transported to the Joseon dynasty. The show blends cooking, comedy, and time-travel but struggles with effects and pacing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mohanlal-hridayapoorvam-heartfelt-drama-grief-second-chances-2778187-2025-08-28",
      "headline": "Hridayapoorvam review: Mohanlal film is heartfelt take on grief and second chancesRelease Date:Thu Aug 28, 2025Hridayapoorvam movie review: Director Sathyan Anthikad's 'Hridayapoorvam' starring Mohanlal, Malavika Mohanan and Sangeeth Prathap, tells a touching story of loss and renewal. The film combines humour and emotion to explore family bonds and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-says-dancing-with-shahid-kapoor-kunal-kemmu-was-stressful-for-her-2778182-2025-08-28",
      "headline": "Exclusive: Soha Ali Khan says dancing with Shahid, Kunal was stressful for herActor Soha Ali Khan, in an exclusive interview with India Today, spoke about the struggles of grooving to 'Gustakh Dil' alongside Shahid Kapoor. She is currently waiting for her podcast, 'All About Her,' to launch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-seeks-canada-visa-help-gandhi-premiere-toronto-film-festival-pratik-gandhi-2778201-2025-08-28",
      "headline": "Hansal Mehta seeks help for Canadian visa for Gandhi premiere in TorontoDirector Hansal Mehta shared a post on X and expressed his ordeal of not getting a Canada visa before his upcoming series 'Gandhi' premiere at the Toronto International Film Festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-summoned-court-controverdial-song-newborns-2778173-2025-08-28",
      "headline": "Court summons Guru Randhawa over controversial song about newbornsSinger Guru Randhawa has been summoned by the Samrala court for controversial lyrics referencing opium given to newborns. The summons on September 2 raises questions about artistic freedom and cultural sensitivities in music."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/nda-wins-324-seats-india-bloc-208-seats-if-polls-are-held-today-mood-of-the-nation-survey-2778314-2025-08-28",
      "headline": "Mood of the Nation with Modi, 300+ seats for NDA if Lok Sabha polls held todayThe NDA is likely to put up a dominant show and win 324 seats if the Lok Sabha elections are held today, as per the Mood of the Nation survey. The Congress-led opposition alliance, which gave the NDA a run for its money in 2024, is projected to be down to 208."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/never-said-i-will-retire-or-someone-should-retire-mohan-bhagwats-u-turn-on-retirement-at-75-rule-2778337-2025-08-28",
      "headline": "Never said I or someone should retire: Mohan Bhagwat's U-turn on 75-limit remarkMohan Bhagwat claimed that he never said that he would retire or someone else should retire. He said that the volunteers of the Sangh do whatever they are asked to do by the Sangh, irrespective of their age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/mood-of-the-nation/story/pm-modis-popularity-plateaus-drop-for-nda-suggests-mood-of-the-nation-2778351-2025-08-28",
      "headline": "PM Modi's popularity plateaus, drop for NDA, suggests Mood of the NationPrime Minister Narendra Modi's performance remains the most popular leader, although his government's performance witnessed a 10 per cent drop in the past six months, as per the August 2025 Mood of the Nation (MOTN) survey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-zurich-live-updates-neeraj-chopra-javelin-julian-weber-2778402-2025-08-28",
      "headline": "Diamond League Live: Julian Weber takes lead with 91.51m throw, Neeraj strugglesDiamond League Final Live updates: Julian Weber has started things off in massive fashion as he initially took the world lead with a 91.37m throw on his very first chance, and bested it with a 91.51m in his second. Meanwhile, Neeraj is on third after hitting 84.35m in his first throw, and 82.00m on his second."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-war-trump-delulu-peter-navarro-russian-oil-remark-india-china-tariff-2778228-2025-08-28",
      "headline": "Modi's war is Trump's deluluPeter Navarro, once an economist, now parrots Donald Trump's whims, absurdly blaming India for Russia's war over discounted oil purchases. India's crime isn't war, but survival by securing energy for its millions. And Trump's tariff madness isn't strategy, but delulu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-live-tennis-score-iga-swiatek-jannik-sinner-zverev-coco-gauff-2778346-2025-08-28",
      "headline": "Day 5 Live Score: Jannik Sinner in action, Osaka in Round 3US Open 2025 Day 5 live: Naomi Osaka defeated Hailey Baptiste 6-3, 6-1. Jannik Sinner is in action, taking on Alexei Popyrin. Iga Swiatek moves to Round 3 after defeating World No. 66 Suzan Lamens 6-1, 4-6, 6-4, in the morning session of Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/there-could-be-a-struggle-but-theres-no-quarrel-mohan-bhagwat-on-rss-government-equation-2778294-2025-08-28",
      "headline": "Struggle might be there, but no quarrel: Mohan Bhagwat on RSS-Centre tiesRSS chief Mohan Bhagwat underscored that there could be 'matbhed (differences of opinion)' while working towards the goals of the country, but there were no 'manbhed (heart-to-heart disagreements)'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/mood-of-the-nation/story/nda-holds-edge-in-bihar-india-bloc-gains-suggests-mood-of-the-nation-2778334-2025-08-28",
      "headline": "NDA holds edge in Bihar, INDIA bloc gains, suggests Mood of the NationThe Mood of the Nation poll shows that the NDA's vote share would likely rise from 47% in the 2024 general elections to 50% if polls were held for Lok Sabha seats in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/heart-health-india-rising-attacks-early-detection-lifestyle-changes-2778039-2025-08-28",
      "headline": "I am a doctor and here's why I think seemingly fit people collapse in gymsIndia faces a sharp rise in heart attacks among younger adults, with many undiagnosed conditions. Early detection and consistent lifestyle habits are important improving cardiac health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/mood-of-the-nation/story/india-dealing-handling-us-trump-tariffs-mood-of-the-nation-survey-result-2778384-2025-08-28",
      "headline": "Are Indians worried about Trump's tariffs? What MOTN survey foundA majority of Indians are concerned about US tariffs, with 63% saying Trump's duties on Indian goods worry them, the India Today-Cvoter Mood of the Nation poll shows. But the survey also shows 61% back a firm stance in trade talks with Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/trump-tariffs-will-india-merely-absorb-its-harshest-trade-shock-or-emerge-stronger-2778272-2025-08-28",
      "headline": "Trump tariffs: Will India merely absorb its harshest trade shock or emerge stronger?As the US doubles down with duties, the Modi government will try to cushion exporters in the immediate while exploring new, long-term markets in an increasingly protectionist world"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/taylor-swift-georgina-rodriguez-big-rocks-rings-jewellery-trend-2778058-2025-08-28",
      "headline": "Big rocks, bigger statements: The rise of supersized engagement ringsJust as everyone was still swooning over Georgina Rodriguez's stunning engagement ring, Taylor Swift treated us to her dreamy proposal photos, giving us yet another supersized ring to admire. Oversized rings have officially become the hottest trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/mood-of-the-nation-august-2025-survey-tamil-nadu-elections-dmk-nda-vijay-factor-2778353-2025-08-28",
      "headline": "Vijay may end up helping DMK, hurting NDA in Tamil Nadu, shows MOTN surveyThe DMK-led alliance still calls the shots, despite facing anti-incumbency, with the Mood of the Nation August 2025 survey predicting it to win 36 of the state's 39 seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-appoints-dinesh-patnaik-as-high-commissioner-to-canada-9-months-after-withdrawing-envoy-2778320-2025-08-28",
      "headline": "Canada gets new Indian High Commissioner after 9 months as ties improve1990-batch Indian Foreign Service (IFS) officer Dinesh K Patnaik has been appointed as Indian High Commissioner to Canada, nine months after withdrawing the Indian envoy following diplomatic tensions between the two nations.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parents-should-try-for-three-children-good-for-everybodys-health-mohan-bhagwat-2778308-2025-08-28",
      "headline": "Have more kids while you can: RSS chief encourages parents to have 3 childrenRSS chief Mohan Bhagwat backed the idea of Indian parents having three children, saying it helps to stabilise the population and prevents communities from facing extinction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mohanlal-hridayapoorvam-heartfelt-drama-grief-second-chances-2778187-2025-08-28",
      "headline": "Hridayapoorvam review: Mohanlal film is heartfelt take on grief and second chancesRelease Date:Thu Aug 28, 2025Hridayapoorvam movie review: Director Sathyan Anthikad's 'Hridayapoorvam' starring Mohanlal, Malavika Mohanan and Sangeeth Prathap, tells a touching story of loss and renewal. The film combines humour and emotion to explore family bonds and second chances."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-today-mood-of-the-nation-ram-temple-biggest-achievement-nda-unemployment-biggest-failure-2778350-2025-08-28",
      "headline": "Ram Temple biggest achievement of NDA, unemployment biggest failure: MOTN surveyIndia still believes that the Modi government has performed well and PM Modi has also lived up to their expectations, suggesting the NDA was most likely to win again if the polls were held today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-mood-of-the-nation-rahul-gandhi-best-suited-to-lead-opposition-finds-survey-2778386-2025-08-28",
      "headline": "Rahul Gandhi best suited to lead Opposition, says India Today MOTN surveyMamata Banerjee, Akhilesh Yadav, Arvind Kejriwal and Priyanka Gandhi were also among people's choices, but behind Rahul Gandhi to lead the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-cancer-staging-helps-oncologists-personalise-treatment-plans-2778261-2025-08-28",
      "headline": "How cancer staging helps oncologists personalise treatment plansThrough cancer staging, patients and healthcare providers can work together effectively, matching treatment strategies with achievable objectives"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/massive-russian-drone-missile-attack-kyiv-kills-14-injures-stalls-peace-talks-eu-2778178-2025-08-28",
      "headline": "Russian missile strike in Kyiv kills 14; world leaders condemn 'senseless' attackPowerful Russian missile strikes rocked Kyiv, lighting up the sky and leaving behind columns of smoke as an overnight attack damaged and destroyed buildings in several districts of the city. The Russian Defence Ministry said it deployed hypersonic 'Kinzhal' missiles, drones and high-precision air-launched munitions in the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-in-incredible-health-but-im-ready-to-lead-if-tragedy-strikes-says-vance-glbs-2778443-2025-08-29",
      "headline": "Trump in incredible health, but I'm ready to lead if tragedy strikes, says VanceJD Vance praised Trump's \"incredible energy\" and health in a USA Today interview but acknowledged he is prepared to assume the presidency if tragedy strikes, while also weighing in on global and cultural headlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dubai-princess-sheikha-mahra-engaged-to-rapper-french-montana-instagram-divorce-post-2778101-2025-08-28",
      "headline": "Dubai princess, who divorced husband on Instagram, engaged to rapper French MontanaDubai princess Sheikha Mahra Mohammed Rashed Al Maktoum is engaged to Moroccan-American rapper French Montana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-administration-h1b-student-visa-green-card-new-front-against-india-howard-lutnick-governor-ron-desantis-2778078-2025-08-28",
      "headline": "Is Trump now targeting India's soft exports with H-1B, student visa crackdown?The H-1B visa, which has got the US some of its top engineers and CEOs, is now being branded a \"scam\" by the Trump administration. After the 50% tariffs on Indian products, is President Donald Trump now targeting India's soft exports with a crackdown on H-1B, student visas and Green Cards?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-malewar-duleep-trophy-central-zone-vidharbha-ranji-trophy-stats-2778409-2025-08-28",
      "headline": "Who is Danish Malewar? 21-year-old Vidarbha star continues to shine in Duleep TrophyDanish Malewar's unbeaten 198 on Duleep Trophy debut continues his meteoric rise in Indian domestic cricket. From Vidarbha's Ranji hero to Central Zone's mainstay, the 21-year-old is fast emerging as a serious contender for India's Test batting future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-zurich-live-updates-neeraj-chopra-javelin-julian-weber-2778402-2025-08-28",
      "headline": "Diamond League Live: Julian Weber takes lead with 91.51m throw, Neeraj strugglesDiamond League Final Live updates: Julian Weber has started things off in massive fashion as he initially took the world lead with a 91.37m throw on his very first chance, and bested it with a 91.51m in his second. Meanwhile, Neeraj is on third after hitting 84.35m in his first throw, and 82.00m on his second."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vishwanathan-anand-advice-world-championship-2024-ding-liren-2778356-2025-08-28",
      "headline": "Gukesh reveals mentor's advice which inspired his historic World Championship runGukesh Dommaraju admitted that overconfidence cost him the opening game of his World Championship run. But a pep talk from Viswanathan Anand and a timely mental reset helped the teenager bounce back, leading to his historic title in Singapore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-live-tennis-score-iga-swiatek-jannik-sinner-zverev-coco-gauff-2778346-2025-08-28",
      "headline": "Day 5 Live Score: Jannik Sinner in action, Osaka in Round 3US Open 2025 Day 5 live: Naomi Osaka defeated Hailey Baptiste 6-3, 6-1. Jannik Sinner is in action, taking on Alexei Popyrin. Iga Swiatek moves to Round 3 after defeating World No. 66 Suzan Lamens 6-1, 4-6, 6-4, in the morning session of Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-south-africa-coach-confirms-dane-van-niekerk-wont-feature-despite-retirement-u-turn-2778340-2025-08-28",
      "headline": "South Africa coach confirms Dane van Niekerk won't feature in Women's World CupDane van Niekerk will not feature in South Africa's Women's World Cup 2025 squad despite reversing her retirement. Coach Mandla Mashimbyi confirmed she must work her way back into contention, though she remains in plans for future series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-retirement-virat-kohli-insta-message-reaction-2778313-2025-08-28",
      "headline": "A nice compliment: Pujara on Virat Kohli's Insta message on retirementCheteshwar Pujara has retired from all formats of cricket after a notable 103-Test career. His retirement has sparked warm tributes, especially from Virat Kohli, highlighting Pujara's vital role in the Indian team and his future potential in coaching and broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-fsdl-joint-proposal-indian-football-supreme-court-verdict-postponed-2778315-2025-08-28",
      "headline": "ISL gets lifeline as AIFF, FSDL file joint resolution in Supreme Court: ExplainedAIFF and FSDL have submitted a joint proposal to the Supreme Court, outlining the roadmap for Indian football's future. The plan covers the new season kickoff, commercial partner selection, and financial commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-team-september-4-arrival-training-2778302-2025-08-28",
      "headline": "Asia Cup: India squad to assemble in Dubai on Sept 4, players to arrive in batchesIndia's 15-member squad will assemble in Dubai on September 4 ahead of the Asia Cup. The staggered arrival plan aims to ease logistics and travel for players from various cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-rajat-patidar-central-zone-century-mohammad-shami-bowling-east-zone-2778284-2025-08-28",
      "headline": "Duleep Trophy: Rajat Patidar hits quickfire ton, Mohammed Shami puts solid shiftRajat Patidar smashed a 96-ball century and Danish Malewar struck an unbeaten 198 to put Central Zone on top against North East Zone in the Duleep Trophy. Mohammed Shami also returned with a wicket for the East Zone against the North Zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-pv-sindhu-wang-tanisha-dhruv-kapila-2778248-2025-08-28",
      "headline": "PV Sindhu rediscovers vintage touch, stuns World No. 2 to enter quartersBWF World Championships: PV Sindhu showed glimpses of her vintage attacking game as she decimated World No. 2 Wang Zhi Yi of China 21-17, 21-15. Sindhu is a win away from securing her sixth world meet medal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-cheteshwar-pujara-test-retirement-kris-srikkanth-bcci-2778234-2025-08-28",
      "headline": "Virat Kohli, Rohit and Pujara deserved better send-offs: Srikkanth slams BCCIFormer India chief selector Kris Srikkanth has voiced his disappointment over the manner in which Virat Kohli, Rohit Sharma, and Cheteshwar Pujara bid farewell to Test cricket. He criticised the BCCI for lapses in communication, saying that the lack of proper coordination overshadowed the send-offs of these stalwarts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-fsdl-joint-proposal-indian-football-supreme-court-verdict-postponed-2778315-2025-08-28",
      "headline": "ISL gets lifeline as AIFF, FSDL file joint resolution in Supreme Court: ExplainedAIFF and FSDL have submitted a joint proposal to the Supreme Court, outlining the roadmap for Indian football's future. The plan covers the new season kickoff, commercial partner selection, and financial commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-team-september-4-arrival-training-2778302-2025-08-28",
      "headline": "Asia Cup: India squad to assemble in Dubai on Sept 4, players to arrive in batchesIndia's 15-member squad will assemble in Dubai on September 4 ahead of the Asia Cup. The staggered arrival plan aims to ease logistics and travel for players from various cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-rajat-patidar-central-zone-century-mohammad-shami-bowling-east-zone-2778284-2025-08-28",
      "headline": "Duleep Trophy: Rajat Patidar hits quickfire ton, Mohammed Shami puts solid shiftRajat Patidar smashed a 96-ball century and Danish Malewar struck an unbeaten 198 to put Central Zone on top against North East Zone in the Duleep Trophy. Mohammed Shami also returned with a wicket for the East Zone against the North Zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-pv-sindhu-wang-tanisha-dhruv-kapila-2778248-2025-08-28",
      "headline": "PV Sindhu rediscovers vintage touch, stuns World No. 2 to enter quartersBWF World Championships: PV Sindhu showed glimpses of her vintage attacking game as she decimated World No. 2 Wang Zhi Yi of China 21-17, 21-15. Sindhu is a win away from securing her sixth world meet medal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-cheteshwar-pujara-test-retirement-kris-srikkanth-bcci-2778234-2025-08-28",
      "headline": "Virat Kohli, Rohit and Pujara deserved better send-offs: Srikkanth slams BCCIFormer India chief selector Kris Srikkanth has voiced his disappointment over the manner in which Virat Kohli, Rohit Sharma, and Cheteshwar Pujara bid farewell to Test cricket. He criticised the BCCI for lapses in communication, saying that the lack of proper coordination overshadowed the send-offs of these stalwarts."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}