{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/not-just-smog-but-onions-too-will-leave-you-teary-eyed-this-diwali-2621250-2024-10-22",
      "headline": "Not just smog but onions too will leave you teary-eyed this DiwaliOnions are currently selling for Rs 60-80 per kg in retail markets, and the impact of weather disruptions is likely to keep prices elevated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-q2-results-net-profit-jumps-389-percent-to-rs-176-crore-revenue-jumps-rs-4799-crore-2621199-2024-10-22",
      "headline": "Zomato Q2 results: Profit soars 389% to Rs 176 crore, revenue jumps 68%Zomato Q2 results: The strong bottom-line performance can be attributed to rising food delivery margins and the quick commerce segment, which is nearing break-even. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-crashes-over-900-points-nifty-drops-below-crucial-support-level-2621167-2024-10-22",
      "headline": "Sensex crashes over 900 points, Nifty drops below crucial support levelThe S&P BSE Sensex lost 930.55 points to end at 80,220.72, while the NSE Nifty50 was down 309 points to close at 24,472.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-meltdown-today-sensex-down-930-points-nifty-plunges-s-2621159-2024-10-22",
      "headline": "Stock market meltdown: Why Sensex tanked over 900 points todayStock market today: At the closing bell, Sensex plunged 930.55 points to 80,220.72, while the Nifty fell 309 points to 24,472.10. The sharp decline wiped out over Rs 9 lakh crore in the BSE's market capitalisation, leaving many investors reeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/has-adar-poonawalla-hit-bulls-eye-with-dharma-productions-acquisition-50-percent-stake-karan-johar-2621119-2024-10-22",
      "headline": "Has Adar Poonawalla hit bull's eye with Dharma Productions acquisition?Dharma Productions, established in 1976 by producer Yash Johar and now overseen by his son Karan Johar, has played a significant role in shaping Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-cleared-investigation-no-action-resignation-government-sources-2621050-2024-10-22",
      "headline": "Opposition's charge against Sebi chief false: Government sourcesSerious allegations of conflict of interest and financial misconduct were levelled against the Sebi chief by US short-seller Hindenburg Research and the Congress party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambuja-cement-acquires-orient-cements-for-rs-8100-crore-details-here-2621030-2024-10-22",
      "headline": "Ambuja Cement acquires Orient Cements for Rs 8,100 crore. Details here Ambuja Cement aims to increase its cement production capacity to 100 million tonnes per annum (MTPA) by FY25, with the acquisition adding about 30 MTPA to its total."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-shipbuilders-share-price-falls-sharply-stock-split-retail-investors-explained-2621024-2024-10-22",
      "headline": "Mazagon Dock Shipbuilders share price down nearly 9%. Know whyMazagon Dock Shipbuilders stock price: Shares of the company were trading 8.52% lower at Rs 4,268.85 on the Bombay Stock Exchange (BSE) at 12:39 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-down-7-percent-despite-q2fy25-profit-at-rs-930-crore-details-here-2621000-2024-10-22",
      "headline": "Paytm share price plunges 7% despite Q2 profit growth. Here's whyPaytm share price today: The digital payment firm's share price plunged sharply despite the company posting a net profit in the second quarter of the ongoing financial year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-q2fy25-results-strong-growth-revenue-profit-rs-930-crore-2620986-2024-10-22",
      "headline": "Paytm showcases strong growth in revenue, delivers profit of Rs 930 crore in Q2Paytm Q2 results: The quarter also witnessed a steady rise in revenue and contribution profit, reflecting the success of Paytm's strategy of scaling payments and expanding its financial services offerings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-stock-market-listing-dalal-street-debut-hold-sell-book-profit-long-term-gains-2620955-2024-10-22",
      "headline": "Hyundai Motor makes weak D-Street debut. Hold for long-term gains or sell now?Hyundai Motor India stock market listing: A long-term ride to profits or time for investors to hit the brakes after its lacklustre debut?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-higher-led-by-gains-in-bank-and-it-stocks-2620936-2024-10-22",
      "headline": "Sensex, Nifty open marginally higher led by gains in bank and IT stocks The S&P BSE Sensex gained 153.24 points to 81,304.51, while the NIfty50 added 36.80 points to 24,817.90 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-stock-market-listing-discount-weak-dalal-street-debut-2620933-2024-10-22",
      "headline": "Hyundai Motor India, India's biggest IPO, disappoints on stock market debut Hyundai share market listing: The IPO, which closed with an overall subscription of 2.37 times, saw tepid interest from retail investors, who subscribed to just 50% of their allotted shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-stock-market-bse-nse-share-allotment-investor-2620905-2024-10-22",
      "headline": "Hyundai IPO set for muted stock market debut on BSE, NSEHyundai India Share Price Listing: The IPO, which opened on October 15, faced a slow start, particularly from retail investors, who subscribed to just 50% of their allotted shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-prices-surge-past-usd-69000-cryptocurrency-ethereum-whats-driving-rally-us-elections-trump-2620680-2024-10-21",
      "headline": "Bitcoin prices surge past $69,000: What's driving the rally? Bitcoin touched $69,408.1 (roughly Rs 58,35,227) on international exchanges on Monday, marking a recovery after the cryptocurrency was in a price slump for the last three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-q2-results-net-profit-jumps-21-yoy-to-rs-546-crore-2620612-2024-10-21",
      "headline": "Bajaj Housing Finance Q2 results: Net profit jumps 21% YoY to Rs 546 croreThe revenue from operations also saw a significant rise, with the company reporting Rs 2,410 crore for Q2FY25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-sebi-nod-rs-3000-crore-ipo-all-details-here-2620519-2024-10-21",
      "headline": "Health Insurer Niva Bupa gets Sebi nod for Rs 3,000 crore IPO. Details hereThe IPO, which the company filed for back in June, will consist of a mix of Rs 800 crore in fresh shares and an offer for sale (OFS) that includes Rs 320 crore from Bupa Singapore Holdings and Rs 1,880 crore from Fettle Tone LLP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-as-it-and-metal-stocks-drag-markets-lower-2620517-2024-10-21",
      "headline": "Sensex, Nifty fall as IT and metal stocks drag markets lowerThe S&P BSE Sensex was down 73.48 points to close at 81,151.27, while the NSE Nifty50 lost 72.95 points to end at 24,781.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-stock-market-listing-ipo-latest-gmp-what-to-expect-2620506-2024-10-21",
      "headline": "Hyundai IPO GMP improves slightly ahead of market listing. What to expect?Hyundai stock market listing: The initial public offering, which opened on October 15, has seen a rollercoaster ride in terms of investor interest and grey market performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manappuram-finance-shares-drop-5-percent-today-24-percent-in-8-days-what-is-behind-the-fall-2620496-2024-10-21",
      "headline": "Manappuram Finance shares drop 5% today, 24% in 8 days: What's behind fall?The shares of Manappuram Finance hit a low of Rs 145.50, marking a decline of nearly 24% over the past eight trading sessions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-russia-kazan-brics-summit-russian-president-vladimir-putin-meeting-2620855-2024-10-22",
      "headline": "India ready to provide all cooperation to resolve Ukraine conflict: PM to PutinIn his bilateral meeting with Russian President Vladimir Putin, Prime Minister Narendra Modi said India is willing to provide all cooperation for a peaceful resolution to the Ukraine conflict."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-panel-meet-scuffle-trinamool-mp-kalyan-banerjee-injures-himself-2621118-2024-10-22",
      "headline": "Chaos at Waqf panel meet, Trinamool MP smashes bottle in anger, injures handSources said the Trinamool MP picked up a glass water bottle and hit it on the table and hurt himself by accident during the meeting on the Waqf bill."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/three-killed-14-trapped-as-under-construction-building-collapses-in-bengaluru-2621256-2024-10-22",
      "headline": "Three killed, 14 trapped as under-construction building collapses in BengaluruAt least 14 workers are feared trapped after an under-construction building collapsed on Tuesday near Hennur, Bengaluru, following heavy rains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/10-indigo-flights-mainly-on-international-routes-receive-fresh-threats-hoax-bomb-calls-exceed-100-2621008-2024-10-22",
      "headline": "79 flights receive fresh threats in 24 hours, over 160 hoax calls in a weekSeveral airlines have reported a series of fresh threats affecting 79 of its flights, mainly on international routes, this morning. The incidents, involving multiple hoax calls, have pushed the total number of such threats received by the airline this week to around 169."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-japan-friendship-marriages-be-a-hit-in-india-too-2620655-2024-10-22",
      "headline": "Can Japan's friendship marriages be a hit in India too?In Japan, a growing number of people are embracing 'friendship marriages' - partnerships where individuals choose to live together and marry platonic friends rather than romantic partners. Could this concept gain popularity in India as well?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-khar-gymkhana-mumbai-father-religious-activities-conversion-2621051-2024-10-22",
      "headline": "Khar Gymkhana revokes membership of Jemimah over father's 'religious activities' Khar Gymkhana in Mumbai has revoked Jemimah Rodrigues' membership after her father used the club for religious activities. The decision followed concerns over breach of club rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-confirms-reaching-agreement-with-india-to-end-border-standoff-in-eastern-ladakh-2621064-2024-10-22",
      "headline": "China confirms agreement with India to end border standoff in Ladakh: ReportBeijing said that it has reached a resolution with New Delhi on resolving the border conflict and will work to implement solutions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-putin-bilateral-meeting-india-russia-relations-translation-brics-summit-2621217-2024-10-22",
      "headline": "Our ties so close, no translation needed: Putin's remark makes PM Modi chucklePrime Minister Narendra Modi and Russian President Vladimir Putin held a bilateral meeting on the sidelines of the Brics Summit in Kazan. This is PM Modi's second visit to Russia in three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/has-adar-poonawalla-hit-bulls-eye-with-dharma-productions-acquisition-50-percent-stake-karan-johar-2621119-2024-10-22",
      "headline": "Has Adar Poonawalla hit bull's eye with Dharma Productions acquisition?Dharma Productions, established in 1976 by producer Yash Johar and now overseen by his son Karan Johar, has played a significant role in shaping Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-meltdown-today-sensex-down-930-points-nifty-plunges-s-2621159-2024-10-22",
      "headline": "Stock market meltdown: Why Sensex tanked over 900 points todayStock market today: At the closing bell, Sensex plunged 930.55 points to 80,220.72, while the Nifty fell 309 points to 24,472.10. The sharp decline wiped out over Rs 9 lakh crore in the BSE's market capitalisation, leaving many investors reeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/explained-why-were-cricket-hockey-dropped-from-commonwealth-games-2026-2621043-2024-10-22",
      "headline": "Explained: Why were cricket, hockey dropped from Commonwealth Games 2026Glasgow Games organisers have reduced the number of sporting disciplines from 19 to 10. Among the major sports - cricket, hockey and shooting were cut - some of India's biggest medal prospects. Here's why the Commonwealth Games 2026 is having less number of events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mark-zuckerberg-wife-priscilla-chan-steal-the-show-with-a-sweet-kiss-at-disco-party-2621234-2024-10-22",
      "headline": "Mark Zuckerberg, wife Priscilla steal the show with a sweet kiss at disco partyMark Zuckerberg organised a disco party for wife Priscilla Chan because his \"disco queen\" wanted one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2016-vs-achuthanandan-return-of-the-angry-old-man-2620618-2024-10-21",
      "headline": "From the India Today archives (2016) | V.S. Achuthanandan: Return of the angry old manAs India's oldest communist leader turns 101 years old, a flashback from the redoubtable warhorse of Kerala politics"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-jharkhand-india-alliance-seat-sharing-woes-shiv-sena-rjd-indira-gandhi-2620944-2024-10-22",
      "headline": "40 years on, Indira Gandhi's 'artificial unity' barb returns to bite CongressReflecting what Indira Gandhi said criticising the 'artificial unity' among opposition parties in 1984, the Congress is grappling with alliance challenges with INDIA bloc parties in Maharashtra and Jharkhand. The Congress is struggling to maintain cohesion within the bloc amid tensions over seat-sharing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/elon-musk-tesla-x-space-x-donald-trump-republican-kamala-harris-us-elections-2024-pennsylvania-millions-campaign-2621070-2024-10-22",
      "headline": "Why Elon Musk is hijacking Trump's campaignElon Musk, the Tesla and SpaceX boss, has put in everything to back Republican candidate Donald Trump in the 2024 US presidential election. However, it isn't just about campaigning for Trump. Musk, the \"dark MAGA\", might be working towards a technocratic state, where corporates needn't be at the mercy of regulators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/why-do-planes-dump-fuel-mid-air-during-emergency-landing-and-where-does-it-go-2620674-2024-10-22",
      "headline": "Why do planes dump fuel during emergency landings, and where does it go?While fuel dumping may seem counterintuitive, especially given current fuel prices, it remains a crucial safety measure in aviation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/udhayanidhi-stalin-tamil-nadu-deputy-chief-minister-sanatana-dharma-remarks-apology-dmk-2620979-2024-10-22",
      "headline": "I'm Kalaignar's grandson, won't apologise: Udhayanadhi Stalin on Sanatana rowUdhayanidhi Stalin refused to apologise for 'Sanatana Dharma' remarks, stating that the comments targeted its alleged repressive practices towards women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/taslima-nasreen-nasrin-thanks-amit-shah-home-minister-india-residency-permit-bangladesh-writer-2621031-2024-10-22",
      "headline": "Taslima Nasreen thanks Amit Shah day after SOS over residency permitExiled Bangladeshi author-activist Taslima Nasreen expressed her gratitude to Indian Home Minister Amit Shah day after seeking his help on renewing her residency permit. This comes amid concerns of rising extremism in Bangladesh after the fall of Sheikh Hasina's regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-auto-driver-goes-viral-for-teaching-kannada-to-non-kannadigas-with-poster-inside-his-vehicle-2620917-2024-10-22",
      "headline": "Viral: Bengaluru auto driver's 'genius' idea to teach Kannada during rideA Bengaluru auto driver, Ajmal Sultan, has gone viral for teaching basic Kannada through a poster inside his vehicle. Passengers can learn common phrases, like greetings and payment questions, while they ride. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/oldest-evidence-of-animal-butchery-in-india-found-from-extinct-elephant-fossil-2620960-2024-10-22",
      "headline": "Extinct elephant fossils reveal oldest evidence of butchery in IndiaThe fossils were first discovered in 2000 near Pampore in the Kashmir Valley, but their significance remained unclear until now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/gaurav-sawants-take-on-why-russia-is-important-for-indias-energy-security-2621218-2024-10-22",
      "headline": "Gaurav Sawant's take on why Russia is important for India's energy securityEnergy security is crucial for India, and Russia plays a key role in meeting this need. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-dana-landfall-odisha-west-bengal-imd-weather-body-rain-rescue-evacuation-2620871-2024-10-22",
      "headline": "Cyclone Dana to hit Odisha, Bengal in 48 hours, schools shut, evacuations onCyclone Dana will likely cause extremely heavy rainfall in Odisha and West Bengal on October 24 and 25, and heavy rainfall in both states till Friday, the weather body said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/ahmedabad/story/ahmedabad-gujarat-man-runs-fake-court-poses-as-arbitrator-settling-land-disputes-arrested-2621060-2024-10-22",
      "headline": "Ahmedabad: Fake court busted inside real court, had 'settled' land disputeThe accused posed as a court-appointed official arbitrator and passed an order in a land dispute case in 2019. His fraud came to light when the same case came for hearing in the Ahmedbad City Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/mithya-season-2-trailer-huma-qureshi-avantika-dassani-in-darker-mystery-2621259-2024-10-22",
      "headline": "Mithya Season 2 trailer: Huma Qureshi-Avantika Dassani in 'darker' mysteryZee5 released the trailer of Mithya Season 2: The Darker Chapter online. The show features Huma Qureshi, Avantika Dassani and Naveen Kasturia in important roles, and is releasing on November 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaana-samjho-na-kartik-triptiis-new-bhool-bhulaiyaa-3-song-is-about-beats-and-vibes-2621247-2024-10-22",
      "headline": "Jaana Samjho Na: Kartik-Triptii's new Bhool Bhulaiyaa 3 song is about beats and vibesBhool Bhulaiyaa 3's new song Jaana Samjho Na, featuring Kartik Aaryan and Triptii Dimri, is a romantic track that revives a popular melody with a fresh twist. The film, directed by Anees Bazmee, is set to continue its horror-comedy saga with a star-studded cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-hema-sharma-husband-allegations-salman-khan-eviction-2621203-2024-10-22",
      "headline": "BB18's Hema Sharma on husband's allegations: He couldn't stand my popularityHema Sharma, also known as Viral Bhabhi, was evicted from Bigg Boss 18 on October 20. Following her exit, she shared her journey with India Today Digital. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-ajay-devgn-rohit-shetty-join-salman-khan-weekend-ka-vaar-episode-2621208-2024-10-22",
      "headline": "Bigg Boss 18: Ajay Devgn, Rohit Shetty to join Salman KhanAjay Devgn and Rohit Shetty will join Salman Khan on Bigg Boss 18's Weekend Ka Vaar episode to promote Singham Again. Arbaaz Khan, along with Arshad Warsi and Meher Vij, will also feature to promote Bandaa Singh Chaudhary."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rishabh-pant-bengaluru-test-daryl-mitchell-ryan-ten-doeschate-2621252-2024-10-22",
      "headline": "Why Rishabh Pant's Bengaluru heroics didn't scare New Zealand, reveals MitchellNew Zealand all-rounder Daryl Mitchell revealed that Rishabh Pant's heroics in the second Test didn't scare their team as they were focussed on taking wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-jason-gillespie-picks-littered-bottles-by-pakistan-players-after-training-in-rawalpindi-3rd-test-2621249-2024-10-22",
      "headline": "Watch: Jason Gillespie picks littered bottles by Pakistan players after trainingA video has been going viral on social media where Pakistan team's Test coach was spotted picking up discarded bottles littered by the players after their training session in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-pune-test-pitch-daryl-mitchell-press-conference-2621239-2024-10-22",
      "headline": "New Zealand not worried if Pune Test pitch is spin-friendly: Daryl MitchellIndia vs New Zealand: All-rounder Daryl Mitchell said New Zealand will be prepared for spin-friendly conditions in the second Test, starting October 24 in Pune. Speculation is rife that the pitch in Pune will assist spin bowlers. India lost the first Test in pacer-friendly conditions in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-what-happened-the-last-time-india-played-a-test-match-in-pune-2621228-2024-10-22",
      "headline": "IND vs NZ: What happened the last time India played a Test match in PuneIndia will host New Zealand at the Maharashtra Cricket Association Stadium in Pune for the 2nd Test. Let us get to know India's history in the format at this venue. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/commonwealth-games-2026-hockey-excluded-harmanpreet-singh-craig-fulton-india-vs-germany-2621216-2024-10-22",
      "headline": "India captain, coach respond to hockey's exclusion from Commonwealth Games 2026India's hockey captain Harmanpreet Singh and coach Craig Fulton expressed disappointment over hockey's exclusion from the 2026 Commonwealth Games in Glasgow. The event will feature only 10 sports, excluding several where India excels, as part of budget constraints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-sa-kyle-verreynne-wiaan-mulder-taijul-islam-mushfiqur-rahim-mahmudul-hasan-joy-2621206-2024-10-22",
      "headline": "BAN vs SA: Mahmudul, Mushfiqur hold fort for Bangladesh on Day 2 after early blowsBangladesh finished Day 2 of the first Test against South Africa on 101/3 trailing by 101 runs. . Mahmudul Hasan Joy (38*) and Mushfiqur Rahim (31*) took their team to stumps after early strikes from Kagiso Rabada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/commonwealth-games-trimming-india-badminton-secretary-conspiracy-sideline-2621200-2024-10-22",
      "headline": "Commonwealth Games trimming conspiracy to sideline India: Badminton body secretary Commonwealth Games 2026: The Glasgow edition of the quadrennial spectacle has been trimmed to 10 spots. Some of India's productive sports, including badminton, shooting and wrestling, have been dropped from the roster. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-hasan-mahmuds-direct-throw-misses-stumps-rather-hits-south-african-batter-in-dhaka-1st-test-2621197-2024-10-22",
      "headline": "Watch: Hasan Mahmud's direct throw misses the stumps, hits South African batterA wild throw from Hasan Mahmud struck Dane Piedt instead of the stumps, turning a simple run-out into a hilarious mishap. The chaotic moment on Day 2 left players and fans in splits as South Africa dominated proceedings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kyle-verreynne-scores-first-hundred-by-south-africa-wicketkeeper-in-bangladesh-ban-vs-sa-2621168-2024-10-22",
      "headline": "Kyle Verreynne scores first hundred by South Africa wicketkeeper in BangladeshSouth Africa's Kyle Verreynne became the first wicketkeeper batter from his nation to score a Test century in Bangladesh during Day 2 of the first Test against the hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/saudi-pro-league-emotional-neymar-thrilled-after-12-month-injury-return-for-al-hilal-2621155-2024-10-22",
      "headline": "I'm back: Emotional Neymar thrilled after 12-month injury return for Al-HilalAn emotional Neymar proclaimed that he is well and truly back after making his return for Al-Hilal on October 21, Monday. Neymar came on a substitute for Al-Hilal in their match against Al-Ain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-ind-vs-nz-ryan-ten-doeschate-pune-test-mca-stadium-2621148-2024-10-22",
      "headline": "Mohammed Siraj is going through a wicked drought: Assistant coach Ten DoeschateIND vs NZ: India assistant coach Ryan ten Doeschate is not worried about Mohammed Siraj's dry run in home Tests. Siraj was not able to pick a single wicket with the new ball despite overseas conditions in the Bengaluru Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/commonwealth-games-trimming-india-badminton-secretary-conspiracy-sideline-2621200-2024-10-22",
      "headline": "Commonwealth Games trimming conspiracy to sideline India: Badminton body secretary Commonwealth Games 2026: The Glasgow edition of the quadrennial spectacle has been trimmed to 10 spots. Some of India's productive sports, including badminton, shooting and wrestling, have been dropped from the roster. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-hasan-mahmuds-direct-throw-misses-stumps-rather-hits-south-african-batter-in-dhaka-1st-test-2621197-2024-10-22",
      "headline": "Watch: Hasan Mahmud's direct throw misses the stumps, hits South African batterA wild throw from Hasan Mahmud struck Dane Piedt instead of the stumps, turning a simple run-out into a hilarious mishap. The chaotic moment on Day 2 left players and fans in splits as South Africa dominated proceedings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kyle-verreynne-scores-first-hundred-by-south-africa-wicketkeeper-in-bangladesh-ban-vs-sa-2621168-2024-10-22",
      "headline": "Kyle Verreynne scores first hundred by South Africa wicketkeeper in BangladeshSouth Africa's Kyle Verreynne became the first wicketkeeper batter from his nation to score a Test century in Bangladesh during Day 2 of the first Test against the hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/saudi-pro-league-emotional-neymar-thrilled-after-12-month-injury-return-for-al-hilal-2621155-2024-10-22",
      "headline": "I'm back: Emotional Neymar thrilled after 12-month injury return for Al-HilalAn emotional Neymar proclaimed that he is well and truly back after making his return for Al-Hilal on October 21, Monday. Neymar came on a substitute for Al-Hilal in their match against Al-Ain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-ind-vs-nz-ryan-ten-doeschate-pune-test-mca-stadium-2621148-2024-10-22",
      "headline": "Mohammed Siraj is going through a wicked drought: Assistant coach Ten DoeschateIND vs NZ: India assistant coach Ryan ten Doeschate is not worried about Mohammed Siraj's dry run in home Tests. Siraj was not able to pick a single wicket with the new ball despite overseas conditions in the Bengaluru Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-david-warner-ready-comeback-border-gavaskar-trophy-2621141-2024-10-22",
      "headline": "David Warner ready to reverse retirement if needed for Border-Gavaskar TrophyBorder-Gavaskar Trophy: David Warner said he is ready to come back from retirement and open the batting for Australia in the upcoming five-match Test series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-addition-india-squad-not-desperate-assistant-coach-2621132-2024-10-22",
      "headline": "Washington Sundar's addition to India squad not 'desperate' move: Assistant coach India's assistant coach Ryan ten Doeschate clarified Washington Sundar's inclusion for Tests against New Zealand as a tactical move, not desperation. Sundar's recent Ranji Trophy performance and past achievements highlight his selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-third-test-rehan-ahmed-return-rawalpindi-2621124-2024-10-22",
      "headline": "PAK vs ENG: Rehan Ahmed returns as England name 3 spinners for Rawalpindi TestRehan Ahmed is set to make his comeback in the England playing XI for the third Test against Pakistan in Rawalpindi. The team has opted for a spin-heavy lineup with three spinners in anticipation of dry pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-ranji-trophy-prithvi-shaw-dropped-explained-disciplinary-issues-2621067-2024-10-22",
      "headline": "Explained: Why was Prithvi Shaw dropped from Mumbai's Ranji Trophy squadMumbai Cricket Association did not name Prithvi Shaw in their Ranji Trophy squad for the third-round match against Tripura. Prithvi struggled to get going in the first two matches of Mumbai in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-kl-rahul-form-ryan-ten-doeschate-press-conference-pune-2621109-2024-10-22",
      "headline": "KL Rahul's form a concern for India? Assistant coach Ten Doeschate reactsIndia's assistant coach Ryan ten Doeschate expressed confidence in KL Rahul's current form despite low scores in the Bengaluru Test. Rahul struggled in the Bengaluru Test and failed to make an impact with the bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-rishabh-pant-injury-update-ryan-ten-doeschate-press-conference-pune-2621087-2024-10-22",
      "headline": "Will Rishabh Pant play Pune Test? Assistant coach Doeschate provides updateIndia's assistant coach Ryan ten Doeschate shares optimism about Rishabh Pant's fitness for the upcoming Pune Test. Pant suffered a knee injury but is showing signs of recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-bengal-vs-bihar-match-abandoned-cab-kalyani-cricket-academy-2621068-2024-10-22",
      "headline": "Cricket Association of Bengal faces heat after Ranji Trophy washoutThe Ranji Trophy match between Bengal and Bihar was abandoned without a ball bowled due to unplayable conditions following rain. The Cricket Association of Bengal faces criticism over ground management and preparation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-fritz-denis-shapovalov-slam-new-off-court-coaching-rule-2621054-2024-10-22",
      "headline": "Tennis stars Fritz, Shapovalov slam new off-court coaching ruleWorld No.6 Taylor Fritz said the International Tennis Federation's (ITF) decision to allow off-court coaching from 2025 would ruin the one v one strategic and mental elements of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-kl-rahul-form-ryan-ten-doeschate-press-conference-pune-2621109-2024-10-22",
      "headline": "KL Rahul's form a concern for India? Assistant coach Ten Doeschate reactsIndia's assistant coach Ryan ten Doeschate expressed confidence in KL Rahul's current form despite low scores in the Bengaluru Test. Rahul struggled in the Bengaluru Test and failed to make an impact with the bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-rishabh-pant-injury-update-ryan-ten-doeschate-press-conference-pune-2621087-2024-10-22",
      "headline": "Will Rishabh Pant play Pune Test? Assistant coach Doeschate provides updateIndia's assistant coach Ryan ten Doeschate shares optimism about Rishabh Pant's fitness for the upcoming Pune Test. Pant suffered a knee injury but is showing signs of recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-bengal-vs-bihar-match-abandoned-cab-kalyani-cricket-academy-2621068-2024-10-22",
      "headline": "Cricket Association of Bengal faces heat after Ranji Trophy washoutThe Ranji Trophy match between Bengal and Bihar was abandoned without a ball bowled due to unplayable conditions following rain. The Cricket Association of Bengal faces criticism over ground management and preparation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-fritz-denis-shapovalov-slam-new-off-court-coaching-rule-2621054-2024-10-22",
      "headline": "Tennis stars Fritz, Shapovalov slam new off-court coaching ruleWorld No.6 Taylor Fritz said the International Tennis Federation's (ITF) decision to allow off-court coaching from 2025 would ruin the one v one strategic and mental elements of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-rishabh-pant-x-factor-pat-cummins-2621052-2024-10-22",
      "headline": "Rishabh Pant always a bit of that X-factor in India's middle order: Pat CumminsAustralia captain Pat Cummins hails Rishabh Pant as the X-factor in India's middle-order for the upcoming Border-Gavaskar Trophy. Pant's recent performances, including a hundred against Bangladesh, have impressed the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-khar-gymkhana-mumbai-father-religious-activities-conversion-2621051-2024-10-22",
      "headline": "Khar Gymkhana revokes membership of Jemimah over father's 'religious activities' Khar Gymkhana in Mumbai has revoked Jemimah Rodrigues' membership after her father used the club for religious activities. The decision followed concerns over breach of club rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/explained-why-were-cricket-hockey-dropped-from-commonwealth-games-2026-2621043-2024-10-22",
      "headline": "Explained: Why were cricket, hockey dropped from Commonwealth Games 2026Glasgow Games organisers have reduced the number of sporting disciplines from 19 to 10. Among the major sports - cricket, hockey and shooting were cut - some of India's biggest medal prospects. Here's why the Commonwealth Games 2026 is having less number of events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-virat-kohli-reaches-pune-2621013-2024-10-22",
      "headline": "Watch: Virat Kohli arrives in Pune ahead of 2nd India vs New Zealand TestIndia's star batter Virat Kohli has reached Pune to join the squad for the second Test against New Zealand. Despite a strong performance in the second innings in Bengaluru, India will be looking to him for inspiration to level the series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}