{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/lpg-commercial-gas-cylinder-price-delhi-mumbai-chennai-increase-new-rate-2591614-2024-09-01",
      "headline": "Commercial LPG cylinders to get costlier from today, price hiked by Rs 39The price of commercial LPG cylinders has been increased nationwide, with a Rs 39 hike in Delhi for a 19 kg cylinder, now priced at Rs 1,691.50 as of September 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-fall-shaktikanta-das-rbi-government-spending-lok-sabha-elections-2591540-2024-08-31",
      "headline": "Lok Sabha polls, reduced spending: RBI Governor's reasons for Q1 GDP fallIndia's GDP growth slowed to 6.7 per cent in the April-June quarter, down from 8.2 per cent a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-and-isg-partner-to-bring-ondc-seller-app-at-global-fintech-fest-2024-2591461-2024-08-31",
      "headline": "JP Morgan and ISG partner to bring ONDC seller app at Global Fintech Fest 2024The partnership creates a 'one stop shop' solution for digital commerce by leveraging ISG's ONDC tech stack, powered by its ecosystem partner Protean, and the banking capabilities of JP Morgan in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ipo-frenzy-why-companies-are-rushing-to-go-public-advantage-disadvantage-future-outlook-stock-markets-2591411-2024-08-31",
      "headline": "India's IPO frenzy: Why companies are rushing to go publicIn the first half of 2024, while global IPO markets cooled, India's IPO market has been on fire, bucking the trend seen in the US, Japan, and even China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-q1fy25-short-of-estimates-key-details-2590913-2024-08-30",
      "headline": "India's Q1 GDP grows at 6.7%, lowest in 5 quartersQ1 GDP growth: While the 6.7% growth is broadly in line with what experts had estimated, it falls short of the Reserve Bank of India's (RBI) projection of 7.2% for the same period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-e-verification-deadline-penalty-august-30-pay-section-234f-2590894-2024-08-30",
      "headline": "ITR e-verification: You will have to pay penalty if...If you miss the 30-day window to e-verify, the date you finally verify your ITR will be considered as the filing date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-issue-failed-to-impress-brokerages-dalal-street-explained-2590882-2024-08-30",
      "headline": "Explained: Why Reliance's bonus issue left brokerages unimpressedIt may be noted that there was no word on the potential listing of RIL's two key businesses—Reliance Jio and Reliance Retail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-over-12-percent-today-what-should-investors-do-2590857-2024-08-30",
      "headline": " Paytm shares rise over 12% today: What should investors do?This rise in shares comes amid important developments within the company, including the recent sale of its entertainment ticketing business to online food aggregator Zomato for Rs 2,048 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/simplified-pension-application-form-launched-for-retiring-government-employees-2590843-2024-08-30",
      "headline": "Simplified pension form launched for retiring government staff. Check detailsThe new form consolidates nine separate forms into a single, unified Form 6A. It also offers the option to download the ePPO, ensuring a seamless transition from employment to retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-investors-q1-gdp-data-rvnl-share-price-2590815-2024-08-30",
      "headline": "Sensex, Nifty end higher as investors await Q1 GDP data; RVNL up 4%The S&P BSE Sensex rose 231.16 points to 82,365.77, while the NSE NIfty50 settled 83.95 higher at 25,235.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q1-gdp-growth-preview-data-what-to-watch-out-for-outlook-expectations-2590803-2024-08-30",
      "headline": "India Q1 GDP growth preview: What to watch out for Analysts predict growth in the range of 6%-7.1% for Q1 FY25, compared with 7.8% in the previous quarter (Q4 FY24). Rating agencies and financial institutions have varying expectations for Q1 GDP growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-shares-surge-5-cross-rs-600-whats-behind-the-rally-2590746-2024-08-30",
      "headline": "RVNL shares cross Rs 600 mark after jumping 5%. What's behind the rally?Shares of this multibagger railway PSU have sharply corrected over the past month but are still up over 230% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bonus-shares-issue-what-is-it-and-how-does-it-benefit-investors-2590685-2024-08-30",
      "headline": "Reliance bonus issue: What is it and how will it benefit shareholders?A bonus issue, also known as a bonus share issue, occurs when a company distributes additional shares to its existing shareholders at no cost to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-global-fintech-fest-jan-dhan-yojana-pivotal-in-boosting-financial-inclusion-women-empowerment-2590680-2024-08-30",
      "headline": "'Jan Dhan Yojana pivotal in boosting financial inclusion': PM ModiSpeaking at the Global Fintech Fest (GFF), he mentioned how the scheme has been a game-changer in ensuring that banking services reach every corner of the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/uk-insurer-aviva-found-guilty-in-ud-26-million-fake-invoice-scandal-in-india-report-2590627-2024-08-30",
      "headline": "UK's Aviva found guilty in $26 million fake invoice scandal in India: ReportBritish insurer Aviva has been accused of violating regulations in India by using fake invoices and secret cash payments to bypass commission limits for sales agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vistara-air-india-merger-check-impact-on-ticket-bookings-flight-operations-and-more-2590615-2024-08-30",
      "headline": "Vistara-Air India merger: Check impact on ticket bookings, flight operations and moreVistara-Air India merger: Travelers can expect expanded services and improved connectivity. Read on to see how this change will impact your bookings, flight operations, and travel experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-vistara-merger-likely-to-be-finalised-on-november-12-2590580-2024-08-30",
      "headline": "No Vistara flight bookings from September 3 ahead of merger with Air IndiaVistara-Air India merger: Starting from September 3, 2024, customers will no longer be able to book Vistara flights for travel on or after November 12, 2024. Bookings for these routes will be redirected to Air India's website."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-ipo-allotment-status-step-by-step-guide-gmp-today-2590555-2024-08-30",
      "headline": "Premier Energies IPO allotment: Step-by-step guide to check status Premier Energies IPO allotment: Investors can check their Premier Energies IPO allotment status online via the BSE website or Kfin Technologies Limited, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-record-high-markets-moody-revises-growth-india-gdp-forecast-2590531-2024-08-30",
      "headline": "Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%Sensex, Nifty rally to new peaks as Moody's revises India's growth forecast to 7.2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-at-record-highs-as-moodys-lifts-indias-gdp-forecast-to-72-percent-2590522-2024-08-30",
      "headline": "Sensex, Nifty open at record highs as Moody's lifts India's GDP forecast to 7.2%The S&P BSE Sensex added 502.42 points to 82,637.03, while the NSE Nifty50 gained 87.45 points to 25,239.40. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/simi-rose-expelled-kerala-congress-exploitation-of-women-in-party-2591909-2024-09-01",
      "headline": "Kerala Congress expels leader who alleged exploitation of women in partyKerala Congress expels leader who alleged exploitation of women in party"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-chhatrapati-shivaji-maharaj-statue-collapse-pm-modi-apology-mumbai-protest-2591795-2024-09-01",
      "headline": "Uddhav Thackeray on PM's Shivaji statue collapse apology: Smacked of arroganceUddhav Thackeray, who led a massive rally in Mumbai in protest over the collapse of Chhatrapati Shivaji Maharaj's statue in Sindhudurg, claimed that the Prime Minister's apology over the incident \"smacked of arrogance\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vice-president-dhankhar-vs-kapil-sibal-over-symptomatic-malaise-row-demonising-thoughts-2591854-2024-09-01",
      "headline": "Kapil Sibal's Kolkata horror remark draws Veep's ire: 'Voices that cause concern'The Vice President expressed his disapproval of the SCBA's characterisation of the horrific crime as a \"symptomatic malaise\" and a \"frequent incident\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/ram-manohar-lohia-national-law-university-student-found-dead-in-hospital-room-in-lucknow-2591834-2024-09-01",
      "headline": "Law student, daughter of NIA official, found dead in hostel room in LucknowAnika was found unconscious in her hostel room late last night. She was immediately rushed to a nearby hospital, but doctors declared her brought dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/did-anubhav-sinhas-ic-814-changed-hijackers-names-to-hindu-heres-the-truth-2591786-2024-09-01",
      "headline": "Row over hijackers' Hindu names in 'IC 814'. Here's the truthAnubhav Sinha's web series 'IC 814' has courted controversy after a section of social media accused the filmmaker of deliberately \"changing\" the names of two of the hijackers to Bhola and Shankar. Here's the truth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-councillor-ram-chander-kidnapping-bjp-manish-sisodia-sanjay-singh-2591837-2024-09-01",
      "headline": "AAP accuses BJP of kidnapping its councillor who switched party 3 days agoSenior AAP leaders, including Manish Sisodia and Sanjay Singh, alleged that the BJP has 'kidnapped' its councillor Ram Chander, a claim categorically rejected by the saffron party. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/president-droupadi-murmu-national-conference-district-judiciary-pendency-rape-cases-courts-2591865-2024-09-01",
      "headline": "President flags pendency of rape cases: People feel judiciary lacks sensitivityPresident Droupadi Murmu said when court decisions in cases like rape come after a generation has passed, the common person feels that the justice process \"lacks sensitivity\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-does-not-know-about-hema-committee-report-2591870-2024-09-01",
      "headline": "Rajinikanth on Hema Committee report: 'Don't know anything, sorry'Superstar Rajinikanth was asked about the Hema Committee report, which highlighted sexual assault cases in the Malayalam film industry. He said that he did not know about the report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/kolkata-trainee-doctor-rape-protest-but-case-videos-google-search-surge-sex-assault-clips-sold-online-telegram-2590981-2024-09-01",
      "headline": "We want justice, but we also want porn: Tragic dichotomy of India's rape-angstWhen a rape case makes headlines, online searches for videos linked to that sex assault surge. This was true even in the Kolkata doctor's rape-murder case, which saw massive protests. Rape videos are being sold for just 12 paise per clip. But how are these videos sold on the online market, and what is feeding this demand?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/howrah-hospital-girl-molested-laboratory-technician-accused-attacked-arrested-2591737-2024-09-01",
      "headline": "Girl, 13, allegedly molested by lab technician at Howrah hospitalA 13-year-old girl was allegedly molested at a Howrah hospital on Saturday night, sparking outrage among locals and leading to the arrest of a contractual laboratory technician."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yorgraj-singh-ms-dhoni-forgive-yuvraj-singh-bharat-ratna-biopic-2591897-2024-09-01",
      "headline": "Yuvraj Singh deserves Bharat Ratna, MS Dhoni 'ruined' his career: YograjFormer India cricketer Yograj Singh said his son Yuvraj should be recognised with the Bharat Ratna for his contribution to Indian cricket. In another attack against MS Dhoni, Yograj said the former captain 'ruined' his son's career by cutting it short by four to five years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympic-games-paris-2024-day-4-live-updates-india-mandeep-kaur-nithya-sre-palak-kohli-2591704-2024-09-01",
      "headline": "Paralympics 2024 Day 4 Live: Rakesh reaches quarters, Nitesh in semi-finalsParalympics 2024 Day 4 Live: The focus is on Indian badminton, where multiple shuttles are participating in their semi-final clashes. Earlier, Rakesh Kumar reached the quarter-final of the men's compound event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jiiva-sexual-harassment-tamil-film-industry-hema-committee-report-2591855-2024-09-01",
      "headline": "Jiiva says sexual harassment doesn't exist in Tamil film industry, loses coolActor Jiiva avoided questions about the Hema Committee report. He also  said sexual harassment doesn't happen in Tamil film industry, prompting singer Chinmayi Sripada to criticise the 'Nanban' actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/jp-nadda-slams-kerala-government-over-hema-panel-report-2591833-2024-09-01",
      "headline": "'CPM leaders involved', JP Nadda slams Kerala government over Hema panel reportThe expansive and explosive Justice Hema Committee report made public on August 19 highlights the power nexus in the Malayalam cinema industry and sexual exploitation faced by women employed in it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-reaction-hema-committee-report-2591744-2024-09-01",
      "headline": "Mammootty on Hema Committee report: There is no powerhouse in cinemaMalayalam superstar Mammootty has expressed his support for the Hema Committee report and emphasised the need for its recommendations to be implemented. He also stated that the court should decide the punishments for those accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhatrapati-shivaji-statue-collapse-in-maharashtra-pm-modi-eknath-shinde-controversy-2591828-2024-09-01",
      "headline": "Shivaji statue collapse: Departments, approvals and a curious case of heightThe collapse of a 35-feet Chhatrapati Shivaji Maharaj statue in Sindhudurg brought to light several critical factors surrounding the statue's construction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/honey-singh-former-wife-shalini-opens-up-about-addiction-2591803-2024-09-01",
      "headline": "Honey Singh denies going to rehab, admits not giving time to ex-wife ShaliniRapper-singer Honey Singh recently opened up about his journey to overcome addiction. In an interview with The Lallantop, he admitted neglecting his ex-wife Shalini Talwar and family during the early stages of his addiction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-sports-politics-419-30-08-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/brezza-ertiga-wagonr-drive-maruti-wholesales-in-august-network-stock-now-at-36-days-2591844-2024-09-01",
      "headline": "Brezza, Ertiga, WagonR drive Maruti wholesales in AugustMaruti sold 41,190 units of SUVs, including the Brezza, Fronx, Jimny and Grand Vitara, in August 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vande-bharat-sleeper-coaches-unveiled-features-amenities-rollout-dates-ashwini-vaishnaw-2591753-2024-09-01",
      "headline": "Vande Bharat sleeper coach debuts, Railway Minister shares rollout timelineRailway Minister Ashwini Vaishnaw said the Vande Bharat sleeper train is expected to be operational for passengers within the next three months. Once production commences, two to three trains will be rolled out every month, he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/drdo-tifr-test-6-qubit-quantum-processor-what-it-means-for-indias-quantum-future-2591688-2024-09-01",
      "headline": "Why India's 6-qubit quantum processor test is a game changerThe demonstration by DRDO and TIFR, conducted before the apex committee overseeing DYSL-QT, showcased the full functionality of the quantum system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-rain-flood-weather-forecast-telangana-odisha-imd-forecast-alert-2591640-2024-09-01",
      "headline": "Rain havoc in Telangana and Andhra; schools shut in Hyderabad, train services hitHeavy rain has caused severe flooding in Andhra Pradesh and Telangana, submerging low-lying areas and disrupting road and train services. The Telugu states are expected to receive heavy rain in the next 2-3 days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-uddhav-thackeray-slaps-slippers-on-banner-featuring-eknath-shinde-2591813-2024-09-01",
      "headline": "Video: Uddhav Thackeray slaps slippers on banner featuring Eknath ShindeUddhav Thackeray and other senior leaders of the opposition alliance Maha Vikas Aghadi (MVA) took out a massive rally in South Mumbai on Sunday over the collapse of Chhatrapati Shivaji Maharaj's statue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-bahraich-wolf-attack-injured-dead-forest-department-patrol-2591730-2024-09-01",
      "headline": "Wolves' terror in UP's Bahraich: 6-year-old girl among two injuredA forest department official said that two wolves have been traced using drones, and they will be caught within one or two days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/guru-randhawa-jonita-join-forces-chainsmokers-for-addicted-2591912-2024-09-01",
      "headline": "Guru Randhawa, Jonita team up with Chainsmokers for 'Addicted'Guru Randhawa and Jonita Gandhi have collaborated with The Chainsmokers on a new single 'Addicted'. The track released on August 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-does-not-know-about-hema-committee-report-2591870-2024-09-01",
      "headline": "Rajinikanth on Hema Committee report: 'Don't know anything, sorry'Superstar Rajinikanth was asked about the Hema Committee report, which highlighted sexual assault cases in the Malayalam film industry. He said that he did not know about the report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jiiva-sexual-harassment-tamil-film-industry-hema-committee-report-2591855-2024-09-01",
      "headline": "Jiiva says sexual harassment doesn't exist in Tamil film industry, loses coolActor Jiiva avoided questions about the Hema Committee report. He also  said sexual harassment doesn't happen in Tamil film industry, prompting singer Chinmayi Sripada to criticise the 'Nanban' actor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-sushant-singh-rajput-death-jail-forgiven-everyone-2591846-2024-09-01",
      "headline": "Rhea Chakraborty: Forced down the path of forgiveness but haven't forgiven everyoneActor Rhea Chakraborty recently opened up about her time in jail. Speaking about the trolling that followed Sushant Singh Rajput's death, the actor also revealed that she chose to forgive for the sake of her own mental health."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/assam-t20-pride-cup-2024-live-streaming-squads-schedule-and-all-you-need-to-know-2591906-2024-09-01",
      "headline": "Assam T20 Pride Cup 2024: Squads, schedule and all you need to knowThe Assam T20 Pride Cup 2024 will be held from September 2 to 18 at the Nehru Stadium in Guwahati. New Star Club are the defending champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-litton-das-hundred-2591905-2024-09-01",
      "headline": "Not my best Test innings: Litton Das on epic rescue act vs PakistanLitton Das refused to term his heroic 138 in Rawalpindi vs Pakistan as his best Test innings. Litton said that he was happy to play his part in Bangladesh getting back into the game after the team was 26/6 in the morning session on Day 3 of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yorgraj-singh-ms-dhoni-forgive-yuvraj-singh-bharat-ratna-biopic-2591897-2024-09-01",
      "headline": "Yuvraj Singh deserves Bharat Ratna, MS Dhoni 'ruined' his career: YograjFormer India cricketer Yograj Singh said his son Yuvraj should be recognised with the Bharat Ratna for his contribution to Indian cricket. In another attack against MS Dhoni, Yograj said the former captain 'ruined' his son's career by cutting it short by four to five years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-vs-east-bengal-derby-lucknow-when-and-where-to-watch-2591896-2024-09-01",
      "headline": "Mohun Bagan vs East Bengal: Why are the teams playing Derby in Lucknow?Mohun Bagan Super Giant are set to take on arch-rivals East Bengal in a Derby game at Lucknow. Here's everything you need to know about the fixture and why the teams are playing a Derby away from home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-khurram-shahzad-credits-jason-gillespie-after-maiden-5-wicket-haul-2591894-2024-09-01",
      "headline": "Khurram Shahzad credits Jason Gillespie after maiden 5-wicket haul PAK vs BAN: Khurram Shahzad thanked Jason Gillespie for helping him out after he picked up his maiden five-wicket haul in Tests against Bangladesh in Rawalpindi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/ravi-rongali-shot-put-paris-paralympics-personal-best-fifth-final-2591881-2024-09-01",
      "headline": "Ravi Rongali sets personal best thrice in shot put final, misses medal Paris Paralympics: 28-year-old Ravi Rongali, who won silver in the Asian Para Games last year, came up with a spirited effort in the F40 shot put final, setting a personal best as many as three times on Sunday, September 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-litton-das-mehidy-hasan-khurram-shahzad-day-2-rawalpindi-report-2591883-2024-09-01",
      "headline": "Litton Das, Mehidy Hasan's rescue act rocks Pakistan in 2nd Test PAK vs BAN: Litton Das and Mehidy Hasan not only helped Bangladesh recover from the early blows, but also put them in a position of command in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/pm-modi-paralympics-rubina-francis-manish-narwal-2591880-2024-09-01",
      "headline": "Paralympics: PM Modi congratulates Indian medals winners over phoneParalympics: Prime Minister Narendra Modi congratulated India's medal winners in Paris Paralympics on Sunday, September 1. PM Modi got on a phone call with Manish Narwal and Rubina Francis and lauded their efforts at the quadrennial event.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/county-championship-ajinkya-rahane-leicesterhisre-hundred-glamorgan-cardiff-2591871-2024-09-01",
      "headline": "County: Ajinkya Rahane hits 40th first-class hundred, first for Leicestershire County Championships 2024: Senior India batter Ajinkya Rahane ended his nearly two-year wait for a first-class hundred on Sunday. The 36-year-old hit 102 in a gritty second-innings knock for Leicestershire against Glamorgan in Cardiff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-2024-24-drafts-haris-rauf-rishad-hossain-melbourne-stars-2591840-2024-09-01",
      "headline": "Haris Rauf unpicked, Bangladesh's Rishad Hossain rewarded in drafts BBL 2024-25: The drafts for the upcoming edition of the T20 league took place on Sunday and the eight teams made their picks. Among the 70 plus Pakistanis who registered for the drafts, only Usama Mir found a team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-litton-das-hundred-mehidy-hasan-2591814-2024-09-01",
      "headline": "Litton Das scores fighting hundred, keeps visitors alive in 2nd TestPAK vs BAN: Bangladesh wicketkeeper-batter Litton Das played a heroic knock on Day 3 of the 2nd Test match vs Pakistan. Litton rescued Bangladesh from a precarious position when they were 26/6 in their first innings outing at Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-litton-das-mehidy-hasan-khurram-shahzad-day-2-rawalpindi-report-2591883-2024-09-01",
      "headline": "Litton Das, Mehidy Hasan's rescue act rocks Pakistan in 2nd Test PAK vs BAN: Litton Das and Mehidy Hasan not only helped Bangladesh recover from the early blows, but also put them in a position of command in the second Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/pm-modi-paralympics-rubina-francis-manish-narwal-2591880-2024-09-01",
      "headline": "Paralympics: PM Modi congratulates Indian medals winners over phoneParalympics: Prime Minister Narendra Modi congratulated India's medal winners in Paris Paralympics on Sunday, September 1. PM Modi got on a phone call with Manish Narwal and Rubina Francis and lauded their efforts at the quadrennial event.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/county-championship-ajinkya-rahane-leicesterhisre-hundred-glamorgan-cardiff-2591871-2024-09-01",
      "headline": "County: Ajinkya Rahane hits 40th first-class hundred, first for Leicestershire County Championships 2024: Senior India batter Ajinkya Rahane ended his nearly two-year wait for a first-class hundred on Sunday. The 36-year-old hit 102 in a gritty second-innings knock for Leicestershire against Glamorgan in Cardiff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bbl-2024-24-drafts-haris-rauf-rishad-hossain-melbourne-stars-2591840-2024-09-01",
      "headline": "Haris Rauf unpicked, Bangladesh's Rishad Hossain rewarded in drafts BBL 2024-25: The drafts for the upcoming edition of the T20 league took place on Sunday and the eight teams made their picks. Among the 70 plus Pakistanis who registered for the drafts, only Usama Mir found a team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-litton-das-hundred-mehidy-hasan-2591814-2024-09-01",
      "headline": "Litton Das scores fighting hundred, keeps visitors alive in 2nd TestPAK vs BAN: Bangladesh wicketkeeper-batter Litton Das played a heroic knock on Day 3 of the 2nd Test match vs Pakistan. Litton rescued Bangladesh from a precarious position when they were 26/6 in their first innings outing at Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-predicts-india-winning-5-match-bgt-test-series-3-1-vs-australia-2591812-2024-09-01",
      "headline": "Sunil Gavaskar predicts India winning 5-match BGT Test series 3-1 vs AustraliaSunil Gavaskar picked India as favourites to win the Border Gavaskar Trophy with a 3-1 triumph over Australia on their soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-2nd-test-eoin-morgan-brendon-mccullum-2591804-2024-09-01",
      "headline": "Eoin Morgan wants Brendon McCullum to coach white-ball teamFormer England captain Eoin Morgan wants Brendon McCullum to take over England's white-ball coaching job. Morgan's comments come after the resignation of Matthew Mott from the position after England failed to defend the ODI and T20 World Cup titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-names-top-contenders-for-us-open-after-shocking-third-round-exit-2591789-2024-09-01",
      "headline": "Novak Djokovic names top contenders for US Open after shocking third-round exitNovak Djokovic has named his top contenders for US Open men's singles titles after his shocking exit from the third round of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-schedule-day-7-schedule-of-play-sabalenka-gauf-and-zverev-in-action-2591776-2024-09-01",
      "headline": "US Open Schedule, Day 7 Schedule of Play: Sabalenka, Gauff and Zverev in actionDay 7 of the US Open 2024 promises to be action packed with star tennis players fighting it out for the quarter-final berth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/6-indians-including-mandhana-jemimah-and-deepti-picked-for-wbbl-draft-2591750-2024-09-01",
      "headline": "6 Indians including Mandhana, Jemimah and Deepti picked for WBBL Draft6 Indians including Smriti Mandhana, Jemimah Rodrigues and Deepti Sharma were picked in the WBBL draft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-pooran-mos-sixes-in-calendar-chris-gayle-record-2591756-2024-09-01",
      "headline": "Pooran shatters Gayle's six hitting record with blizzard CPL knockWest Indies' Nicholas Pooran shattered Chris Gayle's record for hitting the most sixes in a calendar year. Gayle, who had hit 135 sixes in 2015 got overtaken by Pooran during the latter's innings in the CPL 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umpiring-for-hard-hitting-rohit-sharma-is-very-easy-says-anil-chaudhary-2591755-2024-09-01",
      "headline": "Umpiring for 'hard-hitting' Rohit Sharma is very easy, says Anil ChaudharyIndian international umpire Anil Chaudhary said that umpiring for India captain Rohit Sharma is very easy due to his hard-hitting stroke play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-schedule-day-7-schedule-of-play-sabalenka-gauf-and-zverev-in-action-2591776-2024-09-01",
      "headline": "US Open Schedule, Day 7 Schedule of Play: Sabalenka, Gauff and Zverev in actionDay 7 of the US Open 2024 promises to be action packed with star tennis players fighting it out for the quarter-final berth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/6-indians-including-mandhana-jemimah-and-deepti-picked-for-wbbl-draft-2591750-2024-09-01",
      "headline": "6 Indians including Mandhana, Jemimah and Deepti picked for WBBL Draft6 Indians including Smriti Mandhana, Jemimah Rodrigues and Deepti Sharma were picked in the WBBL draft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-pooran-mos-sixes-in-calendar-chris-gayle-record-2591756-2024-09-01",
      "headline": "Pooran shatters Gayle's six hitting record with blizzard CPL knockWest Indies' Nicholas Pooran shattered Chris Gayle's record for hitting the most sixes in a calendar year. Gayle, who had hit 135 sixes in 2015 got overtaken by Pooran during the latter's innings in the CPL 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umpiring-for-hard-hitting-rohit-sharma-is-very-easy-says-anil-chaudhary-2591755-2024-09-01",
      "headline": "Umpiring for 'hard-hitting' Rohit Sharma is very easy, says Anil ChaudharyIndian international umpire Anil Chaudhary said that umpiring for India captain Rohit Sharma is very easy due to his hard-hitting stroke play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jadon-sancho-manchester-united-chelsea-loan-2591743-2024-09-01",
      "headline": "Sancho excited for Chelsea loan spell: My idols were Drogba and LampardManchester United's Jadon Sancho joined Chelsea in yet another loan deal. Sancho said that he was glad to get started in the club of his childhood heroes Frank Lampard and Didier Drogba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-valladolid-raphinha-2591736-2024-09-01",
      "headline": "Barcelona do not need any more signings: Raphinha after 7-0 win vs ValladolidFC Barcelona attacker Raphinha believes that the team does not need any more people to join in the transfer window, with the way they are playing. Raphinha starred in the team's 7-0 hammering of Valladolid on Saturday, August 31.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ban-khurram-shehzad-mir-hamza-rawalpindi-2nd-test-day-3-2591733-2024-09-01",
      "headline": "PAK vs BAN: Khurram Shehzad runs through Bangladesh with fiery spell in 2nd TestPakistan fast bowler Khurram Shahzad ran through Bangladesh batting on Day 3 of the second Test against in Rawalpindi leaving Bangladesh reeling at 26/6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-ms-dhoni-opens-up-about-elder-brotherly-bond-with-virat-kohli-2591728-2024-09-01",
      "headline": "Watch: MS Dhoni opens up about 'elder brotherly' bond with Virat KohliMS Dhoni opened up about his bond with Virat Kohli and hailed him as one of the best batters in world cricket. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}