{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-government-may-revise-circle-rates-public-feedback-invited-2797279-2025-10-03",
      "headline": "Delhi government may revise circle rates, public feedback invitedThe Delhi government is considering a revision of circle rates across the city and has called on the public to share their views before any changes are finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-trap-to-watch-2025-room-rent-caps-deductibles-co-pays-save-money-2797278-2025-10-03",
      "headline": "Health insurance in 2025: Key traps that could drain your pocketClauses such as room rent caps, deductibles, and co-pay options are often buried deep in policy documents but can have a massive influence on the claim process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-higher-metal-stocks-gain-tata-steel-2797261-2025-10-03",
      "headline": "Sensex, Nifty recover losses to end higher fuelled by gains in metal stocksThe S&P BSE Sensex added 223.86 points to close at 81,207.17, while the NSE Nifty50 gained 57.95 points to end at 24,894.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/63-of-households-aware-yet-only-95-invest-in-markets-sebi-survey-shows-2797218-2025-10-03",
      "headline": "63% of households aware, yet only 9.5% invest in markets, Sebi survey showsDespite growing awareness about investing in the markets, the latest Sebi survey shows that only a small fraction of households, i.e., just 9.5%, are actively investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-high-returns-this-small-savings-scheme-beats-ppf-and-nsc-2797178-2025-10-03",
      "headline": "Looking for high returns? This small savings scheme beats PPF and NSCMany investors assume PPF or NSC offer the best returns, but the scheme leads the pack with the highest interest among small savings schemes. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-customs-wintrack-bribe-ask-legal-case-law-help-corruption-business-protection-expert-view-2797188-2025-10-03",
      "headline": "Wintrack vs Chennai Customs: If forced to bribe, can companies fight legally?The Finance Ministry has already ordered an official probe, but the matter has also raised a wider debate: if businesses are forced to pay bribes to get their consignments cleared, do they have the law on their side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-zerodha-end-its-zero-brokerage-model-for-equity-delivery-trades-nithin-kamath-2797133-2025-10-03",
      "headline": "Will Zerodha end its zero-brokerage model for equity delivery trades?Zerodha, long known for offering free equity delivery trades, could soon charge for delivery trades for the first time, signalling a major shift for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wintrack-support-fallout-chennai-customs-bribery-allegations-corruption-claim-users-x-2797039-2025-10-03",
      "headline": "My Customs story floods X after Wintrack's explosive chargeAfter the Finance Ministry confirmed an official probe into Wintrack's charges, importers, customs brokers, and business owners across the country have started sharing their own accounts of harassment, bribery demands. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actors-vijay-deverakonda-and-rashmika-mandanna-get-engaged-wedding-set-for-february-2026-2797479-2025-10-03",
      "headline": "Vijay Deverakonda, Rashmika Mandanna are engaged, wedding in February 2026: Reports Actors Vijay Deverakonda and Rashmika Mandanna got engaged in a private ceremony attended only by family members, according to reports. Their wedding is reportedly set for February 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-gopal-varma-praises-kantara-chapter-1-says-all-filmmakers-should-feel-ashamed-2797432-2025-10-03",
      "headline": "Ram Gopal Varma praises Kantara: Chapter 1, says all filmmakers should feel ashamed Actor-director Rishab Shetty's Kantara Chapter 1, a prequel to the 2022 hit, released in theatres on October 2. Ram Gopal Varma praised the film for its sound design, production quality and \"unimaginable efforts.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-national-award-win-for-jawan-predicted-by-atlee-recalls-sanya-malhotra-2797387-2025-10-03",
      "headline": "SRK's National Award win for Jawan was predicted by Atlee, recalls Sanya Malhotra Actor Sanya Malhotra recently stated that director Atlee predicted Shah Rukh Khan's National Award win during 'Jawan' shoot. The film also featured Deepika Padukone, Nayanthara, Vijay Sethupathi and others in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-hindi-rebel-song-kantara-chapter-1-rishab-shetty-collaboration-2797390-2025-10-03",
      "headline": "Rishab Shetty wanted Diljit Dosanjh for Kantara but hilariously forgot his name Actor-director Rishab Shetty spoke about his experience of working with Diljit Dosanjh. Their collaboration on the 'Rebel' song marks a significant collaboration on 'Kantara Chapter 1'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/what-did-hrithik-roshan-say-about-war-2-shoot-in-his-latest-cryptic-note-2797374-2025-10-03",
      "headline": "What did Hrithik Roshan say about War 2 shoot in his latest cryptic note? Actor Hrithik Roshan opened up for the first time ever since his action-thriller 'War 2' opened to mixed reviews and had a lukewarm box office response. He expressed gratitude to director Ayan Mukerji in his cryptic post, adding that \"every film doesn't have to be a torture\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malvika-raaj-pranav-bagga-announce-daughter-name-mahara-dreamy-photos-2797350-2025-10-03",
      "headline": "Malvika Raaj, Pranav Bagga announce their daughter's name with dreamy photos Actor Malvika Raaj and her husband Pranav Bagga revealed their daughter's name on Friday. The couple shared the news and first photos of their daughter on Instagram a day after Dussehra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-emotional-reaction-getting-passport-back-sushant-singh-rajput-case-2797380-2025-10-03",
      "headline": "Satyameva Jayate: Rhea Chakraborty emotional on getting passport, friends react Actor Rhea Chakraborty wrote an emotional social media post after getting her passport back. Bombay High Court had earlier permitted Chakraborty to retain her passport, easing bail restrictions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-combs-domestic-violence-sentenciong-court-hearing-2797360-2025-10-03",
      "headline": "I lost my way: Rapper Diddy begs for mercy ahead of sentence in sex assault case Rappy Sean Diddy Combs begged for leniency ahead of his sentencing. In his letter, Diddy confessed to losing his way and how he will always carry the burden of domestic violence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/malti-chahar-deepak-chahar-bigg-boss-19-wildcard-entry-2797321-2025-10-03",
      "headline": "Deepak Chahar's sister Malti to join Bigg Boss 19 as wildcard: Reports Actor Malti Chahar is reportedly set to join 'Bigg Boss 19' as a wildcard contestant. She is the sister of cricketer Deepak Chahar. If she joins the Salman Khan-hosted show, she'd become the second wildcard entry of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kajol-hugs-saif-ali-khan-as-he-recounts-stabbing-incident-in-two-much-promo-watch-2797345-2025-10-03",
      "headline": "Kajol hugs Saif Ali Khan as he recounts stabbing incident in Two Much promo. Watch Saif Ali Khan and Akshay Kumar are all set to grace the latest episode of Kajol and Twinkle's chat show 'Two Much'. During the promo, Saif recalled the incident when he was stabbed on the neck. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/was-alia-bhatt-first-offered-sunny-sanskari-director-shashank-khaitan-replies-2797316-2025-10-03",
      "headline": "Was Alia Bhatt first offered Sunny Sanskari? Director Shashank Khaitan replies Director Shashank Khaitan's 'Sunny Sanskari Ki Tulsi Kumari' released on October 1. He firmly denies it was ever part of the 'Dulhania' franchise and clears the air on Alia Bhatt being offered the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-actor-vishal-jethwa-rising-actor-talking-about-2797269-2025-10-03",
      "headline": "Vishal Jethwa of 'Homebound' is the rising actor we should be talking about With his stupendous acting in 'Homebound', Vishal Jethwa is quietly rewriting the rulebook of Bollywood newcomers. Doubt us? Read to find out how. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-ratings-drop-twentieth-star-plus-shows-dominate-2797267-2025-10-03",
      "headline": "Bigg Boss 19 slips to 20th spot 'Bigg Boss 19' has fallen to twentieth position on the TV ratings chart after previously ranking eleventh last week. This shift highlights changing viewer preferences and the sustained dominance of leading Star Plus shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-khushi-kapoor-scholarship-new-york-film-academy-2797255-2025-10-03",
      "headline": "Boney Kapoor says Khushi got 100% scholarship from New York Film Academy Film producer Boney Kapoor recently shared that his actor-daughter Khushi Kapoor secured a 100% scholarship to the New York Film Academy. He said Khushi secured the scholarship based on her audition tape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-ott-reminds-doordarshan-eighties-nineties-good-way-2797211-2025-10-03",
      "headline": "Why OTT reminds of Doordarshan of the eighties and nineties (and in a good way) In recent years, streaming platforms have emerged as launchpads for actors young and old who were struggling for a break in films, much like Doordarshan in the eighties and nineties. IndiaToday.in analyses the parallels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-upendra-praise-rishab-shetty-kantara-chapter-1-for-raising-the-bar-2797242-2025-10-03",
      "headline": "Yash, Upendra praise Rishab Shetty's Kantara: Chapter 1 for raising the bar Rishab Shetty's Kantara Chapter 1 was released on October 3, 2025. Actor Yash praised the film in his X review called it a \"truly immersive experience on screen.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hometown-cha-cha-cha-is-the-cosy-k-drama-you-will-never-get-over-2796316-2025-10-03",
      "headline": "Hometown Cha-Cha-Cha is the cosy K-drama you will never get over In this week's K-fix we discover why 'Hometown Cha-Cha-Cha' is the ultimate feel-good K-drama, from its seaside charm to heartwarming characters and cosy, healing storytelling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-says-his-daughter-was-asked-for-nude-photos-during-video-game-2797227-2025-10-03",
      "headline": "Daughter was asked for nudes during video game: Akshay Kumar recalls cyber horror Akshay Kumar has recalled an incident when his daughter was asked to send nude photos while playing video game a few months back. He urged mandatory cyber period in schools at a recent event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bhagwat-chapter-one-raakshas-trailer-jitendra-kumar-new-role-crime-thriller-zee5-2797194-2025-10-03",
      "headline": "Bhagwat Chapter One trailer: Jitendra Kumar sheds good guy image in crime thriller The trailer of Bhagwat Chapter One Raakshas starring Arshad Warsi and Jitendra Kumar is released ahead of its Zee5 premiere on October 17. The film delves into crime and psychological drama set in Uttar Pradesh, promising a gripping narrative."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-says-it-will-release-all-israeli-hostages-alive-or-dead-under-trumps-gaza-proposal-glbs-2797513-2025-10-04",
      "headline": "Hamas agrees to free Israeli hostages after Trump's ultimatum on Gaza peace planHamas expressed readiness for mediated talks on Trump's Gaza plan, proposed transferring Gaza's administration to an independent technocrat body, and praised Arab, Islamic, international, and US efforts supporting a political solution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actors-vijay-deverakonda-and-rashmika-mandanna-get-engaged-wedding-set-for-february-2026-2797479-2025-10-03",
      "headline": "Vijay Deverakonda, Rashmika Mandanna are engaged, wedding in February 2026: ReportsActors Vijay Deverakonda and Rashmika Mandanna got engaged in a private ceremony attended only by family members, according to reports. Their wedding is reportedly set for February 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/judge-sentences-sean-diddy-combs-to-4-years-and-2-months-in-prison-citing-history-of-abusing-women-glbs-2797516-2025-10-04",
      "headline": "Sean 'Diddy' Combs gets 4 years and 2 months in prison as judge cites abuse of womenSean 'Diddy' Combs was sentenced to 4 years and 2 months for arranging drug-fueled sexual encounters. He also expressed remorse, apologised for his actions, and acknowledged the harm caused to his victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-day-2-score-dhruv-jurel-kl-rahul-ravindra-jadeja-2797307-2025-10-03",
      "headline": "1st Test: Rahul, Jurel and Jadeja centuries bury toothless West IndiesIndia vs West Indies, 1st Test: KL Rahul, Dhruv Jurel and Ravindra Jadeja hit hundreds as West Indies paid the price for not being proactive on the field. India reached Stumps on Friday at 448 for 5, leading the visitors by 286 runs in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-asks-israel-to-stop-bombing-gaza-as-hamas-signals-readiness-for-peace-glbs-2797518-2025-10-04",
      "headline": "Stop bombing Gaza, Trump tells Israel as Hamas signals readiness for peaceTrump urged Israel to halt Gaza bombings after Hamas signaled readiness for peace, partially accepting his plan and offering to release hostages while ceding governance to technocrats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-reacts-to-hamas-statement-on-trump-gaza-plan-and-hostage-release-glbs-2797520-2025-10-04",
      "headline": "World reacts to Hamas statement on Trump Gaza plan and hostage releaseThe world offered cautious responses on Friday after Hamas declared it was ready to release hostages and accept parts of President Donald Trump's Gaza peace plan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/children-under-2-years-should-not-be-given-cough-syrup-centres-reminder-amid-deaths-in-2-states-2797339-2025-10-03",
      "headline": "No cough syrup for children under 2, Centre warns after deaths in 2 statesAt least 11 children have died in Madhya Pradesh and Maharashtra amid fears of contaminated cough syrups, but Union Health Ministry testing found no toxic chemicals in the samples. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-sells-its-soul-as-trump-grabs-the-land-2797467-2025-10-03",
      "headline": "Pakistan sells its soul as Trump grabs the landAs multinationals stampede for the exits, Pakistan has discovered it can't sell itself as a market anymore. Only its soil is worth buying, and Trump just became the biggest landlord of all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bal-thackeray-will-row-reignites-after-shinde-sena-leader-ramdas-kadam-big-claims-on-fingerprints-2797433-2025-10-03",
      "headline": "Row over Balasaheb's will reignites after Shinde Sena leader's fingerprints claimRamdas Kadam, who belongs to Eknath Shinde's MLA, alleged posthumous use of Bal Thackeray's fingerprints on his will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/pakistan-army-mercenary-saudi-arabia-defence-pact-hire-zia-ul-haq-black-september-palestinians-killed-jordan-grand-mosque-zimbabwe-2797005-2025-10-03",
      "headline": "Pakistan Army is a mercenary force, once butchered 25,000 PalestiniansFrom the 1970 Black September in Jordan when Pakistani troops under Zia-Ul-Haq's command butchered 25,000 Palestinians, to the brand-new defence pact with Riyadh, Pakistan's generals have long fought for whoever signs the biggest cheques. The latest deal with Saudi Arabia, with a promise of a nuclear shield, is the latest chapter in Rawalpindi's long mercenary ledger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usain-bolt-virat-kohli-relay-team-cricket-exclusive-2797488-2025-10-03",
      "headline": "Virat Kohli and Usain Bolt in relay? Olympic legend reveals his dream teamUsain Bolt said that Virat Kohli would be part of his dream relay team of cricketers. The sprinting legend said that he would have been a cricketer if he wasn't a track and field athlete. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/russian-woman-in-bengaluru-lists-10-indian-office-habits-considered-unusual-abroad-2797136-2025-10-03",
      "headline": "Russian woman in Bengaluru lists 10 Indian office habits considered unusual abroadA Russian woman working in Bengaluru for 12 years shares her observations on Indian office culture, and how it differs from abroad. In her post, she talks about unique workplace customs and the strong bonds formed over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wintrack-support-fallout-chennai-customs-bribery-allegations-corruption-claim-users-x-2797039-2025-10-03",
      "headline": "My Customs story floods X after Wintrack's explosive chargeAfter the Finance Ministry confirmed an official probe into Wintrack's charges, importers, customs brokers, and business owners across the country have started sharing their own accounts of harassment, bribery demands. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/singrauli-boy-calls-police-after-denied-rs-20-kurkure-video-goes-viral-madhya-pradesh-2797421-2025-10-03",
      "headline": "Mother denies Kurkure, 8-year-old boy calls cops in Madhya Pradesh, video goes viralA boy from Singrauli, Madhya Pradesh, dialed 112 after his mother denied him Rs 20 for Kurkure and beat him. The viral video shows police consoling the child and later buying him Kurkure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/grammy-winner-tyla-to-make-her-india-debut-in-mumbai-in-december-2797475-2025-10-03",
      "headline": "Grammy winner Tyla to make her India debut in MumbaiKnown for her hit single Water and energetic performances, Tyla will headline the festival, which also features Lil Yachty, Charlotte de Witte, and Alok. The Mumbai edition is expected to draw over 60,000 attendees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-530-03-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-treasury-considers-1-coin-featuring-trump-for-americas-250th-anniversary-glbs-2797522-2025-10-04",
      "headline": "US treasury considers $1 coin featuring Trump for America's 250th anniversaryThe US Treasury is considering making a $1 coin featuring President Donald Trump to commemorate 250 years since the declaration of American independence in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/meet-judge-arun-subramanian-who-sentenced-sean-diddy-combs-to-50-months-in-jail-glbs-2797521-2025-10-04",
      "headline": "Meet Judge Arun Subramanian, who sentenced Sean 'Diddy' Combs to 50 months in jailJudge Arun Subramanian, the first South Asian on Manhattan's federal bench, sentenced Sean \"Diddy\" Combs, earning recognition for his calm authority, immigrant-rooted journey, and balanced, reform-minded approach to justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/in-balochistan-where-dussehra-was-once-home-2796789-2025-10-02",
      "headline": "In Balochistan, where Dussehra was once homeDussehra in Balochistan (A province in Pakistan) – this may seem unreal now, but in the 1920s, during colonial rule, the region witnessed the burning of Ravana's effigies year after year. The popular festival brought the Hindu community together in a spirit of cohesiveness. It wasn't just Balochistan. Records show that Dussehra was celebrated widely in other parts of present-day Pakistan too. From Lahore to Sindh, the festival was popular and vibrant. Let's take a dive into this once-popular tradition in the history of Balochistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gauhati-high-court-judge-justice-soumitra-saikia-head-judicial-panel-probe-zubeen-gargs-death-2797504-2025-10-03",
      "headline": "Assam Chief Minister announces Judicial Commission to probe Zubeen Garg's deathZubeen, 52, was in Singapore to attend a cultural festival when he drowned after reportedly swimming during a yacht party on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/prince-william-prince-of-wales-plan-says-change-is-on-his-mind-when-he-becomes-king-2797464-2025-10-03",
      "headline": "Change on my agenda: UK's Prince William reveals his plan when he becomes KingThe 43-year-old Prince of Wales and heir to the British throne told Canadian actor Eugene Levy during filming at Windsor Castle for 'The Reluctant Traveller' that change was on his agenda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/pm-modi-unveils-pm-setu-skill-labs-student-schemes-education-reforms-worth-rs-62000-crore-2797453-2025-10-03",
      "headline": "PM Modi to launch Rs 62,000 crore youth-focused projects in BiharPrime Minister Narendra Modi has unveiled youth-focused initiatives worth more than Rs 62,000 crore. The programmes include skilling, education loans, innovation hubs and scholarships, with Bihar at the centre of these efforts."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sri-lanka-mistakes-india-clash-australia-chamari-athapaththu-press-conference-2797510-2025-10-04",
      "headline": "Sri Lanka sorted out mistakes of India clash, ready to face Australia: Chamari Athapaththu Women's World Cup, SLW vs AUSW: Sri Lankan skipper Chamari Athapaththu said that her team has learned from the mistakes in the Indian game and is ready to face Australia in Colombo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-94-india-a-vs-australia-a-2nd-odi-2797506-2025-10-03",
      "headline": "IND-A vs AUS-A: Tilak Varma's gritty 94 in vain as Australia level series Tilak Varma's gritty knock went in vain as Australia-A levelled the series with a thumping 9-wicket win over India-A on Friday, October 3. Tilak scored 94 runs as the Aussies won the rain-affected game with ease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shashank-singh-punjab-kings-ipl-power-hitting-match-winner-exclusive-2797493-2025-10-03",
      "headline": "Shashank Singh dreams of India cap after IPL rise: I am close, knocking on the door In an exclusive interview with Sports Today, Shashank Singh said he remains focused on achieving his dream of playing for India and reflected on how the IPL has shaped his career, sharing insights into his journey with Punjab Kings and the lessons he's learned along the way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/usain-bolt-india-visit-cricket-connection-virat-kohli-2797491-2025-10-03",
      "headline": "Usain Bolt's cricket connection: Would have been a cricketer if not for sprinting Usain Bolt said, in an exclusive interaction with India Today, that he would have been a cricketer if he hadn't taken up sprinting. Bolt spoke about his experience being in India and much more during the interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usain-bolt-virat-kohli-relay-team-cricket-exclusive-2797488-2025-10-03",
      "headline": "Virat Kohli and Usain Bolt in relay? Olympic legend reveals his dream team Usain Bolt said that Virat Kohli would be part of his dream relay team of cricketers. The sprinting legend said that he would have been a cricketer if he wasn't a track and field athlete. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-laura-wolvaardt-press-conference-69-south-africa-vs-england-2797485-2025-10-03",
      "headline": "Laura Wolvaardt vows to bounce back after nightmare 69 vs England Women's World Cup: South Africa captain Laura Wolvaardt said that the Proteas will look to bounce back after their 10-wicket defeat to England in Guwahati on October 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-linsey-smith-press-conference-england-vs-south-africa-2797476-2025-10-03",
      "headline": "I was under pressure after India series, admits Linsey Smith Women's World Cup: Linsey Smith admitted that she was under pressure after she took only one wicket from three wickets. On Friday, Smith won the Player of the Match award in England's 10-wicket win over South Africa in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sl-phoebe-litchfield-australia-sri-lanka-spin-world-cup-2025-2797470-2025-10-03",
      "headline": "Women's World Cup: Australia wary of Sri Lanka's spin threat, says Litchfield Australia batter Phoebe Litchfield has said that they're wary of Sri Lanka's spin threat ahead of their clash in the Women's World Cup 2025 on Saturday, October 4. Sri Lankan spinners troubled India during the opening match of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-spinner-linsey-smith-three-wickets-womens-world-cup-win-south-africa-2797460-2025-10-03",
      "headline": "Linsey Smith after wrecking South Africa in Guwahati: Opening the bowling suits me Women's World Cup 2025: England spinner Linsey Smith took 3 wickets for 7 runs to help bowl out South Africa for 69 and guide England to a 10-wicket win in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-cricket-team-snake-sighting-world-cup-training-colombo-2797437-2025-10-03",
      "headline": "Snake grabs spotlight at India women's training before Pakistan game India's training ahead of their Women's World Cup clash against Pakistan saw an unusual interruption when a harmless rat snake appeared at the R Premadasa Stadium, briefly sparking amusement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-dhruv-jurel-india-good-soldier-test-batter-ahmedabad-2797439-2025-10-03",
      "headline": "Ready for battle: Good soldier Dhruv Jurel shows why he deserves India Test spot Being a good soldier for his side, Dhruv Jurel has made sure he is always battle ready for his team when the opportunity is presented to him. Now, with his hundred in Ahmedabad, Jurel has staked his claim to be in the Indian team as a pure batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-linsey-smith-press-conference-england-vs-south-africa-2797476-2025-10-03",
      "headline": "I was under pressure after India series, admits Linsey Smith Women's World Cup: Linsey Smith admitted that she was under pressure after she took only one wicket from three wickets. On Friday, Smith won the Player of the Match award in England's 10-wicket win over South Africa in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-sl-phoebe-litchfield-australia-sri-lanka-spin-world-cup-2025-2797470-2025-10-03",
      "headline": "Women's World Cup: Australia wary of Sri Lanka's spin threat, says Litchfield Australia batter Phoebe Litchfield has said that they're wary of Sri Lanka's spin threat ahead of their clash in the Women's World Cup 2025 on Saturday, October 4. Sri Lankan spinners troubled India during the opening match of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-spinner-linsey-smith-three-wickets-womens-world-cup-win-south-africa-2797460-2025-10-03",
      "headline": "Linsey Smith after wrecking South Africa in Guwahati: Opening the bowling suits me Women's World Cup 2025: England spinner Linsey Smith took 3 wickets for 7 runs to help bowl out South Africa for 69 and guide England to a 10-wicket win in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-cricket-team-snake-sighting-world-cup-training-colombo-2797437-2025-10-03",
      "headline": "Snake grabs spotlight at India women's training before Pakistan game India's training ahead of their Women's World Cup clash against Pakistan saw an unusual interruption when a harmless rat snake appeared at the R Premadasa Stadium, briefly sparking amusement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-dhruv-jurel-india-good-soldier-test-batter-ahmedabad-2797439-2025-10-03",
      "headline": "Ready for battle: Good soldier Dhruv Jurel shows why he deserves India Test spot Being a good soldier for his side, Dhruv Jurel has made sure he is always battle ready for his team when the opportunity is presented to him. Now, with his hundred in Ahmedabad, Jurel has staked his claim to be in the Indian team as a pure batter. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}