{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-stock-market-today-sensex-nifty-surge-as-donald-trump-win-fuels-dalal-street-rally-2629098-2024-11-06",
      "headline": "US elections: Sensex, Nifty surge after Donald Trump claims victoryThe S&P BSE Sensex gained 900.50 points to settle at 80,378.13, while the Nifty50 surged 270.75 points to 24,484.05. Earlier in the session, the Sensex had surged over 1,000 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-jumps-900-points-us-elections-donald-trump-win-dalal-street-euphoria-it-stocks-2629049-2024-11-06",
      "headline": "Sensex surges over 1,000 points as Donald Trump claims victory in US electionsUS elections: Donald Trump has already declared victory, and his win appears to have fuelled optimism on Dalal Street as Sensex has surged over 1,000 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-day-1-check-latest-subscription-details-gmp-and-should-you-subscribe-2628996-2024-11-06",
      "headline": "Swiggy IPO Day 1: Check subscription details, GMP, and should you subscribe?Swiggy IPO: Bengaluru-based Swiggy opened for public subscription within a price band of Rs 371 to Rs 390 and people will be able to place their bids till November 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-record-high-today-us-elections-donald-trump-will-rally-continue-2628956-2024-11-06",
      "headline": "Bitcoin price hits record high as US elections drive gains. What's next?Bitcoin's surge to $75,000 is driven by institutional interest and political uncertainty. Experts see strong long-term potential, though caution is advised with election-related volatility."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/titan-share-price-down-3-percent-q2fy25-net-profit-falls-buy-or-sell-stock-analyst-views-2628906-2024-11-06",
      "headline": "Titan share price falls 3% after disappointing Q2 results. Buy or sell?At 11:15 am, shares of Titan were down 2.80% at Rs 3,142.50 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gail-share-price-surges-6-percent-strong-q2-results-bullish-brokerage-views-target-price-2628894-2024-11-06",
      "headline": "GAIL share price surges 6% after Q2 results. Will stock climb further?At 11 am, GAIL's share price was up 6.24% at Rs 208.65 on the Bombay Stock Exchange (BSE). This is a positive sign for the stock after it declined significantly over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindustan-zinc-share-price-today-dips-8-percent-government-stake-sale-ofs-2628880-2024-11-06",
      "headline": "Explained: Why Hindustan Zinc share price plunged 8% todayAt 10:45 am, Hindustan Zinc shares were down 7.71% to Rs 516.30 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-it-stocks-us-elections-titan-stock-price-tumbles-2628868-2024-11-06",
      "headline": "Sensex, Nifty gain as IT stocks gain amid US elections; Titan tumbles 3%The BSE Sensex was up 251.87 points to 79,728.50 points at 10:31 am, while the NSE Nifty rose 74,20 points to trade at 24,287.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-record-high-75000-dollars-for-first-time-us-elections-donald-trump-win-2628860-2024-11-06",
      "headline": "Bitcoin price hits record $75,000 for the first time. Here's whyFor much of the year, Bitcoin had been trading within a narrowband below $70,000, but election-day developments have driven fresh interest in the asset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-opens-subscription-day-1-subscribe-latest-gmp-zomato-comparison-brokerage-view-2628708-2024-11-06",
      "headline": "Swiggy IPO opens today: Is it worth subscribing? All you need to knowAs Swiggy's IPO opens for subscription, investors must decide: will this food delivery giant serve up solid returns or leave them disappointed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/onion-prices-to-drop-in-3-to-4-days-boost-pulse-production-government-intervention-2628499-2024-11-05",
      "headline": "Onion prices to drop in 3-4 days; steps taken to boost pulse productionThe red onion crop is already reaching Nashik mandi and onions from Alwar are set to arrive in Delhi and other northern markets by Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-financial-stocks-gain-volatility-2628462-2024-11-05",
      "headline": "Sensex, Nifty rebound sharply as financial stocks gain amid volatilityThe NSE Nifty 50 rose 217.95 to end at 24,213.3, while the BSE Sensex gained 694.39 points, closing at 79,476.63. Both benchmarks had fallen by about 0.6% during the session before a strong rally in the final hours of trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-below-ipo-price-rs-76-after-8-percent-drop-lock-in-period-expiry-2628445-2024-11-05",
      "headline": "Ola Electric shares tumble 8% to fall below IPO price. Buy, sell or hold?Ola Electric Mobility's share price dropped 8% in today's session, falling below its IPO price as the three-month lock-in period expired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-vs-zomato-stock-expert-insights-valuation-comparison-and-more-2628430-2024-11-05",
      "headline": "Swiggy IPO: Should you subscribe or buy Zomato stock?Swiggy's IPO opens tomorrow: Should you subscribe or invest in Zomato's stock? Here's what experts have to say. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-opening-latest-gmp-subscribe-or-not-brokerage-views-key-details-2628349-2024-11-05",
      "headline": "Swiggy IPO: Should you subscribe as GMP declines ahead of opening? Swiggy IPO: Some brokerages recommend subscription, arguing that the pricing appears fair in comparison to competitors, while others caution against investing due to the company's reported negative cash flows and ongoing losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tilaknagar-industries-share-price-20-percent-increase-all-time-high-q2-results-2628325-2024-11-05",
      "headline": "Why Tilaknagar Industries share price gained 20% to hit all-time high todayTilaknagar Industries share price: The company's stock price surged during today's trading session after it reported strong Q2FY25 results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-share-price-jumps-7-percent-order-wins-key-factors-2628319-2024-11-05",
      "headline": "Premier Energies share price jumps nearly 7% today. Know whyPremier Energies share price has risen 37% since getting listed on the stock market in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/orient-technologies-share-price-jumps-16-percent-interim-dividend-board-meeting-key-details-2628310-2024-11-05",
      "headline": "Explained: Why Orient Technologies share price jumped 16% today The jump in share price follows the company's announcement of a board meeting scheduled for November 11, 2024, where directors will review the unaudited financial results for the quarter and half-year ended September 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-donald-trump-victory-impact-dalal-street-stock-market-sensex-nifty-explained-2628286-2024-11-05",
      "headline": "US elections: What a Donald Trump victory could mean for Dalal StreetWith the stage set for the US elections, could a Donald Trump win spark a bullish turn for the Indian stock market, or will uncertainty keep investors on edge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-retail-sales-november-wedding-season-inventory-2628278-2024-11-05",
      "headline": "Why Maruti Suzuki is counting on lakhs of weddings in NovemberWith impressive sales figures from October, Maruti Suzuki is optimistic that the upcoming wedding season will sustain its sales momentum in November."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-results-2024-donald-trump-president-historic-firsts-2628991-2024-11-06",
      "headline": "The historic firsts of a Donald Trump win, including a 132-year-old recordUS election results 2024: A Donald Trump win will see the Republican candidate achieve several historical firsts, making him the second president to serve non-consecutive terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-2024-california-democratic-party-kamala-harris-uttar-pradesh-up-dominance-national-politics-difference-2628972-2024-11-06",
      "headline": "Unlike Uttar Pradesh, California, America's UP, doesn't call the shotsSeparated by some 12,000 kilometres, Uttar Pradesh and California have a lot in common. But there's one area where the parallels might not be valid. Unlike UP, with 80 Lok Sabha seats, which is a decider of which party rules India, California's consistent Democratic support makes it a predictable player in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-jumps-900-points-us-elections-donald-trump-win-dalal-street-euphoria-it-stocks-2629049-2024-11-06",
      "headline": "Sensex surges over 1,000 points as Donald Trump claims victory in US electionsUS elections: Donald Trump has already declared victory, and his win appears to have fuelled optimism on Dalal Street as Sensex has surged over 1,000 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-republicans-flip-one-senate-seat-deadlock-chamber-voting-ends-polls-2628820-2024-11-06",
      "headline": "Republicans seize control of US Senate for first time in four yearsThe unexpected battleground of Nebraska pushed Republicans over the top. Incumbent Republican Senator Deb Fischer brushed back a surprisingly strong challenge from independent newcomer Dan Osborn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/musk-raj-donald-trump-win-gives-elon-musk-a-free-run-for-planet-conquering-plans-2629078-2024-11-06",
      "headline": "Musk Raj: Donald Trump win gives Elon Musk a free run for planet conquering plansElon Musk bet everything and farm on Donald Trump winning the US elections. Now Trump is going to be the next US President, and as someone who played a key role in his win, Elon Musk is going to benefit big time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-and-who-else-will-be-the-happiest-with-a-donald-trump-white-house-opinion-2629013-2024-11-06",
      "headline": "Modi and who else will be the happiest with a Trump White House?As Donald Trump returns to office, a few major global players will be celebrating. From Narendra Modi's strategic gains to Vladimir Putin's geopolitical freedom, this story dives into who stands to benefit most from a Trump comeback. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-polls-six-indian-americans-win-elections-of-us-house-of-representatives-suhas-subramanyam-2628981-2024-11-06",
      "headline": "Indian Americans script history, win 6 seats in US House of RepresentativesThe tally of Indian Americans in the House of Representatives has increased from five to six, with lawyer Suhas Subramanyam scripting history by becoming the first person from the community to be elected from Virginia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-boss-dana-white-hails-president-donald-trump-us-elections-2629035-2024-11-06",
      "headline": "Trump doesn't quit, says Dana White. Meet the UFC boss and key allyUFC president Danan White hailed Donald Trump during his victory speech in Florida on Wednesday, November 6. Trump, who is set to join the office for the second time has won the American elections by a big margin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/say-no-to-candy-for-your-kid-save-them-from-diabetes-as-adults-2628294-2024-11-06",
      "headline": "Say no to candy for your kid, save them from diabetes as adultsDo you think giving sugary treats to your little ones makes them feel special? While it may bring joy at the moment, it could increase their risk of developing diabetes as they grow older."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-virat-kohli-drops-8-places-new-zealand-series-2629060-2024-11-06",
      "headline": "Virat Kohli takes massive hit in ICC rankings after terrible series vs NZSenior India batter Virat Kohli took a massive hit in ICC batters' rankings after a terrible Test series agianst New Zealand. Kohli scored just 93 runs from 3 Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/ballot-curing-in-us-presidential-elections-2024-2629023-2024-11-06",
      "headline": "What is ballot curing in US presidential elections 2024? As the 2024 US Presidential election is underway, election procedures are taking centre stage. One crucial process gaining attention is 'ballot curing', a mechanism that allows voters to address and correct errors with their mail-in or absentee ballots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/us-presidential-polls-five-things-donald-trump-did-different-kamala-harris-race-to-white-house-2628989-2024-11-06",
      "headline": "5 things Trump did differently in the 2024 electionIn the 2024 race, Donald Trump adopted some bold new strategies that set him apart from his opponent, Vice President Kamala Harris. From targeting young male voters and making inroads with minority communities to leveraging Elon Musk-backed support and embracing unconventional media tactics, Trump redefined his campaign playbook. Join Manish Adhikary on First Things Fast as he breaks down the top five things Trump did right to try and stay ahead in this election season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/elon-musk-sink-white-house-donald-trump-us-president-election-2628918-2024-11-06",
      "headline": "Let that sink in: Musk recalls Twitter takeover moment with White House twistUS election results: The image posted by Elon Musk was a throwback of him strolling into Twitter headquarters with a sink after he acquired the social media platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-thanks-wife-melania-with-a-hug-and-kiss-at-florida-victory-rally-2628987-2024-11-06",
      "headline": "Donald Trump thanks wife Melania with a hug and kiss at Florida victory rallyDelivering his 'victory speech' at the Florida Convention Centre, Donald Trump thanked his wife Melania, saying she \"has done a great job\" and \"works very hard\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-results-donald-trump-kamala-harris-polling-counting-votes-republican-democrat-swing-states-2628784-2024-11-06",
      "headline": "Donald Trump closes in on historic win, set to sweep swing statesUS Election Result 2024: Donald Trump is now on the edge of winning back the White House. The Republican has taken a strong lead with 267 electoral college votes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/us-elections-2024-cursive-writing-ends-genz-signature-problem-mail-in-ballots-voting-curing-2628988-2024-11-06",
      "headline": "US schools aren't teaching cursive. Now GenZ voters struggle to cast ballotsThe decline of cursive education has left many Gen Z voters without a unique signature, creating ballot verification issues in states with mail-in voting in the ongoing US presidential elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-results-trump-address-supporters-kamala-harris-howard-university-2628903-2024-11-06",
      "headline": "'You won't hear from Vice President tonight': Harris skips speech as hopes dimUS election results 2024: With projections showing Kamala Harris trailing, the mood among students, faculty and alumni at Howard University became sombre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/court-refuses-to-lift-ban-on-chhath-puja-celebrations-on-yamuna-river-2628965-2024-11-06",
      "headline": "Court refuses to lift ban on Chhath Puja celebrations on Yamuna riverCourt refuses to lift ban on Chhath Puja celebrations on Yamuna river"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-new-age-digital-brands-are-riding-the-quick-commerce-boom-2628474-2024-11-05",
      "headline": "How new-age digital brands are riding the quick commerce boomDirect-to-consumer companies share their success stories on Q-comm, a rapidly growing sector projected to attain a market size of $5.5 billion in India by 2025"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-student-says-she-will-work-for-free-to-stay-in-uk-viral-post-triggers-debate-2628964-2024-11-06",
      "headline": "Indian student says she'll work for free to stay in UK. Viral post triggers debateIn a LinkedIn post that went viral, Swetha Kothandan wrote about her struggle to find a \"visa-sponsored UK job\" since graduating in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-result-2024-donald-trump-vs-kamala-harris-who-has-won-which-state-2628869-2024-11-06",
      "headline": "Donald Trump vs Kamala Harris: Who has won which state? Republican Donald Trump is looking to become only the second President to win a non-consecutive term in the Oval Office, Harris is eyeing history by becoming the first woman President of the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-rise-of-monopoly-groups-decimating-india-businesses-2628835-2024-11-06",
      "headline": "New breed of monopolists deciding what you read, watch: Rahul GandhiRahul Gandhi said the rise of a new breed of monopolists has led to the decimation of lakhs of businesses, making it difficult to generate jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/rupali-ganguly-stepdaughter-esha-verma-claims-physically-mentally-abused-mother-ashwin-k-verma-2628984-2024-11-06",
      "headline": "Rupali Ganguly's stepdaughter claims actor 'physically, mentally abused' her motherEsha Verma, Rupali Ganguly's stepdaughter, has made new claims against the Anupamaa actor.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-sara-arfeen-khan-expelled-physically-hurting-avinash-mishra-salman-khan-2629126-2024-11-06",
      "headline": "BB 18: Sara Arfeen Khan to be expelled for physically hurting Avinash Mishra?Tensions escalate in the Bigg Boss 18 house after Sara Arfeen Khan reaches breaking point and kicks the house property in frustration. In her frustration, the actor ended up physically hurting Avinash Mishra. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-excited-to-see-herself-on-phuljhadi-packet-thats-my-dream-2629123-2024-11-06",
      "headline": "Ananya Panday excited to see herself on 'phuljhadi' packet: That's my dreamAnanya Panday was thrilled to see her photo on a firecracker packet during Diwali celebrations. She called it her \"dream\" moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/archies-actor-singer-dot-forbes-30-under-30-creative-block-2629032-2024-11-06",
      "headline": "Archies' Dot says acting helped her work better with other musiciansSinger Dot aka Aditi Saigal spoke to India Today Digital ahead of her performance at Bandland. She discussed the challenges of establishing herself in the music industry, dealing with creative blocks and also shared how her acting stint in Archies has helped her better her music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-vicky-kaushal-viral-photo-love-and-war-prep-rajasthan-alia-bhatt-sanjay-leela-bhansali-2629092-2024-11-06",
      "headline": "Viral: Ranbir Kapoor, Vicky Kaushal's pic from Love and War prep in RajasthanActor Ranbir Kapoor and Vicky Kaushal's recent picture together from their Rajasthan trip for Love and War has gone viral. The movie, directed by Sanjay Leela Bhansali, also stars Alia Bhatt in a key role. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-scores-back-to-back-hundreds-for-mumbai-in-ranji-trophy-2024-2629127-2024-11-06",
      "headline": "Shreyas Iyer scores back-to-back hundreds for Mumbai in Ranji Trophy 2024Shreyas Iyer scored back-to-back hundreds for Mumbai in Ranji Trophy 2024. He notched up his 2nd straight hundred in the ongoing tournament during Mumbai's match against Odisha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-viktor-guekeres-sporting-cp-player-manchester-united-transfer-premier-league-2629121-2024-11-06",
      "headline": "Gyokeres is a Sporting CP player: Amorim on Manchester United interestNew Manchester United boss Ruben Amorim has dismissed transfer speculation surrounding Sporting CP's star striker Viktor Gyökeres, focusing instead on his current squad despite Gyökeres' impressive recent form, including a hat-trick against Manchester City."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-aus-vs-ind-ricky-ponting-rishabh-pant-steve-smith-2629099-2024-11-06",
      "headline": "Ricky Ponting backs Pant and Smith to be top scorers in Australia vs India TestsLegendary Australia captain Ricky Ponting has backed Rishabh Pant and Steve Smith to be the top run scorers of the Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahals-return-to-mumbai-indians-in-ipl-2025-aakash-chopra-predicts-2629091-2024-11-06",
      "headline": "Yuzvendra Chahal's return to Mumbai Indians in IPL 2025? Aakash Chopra predictsAakash Chopra predicted that Mumbai Indians might bid for Yuzvendra Chahal and Washington Sundar to bolster their spin bowling attack in the upcoming IPL 2025 mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-steve-smith-form-india-vs-australia-test-series-2629086-2024-11-06",
      "headline": "Maxwell backs Smith to do well vs India: Building up to be a scary propositionAustralia all-rounder Glenn Maxwell has backed Steve Smith to have a terrific summer against India. Smith, who played a solid knock of 44 vs Pakistam has said that he is in good touch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-sporting-cp-vs-manchester-city-pep-guardiola-reaction-2629082-2024-11-06",
      "headline": "Manchester City boss Pep Guardiola ready to get team on track: Not giving upManchester City boss Pep Guardiola said he is relishing the challenge to get his side back on track after being thrashed by Sporting CP on November 5, Tuesday. City suffered their first loss of the season in the Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-claims-6th-spot-in-icc-test-batting-rankings-virat-kohli-hits-new-low-2629073-2024-11-06",
      "headline": "Rishabh Pant claims 6th spot in ICC Test batting rankings, Kohli hits new lowStar India wicketkeeper batter Rishabh Pant jumped five places to be at the sixth spot in the ICC Test batting rankings after a stellar show vs New Zealand while Virat Kohli dropped down eight places."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-virat-kohli-drops-8-places-new-zealand-series-2629060-2024-11-06",
      "headline": "Virat Kohli takes massive hit in ICC rankings after terrible series vs NZSenior India batter Virat Kohli took a massive hit in ICC batters' rankings after a terrible Test series agianst New Zealand. Kohli scored just 93 runs from 3 Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jalaj-saxena-becomes-1st-player-with-6000-runs-and-400-wickets-in-ranji-trophy-history-2629051-2024-11-06",
      "headline": "Jalaj Saxena becomes 1st player with 6000 runs and 400 wickets in Ranji TrophyKerala's Jalaj Saxena became the first player minthe history of Ranji Trophy to pick 400 wickets and score over 6000 runs in the history of Ranji Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-boss-dana-white-hails-president-donald-trump-us-elections-2629035-2024-11-06",
      "headline": "Trump doesn't quit, says Dana White. Meet the UFC boss and key allyUFC president Danan White hailed Donald Trump during his victory speech in Florida on Wednesday, November 6. Trump, who is set to join the office for the second time has won the American elections by a big margin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-sporting-cp-vs-manchester-city-pep-guardiola-reaction-2629082-2024-11-06",
      "headline": "Manchester City boss Pep Guardiola ready to get team on track: Not giving upManchester City boss Pep Guardiola said he is relishing the challenge to get his side back on track after being thrashed by Sporting CP on November 5, Tuesday. City suffered their first loss of the season in the Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-claims-6th-spot-in-icc-test-batting-rankings-virat-kohli-hits-new-low-2629073-2024-11-06",
      "headline": "Rishabh Pant claims 6th spot in ICC Test batting rankings, Kohli hits new lowStar India wicketkeeper batter Rishabh Pant jumped five places to be at the sixth spot in the ICC Test batting rankings after a stellar show vs New Zealand while Virat Kohli dropped down eight places."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-virat-kohli-drops-8-places-new-zealand-series-2629060-2024-11-06",
      "headline": "Virat Kohli takes massive hit in ICC rankings after terrible series vs NZSenior India batter Virat Kohli took a massive hit in ICC batters' rankings after a terrible Test series agianst New Zealand. Kohli scored just 93 runs from 3 Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jalaj-saxena-becomes-1st-player-with-6000-runs-and-400-wickets-in-ranji-trophy-history-2629051-2024-11-06",
      "headline": "Jalaj Saxena becomes 1st player with 6000 runs and 400 wickets in Ranji TrophyKerala's Jalaj Saxena became the first player minthe history of Ranji Trophy to pick 400 wickets and score over 6000 runs in the history of Ranji Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-boss-dana-white-hails-president-donald-trump-us-elections-2629035-2024-11-06",
      "headline": "Trump doesn't quit, says Dana White. Meet the UFC boss and key allyUFC president Danan White hailed Donald Trump during his victory speech in Florida on Wednesday, November 6. Trump, who is set to join the office for the second time has won the American elections by a big margin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-odis-t20is-squads-dasun-shanaka-charith-asalanka-sanath-jayasuriya-2628992-2024-11-06",
      "headline": "SL vs NZ: Former captain Shanaka overlooked yet again as Sri Lanka reveal squadsFormer captain Dasun Shanaka remains on the sidelines as Sri Lanka announced their squads for the upcoming T20I and ODI series against New Zealand on November 6, Wednesday. Shanaka was overlooked for the West Indies series as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-ipl-2025-mega-auction-rcb-royal-challengers-bengaluru-2628983-2024-11-06",
      "headline": "Glenn Maxwell on not being retained for IPL 2025: My RCB journey is not over yetRoyal Challengers Bengaluru (RCB) all-rounder Glenn Maxwell opened up on the conversations he had with the franchise after not being retained for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-predicts-winner-of-border-gavaskar-trophy-2024-25-australia-vs-india-2628955-2024-11-06",
      "headline": "Ricky Ponting predicts heavy defeat for India in the Border Gavaskar TrophyFormer Australia captain Ricky Ponting has predicted heavy defeat for India in the upcoming five-match Test series vs Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-james-anderson-registers-for-first-time-ben-stokes-to-miss-season-2628944-2024-11-06",
      "headline": "IPL Auction: James Anderson registers for first timeLegendary England seamer James Anderson has registered for the Indian Premier League auction for the first time in his career. The Test specialist, who retired with 704 wickets to his name has set his base price at Rs 1.25 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-to-end-2024-as-world-no1-after-iga-swiateks-loss-to-coco-gauff-2628939-2024-11-06",
      "headline": "Aryna Sabalenka to end 2024 as World No.1 after Iga Swiatek's loss to Coco GauffAryna Sabalenka will end 2024 as the World No.1 as Iga Swiatek lost her match against Coco Gauff in the WTA Finals in Riyadh on November 5, Tuesday. Sabalenka won 2 grand slams during 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-reignites-india-a-ball-tampering-controversy-asks-official-statement-2628931-2024-11-06",
      "headline": "Warner reignites India A ball tampering controversy, asks official statementFormer Australia batter David Warner believes that Cricket Australia should release a statement on India A's ball tampering controversy from the first warm-up match. Warner believes that CA squashed the incident quite fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-mcsweeney-australia-a-vs-india-a-border-gavaskar-trophy-2024-25-2628913-2024-11-06",
      "headline": "Nathan McSweeney to audition for India Test series by opening for Australia ANathan McSweeney will be opening for Australia A in the second unofficial Test vs India A at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-ac-milan-carlo-ancelotti-reaction-2628911-2024-11-06",
      "headline": "Carlo Ancelotti concerned over Real Madrid's poor form: Team is not playing wellReal Madrid manager Carlo Ancelotti has voiced his concerns following the team's rare consecutive defeats, including a recent loss to AC Milan. The team faces defensive issues and is struggling to maintain a top-eight spot in the Champions League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-to-end-2024-as-world-no1-after-iga-swiateks-loss-to-coco-gauff-2628939-2024-11-06",
      "headline": "Aryna Sabalenka to end 2024 as World No.1 after Iga Swiatek's loss to Coco GauffAryna Sabalenka will end 2024 as the World No.1 as Iga Swiatek lost her match against Coco Gauff in the WTA Finals in Riyadh on November 5, Tuesday. Sabalenka won 2 grand slams during 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-reignites-india-a-ball-tampering-controversy-asks-official-statement-2628931-2024-11-06",
      "headline": "Warner reignites India A ball tampering controversy, asks official statementFormer Australia batter David Warner believes that Cricket Australia should release a statement on India A's ball tampering controversy from the first warm-up match. Warner believes that CA squashed the incident quite fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-mcsweeney-australia-a-vs-india-a-border-gavaskar-trophy-2024-25-2628913-2024-11-06",
      "headline": "Nathan McSweeney to audition for India Test series by opening for Australia ANathan McSweeney will be opening for Australia A in the second unofficial Test vs India A at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-ac-milan-carlo-ancelotti-reaction-2628911-2024-11-06",
      "headline": "Carlo Ancelotti concerned over Real Madrid's poor form: Team is not playing wellReal Madrid manager Carlo Ancelotti has voiced his concerns following the team's rare consecutive defeats, including a recent loss to AC Milan. The team faces defensive issues and is struggling to maintain a top-eight spot in the Champions League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/thomas-draca-italian-player-registers-for-ipl-2025-mega-auction-2628883-2024-11-06",
      "headline": "Thomas Draca becomes first player from Italy to register for IPL 2025 auctionItalian cricketer Thomas Draca has become the first player from Italy to register himself for the upcoming IPL 2025 mega auction. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-rishabh-shreyas-among-23-indians-with-rs-2-crore-base-price-2628870-2024-11-06",
      "headline": "Rishabh Pant, KL Rahul among 23 Indians with Rs 2 crore base priceIPL Auction: 23 Indian stars registered themselves in the highest bracket of Rs 2 crore in the 2025 auction. Amongst the 23 were Rishabh Pant, Shreyas Iyer, KL Rahul and Ishan Kishan, who were released recently from their respective franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronaldo-on-target-as-al-nassr-thrash-titleholders-al-ain-in-afc-champions-league-2628858-2024-11-06",
      "headline": "Ronaldo on target as Al-Nassr thrash titleholders Al-Ain in AFC Champions LeagueCristiano Ronaldo's goal helped Al-Nassr secure a commanding 5-1 win against defending champions Al-Ain, putting their opponents' knockout hopes in jeopardy. Al-Nassr now sits comfortably in third place in their group as the tournament progresses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-ind-abhishek-sharma-yuvraj-singh-6-sixes-durban-2628848-2024-11-06",
      "headline": "Abhishek Sharma promises to make Yuvraj Singh proud at his '6-sixes' venue DurbanIndian young batting sensation Abhishek Sharma recalled Yuvraj Singh's 6 sixes upon his arrival at Durban ahead of the first T20I vs South Africa."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}