{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-share-price-extends-stock-market-rally-buy-hold-sell-brokerage-views-what-next-2716668-2025-04-29",
      "headline": "Reliance shares are gaining momentum after strong Q4. Can the rally last?Following the Q4 result announcement, RIL stock jumped nearly 5%. Even today, the stock has jumped 1.5% in early trade. Now the question is: is this just a relief rally — or the start of something bigger?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-300-points-higher-nifty-above-24400-indusind-bank-up-2-percent-bse-nse-2716658-2025-04-29",
      "headline": "Sensex, Nifty extend winning run boosted by FII buying; Tata Motors gains 2%The S&P BSE Sensex jumped 419.40 points to 80,637.41, while the NSE Nifty50 gained 122.45 points to 24,450.95 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-listing-gains-investment-gmp-today-rs-1-subscribe-skip-good-bad-2716653-2025-04-29",
      "headline": "Ather Energy IPO: Looking to invest? Check latest subscription and GMPThe price band for the IPO has been set between Rs 304 and Rs 321 per share. Retail investors need to apply for a minimum of one lot, which consists of 46 shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-stock-market-today-nse-bse-trading-fii-buying-trade-tensions-ease-2716638-2025-04-29",
      "headline": "Stock market opening: Sensex, Nifty likely to continue their rally. Here's whyGift Nifty futures were trading at 24,484.5 as of 7:16 am, showing that the Nifty50 is likely to start the day higher than Monday's closing level of 24,328.5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-april-29-shares-in-focus-today-bajaj-finance-indusind-wipro-adani-green-gensol-nse-bse-sensex-nifty-2716634-2025-04-29",
      "headline": "Stocks to watch today: Bajaj Finance, IndusInd Bank, Wipro, Adani Green, GensolSeveral companies, including Bajaj Finance, Bajaj Finserv, Bharat Petroleum Corporation, Ambuja Cements, etc are set to announce their fourth-quarter (Q4) results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-bribes-no-queues-founder-praises-dubai-smooth-business-setup-vs-india-struggles-2716395-2025-04-28",
      "headline": "No bribes, no queues: Founder compares business setup in Dubai vs IndiaSharing his story on Reddit, the founder said he recently set up a business in one of Dubai's free zones and was amazed at how smooth the whole process was. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-higher-fd-returns-rbl-and-union-bank-offer-up-to-85-percent-to-select-customers-2716348-2025-04-28",
      "headline": "Want higher FD returns? RBL and Union Bank offer up to 8.5% to select customersAfter the latest revision, Union Bank of India now offers FD interest rates ranging from 3% to 7.15% for regular customers, depending on the deposit tenure (7 days to 10 years).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zoho-ceo-sridhar-vembu-calls-ai-impact-on-jobs-small-2716280-2025-04-28",
      "headline": "Zoho CEO Sridhar Vembu calls AI's impact on jobs 'small'Vembu pointed out that while AI vendors are promising big changes, real-world studies, including one titled 'Large Language Models, Small Labor Market Effects', show a different picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-1000-points-higher-nifty-above-24300-ril-up-5-percent-2716276-2025-04-28",
      "headline": "Sensex, Nifty surge over 1% as Reliance rally and FII buying lift marketsThe S&P BSE Sensex jumped over 1,000 points to close at 80,218.37, while the NSE Nifty50 gained 289.15 points to end at 24,328.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-trade-war-recession-fears-impact-threat-economists-2716271-2025-04-28",
      "headline": "Trump's tariffs are raising recession fears. How bad could it get?Just three months ago, economists covering nearly 50 economies had forecast a steady, healthy pace of global growth. But Trump's decision to slap sweeping tariffs, including a 10% blanket duty on all US imports and a 145% tariff on goods from China, has upset those expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-falling-why-reasons-us-dollar-strong-trade-relation-china-what-to-expect-2716269-2025-04-28",
      "headline": "Gold prices continue falling: What is driving the prices low?Gold is often seen as a safe place to store value during times of political and financial uncertainty. It touched an all-time high of $3,500.05 per ounce last week because of trade tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-regime-why-it-is-more-beneficial-for-salaried-employees-itr-filing-2025-standard-deduction-rs-75000-2716216-2025-04-28",
      "headline": "New Income tax regime: Why is it more beneficial for salaried employeesThe new tax regime also offers a higher standard deduction. Last year, it was raised from Rs 50,000 to Rs 75,000 for salaried employees. In the old regime, the standard deduction remains at Rs 50,000. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-on-pahalgam-attack-kashmiris-are-angry-nation-stands-united-2716662-2025-04-29",
      "headline": "Kashmiris are angry, nation stands united: Nawazuddin Siddiqui on Pahalgam attackActor Nawazuddin Siddiqui spoke about the Pahalgam terror attack, and highlighted the deep sense of hurt and anguish that Kashmiris feel after 26 tourists were killed on their land in Pahalgam in an open-fire by terrorists last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ranveer-allahbadia-flies-abroad-after-indias-got-latent-row-passport-mil-gaya-2716651-2025-04-29",
      "headline": "Ranveer Allahbadia flies abroad after India's Got Latent row: Passport mil gayaYouTuber and podcaster Ranveer Allahbadia is off on his first international trip after his passport was returned amid India's Got Latent row. He shared photos of him from the airport and inside the aeroplane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/andaz-apna-apna-59-year-old-salman-khan-looks-drop-dead-dashing-in-pool-pics-2716643-2025-04-29",
      "headline": "Andaz Apna Apna! 59-year-old Salman Khan looks drop-dead dashing in pool picsActor Salman Khan shared a few shirtless photos on social media. He also teased the fans about the re-release of his 'Andaz Apna Apna', which is now running in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/halle-berry-payal-kapadia-jeremy-strong-cannes-2025-jury-members-2716639-2025-04-29",
      "headline": "India's Payal Kapadia, Halle Berry, and others join Cannes 2025 as jury membersIndian filmmaker Payal Kapadia, who won the historic Grand Prix for 'All We Imagine As Light' last year, has joined Cannes 2025 as a jury member. Halle Berry, Jeremy Strong and several others are part of the jury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-pahalgam-attack-reaction-no-fighting-let-us-respect-every-religion-caste-2716628-2025-04-29",
      "headline": "Ajith Kumar calls for peace after Pahalgam attack: Let's not fight among ourselvesActor Ajith Kumar reacted to Pahalgam attack after receiving Padma Bhushan award in New Delhi. He called for peace and said that everyone should learn to respect each other, every religion and caste and end the fights within ourselves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/binge-worthy-alert-7-must-see-netflix-series-glbs-2716604-2025-04-29",
      "headline": "Binge-worthy alert: 7 must-see Netflix seriesNetflix's latest lineup offers thrilling dramas, heartfelt journeys, culinary masterpieces, and dark twists. From Love on the Spectrum to You's final season, there's something exciting for every viewer.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/autopsy-reveals-heart-disease-and-alzheimers-led-to-gene-hackmans-death-glbs-2716591-2025-04-29",
      "headline": "Autopsy reveals heart disease and Alzheimer's led to Gene Hackman's deathGene Hackman died from heart disease and advanced Alzheimer's, an autopsy confirms. His wife, Betsy Arakawa, likely died days earlier from hantavirus. Investigations continue into the couple's tragic deaths.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/video/shraddha-arya-returns-to-kumkum-bhagya-set-after-maternity-break-2716445-2025-04-28",
      "headline": "Watch: Actor Shraddha Arya returns to Kumkum Bhagya set after maternity breakActor Shraddha Arya has returned to work after a maternity break. The actor will reprise her role as Preeta on the show. She welcomed twins, a baby boy and a baby girl, on November 29, 2024, with her husband Rahul Nagal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-clarifies-ai-generated-poster-as-guru-nanak-dev-goes-viral-2716442-2025-04-28",
      "headline": "Aamir Khan clarifies after his AI-generated poster as Guru Nanak goes viralAamir Khan's team recently clarified the AI-generated poster that falsely depicted the actor as Guru Nanak Dev. A fake YouTube channel circulated the content, sparking outrage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ajith-kumar-nandamuri-balakrishna-shekhar-kapur-honourd-at-padma-awards-2716382-2025-04-28",
      "headline": "Ajith Kumar, Shekhar Kapur honoured with Padma BhushanAjith Kumar, Nandamuri Balakrishna and Shekhar Kapur bagged Padma Awards in New Delhi on April 28. The actors received the prestigious award from President Droupadi Murmu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/veteran-malayalam-director-shaji-karun-dies-of-cancer-at-73-2716383-2025-04-28",
      "headline": "Veteran Malayalam director Shaji Karun dies of cancer at 73Renowned filmmaker Shaji N Karun, who made significant contributions to Malayalam cinema and earned accolades like the Padma Shri, has died at 73 after a prolonged battle with cancer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/you-season-5-review-a-disappointing-predictable-goodbye-to-joe-goldberg-2715693-2025-04-28",
      "headline": "You Season 5 review: A disappointing, predictable goodbye to Joe GoldbergReleased-Thu Apr 24, 2025The psychological thriller 'You', starring Penn Badgley as the show-runner, premiered its season finale on April 24. The show concludes its journey with Joe Goldberg facing the consequences of his dark past while navigating personal turmoil. As the final season unfolds, familiar faces and new challenges emerge, questioning whether redemption or downfall awaits him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-to-re-release-in-theatres-october-2025-films-eighth-anniversary-2716328-2025-04-28",
      "headline": "Baahubali returns to theatres in 2025, confirms producer on 8th anniversary'Baahubali' is all set to re-release in theatres this October. On the film's eighth anniversary, producer Shobu Yarlagadda announced that the film will be back in theatres with new surprises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-decade-long-slump-karthik-subbaraj-retro-guarantee-success-2716290-2025-04-28",
      "headline": "Suriya's comeback quest: Will Karthik Subbaraj's Retro end the dry spell?Suriya is one of the most celebrated actors in the Tamil film industry. However, he hasn't had a big hit in the last decade. Will his upcoming film, 'Retro', help end his decade-long drought at the box office?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-season-1-finale-review-10-episodes-and-yet-something-feels-unfinished-2716302-2025-04-28",
      "headline": "Suits LA Season Episode 10 review: 10 episodes and yet something feels unfinished Released-Mon Apr 28, 2025'Suits LA' Season 1 premiered its 10th episode on Monday (IST), and while it featured all the elements from the 'Suits' series, including the charismatic Harvey Spector, it never fully delivered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-praises-patralekhaa-performance-in-phule-2716316-2025-04-28",
      "headline": "Moments in Phule were pure gold: Rajkummar Rao praises Patralekhaa's performanceRajkummar Rao praised his wife Patralekhaa's performance in 'Phule'. The film released in theatres on April 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/seema-pahwa-hints-at-quitting-films-the-condition-is-very-bad-2716274-2025-04-28",
      "headline": "Actor Seema Pahwa hints at quitting films: The condition is very badActor Seema Pahwa hinted at quitting films. She mentioned how creative people have been murdered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-release-date-amol-parashar-leads-tvf-series-on-rural-healthcare-2716235-2025-04-28",
      "headline": "Gram Chikitsalay release date out: Amol Parashar leads series on rural healthcarePrime Video's new series 'Gram Chikitsalay', starring Amol Parashar, is set to premiere on May 9, 2025. The series, created by Deepak Kumar Mishra, promises a blend of humour and social commentary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/who-is-neha-singh-rathore-bhojpuri-singer-facing-sedition-for-kashmir-attack-posts-2716250-2025-04-28",
      "headline": "Who is Neha Singh Rathore, Bhojpuri singer facing sedition for Kashmir attack postsPopular singer Neha Singh Rathore is facing a sedition case over her statements about the Pahalgam terror attack. The complainant claimed that she made provocative posts targeting a religious community. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-closes-tourist-destinations-after-intel-warning-more-terror-attacks-security-agencies-government-2716661-2025-04-29",
      "headline": "48 tourist destinations closed in Kashmir after intel on more terror attacks Live UpdatesIntelligence reports suggest that terrorists are planning targeted killings and a larger attack in retaliation for the destruction of terrorists' houses following last week's Pahalgam strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-elections-2025-liberal-party-conservatives-vote-counting-mark-carney-glbs-2716614-2025-04-29",
      "headline": "Mark Carney's Liberals projected to win Canada electionsMark Carney is set to stay on as Canada's Prime Minister after Canadian broadcasters called the federal election for his Liberal Party, dashing the hopes of the Conservatives led by Pierre Poilievre."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-student-in-canada-vanshika-missing-for-two-days-found-dead-embassy-2716632-2025-04-29",
      "headline": "Indian student in Canada, missing for three days, found deadA missing Indian student in Canada, Vanshika, was found dead and local authorities are investigating the cause of death, the Indian Embassy in Canada said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-radar-systems-line-of-control-fearing-india-airstrikes-pahalgam-terror-attack-2716665-2025-04-29",
      "headline": "Fearing air strikes by India, Pakistan moves radar systems along borderThe Pakistani army is moving its radar systems to forward locations in the Sialkot sector to detect possible Indian airstrikes, according to exclusive information received by India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-2/",
      "headline": "Terrorism in Kashmir: Nine years of calm before icy stormIn part 2 of our series on the history of terrorism in Kashmir, we revisit the calm before the storm that prevailed from 1980 to the summer of 1989."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-united-nations-pahalgam-attack-khwaja-asif-sponsoring-terror-rogue-state-2716630-2025-04-29",
      "headline": "Your Minister admitted to...: India shreds 'rogue state' Pakistan at UNCalling India a \"victim of cross-border terrorism,\" the Deputy Ambassador pointed to Pakistan Defence Minister Khwaja Asif's \"open confession\" regarding Pakistan's history of supporting terrorist groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-rahul-dravid-jaipur-2716623-2025-04-29",
      "headline": "Vaibhav Suryavanshi turns Chain Kulii Ki Main Kulii dream into IPL realityIn a scene straight out of Chain Kulii Ki Main Kulii, Vaibhav Suryavanshi turned childhood dreams into reality. With every fearless shot, he proved the magic wasn't in a lucky bat — it was in his own heart all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/enough-is-enough-indian-american-democrat-moves-to-impeach-donald-trump-glbs-2716612-2025-04-29",
      "headline": "Enough is enough: Indian-American Democrat moves to impeach Donald TrumpIndian-American Rep. Shri Thanedar filed articles of impeachment against Trump, accusing him of abusing power, violating the Constitution, and endangering democracy. Thanedar called for urgent action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-on-pahalgam-attack-kashmiris-are-angry-nation-stands-united-2716662-2025-04-29",
      "headline": "Kashmiris are angry, nation stands united: Nawazuddin Siddiqui on Pahalgam attackActor Nawazuddin Siddiqui spoke about the Pahalgam terror attack, and highlighted the deep sense of hurt and anguish that Kashmiris feel after 26 tourists were killed on their land in Pahalgam in an open-fire by terrorists last week. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-defence-minister-india-military-action-pahalgam-terror-attack-jammu-kashmir-2716448-2025-04-28",
      "headline": "Military action by India is imminent after Pahalgam attack: Pak Defence MinisterKhawaja Muhammad Asif said that the Pakistani military has briefed the government about the possibility of an attack by India in view of the deadly Pahalgam terror assault. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/i-run-the-country-and-the-world-declares-donald-trump-2716607-2025-04-29",
      "headline": "'I run the country and the world,' declares Donald TrumpTrump spoke to Jeffrey Goldberg, the editor-in-chief of The Atlantic, who exposed the Pentagon chief's Signal chat on the Yemen war plan after he was inadvertently added to the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pahalgam-attack-spotlights-pakistans-terror-strategy-in-post-article-370-kashmir-2716538-2025-04-28",
      "headline": "Pahalgam attack spotlights Pakistan's terror strategy in post-Article 370 KashmirIslamabad has redirected its proxy war to the less militarised region south of the Pir Panjal range while raising shadow outfits that project terrorism in J&K as homegrown"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/from-isha-ambani-to-alia-bhatt-iconic-met-gala-fashion-moments-ft-indian-celebs-2716420-2025-04-29",
      "headline": "From Isha Ambani to Alia Bhatt: Iconic Met Gala fashion moments ft. Indian celebsAhead of the Met Gala 2025, let's revisit some of the most iconic Indian fashion moments from previous editions of the charity gala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-army-provokes-firing-line-of-control-jammu-kashmir-again-fifth-straight-day-indian-army-retaliates-pahalgam-terror-2716622-2025-04-29",
      "headline": "Pak Army continues cross-border firing for 5th day, Indian troops retaliateThe Pakistan Army resorted to unprovoked small arms firing across multiple locations along the Line of Control, prompting a measured Indian Army response, amid escalating tensions following the Pahalgam terror attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-rahul-dravid-wheelchair-century-rr-vs-gt-2716555-2025-04-28",
      "headline": "Watch: Rahul Dravid gets off wheelchair to celebrate Vaibhav Suryavanshi's 101IPL 2025, RR vs GT: Rahul Dravid got off from his wheelchair to praise Vaibhav Suryavanshi, who scored a 35-ball hundred against Gujarat Titans at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-israel-on-pakistan-hamas-strike-terrorism-reuven-azar-2716572-2025-04-28",
      "headline": "Hamas's Oct 7 strike inspired terrorists globally: Israeli envoy on J&K attackSpeaking to India Today TV, Israeli envoy Reuven Azar warned that the October 7 Hamas attack has triggered a global wave of terror inspiration, linking it to the Pahalgam massacre that killed 26 civilians in Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ranveer-allahbadia-flies-abroad-after-indias-got-latent-row-passport-mil-gaya-2716651-2025-04-29",
      "headline": "Ranveer Allahbadia flies abroad after India's Got Latent row: Passport mil gayaYouTuber and podcaster Ranveer Allahbadia is off on his first international trip after his passport was returned amid India's Got Latent row. He shared photos of him from the airport and inside the aeroplane."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/rg-kar-rape-murder-case-kolkata-court-number-used-whatsapp-group-removed-family-claims-2716606-2025-04-29",
      "headline": "RG Kar victim's number used for few months after her death: Family's big claimThe family of the RG Kar trainee doctor, who was raped and murdered in the Kolkata-based hospital last year, alleged that the victim's number was removed from a WhatsApp group and used for a few months after her death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/amazon-launches-first-operational-kuiper-satellites-to-compete-with-spacexs-starlink-glbs-2716615-2025-04-29",
      "headline": "Amazon launches first Operational Kuiper satellites to compete with SpaceX's StarlinkAmazon launched 27 satellites as part of its Project Kuiper, aiming to provide global broadband services. The company competes with SpaceX's Starlink, and plans to deploy over 3,200 satellites.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-kalbaisakhi-storm-rainfall-damage-weather-alert-heatwave-relief-trees-uprooted-mohna-majhi-house-chief-minister-2716637-2025-04-29",
      "headline": "Heavy rain, strong winds lash Odisha; trees uprooted at Chief Minister's houseHeavy rains and strong winds from Kalbaisakhi caused widespread damage across Odisha, uprooting trees and disrupting daily life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/halle-berry-payal-kapadia-jeremy-strong-cannes-2025-jury-members-2716639-2025-04-29",
      "headline": "India's Payal Kapadia, Halle Berry, and others join Cannes 2025 as jury membersIndian filmmaker Payal Kapadia, who won the historic Grand Prix for 'All We Imagine As Light' last year, has joined Cannes 2025 as a jury member. Halle Berry, Jeremy Strong and several others are part of the jury."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zipline-operator-tourist-pahalgam-attack-video-called-for-questioning-again-nia-2716513-2025-04-28",
      "headline": "Zipline operator who said 'Allahu Akbar' in tourist video summoned by NIA: SourcesAfter a video, showing a zipline operator shouting 'Allahu Akbar' in Pahalgam, surfaced online, he has been called in for questioning by the NIA and Jammu and Kashmir Police, as per sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-opens-300-points-higher-nifty-above-24400-indusind-bank-up-2-percent-bse-nse-2716658-2025-04-29",
      "headline": "Sensex, Nifty extend winning run boosted by FII buying; Tata Motors gains 2%The S&P BSE Sensex jumped 419.40 points to 80,637.41, while the NSE Nifty50 gained 122.45 points to 24,450.95 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/power-restored-in-parts-of-spain-and-portugal-after-hours-long-outage-2716616-2025-04-29",
      "headline": "Power restored in parts of Spain and Portugal after hours-long outagePower began to be restored in parts of Spain and Portugal after a massive outage in both countries led to the grounding of flights, halting public transport and forcing hospitals to suspend routine operations."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-team-manager-rahul-dravid-reaction-vaibhav-suryavanshi-hundred-vs-gt-2716663-2025-04-29",
      "headline": "Rahul Dravid hugged Vaibhav: RR manager reveals post-match interactionRajasthan Royals team manager Romi Bhinder explained how head coach Rahul Dravid hugged 14-year-old Vaibhav Suryavanshi after his stunning century against Gujarat Titans and shared a few words with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-sai-sudharasan-2716654-2025-04-29",
      "headline": "Vaibhav Suryavanshi's batting was tremendous to watch: GT's Sai SudharsanGujarat Titans batter Sai Sudharsan tipped his hat to Vaibhav Suryavanshi after the 14-year-old's blazing knock for Rajasthan Royals during the match against them on Monday, April 28. Sudharsan admitted that the Titans should have been more disciplined with their bowling approach against the youngster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-rahul-dravid-rajasthan-royals-2716629-2025-04-29",
      "headline": "Vaibhav Suryavanshi's near-flawless start to mother of fairytalesIPL 2025, RR vs GT: At just 14 years old, Vaibhav Suryavanshi achieved what many cricketers can only dream of — scoring an IPL century and becoming the fastest Indian to reach a hundred in the tournament's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/vaibhav-suryavanshi-can-have-a-long-successful-career-for-india-rr-batting-coach-2716648-2025-04-29",
      "headline": "Special Vaibhav can have a long, successful career for India: RR batting coachRajasthan Royals batting coach Vikram Rathour said 14-year-old Vaibhav Suryavanshi is a special talent with the potential to enjoy a long and successful career in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-ms-dhoni-virat-kohli-rajasthan-royals-2716647-2025-04-29",
      "headline": "When Suryavanshi met Dhoni, Kohli: RR manager reveals IPL legends chatRR team manager Rumi Bhinder revealed the chats Vaibhav Suryavanshi had with MS Dhoni and Virat Kohli after his record-breaking hundred against Gujarat Titans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-hundred-rr-vs-gt-ian-bishop-brian-lara-advice-2716642-2025-04-29",
      "headline": "Learn from Brian Lara: WI great offers advice to young IPL sensation VaibhavIan Bishop believes Vaibhav Suryavanshi needs the right support to manage early fame, suggesting he follow Brian Lara's example in handling pressure after scripting IPL history at just 14 years of age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-vikram-rathour-press-conference-2716636-2025-04-29",
      "headline": "What makes Vaibhav Suryavanshi special? RR batting coach decodes IPL sensationRR's batting coach Vikram Rathour heaped praise on Vaibhav Suryavanshi and explained what makes the IPL sensation so special after his hundred against GT on April 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-rahul-dravid-jaipur-2716623-2025-04-29",
      "headline": "Vaibhav Suryavanshi turns Chain Kulii Ki Main Kulii dream into IPL realityIn a scene straight out of Chain Kulii Ki Main Kulii, Vaibhav Suryavanshi turned childhood dreams into reality. With every fearless shot, he proved the magic wasn't in a lucky bat — it was in his own heart all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-rohit-sharma-rr-vs-gt-ipl-2025-2716589-2025-04-29",
      "headline": "Class: Rohit Sharma in awe of Suryavanshi's heroic 101 vs GTIPL 2025, RR vs GT: Rohit Sharma was impressed with Vaibhav Suryavanshi's 101-run knock for the Rajasthan Royals (RR) against Gujarat Titans (GT) on Monday at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-player-of-match-reaction-2716585-2025-04-29",
      "headline": "Vaibhav Suryavanshi on his groundbreaking 101: No fear, just focused on the ballIPL 2025, RR vs GT: Vaibhav Suryavanshi said he felt no pressure in the middle and just focused on the ball as he smashed the fastest hundred by an Indian in the Indian Premier League. The 14-year-old's 38-ball 101 helped Rajasthan chase down 210 and end their five-match losing streak in this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhan-suryavanshi-records-ipl-2025-rr-vs-gt-stat-pack-2716577-2025-04-28",
      "headline": "IPL 2025: Vaibhav Suryavanshi's record-breaking 38-ball 101 in statsIPL 2025, RR vs GT: 14-year-old Vaibhav Suryavanshi broke several records as the Rajasthan Royals beat the Gujarat Titans by eight wickets on April 28 at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-vikram-rathour-press-conference-2716636-2025-04-29",
      "headline": "What makes Vaibhav Suryavanshi special? RR batting coach decodes IPL sensationRR's batting coach Vikram Rathour heaped praise on Vaibhav Suryavanshi and explained what makes the IPL sensation so special after his hundred against GT on April 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-hundred-rahul-dravid-jaipur-2716623-2025-04-29",
      "headline": "Vaibhav Suryavanshi turns Chain Kulii Ki Main Kulii dream into IPL realityIn a scene straight out of Chain Kulii Ki Main Kulii, Vaibhav Suryavanshi turned childhood dreams into reality. With every fearless shot, he proved the magic wasn't in a lucky bat — it was in his own heart all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-rohit-sharma-rr-vs-gt-ipl-2025-2716589-2025-04-29",
      "headline": "Class: Rohit Sharma in awe of Suryavanshi's heroic 101 vs GTIPL 2025, RR vs GT: Rohit Sharma was impressed with Vaibhav Suryavanshi's 101-run knock for the Rajasthan Royals (RR) against Gujarat Titans (GT) on Monday at the Sawai Mansingh Stadium in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-gt-vaibhav-suryavanshi-player-of-match-reaction-2716585-2025-04-29",
      "headline": "Vaibhav Suryavanshi on his groundbreaking 101: No fear, just focused on the ballIPL 2025, RR vs GT: Vaibhav Suryavanshi said he felt no pressure in the middle and just focused on the ball as he smashed the fastest hundred by an Indian in the Indian Premier League. The 14-year-old's 38-ball 101 helped Rajasthan chase down 210 and end their five-match losing streak in this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhan-suryavanshi-records-ipl-2025-rr-vs-gt-stat-pack-2716577-2025-04-28",
      "headline": "IPL 2025: Vaibhav Suryavanshi's record-breaking 38-ball 101 in statsIPL 2025, RR vs GT: 14-year-old Vaibhav Suryavanshi broke several records as the Rajasthan Royals beat the Gujarat Titans by eight wickets on April 28 at the Sawai Mansingh Stadium in Jaipur. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}