{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itat-rules-property-transfer-between-spouses-is-valid-for-tax-exemption-2762977-2025-07-29",
      "headline": "Wife pays no income tax after selling two houses gifted by husbandA woman from Mumbai won a court case at the Income Tax Appellate Tribunal (ITAT), which said she did not have to pay income tax after selling two flats worth Rs 6 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-427-points-higher-nifty-above-24800-ril-up-2-percent-2763034-2025-07-29",
      "headline": "Sensex ends 427 points higher; Nifty above 24,800; RIL up 2%The S&P BSE Sensex added 446.93 points to close at 81,337.95, while the NSE Nifty50 gained 140.20 points to end at 24,821.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-tax-when-selling-property-house-section-54-ltcg-long-term-capital-gains-money-tips-personal-finance-2763025-2025-07-29",
      "headline": "Selling your house? Here's how you can save lakhs in taxesSection 54 of the Income Tax Act allows exemption on long-term capital gains earned from the sale of a residential house or plot of land if the profit is reinvested in buying or constructing a new residential property in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-icici-and-4-other-banks-offering-high-fd-rates-check-now-2763008-2025-07-29",
      "headline": "HDFC, ICICI and 4 other banks offering high FD rates. Check nowICICI Bank also offers 6.6% interest, but on a longer tenure, between 2 and 10 years. For senior citizens, the rate is 7.10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-details-size-drhp-issue-size-promoters-peyush-bansal-neha-bansal-2762974-2025-07-29",
      "headline": "Lenskart takes first step towards IPO, files draft with SebiAccording to the draft papers, the IPO will include a fresh issue of shares worth up to Rs 2,150 crore and an offer for sale (OFS) of up to 13.23 crore shares by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanction-hit-nayara-turns-to-rediff-after-microsoft-suspension-report-2762966-2025-07-29",
      "headline": "EU-sanctioned refiner Nayara turns to Rediff after Microsoft suspension: ReportThe shift comes in the wake of fresh European Union sanctions announced on July 18 that targeted Nayara for its links to Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/refiner-nayara-trims-crude-runs-in-wake-of-eu-sanctions-2762964-2025-07-29",
      "headline": "Russia-backed Indian Refiner Nayara trims crude runs in wake of EU sanctionsPrivately-held Nayara, which runs India's third-biggest refinery at the port of Vadinar in the western state of Gujarat, controls nearly 8% of the country's total refining capacity of about 5.2 million bpd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-tax-filing-deadline-getting-extended-again-these-key-itr-utilities-still-pending-2762945-2025-07-29",
      "headline": "Is tax filing deadline getting extended again? These key ITR utilities still pendingThis year, the ITR forms were notified only by the end of May, much later than usual. After that, the utilities were rolled out in phases, and key tools are still missing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-august-1-deadline-trump-tariff-jamieson-greer-piyush-goyal-2762921-2025-07-29",
      "headline": "Will India clinch a US trade deal before August 1? Here's what we knowSpeaking last week, Commerce Minister Piyush Goyal said that there were \"no sticking points\" in the India-US relationship and added that issues like immigration and H-1B visas had not come up in the current trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-expects-more-layoffs-as-it-industry-faces-major-transition-2762890-2025-07-29",
      "headline": "Nasscom expects more layoffs as IT industry faces major transitionThis comes just days after Tata Consultancy Services (TCS), the country's largest IT employer, announced it would cut 2% of its global staff. Around 12,000 mid- and senior-level employees will be let go as the company adjusts its team structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-may-pause-hikes-senior-hiring-after-mass-layoffs-announcement-report-2762869-2025-07-29",
      "headline": "TCS may pause hikes, senior hiring after mass layoffs announcement: ReportTCS shares have dropped nearly 30% over the past year, ranking among the weakest in the Nifty IT index. Shares of the company are down 25% on  year-to-date basis and have fallen nearly 12% in a month.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mazagon-dock-shipbuilders-share-price-drop-sharpy-q1-results-buy-sell-explained-2762857-2025-07-29",
      "headline": "Explained: Why Mazagon Dock share price tumbled 5% after Q1 resultsThe Mazagon Dock Shipbuilders stock was down 4.50% to Rs 2,664.25 on the Bombay Stock Exchange (BSE) at 10:34 am. In a month, the stock has tumbled 18%, still up almost 19% this year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-returns-when-where-to-watch-cast-and-other-details-2762922-2025-07-29",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi returns: When, where to watch, cast and other detailsThe highly-anticipated reboot of 'Kyunki Saas Bhi Kabhi Bahu Thi' premieres tonight. Here's everything you need to know about the much-loved show - from the star-studded cast to when and where to watch, we list it all before its premiere. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shivaraj-kumar-supports-ramya-social-media-harassment-complaint-2763009-2025-07-29",
      "headline": "Shiva Rajkumar condemns online abuse against Ramya, expresses supportActor Shiva Rajkumar and his wife, Geetha, condemned online harassment against actor-politician Ramya. They emphasised that social media should be used for one's growth and not to hurl abuses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-and-jr-ntr-to-unite-for-war-2-pre-release-event-in-vijayawada-2762960-2025-07-29",
      "headline": "Hrithik Roshan and Jr NTR to attend War 2 pre-release event in VijayawadaActors Hrithik Roshan and Jr NTR will make a joint appearance to promote the much-anticipated film 'War 2'. They will be seen at the film's pre-release event in Vijayawada on August 10. 'War 2' is scheduled for a theatrical release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-completes-climax-shoot-ustaad-bhagat-singh-amid-political-duties-2762958-2025-07-29",
      "headline": "Pawan Kalyan wraps up Ustaad Bhagat Singh climax shoot amid busy schedulePawan Kalyan has wrapped up the shooting of climax of 'Ustaad Bhagat Singh'. The production house praised his dedication and hard work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-visits-gurudwara-with-rumoured-boyfriend-arjun-bajwa-2762972-2025-07-29",
      "headline": "Sara Ali Khan visits Gurudwara with rumoured boyfriend Arjun Pratap BajwaSara Ali Khan was recently seen leaving a Mumbai Gurudwara with rumoured boyfriend Arjun Pratap Bajwa, sparking fresh dating rumours. While the two didn't pose together, their joint appearance quickly grabbed fans' attention online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/michelle-yeoh-hints-lisa-and-frederic-arnault-dating-2762957-2025-07-29",
      "headline": "Did Michelle Yeoh just confirm Lisa and Frederic are dating? Fans think soActor Michelle Yeoh's playful yet telling caption of her latest social media post has sent the internet into a frenzy. Fans believe that this is concrete proof that LVMH heir Frederic Arnault and Blackpink's Lisa are dating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-rajesh-khanna-death-64-unopened-suitcases-were-found-at-his-home-aashirwaad-2762973-2025-07-29",
      "headline": "64 unopened suitcases were found at Rajesh Khanna's home Aashirwaad after his deathIn the end, it wasn't just the stardom Rajesh Khanna left behind, but the silence of unopened suitcases. Perhaps also the echoes of a life that longed to connect, yet chose solitude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/park-ju-hyun-injured-car-accident-skips-iron-girls-2-shoot-2762909-2025-07-29",
      "headline": "Actor Park Ju-hyun injured in car accident, skips Iron Girls 2 shootActor Park Ju Hyun, a regular cast member of 'Iron Girls 2', was absent from the latest episode, which aired on July 25. It was later revealed that her absence was due to a minor accident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-makers-unveil-sanjay-dutts-rugged-first-look-on-his-birthday-2762952-2025-07-29",
      "headline": "The Raja Saab makers unveil Sanjay Dutt's rugged first look on his birthdayOn Sanjay Dutt's birthday (July 29), the makers of The Raja Saab unveiled his first look from the upcoming horror film. The movie features Prabhas in the lead, with Dutt playing the antagonist.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-turns-trolling-into-triumph-in-new-kfc-ad-2762938-2025-07-29",
      "headline": "Urvashi Rautela turns trolling into triumph in new KFC adUrvashi Rautela turns trolling into triumph with a witty KFC ad. By embracing the jokes and flipping the narrative, she wins over the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-reunites-for-third-project-geetha-govindam-dear-comrade-2762926-2025-07-29",
      "headline": "Exclusive: Rashmika Mandanna and Vijay Deverakonda to reunite for third projectRashmika Mandanna and Vijay Deverakonda are set to collaborate again in a new film directed by Rahul Sankrityan. The film was announced in 2024 and is expected to go on floors in a few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khushi-kapoor-trolled-after-old-video-of-picking-ahaan-panday-for-her-debut-emerges-2762874-2025-07-29",
      "headline": "Khushi Kapoor trolled for picking Ahaan Panday as debut co-star in old interviewActor Khushi Kapoor is now receiving flak for her comments on Neha Dhupia's talk show in 2019. The 'Loveyapa' actor expressed her desire to debut alongside 'Saiyaara' actor Ahaan Panday on the show. She picked him over Aryan Khan and Meezaan Jaaferi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayan-mukerji-brings-kesariya-magic-back-for-hrithik-roshan-kiara-advani-romantic-song-in-war-2-2762908-2025-07-29",
      "headline": "Ayan Mukerji brings Kesariya magic back for Hrithik-Kiara's romantic song in War 2A romantic song in 'War 2', starring Hrithik Roshan and Kiara Advani, is being composed by the 'Kesariya' team. The romantic number is scheduled to be out later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-praises-farah-khan-outspoken-verbosity-in-handwritten-letter-to-her-watch-viral-video-2762889-2025-07-29",
      "headline": "Big B praises Farah Khan's outspoken verbosity in handwritten letter to her. WatchFarah Khan is thrilled by a personal letter from Amitabh Bachchan. She read out the contents of the handwritten letter in a video on social media, and thanked Big B for his generosity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-celebrates-nysa-devgan-graduation-day-ajay-devgn-yug-family-serves-major-style-goal-2762882-2025-07-29",
      "headline": "Kajol celebrates Nysa's graduation day, Devgn family serves major style goalsKajol and Ajay Devgn proudly celebrated their daughter Nysa Devgn's graduation. On Tuesday, Kajol shared a heartfelt video of the special moment, dressed in stylish outfits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-trailer-august-2-anirudh-ravichander-performance-chennai-nehru-stadium-2762891-2025-07-29",
      "headline": "Rajinikanth's Coolie trailer to be out on August 2, Anirudh to perform in ChennaiThe much-awaited trailer of Supertsar Rajinikanth's 'Coolie' will be launched at Nehru Indoor Stadium on August 2. Composer Anirudh Ravichaner will be performing at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-reacts-to-backlash-says-athiya-shetty-warns-him-about-his-controversial-statements-2762878-2025-07-29",
      "headline": "Suniel Shetty reacts to backlash, says Athiya warns him about controversial remarksSuniel Shetty shared that his daughter Athiya often scolds him for making controversial remarks in interviews and advises him to stay cautious. The actor has faced criticism recently for his views on parenting and gender roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-11-detailed-report-ahaan-panday-love-story-crosses-rs-250-crore-in-india-2762877-2025-07-29",
      "headline": "Saiyaara box office Day 11: Ahaan Panday's love story crosses Rs 250 crore in IndiaYRF's 'Saiyaara' has been on a record-breaking spree. The Ahaan Panday and Aneet Padda-starrer has crossed the benchmark of Rs 250 crore in India, and is now aiming to enter the Rs 300 crore club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ilaiyaraaja-plea-copyright-case-denied-to-be-moved-supreme-court-2762867-2025-07-29",
      "headline": "Ilaiyaraaja's plea to move copyright case to Chennai denied by Supreme CourtThe Supreme Court has dismissed Ilaiyaraaja's petition seeking to move his copyright dispute case from Bombay to Madras High Court. The legal battle involves claims over 536 musical compositions and continues to unfold in multiple courts."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/voter-ids-show-pahalgam-attackers-were-pakistanis-amit-shah-hits-out-at-p-chidambaram-for-giving-clean-chit-2762925-2025-07-29",
      "headline": "Pahalgam attackers were from Pak, we have proof: Amit Shah attacks ChidambaramAsserting that India possesses conclusive evidence of the terrorists' identity and origin, Amit Shah said two of the terrorists killed as part of Operation Mahadev had Pakistani voter identity numbers and that even the chocolates recovered from their possession were manufactured in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-op-sindoor-debate-lok-sabha-modi-opposition-lok-sabha-rajya-sabha-rahul-gandhi-2762843-2025-07-29",
      "headline": "Live: Who will take responsibility for Pahalgam attack, says Mallikarjun KhargeParliament Session 2025 Live Updates: Parliament on Tueday witnessed yet another heated confrontation as the debate over Operation Sindoor intensified, with the Centre and Opposition trading barbs over the recent conflict between India and Pakistan. Prime Minister Narendra Modi is scheduled to address either House around 7 pm today, marking his entry into the ongoing debate. Union Home Minister Amit Shah led the government's defence in the Lok Sabha, while Defence Minister Rajnath Singh opened the discussion in the Rajya Sabha. On the Opposition front, Congress leaders Rahul Gandhi and Priyanka Gandhi are expected to spearhead the attack, targeting the government's handling of both the India-Pakistan skirmish and Operation Sindoor. The Lok Sabha took up the issue yesterday and the Rajya Sabha debate began today. Stay tuned to IndiaToday.in as we bring you the latest updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/exclusive-first-pics-of-two-pahalgam-attackers-who-were-killed-in-op-mahadev-2762986-2025-07-29",
      "headline": "First photos of two Pahalgam attackers who were killed in Operation Mahadev Both were Pakistani nationals and were gunned down during a joint forces operation in Srinagar on Monday. Hashim Musa, top Lashkar-e-Taiba (LeT) commander who was named top conspirator and executor of the Pahalgam attack, was also gunned down during the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-gautam-gambhir-vs-oval-pitch-curator-lee-fortis-2763022-2025-07-29",
      "headline": "Video: Gautam Gambhir involved in fiery verbal spat with Oval pitch curatorIndia head coach Gautam Gambhir picked up a massive fight with The Oval pitch curator on India's first practice session ahead of the final Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/m9-ak-47-rifle-operation-mahadev-bullet-matching-confirmed-used-pahalgam-massacre-amit-shah-parliament-forensic-2762950-2025-07-29",
      "headline": "How bullet-matching confirmed M-9, AK-47s used in Pahalgam massacreA ballistic match has confirmed the exact weapons, an M-9 and two AK-47 rifles recovered from the three terrorists, were the ones used in the April 22 Pahalgam massacre. Bullet shells from the Pahalgam site matched those test-fired from the guns at the forensic laboratory in Chandigarh, revealed Home Minister Amit Shah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-just-yesterday-akhilesh-yadav-questions-timing-of-op-mahadev-in-which-pahalgam-attackers-were-killed-2762992-2025-07-29",
      "headline": "Why were terrorists killed yesterday? Akhilesh Yadav questions Op Mahadev timingAkhilesh Yadav smelt a political motive behind the timing of the operation, viewing it as an attempt to blunt the opposition's attack on the government over the Pahalgam attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/senior-citizen-doctor-defrauded-19-crore-gujarat-digital-scam-2762691-2025-07-28",
      "headline": "Rs 19 crore gone in 3 months: Doctor loses life's savings in digital arrest scamA senior doctor in Gandhinagar was digitally arrested and defrauded of Rs 19 crore over three months by scammers impersonating officials. Acting on a complaint, police arrested an accused in Surat, where Rs 1 crore was found in his bank account. An investigation to uncover the entire network is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-jagdeep-dhankhars-exit-as-vice-president-will-have-little-impact-on-bjp-2762486-2025-07-28",
      "headline": "Why Jagdeep Dhankhar's exit as vice-president will have little impact on BJPObservers believe Dhankhar was aptly rewarded for all that he might have done for the BJP. Few in the party are shedding public tears for him"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-rajesh-khanna-death-64-unopened-suitcases-were-found-at-his-home-aashirwaad-2762973-2025-07-29",
      "headline": "64 unopened suitcases with gifts were found at Rajesh Khanna's home after deathIn the end, it wasn't just the stardom Rajesh Khanna left behind, but the silence of unopened suitcases. Perhaps also the echoes of a life that longed to connect, yet chose solitude. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-pm-modi-silent-when-trump-admitted-india-pak-truce-29-times-mallikarjun-kharge-operation-sindoor-2763039-2025-07-29",
      "headline": "Why silent when Trump claimed Sindoor truce 29 times: Mallikarjun Kharge targets PMCongress President Mallikarjun Kharge on Tuesday questioned Prime Minister Narendra Modi's silence on former US President Donald Trump's repeated claims of using trade to broker peace between India and Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-delta-pilot-arrested-from-aircraft-on-child-sex-abuse-charges-2762976-2025-07-29",
      "headline": "Indian-origin Delta pilot arrested from aircraft on child sex abuse chargesAccording to an official statement, detectives from the Sheriff's Investigation Division have been working on the case since April 2025, after receiving a report of child sexual abuse. A Ramey arrest warrant was subsequently secured for the suspect, identified as 34-year-old Rustom Bhagwagar of Florida."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-parliament-batla-house-encounter-salman-khurshid-sonia-gandhi-tears-rahul-dare-2762975-2025-07-29",
      "headline": "Batla House, Sonia Gandhi's 'tears', dare for Rahul: Amit Shah's fiery speechAmit Shah asserted that armed forces under the BJP regime managed to kill the Pahalgam attackers within 3 months, and questioned the action taken against terrorists by the UPA."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rain-leads-to-waterlogging-in-parts-of-city-airlines-issue-advisory-2762848-2025-07-29",
      "headline": "Heavy rain batters Delhi-NCR, red alert issued amid waterlogging, flight ops hitWaterlogging was reported in several parts of Delhi, slowing down traffic and affecting movement. Visuals shared by news agency ANI showed commuters wading through rain-hit roads, highlighting the impact of the downpour across the city."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parliament-priyanka-gandhi-tears-into-centre-over-pahalgam-attack-left-people-at-gods-mercy-2763040-2025-07-29",
      "headline": "Left people at God's mercy: Priyanka Gandhi tears into Centre over Pahalgam attackThe Congress leader further questioned intelligence failure and asked, \"Was no government agency in the know that such a dastardly terror attack is going to happen, and a plot is being hatched in Pakistan?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanction-hit-nayara-turns-to-rediff-after-microsoft-suspension-report-2762966-2025-07-29",
      "headline": "EU-sanctioned refiner Nayara turns to Rediff after Microsoft suspension: ReportThe shift comes in the wake of fresh European Union sanctions announced on July 18 that targeted Nayara for its links to Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-cm-siddaramaiah-rs-50-crore-grant-meeting-with-congress-mlas-dcm-dks-left-out-rift-2762866-2025-07-29",
      "headline": "Unwell or sidelined? Shivakumar left out from Siddaramaiah's meetings with MLAsChief Minister Siddaramaiah convened a meeting with Congress MLAs to discuss Rs 50 crore constituency grants. Deputy Chief Minister DK Shivakumar was excluded, triggering renewed concerns over their strained relationship within party circles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/rohit-bal-show-india-couture-week-2025-ends-with-party-on-ramp-2762859-2025-07-29",
      "headline": "Gudda would've danced too: Rohit Bal show ends with party on rampNine months after the passing of legendary designer Rohit Bal, his label took its first step forward with the unveiling of a new collection, Kash Gul, at the ongoing India Couture Week 2025. As the show ended, the ramp turned into a party, with models and audiences twirling, rejoicing, and remembering Gudda's true spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sleep-peacefully-operation-mahadev-soothes-some-pahalgam-april-22-terror-attack-pain-family-survivors-2762993-2025-07-29",
      "headline": "The 26 will get peace, we'll be able to sleep: Op Mahadev soothes some Pahalgam painThe trauma the survivors of the Pahalgam attack are going through is unimaginable. Women who saw their husbands and fathers being shot down in front of them have commended Operation Mahadev, in which three terrorists who carried out the Pahalgam massacre were killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-debate-operation-sindoor-congress-mp-deepender-singh-hooda-mcdonalds-potato-sushma-swaraj-2762863-2025-07-29",
      "headline": "Donald, McDonald's and Deepender Hooda's 2-foot potatoCongress MP Deepender Singh Hooda delivered two speeches 13 years apart, with one common thread: McDonald's. The only takeaway is a sharp U-turn. From offering 24-inch potatoes to McDonald's, Hooda called for a ban, simply because the name reminds him of Donald Trump, whom he doesn't seem to like."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bjps-new-renaming-call-in-bhopal-has-a-pakistan-angle-why-the-row-2762474-2025-07-28",
      "headline": "BJP's new renaming call in Bhopal has a Pakistan angle: Why the row?The demand is over Hamidia Hospital and Hamidia College, named after Hamidullah Khan, the last Nawab of Bhopal accused by some BJP leaders of being pro-Pakistan\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-tulsi-virani-new-look-gaurang-shah-2762830-2025-07-29",
      "headline": "Kyunki reboot is here and Tulsi's new look is pure nostalgia, reimaginedTulsi Virani is back, redefined, regal, and ready for a new era. Catch Smriti Irani's iconic return in the 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot, tonight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-mla-t-udhayasuriyan-under-fire-for-saying-poda-to-man-questioning-road-conditions-2762823-2025-07-29",
      "headline": "DMK MLA under fire for saying 'poda' to resident questioning road conditionsDuring a state-wide campaign in Tamil Nadu's Kallakurichi, DMK MLA Udhayasuriyan was caught on camera dismissing a local resident with \"poda\" and threatening beatings when questioned about the lack of proper roads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bird-lands-on-goa-minister-shoulder-as-pm-talks-about-birds-in-mann-ki-baat-viral-video-2762893-2025-07-29",
      "headline": "Video: Bird lands on Goa Minister's shoulder as PM talks about birds in Mann Ki BaatGoa Tourism Minister Rohan Khaunte was listening to the PM's monthly radio programme on Sunday when a bird casually perched itself on his shoulder just as the PM was talking about birds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/played-vital-role-in-eliminating-cowardly-terrorists-pm-on-op-mahadev-in-which-3-jk-attackers-were-killed-2763004-2025-07-29",
      "headline": "Remarkable speech: PM Modi praises Amit Shah's Parliament address on Op MahadevPM Modi praised Amit Shah's speech in Parliament and said both Operation Mahadev and Operation Sindoor played a vital role in eliminating cowardly terrorists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shivaraj-kumar-supports-ramya-social-media-harassment-complaint-2763009-2025-07-29",
      "headline": "Shiva Rajkumar condemns online abuse against Ramya, expresses supportActor Shiva Rajkumar and his wife, Geetha, condemned online harassment against actor-politician Ramya. They emphasised that social media should be used for one's growth and not to hurl abuses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-and-jr-ntr-to-unite-for-war-2-pre-release-event-in-vijayawada-2762960-2025-07-29",
      "headline": "Hrithik Roshan and Jr NTR to attend War 2 pre-release event in VijayawadaActors Hrithik Roshan and Jr NTR will make a joint appearance to promote the much-anticipated film 'War 2'. They will be seen at the film's pre-release event in Vijayawada on August 10. 'War 2' is scheduled for a theatrical release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-completes-climax-shoot-ustaad-bhagat-singh-amid-political-duties-2762958-2025-07-29",
      "headline": "Pawan Kalyan wraps up Ustaad Bhagat Singh climax shoot amid busy schedulePawan Kalyan has wrapped up the shooting of climax of 'Ustaad Bhagat Singh'. The production house praised his dedication and hard work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-visits-gurudwara-with-rumoured-boyfriend-arjun-bajwa-2762972-2025-07-29",
      "headline": "Sara Ali Khan visits Gurudwara with rumoured boyfriend Arjun Pratap BajwaSara Ali Khan was recently seen leaving a Mumbai Gurudwara with rumoured boyfriend Arjun Pratap Bajwa, sparking fresh dating rumours. While the two didn't pose together, their joint appearance quickly grabbed fans' attention online."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/divya-deshmukh-chess-world-cup-title-2763013-2025-07-29",
      "headline": "Divya Deshmukh's World Cup title: A testament to India's massive strengthDivya Deshmukh's World Cup win underlines the depth of Indian chess across all categories — open, junior, and now women's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-odi-rankings-smriti-mandhana-no1-batter-nat-sciver-brunt-2763031-2025-07-29",
      "headline": "Smriti Mandhana displaced as No.1 ODI batter after ENG vs IND seriesSmriti Mandhana's stint as the No.1 ODI batter in the ICC Rankings came to an end on Tuesday, July 29 as Nat Sciver-Brunt displaced her from the position. Mandhana scored 115 runs in three matches against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-gautam-gambhir-vs-oval-pitch-curator-lee-fortis-2763022-2025-07-29",
      "headline": "Video: Gautam Gambhir involved in fiery verbal spat with Oval pitch curatorIndia head coach Gautam Gambhir picked up a massive fight with The Oval pitch curator on India's first practice session ahead of the final Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-squad-jasprit-bumrah-mohammed-shami-aakash-chopra-2762987-2025-07-29",
      "headline": "Bumrah availability a doubt, No Shami: Aakash Chopra on India's Asia Cup squadAakash Chopra expresses doubts over Jasprit Bumrah's participation in the Asia Cup 2025. He also feels Mohammed Shami will not be included in the Indian squad due to fitness and selection concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jerseys-stolen-bcci-office-security-guard-arrested-2762962-2025-07-29",
      "headline": "IPL 2025 jerseys worth 6.5 lakh rupees stolen from BCCI office: ReportIPL 2025 jerseys worth 6.5 lakh rupees were stolen from BCCI's Mumbai office by a security guard. The theft was done to fund the guard's online gambling addiction, and the man has been apprehended for the crime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-india-vs-england-manchester-draw-dale-steyn-2762937-2025-07-29",
      "headline": "Steyn plays Devil's advocate, but did India really stretch the draw too far?The cricketing fraternity continues to dissect the final hour of the Manchester Test, where India's decision to bat deep despite a certain draw has sparked debate. Was it grit or a stretch too far in pursuit of individual glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-cricket-crisis-shai-hope-2762907-2025-07-29",
      "headline": "Shai Hope admits Windies 'never gave themselves a chance' vs AustraliaWest Indies vs Australia: Captain Shai Hope was left distraught after losing the final T20I match of the series. West Indies were blanked 0-5 in the T20I leg, after being blanked 0-3 in the red ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-florian-wirtz-reaction-arne-slot-2762901-2025-07-29",
      "headline": "Joining Liverpool was an easy decision to make: Florian WirtzFlorian Wirtz said it was an easy decision for him to make the switch to Liverpool as he became the club's record transfer. Wirtz made the switch from Bayer Leverkusen for a reported 100 million pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-india-vs-england-selection-playing-xi-2762879-2025-07-29",
      "headline": "Gambhir defiant despite trailing vs England: Quality of cricket made India proudIndia head coach Gautam Gambhir remains defiant despite India trailing 1-2 in the England Test series. Gambhir has said that the kind of cricket that both teams have played, would have made every cricket lover proud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-ben-stokes-matthew-hoggard-warning-2762870-2025-07-29",
      "headline": "Stokes, England given warning by 2005 Ashes hero: Can't go to Oval for a draw2005 Ashes hero Matthew Hoggard sent a warning to Ben Stokes and England ahead of the Oval Test, saying that the team shouldn't go into the match against India thinking that they can get a draw and win the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-ajinkya-rahane-gautam-gambhir-2762835-2025-07-29",
      "headline": "Ajinkya Rahane flags major concern for India ahead of final Test matchFormer captain Ajinkya Rahane has flagged a major concern for the Indian Test team going into the final Test match of the series. Rahane believes that the Indian bowling unit has failed to turn up as a group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-cricket-crisis-shai-hope-2762907-2025-07-29",
      "headline": "Shai Hope admits Windies 'never gave themselves a chance' vs AustraliaWest Indies vs Australia: Captain Shai Hope was left distraught after losing the final T20I match of the series. West Indies were blanked 0-5 in the T20I leg, after being blanked 0-3 in the red ball format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-florian-wirtz-reaction-arne-slot-2762901-2025-07-29",
      "headline": "Joining Liverpool was an easy decision to make: Florian WirtzFlorian Wirtz said it was an easy decision for him to make the switch to Liverpool as he became the club's record transfer. Wirtz made the switch from Bayer Leverkusen for a reported 100 million pounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-india-vs-england-selection-playing-xi-2762879-2025-07-29",
      "headline": "Gambhir defiant despite trailing vs England: Quality of cricket made India proudIndia head coach Gautam Gambhir remains defiant despite India trailing 1-2 in the England Test series. Gambhir has said that the kind of cricket that both teams have played, would have made every cricket lover proud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-ben-stokes-matthew-hoggard-warning-2762870-2025-07-29",
      "headline": "Stokes, England given warning by 2005 Ashes hero: Can't go to Oval for a draw2005 Ashes hero Matthew Hoggard sent a warning to Ben Stokes and England ahead of the Oval Test, saying that the team shouldn't go into the match against India thinking that they can get a draw and win the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-ajinkya-rahane-gautam-gambhir-2762835-2025-07-29",
      "headline": "Ajinkya Rahane flags major concern for India ahead of final Test matchFormer captain Ajinkya Rahane has flagged a major concern for the Indian Test team going into the final Test match of the series. Rahane believes that the Indian bowling unit has failed to turn up as a group."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}