{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-house-bank-loan-emi-burden-expert-explains-drawabacks-2760148-2025-07-23",
      "headline": "Explained: Why buying flats on hefty EMIs may not be wiseAs returns from residential real estate continue to underwhelm, financial advisors are urging Indians to rethink the emotional appeal of homeownership and consider smarter, more flexible investment avenues for long-term wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-aspiration-to-achievement-paytms-operational-discipline-powers-profitability-2760125-2025-07-23",
      "headline": "From aspiration to achievement: Paytm's operational discipline powers profitabilityThe new stock pricing implies that the Noida-based firm will be valued at 63-times of FY27-ended earnings. This revised valuation reflects the brokerage's positive view of Paytm's structural profitability journey, operating leverage, and robust performance in its core business segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-540-points-nifty-settles-above-25200-tata-motors-bharti-airtel-rally-over-2-2760104-2025-07-23",
      "headline": "Sensex up 540 points, Nifty tops 25,200; Tata Motors, Airtel gain over 2%The S&P BSE Sensex rose 539.83 points to 82,726.64 at the closing bell, while the NSE Nifty50 settled 159 points higher at 25,219.90. Most of the broader market indices also gained during the trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-files-rs-1654-crore-case-against-myntra-over-fdi-violations-2760042-2025-07-23",
      "headline": "ED files Rs 1,654-crore case against Myntra over FDI violationsThe investigation comes at a time when e-commerce firms operating in India, particularly those backed by foreign investment, are facing increasing regulatory scrutiny for allegedly bypassing FDI rules through complex business arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/indiqube-spaces-ipo-review-skip-subscribe-latest-gmp-listing-date-allotment-price-band-2760007-2025-07-23",
      "headline": "Indiqube Spaces IPO: Should you invest? Check GMP and review by expertsIndiqube Spaces is aiming to raise Rs 700 crore through this IPO. The issue includes a fresh issue of 2.74 crore shares worth Rs 650 crore and an offer for sale of 21 lakh shares valued at Rs 50 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-luxury-real-estate-market-hits-rs-14750-crore-sales-2759986-2025-07-23",
      "headline": "Mumbai's luxury real estate market hits Rs 14,750 crore salesEven as affordability worsens for the middle class, Mumbai's luxury real estate market continues to soar, fuelled by billionaires, upgraders and a fresh pipeline of designer residences in coveted neighbourhoods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sri-lotus-developers-ipo-review-shah-rukh-khan-amitabh-bachchan-bollywood-celebrities-2759947-2025-07-23",
      "headline": "SRK and Big B back this IPO: All you need to know about Sri Lotus DevelopersOther celebrities, including Hrithik Roshan, Ajay Devgn, Ektaa Kapoor, Sara Ali Khan, Tiger Shroff, and Rajkummar Rao have also invested in the firm as per reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-abhishek-walia-explains-why-timing-your-investments-matters-as-much-as-diversifying-2759920-2025-07-23",
      "headline": "CA explains why timing your investments matters as much as diversifyingCA explains that good investing isn't just about picking the right assets, it's about planning for the right moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-posts-rs-123-crore-profit-in-q1-is-it-a-good-time-to-buy-the-stock-2759902-2025-07-23",
      "headline": "Paytm posts Rs 123 crore profit in Q1: Is it a good time to buy the stock?Paytm's Q1 profit signals a turning point, but long-term sustainability hinges on regulatory clarity, competitive strength, and consistent execution across payments and lending. Investors must weigh promise against real-world pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/deepinder-goyal-net-worth-rs-2000-crore-rise-eternal-shares-rise-record-high-2759886-2025-07-23",
      "headline": "Deepinder Goyal adds Rs 2,000 crore as Eternal shares hit record highShares of Eternal jumped over 21% in the last 48 hours, hitting a new record high of Rs 311.60 on the NSE on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-over-200-points-up-nifty-above-25100-infosys-gains-1-2759880-2025-07-23",
      "headline": "Sensex, Nifty open higher after US-Japan trade deal; Tata Motors leads gainsThe S&P BSE Sensex was up by 201.98 points to 82,388.09, while the NSE Nifty50 gained 63 points to 25,123.90 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-july-23-us-japan-trade-deal-15-percent-tariff-2759869-2025-07-23",
      "headline": "Will US-Japan trade deal weigh in on Sensex, Nifty today?Gift Nifty futures were trading at 25,181.50 as of 8:30 am, indicating that the Nifty 50 may open above Tuesday's close of 25,060.90."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-doctor-salvador-plasencia-pleads-guilty-supply-ketamine-friends-tv-show-star-matthew-perry-death-2760361-2025-07-23",
      "headline": "US doctor pleads guilty to supplying ketamine to Friends star Matthew PerryDoctor Salvador Plasencia pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks leading up to the actor's overdose death. He is the fourth of five accused to admit guilt in the case.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/none-of-us-owned-a-house-or-car-smriti-irani-on-how-kyunki-saas-bhi-kabhi-bahu-thi-reboot-2760244-2025-07-23",
      "headline": "None of us owned a house or car: Smriti Irani on how Kyunki built livesActor-politician Smriti Irani spoke about her return to television with the reboot of her popular show, 'Kyunki Saas Bhi Kabhi Bahu Thi'. In her exclusive interaction with Aaj Tak, Irani also shed light on the evolving landscape of television and female-led content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-promo-faith-will-roar-song-epic-track-b-praak-soulful-vocals-divine-cinematic-universe-2760280-2025-07-23",
      "headline": "Faith Will Roar promo: Mahavatar Narsimha's epic track has B Praak's soulful vocalsThe divine 'Faith Will Roar' promo from the upcoming epic 'Mahavatar Narsimha' has been released. B Praak's vocals and captivating visuals depict Lord Vishnu's fierce incarnation from the divine cinematic universe.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/boys-planet-ii-contestant-under-fire-hate-posts-about-bts-jungkook-2760289-2025-07-23",
      "headline": "Contestant from Boys Planet II slammed for Jungkook hate postsAs soon as trainee Peng Jin Yu was revealed on Mnet's 'Boys Planet II' fans resurfaced his past hate-filled posts. They were aimed at BTS' Jungkook and members of TWICE and Aespa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neetu-kapoor-throwback-photo-rishi-kapoor-riddhima-kapoor-sahni-2760203-2025-07-23",
      "headline": "Neetu Kapoor shares cute pic of Rishi and baby RiddhimaNeetu Kapoor gave her social media followers a nostalgic moment by sharing a rare photo of Rishi Kapoor with their daughter Riddhima Kapoor Sahni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-part-1-urmila-surabhi-das-most-expensive-indian-film-budget-4000-crore-not-deepika-padukone-alia-bhatt-2760245-2025-07-23",
      "headline": "Meet Assamese actor who is all set to feature in India's first Rs 4000 crore epicAn actor known for featuring in television shows is all set to make her Bollywood debut in India's most expensive film series. From television roles to playing an iconic epic character, this actor is not Mouni Roy, Tejasswi Prakash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/one-piece-voice-actors-kappei-yamaguchi-hiroaki-hirata-on-india-hindi-dub-desi-fans-anime-2760028-2025-07-23",
      "headline": "One Piece Voice Actors Kappei Yamaguchi & Hiroaki Hirata on India, Hindi Dub & Desi Fans | AnimeIn this exclusive interview, India Today's Bhavna Agarwal chats with legendary Japanese voice actors Kappei Yamaguchi (Usopp) and Hiroaki Hirata (Sanji) during their special visit to India! 🇯🇵🇮🇳 Watch as the voices behind two of One Piece's most iconic character share their excitement about meeting Indian fans, talk about the anime's massive popularity in India and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/archana-puran-singh-recalls-shah-rukh-khan-and-hrithik-roshan-making-funny-remarks-about-her-sons-2760053-2025-07-23",
      "headline": "Archana Puran Singh recalls SRK and Hrithik Roshan's funny remarks about her sonsActor Archana Puran Singh shared a funny throwback from Aryan Khan's birthday party where Shah Rukh Khan and Hrithik Roshan jokingly compared her sons' Aaryamann and Ayushmann Sethi's features to their own. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-review-vanessa-kirby-pedro-pascal-best-marvel-film-2760159-2025-07-23",
      "headline": "The Fantastic Four First Steps first reviews: Best MCU film of decade, say criticsThe first set of reviews of Marvel's 'The Fantastic Four: First Steps' is out. The upcoming sci-fi action-adventure introduces Marvel's First Family with a new twist."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-passes-away-one-last-gig-before-passing-was-metal-to-the-core-black-sabbath-heavy-metal-music-2760246-2025-07-23",
      "headline": "Ozzy Osbourne's primal, mournful wail shaped India's underground metalOzzy Osbourne, the Black Sabbath frontman, never performed in India, but his voice shaped its metal underground, as it influenced the Big Four of heavy metal. As the Prince of Darkness took his final bow, fans from England to India raised their horns in tribute."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-says-he-would-quit-acting-if-he-had-steady-income-exclusive-2760268-2025-07-23",
      "headline": "I'd quit acting if I had steady income: Pawan Kalyan on balancing films, politicsPawan Kalyan opened up about his struggle balancing films and politics, saying his heart has always been with public service. He also admitted that if he had a steady income, he would quit acting to focus solely on politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-gen-z-heartbreak-movie-mohit-suri-romance-music-2760099-2025-07-23",
      "headline": "Why is Saiyaara Gen Z's Aashiqui 2'Saiyaara' is emerging as Gen Z's answer to the iconic millennial heartbreak film 'Aashiqui 2'. The film's sincere portrayal of love and emotional depth is sparking a cultural moment among young audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rajkummar-rao-begin-ujjwal-nikam-shooting-in-august-2760077-2025-07-23",
      "headline": "Rajkummar Rao to begin Ujjwal Nikam shooting in August: ReportRajkummar Rao is set to headline a courtroom drama inspired by the 26/11 Mumbai terror attack trial, portraying renowned public prosecutor Ujjwal Nikam. The film, directed by Avinash Arun and produced by Maddock Films, will focus on the intense legal battle against Ajmal Kasab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khushi-kapoor-vedang-raina-pick-sides-the-summer-i-turned-pretty-debate-2760076-2025-07-23",
      "headline": "Khushi and Vedang pick sides in the ultimate The Summer I Turned Pretty debateTeam Conrad or Team Jeremiah? Khushi Kapoor and Vedang Raina choose their sides in the latest video. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanvi-the-great-film-tax-free-delhi-madhya-pradesh-inclusion-resilience-2760259-2025-07-23",
      "headline": "After Madhya Pradesh, Anupam Kher's Tanvi The Great declared tax-free in DelhiDelhi government has declared Anupam Kher's directorial, 'Tanvi the Great', tax-free. Earlier, Madhya Pradesh Chief Minister Dr Mohan Yadav declared the film tax-free in his state. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanushree-dutta-slams-claims-staying-in-limelight-over-harassment-metoo-allegations-nana-patekar-bollywood-2760081-2025-07-23",
      "headline": "Tanushree Dutta slams trolls accusing her of seeking limelight amid harassment claimsActor Tanushree Dutta's emotional video alleging harassment at her home sparked mixed reactions and trolling. She reacted to a social media user claiming she was trying to stay in the limelight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-on-having-bulletproof-balcony-says-fans-would-climb-and-sleep-there-2760189-2025-07-23",
      "headline": "Salman Khan shares why he has bulletproof balcony: Fans would climb and sleep thereAfter facing death threats and a firing incident at his Bandra home, Salman Khan has installed bulletproof glass on his balcony for safety. The actor shared that he took the step not just due to threats but also because fans would sometimes climb up or even sleep on his balcony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-old-dubsmash-videos-resurface-saiyaara-success-fans-call-him-ranbir-kapoor-20-2760014-2025-07-23",
      "headline": "Ahaan Panday's old videos resurface amid Saiyaara success, fans call him Ranbir 2.0Ahaan Panday's debut film 'Saiyaara' is a huge hit, and fans are loving his performance. His old Dubsmash videos have gone viral again, with many calling him 'Ranbir  Kapoor 2.0'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-shares-behind-the-scenes-photos-from-aap-jaisa-koi-sets-with-director-vivek-soni-2760230-2025-07-23",
      "headline": "Fatima Sana Shaikh shares BTS pics from Aap Jaisa Koi sets with directorFatima Sana Shaikh shared behind-the-scenes photos from 'Aap Jaisa Koi' and wrote a heartfelt note thanking director Vivek Soni for trusting her with the role of Madhu. The Netflix film, co-starring R Madhavan, explores love, companionship, and breaking societal norms."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-tried-to-persuade-vice-president-jagdeep-dhankhar-thrice-but-he-acted-alone-on-justice-varma-impeachment-motion-2760303-2025-07-23",
      "headline": "How power-tripping Dhankhar became a thorn in Centre's sideFollowing Dhankhar's sudden decision to accept the Opposition's motion in the House without the NDA government's approval, PM Modi huddled with his top aides, including the Home Minister. PM Modi reportedly expressed deep disappointment over the Vice President's conduct given that he was the NDA's candidate for the post in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/smriti-irani-exclusive-interview-amethi-elections-attacks-on-rahul-gandhi-2760304-2025-07-23",
      "headline": "Why chase someone who won't fight: Smriti Irani's 'tone shift' on Rahul GandhiSmriti Irani said that the Gandhi family moved to contest from Wayanad due to its favourable social demographics. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/hospital-sent-wrong-bodies-of-air-india-crash-victims-to-families-in-uk-ahmedabad-dreamliner-boeing-787-britain-2760033-2025-07-23",
      "headline": "UK family receives wrong body of Air India crash victim, cancels funeralA lawyer representing the relatives of the victims of the Air India crash of June 12 has claimed that wrong remains were sent to two families in the UK. Sources said the remains were sent by a government hospital in Ahmedabad in sealed coffins, and Air India had no role in the mix-up. India said victims were identified in accordance with established protocols. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-india-vs-england-4th-test-day-1-match-report-2760341-2025-07-23",
      "headline": "India's gritty start undone after nasty injury to Rishabh PantIndia's gritty start to the Manchester Test match was undone by a nasty injury to Rishabh Pant late in the final session. Pant, who might have broken his foot, is likely to be ruled out of this Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/jagdeep-dhankhar-resignation-real-story-wife-sudesh-dhankhar-heart-of-the-matter-vice-president-2760176-2025-07-23",
      "headline": "The Heart of the Matter: The Real Story Behind Jagdeep Dhankhar's ResignationAs theories float on why Jagdeep Dhankhar resigned from the Vice-President's post, here's the story that reveals what's at the heart of the surprising move. Written not with a hand-on-heart approach.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kyunki-saas-bhi-kabhi-bahu-thi-smriti-irani-answers-is-there-more-acting-in-politics-or-more-politics-in-acting-2760288-2025-07-23",
      "headline": "Is there more acting in politics or more politics in acting? Smriti Irani answersSmriti Irani, who announced her return to the small screen with Kyunki Saas Bhi Kabhi Bahu Thi, was asked whether there is more acting in politics or more politics in acting. In response, the former Union Minister said that the struggle is real for someone like her who stepped into politics without any backing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/ktaka-rto-rolls-royce-cars-bollywood-actors-amitabh-bachchan-aamir-khan-fined-tax-evasion-kgf-babu-rs-38-lakh-bengaluru-2760310-2025-07-23",
      "headline": "Rolls-Royce cars once owned by Big B, Aamir Khan fined Rs 38 lakh in BengaluruTwo Rolls-Royce cars, previously owned by Bollywood stars Amitabh Bachchan and Aamir Khan, are now at the centre of a tax evasion fine issued to the current owner of the cars, 'KGF Babu'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/tail-fire-runway-skid-the-symbolism-in-air-indias-safety-slip-ups-2760200-2025-07-23",
      "headline": "Tail fire, runway skid: The symbolism in Air India's safety slip-upsFor the embattled airline still reeling from the Ahmedabad crash, building safety, efficiency and trust may take much more than a fleet of new planes or a lick of fresh paint"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/harshvardhan-jain-fake-embassy-ghaziabad-londonia-envoy-up-2760264-2025-07-23",
      "headline": "The curious case of 'Londonia envoy': Inside UP man's fake embassy racketHarshvardhan Jain ran a fake embassy in Ghaziabad, posed as envoy of fictional nations, used fake documents and cars to dupe people with job, business promises. Read on to know more about him and his operation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-retired-hurt-foot-blow-manchester-test-2760329-2025-07-23",
      "headline": "Manchester Test: Rishabh Pant suffers foot injury, carried off on golf cartIndia vs England: India wicketkeeper Rishabh Pant was taken off the field after being struck on the foot during the opening day of the Manchester Test. Pant is unlikely to take further part in the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-al-qaeda-terrorists-planning-high-profile-attacks-in-india-arrested-from-3-states-2760174-2025-07-23",
      "headline": "Al Qaeda cell busted, 4 terror suspects arrested from 3 cities; had links to PakAged between 20 and 25, the four terror suspects — who were reportedly assigned major targets — were arrested from Gujarat, Delhi, and Noida in Uttar Pradesh. They were tasked with carrying out attacks at high-profile locations across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/none-of-us-owned-a-house-or-car-smriti-irani-on-how-kyunki-saas-bhi-kabhi-bahu-thi-reboot-2760244-2025-07-23",
      "headline": "None of us owned a house or car: Smriti Irani on how Kyunki built livesActor-politician Smriti Irani spoke about her return to television with the reboot of her popular show, 'Kyunki Saas Bhi Kabhi Bahu Thi'. In her exclusive interaction with Aaj Tak, Irani also shed light on the evolving landscape of television and female-led content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/un-world-court-urges-nations-to-act-on-the-existential-threat-of-climate-change-2760353-2025-07-23",
      "headline": "Countries must act on climate or face legal action: UN court's landmark rulingThe opinion by the ICJ, also known as the World Court, was immediately welcomed by environmental groups. Legal experts said it was a victory for small island and low-lying states that had asked the court to clarify states' responsibilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/smriti-irani-on-bollywoods-silence-on-operation-sindoor-dont-watch-them-if-it-hurts-you-2760290-2025-07-23",
      "headline": "Smriti Irani on Bollywood's silence on Op Sindoor: Don't watch them if you're hurtAmid criticism of Bollywood's silence during Operation Sindoor, Smriti Irani said the nation's support for the Army shouldn't be measured by celebrity statements, as ordinary citizens and Parliament stood firmly with the forces. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ap-deputy-cm-pawan-kalyan-backs-hindi-as-necessity-says-no-language-should-be-imposed-on-anyone-2760238-2025-07-23",
      "headline": "Hatred for Modi being transferred onto Hindi: Pawan Kalyan on language rowSpeaking on language politics, Pawan Kalyan said no language should be imposed, stressing the importance of national integrity and calling Hindi a necessity in southern states bordering Hindi-speaking regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-cost-of-convenience-what-we-lost-to-10-minute-deliveries-2759963-2025-07-23",
      "headline": "The cost of convenience: What we lost to 10-minute deliveriesSure, instant delivery apps bring the world to your doorstep. But convenience comes at a cost - and it's not what you pay, it's what you miss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/will-mamata-banerjees-new-peoples-governance-plan-translate-into-poll-advantage-2760210-2025-07-23",
      "headline": "Will Mamata's new people's governance plan translate into poll advantage?The underlying strategy of 'Amader Para, Amader Samadhan' reinforces the TMC's booth-level control, a tactic crucial to its electoral game plan"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sowjanya-rape-murder-case-sparked-dharmasthala-outrage-13-years-ago-cid-cbi-karnataka-sit-2759404-2025-07-23",
      "headline": "Sowjanya rape-murder: Case that first sparked Dharmasthala outrage 13 years agoAllegations of mass burials of women who were raped and murdered in Dharmasthala, a popular temple town in Karnataka, have resulted in an SIT investigating the case. Over a decade ago, the rape-murder of 17-year-old Sowjanya in Dharmasthala sparked massive outrage in Karnataka but the case remains unsolved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/will-cuet-become-the-jee-of-non-stem-courses-its-already-acting-like-one-2760228-2025-07-23",
      "headline": "Will CUET become the JEE of non-STEM courses? It's already acting like oneCUET is reshaping how India admits students to non-STEM courses in college. But as cut-offs soar and coaching pressure builds, is this test levelling the field -- or building a new kind of race?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/does-raj-in-yash-raj-films-stand-for-rajesh-khanna-the-story-of-a-partnership-that-was-not-2760222-2025-07-23",
      "headline": "Does 'Raj' in Yash Raj Films stand for Rajesh Khanna? The partnership that wasn't Rajesh Khanna and Yash Chopra collaborated on two films - 'Ittefaq' and 'Daag' - before their legendary fallout. Both the films worked well, but despite the success of their partnership, the two didn't team for over a decade. 'Dark Star' by Gautam Chintamani narrates an interesting incident that might change the way you look at Yash Raj Films. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-cm-himanta-biswa-sarma-online-arms-licence-portal-indigenous-communities-illegal-immigrant-deportation-2760273-2025-07-23",
      "headline": "Assam going online to arm indigenous people amid eviction driveA portal will be inaugurated in August that will help indigenous people staying in vulnerable areas get arms licences, says Assam chief minister Himanta Biswa Sarma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-targets-akhilesh-yadav-over-mosque-meeting-questions-wife-dimples-outfit-2760021-2025-07-23",
      "headline": "BJP targets Akhilesh Yadav over mosque meeting, questions wife Dimple's outfitBJP leader Jamal Siddiqui attacked the Samajwadi Party after several party leaders, including party chief AKhilesh Yadav and his wife Dimple Yadav, visited a mosque near the Parliament. Siddiqui accused the party of holding a political meeting inside a religious space and criticised Dimple Yadav for her attire. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-video-emerges-in-maharashtra-clinic-assault-shows-receptionist-slapped-first-2760237-2025-07-23",
      "headline": "New video emerges in Maharashtra clinic assault, shows receptionist slapped firstThe new released video shows the receptionist stepping out from behind her desk and slapping Jha's sister-in-law during a heated argument. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-doctor-salvador-plasencia-pleads-guilty-supply-ketamine-friends-tv-show-star-matthew-perry-death-2760361-2025-07-23",
      "headline": "US doctor pleads guilty to supplying ketamine to Friends star Matthew PerryDoctor Salvador Plasencia pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks leading up to the actor's overdose death. He is the fourth of five accused to admit guilt in the case.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-promo-faith-will-roar-song-epic-track-b-praak-soulful-vocals-divine-cinematic-universe-2760280-2025-07-23",
      "headline": "Faith Will Roar promo: Mahavatar Narsimha's epic track has B Praak's soulful vocalsThe divine 'Faith Will Roar' promo from the upcoming epic 'Mahavatar Narsimha' has been released. B Praak's vocals and captivating visuals depict Lord Vishnu's fierce incarnation from the divine cinematic universe.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/boys-planet-ii-contestant-under-fire-hate-posts-about-bts-jungkook-2760289-2025-07-23",
      "headline": "Contestant from Boys Planet II slammed for Jungkook hate postsAs soon as trainee Peng Jin Yu was revealed on Mnet's 'Boys Planet II' fans resurfaced his past hate-filled posts. They were aimed at BTS' Jungkook and members of TWICE and Aespa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neetu-kapoor-throwback-photo-rishi-kapoor-riddhima-kapoor-sahni-2760203-2025-07-23",
      "headline": "Neetu Kapoor shares cute pic of Rishi and baby RiddhimaNeetu Kapoor gave her social media followers a nostalgic moment by sharing a rare photo of Rishi Kapoor with their daughter Riddhima Kapoor Sahni."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sai-sudharsan-gives-update-on-rishabh-pants-injury-2760362-2025-07-23",
      "headline": "ENG vs IND: Sai Sudharsan provides update on Rishabh Pant's injury after Day 1India batter Sai Sudharsan gave an update on Rishabh Pant's injury after stumps on Day 1 of the fourth Test against England at Old Trafford in Manchester. Pant had to leave the field after injuring his right foot while batting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-fc-barcelona-marcus-rashford-signing-manchester-united-2760364-2025-07-23",
      "headline": "FC Barcelona announce Marcus Rashford loan signing from Manchester UnitedFC Barcelona have confirmed the loan signing of Marcus Rashford from Manchester United on Wednesday, July 23. Rashford joins on an initial season-long deal with Barcelona having an option to buy the forward permanently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/divya-deshmukh-stuns-tan-zhongyi-reaches-fide-womens-world-cup-final-2760350-2025-07-23",
      "headline": "Divya Deshmukh creates history, storms into FIDE Women's World Cup finalIndia's teenage chess sensation Divya Deshmukh reached the final of the FIDE Women's World Cup 2025 by defeating former World Champion Tan Zhongyi. Her historic win boosts India's chances of having two players in the prestigious Candidates tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-team-coach-role-shortlist-khalid-jamil-stephen-constantine-stefan-tarkovic-2760342-2025-07-23",
      "headline": "Jamil, Constantine shortlisted for Indian football team coach roleKhalid Jamil and Stephen Constantine are among the candidates shortlisted for the India men's football team coach role. The final decision will be made by the Executive Committee after reviewing all candidates' resumes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-india-vs-england-4th-test-day-1-match-report-2760341-2025-07-23",
      "headline": "India's gritty start undone after nasty injury to Rishabh PantIndia's gritty start to the Manchester Test match was undone by a nasty injury to Rishabh Pant late in the final session. Pant, who might have broken his foot, is likely to be ruled out of this Test series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-retired-hurt-foot-blow-manchester-test-2760329-2025-07-23",
      "headline": "Manchester Test: Rishabh Pant suffers foot injury, carried off on golf cartIndia vs England: India wicketkeeper Rishabh Pant was taken off the field after being struck on the foot during the opening day of the Manchester Test. Pant is unlikely to take further part in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-youth-test-ayush-mhatre-hundred-chelmsford-2760325-2025-07-23",
      "headline": "Ayush Mhatre slams fastest Youth Test century, gets to landmark in 64 balls vs EnglandAyush Mhatre entered his name in the history books as the India U-19 captain scored the fastest hundred in Youth Test history on Wednesday, July 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-asia-cup-meeting-rajeev-shukla-mohsin-naqvi-2760317-2025-07-23",
      "headline": "BCCI makes U-turn, set to attend Asia Cup meeting in Dhaka virtuallyThe BCCI has reversed its stance on boycotting the Asian Cricket Council meeting, set to be  held in Dhaka on Thursday. The BCCI has decided to attend the meeting virtually."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-first-ball-duck-youth-test-chelmsford-2760306-2025-07-23",
      "headline": "Suryavanshi faces rare failure, falls for first-ball duck in Youth TestA forgettable day for Vaibhav Suryavanshi who fell for a first-ball duck in the Youth Test at Chelmsford. Nonetheless, Ayush Mhatre seems to be in an aggressive mood despite the mammoth target to chase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-booed-by-english-crowd-in-manchester-2760298-2025-07-23",
      "headline": "Shubman Gill booed by English crowd in Manchester after Lord's bust upIndia captain Shubman Gill was booed by the English crowd, following his dismissal on Day 1 of the fourth Test against England at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-josh-tongue-released-from-squad-nottinghamshire-2760300-2025-07-23",
      "headline": "ENG vs IND: Josh Tongue released from England squad minutes after 4th Test startJust minutes after the start of the Manchester Test, Josh Tongue was released from the England squad for the series against India. Tongue will join Nottinghamshire for their ongoing county championship match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-youth-test-ayush-mhatre-hundred-chelmsford-2760325-2025-07-23",
      "headline": "Ayush Mhatre slams fastest Youth Test century, gets to landmark in 64 balls vs EnglandAyush Mhatre entered his name in the history books as the India U-19 captain scored the fastest hundred in Youth Test history on Wednesday, July 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-asia-cup-meeting-rajeev-shukla-mohsin-naqvi-2760317-2025-07-23",
      "headline": "BCCI makes U-turn, set to attend Asia Cup meeting in Dhaka virtuallyThe BCCI has reversed its stance on boycotting the Asian Cricket Council meeting, set to be  held in Dhaka on Thursday. The BCCI has decided to attend the meeting virtually."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-first-ball-duck-youth-test-chelmsford-2760306-2025-07-23",
      "headline": "Suryavanshi faces rare failure, falls for first-ball duck in Youth TestA forgettable day for Vaibhav Suryavanshi who fell for a first-ball duck in the Youth Test at Chelmsford. Nonetheless, Ayush Mhatre seems to be in an aggressive mood despite the mammoth target to chase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-booed-by-english-crowd-in-manchester-2760298-2025-07-23",
      "headline": "Shubman Gill booed by English crowd in Manchester after Lord's bust upIndia captain Shubman Gill was booed by the English crowd, following his dismissal on Day 1 of the fourth Test against England at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-josh-tongue-released-from-squad-nottinghamshire-2760300-2025-07-23",
      "headline": "ENG vs IND: Josh Tongue released from England squad minutes after 4th Test startJust minutes after the start of the Manchester Test, Josh Tongue was released from the England squad for the series against India. Tongue will join Nottinghamshire for their ongoing county championship match. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}