{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worlds-top-10-richest-donate-half-their-wealth-what-happens-global-poverty-healthcare-2864330-2026-02-07",
      "headline": "What happens if the world's 10 richest people donate half their wealth?A trillion dollars from the world's ten richest may stay theoretical, but imagine what becomes possible the moment you allow yourself to picture this group parting with half their wealth. In this story, we take you through what that world could actually look like. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-18-percent-reciprocal-tariffs-items-list-2864527-2026-02-07",
      "headline": "India–US trade deal: Decoding impact of lower 18% tariffs and duty-free boostIndian goods that were slammed with nearly 50% US tariffs last year will now face only 18%, and some key sectors even go duty-free. Here's how the interim pact changes the outlook for exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-interim-trade-deal-500-billion-products-tariff-trump-modi-washington-2864515-2026-02-07",
      "headline": "India to buy $500 billion of US goods in 5 years as new trade deal cuts tariffsIndia's USD 500 billion buying plan will anchor the interim trade framework, as New Delhi will cut tariffs on US goods and Washington will lower duties on Indian exports to 18 per cent under the proposed bilateral pact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-interim-trade-agreement-framework-key-points-benefits-explained-2864509-2026-02-07",
      "headline": "18% tariff, wider US market access: How India gains from trade pact with USIndia and the US have finally agreed on a framework for an interim trade agreement. In this article, we break down what it means and why it matters for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-framework-trump-tariffs-markets-open-lakhs-of-jobs-piyush-goyal-2864501-2026-02-07",
      "headline": "Tariffs to fall, markets to open, lakhs of jobs: Piyush Goyal on India-US dealThe agreement will see the US cut reciprocal tariffs on Indian goods to 18 per cent and eliminate duties on products such as generic pharmaceuticals, gems and diamonds, and aircraft parts, boosting export opportunities across key sectors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-india-release-framework-for-interim-trade-deal-2864482-2026-02-07",
      "headline": "India, US unveil interim trade pact; cut tariffs, open $30 trillion marketThe India-US trade deal marks a reset in trade ties, cutting Trump tariffs to 18 per cent and setting the stage for a sweeping bilateral deal amid geopolitical recalibrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-hit-historic-milestone-as-dow-jones-crosses-50000-points-for-first-time-ever-2864480-2026-02-07",
      "headline": "US stocks hit historic milestone as Dow crosses 50,000 points for first timeUS stocks surged Friday as tech shares rebounded and bitcoin steadied, pushing the S&P 500, Dow and Nasdaq sharply higher despite lingering worries over heavy AI spending and market volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/google-ai-wave-q4-result-cross-400-billion-in-annual-revenue-ceo-sundar-pichai-gemini-cloud-services-2864278-2026-02-06",
      "headline": "How Google rode the AI wave to cross $400 billion in annual revenue for 1st timeGoogle said that the Gemini app alone has crossed 750 million monthly active users, showing that AI adoption is no longer limited to developers or businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/fractal-analytics-aye-finance-ipos-to-open-next-week-what-investors-should-know-2864265-2026-02-06",
      "headline": "Fractal Analytics, Aye Finance IPOs to open next week: What investors should knowInvestors will have two fresh IPO opportunities next week as Fractal Analytics and Aye Finance open their public issues on February 9. The offerings span technology and finance, drawing attention from those looking to diversify their portfolios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crash-wipes-2-trillion-what-triggered-biggest-crypto-slump-since-trumps-election-2864179-2026-02-06",
      "headline": "Bitcoin crash stuns markets. Decoding biggest crypto slump since Trump electionBitcoin has witnessed one of its sharpest corrections in recent years, wiping out more than $2 trillion from the global cryptocurrency market in a single day. The fall is the steepest since Donald Trump's election. It comes amid rising global risk aversion, weakness in technology and AI stocks, and sustained institutional selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-rebound-fmcg-high-it-stocks-bleed-tcs-infosys-shares-down-2864177-2026-02-06",
      "headline": "Sensex, Nifty rebound to close higher; IT stocks bleed to limit gainsThe S&P BSE Sensex added 266.47 points to close at 83,580.40, while the NSE Nifty50 gained 50.90 points to end at 25,693.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-uber-rapido-drivers-6-hour-strike-february-7-minimum-fares-key-demands-2864126-2026-02-06",
      "headline": "Why Ola, Uber and Rapido drivers are going on a 6-hour strike todayThe strike has been called by the Telangana Gig and Platform Workers Union, also known as TGPWU. The union represents app-based transport workers operating on platforms such as Ola, Uber and Rapido."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-rs-1000-silver-falls-rs-6000-should-you-buy-now-or-wait-longer-2864098-2026-02-06",
      "headline": "Gold jumps Rs 1,000, silver falls Rs 6,000: Should you buy now or wait longer?Recent swings in gold and silver prices have caught investors' attention, with the metals showing mixed trends after a strong run. The big question now is whether this is a pause before the next move — should you buy now or wait longer?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-budget-2026-putting-services-at-the-centre-of-indias-growth-strategy-2864036-2026-02-06",
      "headline": "Is Budget 2026 putting services at the centre of India's growth strategy?Budget 2026, in essence, quietly recognises that India's economic growth and job creation are and will continue to be powered by services – both tradable and non-tradable, while maintaining the focus on infrastructure and manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-rbis-new-measures-make-it-easier-to-do-business-and-boost-credit-flow-2864024-2026-02-06",
      "headline": "Can RBI's new measures make it easier to do business and boost credit flow?With the RBI announcing new steps to improve credit access and ease regulations, attention is turning to their real-world impact. Could these changes help businesses grow and borrow more smoothly?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-stock-market-is-falling-rbi-repo-rate-unchanged-sensex-nifty-down-it-shares-fall-reason-2864018-2026-02-06",
      "headline": "Why stock markets fell after RBI kept key lending rates unchanged Even though inflation is within the comfort band and growth remains robust, RBI signalled that it is not ready to shift toward a softer stance. Global uncertainties, from geopolitical tensions to commodity volatility, continue to influence the outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/repo-rate-unchanged-rbi-why-stable-emis-are-not-bad-news-for-homebuyers-2863992-2026-02-06",
      "headline": "RBI keeps repo rate unchanged, why its still a win-win situation for homebuyersWhile many homebuyers were hoping for a rate cut, the RBI decision to keep rates steady at 5.25% is not bad news, especially for those who value stability and clear planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-maintains-525-repo-rate-what-it-means-for-homebuyers-and-emis-2863988-2026-02-06",
      "headline": "RBI maintains 5.25% repo rate: What it means for homebuyers and EMIsThe RBI has decided to keep its key interest rate unchanged in its latest policy review. What could this steady stance mean for homebuyers and their monthly loan repayments?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-lending-rates-unchanged-at-525-in-last-mpc-of-fy26-2863965-2026-02-06",
      "headline": "RBI keeps key lending rates unchanged at 5.25% in last MPC of FY26The Reserve Bank of India (RBI) kept repo rate unchanged at 5.25% in the last meeting for Fy26. The RBI Governor said inflation trends have been supportive of keeping rates unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-it-stocks-down-sensex-nifty-fall-tcs-infosys-tech-mahindra-tank-2863959-2026-02-06",
      "headline": "Sensex, Nifty open lower as IT stocks continue fall; TCS, TechM down 2%The S&P BSE Sensex fell by 216.98 points to 83,097.00, while the NSE Nifty50 lost 80.25 points to 25,562.55 as of 9:48 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-dhupia-birthday-post-for-angad-bedi-mentions-cool-calls-from-casting-directors-2864558-2026-02-07",
      "headline": "A year filled with all things you love: Neha Dhupia's birthday wish for Angad Bedi Neha Dhupia shared a heartfelt birthday post for husband Angad Bedi, offering fans a glimpse into his favourite things along with unseen moments from his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-idol-i-actors-korean-stars-choi-soo-young-kim-jae-young-on-fans-obsession-and-india-2864539-2026-02-07",
      "headline": "Exclusive: Korean stars Choi Soo-young, Kim Jae-young on fans, obsession and India In exclusive conversations with India Today, leads Choi Soo-young and Kim Jae-young reflect on why the show has resonated deeply with Indian audiences. Both actors credit India's emotional storytelling sensibility for truly \"understanding\" IDOL I, calling the response heartfelt, thoughtful and deeply moving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-ayesha-khan-calls-nora-fatehi-tamannaah-bhatia-incredible-amid-comparisons-2864543-2026-02-07",
      "headline": "Dhurandhar's Ayesha Khan calls Nora Fatehi, Tamannaah incredible amid comparisons Ayesha Khan has reacted to comparisons with Nora Fatehi and Tamannaah Bhatia, saying she respects their work and would never measure herself against them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/halle-berry-confirms-engagement-to-musician-van-hunt-after-six-years-of-dating-2864526-2026-02-07",
      "headline": "Halle Berry confirms engagement to musician Van Hunt after six years of dating Halle Berry has confirmed that she is engaged to musician Van Hunt, clearing the air around rumours that she had declined his proposal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-trend-of-cutting-disturbing-teasers-and-the-toxic-dhurandhar-cinematic-language-2864426-2026-02-07",
      "headline": "The trend of cutting disturbing teasers and the toxic, dhurandhar cinematic language Trailers and teasers in Indian cinema no longer just tease. From Dhurandhar to Toxic and Assi, filmmakers are choosing loud, often disturbing imagery to announce the worlds their films have arrived in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-clarifies-retirement-rumours-says-he-was-facing-severe-burnout-2864511-2026-02-07",
      "headline": "16-hour shifts, severe burnout: Vikrant Massey on temporary hiatus from work Vikrant Massey has clarified that his 2024 announcement was not a retirement but a much-needed break caused by severe burnout and personal regrets about missing time with his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mardaani-3-box-office-day-8-rani-mukerjis-thriller-inches-towards-30-crore-mark-2864508-2026-02-07",
      "headline": "Mardaani 3 box office Day 8: Rani Mukerji's thriller inches towards 30 crore mark Mardaani 3 continues its steady theatrical run, earning around Rs 1.75 crore on Day 8 and taking its total close to Rs 28.05 crore in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-cinema-family-dramas-2025-tourist-family-kudumbasthan-3bhk-angammal-2863718-2026-02-07",
      "headline": "Guns down, emotions up: The return of family dramas in Tamil cinema Tamil cinema in 2025 witnessed a strong resurgence of family dramas focusing on emotional storytelling. This shift reflects evolving audience preferences and a move away from spectacle films towards authentic, relatable narratives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-kardashian-says-shell-always-be-family-with-kanye-west-2864448-2026-02-06",
      "headline": "After blaming Kanye for health woes, Kim Kardashian says they'll always be family Kim Kardashian and Kanye West, who divorced five years ago, have shared new perspectives on their relationship, with Kim calling them 'always family' and Kanye issuing a public apology for past behaviour linked to mental health challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rohit-shettys-khatron-ke-khiladi-returns-with-season-15-makers-release-ai-promo-2864432-2026-02-06",
      "headline": "Rohit Shetty's Khatron Ke Khiladi returns with Season 15, makers release AI promo Khatron Ke Khiladi will return to Colors TV for its fifteenth season after a two-year break, with the announcement made through an AI-generated promo video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raveena-ravi-exposes-harassment-sabarish-twins-urges-public-vigilance-chennai-2864007-2026-02-06",
      "headline": "Raveena Ravi names alleged harassers after years of complaints, seeks public support Actor and voice artist Raveena Ravi exposed two men for harassing her and her family for three years, urging authorities to take strict action following ongoing incidents despite previous police complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-in-india-police-take-the-comic-in-the-us-they-take-the-audience-2864233-2026-02-06",
      "headline": "Samay Raina jokes on free speech: India takes the comic, US takes the audience Samay Raina spoke to India Today about his new show Still Alive, police case over comedians and US President Donald Trump. He also expressed his excitement about performing at Madison Square Garden. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/samay-raina-on-performing-at-madison-square-us-president-donald-trump-and-more-2864304-2026-02-06",
      "headline": "Samay Raina on performing at Madison Square, US President Donald Trump and more In an interview with India Today, comedian Samay Raina discusses his show Still Alive and performing at Madison Square Garden. Reflecting on past legal controversies, Raina humorously compares performing in India and the US, while explaining how personal resilience fuelled his latest unscripted performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-on-nick-jonas-sunday-best-youre-the-most-honest-person-i-know-2864376-2026-02-06",
      "headline": "Priyanka Chopra on Nick Jonas' Sunday Best: You're the most honest person I know Priyanka Chopra dedicated an emotional note to husband Nick Jonas following the release of his new album Sunday Best. Praising his \"endless talent\" and sincerity, the actor expressed pride in his work while preparing for her own upcoming releases in the film and the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-on-arijit-quitting-playback-singing-we-are-not-factory-products-2864350-2026-02-06",
      "headline": "Pankaj Tripathi on Arijit quitting playback singing: We are not factory products Pankaj Tripathi has backed Arijit Singh's decision to quit playback singing, highlighting the vital need for artistic breaks. Emphasising that creators are not \"factory products,\" the actor said that slowing down is essential for personal reinvention and maintaining excitement in a demanding profession."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/singer-chinmayi-sripadaa-backs-arjun-kapoor-after-emotional-post-on-online-bullying-2864345-2026-02-06",
      "headline": "Singer Chinmayi backs Arjun Kapoor after emotional post on online bullying Singer Chinmayi Sripaada publicly supported Arjun Kapoor amid concerns about harsh social media trolling, following the actor's candid post about difficult times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ashakal-aayiram-review-jayaram-kalidas-family-drama-passion-ego-2864406-2026-02-06",
      "headline": "Ashakal Aayiram review: Jayaram-Kalidas shine, but film falls short of greatnessRelease Date:Fri Feb 06, 2026 Ashakal Aayiram movie review: Director G Prajith's Ashakal Aayiram, starring Jayaram and Kalidas Jayaram, is an attempt at a heartwarming film about a dad-son's passion and ego issues. The film has interesting ideas, but falls short of greatness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swifts-opalite-video-packs-cameos-and-peak-90s-nostalgia-domnhall-gleeson-cillian-murphy-lewis-capaldi-2864353-2026-02-06",
      "headline": "Taylor Swift's Opalite video packs cameos and peak '90s nostalgia. Watch Taylor Swift has released the quirky and nostalgic music video for Opalite exclusively on Spotify and Apple Music, opting to skip YouTube for now. The video features a star-studded cast and blends humour with retro kitsch, reflecting themes of emotional survival and happiness in true Swift style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/anomie-review-crime-thriller-bhavana-menon-rahman-flawed-execution-review-2864339-2026-02-06",
      "headline": "Anomie review: Bhavana starrer crime thriller is high concept, low impactRelease Date:Fri Feb 06, 2026 Anomie: The Equation of Death is a Malayalam crime thriller starring Bhavana Menon in the lead. The film, directed by debutant Riyaz Marath, is a below-average crime thriller that promises gold but only delivers brass (in slow motion)."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-map-kashmir-pok-aksai-chin-us-trade-deal-trump-modi-2864523-2026-02-07",
      "headline": "Trade deal: How Trump team left Pakistan red-faced with map of IndiaWhile releasing the trade deal details, the US trade representative's office released a map of India showing the entire Jammu and Kashmir, including Pakistan-occupied Kashmir (POK), as part of the country. Here's why it is important and marks a departure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-interim-trade-agreement-framework-key-points-benefits-explained-2864509-2026-02-07",
      "headline": "18% tariff, wider US market access: How India gains from trade pact with USIndia and the US have finally agreed on a framework for an interim trade agreement. In this article, we break down what it means and why it matters for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-mayor-bjp-names-ritu-tawde-candidate-shiv-sena-picks-sanjay-ghadi-for-deputy-mayor-bmc-2864554-2026-02-07",
      "headline": "Ritu Tawde is BJP's Mumbai Mayor pick, Shiv Sena's Sanjay Ghadi is her DeputyThe race for Mumbai's top civic post has entered its decisive phase, with Mumbai BJP president Ameet Satam announcing Ritu Tawde as the party's nominee for Mayor of Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gen-z-ambition-shift-india-mental-health-work-balance-2864210-2026-02-07",
      "headline": "The rise of anti-ambition: Why young workers are opting out of the career raceGen Z professionals in India are redefining ambition by prioritising emotional stability and flexibility. This shift challenges traditional career paths and urges employers to rethink motivation strategies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worlds-top-10-richest-donate-half-their-wealth-what-happens-global-poverty-healthcare-2864330-2026-02-07",
      "headline": "What happens if the world's 10 richest people donate half their wealth?A trillion dollars from the world's ten richest may stay theoretical, but imagine what becomes possible the moment you allow yourself to picture this group parting with half their wealth. In this story, we take you through what that world could actually look like. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ned-live-score-t20-world-cup-2026-pakistan-vs-netherlands-match-2864518-2026-02-07",
      "headline": "PAK vs NED Live Score: Abrar, Saim halt Netherlands' push for late flurryPakistan (PAK) vs Netherlands (NED) Live Score, T20 World Cup 2026: Saim Ayub has taken the wicket of Lion-Cachet as Netherlands are struggling to find momentum in the death overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/sub-contractor-arrested-in-case-of-biker-dying-by-falling-into-pit-dug-up-by-delhi-jal-board-2864569-2026-02-07",
      "headline": "Sub-contractor arrested in Delhi biker death case, FIR filed for culpable homicideDelhi Police have arrested a sub-contractor in connection with a tragic accident in Janakpuri, highlighting serious safety lapses. The investigation is ongoing with strict action promised against all responsible parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/chandrayaan-4-mission/story/chandrayaan-4-mission-launch-lupex-japan-isro-moon-landing-mons-muton-2864572-2026-02-07",
      "headline": "This is where Chandrayaan-4 will land on the MoonTheir findings were presented at the Lunar and Planetary Science Conference (LPSC) 2026, where scientists outlined how detailed terrain analysis helped narrow down potential landing zones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-poland-relations-america-india-diplomatic-relations-donald-trump-narendra-modi-call-nobel-peace-polish-speaker-row-2864397-2026-02-07",
      "headline": "Trump's Nobel fury: After India, it's PolandAfter India faced Donald Trump's wrath for refusing to endorse his demand for a Nobel Peace Prize, its now Poland's turn. Despite being one of the US' closest allies, the US cut off all ties with the Speaker of the country's Lower House of Parliament after he argued that the US President was not deserving of the Peace Prize."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-biker-kamals-parents-waited-with-their-wedding-anniversary-cake-later-saw-his-wrapped-body-2864520-2026-02-07",
      "headline": "Delhi biker's parents waited with anniversary cake, later saw his wrapped bodyKamal's parents waited all night for their wedding anniversary with a cake at their Delhi home. Hours later, they were handed their son's body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-never-invites-indian-cricket-why-first-move-sunil-gavaskar-ind-vs-pak-2864524-2026-02-07",
      "headline": "Sunil Gavaskar shreds Pak over T20 boycott: It's always us reaching outSunil Gavaskar has called out Pakistan's repeated expectation of India making the first move in cricketing ties. The Indian legend said invitations and gestures have rarely been reciprocated, especially amid the latest India–Pakistan World Cup boycott row."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/want-to-get-laid-how-indian-origin-tycoon-vikas-naths-texts-proved-intent-in-drink-spiking-case-2864532-2026-02-07",
      "headline": "Want to get laid: Indian-origin tycoon's texts expose plan to spike woman's drinkWhat Indian-origin restaurateur Vikas Nath thought were private messages became public proof of intent, and the final link in a chain that led him from Mayfair's rooftop bar to a prison cell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/rishikesh-travel-things-beyond-rafting-learn-hobbies-pottery-aerial-yoga-jewellery-making-2864351-2026-02-07",
      "headline": "Are we sleeping on Rishikesh as a superb Hobbiday destination?Handcrafted ByOur Editors When in Rishikesh, try pottery one day, sound healing the next, and handpan the day after. If something truly resonates with you, you can always extend it into a multi-day or long-term learning experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/news-analysis/story/korean-pop-culture-utopian-dream-distorted-reality-ghaziabad-sisters-suicide-2864486-2026-02-07",
      "headline": "Korea sells a utopian dream. What we buy is a distorted realityHandcrafted ByOur Editors Welcome to the age of Hallyu, where everyone suddenly knows a few Korean words and no one knows where obsession ends. K-pop taught the world synchronised dancing, K-dramas taught it how to cry on cue, and K-beauty taught it that pores are a moral failure. What looks like harmless Korean culture, however, often comes with terms and conditions no one reads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/catch-me-if-you-can-this-bengaluru-startup-wants-to-grab-dying-satellites-in-space-2863704-2026-02-07",
      "headline": "This Bengaluru startup wants to catch dying satellites in spaceThe company is developing technology that can physically rendezvous with satellites already operating in orbit, dock with them and extend their lifespan, save millions of dollars in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-uber-rapido-drivers-6-hour-strike-february-7-minimum-fares-key-demands-2864126-2026-02-06",
      "headline": "Why Ola, Uber and Rapido drivers are going on a 6-hour strike todayThe strike has been called by the Telangana Gig and Platform Workers Union, also known as TGPWU. The union represents app-based transport workers operating on platforms such as Ola, Uber and Rapido."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/mental-health-paradox-wuthering-heights-on-valentines-day-why-not-frankenstein-on-fathers-day-2864307-2026-02-07",
      "headline": "Mental health flux: Wuthering Heights on Valentine's, Frankenstein on Father's Day?Handcrafted ByOur Editors Valentine's Day keeps selling emotional intensity as romance. So when Wuthering Heights is packaged as love, it exposes a mental-health blind spot about what we normalise. Read this to see how cultural myths about love quietly shape anxiety and unhealthy attachment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/india-today-quiz-news-current-affairs-upsc-entertainment-technology-movies-pop-culture-sports-569-06-02-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-world-cup-champions-reward-bcci-crore-vaibhav-sooryavanshi-devajit-saikia-2864573-2026-02-07",
      "headline": "BCCI announces Rs 7.5 crore reward for India's U19 World Cup championsIndia's Under-19 World Cup celebrations got bigger as the BCCI announced a Rs 7.5 crore reward for the new champions. The cash prize comes after Ayush Mhatre's unbeaten side crushed England by 100 runs in Harare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/teens-smartphones-ban-addiction-data-leaks-grooming-2864370-2026-02-07",
      "headline": "Banning smartphones is the not the solution, it's part of the problemHandcrafted ByOur Editors From Spain to India, governments are debating whether smartphones and social media should be restricted for teenagers. But the issue is far more complex than addiction alone. We unpack cybersecurity risks, online grooming, and the need to balance child safety with innovation, opportunity, and digital inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-trend-of-cutting-disturbing-teasers-and-the-toxic-dhurandhar-cinematic-language-2864426-2026-02-07",
      "headline": "The trend of cutting disturbing teasers and the toxic, dhurandhar cinematic languageTrailers and teasers in Indian cinema no longer just tease. From Dhurandhar to Toxic and Assi, filmmakers are choosing loud, often disturbing imagery to announce the worlds their films have arrived in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-18-percent-reciprocal-tariffs-items-list-2864527-2026-02-07",
      "headline": "India–US trade deal: Decoding impact of lower 18% tariffs and duty-free boostIndian goods that were slammed with nearly 50% US tariffs last year will now face only 18%, and some key sectors even go duty-free. Here's how the interim pact changes the outlook for exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/himalayan-snow-drought-indian-glaciers-ganga-gangotri-water-crisis-2026-2858742-2026-02-07",
      "headline": "Why late snowfall in India could trigger a global water crisisFresh snow in the Himalayas through January 28 cannot reverse a season of record deficits. The ongoing snow drought will lead to a massive spike in water demand for billions of Indians. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-final-vaibhav-suryavanshi-175-vs-england-whatsapp-message-coach-2864438-2026-02-06",
      "headline": "How a WhatsApp message fuelled Vaibhav Sooryavanshi's 175 in the finalA quiet WhatsApp reminder from his childhood coach preceded a night of calculated brutality. 14-year-old Vaibhav Sooryavanshi dismantled England in the U19 World Cup final, hitting 175, including 15 sixes and as many boundaries in Harare on Friday. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-rethink-boycott-india-match-sri-lanka-letter-details-2864571-2026-02-07",
      "headline": "Pakistan to rethink India boycott stance? PCB to consult govt over Sri Lanka plea T20 World Cup 2026: Pakistan Cricket Board will consult the government again after Sri Lanka Cricket warned of financial and reputational losses if the marquee clash against India is boycotted. The Pakistan government said the senior national men's team will not play India in Colombo on February 15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-jasprit-bumrah-doubtful-india-vs-usa-reports-illness-wankhede-2864557-2026-02-07",
      "headline": "Bumrah doubtful for India's T20 World Cup opener vs USA: Reports Jasprit Bumrah is reportedly doubtful for India's T20 World Cup 2026 opener against USA after missing training with a mild fever. With tougher Group A games ahead, India may rest him as a precaution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-sooryavanshi-india-u19-world-cup-win-celebrations-bhojpuri-songs-dance-2864538-2026-02-07",
      "headline": "Sooryavanshi leads India's U19 World Cup celebrations, grooves to Bhojpuri beats Vaibhav Sooryavanshi capped India's sixth U19 World Cup triumph with a historic final, smashing a breathtaking 175 and then leading the celebrations with equal flair in the dressing room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-heal-fracntured-sport-heal-column-2864531-2026-02-07",
      "headline": "Let the game begin: Can a 20-team T20 World Cup heal a fractured sport? From the simple magic of ink-stained schedules to the heavy drama of modern boycotts, cricket's soul is at a crossroads. As twenty nations take the field today, can the purity of the pitch finally silence the noise of the boardroom?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-never-invites-indian-cricket-why-first-move-sunil-gavaskar-ind-vs-pak-2864524-2026-02-07",
      "headline": "Sunil Gavaskar shreds Pak over T20 boycott: It's always us reaching out Sunil Gavaskar has called out Pakistan's repeated expectation of India making the first move in cricketing ties. The Indian legend said invitations and gestures have rarely been reciprocated, especially amid the latest India–Pakistan World Cup boycott row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-ned-live-score-t20-world-cup-2026-pakistan-vs-netherlands-match-2864518-2026-02-07",
      "headline": "PAK vs NED Live Score: Nawaz gets de Leede as Pakistan keep Dutch in check Pakistan (PAK) vs Netherlands (NED) Live Score, T20 World Cup 2026: Mohammad Nawaz has taken the wicket of Bas de Leede as Pakistan have kept a check on the Dutch with wickets at regular intervals. Zach Lion Cachet has joined his skipper Scott Edwards in the middle.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-pak-boycott-not-our-concern-usa-saurabh-netravalkar-dressing-room-cricket-focus-2864512-2026-02-07",
      "headline": "India-Pakistan issues not our concern: USA's Saurabh Netravalkar stays clear of debate USA pacer Saurabh Netravalkar says India–Pakistan tensions have never entered the American dressing room. As the T20 World Cup begins, he insists USA remain focused only on cricket, not politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-india-vaubhav-sooryavanshi-father-senior-team-call-up-century-final-vs-england-175-2864493-2026-02-07",
      "headline": "After U19 World Cup triumph, Vaibhav Sooryavanshi's father hopeful of India call-up Vaibhav Sooryavanshi's Under-19 World Cup heroics have sparked fresh calls for a senior India future. After his record-breaking final knock, his father believes the teenage star's India cap is only a matter of time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-usa-t20-world-cup-group-match-preview-predicted-xi-mumbai-pitch-weather-2864425-2026-02-07",
      "headline": "IND vs USA: India begin bid for history in Green Card vs Aadhaar Card clash T20 World Cup 2026, India vs USA: Defending champions India will kick off their ICC Men's T20 World Cup campaign against a multicultural USA side at Mumbai's iconic Wankhede Stadium. With eight members of the USA squad tracing their roots back to India, Saturday's clash has been colloquially billed as Green Card versus Aadhaar Card."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-live-streaming-match-day-1-start-times-live-streaming-guide-and-predicted-playing-xis-2864466-2026-02-07",
      "headline": "Matchday Preview: Forgotten heroes West Indies begin campaign with India, Pakistan T20 World Cup 2026: Matchday preview: The opening day of the T20 World Cup 2026 will feature three fixtures, namely Pakistan vs Netherlands, West Indies vs Scotland and India vs USA. Here's our match-wise guide for the opening day of the tournament"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-pakistan-vs-netherlands-preview-salman-ali-agha-2864429-2026-02-07",
      "headline": "Somewhere between rift and rain, T20 World Cup begins for Pakistan The ICC T20 World Cup begins with Pakistan taking on Netherlands in the curtain-raiser. Between rift with ICC and tricky conditions, do Pakistan have it in them to focus on the match?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-no-team-wins-beat-india-west-indies-head-coach-darren-sammy-2864465-2026-02-07",
      "headline": "No team wins T20 World Cup without beating India: WI head coach Darren SammyT20 World Cup 2026: West Indies coach Daren Sammy reflected on past glories and urged his team to create history as they prepare for the T20 World Cup, underlining the formidable obstacle posed by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-captaincy-smile-india-world-cup-2864452-2026-02-06",
      "headline": "T20 World Cup to defend, home crowd to please and Suryakumar Yadav just smiling awayT20 World Cup 2026: Suryakumar Yadav leads India under immense World Cup pressure with a constant smile. Calm in chaos, he trusts preparation and people, carrying expectation lightly as Indian captaincy demands everything.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-2026-pakistan-calling-bcci-bullies-easy-excuse-sunil-gavaskar-rajdeep-sardesai-2864444-2026-02-06",
      "headline": "T20 World Cup: Pakistan calling BCCI bullies is the easiest excuse, says GavaskarSunil Gavaskar hit back at Pakistan's claims of calling the Board of Control for Cricket in India (BCCI) bullies in the whole T20 World Cup controversy, with the nation opting to boycott their game against India. In the T20 World Cup roundtable hosted by Rajdeep Sardesai, Gavaskar said that the decision to remove Bangladesh from the tournament was one taken by a vote where 14 teams were for the move, while 2 other member nations were against it altogether. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-final-vaibhav-suryavanshi-175-vs-england-whatsapp-message-coach-2864438-2026-02-06",
      "headline": "How a WhatsApp message fuelled Vaibhav Sooryavanshi's 175 in the finalA quiet WhatsApp reminder from his childhood coach preceded a night of calculated brutality. 14-year-old Vaibhav Sooryavanshi dismantled England in the U19 World Cup final, hitting 175, including 15 sixes and as many boundaries in Harare on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatre-on-rohit-sharma-harmanpreet-kaur-under-19-world-cup-2026-sixth-title-sooryavanshi-century-2864421-2026-02-06",
      "headline": "Happy to carry ahead Rohit, Harmanpreet's legacy: Ayush chuffed after U19 WC winIndia's under-19 men's team won their sixth World Cup title, beating England by 100 runs. This victory completes a historic sweep of cricket world cups by all Indian teams of different age groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-message-india-u19-world-cup-win-domination-continues-2864418-2026-02-06",
      "headline": "Kohli's message to India's U-19 team after World Cup win: Our domination continuesVirat Kohli and Gautam Gambhir hailed India's U-19 World Cup triumph after a record sixth title, powered by Vaibhav Sooryavanshi's historic 175 in a dominant final win over England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mohammed-siraj-named-harshit-rana-replacement-india-squad-2864416-2026-02-06",
      "headline": "T20 World Cup: Mohammed Siraj replaces injured Harshit Rana in India's squadIndia have named senior pacer Mohammed Siraj as Harshit Rana's replacement after the fast bowler was ruled out of the ICC Men's T20 World Cup 2026 with a knee injury sustained during a warm-up match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-england-win-sixth-u19-world-cup-title-vaibhav-sooryavanshi-175-2864389-2026-02-06",
      "headline": "India win 6th U19 World Cup crown after Sooryavanshi 175 scorches EnglandIndia lifted a sixth men's Under-19 World Cup title after Vaibhav Sooryavanshi's magnificent 175 laid the foundation for a dominant 100-run victory over England in the final at the Harare Sports Club on February, February 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2026-sourav-ganguly-surprised-pakistan-india-boycott-bangladesh-participate-2864385-2026-02-06",
      "headline": "Sourav Ganguly reacts to Pakistan's boycott stance against India in T20 World CupICC Men's T20 World Cup 2026: Sourav Ganguly expressed surprise at Pakistan's decision to boycott its T20 World Cup match against India, even as the tournament begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/delhi-court-denies-bail-olympian-sushil-kumar-sagar-dhankhar-murder-case-2864378-2026-02-06",
      "headline": "Olympian Sushil Kumar denied bail in fellow wrestler Sagar's murder caseA Delhi court on Friday dismissed Olympian Sushil Kumar's bail plea in the murder case of former junior national wrestling champion Sagar Dhankar at the Chhatrasal Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-india-vs-usa-press-conference-suryakumar-yadav-mumbai-2864373-2026-02-06",
      "headline": "T20 World Cup: History up for grabs, but Surya wants India to stay in the momentT20 World Cup 2026 India vs USA: Speaking on the eve of India's opening game in Mumbai, captain Suryakumar Yadav spoke about the pressure of expectations, the weight of history and how India are trying to stay in the moment and get the job done. India are bidding to become the first team to defend the title and win the trophy as many as three times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-on-ishan-kishan-opening-in-t20-world-cup-2026-usa-2864258-2026-02-06",
      "headline": "Suryakumar Yadav all but confirms Ishan Kishan as opener for USA clashIndia captain Suryakumar Yadav has almost confirmed Ishan Kishan as the opener for the T20 World Cup 2026 opening match against the USA. Kishan's explosive recent form has edged out Sanju Samson, signalling a fresh start for India's top order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2026-pakistan-banned-india-boycott-ex-bcci-president-anurag-thakur-2864246-2026-02-06",
      "headline": "Pakistan should be banned for refusing to play India in T20 World Cup: Anurag ThakurICC T20 World Cup 2026: Former BCCI president and BJP MP, Anurag Thakur has called for the ICC to take strong action against Pakistan for their boycott of their group-stage game against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-175-u19-world-cup-final-records-broken-ind-vs-eng-2864166-2026-02-06",
      "headline": "Vaibhav 175: No double, but he shatters records in U19 World Cup finalVaibhav Sooryavanshi produced one of the most commanding innings in Under-19 World Cup history, scoring a stunning 175 off 80 balls in the final of the ICC Men's Under-19 World Cup against England at Harare. The 14-year-old left-hander's knock put India in complete control of the title clash and left England struggling to contain the onslaught."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-harry-brook-300-runs-2864165-2026-02-06",
      "headline": "T20 World Cup likely to see its first 300-plus total, hints Harry BrookICC T20 World Cup 2026: England captain Harry Brook believes that the 2026 edition of the T20 World Cup might see its first 300+ total. Brook says that there are multiple Indian grounds where such high scores might be possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-bangladesh-brothers-urges-support-t20-world-cup-2864145-2026-02-06",
      "headline": "Bangladesh our brothers, hope they support us in T20 World Cup: Pakistan captainPakistan captain Salman Ali Agha on Thursday referred to Bangladesh as Pakistan's \"brothers\" and expressed hope that Bangladeshi fans would continue to back the Men in Green at the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-sooryavanshi-hundred-u19-world-cup-final-ind-vs-eng-2864137-2026-02-06",
      "headline": "Vaibhav Sooryavanshi scripts history, hits fastest U19 World Cup final hundredVaibhav Sooryavanshi scripted history in the U19 World Cup by hitting the fastest hundred in the final of the tournament. Vaibhav Sooryavanshi reached his century in 55 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harshit-rana-out-icc-t20-world-cup-joint-tenderness-india-2864133-2026-02-06",
      "headline": "Injured Harshit Rana ruled out of T20 World Cup, set to undergo surgery: SourcesHarshit Rana has been ruled out of the ICC Men's T20 World Cup after sustaining an injury during a warm-up match against South Africa in Navi Mumbai on Wednesday. The Indian pacer is set to undergo surgery and is expected to be sidelined for a considerable period, sources have told India Today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nasser-hussain-icc-commentary-panel-t20-world-cup-2026-pakistan-boycott-bangladesh-exclusion-2864075-2026-02-06",
      "headline": "Despite criticism of ICC, Nasser Hussain named in T20 World Cup commentary panelFormer England captain Nasser Hussain has been named in the ICC's T20 World Cup 2026 commentary panel despite recently criticising the global body over governance, consistency and the treatment of Bangladesh and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/winter-olympics-ski-jumper-penis-size-cheating-2864044-2026-02-06",
      "headline": "Are ski-jumpers enhancing penis-size to fly further in Winter Olympics?A major controversy has brewed in the Winter Olympics. WADA is looking into allegations that ski jumpers are temporarily enhancing their penis sizes to fly further in their events."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}