{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-loser-key-insights-sensex-nifty-technical-indicators-2702333-2025-04-01",
      "headline": "1st trading day of FY26 ends in bloodbath: Top gainers, losers, key insightsThe S&P BSE Sensex ended nearly 1,400 points lower, while the NSE Nifty50 closed below 23,200. The uncertainty surrounding the Trump administration's expected reciprocal tariff imposition on imported goods triggered a significant sell-off, causing the domestic market to underperform other global indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-nearly-1400-points-nifty-tumbles-350-points-hcltech-tanks-4-percent-2702286-2025-04-01",
      "headline": "Sensex falls nearly 1,400 points, Nifty tumbles 350 points; HCLTech tanks 4%The S&P BSE Sensex plunged 1,390.41 points to close at 76,024.51, while the NSE Nifty50 tanked 353.65 points to end at 23,165.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-crash-vix-volatility-fear-index-rise-10-percent-what-should-investors-know-expert-view-2702281-2025-04-01",
      "headline": "Stock market crash: Why should investors watch out for rising volatility?The stock market fear index surged 10% on Tuesday as investors braced for the impact of US reciprocal tariffs, which are set to take effect from April 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-impact-on-india-stock-market-crash-sensex-nifty-correction-explained-2702178-2025-04-01",
      "headline": "Sensex down over 1,400 points: US tariff panic or other factors at play?Is the surrounding uncertainty reciprocal tariffs the only factor behind today's stock market bloodbath, or are other underlying issues driving the sharp correction? Read on to find out what's spooking Dalal Street investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-epfo-raise-claim-withdrawal-limit-from-rs-1-lakh-to-rs-5-lakh-in-april-2025-check-here-2702170-2025-04-01",
      "headline": "Will EPFO raise claim withdrawal limit to Rs 5 lakh in April 2025? Check hereEPFO is planning to allow Provident Fund (PF) withdrawals via UPI and ATMs soon. This move will make it easier for members to withdraw their PF money without delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-what-is-no-contest-clause-meaning-rs-3800-crore-wealth-distribution-2702173-2025-04-01",
      "headline": "Ratan Tata's will includes a 'no-contest' clause: What does it mean?Ratan Tata dedicated most of his fortune, including his Tata Sons shares, to charity. However, he also ensured that his family, close friends, employees, and even his cherished pets were taken care of."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/10-major-financial-rule-changes-from-april-1-new-tax-rules-upi-updates-pan-aadhaar-updates-tds-gst-rules-2702124-2025-04-01",
      "headline": "10 major financial rule changes from April 1: Tax, UPI updates and moreFrom April 1, you won't have to pay income tax if your annual income is up to Rs 12 lakh. Also, with a standard deduction of Rs 75,000, income up to Rs 12.75 lakh is tax-free under the new tax system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-rs-3800-crore-who-gets-what-family-trust-pet-dog-2702120-2025-04-01",
      "headline": "Ratan Tata's Rs 3,800 crore will: Who gets what?Ratan Tata will: The industrialist, who died on October 9, 2024, left most of his wealth, including shares in Tata Sons, to charitable causes. At the same time, he did not forget his family, close friends, staff, and even his beloved pets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-slashed-by-rs-41-from-today-2702099-2025-04-01",
      "headline": "Commercial LPG cylinder prices slashed by Rs 41 from todayWhile the price of commercial LPG cylinders has been reduced, the price of domestic cylinders used by households has not changed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-rise-10-percent-reason-government-stake-increase-2702091-2025-04-01",
      "headline": "Explained: Why Vodafone Idea shares hit 10% upper circuit todayVodafone Idea share price: The stock has gained 4.47% in the past five days and 0.27% over the past month. However, it remains 26.45% lower over the past six months and has dropped 46.57% in the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-tcs-hcltech-stock-price-why-are-it-shares-falling-today-key-reasons-explained-2702090-2025-04-01",
      "headline": "Infosys, TCS, HCLTech: Why are IT stocks down today?Shares of IT companies such as Tata Consultancy Services (TCS), Infosys and HCLTech took a big hit during intraday trade. Infosys was down over 2.3%, while HCLTech and TCS fell as much as 1.7% at around 10:10 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zoe-saldana-joins-kendrick-lamar-and-gracie-abrams-in-webby-nominations-glbs-2702567-2025-04-01",
      "headline": "Zoe Saldaña joins Kendrick Lamar and Gracie Abrams in Webby nominationsWith nearly 13,000 entries from over 70 countries, the competition includes viral music videos, top podcasts, and unexpected social media sensations. Voting for the Webby People's Voice Award is open until April 17, with winners announced on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jason-momoa-confirms-he-is-returning-to-the-dune-universe-2702481-2025-04-01",
      "headline": "Jason Momoa confirms he is returning to the Dune universeHollywood star Jason Momoa will be returning to the science-fiction world of Dune, the actor confirmed in a recent interview. He played Duncan Idaho in the first part. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/barkha-bisht-karan-singh-grover-relationship-got-attracted-to-his-kindness-2702505-2025-04-01",
      "headline": "Barkha Bisht recalls relationship with Karan Singh GroverIn a candid interview, Barkha Bisht discussed her past relationships, revealing the reasons behind her breakup with Karan Singh Grover. She shared that she was attracted to his kindness, and grew apart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-on-sardar-2-the-sequel-will-feature-a-much-bigger-war-2702468-2025-04-01",
      "headline": "Karthi on Sardar 2: The sequel will feature a much bigger warThe teaser for the highly anticipated sequel, Sardar 2, showcases Karthi reprising his dual roles as Indian spy Sardar and his son Vijay, gearing up for a much larger war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gulshan-devaiah-on-working-with-anurag-kashyap-hes-so-full-of-himself-2702491-2025-04-01",
      "headline": "Gulshan Devaiah on working with Anurag Kashyap: He's so full of himself but...Gulshan Devaiah recently revealed his thoughts on working with Anurag Kashyap, calling him confident yet collaborative. The actor shared his experience during a Reddit AMA session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/asit-modi-reacts-to-disha-vakanis-return-to-taarak-mehta-we-can-only-pray-2702490-2025-04-01",
      "headline": "Asit Modi reacts to Disha Vakani's return to Taarak Mehta: We can only prayProducer Asit Kumar Modi broke his silence on the ongoing rumours about the possibility of the return of the character Dayaben in Taarak Mehta Ka Ooltah Chashmah. He also revealed whether there's a possibility of actor Disha Vakani's return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/5-south-indian-sequels-beyond-baahubali-kgf-pushpa-that-clicked-with-fans-2702416-2025-04-01",
      "headline": "5 South Indian sequels beyond Baahubali, KGF, Pushpa, that clicked with fansLast weekend witnessed a slew of film releases, including sequels like Mohanlal's L2: Empuraan and Mad Square, as well as prequels such as Veera Dheera Sooran Part 2 and Robinhood. Here are five recent South Indian sequels that struck a chord with audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/esha-deol-wants-dhoom-to-re-release-2702424-2025-04-01",
      "headline": "Esha Deol wants Dhoom to re-release: Kids still remember me for the filmActor Esha Deol recently said she wants Dhoom to be released again in cinemas. Apart from Deol, the film starred Abhishek Bachchan, Uday Chopra and John Abraham in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/subham-teaser-samantha-turns-producer-with-a-quirky-horror-comedy-2702405-2025-04-01",
      "headline": "Subham teaser: Samantha turns producer with the quirky horror-comedyActor Samantha released the teaser of her debut production, Subham. The Telugu horror-comedy offers a sneak peek into its intriguing premise, showcasing the film's distinct blend of horror and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-screened-in-israel-as-tribute-to-india-israel-relations-2702394-2025-04-01",
      "headline": "John Abraham's Diplomat screened in Israel as tribute to India-Israel relationsIn a gesture celebrating India-Israel relations, Israel has screened John Abraham's film The Diplomat. Directed by Shivam Nair, the film hit theatres on March 14. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jessica-simpson-vocal-cord-remedy-chinese-herb-cocktail-with-snake-sperm-2702368-2025-04-01",
      "headline": "Drink snake sperm if you want good vocal: Singer Jessica SimpsonAmerican singer and actor Jessica Simpson recently shared her unusual method for maintaining her vocal cords, involving a Chinese herb cocktail containing snake sperm. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/andaz-apna-apna-salman-khan-aamir-khans-cult-comedy-to-re-release-on-april-25-2702393-2025-04-01",
      "headline": "Andaz Apna Apna: Salman Khan, Aamir Khan's cult comedy to re-release on April 25Bollywood's beloved comedy 'Andaz Apna Apna' is making a comeback to the big screen. The cult classic will be re-released in cinemas nationwide, delighting both new and old fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shalini-pandey-south-director-entered-van-when-she-was-changing-2702297-2025-04-01",
      "headline": "Actor Shalini Pandey says South director entered her van when she was changingActor Shalini Pandey, who made her debut with the Telugu film Arjun Reddy, said that a South director entered her van without knocking on the door. She also recalled how she reacted at the moment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kim-soo-hyuns-press-meet-draws-flak-from-fans-being-highest-paid-actor-backfired-2702346-2025-04-01",
      "headline": "Being highest paid actor backfired: Internet after Kim Soo-hyun's conferenceActor Kim Soo-hyun's recent press conference regarding the Kim Sae-ron death controversy has been met with significant backlash. Internet accused him of being overly rehearsed and failing to convince the public of his innocence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rasha-thadani-opposite-kartik-aaryan-in-pati-patni-aur-woh-sequel-report-2702212-2025-04-01",
      "headline": "Rasha Thadani, not Sreeleela opposite Kartik in Pati Patni Aur Woh sequel: ReportSreeleela has once again made headlines after being replaced by Rasha Thadani as the female lead opposite Kartik Aaryan in the sequel to Pati Patni Aur Woh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/who-is-to-be-blamed-for-sikandar-salman-khan-magnum-opus-by-ar-murugadoss-which-failed-to-impress-his-fans-2702250-2025-04-01",
      "headline": "Who is to be blamed for Sikandar?'Sikandar' is like the final nail in the coffin for the audience who have loved, celebrated and almost worshipped Salman Khan for being this undisputable, badass superstar, with a command on the big-screen like no other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/24-cuts-in-mohanlal-empuraan-villain-name-changed-2702262-2025-04-01",
      "headline": "24 cuts in Mohanlal's Empuraan, villain's name changed in revised versionA total of 24, not 17, cuts have been suggested for the Prithviraj directorial, L2: Empuraan, which stars Mohanlal in a pivotal role. The film is currently running successfully in cinemas. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/opposition-parties-waqf-bill-debate-parliament-oppose-lok-sabha-meeting-budget-session-2702478-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Opposition united against government's 'divisive' agenda on Waqf billOpposition parties have said they will oppose the Waqf bill \"tooth and nail\" when the proposed legislation is taken up for discussion and passage in the Lok Sabha on Wednesday, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-violates-ceasefire-agreement-loc-poonch-jammu-kashmir-indian-army-retaliates-2702528-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak violates ceasefire at LoC in Poonch, Indian Army retaliatesThe Indian Army successfully thwarted an infiltration attempt by the Pakistan Army in the Krishna Ghati area of Poonch district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-muhammad-yunus-northeast-states-china-extension-himanta-sarma-pradyot-manikya-congress-2702166-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Might as well break up Bangladesh: Northeast leaders bash Yunus pitch to ChinaIn response, Assam Chief Minister Himanta Biswa Sarma labelled Muhammad Yunus's statement as \"offensive and strongly condemnable\", while Tipra Motha chief Pradyot Manikya called on the Centre to adopt a more aggressive stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-deepseek-r1-china-to-stun-world-with-nuclear-game-chang-er-xinghuo-fusion-fission-reactor-2702175-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After DeepSeek R1, China might stun world with a nuclear game-chang​erChina recently shook the AI space with its DeepSeek R1. China's next surprise could be in the field of energy as it works to operationalise a fusion-fission reactor, the world's first, in the next five years. This is why its Xinghuo reactor could be a game-changer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/will-bjp-tieup-with-aiadmk-make-tamil-nadu-k-annamalai-the-biggest-loser-eps-amit-shah-dmk-2702171-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Annamalai be the biggest loser if BJP, AIADMK tie up?The BJP and the AIADMK are reported to be in talks for an alliance ahead of the Assembly elections in Tamil Nadu in 2026. Annamalai has defined the Tamil Nadu BJP's image and narrative in recent years, and a deal might reduce his role. Will he emerge as the biggest loser or is there more to the story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/lessons-from-myanmar-why-india-must-act-before-the-great-himalayan-earthquake-2702147-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's earthquake time bomb: Are we prepared for a Myanmar-like disaster?A \"Great Himalayan Earthquake\" with magnitude 8+ is overdue. It will happen. And it will be catastrophic."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sanitation-worker-income-tax-notice-rs-33-crore-uttar-pradesh-aligarh-2702503-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP sanitation worker earning Rs 15,000 monthly gets tax notice of Rs 33.88 croreThe man, who works as a cleaner at a SBI branch, receives a monthly salary of Rs 15,000. Last month, he received an Income Tax notice of over Rs 33 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/who-is-to-be-blamed-for-sikandar-salman-khan-magnum-opus-by-ar-murugadoss-which-failed-to-impress-his-fans-2702250-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is to be blamed for Sikandar?'Sikandar' is like the final nail in the coffin for the audience who have loved, celebrated and almost worshipped Salman Khan for being this undisputable, badass superstar, with a command on the big-screen like no other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-diesel-price-hiked-by-rs-2-per-litre-after-tax-increase-from-april-1-2702518-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka hikes diesel tax, pushing prices up by Rs 2 per litre from April 1The Karnataka government has raised the sales tax on diesel, increasing its price by Rs 2 per litre. The move comes amid rising costs in fuel, property tax, electricity, and essential goods.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-man-wife-married-lover-brings-her-back-sant-kabir-nagar-regrets-mistake-2702380-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man regrets getting wife married to lover, brings her back homeA man in Uttar Pradesh's Sant Kabir Nagar recently arranged his wife's marriage to her lover. But just a few days later, he went to her new husband's house, asking her to return as he was struggling to take care of their two children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-a-usual-us-bombing-campaign-will-not-bring-iran-to-heel-2702482-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a usual US bombing campaign will not bring Iran to heelFor Trump, any amplified war with Iran will stand against his promises of not dragging the US into wars in faraway lands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-indias-northeast-must-worry-about-muhammad-yunuss-statement-in-china-2702439-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India's Northeast must worry about Muhammad Yunus's statement in ChinaBy calling Bangladesh the 'guardian' of ocean access for the northeastern states, Yunus has drawn China in, weaponised geography and triggered regional security alarms"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-metro-passenger-refuses-to-give-up-unreserved-seat-for-woman-viral-video-2702430-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman argues with Delhi Metro passenger, asks him to give up unreserved seatA video of a man arguing with a group of women inside a Delhi Metro train over an unreserved seat went viral. The man is seen refusing to give up his seat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/skip-hotels-indians-are-now-swapping-homes-for-travel-2702264-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Skip hotels, Indians are now swapping homes for travelTrue to its name, HomeExchange allows you to exchange your home or living space with someone else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-india-partners-mutual-achievement-xi-jinping-75th-anniversary-of-ties-president-murmu-report-2702310-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India-China ties should be developed in 'dragon-elephant tango': Xi JinpingOn the 75th anniversary of diplomatic ties between India and China, Chinese President Xi Jinping said bilateral relations should take the form of a 'dragon-elephant tango', amid efforts to reset ties after the 2020 eastern Ladakh standoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/death-penalty-luigi-mangione-unitedhealthcare-ceo-brian-thompson-murder-us-prosecutors-2702509-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Death penalty sought for Luigi Mangione in UnitedHealthcare CEO's murder caseUS Attorney General Pamela Bondi has directed federal prosecutors to seek the death penalty for Luigi Mangione, accused of killing UnitedHealth CEO Brian Thompson in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-pregnancy-can-put-a-mothers-heart-at-risk-2702404-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How pregnancy can put a mother's heart at riskPostpartum cardiomyopathy, a type of systolic heart failure, can set in up to five months after delivery, but usually appears in the final month of pregnancy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-parliament-controversial-provisions-explained-2702387-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahead of Waqf bill war in Parliament, a look at what fuelled the controversyWaqf Amendment Bill: The Waqf bill, which will give the government a say in regulating waqf properties and settling disputes, will be tabled in Lok Sabha on Wednesday in what is expected to be stormy affair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/india-apparel-sector-may-be-hit-hardest-by-trump-us-reciprocal-tariffs-2702410-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India's apparel sector may be hit hardest by Trump's reciprocal tariffsAccording to Emkay Research, while India could be among the worst-hit nations per broad reciprocal differentials, the key susceptible sectors (auto, pharma, electronics) are far better placed than feared. Apparel and gems/jewellery are the most exposed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/us-student-with-145-iq-rejected-by-ivy-league-colleges-father-stunned-2702429-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US student with 145+ IQ rejected by Ivy League colleges, father stunnedA US man expressed his shock on a Reddit post after his son, a valedictorian with an IQ above 145, was rejected from Ivy League universities despite top scores and achievements."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-shubman-gill-approachable-prasidh-krishna-2702558-2025-04-01",
      "headline": "Shubman Gill is very easy to approach: Prasidh Krishna praises GT captainPrasidh Krishna praised Shubman Gill's captaincy for Gujarat Titans, calling him approachable and supportive. Gujarat Titans aim to build momentum against in-form Royal Challengers Bangalore in their crucial IPL 2025 clash at Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-digvesh-rathi-notebook-celebration-priyansh-arya-virat-kohli-2702557-2025-04-01",
      "headline": "LSG's Digvesh Rathi does iconic notebook celebration, gets umpire warningIPL 2025, LSG vs PBKS: Lucknow spinner Digvesh Rathi pulled off the iconic notebook celebration to tease Punjab Kings batter Priyansh Arya after dismissing him. The celebration gained popularity during a banter between Virat Kohli and West Indies fast bowler Kesrick Williams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-punjab-kings-auction-joke-2702534-2025-04-01",
      "headline": "Rishabh Pant's Punjab Kings auction joke comes back to haunt him in LucknowIPL 2025, LSG vs PBKS: Several fans on social media trolled Rishabh Pant for his joke about Punjab Kings after the wicketkeeper-batter failed with the bat against PBKS on Tuesday, April 1. Pant has endured a dreadful start to the new season with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abdul-samad-arshdeep-singh-scoop-lsg-vs-pbks-2702529-2025-04-01",
      "headline": "Watch: Abdul Samad hits Arshdeep Singh for outrageous reverse scoopIPL 2025, LSG vs PBKS: Abdul Samad scored a brisk 12-ball 27 and also played an outrageous scoop for a boundary off Arshdeep Singh in the 18th over of Lucknow's innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-2nd-odi-live-streaming-hamilton-2702504-2025-04-01",
      "headline": "New Zealand vs Pakistan, 2nd ODI Live Streaming: When and where to watchPAK vs NZ, 2nd ODI: After winning the first ODI by 73 runs at McLean Park in Napier, New Zealand would be looking to claim the series in the second game at Seddon Park in Hamilton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-rishabh-pant-hattrick-failure-lucknow-super-giants-vs-punjab-kings-2702497-2025-04-01",
      "headline": "Rs 27 crore for what? Rishabh Pant slammed after hat-trick of failures for LSGRishabh Pant's dismal start to IPL 2025 continues as fans criticise the Lucknow Super Giants skipper for failing to justify his Rs 27 crore price tag. With just 17 runs in three matches, Pant's performance has left supporters frustrated and questioning his value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mohammed-siraj-virat-kohli-bromance-video-2702494-2025-04-01",
      "headline": "Watch: Mohammed Siraj hugs Virat Kohli ahead of first game vs RCB in 8 yearsIPL 2025, RCB vs GT: Mohammed Siraj reunited with his former teammates Virat Kohli, Rajat Patidar and Yash Dayal on the eve of the first game of the season in Bengaluru. Siraj will lead Gujarat's bowling attack against RCB on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-men-rob-walter-head-coach-2702484-2025-04-01",
      "headline": "Rob Walter steps down as South Africa men's head coachAfter signing a four-year deal with the Proteas, Rob Walter has put down his papers as the head coach of the South Africa men's white-ball teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-best-scouting-award-ashwani-kumar-mumbai-indians-shreevats-goswami-2702479-2025-04-01",
      "headline": "IPL should introduce Best Scouting Award: Ex-RCB starFormer India and RCB cricketer Shreevats Goswami has called for the introduction of a special award in the Indian Premier League to recognise the best scouting team each season, believing it would motivate franchises to take scouting more seriously and continue discovering fresh cricketing talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-charlotte-edwards-head-coach-england-2702461-2025-04-01",
      "headline": "MI coach replaces Jon Lewis as England Women's head coachEngland Women have named Charlotte Edwards as their new head coach, replacing Jon Lewis, who resigned from his position after the Ashes in Australia where they lost 0-16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-butter-autorickshaw-ride-bengaluru-rcb-vs-gt-2702457-2025-04-01",
      "headline": "IPL 2025: GT's Jos Buttler enjoys Bengaluru auto-ride ahead of RCB clashJos Buttler enjoyed a Bengaluru auto-rickshaw ride ahead of Gujarat Titans' IPL 2025 clash against Royal Challengers Bangalore, offering fans a candid glimpse of his off-field moments before the high-voltage showdown at Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mohammed-siraj-virat-kohli-bromance-video-2702494-2025-04-01",
      "headline": "Watch: Mohammed Siraj hugs Virat Kohli ahead of first game vs RCB in 8 yearsIPL 2025, RCB vs GT: Mohammed Siraj reunited with his former teammates Virat Kohli, Rajat Patidar and Yash Dayal on the eve of the first game of the season in Bengaluru. Siraj will lead Gujarat's bowling attack against RCB on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-men-rob-walter-head-coach-2702484-2025-04-01",
      "headline": "Rob Walter steps down as South Africa men's head coachAfter signing a four-year deal with the Proteas, Rob Walter has put down his papers as the head coach of the South Africa men's white-ball teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-best-scouting-award-ashwani-kumar-mumbai-indians-shreevats-goswami-2702479-2025-04-01",
      "headline": "IPL should introduce Best Scouting Award: Ex-RCB starFormer India and RCB cricketer Shreevats Goswami has called for the introduction of a special award in the Indian Premier League to recognise the best scouting team each season, believing it would motivate franchises to take scouting more seriously and continue discovering fresh cricketing talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-charlotte-edwards-head-coach-england-2702461-2025-04-01",
      "headline": "MI coach replaces Jon Lewis as England Women's head coachEngland Women have named Charlotte Edwards as their new head coach, replacing Jon Lewis, who resigned from his position after the Ashes in Australia where they lost 0-16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-butter-autorickshaw-ride-bengaluru-rcb-vs-gt-2702457-2025-04-01",
      "headline": "IPL 2025: GT's Jos Buttler enjoys Bengaluru auto-ride ahead of RCB clashJos Buttler enjoyed a Bengaluru auto-rickshaw ride ahead of Gujarat Titans' IPL 2025 clash against Royal Challengers Bangalore, offering fans a candid glimpse of his off-field moments before the high-voltage showdown at Chinnaswamy Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}