{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-receives-2nd-imf-payout-as-india-raises-concerns-2724656-2025-05-14",
      "headline": "Pakistan receives 2nd IMF payout that India had objected toThis payment is part of the second instalment of a $7 billion IMF loan deal that began in September 2024 and will run for 37 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-182-points-higher-nifty-above-24600-tata-steel-up-4-2724635-2025-05-14",
      "headline": "Markets end higher amid midcap rally; Sensex up 182 pointsThe BSE Sensex was up 182.34 points to 81,330.56 at the closing bell, while the NSE Nifty50 settled 88.55 points higher at 24,666.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-new-chip-plant-by-hcl-foxconn-joint-venture-near-jewar-airport-2724622-2025-05-14",
      "headline": "Cabinet approves new HCL-Foxconn semiconductor plant near Jewar AirportThis marks another significant step in India's ambitions to become a global semiconductor hub, with the proposed fab expected to bolster domestic chip-making capabilities and reduce dependence on imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-wholesale-inflation-drops-to-13-month-low-in-april-2724601-2025-05-14",
      "headline": "India's wholesale inflation drops to 13-month low in AprilIndia's wholesale inflation dropped to 0.85% in April, a 13-month low, as prices of food, fuel, and key items cooled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cait-seeks-travel-ban-on-turkey-and-azerbaijan-for-openly-backing-pakistan-easemytrip-go-homestays-2724586-2025-05-14",
      "headline": "Traders' body seeks travel ban on Turkey and Azerbaijan for backing PakistanFollowing their backing of Pakistan, major travel companies have already suspended all travel packages to Turkey and Azerbaijan. Travel booking platform EaseMyTrip has advised its customers to avoid visiting these countries unless absolutely necessary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-is-reviewing-ev-wallets-after-blusmart-collapse-know-key-details-2724551-2025-05-14",
      "headline": "Explained: Why RBI is reviewing EV wallets after BluSmart collapseThe central bank has initiated informal discussions with EV charging point operators and other app-based service providers to assess potential consumer risks tied to such platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/do-not-just-look-rich-ca-shares-7-habits-to-build-lasting-wealth-start-a-retirement-fund-invest-in-stocks-sips-gold-2724535-2025-05-14",
      "headline": "'Don't just look rich': CA shares 7 habits to build lasting wealthThe first step to financial freedom is breaking the paycheck-to-paycheck cycle and having a safety cushion, which should cover you for 3 to 6 months in case of a job loss, medical emergency, or any unforeseen event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-grse-cochin-shipyard-mazagon-dock-rally-sharply-what-should-investors-do-2724532-2025-05-14",
      "headline": "GRSE, Cochin Shipyard, Mazagon Dock shares rise up to 17%: Good time to buy?At 12:17 pm, shares of Cochin Shipyard were trading 10.37% higher at Rs 1,740.80, while GRSE was trading 15.92% higher at 2,220. Mazagon Dock Shipbuilders was also up over 5%.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-itr-7-form-out-what-is-different-and-who-must-file-itr-filing-2025-2724502-2025-05-14",
      "headline": "New ITR-7 Form out: What's different and who must fileNew fields have been added to the ITR-7 form to help eligible entities clearly report housing loan interest claimed under Section 24(b)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-steel-share-price-jumps-capital-expnditure-expansion-plan-2724481-2025-05-14",
      "headline": "Explained: Why Tata Steel shares jumped over 4% todayAt around 10:30 am, shares of the company were trading 4.41% higher at Rs 156.10 on the BSE. The rally was sparked by fresh optimism following disclosures from top company officials about the scale and focus of Tata Steel's expansion plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/raymond-shares-down-64-percent-why-is-the-stock-falling-amid-realty-demerger-2724477-2025-05-14",
      "headline": "Raymond shares crash 64%: Why is the stock falling after realty demerger?At last count, the stock was trading at Rs 556.45, down 64.36% from its previous close of Rs 1,561.30. The sharp fall coincided with the ex-date of the demerger, when Raymond shares stopped factoring in the value of its real estate business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-continues-sensex-nifty-rise-key-reasons-to-know-2724468-2025-05-14",
      "headline": "Sensex jumps over 500 points today: Why is the stock market rising today?Today's sharp rebound followed Tuesday's volatile session where the Nifty had tumbled over 400 points from its intraday high before closing near day's low. This was largely due to profit booking after Monday's euphoric ceasefire rally."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-gives-funny-reaction-to-rrr-2-query-2724812-2025-05-14",
      "headline": "SS Rajamouli gives funny reaction to 'RRR 2' query. WatchUpasana Kamineni playfully asked director SS Rajamouli about the much-awaited 'RRR 2' during a special London screening, sparking excitement among fans. While Rajamouli gave a humorous reaction, the sequel remains unconfirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-jr-ntr-hold-hands-at-rrr-screening-at-royal-albert-hall-london-watch-2724809-2025-05-14",
      "headline": "Ram Charan, Jr NTR hold hands at RRR screening at Royal Albert Hall, London. Watch'RRR' actor Ram Charan recently shared a reel on Instagram offering fans a peek into what went on backstage during the actor's recent visit to London for the 'RRR' live orchestra screening at the Royal Albert Hall on May 11, with director SS Rajamouli and co-star Jr NTR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ram-lakhan-duo-jackie-shroff-and-anil-kapoor-to-reunite-for-srks-king-report-2724783-2025-05-14",
      "headline": "Ram Lakhan duo Jackie Shroff and Anil Kapoor to reunite for SRK's King: ReportBollywood stars Jackie Shroff and Anil Kapoor will be reuniting with Shah Rukh Khan for the action-packed thriller 'King', which begins filming on May 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ajay-devgn-son-yug-launch-hindi-trailer-of-jackie-chan-karate-kid-legends-2724775-2025-05-14",
      "headline": "Ajay Devgn, son Yug launch Hindi trailer of Jackie Chan's Karate Kid LegendsAjay Devgn launched the Hindi trailer of Karate 'Kid: Legends' with his son Yug. The film is set to release on May 30. Ajay voices the iconic Mr Han while Yug makes his debut as Li Fong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-vineet-kumar-siingh-story-that-feels-personal-from-scars-to-stardom-2724772-2025-05-14",
      "headline": "The Viineet Kumar Siingh story that feels personal: From scars to stardomIn an interview with India Today Digital, actor Viineet Kumar Siingh talks about finally being able to taste the kind of stardom he always deserved. And he's not saying he deserved it, he's saying he believed in it, and he knew life was going to take that beautiful turn down the road one day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emma-roberts-matt-rife-to-star-in-marriage-material-rom-com-2724724-2025-05-14",
      "headline": "Actor Emma Roberts paired opposite comedian Matt Rife in Marriage MaterialHollywood actor Emma Roberts and comedian Matt Rife will star in the upcoming romantic-comedy 'Marriage Material'. The film is directed by Trish Sie of 'Players' and 'The Sleepover' fame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/indian-film-body-calls-for-turkey-shooting-ban-over-its-pro-pakistan-stance-2724751-2025-05-14",
      "headline": "Indian film body calls for Turkey shooting ban over its pro-Pakistan stanceThe Indian film body has called for a shooting ban in Turkey and Azerbaijan after they supported Pakistan amid the escalating tensions with India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-mocks-cannes-red-carpet-rules-with-cultural-satire-2724624-2025-05-14",
      "headline": "Vir Das's sassy take on Cannes dress code because 'someone has to take a stand'Comedian Vir Das announced he will not attend Cannes due to new red carpet regulations. His humorous post highlights cultural and fashion politics around the festival's dress code."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-ishaan-khatter-bhumi-pednekar-series-is-royally-doomed-all-show-no-soul-2724649-2025-05-14",
      "headline": "The Royals: Ishaan-Bhumi's series is royally doomed - all show, no soul!'The Royals' on Netflix offers a glimpse into royal Indian life with grandeur and opulence but falters due to weak storytelling and lacklustre performances. Despite Ishaan Khatter's charm and lavish visuals, the show struggles to engage viewers, leaving it a disappointing watch for those seeking meaningful drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-meets-new-raj-and-simran-from-ddlj-inspired-musical-come-fall-in-love-2724701-2025-05-14",
      "headline": "SRK meets new Raj and Simran from DDLJ-inspired musical, Come Fall In LoveShah Rukh Khan met the cast of 'Come Fall In Love – The DDLJ Musical' in London. The musical, inspired by the iconic film 'Dilwale Dulhania Le Jayenge', will premiere in Manchester this month with Jena Pandya and Ashley Day in the lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/uorfi-javed-cannes-debut-hits-snag-as-visa-gets-rejected-i-aint-stopping-2724685-2025-05-14",
      "headline": "Uorfi Javed's Cannes debut hits snag as visa gets rejected: I ain't stoppingSocial media star Uorfi Javed shared a post and informed about her visa being rejected amid her Cannes debut. Uorfi even spoke about her business failures and struggles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-disappointed-virat-kohli-retirement-asks-him-to-reconsider-2724630-2025-05-14",
      "headline": "Javed Akhtar 'disappointed' with Virat Kohli's retirement, asks him to reconsiderVeteran lyricist Javed Akhtar is 'disappointed' with Virat Kohli's retirement. He requested the cricketer to reconsider his decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-soft-launching-her-relationship-with-raj-nidimoru-in-new-viral-pic-2724623-2025-05-14",
      "headline": "Did Samantha just soft-launch her relationship with Raj Nidimoru in new pic?Actor Samantha shared a picture on social media in which she could be seen resting her head on Raj Nidimoru's shoulders. Now, fans believe that she's making her relationship official. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-mission-impossible-the-final-reckoning-advance-booking-india-record-breaking-figures-for-opening-weekend-2724594-2025-05-14",
      "headline": "Tom Cruise's Mission Impossible-Final Reckoning eyes record advance booking in India'Mission: Impossible - The Final Reckoning' is set to break its previous advance booking record in India. The Tom Cruise film is already selling tickets like hotcakes at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/criminal-justice-trailer-pankaj-tripathis-case-has-three-sides-of-truth-watch-2724600-2025-05-14",
      "headline": "Criminal Justice trailer: Pankaj Tripathi's case has three sides of truth. WatchThe trailer for 'Criminal Justice - A Family Matter' has been released. The trailer gives a glimpse into the high-stakes legal battle in the upcoming season. Featuring Pankaj Tripathi, the fourth season of the series will stream on JioHotstar starting May 29. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-warns-of-kali-avatar-if-no-photo-rule-for-her-twins-is-broken-2724550-2025-05-14",
      "headline": "Preity Zinta warns of 'Kali Avatar' if no-photo rule for her twins is brokenActor Preity Zinta talked about wanting privacy for her twins, Jai and Gia, in a recent Ask Me Anything session on X, and highlighted the importance of setting boundaries with the paparazzi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angela-bassett-mission-impossible-us-president-empowers-women-final-reckoning-india-exclusive-2724562-2025-05-14",
      "headline": "Exclusive: Actor Angela Bassett on playing President in MI, Tom Cruise, and IndiaAngela Bassett stars as the American President in 'Mission Impossible: The Final Reckoning.' Her role highlights women empowerment and celebrates Indian fashion influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakondas-kingdom-release-date-postponed-amid-india-pak-tensions-2724569-2025-05-14",
      "headline": "Vijay Deverakonda's Kingdom release date postponed amid India-Pak tensionsVijay Deverakonda's action drama 'Kingdom', directed by Gautham Tinnanuri, has been officially postponed. The film, initially planned for a summer release on May 30, will now arrive in cinemas on July 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-meets-ex-boxing-champion-julius-francis-at-london-fan-meet-2724555-2025-05-14",
      "headline": "Actor Ram Charan meets ex-boxing champion Julius Francis at London fan meetActor Ram Charan honoured former British boxing champion Julius Francis, who was a bouncer at his fan event in London. He requested the 'RRR' actor to place a boxing belt on his shoulder. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pak-bases-chinese-supplied-air-defence-systems-operation-sindoor-pahalgam-attack-2724799-2025-05-14",
      "headline": "Jammed air defence, mission over in 23 minutes: How India struck Pak basesAccording to the government, the Air Force bypassed and jammed Pakistan's Chinese-supplied air defence systems during Operation Sindoor and the mission was completed in just 23 minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-pakistan-conflict-ceasefire-asim-munir-victory-citizens-lost-2724684-2025-05-14",
      "headline": "Asim Munir has won, Pakistanis have lost, againHow General Asim Munir sparked and used the recent India-Pakistan conflict to solidify his leadership and his Army's stature even as the country struggles with political and economic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-minister-vijay-shah-apologises-insulting-remark-colonel-sofiya-qureshi-2724858-2025-05-14",
      "headline": "'I am ashamed': BJP minister apologises for his remarks on Colonel Sofiya QureshiBJP leader Vijay Shah's recent remark on Colonel Sofiya Qureshi sparked backlash from political parties. The Jabalpur High Court also took note of the derogatory remark. Following the outrage, Vijay Shah apologised on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-cwc-meeting-congress-remarks-india-pakistan-conflict-government-stance-2724850-2025-05-15",
      "headline": "Crossed Lakshman Rekha: Shashi Tharoor faces Congress heat over Op Sindoor remarksCongress MP Shashi Tharoor faced heat for his recent remarks on the India-Pakistan conflict, with a party leader saying he crossed the 'Lakshman Rekha' for such statements, according to party sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/four-indian-origin-ministers-power-canadas-new-cabinet-heres-who-they-are-anita-anand-maninder-sidhu-ruby-sahota-2724803-2025-05-14",
      "headline": "Four Indian-origin ministers power Canada's new Cabinet: Here's who they areFour Indian-origin MPs are part of Canadian PM Mark Carney's new Cabinet, with Anita Anand being the Foreign Minister. The three others are Maninder Sidhu, Ruby Sahota and Randeep Sarai. Here's more about the Indo-Canadians in Carney Cabinet and their roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pakistan-front-on-the-boil-how-china-tried-to-irk-india-from-east-2724746-2025-05-14",
      "headline": "Pakistan front on the boil, how China tried to irk India from eastBeijing asserted claim over Arunachal Pradesh with same-old renaming ploy; New Delhi pushed back with strong rejection and blocking of Chinese state media 'Global Times'\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/launch-of-indian-astronaut-shubhanshu-shukla-to-space-station-postponed-2724896-2025-05-15",
      "headline": "Launch of Indian astronaut Shubhanshu Shukla to Space Station postponedShukla, who was originally scheduled to launch on May 29 as part of Axiom Space's Ax-4 mission, will now lift off from Nasa's Kennedy Space Center in Florida in early June due to a minor technical issue detected during pre-launch preparations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-vvip-jet-indian-air-force-strike-nur-khan-airbase-rawalpindi-probe-imagery-2724690-2025-05-14",
      "headline": "Exclusive: Pak's VVIP jet near Indian Air Force strike zone on May 10, probe showsSatellite imagery from space company Satellogic confirms a VVIP aircraft matching the specifications of a white G450 - G-IV-X present approximately 435 metres from the missile impact site at Nur Khan airbase in Rawalpindi on May 10."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/did-us-president-donald-trump-receive-a-400-million-bribe-from-qatar-plane-air-force-one-boeing-747-8-2724533-2025-05-14",
      "headline": "Why Trump pocketing an entire Boeing 747-8 from Qatar is not without risksUS President Donald Trump is receiving a $400-million luxury Boeing 747-8 from Qatar's first family. This is deeply problematic, not only because it is daylight bribery, but also because tiny Qatar works against the interests of the US and its allies. Here's why Americans are questioning Trump's \"kleptocracy\". "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indians-cancels-trips-turkey-azerbaijan-over-support-to-pakistan-2724710-2025-05-14",
      "headline": "Indians say no to Turkey, Azerbaijan trips over support to PakistanAngered over Turkey backing Pakistan during conflict with India, Indians are cancelling their travel plans to Turkey and Azerbaijan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-praises-syria-president-saudi-arabia-meeting-2724817-2025-05-14",
      "headline": "Attractive guy: Trump's praise for Syrian President, formerly linked to al-QaedaUS President Donald Trump urged Syria's Ahmed al-Sharaa to join countries such as the United Arab Emirates, Bahrain and Morocco, which normalised ties with Israel under the US-brokered Abraham Accords in 2020."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/story/jnu-suspends-agreement-turkey-university-national-security-consideration-pak-support-2724753-2025-05-14",
      "headline": "Stand with nation: JNU suspends agreement with Turkey universityJawaharlal Nehru University has suspended its academic agreement with a Turkish university, citing national security concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/day-1-of-cannes-2025-and-celebs-are-already-snubbing-the-new-dress-code-2724749-2025-05-14",
      "headline": "Day 1 of Cannes 2025, and celebs are already snubbing the new dress codeAhead of the Cannes Film Festival opening, the organising committee announced new dress code rules for 'decency' purposes, but many celebrities unabashedly ignored them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-abcd-of-op-sindoor-pakistan-needs-to-learn-and-recite-265-14-05-2025",
      "headline": "The ABCD of OP Sindoor Pakistan needs to learn, and reciteIn the lexicon of geopolitics, the phrase 'Operation Sindoor' will be written like a bold statement in red, emblazoned with the hues of India's pride, resolve and retribution"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pm-modi-adampur-airbase-visit-shehbaz-sharif-sialkot-cantonment-pakistan-operation-sindoor-2724761-2025-05-14",
      "headline": "Day after PM Modi's airbase visit, Shehbaz Sharif's similar move in PakistanPakistan Prime Minister Shehbaz Sharif visited Sialkot's Pasrur Cantonment and interacted with officers and soldiers involved in the recent military confrontation with India. The visit came a day after PM Narendra Modi visited the Adampur airbase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-live-operation-sindoor-us-trump-pak-radiation-leak-reports-air-strikes-pm-modi-bjp-congress-2724443-2025-05-14",
      "headline": "Indian technical team to meet UN sanctions committee over Pahalgam terror attackIndia-Pakistan Ceasefire Live: A team from India arrived in New York to meet the UN 1267 sanctions committee over the Pahalgam terror attack where 26 people - mostly tourists – were killed. Following the attack, Indian armed forces launched Operation Sindoor on May 7 targeting terrorist hideouts in Pakistan. Defence Minister Rajnath Singh told an all-party meeting on May 8 that at least 100 hardcore terrorists and their associates were killed in Indian strikes on terror sites in Pakistan and Pakistan-occupied-Kashmir (PoK) under the ongoing Operation Sindoor. The two neighbouring countries reached an understanding for ceasefire on May 10 following intense cross-border strikes for four days. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-soft-launching-her-relationship-with-raj-nidimoru-in-new-viral-pic-2724623-2025-05-14",
      "headline": "Did Samantha just soft-launch her relationship with Raj Nidimoru in new pic?Actor Samantha shared a picture on social media in which she could be seen resting her head on Raj Nidimoru's shoulders. Now, fans believe that she's making her relationship official. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2024-virat-kohli-2023-the-year-of-team-indias-gale-force-2724651-2025-05-14",
      "headline": "From the India Today archives (2024) | Virat Kohli, 2023: The year of Team India's gale forceKohli, who has retired from Tests, crossed monumental milestones in 2023 and reclaimed his position as one of cricket's best all-format batsmen\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-turkey-helped-pakistan-drones-military-celebi-handles-high-security-job-indian-airport-delhi-mumbai-2724631-2025-05-14",
      "headline": "Turkey aided Pak, but its Celebi handles high-security tasks at Indian airportsSubsidiaries of a Turkish company, Celebi Aviation, are involved in high-security tasks, including cargo handling, at several Indian airports. It could cause some unease as it comes to light that Turkey not only supplied military drones, but even Turkish operatives to assist Pakistan as it attacked India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lashkar-e-taiba-terror-allies-glorify-pak-military-operation-operation-bunyan-marsoos-threaten-india-2724496-2025-05-14",
      "headline": "Lashkar, terror allies glorify Pak military op, threaten India at Karachi rallyRadical clerics and leaders from banned and controversial groups assembled under the umbrella of the Difa-e-Watan Council (DWC) -- an alliance known for hosting extremist ideologues -- to heap praise on the military's role in the aftermath of Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/virat-kohli-premanand-maharaj-prasann-ho-anushka-sharma-question-viral-video-2724485-2025-05-14",
      "headline": "Virat Kohli's reply to Premanand Maharaj's 'Prasann Ho' question goes viralA day after announcing his Test retirement, Virat Kohli visited Shri Hit Radha Keli Kunj Ashram in Vrindavan with Anushka Sharma to seek blessings. A video of their conversation with Premanand Maharaj has since gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/qatar-signs-200-billion-deal-to-buy-160-jets-from-boeing-donald-trump-visit-2724804-2025-05-14",
      "headline": "Qatar signs $200 billion deal to buy 160 jets from Boeing during Trump's visitQatar has signed a deal to buy 160 jets from the US manufacturer Boeing. The deal comes during US President Donald Trump's visit to the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-reconsider-indus-treaty-stance-government-suspension-to-remain-in-place-2724720-2025-05-14",
      "headline": "Pak ministry writes to India, urges it to reconsider Indus treaty stance: SourcesPakistan's Ministry of Water Resources has written to the Ministry of External Affairs to reconsider the move to pause the World Bank-brokered Indus Waters Treaty after New Delhi paused it following the Pahalgam terror attack, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-test-fires-bhargavastra-how-it-goes-into-hard-kill-mode-2724696-2025-05-14",
      "headline": "India test fires Bhargavastra: How it goes into hard kill modeBhargavastra is a low-cost, modular system designed for rapid deployment across diverse terrains, including high-altitude regions above 5,000 metres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-gives-funny-reaction-to-rrr-2-query-2724812-2025-05-14",
      "headline": "SS Rajamouli gives funny reaction to 'RRR 2' query. WatchUpasana Kamineni playfully asked director SS Rajamouli about the much-awaited 'RRR 2' during a special London screening, sparking excitement among fans. While Rajamouli gave a humorous reaction, the sequel remains unconfirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-jr-ntr-hold-hands-at-rrr-screening-at-royal-albert-hall-london-watch-2724809-2025-05-14",
      "headline": "Ram Charan, Jr NTR hold hands at RRR screening at Royal Albert Hall, London. Watch'RRR' actor Ram Charan recently shared a reel on Instagram offering fans a peek into what went on backstage during the actor's recent visit to London for the 'RRR' live orchestra screening at the Royal Albert Hall on May 11, with director SS Rajamouli and co-star Jr NTR. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/photo/tom-cruise-returns-to-cannes-with-mission-impossible-the-final-reckoning-team-2724797-2025-05-14",
      "headline": "Tom Cruise returns to Cannes with Mission Impossible teamHollywood star Tom Cruise returned to the Cannes Film Festival with 'Mission Impossible- The Final Reckoning' team. Take a look at their pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ram-lakhan-duo-jackie-shroff-and-anil-kapoor-to-reunite-for-srks-king-report-2724783-2025-05-14",
      "headline": "Ram Lakhan duo Jackie Shroff and Anil Kapoor to reunite for SRK's King: ReportBollywood stars Jackie Shroff and Anil Kapoor will be reuniting with Shah Rukh Khan for the action-packed thriller 'King', which begins filming on May 20. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-commits-to-manchester-united-despite-poor-premier-league-form-2724887-2025-05-14",
      "headline": "Manchester United boss Ruben Amorim insists he has no plans to quitManchester United manager Ruben Amorim said he has no plans to leave the club, claiming his passionate comments following Sunday's 2-0 loss to West Ham United sprang from a sense of responsibility for the team's bad performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-romario-shepherd-liam-livingstone-rejoin-rcb-squad-in-bengaluru-2724878-2025-05-14",
      "headline": "IPL 2025: Romario Shepherd, Liam Livingstone rejoin RCB squad in BengaluruRCB's overseas recruits Romario Shepherd and Liam Livingstone are back in India to rejoin the Royal Challengers Bengaluru squad ahead of the last leg of IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/tottenham-hotspur-kulusevski-surgery-europa-league-final-vs-manchester-united-2724851-2025-05-14",
      "headline": "Tottenham confirm huge Kulusevski injury blow ahead of Europa League finalTottenham Hotspur have confirmed that Dejan Kulusevski underwent surgery a week before the Europa League final and is set to miss the title clash against Manchester United in Bilbao.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-ipl-2025-participation-bcb-denies-noc-request-delhi-capitals-2724839-2025-05-14",
      "headline": "Bangladesh denies knowledge of Mustafizur Rahman's Delhi Capitals dealThe Bangladesh Cricket Board (BCB) CEO Nizamuddin Chowdhury has said that neither the board nor he received any official request from pacer Mustafizur Rahman regarding a no-objection certificate (NOC) to participate in the Indian Premier League (IPL) 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-player-repalcement-rules-explained-resumption-retention-2724842-2025-05-14",
      "headline": "How IPL's new player replacement rules will benefit franchisesThe BCCI has introduced revised temporary replacement rules for IPL 2025 due to the season's rescheduling. Franchises can now sign replacements until the tournament's end, though signings made after IPL's suspension won't be eligible for retention in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-funds-manchester-united-staff-europa-league-final-trip-2724828-2025-05-14",
      "headline": "Amorim pays for Manchester United staff to attend UEL final after club refusalManchester United head coach Ruben Amorim has shown a touch of class ahead of the Europa League final by personally covering the costs for 30 members of his backroom staff and their families to attend the highly anticipated clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-meets-pope-leo-xiv-vatican-italian-open-2724825-2025-05-14",
      "headline": "Tennis star Jannik Sinner meets Pope Leo XIV at Vatican, presents racquetWorld No. 1 tennis player, along with his parents, met Pope Leo XIV in the Vatican on Wednesday, May 14. Leo, a known enthusiast of the sport, became the first US cleric to lead the Roman Catholic church."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-malvika-bansod-aakarshi-kashyap-unnati-hooda-advance-thailand-open-2724801-2025-05-14",
      "headline": "Lakshya Sen stunned as Indian women shine in Thailand OpenStar shuttler Lakshya Sen suffered an unexpected defeat at the Thailand Open. Meanwhile, Indian women players made strong progress, highlighting growing depth in Indian badminton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-timline-events-australia-tour-ipl-captaincy-2724794-2025-05-14",
      "headline": "Virat Kohli retirement: Timeline of events that led to end of decorated Test careerVirat Kohli's unexpected retirement from Test cricket followed months of mixed signals from the management and selectors and mounting uncertainty over his role in the team. Once determined to tour England, Kohli ultimately chose to step away from the format he cherished most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-manager-hansi-flick-reaction-carlo-ancelotti-brazil-manager-2724780-2025-05-14",
      "headline": "Carlo Ancelotti did fantastic job in Madrid, will succeed in Brazil: Hansi FlickBarcelona manager Hansi Flick lauded Carlo Ancelotti's successful stint at Real Madrid and backed him to thrive as Brazil's new head coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-close-in-on-no-2-in-odi-rankings-after-tri-series-triumph-in-sri-lanka-2724777-2025-05-14",
      "headline": "India close in on no 2 in ODI rankings after tri-series triumph in Sri LankaThe Indian women's cricket team are closing in on the second spot in the ICC ODI rankings following their tri-series triumph in Sri Lanka. The Women in Blue beat the hosts in the final by 97 runs to kick-start their ODI World Cup preparations.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-meets-pope-leo-xiv-vatican-italian-open-2724825-2025-05-14",
      "headline": "Tennis star Jannik Sinner meets Pope Leo XIV at Vatican, presents racquetWorld No. 1 tennis player, along with his parents, met Pope Leo XIV in the Vatican on Wednesday, May 14. Leo, a known enthusiast of the sport, became the first US cleric to lead the Roman Catholic church."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-malvika-bansod-aakarshi-kashyap-unnati-hooda-advance-thailand-open-2724801-2025-05-14",
      "headline": "Lakshya Sen stunned as Indian women shine in Thailand OpenStar shuttler Lakshya Sen suffered an unexpected defeat at the Thailand Open. Meanwhile, Indian women players made strong progress, highlighting growing depth in Indian badminton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-timline-events-australia-tour-ipl-captaincy-2724794-2025-05-14",
      "headline": "Virat Kohli retirement: Timeline of events that led to end of decorated Test careerVirat Kohli's unexpected retirement from Test cricket followed months of mixed signals from the management and selectors and mounting uncertainty over his role in the team. Once determined to tour England, Kohli ultimately chose to step away from the format he cherished most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-manager-hansi-flick-reaction-carlo-ancelotti-brazil-manager-2724780-2025-05-14",
      "headline": "Carlo Ancelotti did fantastic job in Madrid, will succeed in Brazil: Hansi FlickBarcelona manager Hansi Flick lauded Carlo Ancelotti's successful stint at Real Madrid and backed him to thrive as Brazil's new head coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-close-in-on-no-2-in-odi-rankings-after-tri-series-triumph-in-sri-lanka-2724777-2025-05-14",
      "headline": "India close in on no 2 in ODI rankings after tri-series triumph in Sri LankaThe Indian women's cricket team are closing in on the second spot in the ICC ODI rankings following their tri-series triumph in Sri Lanka. The Women in Blue beat the hosts in the final by 97 runs to kick-start their ODI World Cup preparations.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}