{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-share-price-today-strong-rally-after-q4-results-brokerage-views-guidance-2713202-2025-04-23",
      "headline": "Explained: Why HCLTech share price gained 7% in early tradeHCLTech shares were up 6.07% to Rs 1,569.95 at around 9:19 am.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-nse-bse-sensex-jumps-500-points-nifty-above-24300-hcltech-gains-6-percent-2713198-2025-04-23",
      "headline": "Sensex, Nifty extend gains on positive global cues; HCL Tech surges over 7%The S&P BSE Sensex added 572.48 points to 80,168.07, while the NSE Nifty50 gained 165.90 points to 24,333.15 as of 9:18 am.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-data-network-transfers-entire-spectrum-to-airtel-bharti-hexacom-roll-out-obligations-2713193-2025-04-23",
      "headline": "Adani exits telecom play, transfers entire spectrum to AirtelThe development comes at a time when Adani Data Network was at risk of losing its entire 400 megahertz (MHz) spectrum in the 26 Gigahertz (GHz) band for not meeting its roll-out obligations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-opening-dalal-street-expectation-trading-april-23-2713187-2025-04-23",
      "headline": "Sensex, Nifty opening: Stock markets to open higher. Here's whyStock market indices closed in the green for the sixth day in a row, and Nifty hit a new calendar year high of 24,242 on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-focus-april-23-hlctech-airtel-ltimindtree-bajaj-housing-finance-2713181-2025-04-23",
      "headline": "Stocks to watch on April 23: HLCTech, Airtel, LTIMindtree, Bajaj Housing FinanceSeveral stocks such as HCLTech, Airtel, Waaree Energies, Varun Beverages, tec are likely to remain in focus today due to earnings updates, business announcements, and market activity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/imf-cuts-global-growth-forecast-cites-significant-slowdown-due-to-trump-tariffs-2712979-2025-04-22",
      "headline": "IMF cuts global growth forecast, cites 'significant slowdown' due to Trump tariffsThe IMF reduced its global growth forecast to 2.8% for 2025, down by 0.5 percentage point, while the 2024 forecast was cut by 0.3 points to 3%, down from the January projection of 3.3% for both years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tankup-engineers-ipo-check-price-dates-gmp-and-should-you-subscribe-2712921-2025-04-22",
      "headline": "Tankup Engineers IPO: Check price, dates, GMP and should you subscribe?Tankup Engineers, known for building specialised vehicle superstructures, aims to raise Rs 19.53 crore through a fresh issue of 13.95 lakh shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-is-money-zoho-sridhar-vembu-backs-yellow-metal-as-prices-cross-rs-1-lakh-2712833-2025-04-22",
      "headline": "'Gold is money': Zoho's Sridhar Vembu backs yellow metal as prices cross Rs 1 lakhOn Monday, gold June futures on the MCX hit a new high of Rs 99,178 per 10 grams, up nearly Rs 1,900 from the previous close. In the physical market, gold traded at Rs 97,200 per 10 grams (excluding GST), taking the final retail price past Rs 1 lakh after adding 3% GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-187-points-higher-nifty-above-24100-indusind-bank-down-5-percent-2712840-2025-04-22",
      "headline": "Sensex closes 187 points higher, Nifty above 24,100; IndusInd bank down 5%The S&P BSE Sensex gained 187.09 points to close at 79,595.59, while the NSE Nifty50 added 41.70 points to end at 24,167.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-in-us-usd-3500-donald-trump-fed-chair-jerome-powell-economic-slowdown-2712836-2025-04-22",
      "headline": "Gold prices jump to $3,500 amid Trump vs Powell dramaPrices of gold, traditionally seen as a safe-haven asset amid economic and geopolitical uncertainty, have risen by nearly a third so far this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-eyes-public-listing-to-shift-base-from-singapore-to-india-ahead-of-ipo-2712827-2025-04-22",
      "headline": "Walmart-backed Flipkart to return to India ahead of much-awaited IPOFlipkart has grown into a large e-commerce platform that competes directly with Amazon in the market and is planning a public listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-souk-jewellery-market-gold-prices-rise-jewellers-not-happy-diamond-demand-increase-2712777-2025-04-22",
      "headline": "Gold prices are booming, but Dubai's iconic Gold Souk is losing its sparkleThere are signs of change amid rising prices for gold, as buyers look to diamonds and lighter gold jewellery, instead."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-recreates-90s-magic-with-her-dance-on-le-gayi-le-gayi-watch-2713200-2025-04-23",
      "headline": "Karisma Kapoor recreates 90s magic with her dance on 'Le Gayi Le Gayi'. WatchActor Karisma Kapoor recreated 90s magic with her dance on 'Le Gayi Le Gayi' from the film, 'Dil Toh Pgal Hai'. A video from the event has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-demands-ruthless-action-for-pahalgam-attack-punish-them-for-7-lifetimes-2713208-2025-04-23",
      "headline": "Punish them for 7 lifetimes: Anupam Kher demands ruthless action for Pahalgam attackActor Anupam Kher, a Kashmiri, condemned the Pahalgam attack in a video on social media. A visibly emotional and furious Kher requested PM Modi and Amit Shah to not spare the terrorists this time. He called the attack beyond barbaric, and mentioned the wife of one of the victims, whose photo is going viral on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-film-body-shine-tom-chaco-warning-drug-use-misconduct-row-2713205-2025-04-23",
      "headline": "One last chance: Kerala film body warns Shine Tom Chacko amid misconduct rowThe Film Employees Federation of Kerala (FEFKA) issued a final warning to actor Shine Tom Chacko. He was accused of substance abuse and misconduct by fellow actor Vincy Aloshious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-nyweide-child-actor-in-noah-and-an-invisible-sign-dies-at-24-2713190-2025-04-23",
      "headline": "Sophie Nyweide, child actor in Noah and An Invisible Sign, dies at 24Actor Sophie Nyweide died on April 14, her family's obituary confirmed. Her family wrote that she self-medicated and refused to take medical help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-return-delhi-left-kashmir-before-pahalgam-terror-attack-2713183-2025-04-23",
      "headline": "Dipika Kakar, Shoaib Ibrahim left Kashmir just before Pahalgam terror attackThe television couple, Dipika Kakar and Shoaib Ibrahim, who were holidaying in Pahalgam just two days before the terror attack, revealed that they reached Delhi safely. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohanlal-sanjay-dutt-raveena-tandon-nani-celebrities-pahalgam-terror-attack-2713171-2025-04-23",
      "headline": "Shocked, angry: Mohanlal, Sanjay Dutt and celebs condemn Pahalgam terror attackMohanlal, Sanjay Dutt, Chiranjeevi, Raveena Tandon, Nani and several others expressed their shock upon hearing about the Pahalgam terror attack on Tuesday. Twenty six people, including two foreigners, died in the attack in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-teaser-arrives-on-april-23-lady-gaga-joins-the-cast-glbs-2713156-2025-04-23",
      "headline": "Wednesday Season 2 teaser arrives on April 23, Lady Gaga joins the castNetflix will release the first teaser for Wednesday Season 2 on April 23. The darker new season stars Jenna Ortega, returns key cast members, and introduces Lady Gaga in a surprise role.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hailey-bieber-dealing-with-two-ovarian-cysts-shares-health-update-glbs-2713151-2025-04-23",
      "headline": "Hailey Bieber 'dealing with two ovarian cysts', shares health updateHailey Bieber shares health update on Instagram, revealing she's dealing with two ovarian cysts. The model previously opened up about similar struggles, adding to ongoing conversations on women's health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/enola-holmes-3-all-you-need-to-know-about-millie-bobby-browns-upcoming-film-glbs-2713150-2025-04-23",
      "headline": "Enola Holmes 3: All you need to know about Millie Bobby Brown's upcoming film\"Millie Bobby Brown returns as the clever young detective in Enola Holmes 3, now filming in the UK. Get all the latest on the plot, cast, director, and Netflix release updates for the upcoming mystery adventure.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heartstopper-bids-farewell-nick-charlies-journey-concludes-with-netflix-feature-film-glbs-2713136-2025-04-23",
      "headline": "Heartstopper bids farewell: Nick & Charlie's journey concludes with Netflix feature filmNetflix's LGBTQ+ hit Heartstopper will conclude with a feature film in 2025. The movie wraps up Nick and Charlie's love story, offering fans a heartfelt final chapter from creator Alice Oseman.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-actor-lalit-manchandi-dies-suicide-suspected-2713101-2025-04-22",
      "headline": "Taarak Mehta... actor Lalit Manchanda dies, television association pays tributeActor Lalit Manchanda, known for his roles in TV shows like Taarak Mehta Ka Ooltah Chashmah, was found dead at his Meerut residence. The news was confirmed by CINTAA."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-hina-khan-kashmiri-reacts-to-pahalgam-terrorist-attack-2713062-2025-04-22",
      "headline": "Actor Hina Khan, a Kashmiri, reacts to Pahalgam attackActor Hina Khan, a Kashmiri herself, has expressed her sorrow and condemnation over the recent terrorist attack on tourists in Pahalgam through an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-arjun-sarkar-meant-to-be-a-cameo-did-hit-2-to-end-on-a-high-2712897-2025-04-22",
      "headline": "HIT 3 actor Nani says Arjun Sarkar was just meant to be a cameoActor Nani reveals that his role in 'HIT 3' was not originally planned as a full-fledged lead. What began as a cameo in 'HIT 2' evolved into the intense cop character Arjun Sarkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rajinikanth-amitabh-bachchan-ranbir-kapoor-deepika-padukone-indian-actors-to-attend-wave-summit-2025-mumbai-2712944-2025-04-22",
      "headline": "Rajinikanth, Big B, Deepika, other stars to attend WAVES Summit 2025 in MumbaiIndia's biggest film stars from across industries, along with the biggest names in the entertainment industry worldwide, will be attending the World Audio Visual and Entertainment Summit (WAVES) 2025 in Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-trailer-ishaan-khatter-bhumi-pednekar-zeenat-aman-2712997-2025-04-22",
      "headline": "The Royals trailer: Ishaan-Bhumi's chemistry is ok, but we are in for Zeenat AmanThe trailer for Netflix's 'The Royals' reveals a fading city where a prince and CEO team up, leading to unexpected romance and drama. The series features Ishaan Khatter and Bhumi Pednekar and it will stream from May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sebastian-stan-calls-trump-narcissist-he-mustve-seen-the-apprentice-100-times-2712987-2025-04-22",
      "headline": "Sebastian Stan calls Trump 'narcissist': He must've seen The Apprentice 100 timesIn a recent Vanity Fair interview, actor Sebastian Stan criticised Donald Trump, labelling him a 'narcissist' and speculating on his obsession with 'The Apprentice'. Stan also discussed Trump's potential reaction to a film portrayal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-condemns-pahalgam-attack-sheer-evil-to-kill-innocent-people-2712993-2025-04-22",
      "headline": "Akshay Kumar condemns Pahalgam attack: Sheer evil to kill innocent peopleBollywood actor Akshay Kumar has condemned the recent terror attack on tourists in Pahalgam, Jammu and Kashmir, which resulted in one death and twelve injuries. He expressed his horror at the incident and offered prayers for the victims' families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/martin-scorsese-to-leonardo-dicaprio-hollywood-celebs-remember-pope-francis-2712937-2025-04-22",
      "headline": "Martin Scorsese to Leonardo DiCaprio, Hollywood celebs remember Pope FrancisPope Francis' death at 88 led to tributes from actors, filmmakers and other celebrities across Hollywood. Martin Scorsese, Leonardo DiCaprio, Whoopi Goldberg, Eva Longoria, Antonio Banderas, and Russell Crowe expressed their grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-buys-home-in-qatar-after-stabbing-incident-in-mumbai-2712918-2025-04-22",
      "headline": "Saif Ali Khan buys home in Qatar after stabbing incident in MumbaiActor Saif Ali Khan recently bought a luxurious home in Qatar. The actor referenced that the place should be 'safe and comfortable.' "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-and-kashmir-first-image-one-of-terrorists-tourists-opened-fire-exclusive-2713184-2025-04-23",
      "headline": "Exclusive: J&K attacker seen wielding AK-47 during Pahalgam attack in first photoTwenty-six people were killed after terrorists opened fire on a group of tourists at Baisaran meadow in Jammu and Kashmir's Pahalgam at around 2:30 PM on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-and-kashmir-infiltration-bid-foiled-indian-army-baramulla-massacre-pakistan-terrorists-killed-2713201-2025-04-23",
      "headline": "Army kills 2 terrorists, foils infiltration bid in Baramulla post Pahalgam attackThe Indian Army foiled an infiltration bid in Baramulla, killing two terrorists amid an intense firefight. This comes a day after a deadly terror attack in Pahalgam claimed 26 lives, prompting a national security response.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-jammu-kashmir-terror-attack-pm-modi-security-meeting-lashkar-trf-deaths-eyewitness-amit-shah-rahul-gandhi-2713170-2025-04-23",
      "headline": "Top Lashkar commander planned Pahalgam carnage that left 26 dead: SourcesThe Pahalgam attack, the biggest terror strike on civilians since the 26/11 attacks, occurred when terrorists dressed in fatigues opened fire on tourists in Baisaran meadow. Following the attack, PM Modi returned to Delhi to take stock of the situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pahalgam-terrorist-attack-video-shows-exact-moment-terrorists-attacked-tourists-in-jk-2713197-2025-04-23",
      "headline": "Gunshots, screams, chaos: Video shows moment terrorists attacked tourists in J&KIndia Today has accessed the exact moment when terrorists belonging to The Resistance Front—an offshoot of proscribed terror group Lashkar-e-Taiba (LeT)—opened fire on tourists at the popular Baisaran meadow in Pahalgam on Tuesday afternoon, killing 26 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/flight-data-shows-pakistan-deploying-military-assets-to-bases-near-j-k-glbs-2713153-2025-04-23",
      "headline": "Has Pak deployed military assets to bases near J&K after Pahalgam attack?After the attack in Pahalgam, X has been flooded with posts showing screenshots from a flight tracking website that seem to show PAF aircraft leaving for bases in the north near Lahore and Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-terror-attack-pahalgam-killed-injured-security-forces-terrorists-2712876-2025-04-22",
      "headline": "Live: Amit Shah to visit Pahalgam terror attack site, meet victimsTerror Attack In Pahalgam Live Updates: In a rare terror attack on tourists in Jammu and Kashmir on Tuesday, 26 people died. Several tourists were also injured. Terrorists attacked a group of tourists visiting Baisaran valley in Pahalgam in Jammu and Kashmir, officials said. According to initial inputs, unidentified gunmen opened fire on the tourists who had gone for a trekking trip. Prime Minister Narendra Modi landed in Delhi this morning after cutting short his Saudi Arabia visit in view of the Pahalgam terrorist attack in Kashmir. He is likely to hold a Cabinet meeting today. Several top leaders have condemned the attack. Stay tuned with indiatoday.in for live updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jk-terror-attack-ib-officer-on-family-holiday-navy-officer-on-honeymoon-killed-pahalgam-attack-2713134-2025-04-23",
      "headline": "Intel officer was holidaying in Pahalgam, terrorists killed him in front of familyAn IB officer was killed in front of his wife and children in the Pahalgam terror attack in Jammu & Kashmir on Tuesday. An Indian Navy officer, who was recently married, was also killed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-cuts-short-saudi-arabia-visit-return-india-early-pahalgam-terror-attack-2713102-2025-04-22",
      "headline": "PM's emergency meet with S Jaishankar, NSA on J&K attack after returning to DelhiPrime Minister Narendra Modi cut short his two-day visit to Saudi Arabia and returned to New Delhi on Wednesday morning after 26 people were reportedly killed in a terror attack in Jammu and Kashmir's Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-rare-terror-attack-on-tourists-in-kashmir-reveals-pakistan-desperation-amarnath-yatra-2713018-2025-04-22",
      "headline": "Rare attack on tourists in Kashmir reveals Pakistan's desperationTuesday's attack on tourists by terrorists in Kashmir's Pahalgam is rare, considering the targets and the scale. Twenty-six people are feared dead. This could be a desperate bid by Pakistan, given the phase of peace and prosperity that Jammu and Kashmir has been witness to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-tourists-killed-injured-jammu-kashmir-ordeal-security-forces-2713085-2025-04-22",
      "headline": "Hindus were singled out, shot: Tourist's blow-by-blow account of Pahalgam attackAt least 26 people are feared dead and several others were injured after terrorists from a Lashkar-e-Taiba offshoot opened fire on tourists in Jammu and Kashmir's Pahalham on Tuesday afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pakistan-lashkar-commander-abu-musa-bloodshed-kashmir-2713189-2025-04-23",
      "headline": "Days ahead of Pahalgam attack, Lashkar commander called for bloodshed in J&KPahalgam attack: LeT commander Abu Musa referred to the abrogation of Article 370 and a bid to change the demography of Kashmir to call for attacks in the valley."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/world-leaders-condemn-pahalgam-terror-attack-us-russia-france-italy-israel-reaction-2713154-2025-04-23",
      "headline": "Deeply disturbing, brutal crime: World leaders condemn Pahalgam terror attackLeaders from all over the world, including US President Donald Trump, Russian President Vladimir Putin, and others, condemned the terror attack in Pahalgam and expressed solidarity with India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-demands-ruthless-action-for-pahalgam-attack-punish-them-for-7-lifetimes-2713208-2025-04-23",
      "headline": "Punish them for 7 lifetimes: Anupam Kher demands ruthless action for Pahalgam attackActor Anupam Kher, a Kashmiri, condemned the Pahalgam attack in a video on social media. A visibly emotional and furious Kher requested PM Modi and Amit Shah to not spare the terrorists this time. He called the attack beyond barbaric, and mentioned the wife of one of the victims, whose photo is going viral on the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/ap-ssc-10th-result-2025-timings-how-you-can-check-your-scores-on-india-today-2713203-2025-04-23",
      "headline": "Andhra Pradesh Class 10 result 2025 today at 10 am, check scores on India TodayThe AP SSC 10th result 2025 will be released today at 10 am. Students can check their scores on bse.ap.gov.in, India Today's result page, DigiLocker, and via SMS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-nse-bse-sensex-jumps-500-points-nifty-above-24300-hcltech-gains-6-percent-2713198-2025-04-23",
      "headline": "Sensex, Nifty extend gains on positive global cues; HCL Tech surges over 7%The S&P BSE Sensex added 572.48 points to 80,168.07, while the NSE Nifty50 gained 165.90 points to 24,333.15 as of 9:18 am.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-nyweide-child-actor-in-noah-and-an-invisible-sign-dies-at-24-2713190-2025-04-23",
      "headline": "Sophie Nyweide, child actor in Noah and An Invisible Sign, dies at 24Actor Sophie Nyweide died on April 14, her family's obituary confirmed. Her family wrote that she self-medicated and refused to take medical help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-ipl-2025-record-milestone-lsg-vs-dc-2713097-2025-04-22",
      "headline": "KL Rahul scripts history, becomes fastest to 5000 IPL runsIPL 2025, LSG vs DC: KL Rahul broke David Warner's record to become the fastest batter to the landmark of 5000 runs in the history of the tournament. He got there while playing for Delhi Capitals against Lucknow Super Giants on Monday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/peoples-pope-in-every-sense-kerala-church-recalls-legacy-of-pope-francis-2712880-2025-04-22",
      "headline": "'People's Pope in every sense': Kerala Church recalls legacy of Pope FrancisThroughout his 12-year papacy, Pope Francis maintained a close association with the Church in India, with a visit long on the cards\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-tourists-killed-injured-toll-jammu-kashmir-modi-terrorists-trf-2713044-2025-04-22",
      "headline": "5-6 Pak terrorists attacked tourists, arrived in Pahalgam few days back: SourcesA terror ambush on tourists in Jammu and Kashmir's Pahalgam left at least 26 people feared dead. Claimed by an LeT offshoot, the attack marked the deadliest strike on civilians in the Valley in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-data-network-transfers-entire-spectrum-to-airtel-bharti-hexacom-roll-out-obligations-2713193-2025-04-23",
      "headline": "Adani exits telecom play, transfers entire spectrum to AirtelThe development comes at a time when Adani Data Network was at risk of losing its entire 400 megahertz (MHz) spectrum in the 26 Gigahertz (GHz) band for not meeting its roll-out obligations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-return-delhi-left-kashmir-before-pahalgam-terror-attack-2713183-2025-04-23",
      "headline": "Dipika Kakar, Shoaib Ibrahim left Kashmir just before Pahalgam terror attackThe television couple, Dipika Kakar and Shoaib Ibrahim, who were holidaying in Pahalgam just two days before the terror attack, revealed that they reached Delhi safely. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/intel-to-reportedly-fire-20-per-cent-of-its-staff-this-week-2713199-2025-04-23",
      "headline": "Intel to reportedly fire 20 per cent of its staff this weekIntel is reportedly planning to fire 20 per cent of its staff this week. The layoffs are apparently aimed at streamlining management at the company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jk-pahalgam-terror-attack-chief-minister-omar-abdullah-reacts-abomination-perpetrators-animals-shocked-2712911-2025-04-22",
      "headline": "Pahalgam attack much larger than anything we've seen in...: Omar AbdullahOmar Abdullah said that the Pahalgam attack was \"much larger than anything we've seen directed at civilians in recent years\". At least 1 person has been killed and several injured in Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/newly-married-navy-officer-on-honeymoon-killed-in-pahalgam-terror-attack-2713155-2025-04-23",
      "headline": "26-year-old Navy officer, on honeymoon, killed in Pahalgam terror attackLieutenant Vinay Narwal, a 26-year-old Indian Navy officer from Karnal, Haryana, was shot dead by terrorists while he was enjoying his first trip with his wife to Pahalgam. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-weird-captaincy-anil-kumble-boucher-lsg-vs-dc-2713194-2025-04-23",
      "headline": "Too many changes, weird calls: How Rishabh Pant's LSG fell apart in revenge clashIPL 2025, LSG vs DC: Anil Kumble and Mark Boucher said the Lucknow Super Giants made too many changes, including tinkering with Rishabh Pant's batting position, leading to their eight-wicket defeat to the Delhi Capitals. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-mumbai-indians-will-be-unstoppable-after-beating-chennai-super-kings-2712225-2025-04-23",
      "headline": "IPL 2025 : Why Mumbai Indians will be unstoppable after thumping Chennai SuperThe Mumbai Indians (MI) have got their campaign back on track after registering three consecutive victories against Delhi Capitals, Sunrisers Hyderabad and Chennai Super Kings. Their victory run is an ominous sign for the opposition as they will become unstoppable with every win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/lost-momentum-after-great-start-dc-bowlers-made-a-good-comeback-lsg-assistant-coach-2713188-2025-04-23",
      "headline": "Lost momentum after great start, DC made a good comeback: LSG Assistant CoachLucknow Super Giants (LSG) Assistant coach Vijay Dahiya rued the loss of momentum after a good start against Delhi Capitals (DC). DC beat LSG by eight wickets in Match 40 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-ramiz-raja-says-ipl-during-psl-post-match-presentation-2713185-2025-04-23",
      "headline": "Watch: Ramiz Raja does major goof-up, says 'IPL' during PSL post-match presentationFormer Pakistan cricketer turned commentator Ramiz Raja accidentally said IPL during the post-match presentation of the Pakistan Super League 2025 (PSL 2025) Match 12 between Multan Sultans and Lahore Qalandars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-dc-delhi-capitals-wicketkeeper-abishek-porel-press-conference-india-2713186-2025-04-23",
      "headline": "IPL 2025: Abishek Porel dreams of India debut, IPL title with Delhi CapitalsAbishek Porel, the Delhi Capitals' rising star, said he is truly enjoying his batting this season and is still focused on making his international debut for India one day. Speaking after DC's convincing eight-wicket victory over Lucknow Super Giants, the left-hander stated, \"I am enjoying every innings. I'm enjoying each innings and seeing how I can improve myself.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-not-a-finisher-says-cheteshwar-pujara-2713176-2025-04-23",
      "headline": "Rishabh Pant not a finisher: Pujara advices LSG skipper to not go MS Dhoni wayIPL 2025, LSG vs DC: Veteran batter Cheteshwar Pujara said that Lucknow Super Giants skipper Rishabh Pant shouldn't try and replicate MS Dhoni since he isn't a finisher. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pants-animated-chat-with-zaheer-khan-lsg-vs-dc-2713163-2025-04-23",
      "headline": "Rishabh Pant's animated chat with Zaheer Khan after batting demotion vs DCIPL 2025: LSG skipper Rishabh Pant was caught in an animated chat with mentor Zaheer Khan during their clash against DC, as questions loomed over his batting demotion and a two-ball duck added to his woes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-porel-credits-axar-patel-dc-staff-for-backing-him-2713160-2025-04-23",
      "headline": "Abhishek Porel credits Axar Patel, DC staff for backing him after 51 vs LSGIPL 2025, LSG vs DC: Abhishek Porel credited the Delhi Capitals for helping him bounce back after he started his campaign with a duck against the Lucknow Super Giants in Vizag. On Tuesday, Porel's 51-run knock helped the Capitals beat LSG by eight wickets in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-dc-axar-patel-bowler-injury-immediate-impact-powerplay-2713132-2025-04-23",
      "headline": "Back from injury: Bowler Axar Patel makes immediate impact for DC in LSG winAxar Patel's sharp captaincy and gritty bowling helped DC clinch a convincing 8-wicket win over LSG, as the Delhi skipper stepped up in both innings to complete a season double in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-batting-lsg-vs-dc-ayush-badoni-impact-player-mayank-yadav-2713119-2025-04-22",
      "headline": "Rishabh Pant tries to explain demotion in bizarre post-match interviewLSG captain Rishabh Pant tried to explain the bizarre call of batting at No.7 against Delhi Capitals. Rishabh was not able to express his thoughts clearly and said that he wanted the other batters to capitalise on the Lucknow pitch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-dc-match-report-rishah-pant-falter-kl-rahul-special-2713100-2025-04-22",
      "headline": "KL Rahul special forces LSG to capitulate against DC 2nd time in IPL 2025IPL 2025: Delhi Capitals completed a season double over Lucknow Super Giants with a eight-wicket win in Lucknow, as KL Rahul's composed fifty outshone a misfiring Rishabh Pant and a collapsing LSG middle-order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pants-animated-chat-with-zaheer-khan-lsg-vs-dc-2713163-2025-04-23",
      "headline": "Rishabh Pant's animated chat with Zaheer Khan after batting demotion vs DCIPL 2025: LSG skipper Rishabh Pant was caught in an animated chat with mentor Zaheer Khan during their clash against DC, as questions loomed over his batting demotion and a two-ball duck added to his woes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-porel-credits-axar-patel-dc-staff-for-backing-him-2713160-2025-04-23",
      "headline": "Abhishek Porel credits Axar Patel, DC staff for backing him after 51 vs LSGIPL 2025, LSG vs DC: Abhishek Porel credited the Delhi Capitals for helping him bounce back after he started his campaign with a duck against the Lucknow Super Giants in Vizag. On Tuesday, Porel's 51-run knock helped the Capitals beat LSG by eight wickets in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-dc-axar-patel-bowler-injury-immediate-impact-powerplay-2713132-2025-04-23",
      "headline": "Back from injury: Bowler Axar Patel makes immediate impact for DC in LSG winAxar Patel's sharp captaincy and gritty bowling helped DC clinch a convincing 8-wicket win over LSG, as the Delhi skipper stepped up in both innings to complete a season double in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-batting-lsg-vs-dc-ayush-badoni-impact-player-mayank-yadav-2713119-2025-04-22",
      "headline": "Rishabh Pant tries to explain demotion in bizarre post-match interviewLSG captain Rishabh Pant tried to explain the bizarre call of batting at No.7 against Delhi Capitals. Rishabh was not able to express his thoughts clearly and said that he wanted the other batters to capitalise on the Lucknow pitch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-dc-match-report-rishah-pant-falter-kl-rahul-special-2713100-2025-04-22",
      "headline": "KL Rahul special forces LSG to capitulate against DC 2nd time in IPL 2025IPL 2025: Delhi Capitals completed a season double over Lucknow Super Giants with a eight-wicket win in Lucknow, as KL Rahul's composed fifty outshone a misfiring Rishabh Pant and a collapsing LSG middle-order."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}