{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-likely-to-maintain-825-percent-interest-rate-on-pf-depsoits-2679563-2025-02-13",
      "headline": "EPFO likely to maintain 8.25% interest rate on PF deposits EPFO interest rate: In 2024-25, EPFO processed over 50.8 million claims worth Rs 2.05 lakh crore when compared to 44.5 million claims amounting to Rs 1.82 lakh crore settled in the previous year, as per the official data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-exits-sri-lanka-wind-power-deal-stock-down-1-percent-2679469-2025-02-13",
      "headline": "Adani Green Energy exits Sri Lanka wind power deal; stock down 1%Adani Green Energy shares: As per the agreement with Sri Lanka, Adani Green was to construct two wind power projects in Mannar town and Pooneryn village, both located in the northern province of the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-erase-gains-to-end-lower-as-it-stocks-weigh-in-adani-enterprises-down-5-percent-2679429-2025-02-13",
      "headline": "Sensex, Nifty erase gains to end lower as IT stocks weigh in on stock marketsThe S&P BSE Sensex was down by 32.11 points to close at 76,138.97, while the NSE Nifty50 lost 13.85 points to end at 23,031.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-2679394-2025-02-13",
      "headline": "Finance Minister Nirmala SItharaman introduces new Income Tax Bill in Lok SabhaFinance Minister Nirmala Sitharaman tabled the new Income Tax bill in Lok Sabha amid the huge uproar by the opposition MPs. The bill will now be referred to the Select Committee of Lok Sabha for further review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-overhaul-2679363-2025-02-13",
      "headline": "New Income Tax Bill tabled in Lok Sabha, faces select panel reviewThe government, in a bid to simplify the present Income Tax Act, 1961, has introduced a new income tax bill in Parliament today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-are-large-cap-mutual-funds-back-in-demand-stock-market-volatility-2679356-2025-02-13",
      "headline": "Explained: Why are large-cap mutual funds back in demandWith small-cap and mid-cap stocks experiencing corrections, investors are moving towards large-cap funds, which are considered safer and more stable in volatile times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-10-things-investors-must-know-before-subscribing-2679309-2025-02-13",
      "headline": "Quality Power IPO: 10 things investors must know before subscribing Quality Power Electrical Equipments Limited offers high-voltage electrical equipment and solutions for grid connectivity and energy transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-how-will-it-make-taxpayers-lives-simpler-2679254-2025-02-13",
      "headline": "New Income Tax Bill: How will it make taxpayers' lives simpler?The new income tax bill would be almost half of the current law, as the existing Income Tax Act,1961 contained 880 pages when it came into existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-450-points-3-reasons-why-stock-market-is-rising-today-inflation-data-pm-modi-us-visit-2679218-2025-02-13",
      "headline": "Sensex gains 500 points: 3 reasons why stock market is rising todayAs of 10:48 AM, the S&P BSE Sensex was up 47.85 points at 76,644.93, while the NSE Nifty50 gained 137.75 points to 23,183.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-up-as-cooling-inflation-boosts-market-sentiment-share-market-today-2679189-2025-02-13",
      "headline": "Sensex, Nifty open higher as cooling inflation boosts market sentimentShare Market Today: The S&P BSE Sensex was up 163.21 points to 76,334.39, while the NSE Nifty50 gained 46.25 points to 23,091.50 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ajax-engineering-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2679171-2025-02-13",
      "headline": "Ajax Engineering IPO: Check allotment status, listing date and latest GMPAjax Engineering IPO allotment status: The IPO price band was set at Rs 599 to Rs 629 per share. The minimum lot size for the application was 23 shares. For retail investors, the minimum investment required was Rs 13,777."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-to-be-tabled-today-parliament-heres-what-you-can-expect-2679153-2025-02-13",
      "headline": "New Income Tax Bill to be tabled today: Here's what you can expectNew Income Tax Bill is expected to come into effect on April 1, 2026. The bill aims to simplify tax laws, remove outdated provisions, and make compliance easier for taxpayers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-jonita-gandhi-to-perform-at-lollapalooza-india-will-open-for-shawn-mendes-2679497-2025-02-13",
      "headline": "Singer Jonita Gandhi to perform at Lollapalooza India, will open for Shawn MendesJonita Gandhi will perform at Lollapalooza India on March 8, opening for Shawn Mendes. Her latest single Channa has also been nominated for a Juno Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twilight-star-taylor-lautner-to-return-as-werewolf-in-self-aware-werewolf-series-2679572-2025-02-13",
      "headline": "Twilight star Taylor Lautner to return as werewolf in self-aware werewolf seriesTwilight star Taylor Lautner is returning to portray a werewolf in the self-aware Amazon series. Details of the show are yet to be revealed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/anupamaa-actor-rupali-ganguly-seeks-blessings-at-maha-kumbh-2679484-2025-02-13",
      "headline": "Anupamaa actor Rupali Ganguly seeks blessings at Maha KumbhActor Rupali Ganguly visited Maha Kumbh in Prayagraj with her family. She shared moments from her spiritual visit, including performing aarti, attending a hawan, and meeting a saint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nawazuddin-siddiqui-begins-raat-akeli-hai-2-shooting-in-lucknow-2679426-2025-02-13",
      "headline": "Nawazuddin Siddiqui begins Raat Akeli Hai 2 shooting in LucknowActor Nawazuddin Siddiqui has begun Raat Akeli Hai 2 shooting in Lucknow. The actor will be seen sharing screen space with Chitragandha Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/olivia-swann-on-ncis-sydney-her-characters-growth-challenges-2679301-2025-02-13",
      "headline": "Olivia Swann on NCIS: Sydney, her character's growth & challenges In this exclusive interview with India Today's Bhavna Agarwal, Olivia Swann dives deep into her role in NCIS: Sydney, sharing insights into her character's journey, development, and challenges throughout the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-sues-ankita-lokhande-for-defamation-over-cheap-remark-2679295-2025-02-13",
      "headline": "Rozlyn Khan sues Ankita Lokhande for defamation over 'cheap' remark TV actor Rozlyn Khan took legal action against Ankita Lokhande's recent comments. Ankita had called her 'cheap', for her claims about Hina Khan's cancer battle. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-makes-a-powerful-comeback-with-high-alone-from-magic-man-2-2679273-2025-02-13",
      "headline": "Jackson Wang makes a powerful comeback with High Alone from Magic Man 2Jackson Wang drops a new single, High Alone, that marks the beginning of his new album, MAGIC MAN 2. The album promises a deep dive into themes of identity and personal transformation, set against a backdrop of atmospheric production and introspective lyrics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-lithgow-approached-to-play-albus-dumbledore-in-harry-potter-series-2679264-2025-02-13",
      "headline": "Actor John Lithgow approached to play Albus Dumbledore in Harry Potter seriesAward-winning American actor John Lithgow has reportedly been approached to play the iconic character of Hogwarts principal Albus Dumbledore in HBO's Harry Potter series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-stepdaughter-esha-verma-calls-her-evil-step-lady-issues-clarification-2679232-2025-02-13",
      "headline": "Rupali Ganguly's stepdaughter calls her 'evil step lady', issues clarificationRupali Ganguly's stepdaughter, Esha Verma, clarified her viral social media post against the actor. Esha requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-cries-loss-of-work-indias-got-latent-controversy-viral-video-truth-2679217-2025-02-13",
      "headline": "Truth behind viral video of Ranveer Allahbadia crying over 'loss of work'Amid backlash over India's Got Latent, an old video of Ranveer Allahbadia crying resurfaces. In the video, the podcaster is seen breaking down over 'loss of work'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brother-hint-at-big-change-for-2025-shocked-fans-ask-another-breakup-2679190-2025-02-13",
      "headline": "Jonas Brothers hint at big change for 2025, shocked fans ask, 'another breakup?'The Jonas Brothers shared a letter on social media that briefly sent fans into a panic. In it, they hinted at their 2025 lineup and expressed gratitude to their fans for supporting them throughout their musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-ma-baap-ki-kabaddi-joke-viral-ranveer-allahbadia-remark-2679097-2025-02-12",
      "headline": "Kapil Sharma's 'Maa Baap ki Kabaddi' joke goes viral amid Ranveer Allahbadia rowAmid the controversy over Ranveer Allahbadia's comment on Samay Raina's show India's Got Latent, an old clip of Kapil Sharma joking about kids watching \"maa baap ki kabaddi\" is going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/did-ar-rahman-refer-to-ranveer-allahbadia-row-at-chhaava-music-launch-vicky-kaushal-2679084-2025-02-12",
      "headline": "Watch: Did AR Rahman refer to Ranveer Allahbadia row at Chhaava music launch?AR Rahman made a humorous remark at the Chhaava music launch that has led to speculation about its connection to the recent controversy involving Ranveer Allahbadia and Samay Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/ed-sheeran-india-dump-football-with-john-abraham-2679075-2025-02-12",
      "headline": "Ed Sheeran's India dump features photo from football match with John AbrahamSinger Ed Sheeran shared his India dump, which also featured a glimpse of his football match with Bollywood actor John Abraham. Sheeran is in India for his Mathematics Tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/aly-goni-feels-samay-raina-was-forced-to-delete-indias-got-latent-episodes-2679069-2025-02-12",
      "headline": "Aly Goni feels Samay Raina was 'forced' to delete India's Got Latent episodesActor Aly Goni has commented on YouTuber-comedian Samay Raina's decision to remove episodes of India's Got Latent. Fans have also reacted to Samay's decision on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/odisha-rapper-abhinav-singh-dies-by-suicide-in-bengaluru-2679059-2025-02-12",
      "headline": "Odia rapper Abhinav Singh, 32, dies by suicide in BengaluruA rapper from Odisha, Abhinav Singh, died in Bengaluru where he was working for a private company. He was 32."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kendrick-lamar-super-bowl-halftime-show-is-the-most-watched-2678978-2025-02-12",
      "headline": "Kendrick Lamar's Super Bowl Halftime show is the most-watchedRapper Kendrick Lamar's Super Bowl Halftime show has become the most-watched Super Bowl show of all time, garnering an impressive 133.5 million views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-ranveer-allahbadia-2678979-2025-02-12",
      "headline": "Too much to handle: Samay Raina deletes all videos from his show amid jokes rowComedian Samay Raina finally broke his silence on the controversy over Ranveer Allahbadia's remark on his show, India's Got Latent. He has confirmed deleting all the videos of the show, and also added that whatever is happening right now is too much for him to handle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amy-adams-javier-bardem-to-lead-cape-fear-show-apple-tv-2678846-2025-02-12",
      "headline": "Amy Adams joins Javier Bardem in Cape Fear TV adaptationAfter Javier Bardem, actor Amy Adams is on board for the much-awaited Cape Fear TV adaptation. The release date for the show has not been announced yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-dropped-by-talent-agency-amid-antisemitic-controversial-actions-2678955-2025-02-12",
      "headline": "Kanye West dropped by talent agency amid antisemitic, controversial actionsKanye West's controversial actions have led to his talent agency, 33&West, dropping him. The decision follows a series of antisemitic remarks and troubling social media posts by the rapper that have sparked widespread condemnation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-gujarat-show-march-april-cancelled-after-indias-got-latent-controversy-2678896-2025-02-12",
      "headline": "Samay Raina's show in Gujarat cancelled amid India's Got Latent controversyComedian Samay Raina's Gujarat shows have been cancelled following a controversy sparked by the latest episode of his show, India's Got Latent. The decision comes amid backlash after a distasteful comment by YouTuber Ranveer Allahbadia on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sakamoto-days-taro-sakamoto-assassin-x-potential-match-heightened-action-and-drama-2678501-2025-02-12",
      "headline": "Sakamoto Days: With ex-assassin's potential match, the anime is raising stakesSakamoto Days follows the story of a legendary assassin who transforms into a family man. Now, with the introduction of an equally formidable enemy, the anime might finally pick up pace and raise the stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-teaser-bobby-deol-comeback-baba-nirala-promises-twists-prakash-jha-aditi-pohankar-2678807-2025-02-12",
      "headline": "Aashram 3 Part 2 teaser: Bobby Deol's comeback as Baba Nirala promises more twistsAashram 3 Part 2 teaser is out. The upcoming riveting crime drama marks the return of Bobby Deol as Bala Nirala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-opens-up-on-being-colour-blind-on-celebrity-masterchef-2678744-2025-02-12",
      "headline": "Anupamaa actor Gaurav Khanna opens up on being colour-blind on Celebrity MasterchefTV actor Gaurav Khanna appeared on Celebrity MasterChef where he opened up about being colour-blind. He participated on the show along with Ayesha Jhulka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-named-world-most-handsome-man-hrithik-roshan-brad-pitt-tom-cruise-2678685-2025-02-12",
      "headline": "BTS' V named world's most handsome man. Hrithik Roshan, Brad Pitt also on listBTS singer V aka Kim Taehyung has been named as the world's most handsome man. The list also features Indian actor Hrithik Roshan, Hollywood stars Brad Pitt, Tom Cruise, Bradley Cooper, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/picture-this-trailer-simone-ashley-hero-fiennes-to-headline-new-romantic-comedy-2678670-2025-02-12",
      "headline": "Picture This trailer: Simone Ashley, Hero Fiennes to headline new romantic comedyThe trailer for Simone Ashley and Hero Fiennes Tiffin's film, Picture This, has been unveiled. It will release on Prime Video on March 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-announces-magic-man-2-a-raw-and-vulnerable-chapter-2678617-2025-02-12",
      "headline": "Jackson Wang announces MAGIC MAN 2 – A raw and vulnerable chapterJackson Wang is set to release MAGIC MAN 2, an album that delves into the stages of grief and personal growth. After a year of introspection, he presents a raw and authentic portrayal of his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/pop-girl-group-xg-take-their-the-first-howl-world-tour-to-latin-america-pop-girl-group-xg-take-their-the-first-howl-world-tour-to-latin-america-2678589-2025-02-12",
      "headline": "Pop girl group XG take their 'The first HOWL' World Tour to Latin-America  XG, a dynamic hip-hop/R&B-inspired girl group, is set to captivate audiences in Latin America with their inaugural concerts in Brazil and Mexico. As they continue their world tour, XG unveils a groundbreaking project, 'XDM Unidentified Waves,' that redefines their music and solidifies their global appeal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/one-direction-liam-payne-sexuality-struggle-made-girlfriend-maya-abort-child-2678510-2025-02-11",
      "headline": "Singer Liam Payne was struggling with sexuality, coerced ex to abort: ReportA new report reveals late One Direction star Liam Payne struggled with his sexuality and allegedly pressured ex-fiancée Maya Henry to terminate a pregnancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mukesh-khanna-criticises-ranveer-allahbadia-india-got-latent-remark-parents-2678477-2025-02-11",
      "headline": "Mukesh Khanna on Ranveer Allahbadia row: Blacken his faceActor Mukesh Khanna has criticised YouTuber Ranveer Allahbadia for making explicit remarks on Samay Raina's show, calling for strict punishment to deter such behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-india-got-lalent-samay-raina-comedians-who-landed-in-trouble-for-inappropriate-jokes-2678254-2025-02-11",
      "headline": "Munawar Faruqui to Vir Das, comedians who landed in trouble for inappropriate jokesAs podcaster Ranveer Allahbadia faces backlash for his obscene jokes on an episode of India's Got Latent, here's a look at other stand-up comedians who have found themselves in trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-combs-allegedly-drugged-and-raped-a-man-claims-new-lawsuit-2678219-2025-02-11",
      "headline": "Diddy allegedly 'drugged and raped' a man, claims new lawsuitMusic mogul Sean Combs is embroiled in fresh legal trouble as an anonymous plaintiff files a sexual assault lawsuit against him in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-phone-dropped-story-of-jeetendra-kumars-humility-and-unassuming-success-2678203-2025-02-11",
      "headline": "The phone dropped...: Story of Jitendra Kumar's humility and unassuming successActor Jitendra Kumar, popularly known as Jeetu Bhaiya, says the bigger thing is not to decide whether to take a risk in life or not, but to know what is at stake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/arunachal-pradesh-women-panel-condemns-elvish-yadav-racist-remarks-against-chum-darang-2678209-2025-02-11",
      "headline": "Arunachal women panel condemns Elvish Yadav's 'racist' remarks against Chum DarangThe Arunachal Pradesh State Commission for Women has condemned Elvish Yadav's derogatory remarks against Chum Darang and has demanded strict action. The comments have sparked backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-ott-nithya-menen-ravi-mohan-streaming-on-netflix-2678160-2025-02-11",
      "headline": "Kadhalikka Neramillai: Nithya Menen, Ravi Mohan's rom-com now streaming on NetflixKadhalikka Neramillai, the heartfelt romantic film, starring Nithya Menen and Ravi Mohan is streaming on OTT. The Tamil film had its theatrical release on January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-to-premiere-on-prime-video-this-month-2678131-2025-02-11",
      "headline": "Suzhal The Vortex Season 2 to premiere on Prime Video this monthA brand-new season of the Tamil Prime Video series, Suzhal: The Vortex, was announced on Tuesday. The show will begin streaming on the OTT platform from this month itself. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-to-have-just-6-episodes-fans-disappointed-2678115-2025-02-11",
      "headline": "Squid Game 3 to have 6 episodes. Fans say 'they better be 2 hours long'Fans of Squid Game are eagerly awaiting the third season. However, the revelation of the season having only six episodes has left many fans disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/solo-leveling-season-2-episode-6-sung-jinwo-superior-animation-fight-sequence-2677946-2025-02-11",
      "headline": "Solo Leveling Season 2: Animation peaks as Jinwoo defeats dungeon bossThe latest episode of Solo Leveling peaked with its brilliantly animated fight sequence. In the episode, titled Don't Look Down on My Guys, Sung Jinwoo clashed with Karlgargan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/uorfi-javed-defends-friend-samay-raina-calls-his-arrest-ranveer-allahbadia-indias-got-latent-2678111-2025-02-11",
      "headline": "Uorfi Javed defends friend Samay Raina amid calls for his arrestUorfi Javed slammed people demanding jail time for YouTuber Ranveer Allahbadia and comedian Samay Raina after Allahbadia's obscene joke on India's Got Latent went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-seattle-indias-got-latent-and-ranveer-allahbadia-face-backlash-2678078-2025-02-11",
      "headline": "Samay Raina in Seattle as India's Got Latent and Ranveer Allahbadia face backlashIndian stand-up comedian Samay Raina recently performed in Seattle, as controversies surrounding Ranveer Allahbadia and India's Got Latent stirred social media discussions in India. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meeting-elon-musk-donald-trump-bilateral-tariffs-immigration-agenda-2679463-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM to meet Elon Musk shortly, talks with Trump to include tariffs, immigrationPM Modi, who landed in Washington DC on Thursday after a fruitful visit to France, has a jam-packed schedule that also includes a meeting with tech titan Elon Musk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-reciprocal-tariff-cryptic-post-hours-before-meeting-with-pm-modi-2679510-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Today is the big one': Trump to announce reciprocal tariffs at 11.30 pmAhead of his meeting with Prime Minister Narendra Modi around 2.30 am (IST) on February 14, US President Donald Trump sparked speculation with his cryptic 'reciprocal tariffs' post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-in-us-washington-live-updates-meets-president-donald-trump-us-intel-chief-tulsi-gabbard-bilateral-talks-immigration-policy-2679128-2025-02-13?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "PM Modi meets US National Security Advisor Michael WaltzPrime Minister Narendra Modi arrived in Washington DC early on Wednesday on a two-day visit to hold high-stakes talks with US President Donald Trump in the face of concerns in India over Washington's new \"America First\" trade agenda as well as its policy on immigration. This will be the first bilateral talks between the two leaders after Trump assumed the presidency for a second term last month. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jawan-opens-fire-manipur-camp-colleagues-before-shooting-himself-deaths-injuries-2679654-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jawan opens fire in Manipur camp, kills 2 colleagues before shooting himselfA CRPF jawan opened fire at a camp in Manipur. At least two jawans were killed in the incident while eight others sustained injuries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/whats-keralas-half-price-csr-scam-ananthu-krishnan-modus-operandi-explained-vijayan-ed-probe-2679425-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala's Rs 1,000-crore half-price scam: Victims explain how they got dupedIn one of the biggest scams in Kerala, a 26-year-old graduate duped 40,000 people across the state with a Ponzi-style network, offering scooters, mobiles, laptops and other household items at half their price. This is how Ananthu Krishnan pulled off the state-wide Rs 1,000-crore scam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/president-2679598-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "President's Rule imposed in Manipur days after Biren Singh's resignationManipur has been placed under President's Rule after the BJP failed to name a successor following the resignation of N Biren Singh as the Chief Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/illegal-indian-immigrants-from-us-second-batch-land-amritsar-punjab-saturday-2679585-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2nd flight with Indians deported from US to land in Amritsar on Saturday: SourcesA second flight carrying Indians deported from the US is likely to land in Amritsar on February 15. Sources said that another flight carrying illegal Indian immigrants is likely to arrive after that. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-nammo-metro-fare-hike-revision-feedback-backlash-2679550-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru Metro fare reduced by up to 30% after backlash over hikeFollowing public backlash, BMRCL has revised the recent metro fare hike, reducing prices by up to 30 per cent. The board reviewed feedback and corrected abnormal fare increases, effective immediately."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/what-to-do-when-your-in-laws-pressure-you-about-kids-even-in-2025-2679569-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What to do when your in-laws pressure you about kids - even in 2025It's 2025, but some people are still stuck with the idea that all married couples, whether they want kids or not, should have them. But with DINK (Dual Income, No Kids) couples at an all-time high, how can you tackle the family pressure with the utmost subtlety?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindus-violence-hit-safety-india-border-bsf-sent-them-away-un-report-muhammad-yunus-2679401-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Violence-hit Bangladesh Hindus sought safety at border, BSF sent them away: UNA fact-finding report from the United Nations Human Rights office corroborates reports that Hindus in Bangladesh were targeted in July and August last year. It also describes how India's Border Security Force (BSF) reportedly sent back 4,000 Hindus who had sought shelter near the border fearing for their lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-calls-for-us-to-delete-entire-agencies-from-federal-government-2679606-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk calls for US to 'delete entire agencies' from federal government\"I think we do need to delete entire agencies as opposed to leave a lot of them behind,\" Elon Musk said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-chief-justice-of-india-dy-chandrachud-bbc-interview-political-pressure-nepotism-caa-article-360-2679375-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian courts under pressure from Modi government? DY Chandrachud counters BBCFormer Chief Justice of India DY Chandrachud maintained that despite external pressures, the Supreme Court continues to uphold personal liberties and the rule of law, ensuring that judicial independence remains the cornerstone of India's democracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-cries-loss-of-work-indias-got-latent-controversy-viral-video-truth-2679217-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Truth behind viral video of Ranveer Allahbadia crying over 'loss of work'Amid backlash over India's Got Latent, an old video of Ranveer Allahbadia crying resurfaces. In the video, the podcaster is seen breaking down over 'loss of work'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kottayam-nursing-college-ragging-video-shows-brutal-torture-of-junior-student-2679387-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala nursing college ragging video surfaces, shows victim tied, being torturedDisturbing footage from the Government Nursing College in Kottayam shows a junior student being tied up, stabbed with a compass, and tortured by seniors. Five third-year students were arrested after the victim and two others filed a police complaint detailing months of ragging. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-captaincy-rajat-patidar-explained-andy-flower-mo-babat-2679600-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL: Did Virat Kohli say no to returning as RCB captain for 2025 season?IPL 2025: After retiring from T20Is last year, Virat Kohli was widely expected to return as RCB captain. However, on February 13, the franchise appointed Rajat Patidar as their skipper for the upcoming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-india-middle-east-europe-corridor-and-how-will-it-benefit-india-2679305-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is India-Middle East-Europe Corridor and how will it benefit India?Prime Minister Narendra Modi and French President Emmanuel Macron reviewed the India-Middle East-Europe Corridor project on Wednesday in France and agreed to work on it together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/retired-berkeley-professor-drives-uber-once-a-week-donates-profits-viral-post-2679444-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Retired Berkeley professor drives Uber once a week, donates profits. Viral postIn a post on X, Sonith Sunku shared a picture of the Uber driver - Professor Paul – who studied at the Stanford University and earned a PhD in mathematics and economics at the age of 24. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-flags-dummy-school-linked-to-jee-topper-says-it-was-disaffiliated-2679565-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE flags dummy school linked to JEE topper, says it was disaffiliatedAfter the success of a JEE (Mains) topper from a non-attending (dummy) school made headlines, CBSE released a notification stating that the same school had been disaffiliated last year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/un-human-rights-report-exposes-muhammad-yunus-attacks-on-hindu-minority-bangladesh-2679359-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UN report exposes Yunus on attacks on Hindus in BangladeshA UN report on human rights violations and abuses has debunked Muhammad Yunus' claims of \"exaggerated propaganda\" by confirming widespread violence against Hindus, their temples and businesses in post-Hasina Bangladesh. The report, conducted on the invitation of Yunus' interim government, details incidents of targeted mob attacks and arson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-urges-fans-and-media-to-stop-calling-him-king-2679522-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stop calling me king, I am not there yet, Babar Azam tells fans and mediaStar Pakistan batter Babar Azam has urged his fans and the media to stop calling him king. Babar hasn't had a memorable run in the first two matches of the tri series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/looking-for-a-5-star-safety-rated-car-under-rs-10-lakh-we-have-you-all-covered-2679419-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Looking for a 5-star safety-rated car under Rs 10 lakh? We have you all coveredMany cars under Rs 10,00,000 (ex-showroom) now have safety features like six airbags, electronic stability control, brakeforce assist system, vehicle stability management, hill-start assist control and emergency stop signal, as standard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bmi-isnt-the-most-accurate-measure-of-obesity-2678831-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why BMI isn't the most accurate measure of obesityBody Mass Index cannot differentiate between muscle mass, fat and bone density. Doctors suggest other markers and scans to measure how obese an individual is\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-internal-review-why-it-lost-delhi-assembly-election-2025-2679523-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Middle-class shift, BJP's money power: AAP's reasons behind Delhi poll debacleDelhi Election Results 2025: The AAP managed to win just 22 seats after consecutive near-sweeps in the 2015 and 2020 polls. Top AAP sources told India Today that the party has identified three key reasons behind its defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-properties-bill-jpc-report-accepted-rajya-sabha-opposition-uproar-2679239-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid Waqf bill storm in Parliament, Amit Shah says no objection to dissent notes Live UpdatesOpposition MPs claimed that portions of dissent notes were removed from the report on the Waqf bill and resorted to sloganeering in Parliament, leading to adjournment of proceedings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emilia-perez-actor-karla-sofia-gascon-to-skip-baftas-amid-controversy-for-hateful-social-media-posts-2679615-2025-02-13",
      "headline": "Emilia Perez actor Karla Sofia Gascon to skip BAFTAs amid controversyKarla Sofia Gascon will not attend the BAFTA Awards following backlash over resurfaced racist posts. She is also not on the list of attendees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sky-force-manish-chaudhary-on-veer-pahariya-trolling-aryan-khan-2679614-2025-02-13",
      "headline": "Sky Force's Manish Chaudhary on Veer Pahariya's trolling, working with Aryan KhanSky Force actor Manish Chaudhary opens up about sharing screen with co-star Veer Pahariya, and being directed by superstar Shah Rukh Khan's son, Aryan Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kadhal-enbadhu-podhu-udamai-review-a-sensible-emotional-film-on-same-sex-love-lijomol-jose-jayaprakash-radhakrishnan-2679513-2025-02-13",
      "headline": "Kadhal Enbadhu Podhu Udamai review: A sensible, emotional film on same-sex loveReleased-Fri Feb 14, 2025Kadhal Enbadhu Podhu Udamai movie review: Director Jayaprakash Radhakrishnan's film on same-sex love is sensible, sensitive and deeply moving. The film features Lijomol, Anusha Prabhu, Rohini, and Vineeth in lead roles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushals-chhaava-record-breaking-opening-in-hindi-cinema-historical-film-2679587-2025-02-13",
      "headline": "Vicky Kaushal's Chhaava set for record-breaking opening in Hindi cinemaChhaava, featuring Vicky Kaushal and Rashmika Mandanna, is anticipated to achieve the largest opening day for a historical film in Hindi cinema."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brendon-mccullum-hits-back-at-factually-incorrect-criticism-over-englands-practice-sessions-2679632-2025-02-13",
      "headline": "McCullum hits back at 'factually incorrect' criticism over England's practiceEngland head coach Brendon McCullum has hit back at the criticism over England holding fewer practice sessions during their recent white-ball series against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-champions-trophy-shreyas-iyers-admission-reveals-indias-think-tank-problem-2679623-2025-02-13",
      "headline": "Champions Trophy: Shreyas Iyer's admission reveals India's think-tank problemWhy fix something that isn't broken? India seem to be overcomplicating their combination in the ODI series against England, which is a worrying sign ahead of the Champions Trophy. There appears to be a real problem of plenty for coach Gautam Gambhir and captain Rohit Sharma. Why on earth did they leave out Shreyas Iyer for the series opener in Nagpur? An injury to Virat Kohli meant Shreyas got an opportunity after a late phone call from the skipper. The star batter revealed he was not in the XI as late as the eve of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yashasvi-jaiswal-ranji-trophy-mumbai-vs-vidarbha-semifinal-champions-trophy-snub-2679619-2025-02-13",
      "headline": "After Champions Trophy snub, Yashasvi Jaiswal to play Ranji Trophy semifinalAfter missing out on a place in India's final 15-man squad for the Champions Trophy, Yashasvi Jaiswal was drafted into Mumbai's Ranji Trophy squad for their semi-final against Vidarbha in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-when-and-where-to-watch-pakistan-vs-new-zealand-tri-series-final-live-streaming-details-2679604-2025-02-13",
      "headline": "PAK vs NZ, tri-series final Live Streaming: When and where to watch?Tri-Series in Pakistan 2025: Pakistan and New Zealand are all set to clash in the final of the tri-series on February 14 in Karachi. Here are the complete details of where to watch the match live on TV and on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-captaincy-rajat-patidar-explained-andy-flower-mo-babat-2679600-2025-02-13",
      "headline": "IPL: Did Virat Kohli say no to returning as RCB captain for 2025 season?IPL 2025: After retiring from T20Is last year, Virat Kohli was widely expected to return as RCB captain. However, on February 13, the franchise appointed Rajat Patidar as their skipper for the upcoming season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-premier-league-parunika-sisodia-mumbai-rcb-pooja-vastrakar-2679590-2025-02-13",
      "headline": "Unsold in auction, teenager gets Mumbai Indians call-up after World Cup heroicsWomen's Premier League 2025: Mumbai Indians roped in U19 World Cup star Parunika Sisodia as a replacement for injured Pooja Vastrakar. Defending champions RCB will miss the services of Asha Sobhana as the leg-spinner has been ruled out due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-appoint-mehidy-hasan-miraz-as-vice-captain-2679584-2025-02-13",
      "headline": "Bangladesh appoint Mehidy Hasan Miraz as vice captain for Champions TrophyBangladesh Cricket Board (BCB) announced Mehidy Hasan Miraz as their vice-captain for the upcoming ICC Champions Trophy 2025. Bangladesh will start their campaign against India on February 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-crcket-team-families-not-to-travel-dubai-bcci-rules-2679535-2025-02-13",
      "headline": "Families not to travel with Indian players for Champions Trophy to Dubai: Report Champions Trophy 2025: The Indian team is set to leave for Dubai on February 15. However, families won't accompany the players for the three-week-long tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-urges-fans-and-media-to-stop-calling-him-king-2679522-2025-02-13",
      "headline": "Stop calling me king, I am not there yet, Babar Azam tells fans and mediaStar Pakistan batter Babar Azam has urged his fans and the media to stop calling him king. Babar hasn't had a memorable run in the first two matches of the tri series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-deepti-sharma-up-warriorz-brand-wpl-2025-press-meet-2679505-2025-02-13",
      "headline": "UP Warriorz focused on playing positive brand of cricket: Deepti Sharma WPL 2025: In the Star Sports Press Room - WPL Captain's Huddle, newly-appointed skipper Deepti Sharma said that the UP Warriorz will be looking to play a positive brand of cricket and turn their fortunes around after failing last season when they couldn't go beyond the league stage.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rawalpindi-cricket-stadium-venue-ct-25-fixtures-full-details-2679458-2025-02-13",
      "headline": "Rawalpindi Cricket StadiumThe Rawalpindi Cricket Stadium is one of the three venues in Pakistan hosting the Champions Trophy 2025. Established in 1992, the stadium has a seating capacity of 15,000. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-appoint-mehidy-hasan-miraz-as-vice-captain-2679584-2025-02-13",
      "headline": "Bangladesh appoint Mehidy Hasan Miraz as vice captain for Champions TrophyBangladesh Cricket Board (BCB) announced Mehidy Hasan Miraz as their vice-captain for the upcoming ICC Champions Trophy 2025. Bangladesh will start their campaign against India on February 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-crcket-team-families-not-to-travel-dubai-bcci-rules-2679535-2025-02-13",
      "headline": "Families not to travel with Indian players for Champions Trophy to Dubai: Report Champions Trophy 2025: The Indian team is set to leave for Dubai on February 15. However, families won't accompany the players for the three-week-long tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-urges-fans-and-media-to-stop-calling-him-king-2679522-2025-02-13",
      "headline": "Stop calling me king, I am not there yet, Babar Azam tells fans and mediaStar Pakistan batter Babar Azam has urged his fans and the media to stop calling him king. Babar hasn't had a memorable run in the first two matches of the tri series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-deepti-sharma-up-warriorz-brand-wpl-2025-press-meet-2679505-2025-02-13",
      "headline": "UP Warriorz focused on playing positive brand of cricket: Deepti Sharma WPL 2025: In the Star Sports Press Room - WPL Captain's Huddle, newly-appointed skipper Deepti Sharma said that the UP Warriorz will be looking to play a positive brand of cricket and turn their fortunes around after failing last season when they couldn't go beyond the league stage.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rawalpindi-cricket-stadium-venue-ct-25-fixtures-full-details-2679458-2025-02-13",
      "headline": "Rawalpindi Cricket StadiumThe Rawalpindi Cricket Stadium is one of the three venues in Pakistan hosting the Champions Trophy 2025. Established in 1992, the stadium has a seating capacity of 15,000. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}