{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-down-why-us-tariff-august-27-pharma-financial-shares-decline-pmo-meet-modi-2776775-2025-08-26",
      "headline": "Sensex crashes 600 points: Why is stock market down today?The BSE Sensex showed a negative start as trading commenced today, with most stocks tanking at the opening bell. Sensex and Nifty fell nearly 1% a few minutes after opening for trading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-400-points-nifty-falls-below-24900-as-us-tariff-concerns-hit-d-street-2776765-2025-08-26",
      "headline": "Sensex, Nifty tank nearly 1% as US tariff fears spook D-Street investorsThe Sensex fell over 500 points, while the Nifty slipped below the psychological 24,900 mark in early trade, mirroring global risk-off cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-the-10-30-50-formula-edelweiss-mf-radhika-gupta-on-smart-money-habits-2776514-2025-08-25",
      "headline": "What is the 10-30-50 formula? Edelweiss MF's Radhika Gupta on smart money habitsRadhika Gupta explained that this tug of war between splurging and saving is not new. In fact, she advised a simple rule for different life stages, i.e., the 10-30-50 principle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fitch-retains-its-rating-for-india-sees-growth-at-65-percent-2776462-2025-08-25",
      "headline": "Fitch retains its rating for India, sees growth at 6.5%Fitch's rating comes days after S&P Global Ratings lifted its sovereign credit rating on India, citing strong economic growth, marking its first upgrade in 18 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-329-points-higher-nifty-above-24950-infosys-gains-3-percent-2776450-2025-08-25",
      "headline": "Sensex ends 329 points higher, Nifty above 24.950; Infosys gains 3%The S&P BSE Sensex added 329.06 points to close at 81,635.91, while the NSE Nifty50 gained 97.65 points to end at 24,967.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-wedding-gifts-really-tax-free-here-is-the-answer-2776443-2025-08-25",
      "headline": "Are wedding gifts really tax-free? Here's the answerIn India, weddings are full of joy, rituals and generous gifts. But when the celebrations end, many couples wonder, do these gifts come with hidden tax bills? The answer may surprise you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pmo-to-convene-big-meeting-tomorrow-as-us-tariffs-set-to-come-into-force-sources-2776418-2025-08-25",
      "headline": "PMO to convene big meeting tomorrow as US tariffs set to come into force: SourcesThe Prime Minister's Office will hold a high-level review meeting on August 26 to assess support measures for Indian exporters hit by higher US tariffs. The session, chaired by the PM's Principal Secretary, comes as Washington doubles duties, with Indian goods now facing a steep 50% tariff, raising cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ahpi-bajaj-allianz-cashless-treatment-hospital-body-meeting-insurance-rejection-claims-girdhar-gyani-2776408-2025-08-25",
      "headline": "Why hospitals have barred cashless services from Bajaj Allianz policyholdersThe meeting between AHPI's (Association of Healthcare Providers India) will include core committee members and senior representatives from Bajaj Allianz, and is scheduled for August 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-nithin-kamath-on-the-one-skill-ai-can-not-replace-2776378-2025-08-25",
      "headline": "Zerodha's Nithin Kamath on the one skill AI can't replaceNithin Kamath explained that curiosity should not be confined to a person's own role but should extend to the larger environment around them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pmo-to-chair-key-meeting-on-50-us-tariffs-tomorrow-details-here-2776375-2025-08-25",
      "headline": "Big PMO meet tomorrow as Trump's 50% tariffs set to come into force: SourcesStarting Wednesday, Indian goods entering the US market will be subject to a 50% tariff after Washington doubled existing duties, heightening cost pressures on exporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/common-empanelment-explained-why-big-private-hospitals-and-insurers-are-at-odds-2776335-2025-08-25",
      "headline": "Common empanelment explained: Why big private hospitals and insurers are at oddsCommon empanelment aims to simplify cashless insurance in India, but hospitals resist over tariffs and operational issues, leaving policyholders' access dependent on achieving fair rates, efficient settlements, and system flexibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-itr-filing-deadline-be-extended-again-after-delayed-rollout-of-utilities-2776296-2025-08-25",
      "headline": "Will ITR filing deadline be extended again after delayed rollout of utilities?With the revised ITR utilities coming out much later than expected, taxpayers and professionals are now questioning whether the government will grant another extension to ease the compliance burden."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/mangal-electrical-ipo-allotment-out-today-check-status-listing-gains-stock-market-debut-2776284-2025-08-25",
      "headline": "Mangal Electrical IPO allotment out: Check your status, possible listing gainsInvestors who applied for the Mangal Electrical IPO can check their allotment status through two official platforms, the BSE website and the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/wallet-money-cash-winning-dream11-mpl-winzo-zupee-withdrawal-online-gaming-bill-2025-2776264-2025-08-25",
      "headline": "Online gaming law: Will users get Dream11, MPL, Winzo wallet cash?The Online Gaming Bill, cleared by both Lok Sabha and Rajya Sabha this week, bans all forms of online money games. These are defined as games where players deposit money, directly or indirectly, with the hope of winning cash rewards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-gain-infosys-tcs-wipro-why-are-they-rising-today-2776249-2025-08-25",
      "headline": "Infosys, TCS, Wipro rally: Why are IT stocks rising today?Analysts said the rally reflects expectations that lower US interest rates will make emerging markets, including India, more attractive to foreign investors, supporting inflows into the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-200-points-nifty-above-24900-it-stocks-lead-gains-2776241-2025-08-25",
      "headline": "Sensex rises over 200 points, Nifty above 24,900; IT stocks lead gainsAt 9:22 am, the BSE Sensex rose 203.14 points to 81,509.99, while the NSE Nifty50 advanced 53.20 points to 24,923.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-likely-by-dussehra-government-braces-for-big-revenue-shortfall-2776239-2025-08-25",
      "headline": "New GST rates likely by Dussehra, government braces for big revenue shortfallThe proposed GST revamp aims to simplify the tax system by introducing a two-tier rate structure of 5% and 18%, along with a 40% levy on sin goods. While the move promises greater simplicity, it is expected to significantly impact revenues for both central and state governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/this-is-how-new-income-tax-bill-2025-brings-relief-for-salaried-and-small-taxpayers-2775991-2025-08-24",
      "headline": "How new Income Tax Bill 2025 brings relief for salaried and small taxpayersEndless forms and confusing jargon may soon be history. The New Income Tax Bill 2025 could be the game-changer salaried and small taxpayers have been waiting for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/term-insurance-policy-duration-30-40-years-waste-money-how-to-choose-financial-planning-personal-savings-2775908-2025-08-24",
      "headline": "The hidden catch in 40-year term insurance policies and how to choose betterBuying a 40-year term insurance policy is like paying rent for a house you'll never live in that long. It feels safe, but often it's money that could be better used elsewhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-signals-possible-september-rate-cut-cites-rising-job-market-risks-2775428-2025-08-22",
      "headline": "US Fed chair signals possible September rate cut, cites rising job market risksUS Federal Reserve Chair Jerome Powell's comments open the door to a rate cut at the Fed's September 16-17 meeting, but also put heavy weight on jobs and inflation reports that will be received before then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/schengen-visa-price-hike-europe-trip-plan-costly-rise-hike-upset-trip-budget-2775365-2025-08-22",
      "headline": "Planning Europe trip? Schengen visa hike may upset your trip budgetThe Schengen visa allows travellers to visit 29 European countries for up to 90 days within a 180-day period. Applicants must submit standard documents, including travel plans, insurance, and financial proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/avadhut-sathe-sebi-raid-pune-finfluencer-karjat-trading-academy-2775356-2025-08-22",
      "headline": "Sebi strikes at finfluencer Avadhut Sathe's Karjat Trading AcademyThe action followed complaints that penny stocks were being promoted during his training sessions, allegedly presented as classroom examples while encouraging students to invest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/which-bank-offers-higher-1-year-fd-see-rates-from-hdfc-icici-sbi-and-3-others-2775342-2025-08-22",
      "headline": "Which bank offers higher 1-year FD? See rates from HDFC, ICICI, SBI and 3 othersMost lenders usually announce similar interest rates on one-year deposits, making it seem as if there isn't much of a difference in where you invest. However, a closer look at the latest rates reveals small but meaningful variations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%The S&P BSE Sensex closed 694 points lower at 81.306.85 points, while the NSE Nifty50 declined by 213.65 points to end at 24,870.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/money-based-gaming-ban-rocks-advertising-sports-sponsorships-whats-at-stake-2775202-2025-08-22",
      "headline": "Real-money gaming ban rocks advertising, sports sponsorships: What's at stake?The rise of money-based platforms created billions in advertising spend, now facing a sudden halt. This article examines how the ban on real-money gaming is reshaping India's advertising, sports sponsorships, and emerging e-sports opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2024-25-comparing-deductions-under-old-and-new-tax-regime-2775132-2025-08-22",
      "headline": "ITR filing 2024–25: Comparing deductions under old and new tax regimeFiling your Income Tax Return for FY 2024–25? Before you decide on old or new tax regime, it's important to know how deductions differ. The right choice could help reduce your taxable income and overall tax burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-middle-class-feels-stuck-between-taxes-and-emis-explains-ca-2775094-2025-08-22",
      "headline": "Why middle class feels stuck between taxes and EMIs, explains CAThe burden is not just about taxes. Price hikes on fuel, food, education, and healthcare hit the middle class the hardest. Unlike the rich, they cannot hedge against inflation with high-value assets. Unlike the poor, they don't receive government relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falling-sensex-nifty-down-why-reason-fed-speech-jackson-hole-it-banking-shares-down-2775089-2025-08-22",
      "headline": "Sensex down 600 points: Why is stock market falling today?At closing bell, indices opened marginally lower but kept sliding as the day went on. Sensex and Nifty declined over half a percent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-life-health-insurance-premiums-become-cheaper-with-zero-gst-proposal-2775076-2025-08-22",
      "headline": "Will life, health insurance premiums become cheaper with zero GST proposal?Will zero GST on life and health insurance truly make premiums cheaper or will input credit losses and policy design dilute the benefits for most customers? Read to know what experts have to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-90-points-nifty-above-25050-wipro-maruti-lead-gains-2775034-2025-08-22",
      "headline": "Sensex down 350 points, Nifty below 25,000; Wipro, HCLTech down 2%The S&P BSE Sensex was down by 380.59 points to 81,620.12, while the NSE Nifty50 declined 127.95 points to 24,956.25 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mpl-zupee-suspend-paid-games-after-online-gaming-bill-clears-parliament-2775021-2025-08-22",
      "headline": "Dream11, MPL suspend money-based games after Online Gaming Bill clears ParliamentReal-money gaming faces a knockout blow as Dream11, MPL, and Zupee halt money-based online games. Dream11 is also likely to follow suit after sweeping ban."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/less-than-40-percent-itrs-processed-as-government-pushes-deadline-to-september-15-2774766-2025-08-21",
      "headline": "Less than 40% ITRs processed as government pushes deadline to September 15The Finance Ministry has pushed the ITR deadline to 15 September citing extensive changes in forms and utilities. But three months in, processing is still crawling at under 40%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-143-points-higher-nifty-above-25000-pharma-stocks-gain-2774715-2025-08-21",
      "headline": "Sensex, Nifty gain for 6th straight session on GST reforms optimismThe S&P BSE Sensex was up 142.87 points to 82,000.71 at the closing bell, while the NSE Nifty50 rose 33.20 points to settle at 25,083.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/group-of-ministers-on-gst-approves-scrapping-of-12-28-slabs-2774697-2025-08-21",
      "headline": "Key panel okays scrapping of 12%, 28% GST slabs; 90% goods may get cheaperIn a key meeting held on Thursday, the panel of state ministers accepted the Centre's plan to reduce the four-rate system to two main slabs of 5% and 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-can-retirees-stay-safe-from-risky-too-good-to-be-true-schemes-safe-investments-for-retirees-2774609-2025-08-21",
      "headline": "How can retirees stay safe from risky 'too good to be true' schemes?Many retirees fall prey to schemes that seem too good to be true, chasing high returns without understanding the risks. Protecting your savings requires caution, awareness, and smart investment choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-zero-percent-insurance-premium-costly-cheap-input-tax-credit-policyholders-personal-finance-2774569-2025-08-21",
      "headline": "Why zero GST on insurance premiums doesn't mean cheaper policies for youOn the surface, removing GST on insurance premiums seems like a big relief, but experts caution that the outcome may not be what many are expecting."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/armaan-malik-reacts-to-brother-amaal-joining-bigg-boss-19-calls-it-boarding-school-2776780-2025-08-26",
      "headline": "Armaan Malik reacts to brother Amaal joining Bigg Boss 19, calls it boarding schoolArmaan Malik admitted he wasn't in favour of his brother Amaal Malik joining 'Bigg Boss 19', joking that he should treat it like boarding school and return soon to finish pending songs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-bring-ganpati-bappa-home-with-daughters-2776766-2025-08-26",
      "headline": "Gurmeet Choudhary, Debina Bonnerjee bring Ganpati Bappa home with daughtersTelevision couple Gurmeet Choudhary and Debina Bonnerjee welcomed Ganpati Bappa home with their daughters Lianna and Divisha, keeping their annual tradition alive. A viral video of the family taking the idol home has won hearts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-om-shanti-comment-social-media-memes-priyadarshan-confusion-2776757-2025-08-26",
      "headline": "Mika Singh mistakes Priyadarshan's retirement as death, trolled for Om shanti gaffeMika Singh confused a post about Priyadarshan's retirement with a death announcement. Fans trolled him for commenting 'Om Shanti' on the post and said that he is still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-ssunita-ahuja-divorce-rumours-baseless-pahlaj-nihalani-2776761-2025-08-26",
      "headline": "Govinda-Ssunita's divorce rumours are baseless, says filmmaker Pahlaj NihalaniVeteran filmmaker Pahlaj Nihalani dismissed rumours of trouble in Govinda and Ssunita Ahuja's marriage, calling the divorce buzz baseless. He described the couple as buddies who live and work together, stressing he had never seen signs of separation between them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aarti-ravi-mohan-keneedshaa-tirupati-temple-trip-2776744-2025-08-26",
      "headline": "Aarti shares cryptic posts after actor-husband Ravi-Keneeshaa's temple tripActor Ravi Mohan's estranged wife, Aarti, shared cryptic posts on Instagram after his temple visit with his 'companion' Keneeshaa. Ravi and Aarti's divorce case is currently going on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siddharth-sarathkumar-3bhk-sachin-tendulkar-2776722-2025-08-26",
      "headline": "Tamil film 3BHK finds an admirer in Sachin Tendulkar. Director Sri Ganesh reactsCricketing legend Sachin Tendulkar named the Tamil film '3BHK', starring Siddharth and Sarathkumar, as one of his recent favourites. The film's director Sri Ganesh expressed his joy on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/trishala-dutt-cryptic-note-mental-health-family-image-manipulative-people-sanjay-dutt-daughter-2776635-2025-08-25",
      "headline": "Sanjay Dutt's daughter Trishala's cryptic post: Family not free pass to mistreatActor Sanjay Dutt's daughter Trishala Dutt opened up about manipulative family dynamics by sharing a cryptic note. She urged prioritising mental health over preserving family image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/us-comedian-reginald-carroll-shot-dead-mississippi-shooting-2776619-2025-08-25",
      "headline": "American comedian Reginald Carroll shot dead in Mississippi shootingStand-up comedian Reggie Carroll died after a shooting incident in Mississippi, United States. His death has shocked the comedy community and led to a police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/avneet-kaur-reacts-to-virat-kohli-liking-her-insta-post-let-the-love-keep-coming-2776613-2025-08-25",
      "headline": "Avneet Kaur reacts to Virat Kohli liking her Insta post: Let the love keep comingAvneet Kaur addressed the social media controversy involving Virat Kohli. At the trailer launch of her film 'Love in Vietnam', she reacted to the incident, saying \"let the love come\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/all-about-armaan-malik-first-stadium-tour-bringing-global-pop-vision-home-2776618-2025-08-25",
      "headline": "All about Armaan Malik's first stadium tour bringing global pop vision homeArmaan Malik prepares for his first-ever stadium show in Mumbai, culminating a multi-city tour that celebrates his evolution from Bollywood playback singer to global pop artist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kumail-nanjiani-signed-6-mcu-films-turned-therapy-after-eternals-failed-marvel-2776596-2025-08-25",
      "headline": "Kumail Nanjiani says he signed 6 MCU films, turned to therapy after Eternals failedKumail Nanjiani reveals how the poor reception of Marvel's Eternals deeply affected him. He sought therapy to cope with the unexpected career and personal challenges that followed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-calls-parineeta-her-dream-debut-as-it-returns-to-cinemas-after-20-years-2776586-2025-08-25",
      "headline": "Vidya Balan calls Parineeta her dream debut as it returns to cinemas after 20 yearsVidya Balan's debut film 'Parineeta' will be re-released on its 20th anniversary. Ahead of that, the actor called it her \"dream debut\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-returns-to-south-korea-to-host-manager-kim-taehyung-wedding-2776585-2025-08-25",
      "headline": "BTS' Jin returns to South Korea to host manager Kim Taehyung's weddingBTS member Jin is back in South Korea to host the wedding of a close manager. Just a day earlier, he was seen in the audience at his juniors' concert, TOMORROW X TOGETHER."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-wellness-podcast-womens-ageing-self-kindness-2776578-2025-08-25",
      "headline": "Soha Ali Khan launches podcast on women's wellness and ageingSoha Ali Khan has launched a wellness podcast called 'All About Her' focusing on women's insecurities and ageing. The show aims to create a safe, unfiltered space for conversations on wellness and self-kindness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-48-hour-shoot-marathon-after-london-vacation-2776526-2025-08-25",
      "headline": "Kartik Aaryan sets on a non-stop 48-hour shoot marathon after returning from LondonActor Kartik Aaryan returned to Mumbai after a relaxing London holiday. He updated about his intense 48-hour shoot marathon on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vishal-malhotra-on-shahid-kapoor-ishq-vishk-mania-fans-scratched-us-i-still-bear-the-mark-2776559-2025-08-25",
      "headline": "Vishal Malhotra on Ishq Vishk mania: Fans scratched us, I still bear the markActor Vishal Malhotra fondly recalled the memorable release day of 'Ishq Vishk', highlighting both the film's success and the overwhelming fan frenzy that left him physically marked. The film hit theatres in 2003. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/demon-slayer-conquered-pop-culture-in-record-time-anime-animania-2776515-2025-08-25",
      "headline": "How Demon Slayer conquered pop culture in record timeIn this week's Animania we will discover how 'Demon Slayer' went from Japanese comic to global pop culture juggernaut, breaking sales and box office records with its story, art, and emotional pull.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shriya-pilgaonkar-joins-akshay-kumar-saif-ali-khan-haiwaan-thriller-oppam-remake-2776438-2025-08-25",
      "headline": "Shriya Pilgaonkar joins Akshay, Saif in Priyadarshan's thriller Haiwaan. ReportsActor Shriya Pilgaonkar has joined director Priyadarshan's upcoming thriller Haiwaan. The film is a Hindi remake of the Malayalam hit 'Oppam' and marks a major reunion of actors Akshay Kumar and Saif Ali Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/britney-spears-fans-concerned-after-she-shares-nude-photo-with-cryptic-post-2776400-2025-08-25",
      "headline": "Britney Spears' fans concerned after she shares nude photo with cryptic postPop star Britney Spears' latest nude Instagram post has set the internet abuzz. Fans are concerned about her well-being."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-warns-tariffs-on-countries-taxing-us-tech-firms-2776724-2025-08-26",
      "headline": "US tech firms not your piggy bank: Trump's fresh tariff threat over digital taxUS President Donald Trump has threatened additional tariffs on countries imposing digital taxes on American tech firms. This move escalates tensions over global digital tax policies and trade relations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-raids-aap-leader-saurabh-bharadwajs-residence-12-other-locations-in-hospital-construction-scam-2776746-2025-08-26",
      "headline": "ED raids AAP leader Saurabh Bharadwaj's home in hospital construction scamThe ED searched 13 locations linked to AAP leader Saurabh Bhardwaj in a money laundering probe tied to alleged corruption in Rs 5,590 crore hospital projects sanctioned by the former Delhi government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-dowry-death-accused-husband-vipin-had-an-affair-hit-lover-after-wife-nikki-caught-them-2776804-2025-08-26",
      "headline": "Noida dowry death: Accused husband had an affair, hit lover after wife caught themIn October last year, an FIR was filed in Noida after the woman with whom Vipin was having an affair alleged that he had beaten her when his wife caught them together. The FIR was based on her complaint, which accused Vipin of assault and exploitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-allows-600000-chinese-students-into-us-maga-goes-into-meltdown-2776797-2025-08-26",
      "headline": "Trump allows 600,000 Chinese students into US, MAGA goes into meltdownWhile trying to keep a fragile trade truce with China, Trump risks alienating his core base with his concessions, albeit made with gritted teeth, to Beijing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-himanta-biswa-sarma-eviction-drive-land-reclaimed-illegal-bangladeshi-immigrants-prashant-bhushan-2776466-2025-08-26",
      "headline": "1.5 lakh bighas and a storm: What Himanta's eviction drive has achievedAssam CM Himanta Biswa Sarma's eviction campaign has not only freed over 1.5 lakh bigha of land since 2021 but has stirred a storm ahead of the 2026 Assembly election. The Opposition alleges communal bias, political polarisation and collusion with industrialists. While Sarma frames the drive as vital to protecting Assam's identity and resources, critics say it targets Bengali-speaking Muslims."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/tamil-nadu-chennai-woman-feeding-stray-dogs-told-by-cop-harassment-happens-after-12-am-video-sparks-outrage-2776764-2025-08-26",
      "headline": "Harassment happens if you roam after 12 am: Chennai cop's remark to woman draws flakA woman in Chennai feeding stray dogs at night was told by a cop, \"harassment happens if you roam around like this after 12 am.\" The viral remark drew criticism, but police have not taken any action yet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-dowry-woman-allegedly-starved-tortured-to-death-by-husband-and-in-laws-police-register-suspicious-death-case-2776796-2025-08-26",
      "headline": "Starved, confined at home: Telangana woman allegedly killed by husband over dowryA 33-year-old woman was found dead in Telangana after alleged prolonged starvation and abuse by her husband and in-laws. Police have registered a suspicious death case, investigations are ongoing. Family accuses husband of dowry-related cruelty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-down-why-us-tariff-august-27-pharma-financial-shares-decline-pmo-meet-modi-2776775-2025-08-26",
      "headline": "Sensex crashes 600 points: Why is stock market down today?The BSE Sensex showed a negative start as trading commenced today, with most stocks tanking at the opening bell. Sensex and Nifty fell nearly 1% a few minutes after opening for trading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-bwf-world-championships-2776763-2025-08-26",
      "headline": "Lakshya Sen needs belief in process, no quick fixes on the road to revivalLakshya Sen's first-round exit at the BWF World Championships in Paris extends a challenging run, but there were glimpses of his old brilliance on Monday. Speaking to IndiaToday.in, coach Vimal Kumar says the 24-year-old must trust the process, play with conviction, and resist desperation to return to winning ways. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-guruvayur-shri-krishna-temple-holds-purification-rituals-after-vlogger-jasmin-jaffers-reel-sparks-row-bigg-boss-2776772-2025-08-26",
      "headline": "Kerala's Guruvayur temple conducts cleansing after non-Hindu vlogger enters pondThe Guruvayur Shri Krishna temple in Kerala's Thrissur is holding purification rituals after a non-Hindu vlogger, Jasmin Jaffer, filmed a reel washing her feet at the temple pond. Darshan remains restricted until the rituals are completed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-administration-issues-notice-imposing-additional-25-tariffs-indian-goods-august-27-glbs-2776712-2025-08-26",
      "headline": "US issues notice imposing additional 25% tariffs on India from August 27In August this year, Trump slapped an additional 25 per cent tariff, raising the overall levy to 50 per cent on goods coming from India, as a penalty for New Delhi's continued purchase of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-to-open-fourth-india-store-in-pune-on-september-4-just-in-time-for-iphone-17-launch-2776792-2025-08-26",
      "headline": "Apple to open fourth India store in Pune on September 4, just in time for iPhone 17 launchApple is set to open its fourth official store in India, this time in Pune. The company has announced that the new retail space, named Apple Koregaon Park, will welcome customers from September 4 at 1PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-om-shanti-comment-social-media-memes-priyadarshan-confusion-2776757-2025-08-26",
      "headline": "Mika Singh mistakes Priyadarshan's retirement as death, trolled for Om shanti gaffeMika Singh confused a post about Priyadarshan's retirement with a death announcement. Fans trolled him for commenting 'Om Shanti' on the post and said that he is still alive."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-matter-how-much-pressure-comes-well-find-a-way-out-says-pm-in-ahmedabad-ahead-of-50-us-tariff-deadline-2776588-2025-08-25",
      "headline": "We'll find way out despite pressure: PM stays firm ahead of 50% US tariff deadlinePrime Minister Narendra Modi, while addressing the public in Ahmedabad, said that India will stand firm no matter how much pressure comes. This was in response to the US tariff of 50% which is effective tomorrow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-minister-trb-rajas-son-refuses-medal-around-neck-from-bjp-chief-annamalai-accepts-it-in-hand-at-state-shooting-games-2776749-2025-08-26",
      "headline": "Tamil Nadu Minister's son refuses medal presentation from BJP's Annamalai at eventTamil Nadu Industries Minister TRB Raja's son, Suryaa Raaja Baalu, refused to let BJP leader K Annamalai garland him with a medal at the State Shooting Games, choosing instead to accept it by hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-signals-china-threatens-beijing-200-tariff-over-magnets-glbs-2776698-2025-08-26",
      "headline": "Would destroy China: Trump warns Xi of 200% tariffs over ban on magnet exportsRelations between the world's two largest economies reached a boiling point as both sides slapped punitive tariffs on each other's goods, disrupting global supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cannot-sleep-without-a-blanket-causes-science-and-expert-insights-2776574-2025-08-26",
      "headline": "Can't sleep without your blanket? Here's what psychology saysWhen our sleep cycle is disturbed, say by a missing blanket or because we are in an unfamiliar environment, it can feel nearly impossible to drift off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/highways-to-tiger-havens-what-kanha-bandhavgarh-pench-panna-could-gain-2776510-2025-08-25",
      "headline": "Highways to tiger havens: What Kanha, Bandhavgarh, Pench, Panna could gainThe Rs 5,500 crore tiger expressways project in Madhya Pradesh could prove to be a wildlife tourism boom, but critics have voiced environmental concerns"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dowry-demands-wife-burnt-hot-knife-madhya-pradesh-2776718-2025-08-26",
      "headline": "Madhya Pradesh man ties up wife, puts hot knife in her mouth over dowry demandsThe victim said that on Sunday night, her husband, while intoxicated, first beat her with kicks and then dragged her into the kitchen. He tied her hands and feet and pressed something resembling a gun on her head before burning her with a heated knife in several areas. He repeatedly told her that she was unwanted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/h-1b-visa-rumours-online-walmart-clarifies-investigation-no-link-glbs-2776725-2025-08-26",
      "headline": "Walmart rejects H-1B visa scandal claims after rumours swirl online: ReportAccording to social media posts, massive fraud had occurred at the retail giant, and even suggested a Vice President in the company's Global Tech division was removed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-ssunita-ahuja-divorce-rumours-baseless-pahlaj-nihalani-2776761-2025-08-26",
      "headline": "Govinda-Ssunita's divorce rumours are baseless, says filmmaker Pahlaj NihalaniVeteran filmmaker Pahlaj Nihalani dismissed rumours of trouble in Govinda and Ssunita Ahuja's marriage, calling the divorce buzz baseless. He described the couple as buddies who live and work together, stressing he had never seen signs of separation between them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025jasprit-bumrah-injuries-mahroof-2776482-2025-08-26",
      "headline": "Jasprit Bumrah's injuries are inevitable, irrespective of training: Farveez MaharoofFormer Sri Lanka all-rounder Farveez Maharoof explained the reasons behind Jasprit Bumrah's constant injuries. He also revealed his favourites for Asia Cup 2025 and admiration for Yashasvi Jaiswal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-navy-to-induct-state-of-the-art-stealth-frigates-ins-udaygiri-ins-himgiri-at-visakhapatnam-naval-base-2776648-2025-08-25",
      "headline": "Navy to induct state-of-the-art stealth frigates, Udaygiri and Himgiri, todayThe Indian Navy will commission its newly built stealth frigates Udaygiri and Himgiri at Visakhapatnam Naval base today in the presence of Defence Minister Rajnath Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-expels-iranian-envoy-pm-says-tehran-directed-anti-semitic-attacks-2776762-2025-08-26",
      "headline": "Australia expels Iranian envoy, PM says Tehran directed anti-semitic attacksAustralian Prime Minister Anthony Albanese said he had received \"credible intelligence\" linking the Iranian government to the attacks on Melbourne's Adass Israel Synagogue and Lewis' Continental Kitchen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-om-shanti-comment-social-media-memes-priyadarshan-confusion-2776757-2025-08-26",
      "headline": "Mika Singh mistakes Priyadarshan's retirement as death, trolled for Om shanti gaffeMika Singh confused a post about Priyadarshan's retirement with a death announcement. Fans trolled him for commenting 'Om Shanti' on the post and said that he is still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-ssunita-ahuja-divorce-rumours-baseless-pahlaj-nihalani-2776761-2025-08-26",
      "headline": "Govinda-Ssunita's divorce rumours are baseless, says filmmaker Pahlaj NihalaniVeteran filmmaker Pahlaj Nihalani dismissed rumours of trouble in Govinda and Ssunita Ahuja's marriage, calling the divorce buzz baseless. He described the couple as buddies who live and work together, stressing he had never seen signs of separation between them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aarti-ravi-mohan-keneedshaa-tirupati-temple-trip-2776744-2025-08-26",
      "headline": "Aarti shares cryptic posts after actor-husband Ravi-Keneeshaa's temple tripActor Ravi Mohan's estranged wife, Aarti, shared cryptic posts on Instagram after his temple visit with his 'companion' Keneeshaa. Ravi and Aarti's divorce case is currently going on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siddharth-sarathkumar-3bhk-sachin-tendulkar-2776722-2025-08-26",
      "headline": "Tamil film 3BHK finds an admirer in Sachin Tendulkar. Director Sri Ganesh reactsCricketing legend Sachin Tendulkar named the Tamil film '3BHK', starring Siddharth and Sarathkumar, as one of his recent favourites. The film's director Sri Ganesh expressed his joy on X."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-first-round-opelka-2776791-2025-08-26",
      "headline": "Buzz cut Alcaraz powers himself into 2nd round with straight sets winCarlos Alcaraz debuted a fresh buzz cut and won his US Open first-round match. His strong performance overshadowed mixed fan reactions to his new look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rio-ngumoha-liverpool-youngest-scorer-stoppage-time-winner-newcastle-premier-league-2776778-2025-08-26",
      "headline": "16-year-old Ngumoha scripts history as Liverpool down Newcastle in injury timeSixteen-year-old Rio Ngumoha scored a stunning stoppage-time winner for Liverpool against Newcastle. His historic goal secured a thrilling 3-2 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-cheteshwar-pujara-virat-kohli-rohit-sharma-2776783-2025-08-26",
      "headline": "Pujara is a whitewalker, his contributions are no less than Kohli and Rohit: R AshwinFormer India all-rounder Ravichandran Ashwin has compared Cheteshwar Pujara to a 'Whitewalker', mentioning that his contributions to Indian cricket were as similar as Virat Kohli and Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-bwf-world-championships-2776763-2025-08-26",
      "headline": "Lakshya Sen needs belief in process, no quick fixes on the road to revivalLakshya Sen's first-round exit at the BWF World Championships in Paris extends a challenging run, but there were glimpses of his old brilliance on Monday. Speaking to IndiaToday.in, coach Vimal Kumar says the 24-year-old must trust the process, play with conviction, and resist desperation to return to winning ways. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-on-virat-kohli-not-wanted-in-indian-test-team-2776758-2025-08-26",
      "headline": "Virat Kohli was feeling like he was not wanted in the Test team: Former batterFormer India batter Manoj Tiwary has made a big claim that Virat Kohli retired from Test cricket as he must've felt unwanted in the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-new-hairstyle-2776742-2025-08-26",
      "headline": "Is that really Carlos Alcaraz? Star looks unrecognisable in new hairdoUS Open: Spanish star Carlos Alcaraz sported a new look in the first round of the US Open. The new haircut shocked many, including his close friend Frances Tiafoe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025jasprit-bumrah-injuries-mahroof-2776482-2025-08-26",
      "headline": "Jasprit Bumrah's injuries are inevitable, irrespective of training: Farveez MaharoofFormer Sri Lanka all-rounder Farveez Maharoof explained the reasons behind Jasprit Bumrah's constant injuries. He also revealed his favourites for Asia Cup 2025 and admiration for Yashasvi Jaiswal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-venus-williams-match-2776720-2025-08-26",
      "headline": "45-year-old Venus Williams turns back the clock, but falls in fighting returnA 45-year-old Venus Williams made her long-awaited return to the Grand Slams on Tuesday, August 26. Playing against 11th seed Karolina Muchova, Williams lost in a 3-set battle.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-fsdl-meeting-indian-super-league-decision-supreme-court-2776687-2025-08-26",
      "headline": "AIFF-FSDL meet ends without ISL decision: Clubs fear possible shutdownAIFF and FSDL talks fail to resolve the deadlock over India's domestic football. Eleven ISL clubs warn of potential shutdown as uncertainty over the league's future threatens both national team readiness and continental competition participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-petra-kvitova-farewell-loss-diane-parry-krejcikova-mboko-2776675-2025-08-25",
      "headline": "US Open: Petra Kvitova bids farewell to tennis after first round defeatPetra Kvitova bid an emotional farewell after a first-round US Open exit, closing a stellar career with 31 WTA titles and two Wimbledon crowns. Meanwhile, Krejcikova advanced, overpowering Victoria Mboko 6-3, 6-2 in the opening round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-diamond-league-zurich-final-opponents-julian-weber-2776664-2025-08-25",
      "headline": "Neeraj Chopra's opponents for Zurich Diamond League Final revealedNeeraj Chopra heads into the Zurich Diamond League Final on August 28, aiming to conquer top global javelin throwers. With a stellar season behind him, he eyes victory and momentum ahead of Tokyo World Championship 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025jasprit-bumrah-injuries-mahroof-2776482-2025-08-26",
      "headline": "Jasprit Bumrah's injuries are inevitable, irrespective of training: Farveez MaharoofFormer Sri Lanka all-rounder Farveez Maharoof explained the reasons behind Jasprit Bumrah's constant injuries. He also revealed his favourites for Asia Cup 2025 and admiration for Yashasvi Jaiswal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-venus-williams-match-2776720-2025-08-26",
      "headline": "45-year-old Venus Williams turns back the clock, but falls in fighting returnA 45-year-old Venus Williams made her long-awaited return to the Grand Slams on Tuesday, August 26. Playing against 11th seed Karolina Muchova, Williams lost in a 3-set battle.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-fsdl-meeting-indian-super-league-decision-supreme-court-2776687-2025-08-26",
      "headline": "AIFF-FSDL meet ends without ISL decision: Clubs fear possible shutdownAIFF and FSDL talks fail to resolve the deadlock over India's domestic football. Eleven ISL clubs warn of potential shutdown as uncertainty over the league's future threatens both national team readiness and continental competition participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-petra-kvitova-farewell-loss-diane-parry-krejcikova-mboko-2776675-2025-08-25",
      "headline": "US Open: Petra Kvitova bids farewell to tennis after first round defeatPetra Kvitova bid an emotional farewell after a first-round US Open exit, closing a stellar career with 31 WTA titles and two Wimbledon crowns. Meanwhile, Krejcikova advanced, overpowering Victoria Mboko 6-3, 6-2 in the opening round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-diamond-league-zurich-final-opponents-julian-weber-2776664-2025-08-25",
      "headline": "Neeraj Chopra's opponents for Zurich Diamond League Final revealedNeeraj Chopra heads into the Zurich Diamond League Final on August 28, aiming to conquer top global javelin throwers. With a stellar season behind him, he eyes victory and momentum ahead of Tokyo World Championship 2025."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}