{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-donald-trump-narendra-modi-new-delhi-washington-2867027-2026-02-12",
      "headline": "India-US trade deal to benefit local industries: New Delhi envoy to WashingtonIndian ambassador to the United States, Vinay Kwatra, in an exclusive interview with India Today, said that the newly-reached trade deal between India and the US will benefit the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosy-tcs-wipro-tech-mahindra-it-stocks-falling-today-key-reasons-explained-2867009-2026-02-12",
      "headline": "Infosys, TCS, Wipro tumble up to 5%: Why are IT stocks falling today?From US jobs data to mounting AI disruption fears, here is a clear breakdown of what triggered today's IT sell-off and what investors should watch next."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-down-400-points-nifty-tank-it-shares-selloff-ai-wall-street-2866997-2026-02-12",
      "headline": "Sensex down 400 points: Why is stock market falling today?The S&P BSE Sensex was down by 401.41 points to 83,840.99, while the NSE Nifty50 lost 120.60 points to 25,833.25 as of 9:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-270-points-lower-nifty-below-26000-infosys-down-it-stockks-tumble-2866986-2026-02-12",
      "headline": "Sensex opens 270 points lower, Nifty below 26,000; Infosys down 4%The S&P BSE Sensex was down by 360.77 points to 83,872.87, while the NSE Nifty50 lost 99.70 points to 25,854.15 as of 9:21 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-mis-selling-rules-banks-refund-customers-dark-patterns-third-party-products-2026-insurance-ulip-2866966-2026-02-12",
      "headline": "RBI finally takes note of mis-selling, banks to refund if complaint is provedOver the past few years, concerns have been raised about customers being pushed into buying insurance, mutual funds or other third-party products without fully understanding them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rolls-royce-ceo-meets-pm-modi-in-delhi-discusses-plans-to-scale-up-india-ops-2866918-2026-02-12",
      "headline": "Rolls-Royce CEO meets PM in Delhi, discusses plans to scale up India opsRolls-Royce CEO Tufan Erginbilgic met Prime Minister Narendra Modi in Delhi to discuss plans to substantially expand the British engineering giant's operations in India in line with the government's Viksit Bharat vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-hire-3000-roles-india-credit-suisse-takeover-triggers-job-cuts-switzerland-glbs-2866915-2026-02-12",
      "headline": "UBS to hire 3,000 roles in India as Credit Suisse takeover triggers Swiss job cutsUBS bought Credit Suisse in a state-engineered rescue in 2023, leaving it as Switzerland's sole major banking group. It has said around 3,000 Swiss jobs will be cut, most likely later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-or-bitcoin-will-crypto-steal-the-spotlight-2866745-2026-02-11",
      "headline": "Gold, silver or Bitcoin? Will crypto steal the spotlightGold and silver have long been seen as safe havens for investors, a reliable store of value in uncertain times. But with the rise of Bitcoin and other cryptocurrencies, the question on everyone's mind is: could cryptos steal the spotlight?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pace-and-ease-of-doing-business-drive-tamil-nadus-edge-says-trb-rajaa-2866678-2026-02-11",
      "headline": "Pace and ease of doing business drive Tamil Nadu's edge, says TRB RajaaRajaa said that investors value policy continuity as much as fresh reforms, noting that Tamil Nadu has built trust by maintaining stable, industry-friendly rules across political regimes. He added that this continuity has strengthened global investor confidence in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ai-disruption-it-tech-financial-wealth-management-investors-tips-2866657-2026-02-11",
      "headline": "AI is disrupting more than just tech and IT stocks. What investors should knowThe panic around AI is now spreading across Wall Street, moving beyond tech to hit wealth management stocks as well. In this article, we break down what's happening and what retail investors should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-sbi-pnb-to-suryoday-small-finance-bank-a-look-at-latest-fd-rates-across-banks-2866648-2026-02-11",
      "headline": "From SBI, PNB to Suryoday Small Finance Bank: A look at latest FD rates across banksInterest rates vary widely depending on how long the money is locked in. In many cases, three-year and five-year deposits offer better returns than shorter tenures. At the same time, depositors should balance higher rates with factors such as bank safety, liquidity needs and their own financial goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-close-flat-it-stocks-fall-apollo-eicher-sbi-gains-us-india-trade-deal-2866619-2026-02-11",
      "headline": "Sensex, Nifty pause 3-day rally as IT stocks limit gains on D-StreetSensex, Nifty closed lower. Both indices had gained nearly 1.2% in the previous three sessions. The rally was driven by hopes around a possible U.S.-India trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ease-and-speed-of-doing-business-put-tamil-nadu-on-top-says-trb-rajaa-2866603-2026-02-11",
      "headline": "Ease and speed of doing business put Tamil Nadu on top, says TRB RajaaRajaa said Tamil Nadu's unique strength lies in being India's talent capital, adding that the state produces around 150,000 engineers and benefits from a strong talent pool built through heavy investment in education."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/mumbai-housing-society-pays-rs-3-lakh-dividend-jolly-maker-cuffe-parade-no-maintenance-charges-2866575-2026-02-11",
      "headline": "This Mumbai society pays nearly Rs 3 lakh to residents to live thereInstead of charging monthly maintenance, the society is said to distribute nearly Rs 2.5 lakh to Rs 3 lakh annually to each homeowner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-2026-might-be-the-best-time-in-years-to-buy-a-house-in-india-2866534-2026-02-11",
      "headline": "Why 2026 might be the best time in years to buy a house in IndiaAre affordable housing, sustainable living and the rise of Tier 2 and Tier 3 cities redefining India's property landscape in 2026? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-much-debt-does-india-have-budget-2026-debt-gdp-explained-2866531-2026-02-11",
      "headline": "How much debt does India have?According to the Receipt Budget 2026–27, the outstanding internal and external debt and other liabilities of the Government of India are estimated at Rs 214 lakh crore at the end of March 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/have-rs-30000-to-invest-edelweiss-mf-radhika-gupta-shares-smart-money-tips-2866473-2026-02-11",
      "headline": "Have Rs 30,000 to invest? Edelweiss MF's Radhika Gupta shares smart money tipsWith markets swinging and investors feeling unsure, many people are wondering where to put their money. Edelweiss Mutual Fund CEO Radhika Gupta has shared simple and practical advice for those trying to make smarter investment decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-tax-refund-even-after-90-days-heres-the-reason-behind-the-delay-2866451-2026-02-11",
      "headline": "No tax refund even after 90 days? Here's the reason behind the delayMany taxpayers expecting quick refunds are finding themselves stuck in a long wait. With several income tax returns pending for over 90 days, concerns are growing about delays and what they mean for ordinary filers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-in-india-how-to-avoid-key-expert-tips-2866410-2026-02-11",
      "headline": "Why awareness is the only antidote to mis-selling in insuranceAs India's insurance ecosystem continues to scale, the responsibility of protection must be shared, insurers must simplify, platforms must guide transparently, and consumers must engage with curiosity and awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-nse-bse-higher-fii-buying-q3-results-strong-jewellery-auto-up-2866393-2026-02-11",
      "headline": "Sensex, Nifty open in green as investor sentiment improves renewed FII buyingThe S&P BSE Sensex was up 71.22 points to 84,345.14, while the NSE Nifty50 added 44.90 points to 25,980.05 as of 9:28 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-justin-baldoni-fail-to-settle-trial-set-for-may-2026-2866964-2026-02-12",
      "headline": "Blake Lively, Justin Baldoni fail to reach settlement, trial set for May 2026 Blake Lively and Justin Baldoni could not resolve their legal dispute during a court-ordered settlement conference in New York, with a trial now scheduled for 18 May. Newly unsealed documents and viral exchanges add to the high-profile case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/he-man-super-mario-street-fighter-90s-nostalgia-set-to-hit-superhero-space-2865755-2026-02-12",
      "headline": "He-Man, Super Mario, Street Fighter: 90s nostalgia set to hit superhero space '90s Hollywood legends return with fresh fire — Mario soaring through the stars, fighters trading blows, He-Man claiming his destiny. Past efforts had their stumbles, but today's takes honour the magic that started it all, adding bold new chapters while capes keep flying strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-van-der-beek-dawsons-creek-star-dies-at-48-from-bowel-cancer-2866946-2026-02-12",
      "headline": "James Van Der Beek, Dawson's Creek star, dies at 48 from bowel cancer James Van Der Beek, known for his role as Dawson Leery, died following a diagnosis of bowel cancer. Fans and peers pay tribute to his legacy as an actor and advocate for cancer awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-wife-radha-yadav-thanks-bollywood-for-support-amid-legal-trouble-2866932-2026-02-12",
      "headline": "Rajpal Yadav's wife thanks Bollywood for support amid legal trouble Rajpal Yadav has received overwhelming support from the Hindi film industry amid his legal troubles. Prominent actors and musicians have extended financial and moral assistance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-censor-delay-boosts-pan-india-buzz-thalapathy-vijay-film-release-2866765-2026-02-12",
      "headline": "Jana Nayagan delay: How censor row led to pan-India hype for Vijay's film Thalapathy Vijay's Jana Nayagan release was postponed due to censor board certification issues. The delay may have raised screening risks amid upcoming elections, but it has also unexpectedly increased nationwide buzz about the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-and-team-are-sheer-losers-podcaster-deletes-actor-42-dos-donts-video-2866934-2026-02-12",
      "headline": "Allu Arjun, team are sheer losers: Podcaster deletes actor's 42 Dos & Don'ts video Podcaster Sweekriti Talks removed an interview with brand manager Kaveri Baruah following online harassment after the latter discussed the strict rules reportedly in place when working with actor Allu Arjun. The move comes amid strong legal threats from Allu Arjun's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-admits-he-may-not-have-been-in-love-with-gigi-hadid-2866928-2026-02-12",
      "headline": "Zayn Malik admits he may not have been in love with Gigi Hadid Singer Zayn Malik has opened up about his personal life, reflecting on his relationship with Gigi Hadid and his evolving views on love. Malik spoke candidly about his journey, suggesting he may never have truly been in love, even with Hadid, the mother of his daughter Khai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-addresses-hurtful-gossip-around-her-marriage-to-nick-jonas-2866926-2026-02-12",
      "headline": "Water off a duck's back now, says Priyanka on gossip around age-gap with Nick Jonas Actor Priyanka Chopra has responded to public curiosity and rumours surrounding her marriage to singer Nick Jonas, sharing her thoughts on their intercultural relationship and praising her husband's sincerity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/udit-narayan-first-wife-ranjana-narayan-jha-accuses-singer-non-consensual-uterus-removal-2866887-2026-02-11",
      "headline": "Udit Narayan's first wife claims her uterus was removed without consent Playback singer Udit Narayan has landed in controversy after his first wife, Ranjana Narayan Jha, filed a complaint at a women's police station in Supaul, Bihar, accusing him, his two brothers, and his second wife of serious wrongdoing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-financial-crisis-mika-singh-support-tihar-jail-surrender-2866850-2026-02-11",
      "headline": "Mika Singh donates Rs 11 lakh to Rajpal Yadav, actor gets ad film offer Mika Singh has offered financial support to actor Rajpal Yadav, who was recently sent to Tihar jail following a Delhi High Court order related to unpaid debts and cheque-bounce cases. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/darshan-birthday-celebrations-inspire-karnataka-fans-charity-social-service-2866795-2026-02-11",
      "headline": "Actor Darshan's fan club D Company urges charity on his birthday Fans of actor Darshan plan to mark his birthday on February 16 through acts of social service. The actor's film, Kariya, is set to be re-released on February 13, just ahead of his birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/fwice-film-body-flags-threats-to-celebrities-in-letter-to-devendra-fadnavis-seeks-his-appointment-2866824-2026-02-11",
      "headline": "Film body flags threats to celebrities in letter to Fadnavis, seeks his appointment In a letter to Maharashtra Chief Minister Devendra Fadnavis, the Federation of Western India Cine Employees (FWICE) sought an urgent appointment to discuss rising security threats to members of the entertainment industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-shares-memories-acting-debut-punadhirallu-47-years-ago-2866817-2026-02-11",
      "headline": "Chiranjeevi reflects on 47 years since his Telugu debut with nostalgic photos On the anniversary of his first on-camera experience for Punadhirallu, Chiranjeevi reflected on the emotions of that day and thanked his fans, director, and producer for their longstanding support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/surbhi-jyoti-announces-pregnancy-with-husband-sumit-suri-expecting-baby-june-2026-2866806-2026-02-11",
      "headline": "Qubool Hai actor Surbhi Jyoti announces pregnancy, baby due in June 2026 Television actor Surbhi Jyoti announced that she and her husband Sumit Suri are expecting their first child. She shared the news with fans through a social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/how-vijay-leo-helped-gautham-menon-recover-from-financial-struggles-2866800-2026-02-11",
      "headline": "How Vijay's Leo helped Gautham Menon recover from financial struggles Director Gautham Vasudev Menon credited his acting role in Vijay's Leo with helping him overcome financial difficulties that delayed his film Dhruva Natchathiram. The long-awaited spy thriller, headlined by Vikram, is expected to release soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rakshasa-trailer-north-karnataka-crime-thriller-vijay-raghavendra-zee5-2866778-2026-02-11",
      "headline": "Rakshasa trailer: Vijay Raghavendra hunts truth in rural murder mystery The trailer of Rakshasa showcases a gripping crime thriller set in rural North Karnataka. The series explores the mysterious deaths near Malaprabha River and features Vijay Raghavendra in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ata-pata-laapatas-padam-singh-backs-rajpal-yadav-he-will-repay-every-rupee-2866773-2026-02-11",
      "headline": "Ata Pata Laapata's Padam Singh backs Rajpal Yadav: He will repay every rupee Actor Padam Singh, close friend and co-actor of Rajpal Yadav, shared his thoughts on the circumstances and intent behind Ata Pata Laapata. Singh emphasised Rajpal's vision behind the film, production challenges, and its impact on the actor's financial situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-mummy-4-release-date-out-brendan-fraser-rachel-weisz-to-return-after-20-years-2866794-2026-02-11",
      "headline": "The Mummy 4 release date out: Brendan Fraser, Rachel Weisz to return after 20 years The Mummy 4 is officially in the works, with Brendan Fraser and Rachel Weisz returning as Rick O'Connell and Evelyn Carnahan after nearly 20 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/did-kumar-sanus-son-jaan-call-kunickaa-a-joke-in-cryptic-note-heres-what-he-said-2866746-2026-02-11",
      "headline": "Don't take her seriously: Did Kumar Sanu's son Jaan call Kunickaa a joke? Kumar Sanu's son Jaan reacted to the social media clash between Kunickaa Sadanand and Tanya Mittal's fans. Telling followers to ignore those \"treated as a joke,\" he dismissed the drama while Kunickaa hit back by defending her family and mentioning her personality rights."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kanpur-tobacco-tycoons-son-shivam-arrested-in-connection-to-kanpur-lamborghini-crash-case-2867014-2026-02-12",
      "headline": "Kanpur tobacco tycoon's son arrested in Lamborghini crash caseShivam Mishra, son of tobacco baron KK Mishra, was arrested in the Lamborghini crash case on Kanpur's VIP Road that injured six people and damaged several vehicles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-elections-2026-voting-results-what-it-means-india-2866493-2026-02-12",
      "headline": "Bangladesh votes today amid turmoil. What it means for India  Live UpdatesHandcrafted ByOur Editors This year's elections in Bangladesh on Thursday are the most consequential, not only for Dhaka but for India as well. It comes following a turbulent 18 months that saw the fall of the Sheikh Hasina regime and an interim government under Muhammad Yunus take charge. It saw ties with India reach an all-time low. Who are the key players? What do the elections mean for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/organised-leak-delhi-police-probe-finds-gen-naravane-memoir-entered-global-markets-before-government-approval-2866937-2026-02-12",
      "headline": "Naravane memoir leak organised, entered global markets sans govt clearance: CopsEarlier this week, Delhi Police registered an FIR under charges of criminal conspiracy in connection to the memoir's leak. The move followed questions raised by India Today Digital over how an unpublished book reached Congress leader Rahul Gandhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ai-171-crash-ahmedabad-pilot-intentional-engine-shutdown-investigation-final-report-2866968-2026-02-12",
      "headline": "Probe finds Air India crash was intentional, pilot turned off fuel switch: ReportThe Air India crash in Ahmedabad was caused not by a technical failure but by an alleged intentional act involving the manual shutdown of engine fuel control switches, a fresh news report claims. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-election-news-bnp-jamaat-e-islami-awami-league-hindu-minority-hasina-awami-league-2866848-2026-02-12",
      "headline": "Jamaat's incredible jumpFrom the shadows of ban, the Shafiqur Rahman-led Bangladesh Jamaat-e-Islami has emerged at the centrestage. As Bangladesh votes today, it's giving the Tarique Rahman-led BNP a tough fight. With the Jamaat promising \"change\" in post-Sheikh Hasina Bangladesh, what would its reassurance to Hindu minorities and New Delhi, really mean?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-match-preview-t20-world-cup-2866994-2026-02-12",
      "headline": "Hero entry delayed. Can India deliver in Delhi before clash with the main villain?T20 World Cup 2026, India vs Namibia preview: After a gritty survival drama in Mumbai, India moves to Delhi seeking a blockbuster opening act. With Sanju Samson in and Jasprit Bumrah returning, can the hero find his rhythm before the Colombo clash with the main villain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sarah-ferguson-duchess-of-york-former-wife-andrew-daughters-eugenie-beatrice-visit-jeffrey-epstein-release-jail-sex-crimes-fresh-emails-viral-2866960-2026-02-12",
      "headline": "You're a legend, marry me: British royal Sarah Ferguson's damning mail to EpsteinEmail exchanges between former Duchess of York Sarah Ferguson and registered sex offender Jeffrey Epstein have revealed their close connection. They revealed the British royal visited him in the US with her then young daughters days after his release from jail for child sex crimes. She also termed the sex offender a \"legend\", thanked him for his kindness, and sought financial help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-shadows-and-succession-periyar-tamil-and-posthumous-echoes-part-23-348-11-02-2026",
      "headline": "Time, Tide & Tamil Part 23 | Shadows & Succession: Periyar Tamil & Posthumous EchoesTamil Nadu is the graveyard of national political parties. It buried the Congress at its peak then in 1967. The BJP, also at its peak now, has been pregnant with possibilities but has failed to deliver. Never a serious player in the state before the dawn of the Modi-era, the BJP has been humbled in every election since his arrival in 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/whatsapp-me-deepinder-goyal-flooded-with-8000-emails-as-ex-employees-reapply-2867022-2026-02-12",
      "headline": "Deepinder Goyal gets 8,000 emails as ex-staff reapplyZomato CEO Deepinder Goyal shared how he felt after receiving an overwhelming 8,000 emails from current and former employees in a now-viral post on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-general-election-2026-live-updates-voting-percentage-polling-dhaka-july-charter-glbs-2866900-2026-02-12",
      "headline": "Live: Strong response at polling booths as Bangladesh decides futureBangladesh General Election Live Updates: It's a big day for Bangladesh as 127 million eligible citizens cast their votes in the first national election after the fall of the Sheikh Hasina government in August 2024. They are also voting on the July Charter, which, if approved, will give the next government the authority to make big changes in the country's Constitution and democratic system. The key fight is between the alliances led by the Bangladesh Nationalist Party (BNP) and the Jamaat-e-Islami. We bring you live updates on the voting, reactions, and analyses from our trusted sources and reporters on the ground. Follow indiatoday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-stabs-retired-navy-captain-father-dentist-mother-to-death-arrested-vigyan-nagar-killings-hal-police-2866901-2026-02-12",
      "headline": "Bengaluru techie stabs retired Navy Captain father, dentist mother to death; arrestedPolice have registered a murder case and said the alleged attack followed a family dispute, though the exact motive is still under investigation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kanpur-lamborghini-crash-new-video-shows-bouncers-trying-remove-car-number-plate-2867004-2026-02-12",
      "headline": "Lamborghini crash: New video shows bouncers trying to remove car's number plateThe new footage purportedly captures bouncers associated with Shivam Mishra, the tobacco tycoon's son who was seated in the car at the time of the crash on Sunday, trying to tear off the vehicle's registration plate, allegedly in a bid to conceal the Lamborghini's identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sturla-holm-laegrid-confession-biathlon-controversy-winter-olympics-2866985-2026-02-12",
      "headline": "A confession out of sync: Sturla Holm Laegreid and the art of misreading the roomA moment to win the heart of the 'gold medal of his life' has found Sturla Holm Laegrid deliver one of the most bizarre and controversial athlete interviews of all time. By putting his partner in a rough spot and stealing the thunder from his teammate, Laegrid's words were right but delivered at the wrong moment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-bengaluru-suv-driver-speeds-off-with-man-on-bonnet-in-road-rage-incident-on-old-airport-road-2866913-2026-02-12",
      "headline": "Watch: Bengaluru SUV driver drags auto driver on bonnet after altercationAccording to information received from the Bengaluru Traffic Police, the incident reportedly began after the SUV driver allegedly brushed against an auto-rickshaw, leading to a heated argument between the two parties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-nam-no-night-training-session-namibia-india-unfair-advantage-delhi-2866737-2026-02-11",
      "headline": "Namibia captain questions ICC for no night training in DelhiT20 World Cup: Gerhard Erasmus questions scheduling after Namibia were denied a night training session, while India trained twice under lights ahead of their clash in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-addresses-hurtful-gossip-around-her-marriage-to-nick-jonas-2866926-2026-02-12",
      "headline": "Water off a duck's back now, says Priyanka on gossip around age-gap with Nick JonasActor Priyanka Chopra has responded to public curiosity and rumours surrounding her marriage to singer Nick Jonas, sharing her thoughts on their intercultural relationship and praising her husband's sincerity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-censor-delay-boosts-pan-india-buzz-thalapathy-vijay-film-release-2866765-2026-02-12",
      "headline": "Jana Nayagan delay: How censor row led to pan-India hype for Vijay's filmThalapathy Vijay's Jana Nayagan release was postponed due to censor board certification issues. The delay may have raised screening risks amid upcoming elections, but it has also unexpectedly increased nationwide buzz about the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-t20-world-cup-2026-anchor-role-no-3-2866947-2026-02-12",
      "headline": "Visualiser. New-age T20 anchor. The many shades of India's No.3 Tilak VarmaT20 World Cup: In an Indian batting order dominated by flamboyant stroke-makers, Tilak Varma is prepared to rein himself in as a Virat Kohli-esque anchor at No.3 when the situation demands. But beyond the tactical role, he is a visualiser, a batter who prepares as much in his mind as he does in the nets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadavs-bail-hearing-tomorrow-manager-says-salman-ajay-stepping-in-to-help-2866604-2026-02-11",
      "headline": "Rajpal Yadav's bail hearing today; manager says Salman, Ajay stepping in to help Live UpdatesActor Rajpal Yadav's bail hearing is scheduled for February 12 as he serves a six-month jail term in a cheque-bounce case. His manager claimed Salman Khan, Ajay Devgn, Varun Dhawan and others from the industry promised to help financially."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-elections-hindu-man-killed-yunus-regime-protest-sheikh-hasina-ratan-sahuakar-2866930-2026-02-12",
      "headline": "Hindu man found dead in Bangladesh on polls eve, limbs tied, deep wounds on bodyA Hindu tea garden worker was found bound and dead in Bangladesh's Moulvibazar district a day before voting. Blood was reportedly still oozing from the injuries when the body was discovered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/who-is-a-pedophile-red-flags-2866472-2026-02-12",
      "headline": "You can't tell who a pedophile is, but you can catch the red flagsThe predator is rarely unknown. Most of the time, they groom the child and the people around them long before the abuse occurs. That grooming is the warning sign you need to notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/turkey-parliament-clash-akin-gurlek-justice-minister-akin-gurlek-appointment-glbs-2866929-2026-02-12",
      "headline": "Video: Fists fly, kicks land in Turkey parliament over minister's appointmentThe scuffle erupted as opposition lawmakers attempted to prevent Akin Gurlek, newly appointed by President Recep Tayyip Erdogan, from taking his oath of office following a cabinet reshuffle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadian-police-identify-trans-woman-suspect-british-columbia-school-shooting-glbs-2866924-2026-02-12",
      "headline": "18-year-old trans woman with mental health history named as Canada school shooterCanadian Police said Jesse Van Rootselaar died by suicide after opening fire on Tuesday at a secondary school in Tumbler Ridge, a remote community of about 2,400 people. Nine people, including the suspect, were killed. Police earlier reported 10 deaths before revising the figure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/tamil-nadu-assembly-elections-vijay-factor-annamalai-karti-chidambaram-2866744-2026-02-11",
      "headline": "Is Vijay a factor in Tamil Nadu polls? Annamalai, Karti Chidambaram weigh inSpeaking at the India Today Tamil Nadu Roundtable, BJP's K Annamalai and Congress MP Karti Chidambaram locked horns on the upcoming elections, as well as the Vijay factor."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-oman-live-score-t20-world-cup-today-match-pallekele-updates-2867024-2026-02-12",
      "headline": "SL vs OMA Live: Will co-hosts recover from Hasaranga blow? Sri Lanka (SL)vs Oman (OMA) Live Score, T20 World Cup: Sri Lanka play their second game of the tournament against Oman. Ahead of the game, the co-hosts lost the services of their star-spinner Wannindu Hasaranga. Will they be able to recover from this massive blow?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-top-5-players-t20-world-cup-2866984-2026-02-12",
      "headline": "From JJ Smit to Jan Frylinck: 5 Namibia stars who can derail India's charge T20 World Cup, IND vs NAM: JJ Smit, Ruben Trumpelmann and Jan Frylinck are among the Namibian cricketers who could pose a significant threat to India when the two teams meet in their group-stage clash on Thursday at the Arun Jaitley Stadium in New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-match-preview-t20-world-cup-2866994-2026-02-12",
      "headline": "Hero entry delayed. Can India deliver in Delhi before clash with the main villain? T20 World Cup 2026, India vs Namibia preview: After a gritty survival drama in Mumbai, India moves to Delhi seeking a blockbuster opening act. With Sanju Samson in and Jasprit Bumrah returning, can the hero find his rhythm before the Colombo clash with the main villain?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-namibia-t20-world-cup-selection-pakistan-prep-samson-bumrah-2867005-2026-02-12",
      "headline": "Namibia first, Pakistan already on mind: India's Sunday plans in motion T20 World Cup: India face Namibia tonight with one eye on Pakistan. Abhishek Sharma's fitness concerns force India to weigh up alternatives, while tactical experiments could shape their approach for the blockbuster clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sturla-holm-laegrid-confession-biathlon-controversy-winter-olympics-2866985-2026-02-12",
      "headline": "A confession out of sync: Sturla Holm Laegreid and the art of misreading the room A moment to win the heart of the 'gold medal of his life' has found Sturla Holm Laegrid deliver one of the most bizarre and controversial athlete interviews of all time. By putting his partner in a rough spot and stealing the thunder from his teammate, Laegrid's words were right but delivered at the wrong moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-india-t20-world-cup-2026-anchor-role-no-3-2866947-2026-02-12",
      "headline": "Visualiser. New-age T20 anchor. The many shades of India's No.3 Tilak Varma T20 World Cup: In an Indian batting order dominated by flamboyant stroke-makers, Tilak Varma is prepared to rein himself in as a Virat Kohli-esque anchor at No.3 when the situation demands. But beyond the tactical role, he is a visualiser, a batter who prepares as much in his mind as he does in the nets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-sri-lanka-oman-nepal-italy-india-namibia-preview-2866724-2026-02-12",
      "headline": "Matchday Preview: Nepal look to bounce back after England heartbreak Day 5 of the T20 World Cup 2026 features a triple-header with Sri Lanka looking to continue their momentum against Oman. Following their heartbreaking loss to England, Nepal will aim to bounce back strongly against Italy. All eyes will be on defending champions India as they face off against Namibia in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-targets-2027-odi-world-cup-victory-denies-retirement-2866884-2026-02-12",
      "headline": "Rohit Sharma lays down roadmap for ODI WC 2027: Will do everything to win it Former India captain Rohit Sharma has reconfirmed his ambition to win the 2027 ODI World Cup in South Africa. Rohit's form was in question in the recent New Zealand series, where he scored 61 runs from three innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/rajasthans-champions-run-pillar-to-post-as-crores-in-prize-money-remain-unpaid-2866897-2026-02-12",
      "headline": "Rajasthan's champions run pillar to post as crores in prize money remain unpaid This report on 5ive Live, hosted by Sonal Mehrotra Kapoor, exposes how medal-winning athletes in Rajasthan are trapped in bureaucratic delays, waiting years for promised prize money. Asian Games paramedalist Rakesh owes Rs 8-10 lakh for state and national medals won between 2021 and 2025. National hammer throw record-holder Neeraj Kumar has waited over 4 years for Rs 50-70,000. Disc thrower Praveen Kumar Nehra hasn't received Rs 5 lakh since 2016-2017, with a 2019 guideline blocking pre-2019 payments. Cyclist Devendra Bishnui, despite winning 8 medals, has received nothing, while competitive cycles cost over Rs 5 lakh. Nearly 90 per cent of medal winners remain unpaid, forcing some champions into survival jobs like cab driving and food delivery. The Rajasthan Sports Council attributes delays to \"ongoing processes\" and new online systems, but athletes continue waiting while their careers and financial stability deteriorate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/steve-smith-australia-in-t20-world-cup-nathan-ellis-press-conference-2866892-2026-02-11",
      "headline": "Steve Smith an automatic choice for Australia in T20 World Cup? Nathan Ellis reveals T20 World Cup, AUS vs IRE: Speaking to the reporters after the win against Ireland on Wednesday, Nathan Ellis opened up on whether Steve Smith would be included in the team if Mitchell Marsh doesn't recover from his groin injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-launches-womens-bpl-amid-t20-world-cup-boycott-2866888-2026-02-11",
      "headline": "Men's T20 World Cup snub behind, Bangladesh launches another new T20 league On Wednesday, the Bangladesh Cricket Board (BCB) launched the inaugural Women's Bangladesh Premier League, which is set to be held in April later this year. Recently, the BCB also introduced the Odommo T20 Cup for the men's team following their decision to boycott the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-sa-vs-afgjonathan-trott-full-post-match-press-conference-2866827-2026-02-11",
      "headline": "SA fielded better than us, that was the point of difference: Jonathan TrottICC T20 World Cup, SA vs AFG: Afghanistan head coach Jonathan Trott said that Afghanistan's poor fielding led to their defeat against South Africa in their second group fixture at the Narendra Modi Stadium in Ahmedabad. Afghanistan lost to South Africa in double super over fixture on Wednesday, February 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-crush-england-wankhede-t20-world-cup-2026-gudakesh-motie-sherfane-rutherford-2866878-2026-02-11",
      "headline": "10 years on, West Indies channel 2016 magic to crush England at WankhedeT20 World Cup 2026: With two wins on the bounce and Darren Sammy at the helm, the West Indies channel their 2016 spirit to crush England at Wankhede once more, defending 196 with a clinical spin-led performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-injury-australia-opener-travis-head-captaincy-2866875-2026-02-11",
      "headline": "Australia in trouble? Nathan Ellis opens up on Mitchell Marsh's injury scareT20 World Cup, AUS vs IRE: Nathan Ellis addressed Mitchell Marsh's injury scare after the skipper missed Australia's opener with a groin issue, but insisted the squad remained calm and unfazed under stand-in captain Travis Head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-south-africa-training-extended-april-ministry-approves-funds-2866863-2026-02-11",
      "headline": "Neeraj Chopra's South Africa training extended, Sports Ministry approves fundsThe Sports Ministry's Mission Olympic Cell has approved an extension of Neeraj Chopra's training in South Africa till April, providing comprehensive financial support for his pre-season preparation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/kesha-maharaj-kagiso-rabada-marco-jansen-ryan-rickelton-press-conference-super-over-call-afghanistan-2866862-2026-02-11",
      "headline": "Maharaj over Rabada or Jansen: Rickelton explains brave Super Over call vs AfghanistanT20 World Cup, SA vs AFG: Speaking to the reporters after the thrilling encounter, Ryan Rickelton opened up on why South Africa proffered Keshav Maharaj over Kagiso Rabada and Marco Jansen for the second Super Over against Afghanistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-uefa-agreement-ends-super-league-project-2866846-2026-02-11",
      "headline": "European Super League project comes to an end with Real Madrid's agreement with UEFAReal Madrid reached an agreement with UEFA on Wednesday, officially ending the controversial Super League project that attempted to break away from traditional European soccer in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-suryakumar-bhai-and-i-can-perform-the-role-of-anchor-if-needed-says-tilak-varma-2866843-2026-02-11",
      "headline": "Suryakumar bhai and I can perform the role of anchor if needed: Tilak VarmaHere's the full transcript of India batter Tilak Varma's press conference ahead of their February 12 match against Namibia in the T20 World Cup 2026. \r\n\r\n[Reporter:]\r\nTilak, what is the situation of Abhishek who was admitted to the hospital? Is he fine? Is he still in the hospital, or is he with the team at the hotel?\r\n\r\n[Tilak Verma:]\r\nWhen we reached Delhi, he went for some examinations at the hospital. I think he has been discharged today, and he's doing well. We still have one more day before the game, so hopefully we'll decide by tomorrow how he feels and then move forward accordingly.\r\n\r\n[Reporter:]\r\nWhen you play against less experienced teams, their field placements, bowling speeds, and shot selections can be different. Does that make it difficult for teams like India to adjust? What adjustments do you have to make?\r\n\r\n[Tilak Verma:]\r\nEspecially with these newer teams, you can't take anyone lightly. You saw that in the last match. It wasn't that we took them lightly, but we didn't read the conditions properly. After that, Surya bhai came in and played a great innings, which helped the team a lot.\r\nAt the same time, we should always back our basics and play our best game. Whatever the field or situation, you have to read it ball by ball. T20 cricket is a very short format—anything can happen, and any team can beat anyone. So it's important to bring your A-game in every match.\r\n\r\n[Reporter:]\r\nYesterday it was said that Jasprit Bumrah had started bowling again after 10 days. He was in the nets for quite a long time. What is the update on him? Will he be available for tomorrow's game?\r\n\r\n[Tilak Verma:]\r\nHe is absolutely fine now. He's doing better. As I said, we still have one more day, so hopefully he'll be back in the team. If he continues to improve, the team management will take a call, and I think he could be back for the second game.\r\n\r\n[Reporter:]\r\nTilak bhai, tomorrow there's a match, and after that, another big one in Colombo. There has been a lot of discussion around it. As a player, what were you thinking? Was there any discussion about whether you would play or not?\r\n\r\n[Tilak Verma:]\r\nNo, sir. To be honest, we're actually excited to play now. We found out that the match is going to happen, and we were already preparing for it. We've been watching the opposition, studying their bowlers, and preparing as batsmen.\r\nWhen we heard the match would be played, all the players and staff were excited. We're in match mode now, and the planning has started.\r\n\r\n[Reporter:]\r\nCan you talk about your comeback from injury, playing at number three, and your new role compared to what you were doing before?\r\n\r\n[Tilak Verma:]\r\nYes, sir. I'm really happy to be back in the World Cup squad. I worked hard over the last two or three weeks and followed good routines. God has been kind, and I returned to the field quickly.\r\nMy aim is to help the team win the World Cup. I'm ready for whatever role the team wants from me. I've always said I'm ready to bat wherever the team needs me. I'm prepared for any role, and I'm looking forward to it.\r\n\r\n[Reporter:]\r\nWhen you were declared fit and started playing the warm-up games, Surya said you've come back as a better player with a stronger mindset. What was your mindset during rehab? Did the break help you reset before the big tournament?\r\n\r\n[Tilak Verma:]\r\nFirst of all, if I have to sit for a couple of days without a bat in my hands, I feel very strange. It feels like I'm in a different world.\r\nEvery night before sleeping, I visualize playing in big matches, even the World Cup final, and putting myself under pressure. It's a habit from childhood. I've been playing for so many years that these thoughts come naturally before I sleep.\r\nSo I don't worry about breaks. My mind stays in the same positive zone. I keep preparing mentally. I didn't feel like I was out of the game because of injury. I stayed in the zone, focused on winning matches, and reacted to the situations when I returned.\r\n\r\n[Reporter:]\r\nIn tomorrow's match and the one in Ahmedabad, do you want to experiment to find the perfect combination before the Super 8?\r\n\r\n[Tilak Verma:]\r\nThere is still time before the Super 8 and the final. We have to go match by match. First, we will focus on tomorrow's match.\r\nThe main thing is what we can do well in that game. So we'll think about that and approach the match accordingly. If everything goes well, the rest will take care of itself.\r\n\r\n[Reporter:]\r\nAfter the openers, it's often said that the batting positions from three to five will be flexible. How do you look at your batting position? Are you preparing for different roles?\r\n\r\n[Tilak Verma:]\r\nAs I said, I'm ready to play in any position. But I believe the middle overs are very important and should be handled by a settled batsman.\r\nI try to take the game deep, especially when we are chasing. We have a lot of power-hitters all the way down to number eight, so someone needs to anchor the innings in the middle overs. I take that responsibility on myself.\r\nEvery match is different—the wicket, the conditions, the bowlers. Even against the same team, every day is different. So I focus on the present and react to the situation instead of thinking too far ahead.\r\n\r\n[Reporter:]\r\nGoing back to the Mumbai game, was the collapse more about reading the conditions or shot selection? How did it become 77 for 6?\r\n\r\n[Tilak Verma:]\r\nTo be honest, at the start, when Abhishek got out, I went in and felt the ball was coming nicely onto the bat. I thought the wicket was fine, but actually it wasn't. I was just in that flow.\r\nUnfortunately, it happens. People also felt it was playing well. But after a few wickets fell, we realized we had assessed the pitch a bit late. We had one or two soft dismissals as well.\r\nBut the way Surya played was a masterclass. That's the strength of this team. We haven't lost a bilateral series because someone always takes responsibility. That's a big sign. In this tournament, especially in the Super 8 or knockouts, such innings will be crucial.\r\n\r\n[Reporter:]\r\nMost of the players were champions in 2024, but for some, including you, this is the first World Cup. What's different about playing your first World Cup, especially in India?\r\n\r\n[Tilak Verma:]\r\nFirst of all, it's a dream. Playing a World Cup in home conditions is very special. Starting the first match at Wankhede was also special. Not every cricketer gets to experience that.\r\nAt the same time, there is pressure because everyone expects you to win at home. We saw the support from the crowd in the last match. So there are expectations and pressure, but also strong support.\r\nThere are advantages and disadvantages, but we've been handling pressure since childhood. We're enjoying it now, and we'll see how it goes.\r\n\r\n[Reporter:]\r\nIndia vs Pakistan is coming up. Pakistan's spinners are doing well in Colombo. What is your preparation and mindset for that match?\r\n\r\n[Tilak Verma:]\r\nWe're taking it one match at a time. We'll use video analysis and technology to study their bowlers and the conditions. We've already started preparing.\r\nWe have all kinds of shots in our team, so depending on the wicket and the situation, we'll decide whether to attack or play accordingly. We'll pick the best team for the conditions and go from there.\r\n\r\n[Reporter:]\r\nThere was talk earlier that only the top two positions were fixed, with flexibility after that. But now it seems like you and Surya are set at three and four. What has changed?\r\n\r\n[Tilak Verma:]\r\nWorld Cups come with high expectations and pressure. We've done well at numbers three and four. In those positions, we can find gaps and rotate the strike.\r\nOur openers are aggressive, and we have powerful hitters down the order. So the middle overs become very important. I believe the team that performs well between overs 6 and 16 usually wins the match.\r\nThat's why Surya and I are taking responsibility in those positions—to manage the pressure and set things up for the finishers. That's the plan we've discussed.\r\n\r\n[Reporter:]\r\nAfter the difficult batting performance against the USA, what did the head coach say in the dressing room?\r\n\r\n[Tilak Verma:]\r\nTo be honest, Gautam sir didn't say much. He said it happens once in a while. In pressure situations, we gave away a couple of wickets. He told us we should read the conditions earlier.\r\nWe usually play with an aggressive approach, but when wickets fall, sometimes we need to hold back for a couple of overs before accelerating again, especially considering our batting depth.\r\nHe said he would back whatever we decided as players, and that we should continue playing with the same intensity. That was the main message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/milan-winter-olympics-2026-norwegian-biathlete-regrets-cheating-confession-overshadowed-teammates-gold-2866838-2026-02-11",
      "headline": "Norwegian athlete's ex-girlfriend reacts to on-air cheating confessionNorwegian biathlete Sturla Holm Laegreid apologized for publicly confessing to infidelity during a post-race interview, admitting his emotional revelation overshadowed his teammate's gold medal win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-suryakumar-yadav-rescues-team-against-usa-2866822-2026-02-11",
      "headline": "I will back you: Gautam Gambhir values belief in batting unit over one bad dayT20 World Cup 2026: Speaking on the eve of India's game against Namibia in Delhi, Tilak Varma revealed how Gautam Gambhir reacted to India's ordinary batting show against the USA in their opening game. Suryakumar Yadav rescued India with 84 after the hosts were reeling at 77 for 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-jonathan-trott-on-super-8-qualification-after-loss-vs-south-africa-2866815-2026-02-11",
      "headline": "After SA heartbreak, AFG coach hoping for upsets to seal Super 8 qualificationAfghanistan suffered a heart-breaking Super Over defeat against South Africa in the T20 World Cup 2026. Coach Jonathan Trott remains hopeful of qualifying for the Super 8, despite the tough challenge ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ishan-kishan-injury-jasprit-bumrah-yorker-india-vs-namibia-2866791-2026-02-11",
      "headline": "Ishan Kishan suffers injury scare after Jasprit Bumrah toe-crusherT20 World Cup 2026: Ishan Kishan suffered a painful blow to his left leg from a yorker by Jasprit Bumrah during India's practice session in Delhi on Wednesday. India will face Namibia in their second Group A game on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-australia-beat-ireland-nathan-ellis-adam-zampa-2866761-2026-02-11",
      "headline": "Ellis, Zampa run riot in Colombo as Australia get off to winning start vs IREAustralia started their T20 World Cup 2026 campaign with a commanding win over Ireland. Nathan Ellis (4/12) and Adam Zampa (4/23) scalped four wickets each to restrict Ireland to 115 in 16.5 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-live-score-t20-world-cup-today-match-mumbai-updates-2866740-2026-02-11",
      "headline": "ENG vs WI Highlights: Motie, Chase guide West Indies to 30-run winENG (England) vs WI (West Indies) Highlights, T20 World Cup: West Indies beat England by 30 runs in Match 15 of the ICC T20 World Cup 2026. Gudakesh Motie was the pick of the bowlers for West Indies with best figures of 3/33 in four overs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-abhishek-sharma-discharged-india-vs-namibia-2866739-2026-02-11",
      "headline": "Abhishek Sharma out of hospital, call on availability for Namibia game on matchdayT20 World Cup 2026: India opener Abhishek Sharma has been discharged from a Delhi hospital after being treated for a stomach-related illness. A decision on his availability for Thursday's match against Namibia in Delhi will be taken on matchday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-nam-no-night-training-session-namibia-india-unfair-advantage-delhi-2866737-2026-02-11",
      "headline": "Namibia captain questions ICC for no night training in DelhiT20 World Cup: Gerhard Erasmus questions scheduling after Namibia were denied a night training session, while India trained twice under lights ahead of their clash in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-super-over-ryan-rickelton-kagiso-rabada-2866715-2026-02-11",
      "headline": "Cricket sucks, will give Rabada some space: RickeltonAFG vs SA: South Africa batter Ryan Rickelton joked that cricket sucks after the team's double super over thriller against Afghanistan. The batter said that the team will also put their hands around Kagiso Rabad, who had a tough day out in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-rashid-khan-blames-farooqi-super-over-loss-south-africa-t20-world-cup-2866613-2026-02-11",
      "headline": "Rashid blames Fazalhaq for heartbreaking loss vs SA: 1 dive could've finished itAfghanistan captain Rashid Khan blamed Fazalhaq Farooqi for their narrow loss to South Africa in a double super over thriller. Afghanistan were on the verge of scripting history, needing two runs to win off the last three balls, chasing 188."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-steve-smith-called-up-mitchell-marsh-injury-t20-world-cup-2026-2866607-2026-02-11",
      "headline": "Steve Smith rushed in as cover as Australia reel from massive injury blowT20 World Cup: AUS vs IRE: Australia have called up Steve Smith as cover after injury to Mitchell Marsh. Smith recently hit the joint second-fastest hundred in the history of the Big Bash League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-south-africa-vs-afghanistan-super-overs-rahmanullah-gurbaz-ahmedabad-2866592-2026-02-11",
      "headline": "SA vs AFG: Super Over(s) heartbreak leaves Afghanistan in danger of early exitT20 World Cup 2026: Afghanistan were pushed to the brink of an early exit from the T20 World Cup as they suffered defeat in a Super Over thriller against South Africa on Wednesday, February 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-ireland-live-cricket-score-colombo-updates-t20-world-cup-2866567-2026-02-11",
      "headline": "AUS vs IRE Highlights: Australia start campaign with 67-run winAustralia (AUS) vs Ireland (IRE), T20 World Cup Highlights from Colombo: Australia have beaten Ireland by 67 runs to make a winning start in the tournament. Adam Zampa and Nathan Ellis picked up four wickets apiece.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}