{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-opens-for-subscription-should-you-apply-or-skip-2767578-2025-08-07",
      "headline": "JSW Cement IPO opens for subscription. Should you apply or skip?Brokerages are mostly positive about JSW Cement IPO, though some advise caution due to the stretched valuation and inconsistent profitability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-volatile-trade-what-should-investors-do-donald-trump-additional-us-tariffs-2767553-2025-08-07",
      "headline": "Sensex tanks 500 points on 50% Trump's tariff blow: Should Investors worry?The Sensex slipped over 250 points at the open before paring some losses. The Nifty50 was also trading lower, reflecting broad-based caution and expectations of a volatile trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-150-points-nifty-above-24500-bajaj-auto-down-nearly-2-2767538-2025-08-07",
      "headline": "Sensex, Nifty fall as Trump announces additional tariffs; experts advise cautionWhile Sensex opened 250 points lower, it was trading just 131.05 points lower at 80,412.94 at 9:22 am, indicating that the session could see wild swings and high volatility. Nifty50 was also down 67.25 points to 24,506.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-russia-oil-import-anand-mahindra-tweet-india-strategic-advantage-msme-tax-free-ease-of-business-2767463-2025-08-07",
      "headline": "How India can turn Trump's tariffs into a strategic advantageThe new tariff of an additional 25%, announced on Wednesday, will come into effect 21 days from August 7. This sharp increase in duties comes at a time when trade talks between the two countries have reached a dead end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pms-economic-advisory-council-members-on-trumps-tariff-war-indias-growth-strategy-2767416-2025-08-06",
      "headline": "PM's Economic Advisory Council members on Trump's tariff war, India's growth strategyPrime Minister Narendra Modi's Economic Advisory Council members, Dr Sajjid Chinoy and Neelkanth Mishra, share their perspectives on the additional 25 per cent tariffs imposed by Donald Trump on Indian imports to the US over buying Russian oil and India's growth strategy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-hdfc-union-bank-and-others-offer-attractive-3-year-fd-rates-should-you-invest-now-2767346-2025-08-06",
      "headline": "ICICI, HDFC, Union Bank and others offer attractive 3-year FD rates. Should you invest now?FDs remain one of the safest investment options for those looking for steady returns without risk. However, with repo rates possibly heading downward in the future, locking in higher FD rates now could be a smart financial move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/highway-infrastructure-ipo-opening-date-august-7-gmp-trend-50-percent-listing-gain-details-review-2767294-2025-08-06",
      "headline": "Should you subscribe to this IPO with over 50% listing gains? Check detailsThe public issue is worth Rs 130 crore, made up of a fresh issue of 1.39 crore shares amounting to Rs 97.52 crore, and an offer for sale of 46 lakh shares worth Rs 32.48 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-25-percent-import-duty-imports-phdcci-report-impact-india-economy-minimal-trump-2767228-2025-08-06",
      "headline": "US tariffs won't shake India's economy, says reportThe PHD Chamber of Commerce and Industry (PHDCCI) white paper finds only 1.87% impact on exports and 0.19% on GDP from the new US trade barrier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-usd-64-billion-us-trade-at-risk-as-tensions-with-washington-escalate-after-trump-tariff-threat-2767209-2025-08-06",
      "headline": "India's $64 billion US trade at risk as tensions with Washington escalateIndia faces its most serious diplomatic crisis with the US in years after Trump imposed the highest tariffs among Asian peers on goods imported from India, even before any penalty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-rbi-rate-cut-it-stocks-us-tariff-concern-2767203-2025-08-06",
      "headline": "Sensex, Nifty end lower as US trade tension; RBI rate pause hit sentimentThe S&P BSE Sensex ended 166.26 points lower to end at 80,543.99, while the NSE Nifty50 lost 75.35 points to end at 24,574.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-radhika-gupta-on-why-large-cap-is-the-new-debt-2767168-2025-08-06",
      "headline": "Edelweiss' Radhika Gupta on why large cap is the new debtTraditionally, people invested in debt, like fixed deposits or bonds, when they wanted safety. They turned to equity, like stocks, when they were willing to take more risk for higher returns. But that line is getting blurry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-gen-z-is-trusting-instagram-influencers-over-financial-advisors-for-investment-advice-2767166-2025-08-06",
      "headline": "Is social media ruining investing for Gen Z?Social media is reshaping how young Indians invest. With financial influencer or 'finfluencer' on the rise, traditional financial literacy is being replaced by reels and short YouTube videos."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-backs-diljit-dosanjh-amid-sardaar-ji-3-release-row-2767552-2025-08-07",
      "headline": "Vaani Kapoor backs Diljit Dosanjh amid Sardaar Ji 3 release row: He's a global starVaani Kapoor has defended Diljit Dosanjh's decision to release 'Sardaar Ji 3' overseas amid calls for a ban, stating the film was shot before the Pahalgam terror attack and no laws were broken. Despite criticism, the film became the highest-grossing Punjabi movie of the year with an international-only release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/weapons-review-zach-cregger-horror-gets-weird-wild-and-wickedly-smart-2767545-2025-08-07",
      "headline": "Weapons review: Zach Cregger's horror gets weird, wild and wickedly smartRelease Date:Fri Aug 08, 2025'Weapons' review: Zach Cregger's latest film 'Weapons' is a bold and unsettling horror mystery that combines dread, gore and dark humour. Set to release on August 8, 2025, the film explores themes of trauma and paranoia through a gripping and unpredictable narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-sends-naatu-naatu-billboard-to-jr-ntr-in-playful-war-2-face-off-2767522-2025-08-07",
      "headline": "Hrithik Roshan sends Naatu Naatu billboard to Jr NTR in playful War 2 face-offThe playful banter between Hrithik Roshan and Jr NTR through themed billboard trucks has sparked excitement ahead of their much-awaited film 'War 2'. On Thursday, Roshan sent NTR a 'Naatu Naatu' billboard. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-pickup-review-eddie-murphy-versatility-overshadowed-by-soulless-storytelling-2767493-2025-08-07",
      "headline": "The Pickup review: Poor American version of Dhoom 3 with Eddie Murphy's brillianceRelease Date:Wed Aug 06, 2025The Pickup review: 'The Pickup' has actor Eddie Murphy in the lead role. Despite a talented cast, the movie lacks emotional depth and soulful narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-calls-out-lip-syncing-in-music-industry-says-cant-get-away-with-it-2767525-2025-08-07",
      "headline": "Ed Sheeran calls out lip-syncing in music industry, says can't get away with itEd Sheeran addressed the common yet seldom admitted practice of lip-syncing in the music industry. During an interview, he emphasised his commitment to genuine live performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/su-from-so-how-raj-b-shetty-low-budget-kannada-film-gained-nationwide-attention-2767316-2025-08-07",
      "headline": "Su From So: How a low-budget Kannada film gained nationwide attention'Su From So' is a Kannada comedy film written and directed by JP Thuminad. The film released in theatres on July 25, and soon spread across the nation like wildfire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-midair-flight-with-daughter-aishwarya-obliges-fans-requests-2767519-2025-08-07",
      "headline": "Rajinikanth obliges man's request, gets up to greet fans inside aircraft. WatchSuperstar Rajinikanth flew economy with his daughter, Aishwarya, on Wednesday. A video from inside the aircraft has emerged where Thalaivar was seen greeting his fans and waving at them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-new-guest-stars-release-dates-and-episode-titles-glbs-2767492-2025-08-07",
      "headline": "Wednesday Season 2: New guest stars, release dates and episode titlesWednesday Season 2 returns with more mystery, humour, and gothic drama. Streaming on Netflix in two parts, it features new faces, guest stars, and supernatural twists.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/who-was-jane-etta-pitt-brad-pitts-mother-dies-at-84-glbs-2767468-2025-08-07",
      "headline": "Jane Etta Pitt, Brad Pitt's mother, dies at 84Brad Pitt's mother, Jane Etta Pitt, died at 84. A loving mother and school counsellor, she was remembered warmly by her family in heartfelt tributes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-dwarf-role-criticised-lilliput-not-even-dirt-on-kamal-haasan-feet-appu-raja-2767387-2025-08-06",
      "headline": "Lilliput compares SRK's acting in Zero to Kamal Haasan: Not even the dust on his feetActor Lilliput criticised actor Shah Rukh Khan's portrayal of a dwarf in director Anand L Rai's 'Zero', comparing it to Kamal Haasan's performance in 'Appu Raja'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/war-2-song-rakesh-roshan-performs-aavan-jaavan-hookstep-days-after-surgery-hrithik-kiara-2767338-2025-08-06",
      "headline": "Rakesh Roshan surprises Hrithik with Aavan Jaavan hookstep days after surgeryFillmmaker Rakesh Roshan performed the 'Aavan Jaavan' hookstep from Ayan Mukerji's 'War 2'. His actor son Hrithik Roshan praised the veteran's dancing skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-moved-by-army-learning-korean-shares-why-he-avoids-hand-contact-2767365-2025-08-06",
      "headline": "BTS Jin moved by ARMY learning Korean, shares why he avoids hand contact at showsCurrently on his 'Run Seokjin Ep Tour', Jin is nearing the conclusion of the tour, with the final concert scheduled to take place on August 10 in Amsterdam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-trailer-anushka-shetty-and-krish-returns-in-a-gritty-mountain-saga-2767348-2025-08-06",
      "headline": "Ghaati trailer : Anushka Shetty roars jn gritty saga of revenge ans resistanceAfter multiple delays, the trailer of 'Ghaati' finally sets the stage for Anushka Shetty's return in a rugged, survival drama. Directed by Krish Jagarlamudi, the film is slated for a September 5 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-season-2-announcement-kajol-laughs-off-comeback-comments-release-date-jiohotstar-2767311-2025-08-06",
      "headline": "Kajol laughs off comeback comments in The Trial season 2 announcement videoThe second season of 'The Trial' starring Kajol was announced on Wednesday. In a promo, the actor humorously addressed the notion of her 'comeback'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-allahbadia-denies-celebrities-boycott-claims-latent-controversy-beerbiceps-2767279-2025-08-06",
      "headline": "Ranveer Allahbadia says stars boycotting his podcast were never invited on showYouTuber Ranveer Allahbadia slammed celebrities for claiming that they refused to come to his show after the 'India's Got Latent' controversy. He stated that those making such statements weren't even invited.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-to-hrithik-roshan-bollywood-slams-perfume-ad-for-promoting-rape-culture-1958860-2022-06-06",
      "headline": "Bollywood slams perfume ad for promoting rape cultureTwo advertisements for a perfume brand recently came under the scanner for propagating rape culture. Several celebs have now bashed the campaign on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anne-hathaway-films-love-scenes-for-devil-wears-prada-2-is-andy-finally-in-love-2767305-2025-08-06",
      "headline": "Anne Hathaway films love scenes for Devil Wears Prada 2. Is Andy finally in love?New photographs from the set of 'The Devil Wears Prada 2' have confirmed the actor portraying the new love interest of Anne Hathaway's character is Andy Sachs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-5-conrad-fischer-2767197-2025-08-06",
      "headline": "The Summer I Turned Pretty Ep 5 confirms what we knew all along: Conrad is the one'The Summer I Turned Pretty' Season 3, Episode 5, dives into Conrad's POV - the heartbreak, longing, and proof that Belly's definitely choosing the wrong brother. Here's why it hurts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-begins-kbc-17-shooting-shares-post-2767317-2025-08-06",
      "headline": "New opportunity, challenges: Amitabh Bachchan begins KBC 17 shootingAmitabh Bachchan has begun 'Kaun Banega Crorepati 17' shooting. The legendary actor shared a post and announced the new update. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-justice-yashwant-varma-plea-challenging-in-house-cash-row-probe-report-2767573-2025-08-07",
      "headline": "No relief for Justice Varma as Supreme Court dismisses plea in cash rowJustice Yashwant Varma had challenged the in-house inquiry report that recommended his removal after a large cash stash was found in his residence earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ready-to-pay-heavy-price-shielding-farmers-pm-modi-us-india-trade-deal-agriculture-dairy-deadlock-trump-tariffs-russian-oil-2767558-2025-08-07",
      "headline": "Ready to pay heavy price...: PM's stern message amid Trump tariff barragePrime Minister Narendra Modi's remarks were seen as a direct response to US President Donald Trump, who slapped a 50 per cent tariff on India for its continued purchases of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-warns-more-secondary-sanctions-india-russian-oil-imports-glbs-2767485-2025-08-07",
      "headline": "Trump warns of 'secondary sanctions' after slapping 50% tariff on IndiaDonald Trump imposed an additional 25% tariff on Indian imports, raising total duties to 50%, and warned of more 'secondary sanctions' over New Delhi's Russian oil purchases. India called the move 'unfair' and vowed to defend its interests."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gurugram-man-masturbates-in-front-of-model-rajiv-chowk-viral-video-2767528-2025-08-07",
      "headline": "Kept staring, masturbated near me: Model narrates harrowing ordeal in GurugramThe model said she had come to Gurugram from Jaipur and was waiting for a cab at Rajiv Chowk, a key and busy intersection, when the incident occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-pakistan-military-integration-intelligence-gathering-centaic-pak-air-force-concern-india-explained-2763996-2025-08-07",
      "headline": "China-Pak military integration: What is CENTAIC and should India be concerned?CENTAIC, a China-backed AI and computing centre in Pakistan, aims to transform the Pakistan Air Force (PAF) into a network-centric force integrated with China's military systems. Congress MP Rahul Gandhi mentioned CENTAIC in his Op Sindoor speech. Here's more about CENTAIC and if it should be a concern for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-united-states-second-visit-two-months-2767506-2025-08-07",
      "headline": "Pak army chief Asim Munir to visit US again, his second trip in 2 monthsThe Pakistani Army chief will attend the farewell of US Central Command Commander General Michael Kurilla, who had called Pakistan a 'phenomenal partner' in counter-terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-workload-how-tired-pacers-2767557-2025-08-07",
      "headline": "How tired is Mohammed Siraj?Mohammed Siraj's tireless bowling across formats has made him India's most dependable pacer, but his staggering workload raises red flags about long-term sustainability. Is India over-relying on Siraj at the cost of his fitness?\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-150-points-nifty-above-24500-bajaj-auto-down-nearly-2-2767538-2025-08-07",
      "headline": "Sensex, Nifty fall as Trump announces additional tariffs; experts advise cautionWhile Sensex opened 250 points lower, it was trading just 131.05 points lower at 80,412.94 at 9:22 am, indicating that the session could see wild swings and high volatility. Nifty50 was also down 67.25 points to 24,506.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-always-on-lifestyle-is-damaging-our-heart-health-cardiac-surgeon-dr-shriram-nene-2767323-2025-08-07",
      "headline": "Always on lifestyle is damaging our hearts: Dr Shriram NeneThere's a growing heart disease crisis in India and inactive habits and digital overload are mostly to blame. Renowned cardiac surgeon Dr Shriram Nene warns how young professionals are especially vulnerable to the dangers of the \"always on\" culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarkashi-to-dharali-road-blocked-due-to-water-surge-landslide-bridge-collapses-at-gangwani-2767488-2025-08-07",
      "headline": "Bridge collapse snaps Uttarkashi-Dharali route, rescue teams, relief reach by airIndia Today reached the nearest accessible point at Gangwani for an exclusive ground report, capturing the scale of destruction up close. The area around Ground Zero bears the deep footprints of the calamity — debris, broken concrete and mangled supports are all that remain of the bridge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/meetings-with-stalin-show-sidelined-panneerselvam-aint-bowing-out-his-game-plan-2767034-2025-08-06",
      "headline": "Meetings with Stalin show sidelined Panneerselvam ain't bowing out: His game planA potential third front with Vijay's TVK and Anbumani Ramadoss's PMK could help OPS mount a fightback and mar the BJP-AIADMK's prospects in the Tamil Nadu polls in 2026"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dharavi-revamp-can-gautam-adani-transform-asias-largest-slum-2767186-2025-08-06",
      "headline": "Dharavi revamp: Can Gautam Adani transform Asia's largest slum?How the Adani Group's Rs 2.5 lakh crore redevelopment and rehabilitation plan promises to play out for Dharavi's 1.2 million residents\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariffs-spark-worst-crisis-in-us-india-ties-says-michael-kugelman-glbs-2767500-2025-08-07",
      "headline": "Trump targeting India for not letting him take ceasefire credit? What analyst saidThe White House announcement marks an escalation in tensions, especially as India has remained firm on continuing energy imports from Moscow despite US pressure. The Trump administration has increasingly tied economic penalties to foreign policy grievances -- and India appears to be next in line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/united-airlines-flights-grounded-across-us-due-to-system-outage-2767508-2025-08-07",
      "headline": "All flights of US-based United Airlines grounded, thousands affectedUnited Airlines flights: Passengers took to social media to vent their frustrations as operations came to a standstill in Chicago, Denver, Newark, Houston and San Francisco."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-ms-dhoni-chennai-super-kings-bond-always-be-together-2767535-2025-08-07",
      "headline": "Dhoni reiterates love for CSK amidst retirement buzz: Will always be togetherAmid swirling retirement rumours, MS Dhoni reaffirmed his unbreakable bond with Chennai Super Kings at a Chennai event, promising to support the franchise beyond his playing days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/su-from-so-how-raj-b-shetty-low-budget-kannada-film-gained-nationwide-attention-2767316-2025-08-07",
      "headline": "Su From So: How a low-budget Kannada film gained nationwide attention'Su From So' is a Kannada comedy film written and directed by JP Thuminad. The film released in theatres on July 25, and soon spread across the nation like wildfire. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/six-year-old-indian-origin-girl-brutally-assaulted-racist-attack-ireland-go-back-to-india-immigration-2767324-2025-08-06",
      "headline": "Go back to India: 6‑year‑old Indian‑origin girl hit in private parts in IrelandA six‑year‑old Indian‑origin girl in Waterford, Ireland, was assaulted by a group of boys who punched her, hit her private parts with a bicycle, and hurled racist abuse, telling her to \"go back to India\". Her mother, a nurse, who recently became an Irish citizen, said the child is now terrified to play outside and the family feels unsafe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/will-iphones-get-pricier-trump-doubles-india-goods-tariff-to-50-per-cent-but-spares-apple-2767540-2025-08-07",
      "headline": "Will iPhones get pricier? Trump's 50 per cent India tariff triggers tech trade fearsUS President Donald Trump has yet again imposed a 25 per cent goods tariff on India. But why is Apple spared? Let's find out. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-backs-diljit-dosanjh-amid-sardaar-ji-3-release-row-2767552-2025-08-07",
      "headline": "Vaani Kapoor backs Diljit Dosanjh amid Sardaar Ji 3 release row: He's a global starVaani Kapoor has defended Diljit Dosanjh's decision to release 'Sardaar Ji 3' overseas amid calls for a ban, stating the film was shot before the Pahalgam terror attack and no laws were broken. Despite criticism, the film became the highest-grossing Punjabi movie of the year with an international-only release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/lifafas-laddoos-and-love-a-nostalgic-walk-through-rakhi-celebrations-2767559-2025-08-07",
      "headline": "Lifafas, laddoos and love: A nostalgic walk through rakhi celebrationsRakhi is more than just a thread; it's a symbol of memories, traditions, and emotions. This nostalgic piece reflects how we celebrated Raksha Bandhan in the '90s and how it still continues in 2025 in new ways, with the same love.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-chief-minister-mamata-banerjee-criticises-election-commission-over-voter-list-suspensions-2767464-2025-08-07",
      "headline": "BJP's bonded labourers: Mamata Banerjee lashes out after poll body crackdownMamata Banerjee accused the BJP of using the voter list revision to manipulate electoral outcomes. \"In the name of the voter list, the BJP wants to form a party list. Not a single name should be removed. Forget the party or political party, you must protect your own identity,\" the West Bengal Chief Minister said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/are-the-most-stable-relationships-the-ones-that-start-as-friendships-2766593-2025-08-07",
      "headline": "Can turning your best friend into your bae actually work?Friends-to-lover is a common trope that we see on screen. Turns out experts consider it a green flag to build a healthy relationship too! "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-china-could-face-india-style-tariffs-over-russian-oil-trade-glbs-2767486-2025-08-07",
      "headline": "Trump says China could face India-style tariffs over Russian oil tradeUS President Donald Trump said he may impose additional tariffs on China, similar to India's, over Russian oil imports. He also hinted at more sanctions targeting Russia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-touches-elderly-fan-feet-kisses-her-hand-2767579-2025-08-07",
      "headline": "Ranveer Singh touches elderly fan's feet, kisses her hand, video goes viralRanveer Singh won hearts with a sweet gesture as he touched an elderly fan's feet and kissed her hand outside a Mumbai studio. The video was widely shared on multiple platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-backs-diljit-dosanjh-amid-sardaar-ji-3-release-row-2767552-2025-08-07",
      "headline": "Vaani Kapoor backs Diljit Dosanjh amid Sardaar Ji 3 release row: He's a global starVaani Kapoor has defended Diljit Dosanjh's decision to release 'Sardaar Ji 3' overseas amid calls for a ban, stating the film was shot before the Pahalgam terror attack and no laws were broken. Despite criticism, the film became the highest-grossing Punjabi movie of the year with an international-only release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/weapons-review-zach-cregger-horror-gets-weird-wild-and-wickedly-smart-2767545-2025-08-07",
      "headline": "Weapons review: Zach Cregger's horror gets weird, wild and wickedly smartRelease Date:Fri Aug 08, 2025'Weapons' review: Zach Cregger's latest film 'Weapons' is a bold and unsettling horror mystery that combines dread, gore and dark humour. Set to release on August 8, 2025, the film explores themes of trauma and paranoia through a gripping and unpredictable narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-sends-naatu-naatu-billboard-to-jr-ntr-in-playful-war-2-face-off-2767522-2025-08-07",
      "headline": "Hrithik Roshan sends Naatu Naatu billboard to Jr NTR in playful War 2 face-offThe playful banter between Hrithik Roshan and Jr NTR through themed billboard trucks has sparked excitement ahead of their much-awaited film 'War 2'. On Thursday, Roshan sent NTR a 'Naatu Naatu' billboard. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gary-kirsten-praises-gautam-gambhir-oval-test-win-2767562-2025-08-07",
      "headline": "Delighted for what Gautam Gambhir has achieved with Test team in England: Gary KirstenFormer South Africa cricketer and India head coach Gary Kirsten praised Gautam Gambhir after India managed to draw the five-match Test series 2-2 against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-workload-how-tired-pacers-2767557-2025-08-07",
      "headline": "How tired is Mohammed Siraj?Mohammed Siraj's tireless bowling across formats has made him India's most dependable pacer, but his staggering workload raises red flags about long-term sustainability. Is India over-relying on Siraj at the cost of his fitness?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-ms-dhoni-chennai-super-kings-bond-always-be-together-2767535-2025-08-07",
      "headline": "Dhoni reiterates love for CSK amidst retirement buzz: Will always be togetherAmid swirling retirement rumours, MS Dhoni reaffirmed his unbreakable bond with Chennai Super Kings at a Chennai event, promising to support the franchise beyond his playing days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-2nd-test-tom-latham-ruled-out-will-orourke-2767521-2025-08-07",
      "headline": "ZIM vs NZ: Latham ruled out for 2nd Test with Santer to continue as skipperNew Zealand will miss Tom Latham again in the second Test against Zimbabwe, while fresh injuries to Will O'Rourke and Nathan Smith force key changes as Mitchell Santner leads the side in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-debabrata-das-prabir-chakraborty-financial-misconduct-2767509-2025-08-07",
      "headline": "Bengal cricket board issues showcase to top official over financial misconductBengal cricket has been rocked by financial misconduct allegations against CAB officials Debabrata Das and Prabir Chakraborty, as the Apex Council takes serious action to ensure accountability and restore trust in the cricketing body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-prize-money-record-2767462-2025-08-06",
      "headline": "US Open announces record 90 million dollar prize money for 2025 editionFor its 2025 edition, the US Open has announced a historic 90 million dollars prize pool—marking the highest ever in tennis and a 20 percent jump from the 75 million dollars distributed in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-muller-joins-vancouver-whitecaps-mls-title-chances-2767457-2025-08-06",
      "headline": "Thomas Muller joins MLS side Vancouver Whitecaps after Bayern Munich exitFormer Bayern Munich and Germany forward Thomas Muller has signed with Major League Soccer side Vancouver Whitecaps, bringing an end to one of the most iconic one-club careers in football history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/annu-rani-wins-javelin-gold-with-season-best-6259m-throw-in-poland-2767447-2025-08-06",
      "headline": "Annu Rani wins javelin gold with season-best 62.59m throw in PolandAnnu Rani registered her first 60m-plus javelin throw in over a year to win gold in Poland. This strong performance raises hopes of her qualification to the World Championships through world rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africas-ryan-rickelton-hoping-to-seal-opening-slot-for-t20-world-cup-2026-2767437-2025-08-06",
      "headline": "South Africa's Ryan Rickelton hoping to seal opening slot for T20 World Cup 2026South Africa's Ryan Rickelton is hoping to make his mark with the bat in the upcoming three-match T20I series against Australia, with a view to securing a place in the squad for next year's ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-navjot-sidhu-slams-gautam-gambhir-critics-series-draw-2-2-n-england-2767409-2025-08-06",
      "headline": "Will you stand up and greet Gambhir now? Sidhu slams India coach's criticsEngland vs India: Navjot Singh Sidhu has offered strong backing to national head coach Gautam Gambhir after India's hard-fought 2-2 draw in the five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-odi-series-live-streaming-squads-schedule-2767386-2025-08-06",
      "headline": "West Indies vs Pakistan ODI series Live Streaming: Squads, all you need to knowWI vs PAK ODI series: Shai Hope's West Indies and Mohammad Rizwan's Pakistan will be up against each other in a three-match ODI series from Friday, August 8 onwards at the Brian Lara Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-muller-joins-vancouver-whitecaps-mls-title-chances-2767457-2025-08-06",
      "headline": "Thomas Muller joins MLS side Vancouver Whitecaps after Bayern Munich exitFormer Bayern Munich and Germany forward Thomas Muller has signed with Major League Soccer side Vancouver Whitecaps, bringing an end to one of the most iconic one-club careers in football history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/annu-rani-wins-javelin-gold-with-season-best-6259m-throw-in-poland-2767447-2025-08-06",
      "headline": "Annu Rani wins javelin gold with season-best 62.59m throw in PolandAnnu Rani registered her first 60m-plus javelin throw in over a year to win gold in Poland. This strong performance raises hopes of her qualification to the World Championships through world rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africas-ryan-rickelton-hoping-to-seal-opening-slot-for-t20-world-cup-2026-2767437-2025-08-06",
      "headline": "South Africa's Ryan Rickelton hoping to seal opening slot for T20 World Cup 2026South Africa's Ryan Rickelton is hoping to make his mark with the bat in the upcoming three-match T20I series against Australia, with a view to securing a place in the squad for next year's ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-navjot-sidhu-slams-gautam-gambhir-critics-series-draw-2-2-n-england-2767409-2025-08-06",
      "headline": "Will you stand up and greet Gambhir now? Sidhu slams India coach's criticsEngland vs India: Navjot Singh Sidhu has offered strong backing to national head coach Gautam Gambhir after India's hard-fought 2-2 draw in the five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-odi-series-live-streaming-squads-schedule-2767386-2025-08-06",
      "headline": "West Indies vs Pakistan ODI series Live Streaming: Squads, all you need to knowWI vs PAK ODI series: Shai Hope's West Indies and Mohammad Rizwan's Pakistan will be up against each other in a three-match ODI series from Friday, August 8 onwards at the Brian Lara Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-odi-squad-pakistan-series-romario-shepherd-return-alzarri-joseph-rest-2767385-2025-08-06",
      "headline": "Romario returns, Alzarri rested as West Indies name squad for Pakistan ODIsRomario Shepherd has been recalled to the West Indies squad for the upcoming three-match ODI series against Pakistan. Fast bowler Alzarri Joseph, who featured in the recent Test series against Australia, has been rested as part of workload management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/am-ghazanfar-afghanistan-squad-asia-cup-2767362-2025-08-06",
      "headline": "Afghanistan name preliminary squad for Asia Cup, Ghazanfar returnsYoung spinner AM Ghazanfar has returned as Afghanistan named a 22-member preliminary squad for the 2025 Asia Cup and the tri-series, involving Pakistan and hosts UAE. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chennaiyin-fc-suspend-club-operations-due-to-uncertainty-over-isl-2767354-2025-08-06",
      "headline": "Chennaiyin FC suspend club operations due to uncertainty over ISLChennaiyin FC, two-time champions of the Indian Super League (ISL), have announced the suspension of their first-team operations amid increasing uncertainty surrounding the league's future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-ministry-amends-rti-clause-national-sports-governance-bill-relief-bcci-2767343-2025-08-06",
      "headline": "Relief for BCCI: Only bodies taking govt funds to come under RTI in new billThe Sports Ministry has amended the RTI clause in the National Sports Governance Bill to apply only to bodies receiving government funds. This move provides relief to the BCCI and aims to improve accountability and dispute resolution in Indian sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/elina-svitolina-montreal-open-hateful-messages-mothers-2767331-2025-08-06",
      "headline": "Your moms would be disgusted: Elina Svitolina slams hateful textsMontreal Open 2025: Elina Svitolina called out hateful messages from online bettors after she lost in straight sets to four-time Grand Slam champion Naomi Osaka in the quarterfinals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-moeen-ali-mohammed-siraj-match-winner-2767300-2025-08-06",
      "headline": "Mohammed Siraj has matured into a genuine match-winner for India: Moeen AliFormer all-rounder Moeen Ali has lavished praise on Mohammed Siraj following the fast bowler's heroic performance in India's thrilling six-run victory over England in the final Test at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-impact-sachin-tendulkar-2767290-2025-08-06",
      "headline": "Sachin Tendulkar sends message to Jasprit Bumrah trolls after England Tests showIndia vs England: Sachin Tendulkar dismissed claims questioning Jasprit Bumrah's match-winning ability, stating that India's Test victories in England without their pace spearhead were merely coincidental. Bumrah featured in three Tests and picked up 14 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/montreal-open-clara-tauson-madison-keys-grandfather-2767285-2025-08-06",
      "headline": "In tears, Clara Tauson dedicates shock win in Montreal to late grandfatherMontreal Open 2025: Clara Tauson broke down after beating reigning Australian Open champion Madison Keys in straight sets, dedicating the win to her late grandfather. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/elina-svitolina-montreal-open-hateful-messages-mothers-2767331-2025-08-06",
      "headline": "Your moms would be disgusted: Elina Svitolina slams hateful textsMontreal Open 2025: Elina Svitolina called out hateful messages from online bettors after she lost in straight sets to four-time Grand Slam champion Naomi Osaka in the quarterfinals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-moeen-ali-mohammed-siraj-match-winner-2767300-2025-08-06",
      "headline": "Mohammed Siraj has matured into a genuine match-winner for India: Moeen AliFormer all-rounder Moeen Ali has lavished praise on Mohammed Siraj following the fast bowler's heroic performance in India's thrilling six-run victory over England in the final Test at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-impact-sachin-tendulkar-2767290-2025-08-06",
      "headline": "Sachin Tendulkar sends message to Jasprit Bumrah trolls after England Tests showIndia vs England: Sachin Tendulkar dismissed claims questioning Jasprit Bumrah's match-winning ability, stating that India's Test victories in England without their pace spearhead were merely coincidental. Bumrah featured in three Tests and picked up 14 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/montreal-open-clara-tauson-madison-keys-grandfather-2767285-2025-08-06",
      "headline": "In tears, Clara Tauson dedicates shock win in Montreal to late grandfatherMontreal Open 2025: Clara Tauson broke down after beating reigning Australian Open champion Madison Keys in straight sets, dedicating the win to her late grandfather. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-salary-hike-central-contract-2767241-2025-08-06",
      "headline": "Pakistan Women rewarded with massive salary hike in central contractThe Pakistan Cricket Board has given a 50 per cent salary raise to the 20 women's cricketers in the central contracts for the 2025-26 season. Left-arm spinner Sadia Iqbal has been promoted to Category A. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-head-coach-dinesh-karthik-2767237-2025-08-06",
      "headline": "Should Gautam Gambhir stay on as Test coach? Ex-India wicketkeeper weighs in=India vs England: Former wicketkeeper Dinesh karthik said Gautam Gambhir should be proud of the heroic draw in England, but urged the head coach to prioritise bowling firepower over batting depth in Test cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-scripts-history-becomes-1st-bowler-to-complete-650-wickets-2767239-2025-08-06",
      "headline": "Rashid Khan scripts history, becomes 1st bowler to complete 650 wickets in T20sAfghanistan wrist spinner Rashid Khan became the first bowler to complete 650 wickets in T20 cricket during the opening game of the The Hundred 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-ravindra-jadeja-playing-xi-2767227-2025-08-06",
      "headline": "No Gill, Jadeja in Stuart Broad's combined XI: Pacer clarifiesEngland legend Stuart Broad has got everyone talking with his chosen combined XI for the five match Test series, leaving out India's top performers Shubman Gill and Ravindra Jadeja after an exciting series that ended 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-icc-player-of-the-month-nomination-mulder-stokes-2767198-2025-08-06",
      "headline": "Shubman Gill nominated for ICC's Player of the Month award after England heroicsIndia captain Shubman Gill has been nominated for the ICC Men's Player of the Month award for July following his stellar performances in the Anderson-Tendulkar Trophy, which ended in a dramatic 2-2 draw between India and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lee-fortis-oval-pitch-india-vs-england-mohammed-siraj-2767188-2025-08-06",
      "headline": "How Oval curator Lee Fortis turned hero from villain in five daysJust days after a heated exchange with India coach Gautam Gambhir saw him painted as a villain, Oval curator Lee Fortis was back in the spotlight — this time clinking glasses with his ground staff after a Test match for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-sachin-tendulkar-england-vs-india-2767182-2025-08-06",
      "headline": "Shubman looked composed against the most attacking Test team: TendulkarENG vs IND: The legendary Sachin Tendulkar heaped praise on Shubman Gill after India won the Oval Test by six runs to draw the five-match Test series 2-2 against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-record-series-aakash-chopra-virat-kohli-2767169-2025-08-06",
      "headline": "Shubman Gill leaves behind Kohli comparisons: Aakash Chopra hails star batterAakash Chopra heaped praise on Shubman Gill for his incredible run during the England tour and also said that the Indian captain left behind Virat Kohli comparisons with his performances at No.4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-grand-welcome-in-hyderabad-felicitation-planned-by-hca-2767137-2025-08-06",
      "headline": "Siraj gets rousing welcome in Hyderabad; grand felicitation planned for Oval heroIndia fast bowler Mohammed Siraj was given a rousing reception upon his arrival back in his hometown Hyderabad after a match-winning performance in the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-benjamin-sesko-transfer-newcastle-snub-2767125-2025-08-06",
      "headline": "Sesko picks Manchester United as Newcastle United miss out again: ReportRB Leipzig striker Benjamin Sesko is set to join Manchester United after snubbing Newcastle United in the transfer battle, according to the latest media reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-breaks-into-top-5-icc-test-batting-rankings-shubman-gill-2767117-2025-08-06",
      "headline": "Yashasvi Jaiswal breaks into top 5 of Test batting rankings, Gill out of top 10India batter Yashasvi Jaiswal broke into the top five of ICC Test batting rankings after his magnificent century in the fifth Test against England at the Oval. On the other hand, Shubman Gill moved out of top ten. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-mohammed-siraj-england-vs-india-series-2767109-2025-08-06",
      "headline": "Mohammed Siraj storms to career-best ICC Test ranking after Oval heroicsMohammed Siraj has risen to 15th in the ICC Test bowling rankings after a remarkable series in England. His performance signals a strong bowling future for India amid the absence of Jasprit Bumrah."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}