{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-hikes-mclr-for-short-term-loans-what-borrowers-need-to-know-2647075-2024-12-09",
      "headline": "HDFC Bank hikes MCLR for short-term loans. What borrowers need to knowHDFC Bank raises MCLR for short-term loans by 5 bps, affecting borrowing costs and EMIs, while long-term rates remain unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-fmcg-stocks-witness-decline-godrej-consumer-shares-down-9-percent-2647104-2024-12-09",
      "headline": "Sensex, Nifty end lower as FMCG stocks witness decline; Godrej Consumer down 9%The S&P BSE Sensex lost 200.66 points to close at 81,508.46, while the NSE Nifty50 was down 58.80 points to end at 24,619.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-announces-rs-75-lakh-crore-plan-to-boost-rajasthan-economy-karan-adani-2647053-2024-12-09",
      "headline": "Adani Group unveils Rs 7.5 lakh crore investment plan for RajasthanKaran Adani, Managing Director of Adani Ports & Special Economic Zone, made the announcement while addressing the Rising Rajasthan Global Investment Summit held in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dabur-marico-godrej-consumer-why-major-fmcg-stocks-are-tumbling-today-2647051-2024-12-09",
      "headline": "Dabur, Marico, Godrej Consumer: Why major FMCG stocks are tumbling todayGodrej Consumer Products shares declined as much as 11% in early trade and was the top loser among all major FMCG companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/banking-laws-amendment-bill-2024-four-nominees-in-bank-accounts-what-it-means-for-you-2647035-2024-12-09",
      "headline": "Banking Laws (Amendment) Bill 2024: What it means for youThe 2024 Banking Laws Amendment Bill allows multiple nominees, and grants banks more flexibility in auditor remuneration, fostering a more inclusive and efficient banking system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nisus-finance-services-ipo-allotment-check-status-latest-gmp-and-other-details-2647043-2024-12-09",
      "headline": "Nisus Finance Services IPO allotment: Check status, latest GMP and other details Investors can check the allotment status on the Bombay Stock Exchange (BSE) website or via the registrar, Skyline Financial Services. The company's shares are expected to list on the BSE SME platform on December 11, Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-ceat-shares-hit-rs-4000-brokerages-bet-big-on-camso-acquisition-2647017-2024-12-09",
      "headline": "Can CEAT shares hit Rs 4,000? Brokerages bet big on Camso acquisitionWith the stock rallying sharply by 12% today, market watchers are keenly assessing whether CEAT can sustain its momentum and inch closer to the coveted Rs 4,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nhpc-share-price-rose-5-in-early-trade-today-2647007-2024-12-09",
      "headline": "Explained: Why NHPC share price rose 5% in early trade todayNHPC's share price rose nearly 5% in early trade on Monday, touching a day's high of Rs 88.82 on the Bombay Stock Exchange. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/assigned-two-uans-here-how-you-can-rectify-it-by-epfo-guideline-2642403-2024-12-09",
      "headline": "Assigned two UANs? Here's how you can rectify it Resolve the issue of being assigned two UANs by following these simple steps to consolidate your EPF details into a single account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godrej-consumer-products-shares-falls-10-percent-today-brokerage-target-price-fmcg-stock-2646993-2024-12-09",
      "headline": "Godrej Consumer shares tank 10% today. Should you buy FMCG stock?Godrej Consumer recently flagged subdued demand in India's FMCG market, citing inflationary pressures and adverse weather conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-rishi-parti-man-who-bought-rs-190-crore-ultra-luxury-penthouse-in-gurugram-2646983-2024-12-09",
      "headline": "Rishi Parti: Man Behind Gurugram's Rs 190 Crore PenthouseA Rs 190 crore penthouse sale in Gurugram marks India's most expensive high-rise deal, cementing the city's elite property market status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ceat-share-price-rises-11-percent-all-time-high-should-you-buy-brokerage-views-2646960-2024-12-09",
      "headline": " CEAT share price rises 11% to hit record high. Should you buy? CEAT shares reached an all-time high of Rs 3,466.40 during the day before settling slightly lower. The stock has rallied 28% since the start of the year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-above-rs-1000-today-3-things-you-need-to-know-2646951-2024-12-09",
      "headline": "Paytm shares rise above Rs 1,000 today. 3 things you need to knowPaytm's share price crossed Rs 1,000 mark in early trade after rising 3% on the Bombay Stock Exchange. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-rise-3-percent-hit-52-week-high-rally-paypay-corporation-softbank-vision-fund-2-2646923-2024-12-09",
      "headline": "Paytm share price rose 3% to go past Rs 1,000. What's driving the rally?Paytm stocks: Paytm shares climbed 3.19% in early trade to reach Rs 1,007 on the Bombay Stock Exchange (BSE) in early trade. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/godrej-consumer-share-price-fall-9-percent-in-early-trade-today-reason-why-explained-growth-outlook-weak-2646914-2024-12-09",
      "headline": "Explained: Why Godrej Consumer shares fell 9% in early trade todayGodrej Consumer stock: Leading brokerage firms remain cautiously optimistic about Godrej Consumer Products Limited's long-term potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-open-flat-godrej-consumer-shares-fall-9-percent-paytm-2646911-2024-12-09",
      "headline": "Sensex, Nifty open flat; Godrej Consumer shares fall 9%The S&P BSE Sensex was up 37.49 points to 81,746.61, while the NSE Nifty50 gained 21.45 points to 24,699.2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-vishal-mega-mart-mobikwik-sai-life-sciences-rs-18340-crore-2646906-2024-12-09",
      "headline": "Upcoming IPOs: Vishal Mega Mart, Mobikwik among 5 to raise Rs 18,340 croreFrom retail giant Vishal Mega Mart to players in healthcare, fintech, and jewellery, this week's IPO lineup has something for everyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-ipo-launch-12-15-months-next-year-2026-first-quarter-e-commerce-report-2646887-2024-12-09",
      "headline": "Flipkart sets sights on IPO launch within 12-15 months: Report The Walmart-owned ecommerce giant has received internal approvals to move its domicile from Singapore to India, a key step toward going public. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-paytm-lt-ultratech-ceat-it-shares-adani-zomato-2646884-2024-12-09",
      "headline": "Stocks to watch today: Paytm, L&T, Ultratech, CEATIn today's session, several stocks, including Ultratech, Paytm, L&T, Biocon, Alembic Pharma, and CEAT, will be in focus due to recent news and developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurate-rising-rajasthan-global-investment-summit-jaipur-2646741-2024-12-08",
      "headline": "PM Modi to inaugurate 'Rising Rajasthan Global Investment Summit' tomorrowAiming to bolster investment opportunities in Rajasthan, Prime Minister Narendra Modi to unveil the Rising Rajasthan Global Investment Summit in Jaipur on Monday, December 9. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-to-move-no-confidence-motion-against-rajya-sabha-chairman-jagdeep-dhankhar-2647127-2024-12-09",
      "headline": "INDIA bloc to move no-confidence motion against Jagdeep Dhankhar in Rajya SabhaINDIA bloc MPs have frequently accused the Rajya Sabha Chairman of being biased towards the ruling members in the Upper House."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-foreign-secretary-vikram-misri-bangladesh-foreign-adviser-touhid-hossain-attack-on-minorities-2647109-2024-12-09",
      "headline": "Foreign Secretary meets Bangladesh counterpart, flags attacks on minoritiesThe Foreign Secretary's visit takes place against the backdrop of unrest in Bangladesh, including the arrest of Hindu monk Chinmoy Krishna Das. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syria-assad-al-bashar-impact-india-stand-on-kashmir-new-delhi-explained-2647012-2024-12-09",
      "headline": "Was Assad India's friend and what is Syria's Kashmir stand? 5-point explainerFrom Syria's support for India on the Kashmir issue to Delhi's backing of Syria's claim over the Israeli-occupied Golan Heights, Delhi and Damascus have been partners. The fall of the Bashar al-Assad regime could have far-reaching implications for India. Adding to this is the Iran-Turkey dynamics in Syria."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/aap-announces-2nd-candidates-list-for-assembly-polls-manish-sisodia-jangpura-avadh-ojha-patparganj-2647016-2024-12-09",
      "headline": "AAP's 2nd list out, Manish Sisodia moved to Jangpura, Avadh Ojha gets PatparganjManish Sisodia has represented the Patparganj seat, which is part of the East Delhi Lok Sabha constituency, since 2013. He was first elected to the seat in the December 2013 Delhi Assembly election, when he defeated his BJP rival Nakul Bhardwaj."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-do-smokers-have-the-urge-to-smoke-after-every-meal-2647013-2024-12-09",
      "headline": "Why do smokers have the urge to smoke after every meal?The urge to smoke after a meal is a complex interplay of biological, psychological, and social factors, often providing temporary satisfaction but with severe long-term health consequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-justice-shekhar-kumar-yadav-hindustan-country-will-run-as-per-majority-wishes-2646935-2024-12-09",
      "headline": "This is Hindustan, country will run as per majority's wishes: High Court judgeJustice Shekhar Kumar Yadav, a sitting judge of the Allahabad High Court, made the controversial remarks while speaking on the Uniform Civil Code (UCC) at a Vishwa Hindu Parishad (VHP) event in Pragyagraj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kiren-rijiju-sonia-gandhi-rahul-gandhi-george-soros-foundation-congress-bjp-2647005-2024-12-09",
      "headline": "Unite against anti-India forces: Kiren Rijiju on 'Sonia Gandhi-George Soros link'Union Minister Kiren Rijiju urged unity against forces working against India, referring to the BJP's allegations linking Sonia Gandhi to the George Soros Foundation, which allegedly has taken anti-India stances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-uber-cool-gukesh-sacrifices-queen-in-master-stroke-at-world-chess-championship-2646924-2024-12-09",
      "headline": "Watch: Uber cool Gukesh sacrifices Queen in master stroke at Chess ChampionshipGukesh's brilliant novelty in Game 11 forced Ding Liren into a shocking blunder, turning a likely draw into a decisive win. The Indian prodigy now stands on the brink of becoming the youngest World Chess Champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/yesmadam-stress-survey-fires-employees-who-said-yes-hr-email-viral-backlash-2647050-2024-12-09",
      "headline": "YesMadam fires employees after asking if they're stressed, HR's email goes viralAccording to a viral screenshot of an email sent by the HR manager of YesMadam, the company asked its employees if they were facing stress at work, and fired people who said yes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/james-webb-telescope-discovers-frozen-water-outside-solar-system-2647097-2024-12-09",
      "headline": "James Webb Telescope discovers frozen water outside Solar SystemThe research team detected a key signature of water ice at a wavelength of 3 microns, a telltale sign of frozen water coating dust grains within the disk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mohammed-siraj-kris-srikkanth-travis-head-send-off-pink-ball-test-adelaide-2647052-2024-12-09",
      "headline": "Hey Siraj, have you gone mad? Srikkanth blasts pacer for Travis Head send-offAustralia vs India: Former India captain Kris Srikkanth, in a strongly-worded comment, lashed out at Mohammed Siraj for giving an aggressive send-off to Travis Head. Head and Siraj are likely to be fined and reprimanded for the on-field bust-up in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-pushpa-2-allu-arjun-dissapoitnment-sukumar-rashmika-mandanna-box-office-2647021-2024-12-09",
      "headline": "How Fahadh Faasil's character in Pushpa 2 was a big let downFahadh Faasil's portrayal of antagonist Bhanwar Singh Shekhawat in Pushpa 2 has sparked mixed reactions. While the Allu Arjun-starrer dominates the box office with massive success, there's a strong sense of disappointment over the treatment of Fahadh's character in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-deploys-hypersonic-oreshnik-missile-for-first-time-key-capabilities-2647068-2024-12-09",
      "headline": "Russia deploys hypersonic Oreshnik missile for first time: Its key capabilitiesRussia's use of its new hypersonic Oreshnik missile in Ukraine marks a significant escalation, with President Putin warning NATO of potential strikes if Western nations continue supporting Kyiv."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-opposition-mps-pose-pm-gautam-adani-with-masks-rahul-gandhi-asks-questions-2646955-2024-12-09",
      "headline": "Describe your relationship: Rahul Gandhi to Congress MPs wearing PM-Adani masksSince the Winter Session began on November 20, the two Houses have witnessed constant washouts over the Opposition continuing to attack the Central government for avoiding a discussion on the Adani bribery case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-statement-contact-indians-syrian-crisis-advocate-peaceful-political-process-sovereignty-integrity-2647011-2024-12-09",
      "headline": "Need to work towards preserving unity, sovereignty: India on Syria crisisThe Ministry of External Affairs said that the Indian embassy in Damascus is in contact with the Indian community and called for a peaceful, inclusive power transfer while urging respect for Syria's unity and sovereignty.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/balenciaga-launches-zero-shoes-that-barely-cover-feet-internet-reacts-2646967-2024-12-09",
      "headline": "Balenciaga launches Zero shoes that barely cover feet. Don't miss the commentsA picture of Balenciaga's 'Zero' shoes went viral on social media after it was posted on Instagram by Adrian Marc Perrot Garin who works as a Sneakers Designer with the brand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/syria-bashar-al-assad-opposition-rebels-india-relations-damascus-2646921-2024-12-09",
      "headline": "Syria shift, Assad's fall and what it means for IndiaThe Bashar al-Assad regime has been toppled in Syria, paving the way for significant political changes for the Arab Republic and its relations with India and other nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rajouri-garden-restaurant-first-floor-massive-fire-engines-on-spot-2647081-2024-12-09",
      "headline": "Massive fire breaks out at restaurant in Delhi's Rajouri Garden, 10 engines on spotThe restaurant is located on the first floor of a building near the Rajouri Garden Metro Station. The fire started at 2.14 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cuet-ug-cuet-pg-to-undergo-major-changes-in-2025-2647088-2024-12-09",
      "headline": "CUET UG, PG to undergo major changes in 2025, new guidelines soonUGC Chairman M Jagadesh Kumar has announced that CUET UG and CUET PG is set to undergo a few major changes from 2025 onwards following an expert panel review. Revised guidelines are expected soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/meet-raven-this-bird-inspired-drone-can-walk-hop-and-jump-for-take-off-2647031-2024-12-09",
      "headline": "This bird-inspired drone can walk, hop and jump for take-offThe drone weighs just 0.62 kg and features custom avian-inspired legs that mimic the proportions and mechanics of bird limbs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-first-flight-lands-at-noidas-jewar-airport-receives-water-salute-2647047-2024-12-09",
      "headline": "Watch: First flight lands at Noida's Jewar airport, receives water salute The Noida International Airport in Jewar conducted its first trial run today. The inaugural flight received a water salute. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-men-walking-billboard-food-delivery-app-pic-internet-angry-2646928-2024-12-09",
      "headline": "Pic of men walking with billboard of food delivery app in Bengaluru angers InternetA photo of men carrying billboards to promote a food delivery app on a Bengaluru street has sparked outrage online.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/foreign-secretary-arrives-in-bangladesh-for-first-high-level-trip-after-hasinas-ouster-2647037-2024-12-09",
      "headline": "Foreign Secretary in Dhaka for 1st high-level meet since Sheikh Hasina's ousterForeign Secretary Vikram Misri's visit is the first high-level trip from India since Sheikh Hasina's ouster, and it also comes at a time of increasing strain in ties over attacks on Hindu minorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-abhyankkar-music-composer-for-suriya-rj-balaji-ar-rahman-replaces-2647133-2024-12-09",
      "headline": "Aasai Koodai composer Sai Abhyankkar to score music for Suriya-RJ Balaji filmKatchi Sera and Aasai Kooda composer Sai Abhyankkar has been roped in to score music for RJ Balaji's film with actor Suriya. Earlier, AR Rahman was roped in as the composer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-criticism-lavish-wedding-cost-2647122-2024-12-09",
      "headline": "Parineeti Chopra on criticism over lavish wedding: If I married an actor, people…Parineeti Chopra and Raghav Chadha dismissed rumours about their wedding expenses, attributing criticism to public perception and double standards. Parineeti called out the scrutiny of her finances post-marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-abhishek-bachchan-got-angry-after-comedian-joked-about-amitabh-bachchan-2647098-2024-12-09",
      "headline": "When Abhishek Bachchan walked out of a show after comedian's remark on Big BActor Abhishek Bachchan walked out of Riteish Deshmukh's show following a comedian's remark about his father, Amitabh Bachchan. The incident occurred during the recording of Case Toh Banta Hai, which also featured Varun Sharma and Kusha Kapila."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-aaliyah-kashyap-shane-gregoire-mehndi-shout-out-to-their-pets-2647111-2024-12-09",
      "headline": "Pics: Aaliyah Kashyap-Shane Gregoire's mehndiAnurag Kashyap's daughter Aaliyah is set to marry long-time partner, Shane Gregoire. Ahead of the wedding, their pictures from the mehndi ceremony have emerged online. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-david-wanrner-not-impressed-marnus-labuschagne-adelaide-test-2647110-2024-12-09",
      "headline": "AUS vs IND: Warner \"not convinced\" with Labuschagne despite Adelaide 64David Warner critiqued Marnus Labuschagne's inconsistent performances in the Border-Gavaskar Trophy, despite his half-century in Adelaide. The former opener praised Steve Smith and Usman Khawaja's resilience, setting high expectations for Labuschagne ahead of the crucial Gabba Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa-vs-sl-2nd-test-series-win-wtc-final-temba-bavuma-keshav-maharaj-2647092-2024-12-09",
      "headline": "Temba Bavuma inspires 2-0 sweep as South Africa close in on WTC finalSouth Africa vs Sri Lanka, 2nd Test: Keshav Maharaj spun a web around the Sri Lankan batters as South Africa successfully defended a 348-run target to win the 2nd Test and complete a 2-0 win. Temba Bavuma led from the front scoring a hundred and three fifties in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-updated-wtc-points-table-south-africa-vs-sri-lanka-india-final-chances-australia-2647082-2024-12-09",
      "headline": "WTC Points Table: South Africa go top with 2-0 win, Australia, India followWorld Test Championship Points Table: Temba Bavuma's South Africa climbed up to the top of the points table after their 2-0 cleansweep against Sri Lanka. Australia and India follow at 2 and 3 respectively.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-updated-scenario-south-africa-close-in-pressure-on-india-and-australia-2647080-2024-12-09",
      "headline": "WTC Final Updated Scenario: South Africa close in, pressure on India and AustraliaLet us have a look at the updated WTC final scenario after South Africa's thumping win vs South Africa. India currently stand at No. 3 position with a 63.33 percentage points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-3rd-test-australia-open-training-session-fans-brisbane-2647069-2024-12-09",
      "headline": "Australia announce open training session for fans in BrisbaneAUS vs IND: Australia are hosting yet another open training session ahead of the 3rd Test match in Brisbane. Australia have welcomed the fans to join their nets on December 12, 2 days ahead of the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mohammed-siraj-kris-srikkanth-travis-head-send-off-pink-ball-test-adelaide-2647052-2024-12-09",
      "headline": "Hey Siraj, have you gone mad? Srikkanth blasts pacer for Travis Head send-offAustralia vs India: Former India captain Kris Srikkanth, in a strongly-worded comment, lashed out at Mohammed Siraj for giving an aggressive send-off to Travis Head. Head and Siraj are likely to be fined and reprimanded for the on-field bust-up in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bhuvneshwar-kumars-good-times-catch-up-with-rcb-team-management-in-bengaluru-2647041-2024-12-09",
      "headline": "Bhuvneshwar Kumar's 'good times' catch-up with RCB team management in BengaluruBhuvneshwar Kumar met with the RCB team management, including Director of Cricket Mo Bobat. The pacer was bought by RCB for a whopping price of Rs 10.75 crore in IPL auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-sixes-bengal-syed-mushaq-ali-trophy-border-gavaskar-trophy-2647033-2024-12-09",
      "headline": "Watch: Shami smashes 17-ball 32 in Bengaluru amid Australia trip speculationSyed Mushtaq Ali Trophy: Fast bowler Mohammed Shami smashed 32 off just 17 balls for Bengal against Chandigarh on Monday in Bengaluru. A BCCI medical team is monitoring Shami's progress to take a call on his availability for the last three Tests of the Border-Gavasakar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-2nd-test-josh-hazlewood-siraj-vs-head-fight-2647024-2024-12-09",
      "headline": "Good to see aggression from passionate Siraj: Hazlewood on Adelaide rowAustralia pacer Josh Hazlewood said that there is nothing wrong in showing a little fire while playing Test cricket. Hazlewood extended his support to Mohammed Siraj, who had a heated argument with Travis Head in the Adelaide Test match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-travis-head-mohammed-siraj-icc-sanction-adelaide-fight-2646997-2024-12-09",
      "headline": "Siraj, Head likely to escape suspension after Adelaide bust-up: ReportIndia vs Australia, 2nd Test: Although not yet official, Australian media have reported that Mohammed Siraj and Travis Head are likely to be fined and severely reprimanded for their on-field spat during the pink-ball Test in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bhuvneshwar-kumars-good-times-catch-up-with-rcb-team-management-in-bengaluru-2647041-2024-12-09",
      "headline": "Bhuvneshwar Kumar's 'good times' catch-up with RCB team management in BengaluruBhuvneshwar Kumar met with the RCB team management, including Director of Cricket Mo Bobat. The pacer was bought by RCB for a whopping price of Rs 10.75 crore in IPL auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-sixes-bengal-syed-mushaq-ali-trophy-border-gavaskar-trophy-2647033-2024-12-09",
      "headline": "Watch: Shami smashes 17-ball 32 in Bengaluru amid Australia trip speculationSyed Mushtaq Ali Trophy: Fast bowler Mohammed Shami smashed 32 off just 17 balls for Bengal against Chandigarh on Monday in Bengaluru. A BCCI medical team is monitoring Shami's progress to take a call on his availability for the last three Tests of the Border-Gavasakar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-2nd-test-josh-hazlewood-siraj-vs-head-fight-2647024-2024-12-09",
      "headline": "Good to see aggression from passionate Siraj: Hazlewood on Adelaide rowAustralia pacer Josh Hazlewood said that there is nothing wrong in showing a little fire while playing Test cricket. Hazlewood extended his support to Mohammed Siraj, who had a heated argument with Travis Head in the Adelaide Test match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-travis-head-mohammed-siraj-icc-sanction-adelaide-fight-2646997-2024-12-09",
      "headline": "Siraj, Head likely to escape suspension after Adelaide bust-up: ReportIndia vs Australia, 2nd Test: Although not yet official, Australian media have reported that Mohammed Siraj and Travis Head are likely to be fined and severely reprimanded for their on-field spat during the pink-ball Test in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/dr-venkatesh-iyer-kkr-star-pursues-phd-in-finance-after-completing-mba-2646998-2024-12-09",
      "headline": "Dr. Venkatesh Iyer? KKR star pursues PhD in finance after completing MBAVenkatesh Iyer revealed that he has been pursuing a PhD in finance after completing his MBA. Venkatesh was sold to KKR for Rs 23.75 crore in the IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-josh-hazlewood-scott-boland-gabba-test-2646847-2024-12-09",
      "headline": "Should Australia bring in Josh Hazlewood for Gabba Test?AUS vs IND: Josh Hazlewood is expected to replace Scott Boland as Australia are most likely to make a change in their playing XI despite winning the Adelaide Test by 10 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-virat-kohli-sachin-tendulkar-sydney-adam-gilchrist-2646992-2024-12-09",
      "headline": "Virat Kohli should take a leaf out of Sachin Tendulkar's SCG knock: GilchristIND vs AUS: Virat Kohli should take a leaf out of Sachin Tendulkar's SCG book, said Adam Gilchrist. Gilchrist made his comment on the backdrop of Kohli continually getting dismissed by edging the ball behind the stumps.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/otd-in-2014-virat-kohli-took-charge-of-indias-test-captaincy-in-adelaide-2646961-2024-12-09",
      "headline": "OTD in 2014: Virat Kohli took charge of India's Test captaincy in AdelaideOn December 9, 2014, Virat Kohli took charge of India's Test captaincy vs Australia in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-uber-cool-gukesh-sacrifices-queen-in-master-stroke-at-world-chess-championship-2646924-2024-12-09",
      "headline": "Watch: Uber cool Gukesh sacrifices Queen in master stroke at Chess ChampionshipGukesh's brilliant novelty in Game 11 forced Ding Liren into a shocking blunder, turning a likely draw into a decisive win. The Indian prodigy now stands on the brink of becoming the youngest World Chess Champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-bangladesh-1st-odi-sherfane-rutherford-2646907-2024-12-09",
      "headline": "Sherfane Rutherford's maiden hundred helps Windies seal 1st ODI vs BangladeshWI vs BAN, 1st ODI: West Indies chased down the highest ever target at St Kitts to take a 1-0 lead in the 3-match series vs Bangladesh. Sherfane Rutherford scored a terrific hundred, his first in ODI cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-devon-conway-set-to-miss-3rd-test-due-to-birth-of-his-child-2646894-2024-12-09",
      "headline": "Devon Conway set to miss 3rd Test vs England due to birth of his child New Zealand's Devon Conway will miss the 3rd Test vs England due to the birth of his first child. England already lead the 3-match Test series 2–0 vs the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-2nd-test-sanjay-manjrekar-jasprit-bumrah-shami-siraj-2646893-2024-12-09",
      "headline": "India bowlers need to be more relentless vs Australia: Sanjay ManjrekarIND vs AUS: Former India cricketer Sanjay Manjrekar said that the bowlers needed to be more relentless against Australia in the Adelaide Test match. Manjrekar's comments came after India lost the 2nd Test by a margin of 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-uber-cool-gukesh-sacrifices-queen-in-master-stroke-at-world-chess-championship-2646924-2024-12-09",
      "headline": "Watch: Uber cool Gukesh sacrifices Queen in master stroke at Chess ChampionshipGukesh's brilliant novelty in Game 11 forced Ding Liren into a shocking blunder, turning a likely draw into a decisive win. The Indian prodigy now stands on the brink of becoming the youngest World Chess Champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-bangladesh-1st-odi-sherfane-rutherford-2646907-2024-12-09",
      "headline": "Sherfane Rutherford's maiden hundred helps Windies seal 1st ODI vs BangladeshWI vs BAN, 1st ODI: West Indies chased down the highest ever target at St Kitts to take a 1-0 lead in the 3-match series vs Bangladesh. Sherfane Rutherford scored a terrific hundred, his first in ODI cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-devon-conway-set-to-miss-3rd-test-due-to-birth-of-his-child-2646894-2024-12-09",
      "headline": "Devon Conway set to miss 3rd Test vs England due to birth of his child New Zealand's Devon Conway will miss the 3rd Test vs England due to the birth of his first child. England already lead the 3-match Test series 2–0 vs the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-2nd-test-sanjay-manjrekar-jasprit-bumrah-shami-siraj-2646893-2024-12-09",
      "headline": "India bowlers need to be more relentless vs Australia: Sanjay ManjrekarIND vs AUS: Former India cricketer Sanjay Manjrekar said that the bowlers needed to be more relentless against Australia in the Adelaide Test match. Manjrekar's comments came after India lost the 2nd Test by a margin of 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-bgt-rohit-sharma-do-not-need-to-panic-adelaide-loss-2646885-2024-12-09",
      "headline": "It's a marathon, not a sprint: India don't need to panic after 2nd Test lossThe Indian team may have faced a big loss in the pink-ball Test but there is still a lot left in the Border-Gavaskar Trophy to play for. With history backing them, India needs a couple of changes to make before the next match in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aakash-chopra-ind-vs-aus-2nd-test-bgt-rohit-sharma-captaincy-record-2646882-2024-12-09",
      "headline": "Aakash Chopra blames defensive Rohit Sharma for India's loss in AdelaideIND vs AUS: Former India cricketer Aakash Chopra has blamed Rohit Sharma for the team's loss in Adelaide Test match. India were hammered by Australia in the Border-Gavaskar Trophy as they won the pink ball Test by 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-nitish-reddy-srh-hardik-pandya-replacement-2646724-2024-12-09",
      "headline": "Have India found Pandya's replacement? Nitish Reddy shows spark in Australia   AUS vs IND: Nitish Kumar Reddy's fearless batting and maturity beyond his years mark him as India's next big hope. In just 2 Test matches, the 21-year-old has shown that he thrives under pressure and delivers when it matters the most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chelsea-vs-tottenham-hotspur-palmer-premier-league-penalty-record-2646853-2024-12-09",
      "headline": "Palmer breaks Premier League record in Chelsea's 4-3 win over SpursCole Palmer scored twice from the penalty spot as Chelsea staged a dramatic comeback, recovering from 2-0 down to defeat Tottenham Hotspur 4-3 in a thrilling London derby. Palmer has now scored the most penalties without missing in Premier League history.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}