{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-loan-emi-fall-sbi-cuts-lending-rates-lowers-interest-on-select-fd-2836668-2025-12-16",
      "headline": "Will your loan EMI fall? SBI cuts lending rates, lowers interest on select FDThe State Bank of India has announced reductions in both lending and select deposit rates, aiming to balance relief for borrowers with steady returns for most deposit holders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gifts-from-family-are-tax-free-but-who-exactly-qualifies-as-family-2836644-2025-12-16",
      "headline": "Gifts from family are tax-free. But who exactly qualifies as 'family'?Received money or property from a family member and assumed it is tax-free? Do you know whether the Income Tax Act actually treats that person as 'family'? Let's find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-gmp-today-rising-above-15-percent-check-subscription-allotment-listing-details-2836639-2025-12-16",
      "headline": "ICICI Prudential AMC IPO GMP today. Check allotment and listing detailsThe trend in the unofficial market has strengthened as the ICICI Prudential AMC IPO moved closer to closing, supported by improving subscription numbers across investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-is-young-india-really-investing-money-hint-its-not-just-stocks-or-gadgets-2836209-2025-12-16",
      "headline": "How is young India really investing money? Hint: It's not just stocks or gadgetsFrom digital assets to experiences, India's younger generation is investing in ways that reflect changing priorities and lifestyles. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-meesho-founder-vidit-aatrey-turns-billionaire-share-price-jump-52-week-high-bumper-ipo-listing-growth-outlook-2836578-2025-12-16",
      "headline": "Meesho founder Vidit Aatrey becomes billionaire as shares hit 52-week highVidit Aatrey, the co-founder of Meesho Ltd, has entered the billionaire club as the company's shares climbed sharply to hit a fresh 52-week high in today's trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-scrutiny-fake-donation-political-parties-itr-refund-delay-claim-tight-check-2836531-2025-12-16",
      "headline": "Income Tax Department flags fake donation claims, tightens checks on tax refundsSeveral taxpayers claimed refunds by showing fake donations to political parties and charitable institutions, often with the help of intermediaries. The Income Tax department has now warned that such practices are under close watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-arrear-date-salary-hike-pension-start-january-1-2026-latest-update-2836495-2025-12-16",
      "headline": "8th Pay Commission arrears to start from January 1, 2026? Here's latest updateIn November 2025, the government approved the terms of reference for the 8th Pay Commission and granted it 18 months to submit its report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-300-points-lower-nifty-below-26000-eternal-down-3-percent-2836484-2025-12-16",
      "headline": "Sensex opens 300 points lower, Nifty below 26,000; Eternal down 3%The S&P BSE Sensex lost 381.44 points to 84,831.92, while the NSE Nifty50 was down by 114.55 points to 25,912.75 as of 9:40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-last-day-latest-subscription-gmp-status-expected-profit-bid-or-skip-review-2836476-2025-12-16",
      "headline": "ICICI Prudential IPO closes today: Should you bid as GMP crosses 10% gain?ICICI Prudential AMC IPO opened for bidding on December 12, 2025, and will close today, December 16, 2025. Share allotment is expected to be finalised on December 17, while listing on BSE and NSE is scheduled for December 19, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wpi-inflation-stays-negative-in-november-despite-food-price-uptick-2836286-2025-12-15",
      "headline": "WPI inflation stays negative in November despite food price uptickGovernment data released on Monday showed Wholesale Price Index (WPI) inflation at (-) 0.32% in November, compared with (-) 1.21% in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-jump-19-in-november-trade-deficit-hits-5-month-low-2836273-2025-12-15",
      "headline": "India's exports jump 19% in November, trade deficit hits 5-month lowThe US remained India's largest export destination from April to November 2025, despite the imposition of a 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-rebound-to-end-marginally-lower-as-fii-outflow-trouble-markets-2836204-2025-12-15",
      "headline": "Sensex, Nifty rebound to end marginally lower as FII outflow troubles marketThe S&P BSE Sensex was down by 54.30 points to close at 85,213.36, while the NSE Nifty50 lost 19.65 points to end at 26,027.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-home-loan-rate-decrease-emis-rbi-repo-cut-check-new-rates-personal-finance-housing-demand-2836181-2025-12-15",
      "headline": "SBI reduces lending rates, EMIs likely to drop: Check new home loan ratesWith several major banks already passing on the benefit, SBI's move will directly help customers whose loans are linked to different lending benchmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-at-record-highs-should-investors-buy-now-or-wait-2836126-2025-12-15",
      "headline": "Gold and silver at record highs. Should investors buy now or wait?Gold and silver prices are trading near record highs after a powerful rally this year. With both metals delivering strong returns, many investors are now wondering whether it still makes sense to buy or wait for a correction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/december-15-advance-tax-deadline-is-here-who-must-pay-and-what-happens-if-you-dont-2836086-2025-12-15",
      "headline": "December 15 advance tax deadline is here: Who must pay and what happens if you don'tThe third advance tax instalment is due today, December 15. For many taxpayers, missing this deadline could mean mandatory interest and a larger payment at the time of filing returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claimed-tax-refunds-using-fake-donations-heres-what-income-tax-department-is-doing-2836054-2025-12-15",
      "headline": "Claimed tax refunds using fake donations? Here's what income tax department is doingIf you claimed tax benefits by showing donations that were never made, the Income Tax Department may already be watching. Authorities have launched a fresh drive to identify and correct such false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-law-4-day-work-week-yes-no-ministry-clarification-48-hours-working-overtime-wage-2836041-2025-12-15",
      "headline": "4-day work week under new labour codes? Here's what Labour Ministry clarifiedOn November 21, 2025, the government replaced 29 old labour laws with four new Labour Codes and can Indians really work only four days a week and still get paid for a full week?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hindustan-zinc-share-price-target-rs-660-coverage-brokerage-firm-jefferies-bullish-why-2835994-2025-12-15",
      "headline": "Hindustan Zinc shares may climb to Rs 660. Here's why Jefferies is bullishAccording to brokerage firm Jefferies, the Rs 660 target price suggests a potential upside of around 22%, including a dividend yield of about 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-lower-nifty-below-26000-ntpc-down-1-percent-2835962-2025-12-15",
      "headline": "Sensex opens 200 points lower, Nifty below 26,000; NTPC down 1%The S&P BSE Sensex was down by 394.84 points to 84,872.82, while the NSE Nifty50 lost 129.75 points to 25,917.20 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-gifting-relative-family-sebi-rule-save-tax-how-steps-money-ltcg-stock-market-profit-2835960-2025-12-15",
      "headline": "Want to save tax? Here's how gifting mutual funds can help you with itA lesser-known method is gaining attention, gifting mutual fund units to relatives to legally reduce, or in some cases completely avoid, tax on capital gains."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/45-trailer-shivarajkumar-upendra-raj-b-shetty-bring-life-and-death-philosophies-2836686-2025-12-16",
      "headline": "45 trailer: Shivarajkumar, Upendra, Raj B Shetty bring life and death philosophies The makers of the much-anticipated multi-starrer 45 have unveiled its official trailer, offering a haunting and introspective look at a story that explores life, morality and the weight of human choices beyond death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cinematic-saturday-evolution-of-villains-bollywood-srk-jawan-vijay-sethupathi-shakaal-kali-mogambo-khilji-javed-akhtar-2450720-2023-10-21",
      "headline": "Villains in vogue: Mogambo to Kali, how Bollywood antagonists mirror society Bollywood villains have evolved from simple, one-dimensional characters to complex, multi-layered figures. Writer Javed Akhtar discusses how socio-political changes have influenced Hindi film villains, reflecting societal attitudes. And yes, Shah Rukh Khan has played a big role in this evolution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-teaser-sunny-deol-rallies-his-men-with-a-war-cry-meant-to-reach-lahore-2836662-2025-12-16",
      "headline": "Border 2 teaser: Sunny Deol rallies his men with a war cry meant to reach Lahore Border 2 teaser unveils Sunny Deol, Varun Dhawan, Diljit Dosanjh and Ahan Shetty as war heroes in a stirring tribute to India's armed forces."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rob-reiner-wife-murder-son-arrested-trump-controversy-2836637-2025-12-16",
      "headline": "Explained: Rob Reiner's death and row over Donald Trump's inflammatory post Rob Reiner and his wife Michele were tragically stabbed to death at their Los Angeles home. The incident and President Donald Trump's politicising comments have ignited widespread outrage and debate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakul-preet-singh-slams-doctor-claiming-she-had-plastic-surgery-2836655-2025-12-16",
      "headline": "Misguiding people: Rakul Preet Singh slams doctor claiming she had plastic surgery Rakul Preet Singh slammed a man claiming to be a plastic surgeon for alleging she underwent cosmetic surgeries, calling the claims misleading and dangerous. The actor clarified that physical changes can also come from hard work and weight loss, urging people to beware of unverified \"doctors\" online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/grateful-to-tanya-mittal-amaal-mallik-asks-fans-to-stop-linking-them-after-bb19-2836647-2025-12-16",
      "headline": "Grateful to Tanya Mittal, Amaal Mallik asks fans to stop linking them after BB19 Amaal Mallik made a social media post clarifying his relationship with fellow Bigg Boss 19 contestant Tanya Mittal, urging fans to avoid reading too much into their on-screen interactions and to respect personal boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-honours-real-stars-in-sitaaron-ke-sitaare-documentary-trailer-out-2836604-2025-12-16",
      "headline": "Aamir Khan honours real stars in Sitaaron Ke Sitaare documentary. Trailer out Aamir Khan introduced the trailer for 'Sitaaron Ke Sitaare', a documentary detailing the lives of parents of specially-abled actors who featured in 'Sitaare Zameen Par'. The film highlights the parents' resilience against social taboos and celebrates them as the \"real stars.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-ruth-prabhu-dhurandhar-review-ranveer-singh-fan-calls-shapeshifter-2836609-2025-12-16",
      "headline": "Samantha, a forever Ranveer Singh fan, calls him shapeshifter after Dhurandhar Samantha Ruth Prabhu has joined the growing chorus of praise for Aditya Dhar's Dhurandhar. She has commended Ranveer Singh's performance and the film's ensemble cast as the spy thriller continues its strong box office run."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dangal-star-zaira-wasim-demands-apology-from-nitish-kumar-over-hijab-incident-2836605-2025-12-16",
      "headline": "Dangal star Zaira Wasim demands apology from Nitish Kumar over hijab incident A video of Bihar Chief Minister Nitish Kumar removing a hijab from a woman's face during a government function has sparked widespread controversy. Former actor Zaira Wasim condemned the incident, demanding an \"unconditional apology.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-slams-online-harassment-urges-stricter-laws-2836612-2025-12-16",
      "headline": "Put an end to it: Sonakshi Sinha slams online harassment, urges stricter laws Sonakshi Sinha called out the growing culture of online harassment in the film industry, saying open attacks on actors and critics have become disturbingly normalised. The actor urged collective action and stricter laws to curb unchecked abuse on digital platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-99-thanuja-draws-criticism-pavan-shines-ahead-of-finale-2836593-2025-12-16",
      "headline": "Bigg Boss Telugu 9 Day 99: Thanuja draws criticism, Pavan shines ahead of finale With the finale week underway, Bigg Boss Telugu 9 shifts gears from rivalry to reflection as heartfelt confessions, lingering tensions and a surprising competitive burst from Pavan redefine the race to the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-pongal-2026-thalapathy-vijay-3-hour-runtime-star-studded-cast-2836592-2025-12-16",
      "headline": "Thalapathy Vijay's Jana Nayagan runtime and plot revealed? Viral posts spark buzz With the release of Thalapathy Vijay's Jana Nayagan less than a month away, numerous reports have surfaced regarding the film's possible plotline and runtime. Official confirmation from the makers remains pending while anticipation continues to build."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sohail-khan-son-nirvan-turns-25-salman-khan-joins-family-bash-pics-2836566-2025-12-16",
      "headline": "Sohail Khan's son Nirvan turns 25, Salman joins the family bash in style. Pics Sohail Khan's son, Nirvan, marked his birthday on December 15, surrounded by the entire Khan family. He also interacted with the paparazzi warmly outside the venue, cut a cake and fed it to some photographers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mira-nair-reveals-why-zohran-mamdani-never-became-actor-despite-suitable-skills-2836575-2025-12-16",
      "headline": "Mira Nair reveals why Zohran Mamdani never became actor despite 'suitable' skills Director Mira Nair shared memories of her son Zohran Mamdani's involvement in early workshops for Monsoon Wedding. She also revealed that he never wished to pursue acting, despite being offered major roles, including A Suitable Boy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-india-cant-get-enough-of-british-tv-inside-bbc-studios-big-india-bet-2836345-2025-12-16",
      "headline": "Why India can't get enough of British TV: Inside BBC Studios' big India bet From Sherlock to Planet Earth III, British storytelling continues to find loyal viewers in India. Stanley Fernandes, SVP – Distribution, South Asia, BBC Studios, tells India Today Digital why the connection is only getting stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-on-jealousy-and-insecurity-while-dating-kareena-kapoor-2836574-2025-12-16",
      "headline": "Love triumphs: Saif Ali Khan on jealousy and insecurity while dating Kareena Kapoor  Saif Ali Khan candidly reflected on feeling jealous and insecure during the early days of his relationship with Kareena Kapoor, admitting that dating a working actor was new territory for him. He shared how trust, maturity and love helped their bond grow stronger over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wooga-squad-friendship-tested-park-seo-joon-chooses-neither-bts-v-park-hyung-sik-wedding-2836547-2025-12-16",
      "headline": "If BTS V and Hyung Sik marry the same day, Park Seo Joon picks one During a recent appearance on a reality chat show, Park Seo Joon was asked whether he would attend BTS' V or Park Hyung Sik's wedding if both events happened on the same day, highlighting the strong bond among the Wooga Squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jailer-2-song-shoot-chennai-nora-fatehi-rajinikanth-tamil-film-sequel-2836561-2025-12-16",
      "headline": "Jailer 2: Nora Fatehi joins Rajinikanth in Chennai for high-energy dance number Nora Fatehi is currently in Chennai filming a major dance track for the upcoming sequel Jailer 2, sharing the set with Rajinikanth. The song, composed by Anirudh Ravichander, is set for release in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/will-not-give-up-celina-jaitly-sends-strength-to-detained-brother-on-his-birthday-2836548-2025-12-16",
      "headline": "Will not give up: Celina Jaitly sends strength to detained brother on his birthday Celina Jaitly shared a deeply emotional birthday message for her brother, Major Vikrant Kumar Jaitly, who has been detained in Abu Dhabi since September 2024. The actor spoke about her struggle to contact him and the personal toll his absence has taken on their family."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/goa-nightclub-fire-luthra-brothers-brought-back-india-detained-thailand-2836483-2025-12-16",
      "headline": "Luthra brothers brought back to India from Thailand, arrested by Goa PoliceThe Luthra brothers, owners of the nightclub where a tragic fire claimed 25 lives in Goa, have been brought back to India from Thailand, marking a significant development in the ongoing investigation. Authorities are now intensifying their probe into the incident and related legal violations.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sydney-shooter-used-indian-passport-philippines-travel-ahead-attack-reports-naveed-sajid-akram-hanukkah-attack-australia-2836675-2025-12-16",
      "headline": "Sydney shooter used Indian passport for Philippines travel ahead of attack: ReportsBondi Beach shooters Sajid and Naveed Akram, who killed 15 unarmed civilians in Sydney, travelled to the Philippines to receive military-style training from Islamist outfits, according to reports. While Sajid used an Indian passport, his son Naveed used Australian documents, according to Philippine immigration officials."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-refuses-to-take-note-of-ed-chargesheet-against-sonia-rahul-gandhi-in-national-herald-case-2836551-2025-12-16",
      "headline": "National Herald case against Sonia, Rahul collapses; court throws out ED chargesheetThe Court said the complaint filed by ED under the Prevention of Money Laundering Act was not maintainable as the case was based on a private complaint and not an FIR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-2026-live-updates-players-retained-bought-sold-unsold-players-2836482-2025-12-16",
      "headline": "IPL 2026 auction live: Green joins KKR as IPL's most expensive overseas playerIPL Auction 2026 live updates: Cameron Green has become the most expensive overseas player in IPL history as Kolkata Knight Riders signed the Australian all-rounder for Rs 25.20 crore after an intense bidding war with Chennai Super Kings. Earlier, Delhi Capitals kicked off proceedings at the ongoing auction by signing South Africa star David Miller for Rs 2 crore. The opening set, however, also saw notable names go unsold, with Jake Fraser-McGurk, Prithvi Shaw and Devon Conway failing to attract any bids in the first round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-teaser-sunny-deol-rallies-his-men-with-a-war-cry-meant-to-reach-lahore-2836662-2025-12-16",
      "headline": "Border 2 teaser: Sunny Deol rallies his men with a war cry meant to reach LahoreBorder 2 teaser unveils Sunny Deol, Varun Dhawan, Diljit Dosanjh and Ahan Shetty as war heroes in a stirring tribute to India's armed forces."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vehicles-collide-due-to-dense-fog-catch-fire-on-delhi-agra-expressway-many-feared-dead-2836442-2025-12-16",
      "headline": "13 dead after vehicles collide due to fog on Yamuna Expressway, PM announces aidA tragic multi-vehicle collision in dense fog on the Delhi-Agra Expressway has claimed 13 lives and injured around 75 others. Rescue operations are ongoing as authorities investigate the cause of the deadly pile-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mgnrega-new-bill-vb-gram-g-bill-2025-bjp-pm-modi-government-faces-questions-tdp-opposition-funding-burden-states-2836649-2025-12-16",
      "headline": "G RAM G faces opposition even from BJP ally. And its not just the nameThe VB-G RAM G Bill proposes to replace the existing MGNREGA. It has created an uproar in the Opposition benches over the dropping of Mahatma Gandhi's name from India's flagship rural employment scheme. However, the Bill has also faced concerns from a key BJP ally, the Chandrababu Naidu-led TDP. It warned that the changes could strain state finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-premanand-maharaj-visit-anushka-sharma-skips-lionel-messi-india-tour-2836654-2025-12-16",
      "headline": "Virat Kohli, wife Anushka visit Premanand Maharaj, video captures emotional momentVirat Kohli skipped the spotlight surrounding Lionel Messi's India tour. The former India captain instead visited Premanand Ji Maharaj in Vrindavan with wife Anushka Sharma for spiritual reflection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-origin-woman-bubbly-kaur-detained-us-green-card-interview-2836669-2025-12-16",
      "headline": "Indian-origin woman, living in US for 32 years, detained at Green Card interviewBubbly Kaur, who has been living in the US since 1994, was detained on December 1 during a biometric scan for her pending green card application."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/smelly-indians-remark-gets-us-techie-boot-sparks-fresh-anti-india-trolling-nik-pash-cline-ai-techie-racism-in-usa-maga-trump-2836425-2025-12-16",
      "headline": "Smelly Indians remark gets US techie the boot, sparks fresh anti-India trollingNik Pash, AI head at Cline, was fired after his racist comment on a hackathon photo sparked outrage on social media. But his sacking triggered a chain reaction of debates over what many called mob justice and overreaction to a 'harmless' comment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-releases-draft-list-after-bengal-sir-including-names-of-voters-set-to-be-excluded-2836503-2025-12-16",
      "headline": "Bengal SIR: Over 58 lakh names deleted as Election Commission shares draft listBengal SIR list: The release of the draft voter list marks the conclusion of the enumeration phase and the start of a more daunting task involving claims, objections and hearings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistans-1971-surrender-commission-blamed-wine-women-sex-2836537-2025-12-16",
      "headline": "How Pak let off Generals Ayub, Niazi but damned women, wine and sex for '71 defeatHalf a nation gone, 93,000 soldiers captured. And in the years that followed, Pakistan would ask itself one haunting question: How? The answer, according to the Pakistani government's own investigation, would prove more scandalous than the defeat itself. Here's a look back at the scandal as India celebrates Vijay Diwas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/conspiracy-by-gangs-of-gandhinagar-congress-hits-out-after-court-relief-for-gandhis-in-national-herald-case-2836635-2025-12-16",
      "headline": "Conspiracy by 'Gangs of Gandhinagar': Congress after National Herald case dismissedAddressing a press conference, senior party leader Pawan Khera said the National Herald case was part of a conspiracy to break the morale of Rahul Gandhi, adding that the conspiracy was not just against the MP but against the people of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/are-gandhis-off-the-hook-or-heres-what-court-order-in-national-herald-case-means-2836640-2025-12-16",
      "headline": "Are Gandhis off the hook or…? Here's what order in National Herald case meansThe major immediate procedural relief for the Gandhis is that the court's refusal to take cognisance halts the criminal prosecution at the threshold and the case will not move to the trial stage for now. The focus will now shift to an FIR registered by the Economic Offence Wing (EOW) of the Delhi Police, and any future action depends on what ED does in the EOW FIR. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/attempt-to-expand-centres-control-shrink-responsibilities-and-funds-priyanka-gandhi-slams-mgnrega-overhaul-2836620-2025-12-16",
      "headline": "What's this name-change obsession? Priyanka Gandhi on new RAM G Bill vs MGNREGAPriyanka Gandhi slammed Centre's plan to replace MGNREGA scheme and called it an attempt to shrink funds. She questioned the rationale behind changes that, she said, involve heavy expenditure and weaken local governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vijay-diwas-dhurandhars-india-pakistan-1971-war-pakistani-soldiers-surrender-real-heroes-2836643-2025-12-16",
      "headline": "Vijay Diwas: The Dhurandhars who forced 93,000 Pak soldiers to surrenderVijay Diwas: At a time when the spy thriller Dhurandhar has taken the box office by storm, several such Dhurandhars played a key role in the 1971 India-Pakistan war that ended with the surrender of 93,000 Pakistani soldiers and the formation of Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bondi-beach-sydney-massacre-how-shooters-got-six-guns-one-licence-strict-gun-laws-australia-hanukkah-jewish-celebrations-2836642-2025-12-16",
      "headline": "How Bondi shooters got 6 guns from a single licenceThe Bondi Beach massacre, in which 15 unarmed civilians were shot dead, has exposed the loopholes in the country's strict gun laws. Despite sweeping reforms, lax enforcement and legal gaps allowed the attackers to stockpile weapons. Here's how the Sydney shooters got six guns from a single licence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-series-jasprit-bumrah-absence-reason-reports-family-member-hospitalised-2836445-2025-12-16",
      "headline": "Why did Jasprit Bumrah leave IND vs SA series midway?Jasprit Bumrah left the India vs South Africa T20I series midway for personal reasons. The Indian pacer reportedly returned to Mumbai after a close family member was hospitalised, with his comeback depending on recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/two-desi-sweet-dishes-kulfi-phirni-100-best-desserts-in-the-world-2836132-2025-12-15",
      "headline": "Kulfi and Phirni rank among the World's 100 Best DessertsFood guide TasteAtlas has released its annual 100 Best Desserts in the World list, with two Indian dishes earning a spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-part-4-tamilakam-drew-its-own-map-texts-terrain-and-dravida-turn-322-15-12-2025",
      "headline": "Tamilakam drew its own map: Texts, Terrain and Dravida TurnAryāvart's ancient texts have all ushered us towards the reaches of Dhakṣiṇapatha. They traced the routes that led to the sun-baked expanses of Dravida that extended over land, sea, and even the islands abutting its lower flank. These texts saw the South as a tantalising terminus, a zone of exploration and 'discovery', an uncharted wild periphery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/are-we-solving-the-right-problems-design-thinking-says-its-time-to-ask-2836404-2025-12-16",
      "headline": "Are we asking the right questions? Design thinking says it's time to askDesign thinking is gaining a prominent place in institutions, public spaces and organisations. It is now influencing everyone, from individuals to large systems. This raises a key question: what is the right approach, and how can design thinking become part of daily life in a way that actually works? At its core, design thinking is a human-centred method that brings together people's needs, technological possibilities and the practical realities of business."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/dhaka-brac-university-students-scream-in-panic-escalator-speeds-up-malfunction-video-viral-2836519-2025-12-16",
      "headline": "Escalator suddenly accelerates, triggering panic among students in DhakaA video of the incident, which has now gone viral on social media, showed the moment after the escalator suddenly began moving at an unusually high speed. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rob-reiner-wife-murder-son-arrested-trump-controversy-2836637-2025-12-16",
      "headline": "Explained: Rob Reiner's death and row over Donald Trump's inflammatory postRob Reiner and his wife Michele were tragically stabbed to death at their Los Angeles home. The incident and President Donald Trump's politicising comments have ignited widespread outrage and debate."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhigyan-kundu-double-century-u19-asia-cup-india-record-2836672-2025-12-16",
      "headline": "Abhigyan Kundu scripts history in Youth ODIs with 209 vs Malaysia in U19 Asia Cup Abhigyan Kundu became only the second batter in Youth ODIs to score a double hundred when India and Malaysia locked horns in the U19 Asia Cup clash on Tuesday in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-premanand-maharaj-visit-anushka-sharma-skips-lionel-messi-india-tour-2836654-2025-12-16",
      "headline": "Virat Kohli, wife Anushka visit Premanand Maharaj, video captures emotional moment Virat Kohli skipped the spotlight surrounding Lionel Messi's India tour. The former India captain instead visited Premanand Ji Maharaj in Vrindavan with wife Anushka Sharma for spiritual reflection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-rapid-fifty-u19-asia-cup-india-malaysia-2836636-2025-12-16",
      "headline": "Vaibhav Suryavanshi keeps growing in stature, with 25-ball fifty vs Malaysia Vaibhav Suryavanshi has been the driving force of India's U19 Asia Cup campaign, producing explosive knocks including a 25-ball fifty and a record-breaking 171 to underline his growing stature as a match-winner in youth cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/izaz-sawariya-ipl-2026-auction-uncapped-spinner-instagram-reels-2836602-2025-12-16",
      "headline": "How Instagram cricketer Izaz Sawariya made his way into IPL 2026 auction list Izaz Sawariya, a 20-year-old Instagram creator from Bidar, has been listed in the IPL 2026 auction without any professional cricket experience. The talented wrist spinner has given trials for CSK and PBKS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-4th-t20i-lucknow-sanju-samson-predicted-xi-2836590-2025-12-16",
      "headline": "India vs South Africa, 4th T20I Predicted XI: Will Samson get a chance in Lucknow? IND vs SA, 4th T20I: Sanju Samson has an average of 72 and a strike-rate of 194.59 against South Africa, but the right-handed batter is yet to play a match in the ongoing series. Will he get a chance in Lucknow? \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-kolkata-knight-riders-matheesha-pathirana-target-death-overs-robin-uthappa-2836582-2025-12-16",
      "headline": "KKR can find their death overs answer in Matheesha Pathirana: Robin Uthappa IPL 2026 auction: Robin Uthappa feels Matheesha Pathirana could be the answer to KKR's death-overs struggles. With the biggest purse at the IPL 2026 mini-auction, KKR are well placed to make a decisive move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-ipl-2026-auction-jamie-smith-rehan-ahmed-gus-atkinson-ben-duckett-2836534-2025-12-16",
      "headline": "MS Dhoni-like star will be the costliest English buy at IPL auction: Monty Panesar Former England spinner Monty Panesar has backed Jamie Smith to become the most expensive English player at the IPL 2026 auction. Smith is among 21 England players registered for the auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-five-overseas-maiden-deals-jamie-smith-ben-duckett-2836517-2025-12-16",
      "headline": "IPL 2026 auction: Five overseas stars who could fetch maiden deals IPL 2026 auction: Several foreign players will be looking to bag their maiden deals when they go under the hammer in the auction to be held in Abu Dhabi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-nathan-lyon-returns-australia-playing-xi-ashes-2025-26-adelaide-test-2836479-2025-12-16",
      "headline": "Ashes: Pat Cummins returns as Australia make two changes for Adelaide Test Australia captain Pat Cummins returns for the third Ashes Test in Adelaide after recovering from a bone stress injury. Apart from him, Nathan Lyon has also returned to the playing XI after being left out of the second Test in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-chennai-super-kings-sarfaraz-khan-target-suresh-raina-2836491-2025-12-16",
      "headline": "CSK can benefit from Sarfaraz Khan deal in IPL 2026 mini-auction: Raina Suresh Raina believes Chennai Super Kings should target Sarfaraz Khan at the IPL 2026 mini-auction. The former CSK star feels Sarfaraz's domestic form makes him a smart, value-driven pick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-2026-live-updates-players-retained-bought-sold-unsold-players-2836482-2025-12-16",
      "headline": "IPL 2026 auction live: Green joins KKR as IPL's most expensive overseas playerIPL Auction 2026 live updates: Cameron Green has become the most expensive overseas player in IPL history as Kolkata Knight Riders signed the Australian all-rounder for Rs 25.20 crore after an intense bidding war with Chennai Super Kings. Earlier, Delhi Capitals kicked off proceedings at the ongoing auction by signing South Africa star David Miller for Rs 2 crore. The opening set, however, also saw notable names go unsold, with Jake Fraser-McGurk, Prithvi Shaw and Devon Conway failing to attract any bids in the first round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-bournemouth-ruben-amorim-defenders-backed-premier-league-2836474-2025-12-16",
      "headline": "Ruben Amorim backs Manchester United defenders after 4-4 letdown vs BournemouthRuben Amorim defended Manchester United's backline after a chaotic 4-4 draw against Bournemouth. Despite conceding four goals, the United head coach insisted his defenders have quality and only need better collective defending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-new-rule-salary-cap-18-crore-overseas-player-debate-bcci-2836468-2025-12-16",
      "headline": "IPL 2026 auction has a new rule and it's stirring a debateIPL Auction: The Indian Premier League mini-auction is set to take place in Abu Dhabi today. Ahead of the event, a major rule change has sparked widespread debate among fans, with many questioning whether the new regulation makes any sense at all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-should-play-the-virat-kohli-role-in-t20is-deep-dasgupta-2836457-2025-12-16",
      "headline": "Shubman Gill should play the Virat Kohli role in T20Is: Former wicketkeeperDeep Dasgupta has urged India's T20I vice-captain Shubman Gill to emulate Virat Kohli's anchoring role in the shortest format. Gill hasn't been in great form since his return to T20Is, having scored just 291 runs in 15 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-series-jasprit-bumrah-absence-reason-reports-family-member-hospitalised-2836445-2025-12-16",
      "headline": "Why did Jasprit Bumrah leave IND vs SA series midway?Jasprit Bumrah left the India vs South Africa T20I series midway for personal reasons. The Indian pacer reportedly returned to Mumbai after a close family member was hospitalised, with his comeback depending on recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-where-to-watch-timings-livestreaming-top-targets-purse-remaining-2836441-2025-12-16",
      "headline": "IPL mini-auction complete guide: Where to watch, FAQs and top playersThe Indian Premier League auction is set to take place in Abu Dhabi on Tuesday, 15 December. In case you have missed the build-up, don't worry, we have you covered. Check out our article to know which team has the most purse, who will be the top picks, and where can you watch the event live."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-visit-extend-anant-ambani-invite-vantara-jamnagar-animal-rescue-2836440-2025-12-16",
      "headline": "Watch: Messi lands in Jamnagar to visit Anant Ambani's Vantara wildlife rescueLionel Messi extended his India visit with a planned trip to Jamnagar. The Argentine icon will visit Anant Ambani's Vantara wildlife rescue centre after concluding the G.O.A.T. India Tour 2025 in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-rohit-kohli-matches-mandatory-2836419-2025-12-15",
      "headline": "Gap between SA and NZ series? Play Vijay Hazare, BCCI tells India starsThe BCCI has made it compulsory for all senior national players to participate in at least two Vijay Hazare Trophy matches. This move aims to ensure players do not treat domestic cricket as second-class tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-start-date-final-2836407-2025-12-15",
      "headline": "IPL 2026 to begin on March 26, final scheduled for May 31: ReportThe 2026 edition of the Indian Premier League is likely to begin on March 26, with the final scheduled for May 31. Whether the opening match of the tournament will be played at the M Chinnaswamy Stadium is still under review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-of-india-2025-kolkata-hyderabad-mumbai-delhi-rollercoaster-2836399-2025-12-15",
      "headline": "4 cities, 1 GOAT: Lionel Messi's India tour that had it allLionel Messi's India tour moved through chaos and calm, heartbreak and joy. Across four cities, fans waited, erred, celebrated and found fleeting magic in the presence of football's greatest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/goat-tour-2025-sunil-chhetri-emotional-meeting-lionel-messi-injury-fan-2836377-2025-12-15",
      "headline": "A hobbling body, heart left full: Sunil Chhetri reflects on his Messi moment at MumbaiSunil Chhetri opens up on meeting Lionel Messi during the Mumbai leg of the GOAT India Tour, revealing how the fan in him won amid injury struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-message-india-goat-tour-delhi-2836366-2025-12-15",
      "headline": "Lionel Messi's parting words to India: I will return, hopefully to play a matchLegendary Lionel Messi's tour of India concluded in New Delhi on Monday, December 15. Messi addressed the audience at the Arun Jaitley Stadium and shared a message of love to the fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20i-axar-patel-injury-illness-2836349-2025-12-15",
      "headline": "Axar Patel ruled out of remaining IND vs SA T20Is due to illnessIndia all-rounder Axar Patel has been ruled out of the remaining two T20I matches against South Africa due to illness. His absence comes at a crucial time as India finalises the squad for the 2026 T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/goat-india-tour-anant-ambani-host-lionel-messi-luis-suarez-rodrigo-de-paul-vantara-delhi-trip-2836314-2025-12-15",
      "headline": "Anant Ambani to host Lionel Messi and co at Vantara after Delhi trip: ReportLionel Messi is reportedly set for a one-night stop at Vantara, the wildlife rescue centre in Jamnagar, where Anant Ambani will host the football star as part of the GOAT India Tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-seifert-century-melbourne-renegades-big-bash-league-ipl-2026-auction-2836307-2025-12-15",
      "headline": "Tim Seifert warms up for IPL 2026 auction with 53-ball century in BBLTim Seifert warmed up for the IPL 2026 auction in style by smashing a 56-ball century for Melbourne Renegades against Brisbane Heat, powering a 14-run BBL win and earning Player of the Match honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-delhi-meets-jay-shah-gifts-t20-world-cup-ticket-jersey-minerva-academy-stars-2836305-2025-12-15",
      "headline": "Messi's GOAT Tour: Meets Minerva academy, Jay Shah gifts World Cup ticket in DelhiLionel Messi's GOAT tour in India: Lionel Messi's final stop of the GOAT tour in Delhi was short but electric, with roaring crowds, smiling youngsters and a heartfelt goodbye that brought the GOAT India Tour to a memorable close."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jay-shah-invites-lionel-messi-india-usa-t20-world-cup-mumbai-2836277-2025-12-15",
      "headline": "Jay Shah gifts Lionel Messi India vs USA T20 World Cup 2026 ticket in New DelhiJay Shah gifted Lionel Messi a ticket for the India vs USA match at the ICC Men's T20 World Cup 2026 during a special New Delhi interaction, highlighting a symbolic crossover between global football and Indian cricket.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-removed-dangerous-bowling-bbl-debut-melbourne-renegades-brisbane-heat-2836193-2025-12-15",
      "headline": "Shaheen Afridi makes horror BBL debut, removed from attack for dangerous bowlingShaheen Shah Afridi suffered a nightmare BBL debut, being taken off for dangerous bowling during the Brisbane Heat vs Melbourne Renegades clash on Monday at Simonds Stadium in Geelong. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messis-goat-tour-in-india-abhinav-bindra-questions-focus-on-individuals-over-sports-culture-2836190-2025-12-15",
      "headline": "Messi in India: Abhinav Bindra questions focus on individuals over sports cultureOlympic champion Abhinav Bindra has shared thoughtful reflections on Lionel Messi's GOAT India Tour, questioning the spectacle around fleeting access to icons and urging greater investment in grassroots sport across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-harshit-rana-praises-arshdeep-singh-3rd-t20i-morne-morkel-2836162-2025-12-15",
      "headline": "Arshdeep Singh creates pressure from other end, like bowling with him: HarshitIndia's seam-bowling all-rounder Harshit Rana said he relishes sharing the new ball with Arshdeep Singh, crediting the left-arm pacer for consistently building pressure from the opposite end."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}