{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rites-share-price-surged-10-percent-today-explained-stmp-2657681-2024-12-31",
      "headline": "Explained: Why RITES share price surged 10% todayRITES stock price: The stock opened at Rs 267.15 and soared to an intraday high of Rs 302.80, supported by increased investor interest and heightened trading activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-extends-vivad-se-vishwas-scheme-2024-deadline-to-january-31-key-penalty-interest-details-2657664-2024-12-31",
      "headline": "Income Tax extends Vivad Se Vishwas deadline to January 31. Key penalty detailsThe Income Tax Department has extended the Vivad Se Vishwas Scheme deadline to January 31, 2025, offering taxpayers a chance to settle disputes at reduced rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-share-price-rebounds-after-falling-in-previous-session-explained-stmp-2657653-2024-12-31",
      "headline": "Dam Capital share price rebounds after Monday's slump. Here's whyDam Capital stock price:  By 11 am, the shares were trading 3.60% higher at Rs 385.70, recovering some ground lost during Monday's profit booking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-continues-positive-rally-reaches-all-time-high-stmp-2657642-2024-12-31",
      "headline": "ITI share price hits record high as positive rally continuesITI share price: The recent rally has propelled ITI Ltd. above its 5-day, 20-day, 50-day, 100-day, and 200-day moving averages, underlining its robust performance across short- and long-term benchmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-share-price-stock-falls-10-percent-on-promoter-nishant-pitti-stake-sale-stmp-2657636-2024-12-31",
      "headline": " Explained: Why Easy Trip Planners shares tanked 10% today The shares hit a low of Rs 15.42 on the NSE, a decline of 9.51%. The stock saw a turnover of Rs 127.43 crore on the NSE during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-share-price-90-percent-premium-rs-1491-bse-bumper-debut-multibagger-2657628-2024-12-31",
      "headline": "Unimech Aerospace IPO listing: Shares make bumper debut. Lists at 90% premiumUnimech Aerospace IPO stock: Unimech Aerospace shares listed at Rs 1,491 per share, reflecting an 89.94% premium over their issue price on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-in-red-it-stocks-decline-last-session-of-2024-adani-enterprises-down-over-1-percent-2657617-2024-12-31",
      "headline": "Sensex, Nifty drop as IT stocks weigh on markets in last session of 2024The S&P BSE Sensex lost 392.61 points to 77,855.52, while the NSE Nifty50 was down by 107.80 points to 23,537.10 as of 9:28 AM. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-open-for-bidding-check-latest-gmp-price-band-issue-size-all-details-2657609-2024-12-31",
      "headline": "Indo Farm Equipment IPO opens for bidding: Check GMP, price band, issue sizeIndo Farm Equipment IPO: The IPO is a book-built issue valued at Rs 260.15 crore. It includes a fresh issue of 86 lakh shares, amounting to Rs 184.90 crore, and an offer for sale (OFS) of 35 lakh shares, valued at Rs 75.25 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-gmp-declines-will-it-make-strong-market-debut-today-2657598-2024-12-31",
      "headline": " Unimech Aerospace IPO GMP declines: Will it make strong market debut today? The initial public offering (IPO) of Unimech Aerospace and Manufacturing Limited garnered an overwhelming response, with a subscription rate of 174.93 times by the final day of bidding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-enterprises-adani-wilmar-easemytrip-itc-zomato-unimech-aerospace-2657590-2024-12-31",
      "headline": "Stocks to watch today: Adani Enterprises, Adani Wilmar, EaseMyTrip, ITC, ZomatoShares of Adani Enterprises, Adani Wilmar, Zoamto, EaseMyTrip, etc will be in the spotlight today due to various developments when markets open for trading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-itr-filing-will-the-old-tax-regime-face-the-axe-2657339-2024-12-30",
      "headline": "Budget 2025: Will the old tax regime face the axe?With Budget 2025 approaching, debates intensify over the potential scrapping of the Old Tax Regime amidst tax reforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-sell-entire-adani-wilmar-stake-in-usd-2-billion-deal-lence-pte-ltd-divestment-2657295-2024-12-30",
      "headline": "Adani Enterprises to sell entire Adani Wilmar stake in $2 billion dealAdani Enterprises and its wholly-owned subsidiary, Adani Commodities LLP (ACL), have entered into an agreement with Lence Pte Ltd, a fully-owned subsidiary of Wilmar International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-450-points-nifty-declines-adani-enterprises-jumps-7-percent-2657286-2024-12-30",
      "headline": "Sensex falls over 450 points, Nifty declines; Adani Enterprises jumps 7%The S&P BSE Sensex ended 450.94 points lower at 78,248.13, while the NSE Nifty50 settled 168.50 points lower at 23,644.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/greaves-cotton-share-price-jumps-13-percent-52-week-high-today-why-vijay-kedia-greaves-electric-mobility-ipo-stmp-2657274-2024-12-30",
      "headline": "Greaves Cotton share price surges 13% to hit 52-week high today. Here's why Greaves Cotton share price hit 52-week high. The share which had closed at Rs 281.83 on Friday, opened at Rs 288.70 on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-fixed-deposits-still-the-best-bet-for-indian-investors-is-fd-safe-2657273-2024-12-30",
      "headline": "Are fixed deposits still the best bet for Indian investors?Fixed deposits are safe but face risks like limited protection, reinvestment challenges, and low post-tax real returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-in-january-2025-what-to-expect-investors-face-a-tough-start-sectors-to-watch-dalal-street-2657261-2024-12-30",
      "headline": "Stock market in January 2025: Will investors face a tough start to the year? Historically, January has often been a challenging month for equity markets, with the NSE Nifty 50 index recording losses in 13 out of the past 20 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-last-major-income-tax-relief-economists-experts-standard-deduction-tax-rate-cut-2657244-2024-12-30",
      "headline": "Budget 2025: When was the last major income tax relief given? Budget 2025: The last Union Budget did not make changes to the old tax regime but introduced modifications to the new tax regime to make it more appealing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-in-2025-whats-next-for-stock-markets-in-the-new-year-2657239-2024-12-30",
      "headline": "Stock markets in 2025: What's next for Sensex and Nifty in the new year?Can Indian equities continue their upward climb, or will a mix of global and domestic hurdles create a rocky road ahead? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anya-polytech-and-fertilizers-ipo-day-3-check-latest-subscription-and-gmp-stmp-2657215-2024-12-30",
      "headline": "Anya Polytech & Fertilizers IPO Day 3: Check latest subscription and GMPAnya Polytech's unlisted shares are trading at a premium of Rs 5 in the grey market, reflecting a 35% gain over the upper price band of Rs 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-share-price-tanked-5-percent-today-profit-booking-after-bumper-ipo-listing-stmp-2657201-2024-12-30",
      "headline": "Explained: Why Mamata Machinery share price tanked 5% todayMamata Machinery share price: The decline comes after the company's spectacular stock market debut last week, with analysts attributing the fall to profit booking by retail investors capitalising on the massive listing gains."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yemen-kerala-nurse-nimisha-priya-death-sentence-sanction-foreign-ministry-extending-all-help-2657626-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Extending all help: India after Yemen sanctions death penalty for Kerala nurseThe official spokesperson of the External Affairs Ministry, in a statement, said that the Centre was extending all help necessary and looking at all options for Nimisha Priya. The Kerala nurse's death sentence was sanctioned by Yemen's President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/openai-chatgpt-whistleblower-suchir-balaji-mother-suicide-foul-play-investigation-2657632-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Doesn't seem suicide': Mother uses ChatGPT to re-examine Suchir Balaji's deathSuchir Balaji Death: OpenAI whistleblower Suchir Balaji's mother, in an interview with India Today, has alleged foul play in her son's death. Balaji, 26, was found dead in his San Francisco apartment last month."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-bjp-mocks-chunavi-hindu-arvind-kejriwal-rs-18000-honorarium-priests-granthis-2657673-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's 'chunavi Hindu' dig at Arvind Kejriwal with a Bhool Bhulaiyaa twistDelhi Election: Taking to X, the Delhi BJP shared a poster mocking Arvind Kejriwal, portraying him with rudraksha beads, flower garlands, and vermilion covering his body, while incense sticks were tucked behind his ears."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-navjot-sindhu-slams-travis-head-celebration-pant-insult-indian-2657635-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Head's celebration insulted not just Pant but 1.5 billion Indians: Navjot SidhuAustralia vs India: Former Indian batter Navjot Singh Sidhu has slammed Travis Head's 'obnoxious' celebration after Rishabh Pant's dismissal in the recent Boxing Day Test. Sidhu labeled the act as \"obnoxious behavior\", saying the celebration insulted not just Pant but the entire Indian population of 1.5 billion.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-korea-plane-crash-haunting-final-photo-three-year-old-boy-youngest-victim-thailand-holiday-2657622-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Haunting final photo of boy, 3, youngest victim in South Korea plane crashKang Ko, his wife Jin Lee Seon, and their son were killed when the Jeju Air Boeing 737-800 crashed on Sunday. The family was returning from a holiday in Thailand, the boy's first and only foreign trip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-brad-pitt-divorce-settlement-8-years-2657643-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Angelina Jolie, Brad Pitt finalise divorce, reach settlement after 8 yearsAngelina Jolie and Brad Pitt have reached a settlement eight years after filing for divorce. Jolie's lawyer conveyed her relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/norovirus-cases-surge-why-alcohol-based-sanitisers-dont-work-against-the-pathogen-2657693-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why alcohol-based sanitisers don't work against norovirus pathogenNorovirus cases have surged in the US. Despite the common use of alcohol-based sanitisers during the pandemic, they are ineffective against norovirus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-spadex-satellite-separation-delayed-by-three-seconds-how-it-will-affect-docking-2657686-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SpaDeX satellite separation delayed by three seconds. What it meansThe primary goal of the SpaDeX mission is to develop and validate the technology necessary for autonomous rendezvous and docking of spacecraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-says-he-is-leaving-mumbai-for-the-south-2657659-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Anurag Kashyap says he is leaving Mumbai for the South: Disgusted by my industryFilmmaker-actor Anurag Kashyap critiqued Bollywood's profit-centric mindset and obsession with remakes. He also revealed his plans to relocate to the South. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/narendra-modi-the-third-coming-newsmakers-of-the-year-2024-2657346-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Narendra Modi: The third comingFor getting a historic third term, the prime minister is one of INDIA TODAY's Newsmakers 2024, though some of the sheen is off"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/west-bengal/story/bengal-businessman-tulu-mandal-daughter-lavish-wedding-sparks-row-over-funding-source-2657623-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengal businessman's daughter's lavish wedding sparks row over funding sourceThe wedding ceremony took place in Birbhum's Suri city and the venue was a replica of the five-star Taj Lake Palace hotel in Udaipur. All hotels in the city and district were booked for the guests."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/gonzaga-university-basketball-team-washington-fight-delta-airlines-los-angeles-international-airport-stopped-2657587-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Stop, stop, stop': Runway collision averted in Los Angeles, shows dramatic videoAn aircraft carrying the Gonzaga University men's basketball team nearly crossed a runway as another passenger flight was taking off at Los Angeles International Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/why-is-it-a-good-idea-to-skip-the-mountains-this-new-years-2657548-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why is it a good idea to skip the mountains this New Year's From steep hotel prices to overcrowding, are mountains not calling this New Year? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-elections-manoj-tiwari-sanjay-singh-wife-voting-illegal-voting-not-acceptable-2657555-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Illegal, unacceptable: Manoj Tiwari on Sanjay Singh's wife voting in DelhiDelhi Elections: Manoj Tiwari has urged the Election Commission to probe if Anita Singh was a registered voter in two states and demanded appropriate action if so.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-court-upholds-5-million-verdict-against-donald-trump-sexual-abuse-case-2657487-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US court upholds $5 million verdict against Donald Trump in sexual abuse caseE Jean Carroll, a longtime magazine columnist, testified at a 2023 trial that Donald Trump turned a friendly encounter in spring 1996 into a violent attack after they playfully entered the store's dressing room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/fasting-farmer-leader-jagjit-singh-dallewal-will-take-medical-aid-if-centre-ready-for-talks-punjab-tells-supreme-court-2657678-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dallewal will take medical aid if Centre speaks to farmers: Punjab to Supreme CourtJagjit Singh Dallewal has been on an indefinite hunger strike at the Khanauri border between Punjab and Haryana since November 26, urging the Centre to address farmers' demands, including a legal guarantee for Minimum Support Price on crops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-techie-who-quit-rs-1-crore-amazon-job-to-launch-startup-shares-setbacks-2657676-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie who quit Rs 1 crore Amazon job to launch startup shares setbacksA Bengaluru-based techie shared the setbacks he embraced after he left his Rs 1 crore job at Amazon to launch his startup. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-devendra-fadnavis-orders-scrapping-outdated-government-vehicles-transport-sector-2657501-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis orders scrapping of 13,000 government vehicles that are 15 years oldMaharashtra Chief Minister Devendra Fadnavis ordered the scrapping of 15-year-old buses and outdated government vehicles to modernise transport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/motorcyclist-dies-suv-hits-bike-drags-it-for-kilometre-up-sambhal-2657580-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Motorcyclist dies after SUV hits bike, drags it for a kilometre in UP's SambhalThe victim was returning home when the SUV, a Bolero, collided with his motorcycle, throwing him off. The two-wheeler became lodged under the vehicle, which sped away without slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-russia-move-forward-hand-in-hand-xi-jinping-vladimir-putin-new-years-message-2657640-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China, Russia move forward hand-in-hand: Xi to Putin in New Year's messagePresident Xi Jinping also said that \"political mutual trust and strategic coordination\" between China and Russia have soared under the guidance of the two leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-shares-last-selfies-of-2024-as-she-bids-the-year-goodbye-2657692-2024-12-31?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Kareena Kapoor shares 'last selfies of 2024' as she bids the year goodbyeKareena Kapoor Khan wraps up 2024 with a series of stunning selfies from her Swiss vacation, featuring her iconic pout, sun-kissed glow, and a chic leopard print outfit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-gears-up-for-new-years-eve-police-deploys-20000-security-personnel-traffic-diversion-across-city-strict-checking-2657605-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "20,000 security personnel, traffic diversion: Delhi gears up for New Year's EveDelhi Police have implemented several measures to maintain law and order as residents of the national capital ring in the new year with celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-treasury-department-cyberattack-by-china-sponsored-hackers-documents-stolen-2657564-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US claims China hacked Treasury department, stole unclassified filesThe hackers compromised third-party cybersecurity service provider BeyondTrust and were able to access unclassified documents, according to a letter to lawmakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-to-guntur-kaaram-high-expectations-big-disappointments-of-2024-2657645-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kanguva to Guntur Kaaram: Big expectations, bigger disappointments of 20242024 saw several big-budget films fail to meet the high expectations set by their star power and grand budgets. From sequels to epic fantasies, Kanguva, Indian 2 and several movies left audiences disappointed despite the massive hype surrounding them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-to-guntur-kaaram-high-expectations-big-disappointments-of-2024-2657645-2024-12-31",
      "headline": "Kanguva to Guntur Kaaram: Big expectations, bigger disappointments of 20242024 saw several big-budget films fail to meet the high expectations set by their star power and grand budgets. From sequels to epic fantasies, Kanguva, Indian 2 and several movies left audiences disappointed despite the massive hype surrounding them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-shares-last-selfies-of-2024-as-she-bids-the-year-goodbye-2657692-2024-12-31",
      "headline": "Kareena Kapoor shares 'last selfies of 2024' as she bids the year goodbyeKareena Kapoor Khan wraps up 2024 with a series of stunning selfies from her Swiss vacation, featuring her iconic pout, sun-kissed glow, and a chic leopard print outfit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/hania-aamir-fahad-mustafa-kabhi-main-kabhi-tum-to-return-ary-digital-2657684-2024-12-31",
      "headline": "Hania Aamir, Fahad Mustafa drama Kabhi Main Kabhi Tum to re-air on TV. DetailsThe Pakistani drama Kabhi Main Kabhi Tum, starring Hania Aamir and Fahad Mustafa, is returning to ARY Digital by popular demand. It will air daily at 10 pm from December 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-says-he-is-leaving-mumbai-for-the-south-2657659-2024-12-31",
      "headline": "Anurag Kashyap says he is leaving Mumbai for the South: Disgusted by my industryFilmmaker-actor Anurag Kashyap critiqued Bollywood's profit-centric mindset and obsession with remakes. He also revealed his plans to relocate to the South. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-sanjana-ganesan-angad-aus-vs-ind-border-gavaskar-trophy-2024-25-2657697-2024-12-31",
      "headline": "Jasprit Bumrah's wife's adorable post featuring son Angad: Proud of you DaddaIndia fast bowler Jasprit Bumrah's wife Sanjana Ganesan shared an adorable post for his husband featuring their son Angad, to acknowledge his bowling performances in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-reddy-better-hardik-pandya-test-sunil-gavaskar-stmp-2657680-2024-12-31",
      "headline": "Nitish Reddy definitely better than Hardik in Test cricket: Sunil GavaskarFormer India captain Sunil Gavaskar has reserved high praise for Nitish Kumar Reddy's credentials in Test cricket, calling him a better batter than Hardik Pandya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-awards-nominees-full-list-jasprit-bumrah-test-odi-emerging-2657658-2024-12-31",
      "headline": "Jasprit Bumrah dominates nominations for ICC Awards 2024: Full list ICC Awards 2024: Jasprit Bumrah, Harry Brook and Joe Root earned multiple nominations for the annual awards. Ashdeep Singh, Smriti Manahdna and Shreyanka Patil were the other Indians on the shortlist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-dance-chak-de-video-thane-hospital-room-health-update-2657644-2024-12-31",
      "headline": "Watch: Vinod Kambli dances to 'Chak De' at Thane hospital, video goes viral Former India cricketer Vinod Kambli was seen dancing to the tunes of 'Chak De India' at his hospital room in Thane. Doctors said on Monday that the cricketer's health was improving. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-navjot-sindhu-slams-travis-head-celebration-pant-insult-indian-2657635-2024-12-31",
      "headline": "Head's celebration insulted not just Pant but 1.5 billion Indians: Navjot SidhuAustralia vs India: Former Indian batter Navjot Singh Sidhu has slammed Travis Head's 'obnoxious' celebration after Rishabh Pant's dismissal in the recent Boxing Day Test. Sidhu labeled the act as \"obnoxious behavior\", saying the celebration insulted not just Pant but the entire Indian population of 1.5 billion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pat-cummins-india-vs-australia-boxing-day-test-melbourne-2657511-2024-12-31",
      "headline": "Captain fantastic: Cummins steps up to haunt India againBoxing Day Test, IND vs AUS: Pat Cummins has been a thorn in the flesh for India over the last one and a half years. On Monday, he captained Australia to a 2-1 series lead with an 184-run win at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mitchell-starc-injury-update-new-year-test-sydney-andrew-mcdonald-2657633-2024-12-31",
      "headline": "Mitchell Starc to miss Sydney Test? Australia head coach gives injury updateAustralia vs India: Australia head coach Andrew McDoland remained optimistic about Mitchell Starc's chances of playing the fifth Test, starting January 3 in Sydney. The left-arm pacer picked up an upper-body concern in Australia's 184-run win in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-david-warner-jasprit-bumrah-brave-batting-2657624-2024-12-31",
      "headline": "Warner praises Konstas, questions senior Australian batters' approach vs BumrahFormer opener David Warner praised Sam Konstas for his brave batting approach against India's ace pacer Jasprit Bumrah. However, Warner also questioned why it took a 19-year-old to show the initiative that senior players failed to display.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-lose-another-appeal-to-register-dani-olmo-before-deadline-2657592-2024-12-31",
      "headline": "Barcelona lose another appeal to register Dani Olmo before deadlineBarcelona have lost another appeal for the registration of Dani Olmo for the rest of the season on Monday, one day before the deadline to register the Spanish international.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-virat-kohli-test-comparison-fab-four-williamson-smith-root-2657490-2024-12-31",
      "headline": "No more Fab 4: Virat Kohli fails to keep up with ever-evolving peers IND vs AUS: Virat Kohli has struggled to find his form in Test cricket over the last five years, while the other members of the Fab-Four, Steve Smith, Kane Williamson and Steve Smith, have kept hammering runs all around the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-coach-defends-mitchell-marsh-poor-form-india-test-series-2657583-2024-12-31",
      "headline": "Australia coach defends Mitchell Marsh amid widespread calls to drop all-rounderBorder-Gavaskar Trophy: Australian coach Andrew McDonald has defended the role of out-of-form all-rounder Mitchell Marsh in the team ahead of the fifth and final Test against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mitchell-starc-injury-update-new-year-test-sydney-andrew-mcdonald-2657633-2024-12-31",
      "headline": "Mitchell Starc to miss Sydney Test? Australia head coach gives injury updateAustralia vs India: Australia head coach Andrew McDoland remained optimistic about Mitchell Starc's chances of playing the fifth Test, starting January 3 in Sydney. The left-arm pacer picked up an upper-body concern in Australia's 184-run win in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sam-konstas-david-warner-jasprit-bumrah-brave-batting-2657624-2024-12-31",
      "headline": "Warner praises Konstas, questions senior Australian batters' approach vs BumrahFormer opener David Warner praised Sam Konstas for his brave batting approach against India's ace pacer Jasprit Bumrah. However, Warner also questioned why it took a 19-year-old to show the initiative that senior players failed to display.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-lose-another-appeal-to-register-dani-olmo-before-deadline-2657592-2024-12-31",
      "headline": "Barcelona lose another appeal to register Dani Olmo before deadlineBarcelona have lost another appeal for the registration of Dani Olmo for the rest of the season on Monday, one day before the deadline to register the Spanish international.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-virat-kohli-test-comparison-fab-four-williamson-smith-root-2657490-2024-12-31",
      "headline": "No more Fab 4: Virat Kohli fails to keep up with ever-evolving peers IND vs AUS: Virat Kohli has struggled to find his form in Test cricket over the last five years, while the other members of the Fab-Four, Steve Smith, Kane Williamson and Steve Smith, have kept hammering runs all around the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-coach-defends-mitchell-marsh-poor-form-india-test-series-2657583-2024-12-31",
      "headline": "Australia coach defends Mitchell Marsh amid widespread calls to drop all-rounderBorder-Gavaskar Trophy: Australian coach Andrew McDonald has defended the role of out-of-form all-rounder Mitchell Marsh in the team ahead of the fifth and final Test against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/emma-raducanu-pulls-out-of-australian-open-warmup-with-back-niggle-2657577-2024-12-31",
      "headline": "Emma Raducanu pulls out of Australian Open warmup with back niggleGrand Slam champion Emma Raducanu has withdrawn from this week's WTA event in Auckland due to a back issue. However, Raducanu has decided to travel to Melbourne to continue her preparations for the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-threat-relegation-ruben-amorim-newcastle-loss-2657569-2024-12-31",
      "headline": "Manchester United face clear threat of relegation, admits Ruben AmorimRuben Amorim admitted that it is \"really clear\" Manchester United are being drawn into a relegation battle following their 2-0 defeat to Newcastle at Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-cannot-read-crystal-ball-virat-kohli-rohit-sharma-test-future-2657484-2024-12-30",
      "headline": "Cannot read the crystal ball: Gavaskar on Rohit, Kohli's Test futureSunil Gavaskar emphasised how Virat Kohli and Rohit Sharma have given underwhelming performances in the Border-Gavaskar Trophy, highlighting that their lack of impactful contributions has significantly hindered India's chances of success against a dominant Australian side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-five-reasons-why-india-lost-melbourne-test-yashasvi-jaiswal-dropped-catches-2657469-2024-12-30",
      "headline": "Why Jaiswal's drops are not the only reason for India's MCG Test lossIndia's defeat in the Melbourne Test exposed glaring flaws, from senior players' failures to tactical errors, while Yashasvi Jaiswal's dropped catches, though costly, were far from the sole reason for their precarious position in the Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pat-cummins-mcg-boxing-day-test-australia-press-conference-2657467-2024-12-30",
      "headline": "Right at the top: Cummins rates special win at MCG after India heist Border Gavaskar Trophy, AUS vs IND: Captain Pat Cummins rated the Melbourne Test win against India amongst Australia's top Test triumphs. On Monday, Australia beat India by 184 runs at the Melbourne Cricket Ground to take a 1-0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madhya-pradesh-bengal-senior-womens-one-day-trophy-anushka-sharma-2657441-2024-12-30",
      "headline": "MP win Senior Women's One-Day Trophy title after Anushka Sharma starsSenior Women's One-Day Trophy 2024-25: Anushka Sharma's 69 not out and Kranti Gaud's four-wicket haul helped Madhya Pradesh win the title after beating Bengal by seven wickets in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-mitch-hay-2nd-t20i-series-win-report-2657414-2024-12-30",
      "headline": "Mitch Hay stars as New Zealand crush Sri Lanka to claim series NZ vs SL: Mitch Hay's unbeaten 41 off 19 balls helped New Zealand win the T20I series after beating Sri Lanka by 45 runs in the second game at the Bay Oval in Mount Maunganui. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-virat-kohli-test-future-call-for-retirement-2657408-2024-12-30",
      "headline": "Do old guards Rohit Sharma and Virat Kohli deserve more leeway in Tests?Australia vs India, 4th Test: Rohit Sharma and Virat Kohli failed to deliver when the team needed their senior pros to dig in for a draw in Melbourne. Do they deserve more leeway? Should Rohit continue as captain for the series finale in Sydney?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pat-cummins-mcg-boxing-day-test-australia-press-conference-2657467-2024-12-30",
      "headline": "Right at the top: Cummins rates special win at MCG after India heist Border Gavaskar Trophy, AUS vs IND: Captain Pat Cummins rated the Melbourne Test win against India amongst Australia's top Test triumphs. On Monday, Australia beat India by 184 runs at the Melbourne Cricket Ground to take a 1-0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madhya-pradesh-bengal-senior-womens-one-day-trophy-anushka-sharma-2657441-2024-12-30",
      "headline": "MP win Senior Women's One-Day Trophy title after Anushka Sharma starsSenior Women's One-Day Trophy 2024-25: Anushka Sharma's 69 not out and Kranti Gaud's four-wicket haul helped Madhya Pradesh win the title after beating Bengal by seven wickets in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-mitch-hay-2nd-t20i-series-win-report-2657414-2024-12-30",
      "headline": "Mitch Hay stars as New Zealand crush Sri Lanka to claim series NZ vs SL: Mitch Hay's unbeaten 41 off 19 balls helped New Zealand win the T20I series after beating Sri Lanka by 45 runs in the second game at the Bay Oval in Mount Maunganui. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-virat-kohli-test-future-call-for-retirement-2657408-2024-12-30",
      "headline": "Do old guards Rohit Sharma and Virat Kohli deserve more leeway in Tests?Australia vs India, 4th Test: Rohit Sharma and Virat Kohli failed to deliver when the team needed their senior pros to dig in for a draw in Melbourne. Do they deserve more leeway? Should Rohit continue as captain for the series finale in Sydney?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-must-go-for-border-gavaskar-trophy-draw-world-test-championship-sunil-gavaskar-2657395-2024-12-30",
      "headline": "India must look to win in Sydney, stop thinking about WTC final: GavaskarAUS vs IND: Indian cricket legend Sunil Gavaskar believes that the Rohit Sharma-led Indian Test team should focus on securing a draw in the ongoing Border Gavaskar Trophy, rather than focusing on the chances of qualifying for the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-mcg-test-rohit-sharma-press-conference-defeat-form-captaincy-2657374-2024-12-30",
      "headline": "It's mentally disturbing: Rohit Sharma on horror form, captaincy in Australia tourAustralia vs India, 4th Test: Captain Rohit Sharma addressed the press in Melbourne after India's 184-run defeat. From his own form to selection issues, the skipper took tough questions from the media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-yashasvi-jaiswal-shut-up-to-sam-konstas-hits-a-shot-silly-point-melbourne-test-2657386-2024-12-30",
      "headline": "Watch: Jaiswal tells chatty Konstas to shut up, then hits a shot at himYashasvi Jaiswal and Sam Konstas clashed in a fiery spat during the MCG Test, with Jaiswal responding to constant sledging by smashing a shot onto Konstas' body, adding another layer of tension to the Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/brisbane-international-nick-kyrgios-novak-djokovic-chest-bump-celebration-2657375-2024-12-30",
      "headline": "Watch: Kyrgios, Djokovic hog limelight with chest-bump celebration Brisbane International: Nick Kyrgios and Novak Djokovic celebrated whole-heartedly after winning their doubles match on Monday against Alexander Erler and Andreas Mies at the Pat Rafter Arena. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}