{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maximising-returns-how-to-select-top-mutual-funds-for-your-portfolio-investment-tips-money-wealth-2595507-2024-09-07",
      "headline": "Maximising returns: How to select top mutual funds for your portfolioMutual funds have emerged as a popular investment option, offering a balanced approach to growing wealth without the complexity of managing individual stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-criticises-auditor-bdo-exit-call-recordings-illegal-requests-demands-2595495-2024-09-07",
      "headline": "'Multiple call recordings exist': Byju's cries foul after auditor BDO resignsIn a strong response to BDO's resignation, Byju's has accused the audit firm of making unethical requests and manipulating the audit process, including suggesting the backdating of financial reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-auditor-bdo-resigns-financial-crisis-trouble-mounts-edtech-firm-legal-challenges-2595469-2024-09-07",
      "headline": "Byju's crisis worsens as second auditor BDO resigns over financial concernsBDO's exit comes just a year after Deloitte, the company's previous auditor, stepped down citing problems with Byju's financial reporting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-propose-18-percent-tax-on-digital-transactions-up-to-rs-2000-report-2595232-2024-09-06",
      "headline": "Payment aggregators may face 18% GST for transactions up to Rs 2,000: ReportThe final decision will be made at the GST Council's 54th meeting, chaired by Finance Minister Nirmala Sitharaman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-economy-data-adds-142000-jobs-in-august-unemployment-rate-drops-to-42-percent-expert-view-2595171-2024-09-06",
      "headline": "US adds 1,42,000 jobs in August; unemployment rate drops to 4.2%While the job data fell short of expectations, a slight dip in the unemployment rate to 4.2% indicated that the labour market is gradually cooling off, but not dramatically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-study-ipo-investors-not-looking-beyond-listing-gains-are-they-missing-out-expert-view-analysis-2595125-2024-09-06",
      "headline": "IPO investors are not looking beyond listing gains, are they missing out?According to a Sebi study, 70% of the shares, by value, were sold within a year of the IPO. The quick turnover is particularly noticeable in cases where IPO shares see a strong rise in value right after listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anant-ambani-donates-20-kg-gold-crown-worth-rs-15-crore-to-lalbaugcha-raja-2595102-2024-09-06",
      "headline": "Anant Ambani donates 20 kg gold crown worth Rs 15 crore to Lalbaugcha RajaLalbaugcha Raja, Mumbai's most popular Ganesh idol, was unveiled on Thursday ahead of Ganesh Chaturthi. Devotees visit the Lalbaugcha Raja for darshan during the 10-day Ganesh festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-share-price-surges-15-percent-record-high-despite-stock-market-crash-explained-2595026-2024-09-06",
      "headline": "Explained: Why Godfrey Phillips shares hit record high despite market downturnAt the closing bell, the shares of Godfrey Phillips were up 12.69% at Rs 7,204.35 on the Bombay Stock Exchange (BSE). Earlier, the stock jumped 14.50% to reach a record high of Rs 7,320, defying a sharp correction in the domestic indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-decline-for-6th-straight-day-is-it-a-good-time-to-buy-2595008-2024-09-06",
      "headline": "Tata Motors shares decline for 6th straight day. Is it a good time to buy?Tata Motors stock settled over 1.8% lower on Friday, extending losses for the sixth consecutive session. Read on to know whether it is the right time to buy the stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-crashes-1000-point-nifty-slips-under-24900-on-us-data-jitters-2595006-2024-09-06",
      "headline": "Sensex crashes 1,000 points, Nifty slips under 24,900 on US data jittersThe S&P BSE Sensex lost 1017.23 points to close at 81,183.93, while the NSE Nifty50 ended 292.95 points lower to end at 24,852.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-set-to-consider-21-bonus-issue-september-20-shares-jump-over-9-percent-2594984-2024-09-06",
      "headline": "Godfrey Phillips set to consider 2:1 bonus issue; shares jump over 9%A bonus issue is a way for companies to reward existing shareholders without making them pay for the additional shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-1000-points-rs-5-lakh-crore-investors-wealth-wiped-off-2594971-2024-09-06",
      "headline": "Sensex crashes 1,000 points, investors lose Rs 5 lakh croreThe bloodbath on Dalal Street has wiped off nearly Rs 5 lakh crore from the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-may-slash-fuel-prices-as-global-crude-oil-costs-decline-report-2594925-2024-09-06",
      "headline": "Government may slash petrol, diesel prices as global crude oil rates fallUS crude oil prices dropped by more than 1% on Wednesday, falling below $70 per barrel. Brent crude prices followed suit, falling by $1 to reach $72.75 per barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inheritance-showdown-godfrey-phillips-bina-modi-to-vote-on-behalf-of-family-trust-agm-2594904-2024-09-06",
      "headline": "Bina Modi to vote on behalf of family trust at Godfrey Phillips AGMThe Delhi High Court recently allowed Bina to cast her vote on behalf of the trust, which holds a 47.5% stake in the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goldman-sachs-sbi-sell-rating-with-revised-target-price-reason-explained-2594888-2024-09-06",
      "headline": "Goldman Sachs gives SBI 'sell' rating with revised target price. Know whyThe brokerage highlighted a growing risk-reward imbalance for SBI's stock, driven by challenges in maintaining a strong return on assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-household-food-spending-dips-to-less-than-50-percent-eac-pm-report-2594878-2024-09-06",
      "headline": "India's household food spending dips to less than 50%: ReportThe change in spending, highlighted in a recent report by the Economic Advisory Council to the Prime Minister (EAC-PM), signals a shift in how Indian families allocate their monthly budgets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-turbulence-sensex-nifty-down-key-factors-explained-2594841-2024-09-06",
      "headline": "Sensex, Nifty down 1%: What's behind today's stock market turbulence?Today's market turbulence is partly linked to investor jitters ahead of the US non-farm payrolls report expected later today.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-tumbles-goldman-sachs-brokerage-view-83-percent-downside-2594825-2024-09-06",
      "headline": "Explained: Why Vodafone Idea shares tumbled over 14% today As of 11:51 am, Vodafone Idea's shares were trading at Rs13.60, down nearly 10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boss-packaging-solution-shares-sme-ipo-list-25-percent-premium-2594809-2024-09-06",
      "headline": "Boss Packaging Solutions makes debut on NSE SME at 25% premiumBoss Packaging Solutions listing: The stock was listed at Rs 82.5 on the NSE SME, marking a 25% premium over its IPO price of Rs 66."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nsa-ajit-doval-likely-to-hold-talks-on-russia-ukraine-war-in-moscow-brics-nsa-meeting-2595859-2024-09-08",
      "headline": "NSA Ajit Doval to visit Russia this week, take up Ukraine peace talks: SourcesNational Security Advisor (NSA) Ajit Doval will visit Russia this week to participate in the BRICS-NSA meeting and to discuss peace efforts amid the ongoing Russia-Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-aadhaar-applicants-assam-nrc-application-chief-minister-himanta-biswa-sarma-2595658-2024-09-07",
      "headline": "'No NRC application number, no Aadhaar', warns Assam's Himanta SarmaThe Assam Chief Minister said that applications for Aadhaar cards are more than the population in the state, which indicates that there are citizens whose authenticity is suspect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/taslima-nasreen-exclusive-india-residence-permit-bangladesh-exile-deportation-2595829-2024-09-08",
      "headline": "Exclusive: Taslima Nasreen's India stay at risk? Says 'I'll surely die if...'Taslima Nasreen, who was exiled from Bangladesh and has been living in India for many years, is facing uncertainty about her future in the country, as she claims the Indian government has yet to renew her residence permit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-shooting-drone-rocket-kukis-meiteis-jiribam-bishnupur-2595817-2024-09-08",
      "headline": "Manipur forces seize arms, ammunition amid growing tensions after fresh attackManipur Chief Minister N Biren Singh held an emergency meeting with MLAs from the ruling coalition and also met the Governor in the wake of the fresh violence that killed five on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/ic-814-kandahar-hijack-untold-story-when-hijackers-destroyed-honeymoon-photos-netflix-series-indian-airlines-2595049-2024-09-08",
      "headline": "Untold IC 814 story: When hijacker Burger destroyed all honeymoon photosIndian Airlines flight IC 814, which was hijacked in 1999, had 26 couples returning from their honeymoon. Ipseeta and Bipin Menon were two of them. From losing their honeymoon photos to a hijacker to surviving on oranges and milk to avoid going to the clogged toilets. This is the IC 814 story of two newly-weds stuck in a hijack and how they survived the worst together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/filmmaker-arindam-sil-suspended-by-directors-association-after-harassment-allegations-2595858-2024-09-08",
      "headline": "Filmmaker Arindam Sil suspended by director's association after harassment allegationsBengali filmmaker Arindam Sil has been indefinitely suspended by the Directors Association of Eastern India amid sexual harassment allegations. The suspension will remain until the issue is resolved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jackal-attack-in-pilibhit-several-injured-amid-wolf-terror-in-bahraich-2595846-2024-09-08",
      "headline": "12 injured in jackal attack in UP's Pilibhit amid wolf terror in BahraichA pack of jackals attacked people in two villages in Uttar Pradesh's Pilibhit district in which at least 12 people, including seven children, were injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-india-medal-tally-athletics-sumit-antil-navdeep-2595773-2024-09-08",
      "headline": "Paralympics: Record-breaking show of Indian track and field stars in ParisParalympics 2024: Indian athletics contingent put up a sensational show in the Paris Paralympics, by clinching 17 medals. The historic run was a massive step up for Indian track and field athletes who had won eight medals in the previous edition in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-kashmir-election-valmiki-community-first-vote-2595862-2024-09-08",
      "headline": "Ground report: In a first, rights-deprived Valmikis to vote in J&K pollsFor the first time, around 10,000 members of the Valmiki community will exercise their right to vote in the Jammu and Kashmir Assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/georgia-school-shooting-boy-colt-grey-father-collin-case-gay-bullied-automatic-gun-2595861-2024-09-08",
      "headline": "Georgia school shooter's father claims son was called 'gay', constantly bulliedPolice allege that Collin knowingly allowed his son, Colt, access to firearms in their home prior to the shooting at the Georgia school that killed four. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-beit-sadegh-controversy-disqualification-javelin-final-navdeep-singh-gold-2595863-2024-09-08",
      "headline": "Why Iran's Sadegh was disqualified from Paralympics javelin finalIran's Beit Sadegh won gold in Men's Javelin Throw F41 at the Paris Paralympics, only to be shockingly disqualified for a code violation, turning India's Navdeep Singh's silver into an unexpected gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-saif-ali-khan-aamir-khan-sonam-kapoor-celebs-at-ambani-ganpati-celebrations-2595723-2024-09-07",
      "headline": "Kareena Kapoor-Saif Ali Khan, Aamir Khan to Salman Khan: Celebs at Ganpati celebration at Ambani homeMukesh Ambani and Nita Ambani celebrated Ganesh Chaturthi at their Mumbai residence on September 7 with utmost grandeur. Many celebrities like Kareena Kapoor, Saif Ali Khan, Aamir Khan, Salman Khan and Sonam Kapoor joined the celebrations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congresss-vinesh-phogat-launch-her-campaign-for-upcoming-haryana-polls-from-husbands-village-2595794-2024-09-08",
      "headline": "Congress's Vinesh Phogat to kickoff poll campaign from husband's village todayCongress fielded wrestler Vinesh Phogat from Julana Assembly constituency for the Haryana Assembly election. She will kick off her campaign today from Bakta Khera, her husband's ancestral village. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/malayalam-actor-tk-vinayakan-hyderabad-airport-misconduct-2595803-2024-09-08",
      "headline": "Malayalam actor Vinayakan detained at Hyderabad airport for misconductMalayalam actor Vinayakan, who acted as an antagonist in Superstar Rajinikanth-starrer Jailer, has been detained for creating a ruckus at the Hyderabad airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-eleven-schedule-india-pooja-ojha-caone-closing-ceremony-timings-2595849-2024-09-08",
      "headline": "Paralympics, Day 11: India's schedule and closing ceremony full detailsIndia's record-breaking performance at the Paris Paralympics 2024, with 29 medals, will be celebrated as the Games conclude. The final day and closing ceremony promise a fitting tribute to the athletes' incredible achievements and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/how-gen-z-and-millennials-made-sarojini-nagar-market-a-bigger-flex-than-zara-hm-2595031-2024-09-08",
      "headline": "How Gen Z and millennials made Sarojini Nagar a bigger flex than Zara, H&MSarojini is a brand in itself, trusted by everyone from fashion influencers and celebrity fashion stylists, to young enthusiasts who do not mind braving the mad crowds even on a hot summer noon to scout the best of fashion picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-politics-sports-420-06-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-national-anthem-change-amar-sonar-bangla-muhammad-yunus-2595809-2024-09-08",
      "headline": "No plan to change Bangladesh's national anthem, says Muhammad Yunus's advisorDismissing recent calls to change the national anthem of Bangladesh, the country's Religious Affairs Advisor AFM Khalid Hossain, said the government will not do anything to create controversy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-building-collapse-several-dead-injured-yogi-adityanath-rajnath-singh-condoles-loss-of-lives-2595806-2024-09-08",
      "headline": "Death toll in Lucknow building collapse rises to 8, rescue ops underwayAt least eight people died, and 28 others were injured after a three-storey building housing godowns and a motor workshop collapsed in Lucknow on Saturday (September 7) evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/never-give-up-speechless-aryna-sabalenka-basks-glory-us-open-crown-final-2595781-2024-09-08",
      "headline": "'Speechless' Aryna Sabalenka basks in glory after US Open crown US Open 2024: Aryna Sabalenka was over the moon after the hard yards she put in eventually paid dividends. On Saturday, the 26-year-old won the women's singles title after beating Jessica Pegula. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-shooting-kentucky-injuries-i75-lexington-gunman-suspect-2595802-2024-09-08",
      "headline": "7 injured in Kentucky highway shooting, gunman identified; accused on the runA man has noted as a person of interest in the shooting and was identified as Joseph A. Couch, 32, who is an old white male with a height of 5'10 and weighs approximately 154lbs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/navdeep-singh-javelin-throw-gold-paralympics-2024-video-2595801-2024-09-08",
      "headline": "Watch: Navdeep Singh's huge 47.32m throw that won him Paralympics gold Paris Paralympics 2024: India's Navdeep Singh bagged the gold medal with a throw of 47.32 metres in the men's javelin event on Saturday, September 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-giorgia-meloni-meets-volodymyr-zelenskyy-italy-pm-modi-2595742-2024-09-07",
      "headline": "Giorgia Meloni meets Ukraine's Zelenskyy: 'India has to play role in ending war'The conservative Prime Minister met the Ukrainian leader on the sidelines of the annual TEHA business forum on Lake Como. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performs-ganpati-aarti-with-family-chants-bappa-moreya-watch-video-2595870-2024-09-08",
      "headline": "Salman Khan performs Ganpati aarti with niece Ayat, chants 'Bappa Moreya'. WatchActor Salman Khan celebrated Ganesh Chaturthi with his family. A video from the celebration has been doing the rounds on the internet. Salman also attended Ganesh Utsav at Mukesh Ambani's residence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/filmmaker-arindam-sil-suspended-by-directors-association-after-harassment-allegations-2595858-2024-09-08",
      "headline": "Filmmaker Arindam Sil suspended by director's association after harassment allegationsBengali filmmaker Arindam Sil has been indefinitely suspended by the Directors Association of Eastern India amid sexual harassment allegations. The suspension will remain until the issue is resolved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-box-office-collection-day-3-vijays-film-back-on-track-reaches-rs-100-crore-in-india-2595843-2024-09-08",
      "headline": "GOAT box office Day 3: Vijay's film back on track, reaches Rs 100 crore in IndiaGOAT box office collection Day 3: Thalapathy Vijay's film gained momentum at the ticket counters on Saturday. The film crossed the Rs 100 crore milestone within three days of its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kareena-kapoor-saif-ali-khan-aamir-khan-sonam-kapoor-celebs-at-ambani-ganpati-celebrations-2595723-2024-09-07",
      "headline": "Kareena Kapoor-Saif Ali Khan, Aamir Khan to Salman Khan: Celebs at Ganpati celebration at Ambani homeMukesh Ambani and Nita Ambani celebrated Ganesh Chaturthi at their Mumbai residence on September 7 with utmost grandeur. Many celebrities like Kareena Kapoor, Saif Ali Khan, Aamir Khan, Salman Khan and Sonam Kapoor joined the celebrations.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-retires-from-international-cricket-after-australia-series-snub-2595878-2024-09-08",
      "headline": "Moeen Ali retires from international cricket after Australia series snubEngland all-rounder Moeen Ali announced his retirement from international cricket at the age of 37. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-fitness-coach-tiger-head-tattoo-jason-stacy-jessica-pegula-2595876-2024-09-08",
      "headline": "Sabalenka reveals 'Tiger-head' bet with fitness coach on US Open triumphAryna Sabalenka's fitness coach Jason Stacy sported a tiger tattoo on his head which was part of a hilarious bet between the two, just before Sabalenka clinched her first US Open title by defeating Jessica Pegula in a thrilling final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/olympics/story/rebecca-cheptegeis-death-exposes-a-tragic-pattern-in-kenyan-athletics-community-2595875-2024-09-08",
      "headline": "Rebecca Cheptegei's death exposes a tragic pattern in Kenyan athletics communityMarathoner Rebecca Cheptegei, who competed in the Paris Olympics last month, was tragically set on fire by her boyfriend this week, according to police. This incident marks the fourth horrific killing of an Olympian in Kenya in the past three years. The rising statistics on domestic violence in Kenya underscore a troubling trend, with these tragedies bringing renewed global attention to the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/avesh-khans-response-after-chinnaswamy-erupts-with-rcb-chants-in-duleep-trophy-2595868-2024-09-08",
      "headline": "Avesh Khan's response after Chinnaswamy erupts with RCB chants in Duleep TrophyAvesh Khan gave a priceless response after the Chinnaswamy crowd started teasing him with the chants of 'RCB-RCB'. Avesh was representing India A in Duleep Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-beit-sadegh-controversy-disqualification-javelin-final-navdeep-singh-gold-2595863-2024-09-08",
      "headline": "Why Iran's Sadegh was disqualified from Paralympics javelin finalIran's Beit Sadegh won gold in Men's Javelin Throw F41 at the Paris Paralympics, only to be shockingly disqualified for a code violation, turning India's Navdeep Singh's silver into an unexpected gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sabalenka-wants-to-put-familys-name-in-tennis-history-after-us-open-triumph-2595854-2024-09-08",
      "headline": "Sabalenka wants to 'put family's name in tennis history' after US Open triumphAryna Sabalenka won her maiden US Open title as she beat Jessica Pegula 7-5, 7-5 in final at Flushing Meadows. She dedicated her triumph to her family who didn't give up on her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-eleven-schedule-india-pooja-ojha-caone-closing-ceremony-timings-2595849-2024-09-08",
      "headline": "Paralympics, Day 11: India's schedule and closing ceremony full detailsIndia's record-breaking performance at the Paris Paralympics 2024, with 29 medals, will be celebrated as the Games conclude. The final day and closing ceremony promise a fitting tribute to the athletes' incredible achievements and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-india-medal-tally-athletics-sumit-antil-navdeep-2595773-2024-09-08",
      "headline": "Paralympics: Record-breaking show of Indian track and field stars in ParisParalympics 2024: Indian athletics contingent put up a sensational show in the Paris Paralympics, by clinching 17 medals. The historic run was a massive step up for Indian track and field athletes who had won eight medals in the previous edition in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2022-virat-kohlis-1020-day-wait-for-71st-ton-ended-with-t20i-hundred-2595824-2024-09-08",
      "headline": "OTD in 2022: Virat Kohli's 1020-day wait for 71st ton ended with T20I hundredVirat Kohli notched up his maiden T20I hundred on this day in 2022. This also ended his 1020-day prolonged wait for his 71st century. Kohli scored 122 runs from 61 balls against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/watch-aryna-sabalenka-pops-champagne-as-she-celebrates-maiden-us-open-triumph-2595804-2024-09-08",
      "headline": "Watch: Aryna Sabalenka pops champagne as she celebrates maiden US Open triumphAryna Sabalenka popped the champagne and sprayed it all on her team in the dressing room as they celebrated Belarusian's US Open 2024 triumph. The World No. 2 beat USA's Jessica Pegula in a thrilling final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/navdeep-singh-javelin-throw-gold-paralympics-2024-video-2595801-2024-09-08",
      "headline": "Watch: Navdeep Singh's huge 47.32m throw that won him Paralympics gold Paris Paralympics 2024: India's Navdeep Singh bagged the gold medal with a throw of 47.32 metres in the men's javelin event on Saturday, September 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-day-eleven-schedule-india-pooja-ojha-caone-closing-ceremony-timings-2595849-2024-09-08",
      "headline": "Paralympics, Day 11: India's schedule and closing ceremony full detailsIndia's record-breaking performance at the Paris Paralympics 2024, with 29 medals, will be celebrated as the Games conclude. The final day and closing ceremony promise a fitting tribute to the athletes' incredible achievements and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-india-medal-tally-athletics-sumit-antil-navdeep-2595773-2024-09-08",
      "headline": "Paralympics: Record-breaking show of Indian track and field stars in ParisParalympics 2024: Indian athletics contingent put up a sensational show in the Paris Paralympics, by clinching 17 medals. The historic run was a massive step up for Indian track and field athletes who had won eight medals in the previous edition in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2022-virat-kohlis-1020-day-wait-for-71st-ton-ended-with-t20i-hundred-2595824-2024-09-08",
      "headline": "OTD in 2022: Virat Kohli's 1020-day wait for 71st ton ended with T20I hundredVirat Kohli notched up his maiden T20I hundred on this day in 2022. This also ended his 1020-day prolonged wait for his 71st century. Kohli scored 122 runs from 61 balls against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/watch-aryna-sabalenka-pops-champagne-as-she-celebrates-maiden-us-open-triumph-2595804-2024-09-08",
      "headline": "Watch: Aryna Sabalenka pops champagne as she celebrates maiden US Open triumphAryna Sabalenka popped the champagne and sprayed it all on her team in the dressing room as they celebrated Belarusian's US Open 2024 triumph. The World No. 2 beat USA's Jessica Pegula in a thrilling final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/navdeep-singh-javelin-throw-gold-paralympics-2024-video-2595801-2024-09-08",
      "headline": "Watch: Navdeep Singh's huge 47.32m throw that won him Paralympics gold Paris Paralympics 2024: India's Navdeep Singh bagged the gold medal with a throw of 47.32 metres in the men's javelin event on Saturday, September 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paralympics-simran-sharma-simran-sharma-medals-wrap-2595797-2024-09-08",
      "headline": "Simran, Navdeep Singh take India's medal tally to 29 Paralympics 2024: Simran Sharma bagged the bronze medal in the women's 200m T12 event while Navdeep Singh clinched gold in the men's javelin throw F41. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/never-give-up-speechless-aryna-sabalenka-basks-glory-us-open-crown-final-2595781-2024-09-08",
      "headline": "'Speechless' Aryna Sabalenka basks in glory after US Open crown US Open 2024: Aryna Sabalenka was over the moon after the hard yards she put in eventually paid dividends. On Saturday, the 26-year-old won the women's singles title after beating Jessica Pegula. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-noah-lyles-lewis-hamilton-aryna-sabalenka-jessica-pegula-final-2595777-2024-09-08",
      "headline": "Noah Lyles, Lewis Hamilton in star-studded attendance in women's finalUS Open 2024: Formula One star Lewis Hamilton and sprinter Noah Lyles watched the thrilling clash between Aryna Sabalenka and Jessica Pegula at the Arthur Ashe Stadium on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/us-open-aryna-sabalenka-jessica-pegula-final-report-2595778-2024-09-08",
      "headline": "Aryna Sabalenka wins maiden crown after outclassing Jessica PegulaUS Open 2024: Aryna Sabalenka won the women's singles title after beating Jessica Pegula 7-5, 7-5. The Belarusian bagged her third Grand Slam title, having also won back-to-back Australian Opens in 2023 and 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-ollie-pope-courageous-knock-michael-atherton-2595774-2024-09-08",
      "headline": "Ollie Pope played a courageous knock: Michael Atherton ENG vs SL: Michael Atherton was impressed with the knock Ollie Pope played in the third and final Test. Pope scored 154 runs as England have their noses ahead at the Kennington Oval in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-australia-max-purcell-jordan-thompson-men-doubles-title-2595772-2024-09-08",
      "headline": "Australia's Max Purcell, Jordan Thompson clinch men's doubles title US Open 2024: Max Purcell, Jordan Thompson from Australia won the men's doubles title after beating Germany's Kevin Krawietz and Tim Puetz in straight sets on Saturday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-live-updates-aryna-sabalenka-jessica-pegula-2595770-2024-09-08",
      "headline": "Women's Singles Final Highlights: Aryna Sabalenka beats feisty Jessica Pegula to win maiden crown US Open 2024 Women's Singles Final Live Updates: Aryna Sabalenka beat Jessica Pegula in straight sets to win her maiden singles title at Flushing Meadows. The Belarusian won 7-5, 7-5 in an hour and 53 minutes at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-3rd-test-day-2-report-ollie-pope-kamindu-mendis-2595763-2024-09-07",
      "headline": "Kamindu, de Silva keep Sri Lanka alive after early wickets in 3rd TestENG vs SL: Kamindu Mendis and captain Dhananjaya de Silva kept Sri Lanka alive in the third and final Test match of the series. At the end of Day 2's play, Sri Lanka remained afloat due to fifties from the duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-ollie-pope-courageous-knock-michael-atherton-2595774-2024-09-08",
      "headline": "Ollie Pope played a courageous knock: Michael Atherton ENG vs SL: Michael Atherton was impressed with the knock Ollie Pope played in the third and final Test. Pope scored 154 runs as England have their noses ahead at the Kennington Oval in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-australia-max-purcell-jordan-thompson-men-doubles-title-2595772-2024-09-08",
      "headline": "Australia's Max Purcell, Jordan Thompson clinch men's doubles title US Open 2024: Max Purcell, Jordan Thompson from Australia won the men's doubles title after beating Germany's Kevin Krawietz and Tim Puetz in straight sets on Saturday at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-live-updates-aryna-sabalenka-jessica-pegula-2595770-2024-09-08",
      "headline": "Women's Singles Final Highlights: Aryna Sabalenka beats feisty Jessica Pegula to win maiden crown US Open 2024 Women's Singles Final Live Updates: Aryna Sabalenka beat Jessica Pegula in straight sets to win her maiden singles title at Flushing Meadows. The Belarusian won 7-5, 7-5 in an hour and 53 minutes at the Arthur Ashe Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-3rd-test-day-2-report-ollie-pope-kamindu-mendis-2595763-2024-09-07",
      "headline": "Kamindu, de Silva keep Sri Lanka alive after early wickets in 3rd TestENG vs SL: Kamindu Mendis and captain Dhananjaya de Silva kept Sri Lanka alive in the third and final Test match of the series. At the end of Day 2's play, Sri Lanka remained afloat due to fifties from the duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/who-is-navdeep-indias-1st-paralympic-medallist-in-f41-category-2595757-2024-09-07",
      "headline": "Who is Navdeep? India's 1st Paralympic medallist in F41 categoryIndia's Navdeep Singh won the gold medal in the men's F41 javelin throw in the Paris Paralympics. Here's everything you need to know about him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-womens-200m-t12-final-simran-sharma-abhay-2595750-2024-09-07",
      "headline": "Paris 2024: Simran secures bronze in women's 200m T12 final with personal bestIndia's Simran Sharma secured a bronze in the women's 200m T12 final with a personal best performance on Saturday, September 7. Simran was able to get redemption after missing out a medal in the 100m event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-navdeep-singh-javelin-f41-silver-2595749-2024-09-07",
      "headline": "Navdeep wins historic gold medal in men's javelin F41 in ParisParalympics: India's Navdeep won India's 7th gold medal in Paris Paralympics on Saturday. After a late disqualification drama in the men's F41 javelin throw event, Navdeep's silver medal was upgraded to gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-bengaluru-fc-isl-long-raneg-pass-fan-2595725-2024-09-07",
      "headline": "Sunil Chhetri gifts football with pin-point long-range pass to fan in standsLegendary Indian footballer Sunil Chhetri made a fan's day during Bengaluru FC's training at the Kanteerava Stadium on Saturday, September 7. After the fans requested for the ball high up in the stands, Chhetri obliged with a sensational lofted pass that found the fan."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}