{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-explained-check-eligibility-deadline-and-penalties-for-updated-returns-2773383-2025-08-19",
      "headline": "ITR-U explained: Check eligibility, deadline, and penalties for updated returnsThe Central Board of Direct Taxes (CBDT) has made it simpler for taxpayers to correct errors in their income tax returns through the updated ITR-U. Here's a guide on who can file, the deadline, and possible penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-you-should-wait-until-october-for-big-purchases-explains-expert-2773330-2025-08-19",
      "headline": "Why you should wait until October for big purchases, explains expertIf you've been planning to buy a car, air conditioner, or other expensive items, it might be wise to hold off for a few weeks. Expert says waiting until October could save you money thanks to upcoming GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rising-today-explained-2773263-2025-08-19",
      "headline": "Explained: Why Ola Electric shares rose 7% in early tradeOla Electric's rising share price appears to be a result of renewed investor optimism, driven by the company's ambitious EV targets and gigafactory plans, but sustaining momentum will depend on market share recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-over-150-points-higher-nifty-above-24900-ril-jumps-nearly-2-2773238-2025-08-19",
      "headline": "Sensex, Nifty gain as GST reforms buzz keeps investor sentiment bullishAt 9:21 am, the S&P BSE Sensex climbed 150.78 points to 81,424.53, while the NSE Nifty50 gained 38.15 points to 24,915.10. Most broader market indices also traded in the green during early deals, indicating improved investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/next-generation-gst-reforms-will-reduce-tax-burden-boost-growth-chief-economic-advisor-2773229-2025-08-19",
      "headline": "Next-generation GST reforms will reduce tax burden, boost growth: CEAChief Economic Advisor Dr. V Anantha Nageshwaran said the GST overhaul, coupled with earlier tax cuts, will lower consumer costs, ease inflation, and boost disposable incomes, calling it a transformative step in India's eight-year tax reform journey"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-a-fake-income-tax-call-key-warning-signs-and-tips-to-protect-yourself-2772963-2025-08-18",
      "headline": "Received a fake income tax call? Key warning signs and tips to protect yourselfScammers are increasingly posing as income tax officials to trick people into sharing personal and financial information. If you receive a suspicious call during the filing season, it's important to stay calm and know the warning signs before taking any action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-job-unemployment-rate-drops-52-percent-july-festive-season-gst-cut-agriculture-economy-gdp-2772962-2025-08-18",
      "headline": "India's job market shows relief as unemployment rate falls to 5.2% in JulyThe jobless rate in rural areas for people aged 15 years and above fell to 4.4% in July from 4.9% in June. Seasonal demand for workers in agriculture and related activities supported this improvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-quicker-pf-access-here-are-the-updated-epfo-rules-2772871-2025-08-18",
      "headline": "Want quicker PF access? Here are the updated EPFO rulesUnder the updated rules, if your name, gender and date of birth match in both Aadhaar and UAN records, you no longer need EPFO approval to link the two."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-676-points-higher-nifty-above-24800-maruti-gains-9-percent-2772869-2025-08-18",
      "headline": "Sensex ends 676 points higher, Nifty above 24,800; Maruti gains 9%The S&P BSE Sensex gained 676.09 points to end at 81,273.75, while the NSE Nifty50 added 245.65 points to close at 24,876.95.  "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-gangsters-lokesh-kanagaraj-rkfi-2773384-2025-08-19",
      "headline": "Rajinikanth, Kamal Haasan reunite after 46 years as ageing gangsters: ReportsRajinikanth and Kamal Haasan are likely to join hands for director Lokesh Kanagaraj's next film. Reports are rife that this film will be a gangster drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-new-the-life-of-a-showgirl-vinyl-variants-sell-out-one-hour-2773342-2025-08-19",
      "headline": "Taylor Swift's new Showgirl vinyl variants sell out in less than an hourGlobal pop sensation Taylor Swift's new vinyl editions of The Life of a Showgirl sold out in under an hour, continuing her run of instant fan favourites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mithun-chakraborty-superstar-rajinikanth-nelson-dilipkumar-jailer-2-2773340-2025-08-19",
      "headline": "Exclusive: Mithun Chakraborty to join Superstar Rajinikanth in Jailer 2Mithun Chakraborthy has been roped in to play a pivotal role in Superstar Rajinikanth's 'Jailer 2'. The film is being directed by Nelson Dilipkumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thama-teaser-ayushmann-khurrana-rashmika-mandanna-next-promises-dark-bloody-love-story-2773338-2025-08-19",
      "headline": "Thama teaser: Ayushmann, Rashmika's next promises a dark and bloody love storyThe teaser of Ayushmann Khurrana and Rashmika Mandanna's next 'Thama' is out. The film is set to release on Diwali 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-reflects-on-ageing-says-even-putting-on-trousers-is-challenging-2773315-2025-08-19",
      "headline": "Amitabh Bachchan reflects on ageing, says even putting on trousers is challengingAmitabh Bachchan shared his experiences with ageing, highlighting the new challenges in performing everyday tasks that once came effortlessly. The actor is 82 years old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/food-poisoning-outbreak-dhurandhar-film-set-leh-crew-illness-2773319-2025-08-19",
      "headline": "Over 100 hospitalised due to food poisoning on Dhurandhar set in LehMore than 100 people fell ill due to food poisoning on the Dhurandhar film set in Leh. The incident raised concerns over food safety during large film productions and prompted an official investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-touches-rekha-feet-parineeta-event-2773314-2025-08-19",
      "headline": "Vidya Balan touches Rekha's feet at Parineeta event, wins hearts online. WatchBollywood actor Vidya Balan was present at the 'Parineeta' re-release event, which was also honoured by the presence of other celebrities such as Dia Mirza, Rekha, and Vidhu Vinod Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-2026-india-dates-announced-tickets-open-august-26-2773275-2025-08-19",
      "headline": "Lollapalooza 2026 India dates announced, tickets open August 26Lollapalooza India is back in Mumbai for its fourth edition in January 2026. The festival promises nonstop music and exciting performances, drawing fans nationwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-box-office-collection-day-5-rajinikanth-sees-drop-rs-400-crore-opening-weekend-2773301-2025-08-19",
      "headline": "Coolie box office Day 5: Rajinikanth film sees drop after Rs 400 crore openingSuperstar Rajinikanth's 'Coolie' raked in over Rs 400 crore in its opening weekend. On its first Monday in theatres, it witnessed an expected drop in numbers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/achyut-potdar-passes-away-aged-91-iconic-3-idiots-actor-thane-2773268-2025-08-19",
      "headline": "Achyut Potdar, veteran actor and 3 Idiots professor, dies at 91Veteran actor Achyut Potdar died at 91 in Thane. He is known for his iconic role in '3 Idiots' and a prolific career in Hindi and Marathi cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-chemistry-us-india-day-parade-2773256-2025-08-19",
      "headline": "Vijay Deverakonda, Rashmika Mandanna's chemistry is unmissable from US event. WatchVijay Deverakonda and Rashmika Mandanna couldn't take their eyes off each other at the US event. After taking part in the India Day Parade, they attended another event in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/zakir-khan-brings-proud-parents-video-call-madison-square-garden-show-2773237-2025-08-19",
      "headline": "Zakir Khan brings proud parents on video call at sold-out Madison Square Garden showStand-up comedian Zakir Khan made history as the first Indian comedian to headline a Hindi stand-up show at Madison Square Garden, performing to a packed audience of 6,000 people.  He sweetly video called his parents to show the audience turn-out for his show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/zakir-khan-conquers-madison-square-with-hindi-comedy-hasan-minhaj-calls-it-historic-2773231-2025-08-19",
      "headline": "Zakir Khan rocks Madison Square with Hindi comedy. Hasan Minhaj calls it historicZakir Khan created history as the first Indian comedian to headline a Hindi stand-up special at New York's Madison Square Garden, performing to a sold-out crowd. From Hasan Minhaj to Munawar Faruqui, fellow comedians rallied behind him in support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-self-worth-social-media-validation-loreal-paris-video-2773198-2025-08-19",
      "headline": "Look beyond likes, comments: Aishwarya Rai's powerful message on self-worthAishwarya Rai rejected social media validation and advocated self-worth in a powerful L'oreal Paris video. She emphasised the importance of inner validation over social media approval.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/parineeta-premiere-2773097-2025-08-18",
      "headline": "Parineeta premiere: Vidya Balan, Rekha, Dia Mirza dazzle at re-release eventThe red-carpet event of producer-director Vidhu Vinod Chopra's 'Parineeta' witnessed the reunion of the film's team. Actors Vidya Balan, Rekha and Dia Mirza were among the attendees who were present at the screening.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/darshan-wife-vijayalakshmi-manages-social-media-amid-legal-troubles-2773065-2025-08-18",
      "headline": "Actor Darshan's wife takes over his social media, says he will be back soonKannada actor Darshan, whose bail was recently revoked by the Supreme Court, was arrested on August 14. Darshan's wife Vijayalakshmi, who is now handling his social media accounts, shared a message for the actor's fans after his arrest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ian-mckellen-gandalf-frodo-return-the-hunt-for-gollum-lord-of-the-rings-andy-serkis-2772979-2025-08-18",
      "headline": "Sir Ian McKellen hints at Gandalf, Frodo Baggins return in The Hunt for GollumVeteran actor Sir Ian Mckellen recently opened up about the upcoming 'The Lord of the Rings' movie 'The Hunt for Gollum'. He also hinted at the return of important characters in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sahher-bambba-bads-of-bollywood-aryan-khan-directorial-debut-netflix-2773047-2025-08-18",
      "headline": "Who is Sahher Bambba? Know all about the Bads of Bollywood actorActor Sahher Bambba is set to play a key role in Aryan Khan's directorial debut series 'The Bads of Bollywood'. Ahead of its Netflix premiere, here's everything you need to know about the actor, her debut movie, previous projects and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elvish-yadav-shares-update-firing-at-gurugram-home-family-is-safe-2773045-2025-08-18",
      "headline": "My family and I are safe: Elvish Yadav shares update after firing at Gurugram homeYouTuber and 'Bigg Boss OTT 2' winner Elvish Yadav shared an update after firing outside his Gurugram home. He assured that his family is safe. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-heavy-rains-waterlogging-imd-red-alert-bmc-school-offices-holiday-work-from-home-2773291-2025-08-19",
      "headline": "Relentless rain cripples Mumbai; roads submerged, over 250 flights delayed Live UpdatesAccording to Flightradar, 155 outbound and 102 inbound flights at Mumbai Airport were delayed, while Central Railway trains ran 20-30 minutes late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-ties-ajit-doval-beijing-visit-ladakh-standoff-wang-yi-xi-jinping-modi-2773380-2025-08-19",
      "headline": "Setbacks of last few years not in our interest: Wang Yi at meeting with Ajit DovalSpeaking in New Delhi during the 24th round of Special Representative Level Talks on the boundary question, he noted that the October 2024 meeting between President Xi Jinping and Prime Minister Narendra Modi in Kazan had provided direction for the development of bilateral relations and given fresh impetus to efforts at resolving boundary issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rjd-leader-tejashwi-yadav-says-will-work-to-make-rahul-gandhi-prime-minister-during-next-lok-sabha-polls-2773391-2025-08-19",
      "headline": "Will work to make Rahul Gandhi PM next time: Tejashwi Yadav's big remarkRJD leader Tejashwi Yadav says will work to make Rahul Gandhi Prime Minister during next Lok Sabha polls"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-sellout-of-ukraine-lessons-for-india-china-and-the-world-2773271-2025-08-19",
      "headline": "Trump's sellout of Ukraine: Lessons for India, China and the WorldDonald Trump's Ukraine strategy marks a dangerous shift in US leadership, undermining global credibility, emboldening aggressors, and unsettling allies from Europe to India.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/super-301-and-us-tariff-india-china-trade-sanctions-japan-history-of-sudden-explained-trade-act-1974-trump-2773107-2025-08-19",
      "headline": "The ghost of Super 301: Why US trade wrath always finds IndiaWhat started as President Trump's trade campaign against China seems now to be focused on India. This has a strange echo from 35 years ago, when the US started out to target Japan, its economic rival, with the Super 301 but ended up with India in its crosshairs. This is how the governments of Rajiv Gandhi and VP Singh reacted then."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-marwari-go-back-campaign-parking-dispute-sparks-protests-activists-accuse-traders-bjp-leaders-defend-community-2773318-2025-08-19",
      "headline": "Parking clash sparks 'Marwari Go Back' protest in Telangana, BJP defends communityA parking dispute in Secunderabad has triggered \"Marwari Go Back\" campaign in Telangana. Locals accuse Marwari and Gujarati traders of harming livelihoods, while BJP leaders defend the community and allege political motives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-ties-trump-trade-deal-tariffs-damage-already-done-fareed-zakaria-2773324-2025-08-19",
      "headline": "Damage already done: Fareed Zakaria on downturn in India-US ties under TrumpGeopolitical expert Fareed Zakaria emphasised that imposing the highest tariffs on India while deepening its ties with Pakistan was the 'biggest foreign policy mistake' by Trump 2.0."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-gangsters-lokesh-kanagaraj-rkfi-2773384-2025-08-19",
      "headline": "Rajinikanth, Kamal Haasan reunite after 46 years as ageing gangsters: ReportsRajinikanth and Kamal Haasan are likely to join hands for director Lokesh Kanagaraj's next film. Reports are rife that this film will be a gangster drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-delhis-stray-dogs-belong-to-its-lanes-2772926-2025-08-18",
      "headline": "Why Delhi's stray dogs belong to its lanesMass relocation of strays risks overcrowding, disease and eroded emotional bonds. The way forward is humane solutions grounded in sterilisation and community care"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjd-mp-sulata-deo-rape-death-threat-mahindra-group-employee-facebook-2773385-2025-08-19",
      "headline": "Mahindra employee threatens BJD MP with rape on Facebook, firm orders probeThe BJD MP shared screenshots of the threats issued by the Mahindra Group employee in a post on X, tagging Prime Minister Narendra Modi and Amit Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-urges-opposition-to-support-nda-pick-cp-radhakrishnan-as-vice-president-2773308-2025-08-19",
      "headline": "PM urges Opposition to support CP Radhakrishnan for Vice President postUrging all parties to unanimously back the NDA candidate, PM Modi said that CP Radhakrishnan was an excellent choice for the Vice President post, had led a life without controversy, and was a very humble person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/terrifying-video-shows-car-crashing-into-influencers-mid-food-review-at-us-eatery-2773283-2025-08-19",
      "headline": "Terrifying video shows car crashing into influencers mid-food review at US eateryHouston-based influencers Nina Santiago and fellow content creator Patrick Blackwood were in the middle of filming a food review when an SUV plowed through the front wall of the restaurant where they were seated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyys-charm-offensive-meeting-trump-with-poise-and-a-plan-2773227-2025-08-19",
      "headline": "Zelenskyy's charm offensive: Meeting Trump with poise and a planAfter February's tense Oval Office clash - with JD Vance rebuking his gratitude and Donald Trump mocking his fatigues - Volodymyr Zelenskyy returned suited up, opening with a cascade of thanks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/achyut-potdar-passes-away-aged-91-iconic-3-idiots-actor-thane-2773268-2025-08-19",
      "headline": "Achyut Potdar, veteran actor and 3 Idiots professor, dies at 91Veteran actor Achyut Potdar died at 91 in Thane. He is known for his iconic role in '3 Idiots' and a prolific career in Hindi and Marathi cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/your-brains-not-working-alone-your-bodys-been-in-on-it-the-whole-time-2773194-2025-08-19",
      "headline": "Your brain's not working alone - your body's been in on it the whole timeTurns out, thinking isn't just in your head. Literally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-action-cec-ecs-vote-chori-claims-india-bloc-forms-government-bihar-2773165-2025-08-19",
      "headline": "We'll take action against you once we're in power: Rahul Gandhi to top 3 election officersCongress MP Rahul Gandhi said that he will initiate action against the Chief Election Commissioner and the two Election Commissioners over 'vote chori' (vote theft) if the INDIA bloc forms the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-arrangements-underway-for-zelenskyy-putin-meeting-after-white-house-peace-talks-2773181-2025-08-19",
      "headline": "Possibility of peace: Trump says working to arrange Zelenskyy, Putin meetingUS President Donald Trump said he has begun arranging a meeting between Volodymyr Zelenskyy and Vladimir Putin after White House talks with European leaders, calling it an \"early step\" toward ending the war."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-drunk-autorickshaw-driver-drags-woman-cop-trying-to-stop-him-in-satara-2773240-2025-08-19",
      "headline": "Video: Drunk autorickshaw driver drags woman cop trying to stop him in MaharashtraCCTV footage of the incident showed the autorickshaw dragging the constable along the road while onlookers tried to stop the accused. She eventually fell and sustained injuries. The constable is undergoing treatment at a private hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-narendra-modis-expressway-push-is-redrawing-indias-urban-map-2772929-2025-08-18",
      "headline": "How Narendra Modi's expressway push is redrawing India's urban map\"Development our fate... one milestone at a time,\" said PM Modi while inaugurating the Dwarka Expressway and the Urban Extension Road-II in Delhi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-launches-chatgpt-go-plan-in-india-at-rs-399-indian-exclusive-and-you-can-pay-for-it-with-upi-2773264-2025-08-19",
      "headline": "OpenAI launches ChatGPT Go in India at Rs 399, you can pay for it with UPIOpenAI has introduced a new subscription plan in India called ChatGPT Go. It is priced at Rs 399 per month. The plan is being rolled out as an India-only option and can also be purchased through UPI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-live-updates-shubman-agarkar-shubman-gill-2773205-2025-08-19",
      "headline": "Asia Cup 2025 squad Live: Suryakumar reaches BCCI headquartersIndia Asia Cup 2025 squad announcement Live Updates: Mumbai rains are likely to delay the press conference. It has been raining no stop in Mumbai, which is expected to hamper the proceedings at the BCCI office."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-weather-today-mumbai-thane-rain-raigad-red-alert-traffic-school-shut-live-updates-2772704-2025-08-18",
      "headline": "Live: Rain paralyses Mumbai, Harbour Line services suspended as tracks submergeMumbai Weather Live Updates: With rains showing no sign of letting up in Mumbai, a very heavy downpour has been forecast for the city today, while several areas in Maharashtra, including Nanded and Sambhaji Nagar, have already reported flooding.\r\n\r\nSeveral areas across Mumbai are reporting waterlogging, with visuals showing streets submerged at Gandhi Market in Sion. Follow the blog for live updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-gangsters-lokesh-kanagaraj-rkfi-2773384-2025-08-19",
      "headline": "Rajinikanth, Kamal Haasan reunite after 46 years as ageing gangsters: ReportsRajinikanth and Kamal Haasan are likely to join hands for director Lokesh Kanagaraj's next film. Reports are rife that this film will be a gangster drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mithun-chakraborty-superstar-rajinikanth-nelson-dilipkumar-jailer-2-2773340-2025-08-19",
      "headline": "Exclusive: Mithun Chakraborty to join Superstar Rajinikanth in Jailer 2Mithun Chakraborthy has been roped in to play a pivotal role in Superstar Rajinikanth's 'Jailer 2'. The film is being directed by Nelson Dilipkumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thama-teaser-ayushmann-khurrana-rashmika-mandanna-next-promises-dark-bloody-love-story-2773338-2025-08-19",
      "headline": "Thama teaser: Ayushmann, Rashmika's next promises a dark and bloody love storyThe teaser of Ayushmann Khurrana and Rashmika Mandanna's next 'Thama' is out. The film is set to release on Diwali 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-reflects-on-ageing-says-even-putting-on-trousers-is-challenging-2773315-2025-08-19",
      "headline": "Amitabh Bachchan reflects on ageing, says even putting on trousers is challengingAmitabh Bachchan shared his experiences with ageing, highlighting the new challenges in performing everyday tasks that once came effortlessly. The actor is 82 years old. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-contracts-babar-rizwan-shaheen-2773375-2025-08-19",
      "headline": "PCB drops Babar Azam and Rizwan from top contracts in 2025-26The Pakistan Cricket Board has reshuffled its central contracts for 2025-26. They have taken the big decision of demoting star players Babar Azam and Mohammad Rizwan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-iga-swiatek-cincinnati-open-us-open-video-2773358-2025-08-19",
      "headline": "Watch: Alcaraz, Swiatek fly together to US Open after Cincinnati Open winCarlos Alcaraz and Iga Swiatek, fresh from their Cincinnati Open triumphs, boarded a private jet together to New York for the US Open. Alcaraz teams up with Emma Raducanu, while Swiatek partners Casper Ruud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-record-inter-miami-mls-barcelona-2773354-2025-08-19",
      "headline": "Barca, Argentina and now Miami: Messi's record-breaking spree continuesLionel Messi has become the leading goal scorer and assist provider in Inter Miami history. With a goal and an assist against LA Galaxy, Messi etched his name in football history with a unique record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sinquefield-cup-praggnanandhaa-climbs-world-no-3-spot-beating-d-gukesh-2773335-2025-08-19",
      "headline": "Praggnanandhaa climbs to World No. 3 after beating Gukesh at Sinquefield CupIndian Grandmaster R Praggnanandhaa has risen to a career-best world No. 3 in the live FIDE ratings following a stunning victory over world champion D Gukesh in the opening round of the Sinquefield Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-odi-world-cup-india-squad-updates-harmanpreet-kaur-smriti-mandhana-2773298-2025-08-19",
      "headline": "Women's World Cup squad announcement LIVE: Will Shafali, Renuka be included?Women's ODI World Cup 2025 Live Updates: Chief selector Neetu David will name the squad later on Tuesday for the World Cup and the ODI series against Australia. The focus will be on whether Shafali Verma and Renuka Singh get picked in the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-injury-ruled-out-south-africa-australia-odi-series-2773280-2025-08-19",
      "headline": "South Africa pacer Kagiso Rabada ruled out of Australia ODIsSouth Africa will be without fast bowler Kagiso Rabada for the One-Day International (ODI) series against Australia, which begins on 19 August. The 30-year-old pacer has been ruled out due to inflammation in his right ankle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-rinku-singh-form-dip-2773254-2025-08-19",
      "headline": "Asia Cup: Is Rinku Singh no more India's trusted T20I finisher?Rinku Singh, once hailed as India's next big T20 finisher, has seen his form dip sharply over the past year. Struggling both internationally and in the IPL, the once fearless stroke-maker now faces uncertainty over his place in India's Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/navdeep-saini-on-rcb-virat-kohli-gautam-gambhir-exclusive-2773156-2025-08-19",
      "headline": "Navdeep Saini targets IPL return, silences Gautam Gambhir's criticsHaving last played for India in 2021, Navdeep Saini remains determined to make a comeback to the national side. The fire still burns bright in his eyes, and his immediate goal is to earn a place in the Royal Challengers Bangalore squad for IPL 2026. To that end, the fast bowler is putting in the hard yards, aiming to impress with a stellar performance for the East Delhi Riders in the Delhi Premier League 2025 (DPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-cincinnati-open-title-sinner-retires-illness-2773228-2025-08-19",
      "headline": "Carlos Alcaraz shows class after Cincinnati win, wishes Sinner a speedy recoveryAfter winning his first Cincinnati title, Carlos Alcaraz wished Jannik Sinner—who retired on Monday due to illness—a speedy recovery ahead of the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-mixed-doubles-format-live-stream-criticism-explained-2773211-2025-08-19",
      "headline": "Explained: What's the buzz about US Open mixed doubles tournamentThe 2025 US Open Mixed Doubles will debut a two-day fast-track format with 16 teams and record 1 million US dollars prize money for the winners. The changes, however, have sparked backlash from doubles specialists who say the format disrespects tradition and reduces the event to an exhibition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-rinku-singh-form-dip-2773254-2025-08-19",
      "headline": "Asia Cup: Is Rinku Singh no more India's trusted T20I finisher?Rinku Singh, once hailed as India's next big T20 finisher, has seen his form dip sharply over the past year. Struggling both internationally and in the IPL, the once fearless stroke-maker now faces uncertainty over his place in India's Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/navdeep-saini-on-rcb-virat-kohli-gautam-gambhir-exclusive-2773156-2025-08-19",
      "headline": "Navdeep Saini targets IPL return, silences Gautam Gambhir's criticsHaving last played for India in 2021, Navdeep Saini remains determined to make a comeback to the national side. The fire still burns bright in his eyes, and his immediate goal is to earn a place in the Royal Challengers Bangalore squad for IPL 2026. To that end, the fast bowler is putting in the hard yards, aiming to impress with a stellar performance for the East Delhi Riders in the Delhi Premier League 2025 (DPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-cincinnati-open-title-sinner-retires-illness-2773228-2025-08-19",
      "headline": "Carlos Alcaraz shows class after Cincinnati win, wishes Sinner a speedy recoveryAfter winning his first Cincinnati title, Carlos Alcaraz wished Jannik Sinner—who retired on Monday due to illness—a speedy recovery ahead of the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-mixed-doubles-format-live-stream-criticism-explained-2773211-2025-08-19",
      "headline": "Explained: What's the buzz about US Open mixed doubles tournamentThe 2025 US Open Mixed Doubles will debut a two-day fast-track format with 16 teams and record 1 million US dollars prize money for the winners. The changes, however, have sparked backlash from doubles specialists who say the format disrespects tradition and reduces the event to an exhibition."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}