{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/elon-musks-starlink-gets-licence-from-telecom-ministry-2736847-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence from telecom ministryElon Musk's Starlink has received a crucial licence from India's telecom ministry, paving the way for its satellite internet services in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in India: ReportStarlink had applied for the licence back in 2022, but the process was delayed due to various concerns, including national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-over-700-points-nifty-goes-past-25000-rbi-mpc-rate-cut-bajaj-finance-gains-5-percent-2736785-2025-06-06",
      "headline": "Sensex jumps over 700 points, Nifty goes past 25,000; Bajaj Finance gains 5%The S&P BSE Sensex jumped 746.95 points to end at 82,188.99, while the NSE Nifty50 gained 252.15 points to close at 25,003.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-donald-trump-double-tariff-steel-aluminium-india-trade-export-impact-expert-view-2736782-2025-06-06",
      "headline": "US doubles steel, aluminium tariff: Is it a big worry for India?The tariff hike does not apply to all countries. The United Kingdom has been excluded because of a trade agreement already in place with the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-rate-cut-may-hurt-fds-interest-rate-heres-what-investors-should-do-now-mpc-meeting-repo-rate-reduction-crr-phased-cut-2736729-2025-06-06",
      "headline": "RBI rate cut may hurt FDs. Here's what investors should do nowBanks have already begun adjusting their FD rates downward following the RBI's earlier moves since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-wants-to-make-babies-with-dua-lipa-sparks-online-outrage-2737280-2025-06-07",
      "headline": "Badshah says he wants to make babies with Dua Lipa, sparks online outrageRapper Badshah is facing backlash online following his comment about Albanian singer Dua Lipa. In a recent post on X, the rapper expressed his desire to \"have babies with her,\" sparking widespread criticism and trolling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ye-maaya-chesave-tattoo-linked-to-naga-chaitanya-2737261-2025-06-07",
      "headline": "Samantha removes her Ye Maaya Chesave tattoo linked to ex Naga ChaitanyaFans are convinced that Samantha has removed all tattoos linked to her ex, Naga Chaitanya. In her latest post, the 'Ye Maaya Chesave' tattoo appears to be missing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ekta-kapoor-balaji-telefilms-netflix-collaboration-2737252-2025-06-07",
      "headline": "Ekta Kapoor collaborates with Netflix, fans say dhoom tana meets TudumNetflix and Ekta Kapoor's Balaji Telefilms have announced a long-term partnership to create fresh, culturally rooted content for streaming audiences. The collaboration was announced on Saturday, June 7th. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/filmmaker-manish-gupta-held-for-stabbing-his-driver-over-salary-dispute-2737228-2025-06-07",
      "headline": "Case against filmmaker Manish Gupta for stabbing his driver over salary disputeFilmmaker Manish Gupta, known for directing films like 'One Friday Night' and '420 IPC', has been detained for allegedly stabbing his driver following a dispute over salary. The complaint was registered at the Versova Police Station.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jamiee-lee-curtis-lindsay-lohan-freakier-friday-eyes-august-release-in-india-2737224-2025-06-07",
      "headline": "Jamiee Lee Curtis, Lindsay Lohan's Freakier Friday eyes August release in IndiaThe trailer for 'Freakier Friday' has been released in India, featuring Lindsay Lohan and Jamie Lee Curtis reprising their roles from the 2003 hit. This time, the body-swapping chaos extends beyond mother and daughter duo to the next generation as well.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-joins-allu-arjun-for-atlees-sci-fi-action-film-aa22xa6-2737182-2025-06-07",
      "headline": "Deepika Padukone joins Allu Arjun for Atlee's sci-fi action film AA22xA6Deepika Padukone has joined Atlee and Allu Arjun's upcoming film 'AA22xA6'. The makers announced the news on Jun 7 with a special video.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tulsi-to-anupamaa-tv-leading-ladies-take-the-lead-in-pay-parity-battle-cinematic-saturday-2736714-2025-06-07",
      "headline": "TV's leading ladies take the lead in pay parity battleFrom Tulsi to Anupamaa, television's leading ladies aren't just winning hearts, they're rewriting the rules of the game. From topping the TRP and remuneration list, read how women have brought revolution with their popularity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shoaib-ibrahim-dipika-kakar-cancer-out-of-icu-2737170-2025-06-07",
      "headline": "Shoaib Ibrahim shares Dipika Kakar's health update, says she is stable, out of ICUActor Dipika Kakar underwent a 14-hour surgery for stage 2 liver cancer and is now out of the ICU, confirmed husband-actor Shoaib Ibrahim. He shared that her condition is improving and thanked fans for their prayers during this difficult time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-day-2-kamal-haasan-film-earnings-2737160-2025-06-07",
      "headline": "Thug Life box office Day 2: Kamal Haasan's film sees sharp drop, earns Rs 7.5 croreKamal Haasan's 'Thug Life' saw a sharp drop at the box office on Day 2, earning Rs 7.5 crore nett across all languages. The film performed well in Tamil Nadu but struggled in Hindi and Telugu markets, with no release in Karnataka affecting its overall reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-collection-akshay-kumar-riteish-deshmukh-abhishek-bachchan-film-2737146-2025-06-07",
      "headline": "Housefull 5 box office Day 1: Akshay Kumar's film surpasses Fighter on opening dayAkshay Kumar's 'Housefull 5' had a strong opening at the box office, earning Rs 23 crore nett on Day 1. It outperformed 'Sky Force', 'Fighter', and even the previous instalment 'Housefull 4' in first-day collections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-ranbir-kapoor-kiran-rao-at-sitaare-zameen-par-musical-night-2737130-2025-06-07",
      "headline": "Aamir Khan hosts Sitaare Zameen Par musical night, Ranbir Kapoor, Kiran Rao attendAamir Khan recently hosted a starry musical evening to celebrate his upcoming film 'Sitaare Zameen Par', featuring debut actors and surprise guest Ranbir Kapoor. The film, a spiritual successor to 'Taare Zameen Par', introduces fresh talent and promises an emotional, heartfelt story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/hina-khan-rocky-emotional-wedding-vows-have-promise-of-universe-amid-uncertainties-2736989-2025-06-06",
      "headline": "Hina-Rocky's emotional wedding vows have promise of universe amid uncertaintiesHina Khan shared a heartwarming video of her wedding vows with husband Rocky Jaiswal. The couple got married on June 4, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/shweta-tripathi-on-turning-producer-with-theatre-play-cock-2736942-2025-06-06",
      "headline": "Shweta Tripathi on turning producer with Cock: I am hungry to act, not greedyActor Shweta Tripathi has turned producer with her banner, AllMyTea Productions. In an interview with India Today, she speaks about backing the queer-themed play 'Cock' and portrayal of LGBTQI+ community in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-reveals-91-year-old-mother-zeenat-to-make-debut-sitaare-zameen-par-2736961-2025-06-06",
      "headline": "Aamir Khan reveals his mother will make her debut in Sitaare Zameen ParBollywood superstar Aamir Khan recently broke the news about his mother Zeenat Khan's guest appearance in RS Prasanna's 'Sitaare Zameen Par'. This is the first time Zeenat will be seen in his film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shweta-basu-prasad-reinvention-acting-pankaj-tripathi-criminal-justice-season-4-2736795-2025-06-06",
      "headline": "Shweta Basu Prasad says she is scared of repeating herself as an actorActor Shweta Basu Prasad opens up about her evolving acting choices and experience with Pankaj Tripathi in 'Criminal Justice'. She highlights the importance of reinvention and chemistry to keep storytelling fresh and engaging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-sanjay-dutt-star-power-arabic-thriller-7-dogs-teaser-2736924-2025-06-06",
      "headline": "7 Dogs teaser: Salman Khan, Sanjay Dutt's powerful cameos light up Arabic thrillerSalman Khan and Sanjay Dutt featured in the power-packed teaser of the Arabic film '7 Dogs.' The video has sparked major excitement among Indian fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dhanush-to-play-an-iaf-officer-in-tere-ishk-mein-pics-from-sets-spark-buzz-2736775-2025-06-06",
      "headline": "Dhanush to play an IAF officer in Tere Ishk Mein? Pics from sets spark buzzA new look of actor Dhanush has been shared from his upcoming film 'Tere Ishk Mein'. He will be sharing screen space with Kriti Sanon in the Aanand L Rai film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/preity-zinta-emotional-note-after-pbks-ipl-loss-says-will-come-back-to-finish-the-job-2736857-2025-06-06",
      "headline": "Will come back to finish the job: Preity Zinta's emotional note after PBKS IPL lossPreity Zinta has written an emotional note after her team PBKS lost the IPL final against RCB. The actor thanked fans for their support and said this year was unique."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-uncomfortable-urination-scene-shaitaan-had-to-be-authentic-2736791-2025-06-06",
      "headline": "R Madhavan recalls uncomfortable scene from Shaitaan: Had to be authenticActor R Madhavan recently recalled feeling uncomfortable while shooting the urination scene in 'Shaitaan'. The actor admitted that he tried to remain authentic despite the discomfort."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-deletes-post-claiming-trump-is-named-in-epstein-files-2737283-2025-06-07",
      "headline": "Elon Musk deletes post claiming Trump is named in Epstein filesLast month, Elon Musk quit the Department of Government Efficiency (DOGE) and has been at loggerheads with Donald Trump over the \"big, beautiful bill\" (spending bill)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-to-steal-election-congress-rahul-gandhi-claims-match-fixing-in-maharashtra-assembly-polls-2024-attacks-bjp-2737193-2025-06-07",
      "headline": "Rahul Gandhi claims BJP rigged Maharashtra polls, gets 'Soros playbook' replyPosting his op-ed titled 'Match-Fixing Maharashtra' on X, Rahul Gandhi gave a step-by-step account of how he believes the Assembly election results were rigged, calling it 'How to steal an election?' Terming it 'straight out of George Soros' playbook,' BJP's Amit Malaviya said it was a ploy by the Congress leader to 'systematically erode people's faith in their own institutions.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-cctv-footage-whirt-shirt-clue-deepen-mystery-of-indore-couple-missing-shillong-meghalaya-2737168-2025-06-07",
      "headline": "New CCTV clip, shirt clue deepen mystery around Indore couple's fateIn the CCTV footage, Sonam is seen taking off her jacket and fixing her hair. Moments later, Raja comes out, takes a few things out of the suitcase, and hands them over to Sonam. The white shirt Sonam is seen wearing in the CCTV footage was later found near Raja's body. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-waits-45-minutes-at-jalgaon-airport-as-pilot-denies-late-takeoff-relief-for-kidney-patient-2737262-2025-06-07",
      "headline": "Pilot refuses takeoff, Eknath Shinde waits. Then, a life-saving twistFollowing a 45-minute-long closed-door discussion with ministers Girish Mahajan, Gulabrao Patil, and district administration officials trying to convince the pilot, the flight eventually took off. However, in a fated turn of events, Shinde's delayed arrival at Jalgaon airport turned out to be a boon for a woman who urgently needed to reach Mumbai for emergency kidney treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tulsi-to-anupamaa-tv-leading-ladies-take-the-lead-in-pay-parity-battle-cinematic-saturday-2736714-2025-06-07",
      "headline": "TV's leading ladies take the lead in pay parity battleFrom Tulsi to Anupamaa, television's leading ladies aren't just winning hearts, they're rewriting the rules of the game. From topping the TRP and remuneration list, read how women have brought revolution with their popularity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/partners-must-understand-indias-zero-tolerance-on-terror-jaishankar-in-uk-talks-2737276-2025-06-07",
      "headline": "Partners must understand India's zero-tolerance on terror: Jaishankar in UK talksThe comments come amid India's concern over some countries drawing parallels between India and Pakistan following their recent four-day military standoff. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/helicopter-emergency-landing-road-uttarakhand-crushed-car-2737282-2025-06-07",
      "headline": "Video: Helicopter makes emergency landing on Uttarakhand road, tail crushes carA private helicopter made an emergency landing in Uttarakhand due to a technical fault shortly after takeoff to Kedarnath. All passengers are safe; the pilot sustained minor injuries.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-mens-singles-final-carlos-alcaraz-vs-jannik-sinner-key-stats-roland-garros-2737267-2025-06-07",
      "headline": "Sinner vs Alcaraz French Open final set to be historic as big 3 era slowly endsJannik Sinner and Carlos Alcaraz are all set to create history at the French Open 2025 when they face off in the final on Sunday, June 8. Alcaraz will be aiming to defend his title while Sinner will look to claim his first crown at Roland Garros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-wants-to-make-babies-with-dua-lipa-sparks-online-outrage-2737280-2025-06-07",
      "headline": "Badshah says he wants to make babies with Dua Lipa, sparks online outrageRapper Badshah is facing backlash online following his comment about Albanian singer Dua Lipa. In a recent post on X, the rapper expressed his desire to \"have babies with her,\" sparking widespread criticism and trolling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-raj-thackeray-reunion-buzz-maha-vikas-aghadi-alliance-bjp-eknath-shinde-2737263-2025-06-07",
      "headline": "Thackeray cousins patch-up buzz grows, MVA allies root for tie-upSpeculation is mounting over a potential reconciliation between estranged cousins Uddhav Thackeray and Raj Thackeray. NCP(SP) MP Supriya Sule welcomed the prospect of a reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-metro-passenger-shares-pic-of-huge-crowd-at-hauz-khas-station-reddit-post-goes-viral-2737171-2025-06-07",
      "headline": "Delhi Metro passenger shares pic of huge crowd at Hauz Khas station, Internet reactsA photo of a packed Hauz Khas Metro Station, posted by a Delhi Metro passenger, has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-nda-seat-sharing-formula-jdu-bjp-ljp-nitish-kumar-chirag-paswan-ham-caste-survey-2737163-2025-06-07",
      "headline": "JDU may edge out BJP in Bihar seat-sharing deal; good news for Chirag PaswanFor the 243-member Bihar assembly, the equation is expected to shift slightly in favour of the JD(U), with sources indicating that Nitish Kumar's party may contest on 102 to 103 seats, while the BJP is likely to field candidates in fewer constituencies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/india-circus-memories-fading-animal-bans-digital-age-entertainment-2737208-2025-06-07",
      "headline": "Parrots on bicycles, tigers in the ring, and a thousand claps: India's lost circus charmPopcorn, painted clowns, and the roar of lions -- once the highlight of a child's year, the circus was more than just a show. It was an event etched in the collective memory of Indian households. Until it quietly disappeared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/starlink-launch-in-india-what-it-means-for-internet-access-and-free-services-as-musk-takes-on-jio-airtel-2737175-2025-06-07",
      "headline": "Starlink launch in India: What it means for internet access and free servicesElon Musk-owned Starlink, the satellite communication company, is set to enter India. Starlink aims to deliver high-speed internet in places with no network. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-novak-djokovic-touches-court-roland-garros-farewell-2737203-2025-06-07",
      "headline": "Watch: Emotional Novak Djokovic touches clay court in potential French Open farewellAn emotional Novak Djokovic touched the clay court at Roland Garros, hinting at a potential French Open farewell after his semi-final loss to Jannik Sinner on Friday, June 6. Djokovic said he was unsure of returning for the tournament next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/truck-rams-tejashwi-yadav-convoy-as-he-stops-for-tea-he-escapes-cops-injured-in-bihar-vaishali-2737232-2025-06-07",
      "headline": "Truck rams Tejashwi Yadav's convoy as he stops for tea, he escapes; 3 cops injuredA speeding truck rammed into Tejashwi Yadav's convoy, injuring three security personnel, while Yadav narrowly escaped the crash that occurred just five feet away on the Patna-Muzaffarpur highway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/not-just-a-bag-it-is-the-og-birkin-made-for-jane-birkin-going-on-sale-2736874-2025-06-07",
      "headline": "Not just a bag, it is the OG Birkin set to go on saleThe 'It' bag — the original Hermès Birkin — is all set to be auctioned this July. Here's a look back at its origin story, the hype, and the history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-494-06-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-reaction-d-gukesh-arjun-erigaisi-2737241-2025-06-07",
      "headline": "D Gukesh unlikely to replicate my dominance at the moment: Magnus CarlsenMagnus Carlsen feels that the young Indian talent, including D Gukesh, is unlikely to replicate the dominance he has shown in the sport at the moment. Carlsen secured the Norway Chess title on Friday, June 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/los-angeles-downtown-immigration-raids-ice-protests-clashes-lapd-tear-gas-videos-2737204-2025-06-07",
      "headline": "Raids, tear gas, arrests: Los Angeles streets erupt over immigration crackdownHundreds of protesters gathered outside the Los Angeles Federal Building condemning the immigration raids. During the standoff, some protesters hurled chunks of broken concrete at officers, who responded with tear gas, pepper spray and flash-bang grenades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/techie-quits-toxic-firm-after-manager-blames-his-marriage-and-fathers-death-for-project-delays-2737275-2025-06-07",
      "headline": "Techie quits toxic firm after manager blames his marriage, father's death for delaysA techie's resignation post has gone viral after he revealed his manager blamed his wedding and father's death for project delays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sedated-woman-raped-hospital-staff-icu-alwar-rajasthan-2737185-2025-06-07",
      "headline": "32-year-old woman in ICU sedated, then raped by hospital staff in RajasthanA 32-year-old woman was allegedly raped by a nursing staff at a medical college ICU in Alwar after being sedated. The hospital administration reportedly tried to suppress the incident until police action was initiated.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/this-volcano-on-mars-is-taller-than-mount-everest-pictures-inside-2737244-2025-06-07",
      "headline": "Volcano on Mars taller than Mount Everest pictured from spaceArsia Mons, the southernmost of the Tharsis Montes trio, stands at an awe-inspiring 20 kilometers high, dwarfing Earth's tallest volcano, Mauna Loa, which rises 9 kilometers above the seafloor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-military-recovers-body-of-thai-hostage-held-in-gaza-since-october-7-attack-2737255-2025-06-07",
      "headline": "Israeli military recovers body of Thai hostage held in Gaza since October 7 attackPinta's body was held by a Palestinian militant group called the Mujahedeen Brigades, and was retrieved from the area of Rafah in southern Gaza, Katz said."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-lions-vs-india-a-2nd-unofficial-test-day-2-live-score-and-updates-2737268-2025-06-07",
      "headline": "Lions vs India A, Day 2, Live: Kotiyan falls to Josh Tongue earlyEngland Lions vs India A, 2nd Unofficial Test, Day 2 Live Updates: Tanush Kotiyan falls after hitting two lovely boundaries against Josh Tongue. India A are hoping to cross the 350-run mark at Northampton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-mens-singles-final-carlos-alcaraz-vs-jannik-sinner-key-stats-roland-garros-2737267-2025-06-07",
      "headline": "Sinner vs Alcaraz French Open final set to be historic as big 3 era slowly endsJannik Sinner and Carlos Alcaraz are all set to create history at the French Open 2025 when they face off in the final on Sunday, June 8. Alcaraz will be aiming to defend his title while Sinner will look to claim his first crown at Roland Garros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-reaction-d-gukesh-arjun-erigaisi-2737241-2025-06-07",
      "headline": "D Gukesh unlikely to replicate my dominance at the moment: Magnus CarlsenMagnus Carlsen feels that the young Indian talent, including D Gukesh, is unlikely to replicate the dominance he has shown in the sport at the moment. Carlsen secured the Norway Chess title on Friday, June 6. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/karnataka-cricket-bodys-secretary-and-treasurer-quit-amid-bengaluru-stampede-probe-2737214-2025-06-07",
      "headline": "Karnataka cricket body's secretary and treasurer quit amid Bengaluru stampede probeThe Karnataka Cricket Association's secretary and treasurer have resigned following the Bangalore stampede tragedy. Both officials were named in the FIR and were initially missing when the investigation began. They cited limited roles in the event but resigned due to moral responsibility. The High Court had previously granted them protection from coercive action. Investigations into the incident are ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newells-youth-players-suspended-rosario-photo-2737211-2025-06-07",
      "headline": "Messi's boyhood club suspends 9-year-olds for photo with rival team playerSeveral Newell's youth players were suspended for posing with rival Rosario Central footballer Ignacio Malcorra. The harsh punishment has sparked public outrage and criticism from national figures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-misses-rohit-sharma-shubman-gill-india-test-captain-england-series-2024-2737206-2025-06-07",
      "headline": "Video: Rishabh Pant misses Rohit Sharma as India players arrive in EnglandRishabh Pant shares a humorous take on missing Rohit Sharma ahead of England Tests. Shubman Gill steps in as India's new Test captain, signalling a fresh leadership era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-novak-djokovic-touches-court-roland-garros-farewell-2737203-2025-06-07",
      "headline": "Watch: Emotional Novak Djokovic touches clay court in potential French Open farewellAn emotional Novak Djokovic touched the clay court at Roland Garros, hinting at a potential French Open farewell after his semi-final loss to Jannik Sinner on Friday, June 6. Djokovic said he was unsure of returning for the tournament next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ipl-test-cricket-andre-russell-2737174-2025-06-07",
      "headline": "IPL 5 levels below Test cricket? Russell disagrees with Kohli's commentWest Indies all-rounder Andre Russell has diasgreed with Virat Kohli's recent comments about IPL being 5 levels below Test cricket. Responding to the comment, Russell highlighted the pay disparities affecting West Indies players' interest in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-bengaluru-stampede-ksca-officials-resign-rcb-2737172-2025-06-07",
      "headline": "Karnataka cricket board officials quit, take moral responsibility for stampedeThe Karnataka State Cricket Association (KSCA) secretary A Shankar and treasurer E Jairam have decided to resign from their post after owning moral responsiibility for the Bengaluru stampede on Saturday, June 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-tottenham-hotspur-ange-postecoglou-sack-statement-2737164-2025-06-07",
      "headline": "Postecoglou breaks silence after Tottenham sack, says he views tenure with prideAnge Postecoglou broke his silence after being sacked by Tottenham Hotspur on Friday, June 6. The Australian guided Spurs to their first title in 17 years with the Europa League win last season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-d-gukesh-loss-magnus-carlsen-fabiano-caruana-2737156-2025-06-07",
      "headline": "Watch: Heartbroken D Gukesh buries head in hands after decisive Norway Chess game lossA heartbroken D Gukesh covered his face with his hands after losing to Fabiano Caruana in a crucial tie in the Norway Chess tournament on Friday, June 6. Gukesh's loss helped Carlsen walk away with the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-novak-djokovic-touches-court-roland-garros-farewell-2737203-2025-06-07",
      "headline": "Watch: Emotional Novak Djokovic touches clay court in potential French Open farewellAn emotional Novak Djokovic touched the clay court at Roland Garros, hinting at a potential French Open farewell after his semi-final loss to Jannik Sinner on Friday, June 6. Djokovic said he was unsure of returning for the tournament next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ipl-test-cricket-andre-russell-2737174-2025-06-07",
      "headline": "IPL 5 levels below Test cricket? Russell disagrees with Kohli's commentWest Indies all-rounder Andre Russell has diasgreed with Virat Kohli's recent comments about IPL being 5 levels below Test cricket. Responding to the comment, Russell highlighted the pay disparities affecting West Indies players' interest in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-bengaluru-stampede-ksca-officials-resign-rcb-2737172-2025-06-07",
      "headline": "Karnataka cricket board officials quit, take moral responsibility for stampedeThe Karnataka State Cricket Association (KSCA) secretary A Shankar and treasurer E Jairam have decided to resign from their post after owning moral responsiibility for the Bengaluru stampede on Saturday, June 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-tottenham-hotspur-ange-postecoglou-sack-statement-2737164-2025-06-07",
      "headline": "Postecoglou breaks silence after Tottenham sack, says he views tenure with prideAnge Postecoglou broke his silence after being sacked by Tottenham Hotspur on Friday, June 6. The Australian guided Spurs to their first title in 17 years with the Europa League win last season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-d-gukesh-loss-magnus-carlsen-fabiano-caruana-2737156-2025-06-07",
      "headline": "Watch: Heartbroken D Gukesh buries head in hands after decisive Norway Chess game lossA heartbroken D Gukesh covered his face with his hands after losing to Fabiano Caruana in a crucial tie in the Norway Chess tournament on Friday, June 6. Gukesh's loss helped Carlsen walk away with the title. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}