{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/two-new-gst-levies-health-and-clean-energy-may-replace-compensation-cess-but-at-what-cost-2744140-2025-06-21",
      "headline": "Two new GST levies may replace compensation cess, but at what cost?Health and Clean Energy levies may replace the Compensation Cess, but tax experts warn of rising compliance burdens and fresh coordination challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-tere-naam-look-was-inspired-by-apj-abdul-kalam-2744267-2025-06-21",
      "headline": "Salman Khan's Tere Naam look was inspired by APJ Abdul KalamActor Salman Khan revealed that his look in 'Tere Naam' was inspired by Dr APJ Abdul Kalam. He made this revelation during his appearance on the new season of 'The Great Indian Kapil Show'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-drishyam-3-eyes-october-2025-release-2744242-2025-06-21",
      "headline": "Mohanlal announces Drishyam 3, eyes October 2025 releaseThe much-anticipated 'Drishyam 3', starring Mohanlal, has been announced. The actor shared the announcement on June 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaalidhar-laapata-trailer-abhishek-bachchan-slice-of-life-film-is-soul-stirring-2744218-2025-06-21",
      "headline": "Kaalidhar Laapata trailer: Abhishek Bachchan seeks joy in slice-of-life filmAfter 'Housefull 5', actor Abhishek Bachchan is set to surprise fans with a new avatar in his upcoming film 'Kaalidhar Laapata'. The trailer for the film, which will premiere on Zee5, was released on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/lataa-saberwal-announces-separation-from-husband-sanjeev-seth-2744211-2025-06-21",
      "headline": "Yeh Rishta... actor Lataa Saberwal announces separation from husband Sanjeev SethTV actor Lataa Saberwal has announced her separation from her actor-husband Sanjeev Seth. The duo met on the sets of 'Yeh Rishta Kya Kehlata Hai' and got married in 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-on-his-wedding-ceremony-with-lin-laishram-was-given-a-bowl-to-pee-2744201-2025-06-21",
      "headline": "Was given a bowl to pee: Randeep Hooda on his wedding ceremony with Lin LaishramActor Randeep Hooda shared the nuances of his traditional Manipuri wedding ceremony with Lin Laishram. The actor recalled that he was given a bowl to pee during the ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-final-moments-show-paramedics-giving-cpr-helicopter-on-field-polo-match-2744195-2025-06-21",
      "headline": "Sunjay Kapur's final moments: CPR attempted after heart attack during polo matchBusinessman and Karisma Kapoor's ex-husband, Sunjay Kapur, died of a heart attack during a polo match in England. His funeral was held in New Delhi, with family and friends in attendance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-shares-sweet-birthday-wish-for-mother-nirmala-with-cute-pic-2744194-2025-06-21",
      "headline": "Allu Arjun shares sweet birthday wish for mother Nirmala with cute picTollywood actor Allu Arjun wished his mother, Nirmala Allu, on her birthday on Saturday. Along with the note, he posted an adorable picture of himself with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/28-years-later-review-danny-boyle-proves-third-times-a-charm-in-this-zombie-follow-up-2744149-2025-06-21",
      "headline": "28 Years Later review: Danny Boyle proves third time's a charm in this zombie follow-upReleased-Fri Jun 20, 2025'28 Years Later', the third installment in the franchise, brings fresh energy to the zombie genre with a gripping story. Danny Boyle's direction and strong performances make it a thrilling watch that honours the legacy of the original '28 Days Later'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vir-das-praises-aamir-khan-sitaare-zameen-par-urges-fans-to-watch-2744145-2025-06-21",
      "headline": "Vir Das urges fans to watch Aamir Khan's Sitaare Zameen Par, calls it breezyJoining critics, viewers, and fellow celebrities, actor-comedian Vir Das has added his voice to the growing praise for Aamir Khan's 'Sitaare Zameen Par'. The film, which released in theatres on Friday, has already become a major talking point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sanam-saeed-mohib-mirza-welcome-baby-boy-vali-hasan-2744111-2025-06-21",
      "headline": "Pakistani actors Sanam Saeed-Mohib Mirza welcome baby boy Vali HasanPakistani actor Sanam Saeed, best known for her role in 'Zindagi Gulzar Hai', welcomed her first child with her actor-husband Mohib Mirza. She shared the name of her baby boy on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-emotional-birthday-wish-for-husband-shoaib-ibrahim-2744096-2025-06-21",
      "headline": "Dipika Kakar's emotional birthday wish for husband ShoaibActor Dipika Kakar shared a heartfelt note on the occasion of her actor-husband Shoaib Ibrahim's birthday. She thanked him for walking through the best and worst times, and staying by her side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-named-brand-ambassador-for-world-para-athletics-championship-2744107-2025-06-21",
      "headline": "Kangana Ranaut named brand ambassador for World Para Athletics, expresses prideActor and politician Kangana Ranaut has been named as the official Brand Ambassador for the World Para Athletics Championships. In a heartwarming speech, she expressed gratitude and pride. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-new-look-with-moustache-breaks-internet-fans-demand-comeback-2744078-2025-06-21",
      "headline": "Govinda's new look with moustache breaks internet, fans demand comebackBollywood actor Govinda is creating quite a stir online with his latest photos, debuting a fresh new look. While many speculated it might be for an upcoming film, fans also took the opportunity to urge the star to return to the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/international-yoga-day-2025-shilpa-shetty-to-hina-khan-celebs-share-inspiring-posts-2744070-2025-06-21",
      "headline": "International Yoga Day 2025: Shilpa Shetty to Hina Khan, celebs share postsOn International Yoga Day 2025, actors including Hina Khan, Shilpa Shetty, Anupam Kher and Nimrat Kaur, shared uplifting social media posts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-suga-apologises-to-fans-in-1st-instagram-post-after-military-service-addresses-past-controversy-2744055-2025-06-21",
      "headline": "BTS's Suga apologises to fans in 1st Instagram post, addresses past controversyBTS member Suga has completed his social service and shared a heartfelt message with fans expressing gratitude and remorse over a past incident. He reflected on his time away as a period of self-introspection and pledged to work harder to repay the love and support of the ARMY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fading-echoes-why-hindi-cinema-struggles-to-honour-its-musical-legends-on-screen-2743502-2025-06-21",
      "headline": "Fading echoes: Why Hindi cinema struggles to honour its musical legends on-screenWhy have Bollywood filmmakers not been able to create musical biopics like other genres? Despite the immensely talented composers and singers of yesteryear's cinema, we don't have any musical adaptation at par with Western musicians. On Cinematic Saturday, we reflect on why Indian storytellers are missing out on the musical legacies of cinema's maestros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-day-1-dhanush-nagarjuna-film-opens-strong-with-rs-13-crore-2744043-2025-06-21",
      "headline": "Kuberaa box office Day 1: Dhanush, Nagarjuna's film opens strong with Rs 13 crore'Kuberaa' released in theatres on June 20, starring Dhanush, Rashmika Mandanna and Nagarjuna. The Telugu crime-thriller opened to great reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-day-1-aamir-khan-film-starts-decent-earns-rs-115-crore-2744034-2025-06-21",
      "headline": "Sitaare Zameen Par box office Day 1: Aamir Khan's film off to a brilliant startSitaare Zameen Par box office collection Day 1: Aamir Khan made a strong comeback with the RS Prasanna directorial on June 20. The film, a spiritual sequel to the 2007 hit, had a decent opening at the domestic box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/prosenjit-chatterjee-on-sitaare-zameen-pars-cinema-only-move-aamir-can-take-risk-2743891-2025-06-20",
      "headline": "Prosenjit Chatterjee on Sitaare Zameen Par's cinema-only move: Aamir can take riskActor Prosenjit Chatterjee, in an exclusive interaction, reacted to Aamir Khan's decision to ditch OTT and release 'Sitaare Zameen Par' in theatres. He said that such kind of changes are important. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/will-target-ships-in-red-sea-if-us-joins-israel-in-attacks-on-iran-houthis-issue-warning-to-washington-2744301-2025-06-21",
      "headline": "Will target ships in Red Sea if US joins Israel in attacks on Iran, say HouthisYemen's Houthis threatened to attack US ships in the Red Sea if the United States waded into the over-week-long Israel-Iran conflict and supported the Jewish nation in its attacks on the Islamic Republic."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chennai-bound-indigo-flight-declared-fuel-mayday-diverted-to-bengaluru-sources-2744248-2025-06-21",
      "headline": "Chennai-bound IndiGo flight declared fuel Mayday, diverted to Bengaluru: SourcesA Chennai-bound IndiGo flight, which took off from Guwahati, was forced to divert to Bengaluru after the pilot declared Mayday due to low fuel, sources said. The plane was refuelled in Bengaluru and then took off for Chennai and landed there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-an-ideal-democratic-government-khawaja-asif-praises-pak-hybrid-model-2744312-2025-06-21",
      "headline": "Not an ideal democratic government: Khawaja Asif praises Pak's hybrid modelThis is the second time this week that Pakistan's Defence Minister Khawaja Asif, a prominent member of the incumbent Prime Minister Shehbaz Sharif cabinet, admitted to the hybrid model, criticised as not mixed but a \"fixed government to serve subsidiary interests\" by analysts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-jasprit-bumrah-rishabh-pant-shubman-gill-ollie-pope-2744330-2025-06-21",
      "headline": "ENG vs IND, 1st Test: Bumrah wages lone battle after India collapse on Day 2England dominated the proceedings on Day 2 of the first Test match against India at Headingley, Leeds as they first bundled out India for 471 and later finished on 209/3 at stumps. Jasprit Bumrah emerged as the lone warrior for India with the ball, registering figures of 3/48."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ranthambore-iconic-tigress-arrowhead-final-walk-viral-video-2744091-2025-06-21",
      "headline": "Photographer shares video of Ranthambore's iconic tigress Arrowhead's final walkIn an emotional post on Instagram, a wildlife photographer shared a video of Ranthambore's iconic tigress Arrowhead's final walk. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/iran-evacuated-kashmiri-students-stranded-srinagar-bus-breaks-down-five-times-pathankot-highway-2744228-2025-06-21",
      "headline": "Evacuated from Iran, stranded in Punjab: Bus carrying Indians breaks down 5 timesA bus carrying Kashmiri students returning from war-hit Iran broke down five times en route to Srinagar, leaving them stranded on the Pathankot highway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-ali-khamenei-names-potential-successors-in-case-he-is-killed-report-glbs-2744341-2025-06-22",
      "headline": "Ayatollah Ali Khamenei names potential successors in case he is killed: ReportIran's Supreme Leader Ayatollah Khamenei has named three potential successors to ensure a smooth transition after his death, aiming to preserve Iran's stability amid rising tensions with Israel, The New York Times reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-rules-out-halting-nuclear-activities-amid-escalating-conflict-with-israel-glbs-2744345-2025-06-22",
      "headline": "Iran rules out halting nuclear activities amid escalating conflict with IsraelIran vows not to halt nuclear activities amid escalating conflict with Israel, despite strikes on nuclear sites. Diplomatic efforts stall as casualties rise, and internet access remains severely restricted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/8-dead-after-hot-air-balloon-carrying-21-passengers-catches-fire-in-brazil-2744290-2025-06-21",
      "headline": "8 dead, 13 injured as hot air balloon catches fire in BrazilA hot-air balloon carrying 21 people crashed in Santa Catarina, Brazil, killing 8 and injuring 13. The balloon caught fire mid-flight before crashing in Praia Grande.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/hosur-elevated-flyover-tamil-nadu-lateral-shift-vehiclular-movement-bengaluru-stopped-2744294-2025-06-21",
      "headline": "Elevated highway develops lateral shift, vehicular movement to Bengaluru stoppedThe Hosur elevated highway has been declared dangerous by officials after the structure developed a lateral shift. A team of experts will visit the site on Sunday and all vehicular movement to Bengaluru has been stopped."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/days-after-crash-aviation-body-orders-air-india-to-remove-3-officials-for-serious-lapses-2744144-2025-06-21",
      "headline": "Air India gets notice over pilot duty norms after removal orders for 3 officialsAir India, which is battling a crisis following the AI171 crash in Ahmedabad on June 12, has been asked to remove three of its officials from crew scheduling responsibilities and got a show-cause notice for violating flight duty time limitations norms for the crew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-cites-privacy-legal-issues-congress-rahul-gandhi-demands-cctv-video-polling-booths-2744187-2025-06-21",
      "headline": "On Rahul Gandhi's CCTV footage demand, poll body cites privacy, legal issuesThe rebuttal by the Election Commission came amid repeated assertions by Rahul Gandhi that last year's Maharashtra election, which was won by the BJP-led Mahayuti, was rigged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-compares-rishabh-pant-and-ms-dhoni-leeds-2744299-2025-06-21",
      "headline": "Rishabh Pant well ahead of MS Dhoni in Tests: Manjrekar makes bold claimSanjay Manjrekar has backed Rishabh Pant as India's best wicketkeeper-batter in the longest format, surpassing even MS Dhoni. The former cricketer highlighted how Pant's impressive record when playing away from home puts him ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/namma-bike-taxi-association-karnataka-ban-bengaluru-legal-framework-auto-unions-2744227-2025-06-21",
      "headline": "Over 5,000 bike taxi riders rally in Bengaluru demanding rollback of banOver 5,000 bike taxi riders from eight districts of Karnataka rode to Bengaluru, staging a protest against the blanket ban on bike taxis across the state and demanding the government reverse its decision."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-criticism-within-nobel-peace-prize-donald-trump-india-kashmir-2744170-2025-06-21",
      "headline": "'Zero dignity': Pak faces brickbats within and outside over Trump Nobel proposalSeveral Pakistani activists and authors took to social media to slam Pakistan, reminding the government of Donald Trump's support to the 'genocidal war' in Gaza and Israel's bombing of Iran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-of-india-rejects-polling-footage-release-voter-privacy-2744313-2025-06-21",
      "headline": "Cameras, courts and confidentiality: Inside Election Commission's 45-day ruleThe Election Commission has ruled out releasing polling station footage publicly, citing voter privacy as paramount. Such footage is only accessible under court orders to protect the secrecy of voting.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/your-next-roommate-might-be-a-robot-embodied-ai-home-revolution-2744119-2025-06-21",
      "headline": "Your next roommate might be a robot: How embodied AI is reimagining home lifeFrom vacuuming your floor to reading your mood robots are becoming the new family members. As artificial intelligence takes a physical form, your next room-mate might not be human but still know exactly how you like your coffee. In the race between convenience and companionship, embodied AI is quietly claiming space in our homes and hearts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-498-20-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-icc-black-sock-fine-explained-leeds-test-2744171-2025-06-21",
      "headline": "Why Shubman Gill could face ICC sanction over his black socksEngland vs India: India's new Test captain, Shubman Gill, may face ICC sanctions for wearing black socks on the opening day of the Leeds Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/ground-report-inside-missile-hit-betiam-israel-reels-from-iranian-strikes-2744262-2025-06-21",
      "headline": "Ground report: Inside missile-hit Betiam as Israel reels from Iranian strikesIndia Today's Shivani Sharma reports from missile-hit areas in Israel, showcasing the devastation in Betiam. A multi-story building damaged by an Iranian missile strike resulted in five fatalities. The report highlights cordoned-off areas, sirens warning of missile threats, and Prime Minister Netanyahu's stance on continuing operations. Damages are visible across multiple buildings and cities in Israel, with restricted access to affected areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-tere-naam-look-was-inspired-by-apj-abdul-kalam-2744267-2025-06-21",
      "headline": "Salman Khan's Tere Naam look was inspired by APJ Abdul KalamActor Salman Khan revealed that his look in 'Tere Naam' was inspired by Dr APJ Abdul Kalam. He made this revelation during his appearance on the new season of 'The Great Indian Kapil Show'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-slams-pm-modi-make-in-india-manufacturing-china-profits-2744072-2025-06-21",
      "headline": "Assemble as many iPhones but...: Rahul Gandhi's 'stark truth' on 'Make In India'Rahul Gandhi, during his visit to Nehru Place, Delhi's largest electronics market, suggested that electronic parts were being imported and 'assembled in India' and not being built here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-live-updates-tel-aviv-tehran-donald-trump-white-house-missiles-drones-2743961-2025-06-20",
      "headline": "Live: US moves B-2 bombers to Guam amid escalating Middle East tensionsIsrael-Iran Conflict Live Updates: The Israel-Iran conflict showed no signs of stopping as the long-time enemies fired missiles and drones at each other on the ninth day.\r\nThe United States is moving B-2 bombers to the Pacific island of Guam, two US officials told Reuters on Saturday, as President Donald Trump weighs whether the US should take part in Israel's strikes against Iran.\r\nIran launched a missile barrage into Israel early this morning, triggering air raid sirens and sending millions into bomb shelters, though no casualties have been reported. In response, Israel continued targeting military sites across Iran.\r\nMeanwhile, Iranian President Masoud Pezeshkian declared on Saturday that Tehran will not halt its nuclear activities \"under any circumstances,\" even as Israeli airstrikes hit nuclear infrastructure and regional tensions intensify. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-inter-caste-marriage-family-members-forced-shave-heads-purification-ritual-2744239-2025-06-21",
      "headline": "Odisha: 40 family members forced to tonsure heads after inter-caste marriageThe incident happened after a woman, from a Scheduled Tribe (ST) community, married a man belonging to a Scheduled Caste from a neighbouring village in Odisha."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-ipl-celebrations-rules-devajit-saikia-security-protocols-strict-2744337-2025-06-22",
      "headline": "BCCI to enforce strict rules, security for IPL celebrations: Devajit SaikiaAfter the tragic Bengaluru stampede during RCB's IPL celebrations, BCCI secretary Devajit Saikia confirmed strict new rules will be enforced for future victory parades to ensure public safety and prevent any such mishap again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-jasprit-bumrah-rishabh-pant-shubman-gill-ollie-pope-2744330-2025-06-21",
      "headline": "ENG vs IND, 1st Test: Bumrah wages lone battle after India collapse on Day 2England dominated the proceedings on Day 2 of the first Test match against India at Headingley, Leeds as they first bundled out India for 471 and later finished on 209/3 at stumps. Jasprit Bumrah emerged as the lone warrior for India with the ball, registering figures of 3/48."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-hides-his-face-in-frustration-as-jaiswal-drops-ollie-pope-2744319-2025-06-21",
      "headline": "Jasprit Bumrah hides face in frustration as Jaiswal drops Ollie PopeIndia fast bowler Jasprit Bumrah was seen hiding his face in frustration after Yashasvi Jaiswal dropped Ollie Pope during the last session on Day 2 of the second Test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sourav-ganguly-india-win-headingley-test-leeds-2744305-2025-06-21",
      "headline": "Sourav Ganguly urges India to go all-out and win 1st Test vs EnglandENG vs IND: Sourav Ganguly feels India should have gone on to score 600 runs in the first innings. Nonetheless, he wants the Indian team to go all-out and take the win, considering their impressive start with the bat in Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-dissects-rishabh-pants-clever-strategy-behind-paddle-sweep-2744311-2025-06-21",
      "headline": "Sachin Tendulkar dissects Rishabh Pant's clever strategy behind paddle sweepLegendary India batter Sachin Tendulkar dissected Rishabh Pant's clever paddle sweep strategy, following his remarkable century against England on Day 2 of the first Test in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-angelo-mathews-favorite-moments-england-australia-2744302-2025-06-21",
      "headline": "Beating England, Australia: Mathews picks top Test memories after goodbyeAngelo Mathews marked the end of his Test career by picking Sri Lanka's 2014 series win in England and the 2016 whitewash of Australia as the proudest moments of his 15-year red-ball journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-compares-rishabh-pant-and-ms-dhoni-leeds-2744299-2025-06-21",
      "headline": "Rishabh Pant well ahead of MS Dhoni in Tests: Manjrekar makes bold claimSanjay Manjrekar has backed Rishabh Pant as India's best wicketkeeper-batter in the longest format, surpassing even MS Dhoni. The former cricketer highlighted how Pant's impressive record when playing away from home puts him ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-1st-test-sri-lanka-hold-on-for-draw-after-shanto-slams-twin-centuries-2744293-2025-06-21",
      "headline": "SL vs BAN 1st Test: Sri Lanka hold on for draw after Shanto slams twin centuriesSri Lanka held on for a draw on Day 5 of the first Test against Bangladesh in Galle after Najmul Hossain Shanto slammed twin hundreds in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sl-vs-ban-najmul-hossain-shanto-history-multiple-twin-centuries-galle-2744260-2025-06-21",
      "headline": "SL vs BAN: Shanto creates history, joins list with multiple twin tons in TestsNajmul Hossain Shanto finds himself in a rare list of players who have recorded multiple instances of twin centuries in Test cricket. He was in form with the bat as Bangladesh went on to secure a draw against Sri Lanka at Galle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-dismissed-for-duck-on-test-return-after-eight-years-2744236-2025-06-21",
      "headline": "ENG vs IND: Karun Nair dismissed for duck on Test return after eight yearsIndia batter Karun Nair was dismissed for a duck on his comeback to the Indian Test team after eight years on Day 2 of the first Test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-reaction-rishabh-pant-hundred-headingley-leeds-2744232-2025-06-21",
      "headline": "Rishabh Pant wins back Gavaskar with Leeds hundred: Superb, superb, superbENG vs IND: Sunil Gavaskar's reaction after Rishabh Pant's century went viral. The former cricketer came up with a quip that is a play on the iconic 'stupid, stupid, stupid' for the wicketkeeper batter and his antics on the field. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-compares-rishabh-pant-and-ms-dhoni-leeds-2744299-2025-06-21",
      "headline": "Rishabh Pant well ahead of MS Dhoni in Tests: Manjrekar makes bold claimSanjay Manjrekar has backed Rishabh Pant as India's best wicketkeeper-batter in the longest format, surpassing even MS Dhoni. The former cricketer highlighted how Pant's impressive record when playing away from home puts him ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-1st-test-sri-lanka-hold-on-for-draw-after-shanto-slams-twin-centuries-2744293-2025-06-21",
      "headline": "SL vs BAN 1st Test: Sri Lanka hold on for draw after Shanto slams twin centuriesSri Lanka held on for a draw on Day 5 of the first Test against Bangladesh in Galle after Najmul Hossain Shanto slammed twin hundreds in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sl-vs-ban-najmul-hossain-shanto-history-multiple-twin-centuries-galle-2744260-2025-06-21",
      "headline": "SL vs BAN: Shanto creates history, joins list with multiple twin tons in TestsNajmul Hossain Shanto finds himself in a rare list of players who have recorded multiple instances of twin centuries in Test cricket. He was in form with the bat as Bangladesh went on to secure a draw against Sri Lanka at Galle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-dismissed-for-duck-on-test-return-after-eight-years-2744236-2025-06-21",
      "headline": "ENG vs IND: Karun Nair dismissed for duck on Test return after eight yearsIndia batter Karun Nair was dismissed for a duck on his comeback to the Indian Test team after eight years on Day 2 of the first Test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sunil-gavaskar-reaction-rishabh-pant-hundred-headingley-leeds-2744232-2025-06-21",
      "headline": "Rishabh Pant wins back Gavaskar with Leeds hundred: Superb, superb, superbENG vs IND: Sunil Gavaskar's reaction after Rishabh Pant's century went viral. The former cricketer came up with a quip that is a play on the iconic 'stupid, stupid, stupid' for the wicketkeeper batter and his antics on the field. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}